[
    {
        "title": "Question about pay and benefits",
        "author": "VioletViola",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3lc78d/question_about_pay_and_benefits/",
        "text": "So I am not sure about this, and was hoping some legal-minded pizza guys would be able to help me. For my position at Dominos, the handbook states starting pay is $9.25 an hour. I make $9. It says we are eligible for health 80% paid by the company, and dental at 50% paid by the company. Haven't been offered anything. I just want to know what my options are when I talk to my boss about this. Any advice for bringing it up? Thanks in advance!",
        "created_utc": 1442517733,
        "upvote_ratio": ""
    },
    {
        "title": "Got fired from a corporate store, is a franchise fair game?",
        "author": "rat-butter",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3lapth/got_fired_from_a_corporate_store_is_a_franchise/",
        "text": "Do franchise and corporate stores share employee databases/blacklists?\n\nsorry if this is the wrong subreddit but I don't know where else to ask",
        "created_utc": 1442494774,
        "upvote_ratio": ""
    },
    {
        "title": "Got stiffed because I called twice when I got there.",
        "author": "RedditIsFullOfJerks",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3laj2b/got_stiffed_because_i_called_twice_when_i_got/",
        "text": "So last night a regular placed an order and as usual the delivery notes say to call her cell number when I get there, I know the drill and by now I have her number saved in my phone because she orders just about every night I work. \n\nSo as I'm pulling into her place of work (which you need a key card to enter) I call her and wait. Now usually it will ring once and she ignores the call so it goes straight to voice mail and then I know she's atleast on her way. But this time it rang for a while and then went to voice mail (which has not been set up). \n\nI think its odd but what ever, I wait about a minute and a half before coming to the conclusion that she must not have heard it go off. So I call again and same thing happened. Weird, it never takes this long.\n\nThen I wait about another minute and decided to call the place of business and as it's connecting she finally shows up.\n\nI get out and give her the standard greeting and she kind of launches into a hurried rant about how we should know by now that when she doesn't answer it means she's on her way (funny how I can get confused with how thats supposed to work right? Its pretty similar to what happens when someone misses a call...). \n\nNow I'm pretty slow sometimes to get what's going on in a situation especially after a long day like yesterday, so I had no idea she was actually pissed off about it. At the moment I genuinely felt bad and apologized and said that I will keep that in mind for next time (even though I only called her cell phone twice). I gave her the CC slip to sign and she signs it pretty quick, we exchange the CC slip for the food, I tell her to have a great night, and I head back to my car. \n\nThen I look at the slip and all she did was sign it. Then I replay the entire situation back in my head. Apparently she was pretty pissed because I called twice. It took her ~2.5 - 3 minutes to come to the freaking door. And she was pissed about it enough to stiff me. I know her habits, and while she's not a great tipper by any means, she always tips.\n\nI always try to be polite and courteous. I even try to see it from their perspective to understand why they might feel that way. But the only thing I can think of is that she was already in a shit mood and decided to take it out on a delivery driver, which is unacceptable no matter how you slice it.\n\nSo now I have a new rule for her. I call once. When the clock hits 5 minutes after that call I'd made I go back to the shop with the food for a no show. Because cthulu forbid if I call twice again.",
        "created_utc": 1442490892,
        "upvote_ratio": ""
    },
    {
        "title": "Unkempt gardens and broken gates",
        "author": "donttalktrp",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3laf68/unkempt_gardens_and_broken_gates/",
        "text": "From shared houses to film star style ranches, my customers vary greatly, and they all love Thai.  \n\nI do not wish to generalise the take-out buying public, only I have seen a pattern emerge.  \n\nA higher than expected percentage of my customers have un-mown front lawns or broken fences/gates.  \n\nYes, I could be over thinking this.  \n\nOne thing I can tell you is this: Driving down a row of houses where I have to stop and start looking for house numbers, I try and start with the scruffiest house. This works far too often!  \n\nIs there really a trait? Too lazy to cook - Too lazy to mow?  \n ",
        "created_utc": 1442488279,
        "upvote_ratio": ""
    },
    {
        "title": "So, I was asked to be a manager after barely a month of working at my new job...",
        "author": "Scaredy__Cat",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3l8g9j/so_i_was_asked_to_be_a_manager_after_barely_a/",
        "text": "I am absolutely crazy for saying yes to it. But it means more money, so I kind of had to. I'm not going to say which pizza place it is, of course, and I made a whole new account just to post this here, because I didn't want my main account associated with what I'm about to say. \n\nI am scared shitless. And I'm sorry if this is the place for it, I don't really feel like people would get it if I posted to offmychest or cofession or even just to self. Pizza people hopefully will have some words of encouragement, some understanding, maybe of the world of pizza, others who don't work in pizza would be able to offer, you know? \n\nSo I started right at the end of July/beginning of August. August was barely over when the GM and AM pulled me aside, and asked if I wanted to be a manager. And I know these two, and knew half of the store before I started working there. But it isn't any sort of nepotism since I've known them for so long, I'm good at what I had been doing up to that point, which was phone and counter stuff and stocking. But then I said yes, and I had to learn everything else. \n\nOven tending? It's okay, as long as I don't actually do it. My wrist was already fucked up from Carpal Tunnel Syndrome, cutting pizza hasn't helped with that. \n\nMakeline? It's fine, somewhat, as long as it's not busy and I have the damn time to read the charts on the wall for whatever. Fuck customers who order the shit no one else ever orders. Thank god those only come around once a week, if that. At least I have pep memorized for a large, whether it's just pep or a specialty. Last night, I forgot to put cheese on a pizza before I sent it through the oven. Rookie mistake. But honestly it was because another manager told me he was told that now that I went over the basics of everything, I would be closing five days in a row next week. So that was on my mind, and my anxiety was through the freakin roof. \n\nI went over how to do dough. Fuck that shit. I know with practice I will get better, and it won't be so bad maybe. But the way they say to hold your hands to edge lock, holy shit, does that hurt my wrist! I'd rather make a million pepperoni pizzas than do that dough. Not sure if I'll ever be able to slap right either. Fuck slapping out a XL, my arms are too damn short for that! \n\nI guess maybe I needed to rant and vent a little, I hope this sub was a safe place to do so. \n\nBut honestly, I am so incredibly worried that as a manager I will fail. Massive crash and burn. I'm in my 30's though, I can't fail. \n\nBut I can't sleep because of the anxiety over it, and when I do, I dream about that damn store and fucking up. \n\nI've never had those \"naked while on stage at school/surprise test and no pencil\" type dreams that everyone says are common and that everyone has. Until now. But it's with pizza instead of school. \n\nI'm really not sure I can do this. \n\nThanks for reading if you did. And if this isn't appropriate for the sub, I'll remove it. \n\nTL;DR: massive anxiety over failing at my job. ",
        "created_utc": 1442445307,
        "upvote_ratio": ""
    },
    {
        "title": "How do your hospitals tip?",
        "author": "iftreescouldspeak",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3l4zfp/how_do_your_hospitals_tip/",
        "text": "I feel like the whole hospital staff in my city to only tip $1 or nothing at all. So I could take 8 bags and only make $7 so I'm just curious about your guys hospitals tip!",
        "created_utc": 1442382587,
        "upvote_ratio": ""
    },
    {
        "title": "Boss is shorting our hours and not paying us",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3l4zf4/boss_is_shorting_our_hours_and_not_paying_us/",
        "text": "I started working at a pizza shop about 1.5 months ago so I received 3 paychecks so far. Every single one seemed really off, I calculated my hours for the two weeks and was definitely seeing at least 5 hours of work missing. I chalked it up as me miscalculating since we don't have set amount of hours we just clock off when he tells us to. I've started collecting my receipts that say exactly how many hours I've worked as evidence for my upcoming paycheck in unfortunately a month from now. I didn't keep track of the last two weeks very well, sort of, but no concrete evidence. \n\nEvery single paycheck is always off, I feel like I've put in so many hours but my paycheck that I was expecting about 62 hours on was a measly 49.50 hours. Bullshit. Unfortunately, I have no evidence. \n\nI was talking to one of the managers that works with me and asked her \n\n\"Hey, ____ do you ever notice your paychecks don't match up with the amount of hours you work?\" \n\nHer response\n\n\"Yes!!! ALL THE TIME.\" \n\nI clocked out shortly afterwards and now I'm home. \n\nWhat should I do? I pissed off because there's no way to prove I worked those hours and can only start tracking from now on. I hate thinking that I basically donated my time to this cheap piece of shit. \n\nI'm planning on confronting him when I have 2 weeks worth of evidence if my paycheck is once again short but I'm 100% sure that cheap ass will pull a \"Oh really?! I'll fix it\" \n\nI want to fuck him over as hard as possible legally because this is something I know he's doing to everyone. \n\n\n\nEDIT: Also! No fucking lunch breaks or any break whatsoever :)",
        "created_utc": 1442382576,
        "upvote_ratio": ""
    },
    {
        "title": "Love your cars.",
        "author": "RevClamJuice",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3l4q0m/love_your_cars/",
        "text": "I've just got to say, I love my car. My car makes my job possible and it really covers my ass. Here in North DFW it has helped me conquer some winter storms and beat the summer heat. For a 2005 Corolla with a manual transmission and 200k+ miles, it feels fantastic and I couldn't pick a better wingman. Yesterday I took it to the shop to get the transmission and power steering flushed and after they handed the key back to me it wouldn't start. My heart skipped a beat. Did they break it? It worked great before I brought it in. Fortunately the tech went over the car, identified the issue , and I was tearing up the pavement once again.\n\nPoint being, anyone else here got some stories about how great their vehicle is? Or just some words of praise for reliable vehicles? I've got a few if I catch an ear. :-)",
        "created_utc": 1442375875,
        "upvote_ratio": ""
    },
    {
        "title": "Didn't tip driver after frustrating delivery experience; was I an asshole?",
        "author": "DeweyCheatamAndHowe",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kyk6o/didnt_tip_driver_after_frustrating_delivery/",
        "text": "Not a pizza story but delivery:\n\nSo I'm a law student and attend evening courses so I depend a lot on delivery to eat in the short time between my classes.  Our law school is on the outskirts of campus and too far to walk to the student union or outside eateries so it's Jimmy Johns, pizza, or Chinese most nights.\n\nTonight I ordered Chinese through an online ordering system.  This establishment lets you input a delivery time or do \"as soon as possible\".  The ASAP ordering option usually quotes 1 hour from order time.  So, because I don't have an hour in between classes, I placed an order at 4:00 p.m. for a 5:00 delivery time, I also instructed them to please bring it to the student lounge at my school's address (Jimmy John's always complies with this).\n\nSo of course, while I'm in class my phone starts blowing up at 4:33 and it's the delivery girl.  So I have no choice but to pack up and leave class early since I've already been charged for the food.  I call back the number and of courser delivery girl cannot find the address so I have to meet her across campus, further than I would've walked if I just ate on campus.  It's a simple address to find and being that this place frequently delivers here, I find that hard to believe. I say on the phone \"pretty sure I made it for 5:00 p.m.\" and she says \"well I guess its a little early\" (then wtf is the point of selecting a delivery time???).\n\nI sign the slip and cross out tip and give it back.  I eat delivery because it's more convenient, when that convenience turns to frustration, I don't feel they deserve any extra gratuity.  \n\nDid I do the right thing or was I wrong?\n\n",
        "created_utc": 1442264965,
        "upvote_ratio": ""
    },
    {
        "title": "So you've decided to order pizza…",
        "author": "koavf",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kv6wb/so_youve_decided_to_order_pizza/",
        "text": "I wrote this thing that you might like: http://everything2.com/user/koavf/writeups/So+you%27ve+decided+to+order+pizza%E2%80%A6",
        "created_utc": 1442202015,
        "upvote_ratio": ""
    },
    {
        "title": "Connect With The Pizza Man Humboldt County.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kv3bo/connect_with_the_pizza_man_humboldt_county/",
        "text": "[deleted]",
        "created_utc": 1442200094,
        "upvote_ratio": ""
    },
    {
        "title": "Had an amazing night at work last night, just thought I'd share.",
        "author": "KodyBurns",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kt9iz/had_an_amazing_night_at_work_last_night_just/",
        "text": "My shift started at 5 and from then on out it was me taking 3 and 4 delivery runs until about 8 o'clock when it finally slowed down to about 2 deliveries per run.\n\nI don't know what it was about yesterday but I was getting EXTREMELY lucky with tips. More than half my deliveries tipped me 10 dollars or more, some even wrote tips on the tip line of their credit card slip AND gave me extra cash. That happened several times as well. Every customer was extremely kind and understanding if a delivery was a couple minutes past the quoted time, which only happened a couple times but still, I never expect to be greeted with a smile on a late delivery.\n\nI delivered to nothing but smiling faces, which in turn made me more happy and upbeat. \n\nThe best part about last night, and I wish I would've recorded this for a snapchat or something because it was absolutely hilarious...\n\nOne of the last deliveries of the night, I delivered to a home where it was a kid's birthday party. Immediately when I turn down the street a hoard of children come running up to my car yelling \"PIZZA!!!! Yeahhhh!!!!!\" \n\nIt took me a full minute to actually get to the house from the beginning of the street because they swarmed my car and followed me and were basically walking alongside me to the house. \n\nI get out of my car, and about 15 more kids run outside of the house, (now we're at about 25 or 30 kids surrounding my car, no exaggeration) and every single kid just starts screaming \"PIZZZZZAAAAAAA!!!!!\" \n\nI was laughing for the longest time, collected myself, found the dad in the crowd, and had him sign the slip. He looked visibly drained which was also funny. But he gave me a 10 dollar tip and I left with a huge smile on my face because it was all hilarious. \n\nAnyway, I haven't had such a genuinely good day at work where everything goes right in a very long time. Just wanted to share ",
        "created_utc": 1442169708,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not really sure what happened, but it was annoying.",
        "author": "kirokatashi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kn51o/im_not_really_sure_what_happened_but_it_was/",
        "text": "[removed]",
        "created_utc": 1442043948,
        "upvote_ratio": ""
    },
    {
        "title": "I don't want the pizza yet.",
        "author": "TheDoctorDi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kl4ro/i_dont_want_the_pizza_yet/",
        "text": "So... I am a delivery driver, and this just happened an hour ago. \n\nI'm sure many of you know that customers have the option to have their pizza come at a specific time as opposed to as soon as possible. When you submit the order online, it asks you for that info, or you may tell the rep over the phone. If you don't tell them, the drivers take it as it is ready. \n\nI went on a delivery an hour ago, and as I pulled onto the lady's street, at exactly 2:30, my phone rings. It's my boss, saying the lady just then called and wanted it delivered at three. I was three houses down and told him so. He called her, she confirmed. So I turned around in the driveway next to her house and took it back to the store so it could sit in the hot box for 15 minutes before delivering again. She was home, but just didn't want the pizza yet, but failed to say so when she ordered. \n\nWhat sort of person orders pizza then doesn't want it when it arrives, but when it's half an hour older?  -_-",
        "created_utc": 1442003371,
        "upvote_ratio": ""
    },
    {
        "title": "There's a first time for everything...",
        "author": "ThatOneGuy20",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kl4e6/theres_a_first_time_for_everything/",
        "text": "I've dealt with a lot in my three years on the job. I've had customers yell at me, throw things at me, flash me, offer me beer and drugs. I've been hugged, kissed, threatened. I've gotten tipped in some of the strangest ways, gift cards, beer, and other things. I've been rear ended 3 times, had people cut me off, stopped to help someone change a tire. At some point you start to think you've seen everything and have had everything (short of being robbed, knock on wood)...and then something like this happens.\n\nWednesday night I take a delivery to a set of apartments about 3 miles from the store. I've been there what feels like a million times. I know exactly what apartment it is and have delivered to the resident before. I walk up and knock. I exchange pleasantries with the customer and stand around while she goes to sign her card. \n\nI feel something brush my right leg, I look down and feel something on my left leg, I look down and like a poorly  written comedy it's back at my right. That's when I see the cause of the sensation. It's a tiny Dachshund puppy! Cute little guy! He sniffs around me for a little bit and I look back at the owner. I look down just in time to see this little bastard lift his tiny fucking leg and start to pee on my boot! \n\nNow I could have freaked out and shouted. I could have gotten mad. I didn't. I moved, stared that little fucker down as he ran into the apartment and just laughed it off with the customer. I went back to the store, washed the puppy piddle off my boot and went back to work. I guess not getting stiffed all night made it a little more bearable. My coworkers and family had a good laugh at my expense so at least I got a good story out of it. ",
        "created_utc": 1442003216,
        "upvote_ratio": ""
    },
    {
        "title": "Do you like delivering?",
        "author": "suomyn0na",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kl07h/do_you_like_delivering/",
        "text": "I'm 18, working fast food right now and it sucks. I'm tired of it and want a new job.\n\nI've been following this sub for a while and wondered how delivering is. Fun or nah? I love driving and listening to music so I thought this job would be ideal. I have a car that averages ~18mpg in city. Would that be fine?\n\nWhat kind of money do you make on average with tips? (Just in general, not on a good or bad day)\n\nIs delivering a seperate job from making the pizzas and all that, or do you do both on different days?",
        "created_utc": 1442001486,
        "upvote_ratio": ""
    },
    {
        "title": "Anybody deliver in NYC on 9/11 when it happened?",
        "author": "TheMainEvent2008",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kk6cb/anybody_deliver_in_nyc_on_911_when_it_happened/",
        "text": "I mean, obviously not right when it happened, but that day. Really would love to hear from anyone that was delivering there that day.",
        "created_utc": 1441989294,
        "upvote_ratio": ""
    },
    {
        "title": "Do pizza guys really know a lot of weed dealers? Please share your stories of delivering to people who were high as a mother!",
        "author": "laeiryn",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kijsp/do_pizza_guys_really_know_a_lot_of_weed_dealers/",
        "text": "So a stoner friend told me the other day that \"when you move to a new town and don't know any dealers, ask the pizza guy, because they always know someone!\" \n\nNow, I'm waiting for my medical card to come through so I'm 100% legal, but I still have to know: is this true? \n\nAnd on a very related note: How many stoners do you deliver to at 2 am? Have you ever been tipped in drugs? PLEASE share insane tales, as I would love to hear them!",
        "created_utc": 1441956272,
        "upvote_ratio": ""
    },
    {
        "title": "Response to \"Dear customers...\"",
        "author": "culesamericano",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kgk5n/response_to_dear_customers/",
        "text": "From a customer's stand point, whenever I order pizza, i go the whole 9 yards in preparation. i got the paper napkins ready, glass of coke. phone, landline, google voice and beeper ready. im waiting outside by the gate with a banner saying \"pizza delivery guy is my hero\" \n\nalso i've never forgotten a pizza delivery cuz thats the only thing on my mind at that point. \n\nsorry for all the shitty customers, but i like pizza before it was cool *pushes up hipster glasses*",
        "created_utc": 1441920175,
        "upvote_ratio": ""
    },
    {
        "title": "Dear customer,",
        "author": "Senseitaco",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kdbbf/dear_customer/",
        "text": "ANSWER YOUR DAMN PHONE! I'm SORRY I have an out of state number, but for fuck's sake, you ordered food and you're in a secure building. What the fuck did you think was gonna happen?!",
        "created_utc": 1441872067,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes I wish I was a pedophile so that I didn't have to deliver to schools.",
        "author": "thoughtofitrightnow",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kcvxg/sometimes_i_wish_i_was_a_pedophile_so_that_i/",
        "text": "",
        "created_utc": 1441863338,
        "upvote_ratio": ""
    },
    {
        "title": "The one where the customer doesn't know his own address.",
        "author": "notanotherjack",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3kamdz/the_one_where_the_customer_doesnt_know_his_own/",
        "text": "Today was just a normal Wednesday. A discount flier went out, and the franchise owner told the manageress to go overboard with staffing levels, only then to say it won't be too busy. I made hundreds of boxes. And this happened.\n\nI've had all kinds of customers since I started working at this small-town store. The impatient, the baked, the chilled, the fussy, the aggressive, the indifferent, the cheap, the lavish. But none quite like this guy.\n\nI take his order over the phone, as per normal. Food, phone number,  address. He'd obviously ordered with us before, as when I entered the phone number, the address auto-filled. I double checked the street name, and asked for the house number. Forty six. That's odd - it was a digit different to the one I had - forty two.\n\nI deleted 42 and entered 46.\n\nSome time later, I was assigned to deliver this very same order. I find the street, and find number forty six. I ring the bell and knock the door. A puzzled woman answers. \"We didn't order any Domino's\"\n\n\"Oh, sorry. I'll try ringing them.\"\n\n**Ring ring**...voicemail. **Ring ring**...voicemail.\n\nI call the store. They can't get through either. \"It's not prepaid, so just come back.\"\n\nI had just one last strand of hope. Let's try number 42.\n\nThe guy answers. He's pleased to see me.\n\n\"Pizza for number 46?\" I say.\n\n\"Yeah, number 46.\"\n\n\"46?\" I lean round to the front of the house, digits '4' and '2' clearly stuck to the wall. \"Says '42' on the front.\"\n\n\"Oh yeah, of course it is. I'm in my own little world.\"\n\nI get the money, make the usual small talk, and leave chuckling to myself.\n\nA couple more deliveries and I was done for the afternoon. As I'm pulling out of the car park, my phone rings. I vaguely recognise the number as the one I dialed thrice earlier. I put it on speaker.\n\n\"Hello?\"\n\n\"Hi, I got a missed call from this number..\"\n\n\"Probably from Domino's Pizza..\"\n\n\"Ah yeah.\" Chuckles all round.\n\n\"Have a good one, laters buddy.\"\n\nDone for another day.",
        "created_utc": 1441831432,
        "upvote_ratio": ""
    },
    {
        "title": "\"YOU CAN'T EXPECT ME TO DRIVE IN THIS WEATHER!\"",
        "author": "HelpTheNewGirl",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ka2v1/you_cant_expect_me_to_drive_in_this_weather/",
        "text": "Hey guys! Long time lurker, first time poster, apologies for formatting, and all that jazz. (Also, sorry for poor grammar, syntax! and general storytelling skills.)\n\nAlso this was on r/talesfromretail a while ago before it was removed, I just now got around to reposting to the correct subreddit.\n\nThis actually happened a while ago during winter, I just now got around to posting. (I'm lazy)\nI work for a national pizza chain (*NPC*) so winter is generally a busy season, but snow days are much worse. For reference, I live in northern VA, where winters are pretty mild and people aren't used to driving in more than an inch or two of snow. So, when we get as much snow as we did this winter, people lose their collective sh#t. Now, without any further ado, the story:\n\nIt was the bottom of the ninth, bases were loaded, the delivery truck is a day late, two people making orders, two people working oven, three drivers and a manager taking upwards of six deliveries at a time, one cashier helping carry out, and one lone girl taking phone orders, on what would almost be a record sales day despite closing early.\nAt this point I have no less than 5 lines on hold, and orders are interrupted every 2-3 minutes by new phone calls.\n\n&gt;Me: Thank you for calling *NPC*, this is Katherine, could you hold please?\n\nI've gotten a couple of rude/crazy customers at this point, but this rude lady (RL) took the proverbial cake.\n\n&gt;Me: Thank you for holding, will this be for carry out or delivery?\n\n&gt;RL: Ugh, finally, delivery.\n\n&gt;Me: (still using cheery customer service voice) Okay, just to let you know delivery time is upwards of 2 hours, are you okay with that ma'am?\n\n&gt;RL: TWO HOURS? Am I getting this for **free** then?\n\n&gt;Me: No, ma'am, we just have a lot of orders, and only four drivers.\n\n&gt;RL: Ugh, whatever.\n\nObligatory taking of information\n\n&gt;RL: Can I get one medium *specialty* pizza, one medium pepperoni and sausage, a two litre coke, and some ranch.\n\n&gt;Me: (speeding to get all that) Okay, how many ranch?\n\n&gt;RL: (exasperated sigh) I don't know, like four?\n\n&gt;Me: Alright, so that was (her order), am I correct?\n\n&gt;RL: YES. OH MY GOD, CAN I JUST HAVE MY TOTAL? IT SHOULD NOT TAKE THIS LONG TO ORDER PIZZA.\n\n&gt;Me: Yes, it's XX.XX.\n\n&gt;RL: WHAT THE F#CK? WHY? IT SHOULD ONLY BE YY.YY! WHAT ARE YOU CHARGING ME FOR?\n\n&gt;Me: (heavy internal sigh) That was AA.99 for the pepperoni sausage, BB.47 for the *specialty pizza*, C.99 for the sprite, and D.25 for the ranch, plus tax and a $2.50 delivery charge.\n\n&gt;RL: Okay. Are you stupid? Did you put the *specialty* pizza down as a medium, like you were *supposed* to? Did you remember to put the *deal* in? Second, I never get charged for ranch, so *why* did you? And lastly, what is this delivery charge bullsh#t? Does that mean I don't need to tip?\n\n&gt;Me: Ma'am the *specialty* pizza doesn't fit under *deal*, so both were charged at full price, we also always charge 75¢ for any dipping sauces, and finally the delivery charge doesn't go to the driver and doesn't count as a tip.\n\nSo, she fixes her order to fit the deal and pays for her order by card. By now it's taken me longer than usual to take her order, and a coworker has come to help take orders. I'm thinking thank God I'm done dealing with her. But, alas the dreaded Grendel returns.\n\n&gt;Me: Thank you for holding, will this before carry out or delivery?\n\n&gt;RL: Yeah, I called to place an order for delivery half an hour ago, where is it?\n\n&gt;Me: [(why me?)](https://40.media.tumblr.com/75685ce5f819b46923beba77a2a355e2/tumblr_mn9op4xT9y1rs0jwho1_500.jpg) If you'll just give me your phone num-\n\n&gt;RL: (123)-456-7890\n\n&gt;Me: Unfortunately ma'am it hasn't been made yet, as there are a lot of orders ahead of yours. I did say it could take at least 2 hours.\n\n&gt;RL: This is ridiculous, I better be getting my money back.\n\n&gt;Me: So, you want to cancel your order?\n\n&gt;RL: **NO.** I want my order for free! It's been more than thirty minutes. That's the rule. HOW STUPID CAN YOU BE, DON'T YOU KNOW YOUR OWN POLICY??\n\n&gt;Me: Ma'am that's not our policy. I can void out the transaction and cancel your order, or you can wait for your pizza, but please stop yelling at me.\n\n&gt;RL: Whatever.\n\n&gt;*click*\n\nAnd of course 20 minutes later...\n\n&gt;Me: Thank you for calling *NCP*, this is Katherine, could you h-\n\n&gt;RL: NU-UH F#CK THAT. WHERE'S MY PIZZA?\n\n&gt;Me: (f#ck me) Can I have your phone number please?\n\n&gt;RL: (123)-456-7890\n\n&gt;Me: It was actually just made-\n\n&gt;RL: IF IT'S READY, WHY ISN'T IT BEING DELIVERED?\n\n&gt;Me: Because ma'am, as I've said before, there are many orders ahead of yours. The roads are dangerous, so we're the only ones still open for delivery, drivers aren't exactly speeding, they're all carrying about five deliveries at a time, I warned you delivery could take at *least* two hours. But since it's ready and still fresh, you could still come pick it up and we'll refund you the $2.50 delivery charge.\n\n&gt;RL: YOU CAN'T EXPECT ME TO DRIVE IN THIS WEATHER! IT'S TOO DANGEROUS! CANCEL MY ORDER!\n\n&gt;*click*\n\nTL;DR: Lady wants to take precedence over other orders, and for drivers to speed on icy roads so she can eat her pizza.",
        "created_utc": 1441824684,
        "upvote_ratio": ""
    },
    {
        "title": "Any stories of revenge after getting stiffed by assholes customers",
        "author": "Th3Night0wl",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3k6i35/any_stories_of_revenge_after_getting_stiffed_by/",
        "text": "",
        "created_utc": 1441765790,
        "upvote_ratio": ""
    },
    {
        "title": "Scheme mentality",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3k6g9x/scheme_mentality/",
        "text": "[deleted]",
        "created_utc": 1441765057,
        "upvote_ratio": ""
    },
    {
        "title": "The one where the schools are back in class.",
        "author": "notanotherjack",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3k57vy/the_one_where_the_schools_are_back_in_class/",
        "text": "Today was the first week back for the local private school, which provides a majority of business on Tuesdays as 20-30 only children all want BOGOF pizza at 8-8.30. As such, all but a couple of drivers were working, so the rest of the town can get their pizzas on time too while half a dozen drivers wait in the school grounds for said students to show.\n\nTomorrow a rare event is happening. The entire town, plus our three 'far' (double gas money) towns, are getting leafleted with a cheap delivery deal, valid until the fifteenth. I looked at the rota and only one driver has the day off. It is impossible for anyone to predict, but it'll either be over- or underwhelming.\n\nI look forward to see which.",
        "created_utc": 1441747567,
        "upvote_ratio": ""
    },
    {
        "title": "I just had the best weekend ever, how was your labor day weekend?",
        "author": "mada52",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3k2pzi/i_just_had_the_best_weekend_ever_how_was_your/",
        "text": "[removed]",
        "created_utc": 1441705293,
        "upvote_ratio": ""
    },
    {
        "title": "When the boss copy and pastes last week's schedule for this week.. except it's a holiday weekend",
        "author": "awfulbeans",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3k1u6k/when_the_boss_copy_and_pastes_last_weeks_schedule/",
        "text": "This weekend went fine. A little busier than usual, but nothing we couldn't handle. As the title says, boss copy/pasted last week's schedule, making only a few tweaks. He's off all week for vacation.\n\nProblem is.. he didn't adjust it to account for today. Today, in the US, is Labor (oops) Day. Meaning a huge chunk of people didn't work today, and kids didn't go to school today. I assumed my boss had taken that into account when he wrote the schedule. My boss also took this week off.\n\nI got to work today. I see one car in the parking lot... the one that belongs to our most rookie manager. Well, I'm usually the first driver in (I open 4 days a week, and days I open, I'm always the first driver in), so we probably have someone coming in at 11:30, right? And we probably have an inside person, right?\n\nI walk in. It's just rookie manager. Shit. I ask her \"... is it just us?\"  She nods her head, and says it's just us until 4pm. I tell her she needs to start calling people right now, because we're about to get fucked. She's already been calling people - as it turns out, 2 drivers from last night didn't do their prep before going home, so we were already behind the ball - she had to do their prep and rush a ton of dough into the proofer first thing when she got there, and she hasn't been able to get ahold of anyone to come in and drive.\n\nShe got ahold of our assistant manager, who lives directly behind the store, she says she'll come in an hour early. Shit. That's not going to help much, as she's scheduled to come in after our lunch rush. Thanks, assistant manager. Asst mgr also doesn't have a car, and rookie manager for whatever reason isn't allowed to drive.\n\nWe have a huge delivery area that covers parts of 4 cities; our franchise figures 3 deliveries per hour per driver when it comes to labor (while corporate stores figure 4 per hour per driver, though corporate owned stores tend to have denser delivery areas - we're right on the edge of suburbia and rural).\n\nAt one point, I walked in to see the oven backed up and the rookie manager in tears. Trial by fire for sure. I just told her \"look, this will be over in an hour or so. Just try not to lose it completely, okay? I'm doing as much as I can to help, and I know we have &lt;X&gt; coming in soon to bail us out. Go smoke a cig and hang out behind the store for a bit, I'll handle everything for a few\". It's not the nicest thing to say, and I could have worded it better, but it got her to go outside and take a deep breath.\n\nIt really didn't get much better from there, though thankfully the opening manager pulled herself together long enough for the assistant manager to show up. Our inside time was well over 30 minutes all day, and I went on two triples (a massive no-no, I'm sure I'll get bitched out next week).\n\nAll in all - 23 deliveries in 5.5 hours. Computer said I hit 6 deliveries an hour at one point, and I was just going with traffic the whole day (I've hit 7 in an hour once at this store, and that warranted a call from the owner to my boss asking how the hell I managed that without getting arrested).\n\nI'm glad I'm off tomorrow, and it's a good thing my boss is on vacation - he has a severe ass chewing waiting for him from his boss (area coach), the owner (not the area coach), the opening manager, and myself. We lost a lot of money simply because we didn't feel right charging people for cold, 1.5 hour old pizza. Having another driver would have cut into my deliveries some (possibly - a lot of people said \"nevermind\" when they were told it'd be 1.5 to 2 hours on the phone), but would have ensured our customers were a lot happier. I'm sure we're going to get a shitload of corporate complaints over today.\n\nAs for my normal opening prep (pastas, sauces, wings, take out the trash) - the only thing I managed to get done before the phone blew up was take out the trash. And seeing as the opening manager had managed to escape by the time the closing manager arrived, I laughed when the closing manager asked me to stay to finish my prep, and got the hell out of there (20 minutes later than I was scheduled, and I have a strict schedule in that I have medical stuff after work most days - he didn't need to know that the doctor's office was closed today, and I was ready to curbstomp anyone who got between me and my car by then).\n\nedited to correct the holiday. How the hell did I screw THAT up..",
        "created_utc": 1441683610,
        "upvote_ratio": ""
    },
    {
        "title": "Record breaking night!",
        "author": "DigThatFunk",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jzkgg/record_breaking_night/",
        "text": "DISCLAIMER: I'm long-winded so skip down for the tl;dr.\n\nJust last night, I had the best night in tips that I've ever had! I've been delivering pizzas as my main source of income for the majority of my working life, which puts me at about 12 or 13 years of delivery (with intermittent breaks of up to a year or two, i.e. when I first went to college, or working a few other jobs)... And for the past few years I've steadily been working like 6 to 7 days a week, Sooo I've worked a lot of nights, to say the least.\n\nWell, last night I had the best night of my long and storied career in the pie-slingin' game. One of those nights where everything just lines up perfectly and every single customer is awesome. We were short-handed on drivers since one guy couldn't make it in. On top of that, we were absolutely *slammed* with orders of every type, dine ins, carry outs, and deliveries. \n\nI've delivered at this store for over 10 years and it's a very small town so all my customers know me, and there's a lot of people with money that live here, so anything over $4/per run average is acceptable, $5/per is a pretty good night, and over $5/per is *great* (this includes a $0.75 reimbursement per delivery for gas). We work about 4 1/2 to 6-ish hour shifts so 10-15 runs is decent for weekdays and 15-20 for weekends.\n\nWell, not only did I take 24 deliveries last night, I also averaged $6.65 per run! Helped along by getting a $20 tip, a $12 tip, a $10 tip, and a $9 tip, among others... Which meant I walked out with $160 in my pocket! My previous record was something like $148 on 31 runs, nowhere near as good an average haha. Not too shabby for ~7 hours of work (plus the hourly for that, on top)!\n\nTL;DR: crazy awesome night, $160 on 24 runs, best tips in ~12 years of delivering, one of my best averages per run ever (only surpassed by the night I made $11/run on 7 runs thanks to a $40 tip, my best ever)\n\nWhat are some of your guys' and gals' best nights? And what are some of your best averages, and/or single best tips? ",
        "created_utc": 1441643664,
        "upvote_ratio": ""
    },
    {
        "title": "After delivering for over a year, I finally got pulled over.",
        "author": "Jumphiggggg",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jzexk/after_delivering_for_over_a_year_i_finally_got/",
        "text": "So last night, we had a massive rush. It was so busy that orders were at 30 minutes as they were coming out of the oven. Naturally, I have the only run that is at the edge of the map with no other orders close to it so I have to take it as a single. Never been down this road before, so on my way back I get pulled over for going 6 over the speed limit. My car's roof is made of glass so I can't use a car topper and it's moderately customized with wheels, lowered ect. so I figured it would be bound to happen. There are a lot of modified (Mostly riced out) cars in my area that harass the police. http://imgur.com/NxXvHnm (Picture of the car for those who care) So I pull over and the officer walks up and says, \"Good evening sir.. wait. You work for Papa Johns?\" And I'm like, \"Yeah, we are in a crazy rush and this order I just delivered was over an hour old.\" The officer then replied \"Well shoot, get going then. Just so you know you were doing 41 in a 35.\" After that I apologized and let him know that I have never delivered there before and then we shared a joke and he let me go. Didn't even ask for my information. On my way back to the store, I ended laughing most of the way because it was just a funny situation. \n\nTL;DR. Busy night. Long delivery to a place I didn't know. Got pulled over. Cop likes pizza and lets me go after we share a joke or two. ",
        "created_utc": 1441641185,
        "upvote_ratio": ""
    },
    {
        "title": "Home and work",
        "author": "EroticHandjobs",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jz5m8/home_and_work/",
        "text": "Not a driver, but a manager at Papa Johns, and I have a Galaxy s6. My GPS usually tells me how far away work or home is, and here recently it's been thinking that work is home and home is work, just because of all the crazy hours I work.",
        "created_utc": 1441636708,
        "upvote_ratio": ""
    },
    {
        "title": "Do any of you use the foodtech app?",
        "author": "iftreescouldspeak",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jxvbd/do_any_of_you_use_the_foodtech_app/",
        "text": "How do you feel about it?",
        "created_utc": 1441604089,
        "upvote_ratio": ""
    },
    {
        "title": "After two years of the pizza game, I finally put in my two weeks.",
        "author": "b00n96",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jwps4/after_two_years_of_the_pizza_game_i_finally_put/",
        "text": "Started there when I was 17, as a cashier, and quit after a few months. Came back when I was 19, as a cashier and driver, as I was desperate for a job. \n\nI won't miss it. I won't miss customers telling me to put a rush on their delivery, how much longer their pizza will take, telling me they're going for a walk outside after placing a dine-in order. \n\nI won't miss getting talked to by an OPs manager for not giving a kid a balloon during a rush, having to carry extra weight because the high-schooler we hired is a terrible employee, being guilt tripped to try and stay pass my 6 hour work limit, after working all day, and me refusing. \n\nI won't miss any of it. I put in my two weeks on Wednesday and I only have five more work days. My manager is pulling a role-reversal and trying to get me to stay now. The other head cashier and I put in our two weeks days apart from each other so he's panicking. It's was a nice and easy first job but I won't miss it. ",
        "created_utc": 1441581003,
        "upvote_ratio": ""
    },
    {
        "title": "An Unexpected Coincidence",
        "author": "pikacakes",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jwlaj/an_unexpected_coincidence/",
        "text": "When I was about 10-11, my mom decided to order some Pizza Hut. We were technically in their delivery area, but pretty far from the store. My mom insists I take the delivery and gives me a $20 bill to pay the driver with. The total was proabably around $11-12, I don't remember. But she said to ask for change and give the driver a tip.\n\nSo, pizza comes on time, all is good. I hand over the money, get the pizza and...I'm a deer in the headlights. I was a very shy child (and am still a rather shy adult) and I was too shy to ask for change. And...I just shut the door. That guy ended up getting a good tip.\n\nYears later, I met my boyfriend, who was a driver for Pizza Hut in the early to mid 2000s. I tell him that story and he says \"Wait...That sounds really familiar.\" He recalls taking a delivery out to the middle of nowhere (an accurate description of the location of my mother's house in relation to the store) and the door being answered by a little girl. He said the girl handed over a $20, took the pizza, and shut the door. He was excited to get a better than expected tip, especially since we were out of the way.\n\nWe compare some more details, ask my mom to recount her memory of the events and...we're 99% sure my boyfriend delivered me pizza as a child. While we will never know 100% if this is the truth, it's such a strange coincidence we are highly amused. We live in a small town, which had only one Pizza Hut (at the time).\n\nAnd now, I'm following in his footsteps. I start my job as a driver for Pizza Hut in a week or so. Hope it goes well! ",
        "created_utc": 1441578665,
        "upvote_ratio": ""
    },
    {
        "title": "Kid gives me a ripped 20 dollar bill.",
        "author": "shnoopshnashne",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jvuhu/kid_gives_me_a_ripped_20_dollar_bill/",
        "text": "I'll try to keep this short and sweet. A kid orders a pizza which was about 16 dollars. Hands me the 20 that was folded up and says keep it which is already a shock to me since kids usually don't understand the concept of tipping. I put the 20 in my pocket, and as im driving away i take it out to add it to my bank to notice 1/3 of it is missing. I get back to my store(it was only 3 blocks from the house i delivered to) and showed my boss and asked him if this is unacceptable and he said yes, he called them back and sent me to go back to get the money for the order and give back the ripped 20. The kids older sister was running around trying to find money when i got there while the younger kid was adamantly denying that the 20 was ripped. She eventually found 16 dollars(there goes my tip but w.e.) I give them the 20 they gave me and i half-jokingly said maybe u can pass this off somewhere else. Then as im walking away the girl asks if i have the other half. I was like no if i did i woulda just taped it back together. A day later the kids mom calls in complaining that i ripped her sons 20 and made him pay for the order again. My boss handled it and said that her son is lying and tried to scam our driver with it, but she was hearing none of it because her son would never do such a thing. Last thing i heard was that she was calling the cops but they are from new york and they are going back this weekend so i doubt she will.\n\nThank god it's labor day and all the bennys are leaving. jersey shore residents will know what im talking about.",
        "created_utc": 1441565688,
        "upvote_ratio": ""
    },
    {
        "title": "Tale from the other side of the order.",
        "author": "AgenderCaterpie",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jtnyr/tale_from_the_other_side_of_the_order/",
        "text": "[removed]",
        "created_utc": 1441512966,
        "upvote_ratio": ""
    },
    {
        "title": "Is it worth becoming a delivery driver at 8 mpg?",
        "author": "Krono5_8666V8",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jtkjd/is_it_worth_becoming_a_delivery_driver_at_8_mpg/",
        "text": "The car I drive here at school gets about 7-8 mpg (which is why I'm looking to sell it even though I love it). I'm thinking of getting a job delivering pizzas for some extra cash and to... you know... gas up the ride. But if my mileage is *that* bad will I just end up losing money?",
        "created_utc": 1441510869,
        "upvote_ratio": ""
    },
    {
        "title": "Is being a Dough Prep worth it?",
        "author": "FruityNegro",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jtgud/is_being_a_dough_prep_worth_it/",
        "text": "I go to school so I work part-time on minimum wage, usually 5-10 p.m. on week days and weekends, so I still get atleast 3-4 days of work each week. Im currently in my third week of working and just being a Dough Prep right now, which means I don't always get my full hours. Today I was informed that my first paycheck next Firday will only be around $75 because a week was subtracted in case I were to quit and they were to owe me a week of pay. Is $75 dollars worth it or is it just for my first check, for that matter is Dough Prep even worth it?  Also how long would it be til im a cook and get decent hours?",
        "created_utc": 1441508708,
        "upvote_ratio": ""
    },
    {
        "title": "When delivery justice goes too far",
        "author": "Nomsfud",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jtgcg/when_delivery_justice_goes_too_far/",
        "text": "I haven't worked in food for some time, but here's a story of what not to do when someone decides not to tip you. \n\n\nOne night we had a closing driver who has having a bad shift. That's fine, everyone has a bad day, but what she did I still find inexcusable. \n\nOn her last run, she had the lady she was delivering to take longer than preferred to come to the door and get her food. When she finally got to the door, she was semi-rude, and ended up stuffing our driver. Of course, it's her choice to tip or not, but when you're having a bad day getting yelled at and stiffed sucks. The driver went back to the store, cashed out, and went to someone's house to drink and unwind. \n\nIf the story had ended here I wouldn't be posting it. \n\nAfter drinking a bit, she talks one of the other people there to take her back to this lady's house. She gets him to ring the doorbell and hide in the bushes. When the lady opens the door, this driver shouted \"JIMMY JOHNS NEVER FORGETS!\"  And slashed all four tires on this lady's car. The two of them then drove off. \n\nThe lady never called to complain, but you can bet these two were bragging about it the next day they worked.\n\nI do not in any way condone destroying someone's property over rudeness and no tip. It's a shitty thing to do and were I her boss I would have fired her the moment I heard the story. Somehow she still has her job and is now a Person In Charge (a management band-aid).\n\nI just needed to vent about this, because I know this sub is filled with good drivers who know the ins and outs of the job and do it well. ",
        "created_utc": 1441508443,
        "upvote_ratio": ""
    },
    {
        "title": "Just needing to vent",
        "author": "KamenDozer",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jsc9p/just_needing_to_vent/",
        "text": "First time posting in this sub (never thought I'd be telling pizza stories again let alone working for another pizza job) but I have had a shitty morning and need to vent. I guess today my company (who shall remain nameless but not gonna try to be *THAT* anonymous) had a promotion to go out over a televised special for 10k people to get a free 1 topping pizza. What their intention was supposed to be and what happened isn't the same at all. Somehow the code itself got leaked long before the actual code aired on TV so instead of every store across the country getting 1-2 pizzas, my store got 80 of them. 50 due by 11 am (4 hours ago). Thankfully I went in early to do some dough prep and help my GM early because as soon as the tickets started printing they didn't stop. The icing on the fucking cinnastick is that even though we busted ass trying to get the pizzas made, nobody picked their pizzas up. So for everyone who took blatant advantage of that pizza just to fuck with my morning severely pissed me off and totally ruined my happy vibe.",
        "created_utc": 1441487402,
        "upvote_ratio": ""
    },
    {
        "title": "Closers, how do you feel about the last minute late orders during the final hour you're open?",
        "author": "whydoipoopsomuch",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jq59w/closers_how_do_you_feel_about_the_last_minute/",
        "text": "Some workers don't care. Some like the extra hours and money. Some, including myself, would rather get all caught up on closing duties and go home at a reasonable hour. Reasonable meaning just a few minutes after closing time and be able to buy a six pack before 2am, before going home.\n\nI need the hours because I'm getting mine cut, every week, but I don't want to go home two to three hours after close because of the last hour orders. My company keeps sending home the second late driver earlier each week and they don't do much to help us go home sooner. Many times, they get sent home without helping with the cleaning and stocking that needs to be done.\n\nI mostly blame the closing managers for letting the store get so dirty and dishes piled up for the end of the night. \n\nAt my store, the majority of the closing managers are lazy and don't get the employees to get stuff done, or won't help out by cleaning or restocking. They do their duties but leave the rest of the cleaning to the closing driver.\n\nTonight, when I brought this up to a kinda new closing manager, she suggested I work faster. She is slow and only has one speed in moving around the store. She talks to her friends, all through the night on the phone. I think she isn't pulling her weight and does not want to go home as soon as possible.",
        "created_utc": 1441444215,
        "upvote_ratio": ""
    },
    {
        "title": "The biggest problem with not having mandatory gratuity.",
        "author": "MotoHiashi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jl0zx/the_biggest_problem_with_not_having_mandatory/",
        "text": "Had a 25 Large Pizza order today that totaled around $560 US. It was delivered to an industrial business less then a quarter mile away and the driver was completely stiffed. Not a happy night for him.",
        "created_utc": 1441344278,
        "upvote_ratio": ""
    },
    {
        "title": "Ordering over the phone while on our website?",
        "author": "somecow",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ji0vo/ordering_over_the_phone_while_on_our_website/",
        "text": "\"So, what are your specials? I'm on your website and I don't see the one I want\". Yes, everything is free, I exist just to make your food, no need for me to get a paycheck so I can pay for the car that I'm bringing your shit in. \"Well, there's a button that says order now\". Did you want to order something? \"Yeah\". Okay, so two or more etc... \"So what if I just get one\"? Okay, that will be normal price. \"But you just said...\" Yes. Two or more. So, how much for one? I don't see anything online about just one.\n\nTL;DR Don't call me if you have a fucking computer with internet access, and if you're strapped for cash, then you should probably do what I do, and buy food from the grocery store instead of dropping $20 on one meal.",
        "created_utc": 1441295167,
        "upvote_ratio": ""
    },
    {
        "title": "My old shitty company still making me proud.",
        "author": "DylanCO",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jft64/my_old_shitty_company_still_making_me_proud/",
        "text": "I worked for Chanellos (Local mom and pop chain) for years, started as a driver and worked my way up to assistant manager, I trained many drivers and managers in my time there. The pay was shit and the conditions were horrible, A.M. making 7.25 w/ 60+ hours a week. Someone sent this to me on FB and it made me so proud. Chanellos has a \"Gun Policy\" that was basically don't let anyone see it. Hell my neighboring store had a \"Protected By Glock\" sticker on the door and EVERYONE carried there. At my store there was me and 1 other person. Anyway I fell like I'm rambling, just thought you guys would like this. \n\nhttp://wtkr.com/2015/08/31/police-teen-shot-by-delivery-driver-after-attempted-robbery/",
        "created_utc": 1441246080,
        "upvote_ratio": ""
    },
    {
        "title": "If you want to cover your ass, on each and every delivery, you should get recording devices.",
        "author": "whydoipoopsomuch",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3jbw2a/if_you_want_to_cover_your_ass_on_each_and_every/",
        "text": "I can't go into details yet, because the \"case\" is still kinda open between the police and my company.\n\nThis past weekend, my first run of the night was to the outskirts of our area and in a not so good neighborhood. If I had a pocket digital recorder, and front and back dash cams, this would have greatly verified my story of what went down. I'm going to look into getting cams for my car. The less than 1% of customers, that are crazy, can ruin your life or job forever.\n\nLong story short, me following company policy with cards, almost got me into deep crap. They didn't have the card and the card owner wasn't at the delivery point. New customer and 4 pizzas. I told them that since the card and owner wasn't there, that they needed to provide another form of payment. We have a lot of charge backs, fraud, and stolen cards where I live. After waiting almost five minutes at the door, I told them I had to take the food back. This is when things got ugly very fast. I can't go into details, but I called the police and made a report to cover my story.\n\n\"Family\" showed up at the store that night twice. They lived almost five miles from our store, so it wasn't close. I was sent home early for my safety.\n\nI can't go into details, but you drivers, do everything you can to cover your ass and validify your story of what happened. It could save your life job and reputation! Be professional and cover your butts!",
        "created_utc": 1441180263,
        "upvote_ratio": ""
    },
    {
        "title": "Drivers, is it cool to answer the door in not-much?",
        "author": "Vernacula",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3j8yvn/drivers_is_it_cool_to_answer_the_door_in_notmuch/",
        "text": "[removed]",
        "created_utc": 1441131156,
        "upvote_ratio": ""
    },
    {
        "title": "I wish for all my delivery drivers...",
        "author": "Tru-Queer",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3j83ee/i_wish_for_all_my_delivery_drivers/",
        "text": "Big tits or big tips!\n\nOr, if you're female/gay, big dicks or big tips.",
        "created_utc": 1441118674,
        "upvote_ratio": ""
    },
    {
        "title": "An odd way to get a 10-dollar tip",
        "author": "RiotPolizei",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3j64gn/an_odd_way_to_get_a_10dollar_tip/",
        "text": "I just remembered this after my shift tonight.\n\nOne time, my coworker answered the phone and took a very standard order. Afterwards, the dude asks him, \"hey, uh, I know you guys only carry coke products, but if you find a way to get me an energy drink, I'd make sure you get reimbursed!\"\n\nLucky for that guy, my coworker had a few monsters in his car for later. He shows up to the guys house, hands him his order along with a monster, and the guy gives him 10 bucks on a 8-dollar order.\n\nHave any of you guys ever done something like this?",
        "created_utc": 1441075642,
        "upvote_ratio": ""
    },
    {
        "title": "A \"solution\" a problem some of you face",
        "author": "Arcades057",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3j3pza/a_solution_a_problem_some_of_you_face/",
        "text": "So first let me say that I'm not advocating this for everyone.  You know yourselves better than I do.  If you can pull it off, try it once; I promise you'll have a \"story of the night.\"\n\nThose of us who deliver to less reputable, more ethnically diverse neighborhoods have likely been accosted by the \"ay ay ay\" people.  You know, the teen-to-young-adult shiftless folks who always seem to be around at all hours of the day or night, hailing your pizza delivery vehicle as though it were a cab?  Most likely you've done what I always did in the beginning:  Rolled your eyes and driven on; maybe you waved if you didn't grow up around such areas.  One day, on about the twelfth time of being hailed by some miscreant, I came up with my solution.  Offer to sell them drugs.\n\nThe kid hails me as I'm driving by:  \"ay ay ay ay,\" so I slam on the brakes, back up to him, and yell out the window \"Ay, man, you wanna buy some rock?\"  His look of surprise was worth the honking of traffic around me.  (I did not have any rock to sell)\n\nI just did it the other night to a homeless guy.  He yells at me from across the street about chicken, I kid you not, then saunters over going \"Lemme uh, lemme uh, lemme uh,\" so I interrupt his verbose greeting with \"You wanna buy some weed?\"  He freezes, says \"Uh naw, man, I uh, naw.\" and walks away.  It was a lot easier, and funner, than saying \"No, you can't have a cigarette, a lighter, a dollar, a ride, the time of day.\"\n\nAnywho, if you can pull it off, try it off.  I doubt some asshole trying to sell you drugs is going to call your place of work or the police on you for trying to sell him drugs that you don't actually have.  Oh yeah:  You can't actually have drugs on you.  Should go without saying.",
        "created_utc": 1441039130,
        "upvote_ratio": ""
    },
    {
        "title": "How do you handle payment at the door?",
        "author": "MrBrohanski",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3j1tjj/how_do_you_handle_payment_at_the_door/",
        "text": "I work for a mom&amp;pop Chinese restaurant. Friday morning we had a regular, one of the guys at a used tire shop nearby, call in and order a bunch of smoothies. When I got to the shop the guy walks up to me and asks how much he owes me. I give him the total and he starts reaching toward the bag. \n\nNow, the thing about working at my restaurant is that we will deliver to pretty much any neighborhood, no matter how sketchy. So because of this I have a strict \"no food til cash is in my hand\" policy. \n\nThe guy is grabbing for his smoothies, and I do what I always do in this kind of situation: gingerly put the receipt in his open hand. This usually conveys the message. Today it didn't. He says to me \"no, I want the bag.\" I reply \"I'm sorry sir but I need your payment first. Your total is XX.xx\" He curses under his breath and asks \"So you're telling me that even though I'm about to go in back and grab your money, you can't give me the smoothies?\" \"No sir, its company policy.\" \n\"Well then get out of here!\" \"You do not want your smoothies, sir?\" \"No, get the fuck out!\"\n\nHave any of you had a situation like this? Do you ever hand over the food before being paid? How do corporate chains vs other mom/pops do it?",
        "created_utc": 1440999480,
        "upvote_ratio": ""
    },
    {
        "title": "Do you take tips in liquor?",
        "author": "SantoSubito80",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ixgpq/do_you_take_tips_in_liquor/",
        "text": "Pretty short but TL;DR at end.\n\nI deliver to the campus area in a decently sized state college town, drunk rich college kids=good tips so I'm happy. \n\nI get a call for about $70 worth of food to an area that is at the edge of our delivery, but is known to be one of the wealthier parts of town. I show up to a nice two-story house and ring the doorbell:\n\nMe: *Standard Pleasantries* \"That'll be $70, please\" and he hands me exactly $70.\n\nCustomer: \"Hey man, I don't have much cash around\" (It looks like he only has two dollars from whats in his hand), \"Do you take tips in liquor?\".\n\nI'm kinda dumbfounded at this point because even though I've delivered to numerous liquor filled parties I've never had someone try to tip me with it.\n\nMe: \"Uh, depends, what kind?\" I said this clearly joking.\n\nCustomer: \"I hate scotch so you can have this if you want\".\n\nHe hands me an unopened bottle of Johnnie Walker Blue, which itself goes for $150. \n\nNeedless to say I took it, thanked him, and after my shift proceeded to get drunk with a friend like a moderately wealthy man.\n\nTl;DR Delivered $70 of food; tipped with $150 bottle of scotch.\n\n  ",
        "created_utc": 1440913396,
        "upvote_ratio": ""
    },
    {
        "title": "Double middle finger crossed!",
        "author": "RECIPR0C1TY",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ix509/double_middle_finger_crossed/",
        "text": "A recent post about the vehicles we drive triggered a fond memory of days past. It's a story about Butch. So sit back and relax or skip to the bottom for the Tl:dr.\n\nButch was an '86 325i BMW. I found her at 315,000 miles and tearfully put her down at 350,000. She was deep blue with chrome accents and that sleek boxy look that leaned forward ever-so-slightly. To this day it is my favorite model and year.  She hugged the road like a teenager in love and, like a teenager in love, was high maintenance and needed lots of attention. In her prime, she was probably elegant and sleek, but after 300,000 miles, pizza delivery, construction sites, and plenty of abuse she lost a lot her her former glory. However, if you pet the dashboard gently and spoke nicely to her she could still turn on the heat.\n\nOne evening delivering pizzas together, she and I pulled up to a stoplight together. We were in the left lane of a two lane road that merged into one lane shortly after the light. To our right, a middle aged lady pulled up in a more modern Toyota sedan of some kind. She was scowling and ignoring me. I could tell she wanted to pass me when the light turned. However, she didn't know about Reciprocity's Rules of the Road #123. \"If you are going to pass me on the right you have to commit.\" You don't need to race, or peel out, or redline your engine. You just have to prove that you aren't going to slow me down once you get in front. I proceeded to stroke Butch's dashboard lovingly and whispered sweet nothings. The light turned green, and Butch loyally responded. 1st, 2nd, 3rd. Everything is going along smoothly as we are nearing the merge, but miss grouchy pants hasn't committed. She had to step on her brakes, and she pulled in tightly behind me screaming curse words I couldn't hear and giving me the double middle finger crossed. \n\nNow I have had plenty of slurs and nasty epithets slung my way over the years, but I have never, up to that point or after, seen the double middle finger crossed. I found it hilarious. When we got to another passing lane, and she decided to pass me still with her double crossed insult, I very politely turned towards her and offered her the double \"I love you sign\" crossed.\n\nTl;dr Fellow driver gets mad at me and gives me the double middle finger crossed. I respond with the double I love you sign crossed.",
        "created_utc": 1440905737,
        "upvote_ratio": ""
    },
    {
        "title": "The pain of delivering in Chicago.",
        "author": "zangetsu355",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ivnoj/the_pain_of_delivering_in_chicago/",
        "text": "So living in Chicago, we make chicago style pizza which is very thick and has sauce on the top. Ill post pics below. Anyways when ever you deliver a chicago style you have to be very careful. If you go to slow, pizza gets all shitty on the bottom (ex sauce and other stuff seeps through the box), go to fast and you will end up with a pile of sauce and cheese on one side and none on the other. Or my favorite you have the pizza slide forward and have it explode in the bag.another favorite of mine was having 5 pan styles and a deep dish in my car. The pan styles cheese was stuck on the top of the box from the weight of the other pizzas and it was just heavy in general lol. Fun times just thought id share my thoughts on this lol.http://imgur.com/trU8egk\n\nEdit proof im a deliv driver:http://imgur.com/XJKQjXc",
        "created_utc": 1440878365,
        "upvote_ratio": ""
    },
    {
        "title": "How much are in your waffle fries?",
        "author": "Swedged",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3itt2l/how_much_are_in_your_waffle_fries/",
        "text": "In response to the title; It is 7oz of fries. \"That description means nothing to me\". I'm pretty sure I can't explain it any more technically. I ended up telling them a handful and a half. \n\np.s. they asked how many individual fries were in the order. Um, okay, let me roll my DnD die so that I can give you an accurate number. ",
        "created_utc": 1440837733,
        "upvote_ratio": ""
    },
    {
        "title": "I have a question.",
        "author": "Tyrone91",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3itjly/i_have_a_question/",
        "text": "So, I live like, a mile away from a pizza hut. I tend to order a pizza about 2 days before my payday, when I have just enough cash left to pay for it. I'll typically let the guy keep the change and take the bills back. Then, I'll order again a few days after I get paid and tip 7-10 dollars(I always request the same driver). He understands that I tip him for two trips every other time and is fine with it. However, I see a lot of you guys complain about just getting the change back. Is it that big of a deal? ",
        "created_utc": 1440829147,
        "upvote_ratio": ""
    },
    {
        "title": "You are a target to get robbed, just so you know.",
        "author": "ImaGlockFanBoySoWhat",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3itg8m/you_are_a_target_to_get_robbed_just_so_you_know/",
        "text": "I quit my shitty ass job at papa johns a while ago after one of my co workers was robbed at gunpoint and beat up (plus all the other shit that comes with the job, but being jumped is at the top of the shit list). Well guess what happened last week? Someone walked into that papa johns with a shotgun right before midnight. Nobody was hurt, and they got in because the fucking magnetic lock was broken on the front door. The manager apparently hid in the back office while the lone driver got robbed WITH A FUCKING SHOTGUN! But hey, at least if you get murdered on the job, papa john himself might show up at your funeral! \n\nStay safe, kids.",
        "created_utc": 1440826554,
        "upvote_ratio": ""
    },
    {
        "title": "What do you drive to deliver food in?",
        "author": "mourning_breakfast",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3it9oc/what_do_you_drive_to_deliver_food_in/",
        "text": "I'm just wondering what your cars are you use to deliver food in.",
        "created_utc": 1440822110,
        "upvote_ratio": ""
    },
    {
        "title": "JJ's people, what's your sandwich?",
        "author": "goots95",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3irlij/jjs_people_whats_your_sandwich/",
        "text": "Also, what creations do your coworkers come up with?",
        "created_utc": 1440791973,
        "upvote_ratio": ""
    },
    {
        "title": "Do delivery drivers judge customers?",
        "author": "hebtha",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3irkab/do_delivery_drivers_judge_customers/",
        "text": "Sometimes I'll order a lot of food and eat it over the span of a few days. I'm always selfconscious that the driver will think I'm a fatass.",
        "created_utc": 1440791445,
        "upvote_ratio": ""
    },
    {
        "title": "Walked in on an older gentleman",
        "author": "Psycoheals",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3io3zb/walked_in_on_an_older_gentleman/",
        "text": "Welp, just another day as a delivery driver.. Just kidding, i live in a small town, and i rarely get stuff like this to happen, but when it does it makes for a Golden story.  \n\nSetting up the story, i deliver to this guy maybe 4-5 times a week, he tips really good,  older man,  wife passed away, lives alone,  very... perverted.\n\nWell,  we got the call for me to go deliver him a lunch buffet order, so i hop in the car, i go there to take it, and i walk up to the door.  Before i say anything i hear a loud moan, and then him scream.  I didnt know what to do, i was in complete shock,  like,  maybe he was in there bangin or some shit, i didnt wanna interrupt, but, i knocked.  Then all went quiet for about 10 seconds, and he said \"Come on in.\"  - I walk in,  hes sittin butt naked with a blanket over his chair and his lap with a big ole grin on his face and he asks \"Well, i think you caught me.\"  --  Not much of a story after that, but dude was totally wankin it in his 70-80s.  ",
        "created_utc": 1440723577,
        "upvote_ratio": ""
    },
    {
        "title": "The one where nobody has a contract.",
        "author": "notanotherjack",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3injds/the_one_where_nobody_has_a_contract/",
        "text": "This shit just got personal.\n\nMany moons ago when I started working at this small-town store, I was told that nobody got contracts, all the way down from store manager to lowly driver. 'That's a bit shitty' I thought at the time, but I dealt with it. I know I'm a good employee and that it would be a struggle to find something to write me up over.\n\nAs you may recall from previous posts ([here](https://www.reddit.com/r/TalesFromThePizzaGuy/comments/367jdl/the_one_where_the_good_nature_almost_runs_out/) and [here](https://www.reddit.com/r/TalesFromThePizzaGuy/comments/326a60/the_one_where_three_stores_worth_of_staff_are/)), the franchise owner isn't exactly an exemplary human being, and he's not quite sure of his role. Sometimes he doesn't give a fuck, sometimes he micromanages down to the level of telling the manageress to reduce the hours of guys that are leaving, because that's the petty fuck that he is. Fortunately, because we're so short staffed, she can't.\n\nThis is one result of no contracts. Another is that what everyone is paid has no bearing on...anything. Some of the younger guys get £6.31 because that's their minimum wage, some get £6.50, some £7. There is simply no logic to it. I get £6.50, a guy who started after me gets £7, and so does the manageress. Which is why in a recent meeting with him, she asked for a payrise. Apparently she was given a straight 'no, you're not good enough'. And now she is looking for another job.\n\nI felt his pressure creeping around the store, even though the waste of semen was rarely there. I said something to my manageress along the lines of 'I feel vulnerable.' She reassured me I had nothing to worry about.\n\nNow. the rules for shifts are - two weeks' notice on busy days (Tuesday and Friday - Sunday), one week for the rest. Unless the franchise owner says otherwise, either the day of, or a couple of days before, maximum. What with Monday being a bank holiday here in Blighty, and my mum needing help sorting junk before an upcoming move, I decide to write in I'm unavailable for the day.\n\nThis evening my manageress calls me and says that the franchise owner has told her not to give anyone time off or holiday that day, because it's a bank holiday. So can I work? I have no contract to protect me, so all I can do is agree with the most pissed off 'okay' I could muster.\n\nI'm on dayshift with her tomorrow. People are going to get some angry customer service.",
        "created_utc": 1440713636,
        "upvote_ratio": ""
    },
    {
        "title": "Do you do/use anything to keep track how much you make/spend?",
        "author": "keepmathy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ilurt/do_you_douse_anything_to_keep_track_how_much_you/",
        "text": "Looking for tools to keep track of statistics while I drive, prefer an android app, I will settle for a spreadsheet. I want to track mileage, money in, money out on maintenence/gas etc. Does anybody know some good tools for that?",
        "created_utc": 1440688355,
        "upvote_ratio": ""
    },
    {
        "title": "uhh i'm just here to deliver the pizza",
        "author": "poonxtang",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ikesa/uhh_im_just_here_to_deliver_the_pizza/",
        "text": "So today was a normal wednesday clock in at 11 am sit down watch tv fuck around talk to the phone girls and the cooks, around 3-4 pm the orders star rolling in, another driver comes in; sweet! I think tonight's gonna be pretty laid back, turns out around 6 o clock a driver doesn't show up and we start getting back to back deliveries and were backed up, oh fuck there are going to be alot of angry customers, so i leave the pizza place and my manager has me do a double delivery, so I leave with 2 orders and the first place I go to is a retirement neighborhood (it was a gated community just for old people i shit you not) i walked this guys pepperoni pizza to his door and said \"sorry about the wait\" and he says \" well shit good thing you showed up to work today\" thinking i was the driver that no showed that day and then said \"here keep the change thats your tip for coming to work today\" like dude are you serious i cant help the fact that im a little later then you expected for your pizza, i just say \"thank you\" he then says \" yeah well thats no way to run a business at all\" \" you can tell them what i think but you guys are lousy\" i was getting kind of irritated because this guy just has no idea i just said \"uhh i'm just a driver i just came to deliver the pizza im sorry\" and he just says \"no not your fault it's just your management sucks\" which in turn really pissed me off and i was going to say something but i just decided to walk back to the car, like if you have such a big problem with us getting your pizza there a little late, even though it was still fresh and hot; then go order from a corporate brand like dominoes or pizza hut, we don't charge a delivery fee and I have been more then nice to you; drove away and the next customer says \" oh i called and heard you guys are missing a driver, im sorry to hear that\" i just chuckled and said yea ive been taking double deliveries all night\" she then gives me a 20 dollar tip, and i asked her if she wanted any change back and that she was sure and she said \"yea im sure you deserve that\" and then closed the door, in the end it all works out. Hope everyone had a good day out there delivering pizzas",
        "created_utc": 1440655753,
        "upvote_ratio": ""
    },
    {
        "title": "Black people",
        "author": "WatchLegitCheck",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ijpvk/black_people/",
        "text": "",
        "created_utc": 1440642072,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza is 30 minutes late for delivery and luke warm. Do I stiff the driver? (This has happened more than once.)",
        "author": "rotaercz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ij6lk/pizza_is_30_minutes_late_for_delivery_and_luke/",
        "text": "",
        "created_utc": 1440633097,
        "upvote_ratio": ""
    },
    {
        "title": "Baked Ziti Disaster",
        "author": "arom125",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3iioea/baked_ziti_disaster/",
        "text": "Just came across this subreddit and it's great. I spend several years working in a very busy Italian restaurant on Long Island. This elderly gentleman orders a large full tray of baked ziti. He had a condition whereby he was shaky and talked like he was nervous (Parkinson's perhaps?). Anyway he comes in and he pays for his tray on a busy Saturday night at the height of the dinner rush. I very nicely carry the tray out to his trunk, make it out to his car no problem, then as I'm about to lay the tray down, it collapses in the middle, and the piping hot baked ziti ends up all over the floor of this poor guy's trunk. I stood there, smiling in disbelief, knowing that I now had to go into an already overwhelmed kitchen and tell the owner/chef that he now had to quickly make a full tray of baked ziti, and he should also stop what he's doing and talk to this enraged old man. Good times :)",
        "created_utc": 1440625072,
        "upvote_ratio": ""
    },
    {
        "title": "Going Corporate v. Small Mom and Pop",
        "author": "batmansmotorcycle",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ih9k3/going_corporate_v_small_mom_and_pop/",
        "text": "So I've worked at a mom and pop for about 5 years. I just recently graduated college and I'm waiting on results from a professional license that will take about 3 more months at which point I'll be applying to another job. I've run into some serious issues working at this mom and pop and I need to move on. I generally made pretty good money, but I'm wondering what you folks that have worked for both had in experience? Was there a big pay difference? Less or More? Sharing other experiences outside of pay are welcome too.",
        "created_utc": 1440604134,
        "upvote_ratio": ""
    },
    {
        "title": "Your total is $110.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ibps1/your_total_is_110/",
        "text": "Well here's $120, I want $5 back please.\n\nShit.",
        "created_utc": 1440505338,
        "upvote_ratio": ""
    },
    {
        "title": "Dre, I got something to say",
        "author": "dutchmasterkiller",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i9v26/dre_i_got_something_to_say/",
        "text": "Took a delivery to the other side of town. Park up past a pedestrian crossing, before a bus lane and jump up to the customer's door on the fifth floor. Paid with a card so I'm back at my car in two minutes (timed). Police waiting for me, writing out a ticket. \"Parking in area of a pedestrian crossing\" being the reason they gave. Barely am I parked on the zig zags but they tell me it's illegal. Obviously I'm annoyed they're giving me a ticket, and as a result they threaten to give me a second one on top of that for having a bad attitude in their opinion. They say this to me several times, while I stand there giving them all the information they ask. I'm to-the-point but admittedly scowling down at them.  What do they expect, after fining me £100 and putting 3 points (my very first in 3 years of driving) on my licence? Both officers were hugely disrespectful toward me and way unprofessional. One was such a hothead she walked away from me after blowing up in my face. I questioned the other one, but he didn't know the laws he was trying to enforce (let alone the finer points of licence bans that I know but wanted him to clarify. Police negligence. Absolutely pathetic. I have their badge numbers and names and I'm filing a complaint tomorrow morning but there's nothing I can do about this ticket according to the police helpline. \"The law is the law\" as the guy on the phone said. Every time I encounter the police they give me even less hope in the system. Last time it was £565 to repair a barrier that's still broken after I totalled my car. I live in the stabbing capital of Europe, a city brimming with the homeless and drug-addicted but the police go about targeting teenaged pizza boys. Priorities. Fuck the police. ",
        "created_utc": 1440463958,
        "upvote_ratio": ""
    },
    {
        "title": "So, what is this crap of the PizzaCorp keeping the delivery add on fee? It's cheaper to have take out than having a family destroy all the condiments, and restrooms and dirty dishes and cups and silverware and...",
        "author": "gerroff",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i9obv/so_what_is_this_crap_of_the_pizzacorp_keeping_the/",
        "text": "http://consumerist.com/2015/08/24/lawsuit-filed-by-former-pizza-hut-delivery-drivers-claim-companys-fees-cut-into-workers-tips/",
        "created_utc": 1440460911,
        "upvote_ratio": ""
    },
    {
        "title": "I Want to Know Who Made My Food!",
        "author": "Tru-Queer",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i9a3a/i_want_to_know_who_made_my_food/",
        "text": "\"Um, that was me? How can I help you?\"\n\n\"I just wanted to let you know that this is the best order I have ever received from you guys. What time are you done working?\"\n\n\"Oh, thanks! I'm done at 5 today!\"\n\n\"Oh, darn, I don't think I'll be able to make it in by then. But I'm going to stop by and leave a tip for you personally.\"\n\n~~~\n\nTo backtrack, this lady had called in ordering to chicken alfredo breadbowls with spinach and extra sauce, and then she wanted our stuffed cheesy bread but not stuffed, and I apologized saying that we couldn't do that, so instead she ordered a small pizza with no sauce, just cheese, and cut into squares. I made all the food as beautifully as I could, and even sprinkled some cheesy bread shake-on on the small pizza.\n\nIt's nice to be complimented every once in a while. :)",
        "created_utc": 1440454544,
        "upvote_ratio": ""
    },
    {
        "title": "New Guy",
        "author": "Swedged",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i8pjl/new_guy/",
        "text": "So we have this new delivery driver that is in his mid '40s. Not that it matters but he's working on his masters in divinity. He drives 5 under the speed limit and has the old person mentality that he knows more than you because he's been alive longer. Now I'm a loose cannon when it comes to swearing so I wasn't sure how it would work out but it seems it doesn't care too much about the language. But he takes forever on deliveries and it's hard to tell him how to do shit correctly. ",
        "created_utc": 1440445990,
        "upvote_ratio": ""
    },
    {
        "title": "Karma is good.",
        "author": "heyhunny",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i7wbz/karma_is_good/",
        "text": "Took a delivery to a regular. I can't remember why, I think the kitchen forgot a side (it was a while ago), but I had to go back to fix the mistake.\n\nGood thing. I go to the door and see about $60 on the porch that came out of my fanny pack when I gave them change.\n\nSure would have been pissed if I cashed out that night and came up short.\n\nTl:dr Not all re-deliveries are bad.",
        "created_utc": 1440434179,
        "upvote_ratio": ""
    },
    {
        "title": "the nicest customer",
        "author": "poonxtang",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i7qag/the_nicest_customer/",
        "text": "So yesterday was a pretty good sunday for deliveries and i decided to take a delivery that was 7 miles away, i thought great while im on one delivery the other drivers are gonna be doing multiple, pull up to this guys house who lives on a ranch i ring the doorbell and the most enthusiastic guy opens the door and is just the coolest guy, i got his whole order done and he was signing the credit card slip and said \"so if i give you this tip you get the whole thing right? like they dont get a cut out of it\" i replied nope and he said \"good i left 10 bucks on there\"; also this same day delivered a $160 dollar order and got a 15 dollar tip, all in all it was a good sunday",
        "created_utc": 1440431689,
        "upvote_ratio": ""
    },
    {
        "title": "Fellow drivers. Is it only me, or do you notice an increase in customer requests to call them when you arrive, instead of contacting them the usual way?",
        "author": "whydoipoopsomuch",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i6erv/fellow_drivers_is_it_only_me_or_do_you_notice_an/",
        "text": "Besides in store calls, I've noticed our call center making notes to call the customer, when it isn't necessary, or the customer didn't ask that. To us, time is money. Most of the time, they don't answer the phone because of many reasons. If the csr's would get the proper information to complete the transaction, our job would be easier. They neglect to get full first and last names, in case it's a place that has a call box to enter. They give a name that isn't in a directory. They don't give apt number. They don't give code to call them at the entry point. Etc.\n\nAlso, once we get the correct information, to get to the customer faster, they won't edit the record, for the next time they call, so we have to go through this every time we deliver to them!",
        "created_utc": 1440403244,
        "upvote_ratio": ""
    },
    {
        "title": "Has this happened to anybody?",
        "author": "jpalm101188",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i5fom/has_this_happened_to_anybody/",
        "text": "Ok... I use to work at pizza hut about 5 years ago and one night this lady calls for delivery and orders pepperoni and sausage on one side and mushrooms and pineapple on the other.... As soon as she gets the pizza she calls and complains about her topping being on the wrong side. She literately argues with me for like 10min asking for order to be free and her next 3 orders free witch she didnt get. Just some bitch trying to get a free meal",
        "created_utc": 1440381839,
        "upvote_ratio": ""
    },
    {
        "title": "College town delivery drivers, please chime in.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i5899/college_town_delivery_drivers_please_chime_in/",
        "text": "I've worked as a delivery driver in the past, but it was in a middle class suburb. How does driving in a college town compare? The college is a large SEC school.",
        "created_utc": 1440378202,
        "upvote_ratio": ""
    },
    {
        "title": "The worst return ever.",
        "author": "iftreescouldspeak",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i4g2m/the_worst_return_ever/",
        "text": "So I work for this independently owned chicken delivery place that is mostly in college towns. \n\n\nSo I've worked here on and off for the past 2 years and have recently come off of a long break (about a year) to work full time again. Yesterday was my first day back and it was so bad. I lost my bank on my first run (about $40. I guess it could have been a lot worse) and my cars starter decided yesterday was the best day to give out. I felt like an idiot. Good thing I have amazing co workers that let me borrow their cars so I can keep working so I can replace the starter.",
        "created_utc": 1440365243,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza guy ate half my mozzarella stick?",
        "author": "reformedman",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i49k1/pizza_guy_ate_half_my_mozzarella_stick/",
        "text": "I noticed after I opened the package that I had 7 inahalf sticks... It looked like he ate half of it. Are they suppose to be uniform length? I'm really confused and it looked like it was bit. ",
        "created_utc": 1440362292,
        "upvote_ratio": ""
    },
    {
        "title": "Well, I feel like a dick...",
        "author": "datmetaldough",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i454q/well_i_feel_like_a_dick/",
        "text": "I (the GM) scheduled a meeting at 8 am this morning. Nothing major, just training for a new product and program launch, but it has to be done this week. Well I closed last night and got out of the store at 2:20 am, and that's when I fucked up by deciding to imbibe some tasty libations. Long story short, my ass was passed out at 8 am. So now everyone is probably revolting because I made them come to work at 8 am for no reason what-so-ever. I feel like a dick and am dreading showing my face at the store tomorrow...",
        "created_utc": 1440360340,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why are there three pizza delivery guys for one delivery and one of them has a baseball bat?\"",
        "author": "ceMmnow",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3i1wkq/why_are_there_three_pizza_delivery_guys_for_one/",
        "text": "I deliver downtown of a busy college campus. Our parking lot is below a ten+ story building.\n\nToday we noticed two of our cars were splashed, presumably with water or alcoholic beverages. Whatever, happens all the time on a Friday or Saturday night. Drunk rich college kids plus balconies.\n\nHowever as one of our drivers pulled out, a loud bang occurred - someone threw a full Pepsi bottle at his roof, which shattered. Best yet, it was full of water, which meant someone filled it up intentionally and threw it at a moving delivery driver.\n\nWe called the cops and tried to pinpoint which apartment it was. Cops just knocked on a few doors and got nothing. We determined it had to be an 07 apartment, as in 907 (the ones we suspected, also EDIT: numbers changed for anonymity purposes), because of where water and bottles (our parking lot has shattered glass all over it now) landed. It's a corner apartment, allows them to hit the range they did.\n\nWe raged for a while but nothing happened. But an hour later, lo and behold, 1007 places an order. It's a slow night so we took the broken can, a baseball bat, and a knife with three drivers to the delivery. Yes, in hindsight an incredibly dumb move, but we were pissed. The driver hit was driving his just bought car. A couple years back a non driver car had a windshield shattered from a bottle thrown so we were fed up. One guy stood back with the bat since we didn't want to pick a fight with innocent people - all our plan was was to see if they had wild cherry Pepsi and were belligerent, in which case we'd just refuse to deliver.\n\nThey seemed chill and not the suspects, so we asked them and they said the apartment above them had been throwing shit onto THEIR balcony all day, including a whole uneaten pizza.\n\nWe decided to call it a night instead of pursuing it further, but the best part of the whole story is all three of us walking out of the apartment, one with a baseball bat. We just hear a security guard say, \"I'm so confused. Why are there three delivery guys and why does one of you have a bat?\" We laughed, said not to worry about it, and walked off. They're generally just as sick of the drunken shenanigans so they seemed to think it was funny, too.\n\nSo that's my slow night! Hope all you closing drivers are having a better one than us.",
        "created_utc": 1440308881,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery ticket says \"Please send your hottest delivery guy\"",
        "author": "baconstripsandrum",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hzxq8/delivery_ticket_says_please_send_your_hottest/",
        "text": "It's my next order. Let's see if I'm a disappointment or not!",
        "created_utc": 1440270496,
        "upvote_ratio": ""
    },
    {
        "title": "My most annoying experiences working for Domino's",
        "author": "Chase3287",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hy8nz/my_most_annoying_experiences_working_for_dominos/",
        "text": "First time poster, but I've been a driver for nearly a year. It can be a fun job if you have cool coworkers, which thankfully I do. But sometimes it can be so annoying and frustrating. \n\nI have a couple of stories to share. Deliveries and phone calls. \n\n**No Checks**\n\nAt Domino's we don't accept checks as payment. You only have the options to pay with a card or cash. You're told this over the phone, and it even tells you when you order online. \n\nSo, I go to take a 'cash' order, to a hotel worker. Apparently the penthouse was undergoing construction, so I had to ride the elevator up to the highest floor, then call her so she could meet me on that floor. Of course it takes her about five minutes to walk down a flight of stairs to meet me. \n\nWhen she arrives I almost instantly notice the checkbook in her hand. I ignore it and greet her, this is how the whole encounter went down: \n***************\n*Me:* Your total is going to be 15.61\n\n*Her:* You take checks, right?\n\n*Me:* I'm sorry, but we don't accept checks. We only accept cash and cards. \n\n*Her:* Oh. Well, if I go get my credit card, can I pay with it instead? \n****************\n\nI tell her it's fine, and get my phone out to call the store so they can change the order. It takes her another 5 minutes to get her card, and at this point I just want to walk out with the food. \n\nWhen she finally returns, I hand her my phone and she reads off her information to an insider, and they change her order. I get her to sign the delivery ticket since I obviously don't have the receipt on me. She tips me decently, which lightens my mood a bit. I tell her to have a nice day, and she walks back up the steps. \n\nAnd just as I'm getting into the elevator, I hear her open the door, and yell inside to a group of coworkers, \"Most complicated delivery ever!\" \n\n**TL;DR:** Customer chooses \"pay with cash upon delivery option\" fully intending on paying with a check. She has to change her order to credit over the phone, then acts like its my fault the delivery was so complicated. \n***********************\n\n**The Beach** \n\nOne of the most annoying things about working near the beach, are all the tourists who don't know where they are, or where they're going. Then there's the people who want us to deliver onto a crowded beach, like we're supposed to be able to guess who they are. \n\nOne day, this girl calls. I'm assuming she's just really hyper and talkative or something, but it turns out she was drunk. She goes ahead and tells me what she wants, ignoring my inquiry of her location. Already I'm hoping another driver has to take this. \n\nAfter I get her order she tells me she's \"on the beach, *near* 20th street.\" I automatically tell her we have a policy of not delivering onto the beach. She lies and tells me she does all the time during the day. (Which I know is a lie, since I almost always work day shift.) \n\nAfter repeating myself at least four times, I try to compromise with her and tell her we can meet her at a nearby hotel. (Hotel A) \n\nI end up having to take the order, and delivering it was more of a nightmare than the phone call. I drive to the hotel and park in a little back parking lot that overlooks the boardwalk and beach. I figure it will be easier for her to find me. When I park, I give her a call. She doesn't answer the first two times, of course. \n\nWhen she finally does answer, I tell her I'm parked at the hotel we both agreed on. This is how this encounter went down: \n***********\n\n*Her*: I don't see you! Where are you?\n\n*Me:* I'm parked behind *Hotel A*, on 20th street. You said you wanted to meet here, right? \n\n*Her:* Yeah. But I don't see you, I'm at *Hotel B*. \n(Hotel B is right beside Hotel A)\n\n*Me*: That's ok. If you get back on the boardwalk, and walk down it just a bit, Hotel A is right beside it. \n\n*Her*: Ok. Hold on. (Then proceeds to start asking me about my personal life while she wanders around.) \n\n*Her:* I cant find you! What's your car look like?\n\n*Me:* It's a blue Saturn, with a Dominos sign on top. \n*******************\n\nShe then tells me she's near a store a street down, on the shopping strip. Somehow, she got from Hotel B, to the store in a couple seconds. It takes another couple minutes of explaining where I am for her to finally find me. Of course, she didn't tip at all either. \n\n**TL;DR:** Drunk girl orders pizza, but doesn't know where she is, and doesn't know how to get to the hotel we agreed to meet at. Somehow teleports from a hotel, to a store a block away. Makes me wait at least ten minutes while she looks for me. \n***************\n\nThen there's the customers who call and just mumble into the phone the entire time, then get upset when they have to repeat themselves. Fuck them. ",
        "created_utc": 1440233115,
        "upvote_ratio": ""
    },
    {
        "title": "\"Took Our Jobs!\" and \"Wasting Tax Payer Dollars!\" caricature comes to life! Trolls my pizza store. (re-post)",
        "author": "marble10",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hxeae/took_our_jobs_and_wasting_tax_payer_dollars/",
        "text": "Let me begin by giving an honest apology to the many customers whose orders my staff and I have messed up through the years at the pizza store that I work for. I understand that people, including myself will often become increasingly mad when they are hungry, and that paying exorbitant fees for the product at my particular store makes it all the more maddening. \n\nThat having been said: \n\nThe other night after returning from a delivery, I walked into our store, which had been closed for carry-out to find my manager, same age as me- late 20s, venting about a customer that had just cussed him out over the phone. Now, this particular manager is basically the most professional human being I've ever met. He explained that during the hail of curses and disparaging remarks, he had done his usual job in calmly, professionally offering to both refund and remake a pizza that we had done wrong, and I believed him because I've seen him remain calm in the face of drunken, homeless, drug-induced or just down-in-out customers many times before. \nAlas, the customer refused any kind of reparation and after taking abuse from her for a few minutes; my manager respectfully voiced his human right not to receive such verbal abuse and told the customer to call the corporate office if she had any other concerns, and that he would be hanging up. \n\nI continued with my closing chores/ prepping for the next delivery. A few minutes later the customer showed up with her daughter and I assume her son, her artillery, who was sure enough flexing his big gun biceps like he meant business. I nervously glanced at my manager, got out my phone and asked him if he wanted me to call the cops (happened once before to me because of a road-rager who followed me into the store and “assaulted” aka slapped away my raised, open hands). My manager declined, and proceeded to open the locked door. If I was in his position as manager, I probably would not have opened the door. This was a potentially dangerous situation, and the body language was obviously threatening, the customer having already proved that she was not going to \ncompromise civilly. \n\nFortunately, my fears were unfounded. The customer let it be known that she was upset; but this is when the story turns into the strangest possibly reverse-xenophobic, debased, anti-government rant that I have ever encountered. As she was walking out the door she said that “There are many people looking for jobs that can’t find ‘em because of you people! You’re taking their jobs!” and “You’re wasting tax payer money!!” \n\nAs you might have guessed, I work for a large pizza corporation that is in no way related or affiliated with the US government. Secondly, my company has a history of hiring and firing people on a whim, so there is no way that we are taking jobs, unless the person has already been hired and fired. Lastly, I get a lot of personal jabs over the phone on a weekly basis, about pricing policy decisions that corporate has made; many of which I disagree with. And many (all) of these giant companies are not democratically operated or even open to suggestions from employees. \n\nGet a new job? This is the best paying non-skilled job in my area. Get an education? I am. That having been said, the company I work for has spit out countless individuals that simply do not have the capacity to work or educate into a skill, and never will. The opportunities are not infinite. The solutions aren’t that simple.",
        "created_utc": 1440211649,
        "upvote_ratio": ""
    },
    {
        "title": "Last day is proving that my decision to leave was right. ..",
        "author": "Siddabear",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hx2yz/last_day_is_proving_that_my_decision_to_leave_was/",
        "text": "Returning from my 4th delivery of the night,  2 hours into my shift. So far,  a whole two pennies in tips. Here's to hoping Domino's in a better area of town  yields a worthwhile income.\n\nEDIT: Ended the night after 4 hours with 62 miles driven, 7 orders delivered, $2.06 in tips (one $0.02 and one $2.04), and $8.40 in mileage reimbursement.",
        "created_utc": 1440205406,
        "upvote_ratio": ""
    },
    {
        "title": "Just had a nice shift",
        "author": "sublimeluvinme",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hvadw/just_had_a_nice_shift/",
        "text": "I just made 50 bucks in tips on a 3 hour shift with only seven orders...and the best part? I only drove a total of 12 miles! Of course it isn't the most i have made but I can't say it has come easier before. How are the roads treating you today?",
        "created_utc": 1440176350,
        "upvote_ratio": ""
    },
    {
        "title": "First night",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hv7yu/first_night/",
        "text": "I'm in an incredibly desperate financial situation so I decided to get a job delivering pizzas to make ends meet for the time being and had an interesting first shift.  \n\nFirst delivery, I ride along with another driver who's one word answers to my attempts at conversation just led to me awkwardly sitting in his car until he turns to me and says he has a flat.  We get there, still says nothing so I just start to change his tire for him because something needs to get done.  Another driver from our store pulls up behind us with a delivery to the same hotel (they were both pissed) so I get in his car to go back to the store.  MOD says I'm going to be driving now, still have received no training on the computer system at all, but ok, lets make some tips.  \n\nSecond &amp; third are easy, no problems, back in 20 minutes both times.\n\nFourth, I get sent to 1100 \"Three Word Name\" rd and it's an empty field.  I call the number on the receipt. \n\n\"I didn't order it for myself, it's meant to go to \"city name\".  \n\nYou mean \"City name\" Academy?  \n\nUh, I guess that's it.\n\nOff I go.  5 minutes later I get a call from the store asking where I am, I explain the situation and that I'm on my way, and my closing manager says did you call the number?  BITCH DID YOU NOT LISTEN TO WHAT I JUST TOLD YOU?  I hang up, get to academy, no idea where to go, see another pizza guy and ask to follow him.  20 Minutes of waiting in parking lot, with another unhelpful conversation from the store that I hung up on, I finally get the delivery done.  The correct address was 1001 Word rd.\n\nFive is easy, just need to learn the complex number better.\n\nSix and Seven get mixed up and brought to the wrong address by my fault after being frustrated by the night so far.  Oh, and at this point I'm the only driver left as everybody else has gone home.\n\nEighth is easy, no problems.\n\nNinth is to a college campus and the kid tossed me five bucks.\n\nFuck me, I hope it gets better with experience and learning the area better.  Ended up with $35 in tips after driving 50 miles over a seven hour shift.",
        "created_utc": 1440175322,
        "upvote_ratio": ""
    },
    {
        "title": "\"Whatever, you don't give a shit\"",
        "author": "Striker__Eureka",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hu2p0/whatever_you_dont_give_a_shit/",
        "text": "I took a delivery to a nice apartment complex, I usually have good luck with tips at it and people don't order from there quite as often as other apartments so I was looking forward to seeing what I got. This complex there's three different buildings and they're 4 stories high with elevators in each. It's very nice and easy to navigate, so I enjoy going there.\n\nI got to the customer's door and was greeted by a guy who seemed friendly enough at first, he then notified me that he'd already tipped me online. For those that don't know already, you cannot tip online with Domino's, you have to give cash or add it to your card, like you would at most sit-down restaurants.\n\nOur exchange went a bit like this:\n\n\"And I already put your tip online.\"\n\n\"Oh, uhh...I'm sorry but I don't think we have that option.\"\n\n\"Well, I already gave you your tip, I tipped 20%. My total was like $20 before so now it's like $24, so that $4 is your tip.\"\n\n\"That's news to me, because I haven't heard of them adding anything like that.\"\n\n\"Whatever, I know you don't give a shit. You're just like 'Whatever dude, just shut the fuck up and take your pizza.' Here, I'll give you $2 on the card, but I already tipped you so now I'm giving you like $6, and that's very generous.\"\n\n\"Well, I do appreciate the tip. I'll have to check when I get back to the store on the online tipping thing, just to make sure. If so, I'll happily remove this $2 and just take what you already gave me.\"\n\n\"Whatever, you don't give a shit.\"\n\nThe guy then hands me back my clipboard and slams the door in my face, and I stand there momentarily a bit confused before I just laugh and walk away. When I got back to the store, I checked his order in the system and the $24 total was for what he ordered, tax, and delivery fee. \n\nIn other words, he was full of shit and tried to play it off like it was me trying to get more money out of him. I warned the other drivers about him, because chances are he'll try to pull it again.",
        "created_utc": 1440154964,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery 5 minutes before close",
        "author": "AyoJake",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3htain/delivery_5_minutes_before_close/",
        "text": "Thank you for ordering barely above the minimum 5 minutes before close at the edge of our delivery zone and not tipping me. \n\n",
        "created_utc": 1440133752,
        "upvote_ratio": ""
    },
    {
        "title": "Is being a delivery driver worth it?",
        "author": "WHALE_SHIT_MATE",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hsljd/is_being_a_delivery_driver_worth_it/",
        "text": "I'm looking for a new job and I think I would enjoy this one. Thing is though I don't want to put my nice car through hell and back, so I'm thinking of buying an old beater for and using that. Most places around here pay minimum wage ($10.50 CAD) plus all tips, and a car that I can use would cost anywhere from $300-$800 depending what I get. Is it worth buying a car for this? I think I'd like the job and I'm good at getting tips but I need to know if it's worth doing.\n\nEDIT: Another question, do places usually check driving records? I've got one speeding ticket and two collisions under my belt. One at fault fender bender in a parkade, and one non at fault where the other driver fled the scene. ",
        "created_utc": 1440120753,
        "upvote_ratio": ""
    },
    {
        "title": "changing my job from day to night shift - anyone who worked nights as delivery-guy?",
        "author": "biszek",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hre96/changing_my_job_from_day_to_night_shift_anyone/",
        "text": "Hello everyone. I've been reading this board for some quite time. For the past year I've worked at a kebab place in my city. Today, all of a sudden I got fired (it turned out that boss decided to fire all polish people and hire muslims only - lol). Oh yeah, btw, I'm from Poland. Anyway, tommorow I'm starting my new job at pizza place that doesn't have its own local and they only deliver to customers (from 17:30 to 3-4 am). Is it much different? Except that you (probably) have to deal with drunk people more often? I expect higher tips too but we'll see. Oh, and another thing I like about it is that the streets are pretty much empty during the nights here (only cabs and police ;_; )\n\nThanks for reading and I hope to read some interesting histories of your night deliveries.",
        "created_utc": 1440101218,
        "upvote_ratio": ""
    },
    {
        "title": "I was hired for my first big boy job today.",
        "author": "SaxMaan",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hoto7/i_was_hired_for_my_first_big_boy_job_today/",
        "text": "I've been working pizza since I was 17. Initially started as a cook a Pizza Hut, worked up to CSR and then Server. Quit that job to go to college. \n\nCame back for a summer and worked at a random (disgusting) pizza joint for a couple months. Quit because the assistant manager (who was dating the general manager) pulled a knife on me when I asked him to help on the make line. \n\nWorked at a local pizza place in my college town. It was good except when the owner was there. He would yell and curse at the staff to get his kicks. He would watch us from his iPhone through cameras he set up in the kitchen, call in, and critique us on our work. It was like always having the owner watch you. Beyond that, though, the staff was great and the pizza was good. I quit because the owner cussed me out, in front of customers and everyone, for smirking at him when he was talking to me, and that was disrespectful. I just thought I was smiling, because I smile at people when they talk to me.\n\nHired and started at Domino's literally two days later, where I will have worked for two years tomorrow (Thursday). The coworkers have been the great, the management has been perfect, and the (college town) money has been amazing. Sunday will be my last day. \n\nToday I was hired to teach elementary music. The whole college thing all came together. My first all-staff day is tomorrow and school starts next Thursday. I am beyond excited. The school is 800 students, which means 800 young lives I get to enrich musically. I'm going to finish out this weekend with Domino's and say goodbye to some of the best coworkers I've ever had.\n\nAnd hopefully not have to reapply in the summer. =)",
        "created_utc": 1440052880,
        "upvote_ratio": ""
    },
    {
        "title": "Refreshing",
        "author": "thingsok",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hos00/refreshing/",
        "text": "There's a lady at work named kay, but she always puts it under her husband's name even though she always picks it up. She seemed really cool last time I saw her but we messed up her pizza by forgetting to sprinkle some cheese on top of the specialty so I apologized and gave her a 2 dollar credit for next time since she decided to keep the pizza anyway. She called today and I took the order and had a brief conversation about it with her since she had forgotten about the credit (finally someone who isn't contantly trying to squeeze money out of us) that was actually really pleasant then hung up. When she came in I noticed shed gotten a rather dramatic haircut and I complimented it. She seemed really happy about it and we ended up talking (we always kind of chat when she comes in anyway, but just a little) and it was just really nice to talk to a customer that wasn't bitchy or in a hurry",
        "created_utc": 1440051793,
        "upvote_ratio": ""
    },
    {
        "title": "Are any of you guys delivering around the Atlanta/North GA area?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hnm5p/are_any_of_you_guys_delivering_around_the/",
        "text": "*Jesus*. Half our delivery area is flooded and unreachable, my shoes and car are covered in mud, and my car is basically a boat with the amount I'm hydro-planing. All for the hope of a few bucks. We don't get enough credit for this shit. ",
        "created_utc": 1440029799,
        "upvote_ratio": ""
    },
    {
        "title": "I'm getting promoted faster than Jimmy Johns can deliver",
        "author": "DontNeedNoBadges",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hn4fz/im_getting_promoted_faster_than_jimmy_johns_can/",
        "text": "The owners have removed the current GM due to... well, a lot of reasons, really and I probably can't go into anything that happened.\n\n\nSo what does this mean for me? Well apparently they want me and one other person to take the job. I don't know how that would work out but we would essentially split the job but both get the pay raise. I am already dedicated to other jobs and explained I wouldn't be able to dedicate 40 hours a week to them, but they don't care, they say the two of us care about the store and want to put it in our hands. \n\n\nI told them to give me some time to think about it. I don't know how I feel about it, I just barely learned how to be a shift leader! I'm torn. Is it worth it? I really do want to see the store get better, and I do feel that I, with the help of the other person, can get that done. I think *we* can get that done.... ",
        "created_utc": 1440022122,
        "upvote_ratio": ""
    },
    {
        "title": "I can't even make that for myself, man",
        "author": "thingsok",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hmj2z/i_cant_even_make_that_for_myself_man/",
        "text": "Cheeseburger lady post reminded me of this \n\nMe: [pizza place] may I help you please? \n\nHer: yes can I get the big square deal and one order of mozzarella sticks?\n\nMe: no I'm sorry, we don't have either of those. The big square deal ended over 8 months ago now, and we can't make those pizzas, and we've never carried mozz sticks here. \n\nHer: no I just had them last week from you guys!\n\nMe: are you sure you're thinking of the right place?\n\nHer: yes I called [store phone number] and got mozzarella sticks.\n\nMe: ok well we don't have a fryer, or mozz sticks, so I really can't make them for you. \n\nHer: can I talk to your manager? I don't understand why you're lying to me about this. \n\nI went and got my manager (unfortunately I wasn't yet a manager at this point so I couldn't just deal with it myself) and I guess she hung up before he got there. \n\nOn a separate occassion a man came in one minute before close and kept asking for some special deal that I think is from pizza hut, demanding that we give it to him when we don't even have all the items that would have been included. He was there for ten minutes arguing about it and we couldn't get him to leave so we could close up. Anyone have any similar stories?",
        "created_utc": 1440013694,
        "upvote_ratio": ""
    },
    {
        "title": "No ma'am, we don't sell cheeseburgers.",
        "author": "trmbnplyr1993",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hmbin/no_maam_we_dont_sell_cheeseburgers/",
        "text": "So this happened a couple of hours ago, and I apologize for any formatting errors, I'm on mobile.\n\nSo in the middle of our lunch rush we get a phone call for delivery. Me is me, and CL is Cheeseburger lady.\n\nMe: Thank you for calling \"pizza place\" how can I help you?\n\nCL: Yes, I'd like to place an order for delivery.\n\nMe: Okay, what can I get you today?\n\nCL: I would like 2 cheeseburgers all the way with lettuce and tomato.\n\nMe: I'm sorry?\n\nCL: I said I would like 2 cheeseburgers.\n\nMe: Ma'am this is \"pizza place\", we don't sell cheeseburgers.\n\nCL: Yes you do, you had them before the store burned down.\n\nMe: Well I don't know what they sold before the store burned down but they definitely don't have it now.\n\nCL: Oh, okay. Well nevermind.\n\nI honestly don't know if they sold cheeseburgers here before but I seriously doubt that  they did. Even if we did, why would you get a burger from a pizzeria instead of an actual burger joint. And are there any places that sell burgers and pizzas in the same place?\n\nEdit: TIL a lot of places sell burgers and pizza together.",
        "created_utc": 1440010776,
        "upvote_ratio": ""
    },
    {
        "title": "Thanks Guy",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hm83r/thanks_guy/",
        "text": "This was a tip today. I feel my soul is a little richer",
        "created_utc": 1440009519,
        "upvote_ratio": ""
    },
    {
        "title": "346-POUND MAN PUNCHES DOMINO'S PIZZA GUY FOR FORGETTING HIS GARLIC KNOTS (X-POST from /r/floridaman",
        "author": "Wetbung",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hm59n/346pound_man_punches_dominos_pizza_guy_for/",
        "text": "Not my story, but it seemed like it belonged here.\n\n[Not Garlic Knots](http://www.browardpalmbeach.com/news/346-pound-man-punches-dominos-pizza-guy-for-forgetting-his-garlic-knots-cops-say-6471471)",
        "created_utc": 1440008430,
        "upvote_ratio": ""
    },
    {
        "title": "96 Cents",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromThePizzaGuy/comments/3hlp1y/96_cents/",
        "text": "It was a sunny Thursday afternoon, not too hot with a nice breeze. The birds were chirping, the air had a sweet summer smell to it. \n\nNow, I could be exaggerating all of this because I was finally on the road again after managing for what seemed like forever. \n\nI'm 12 orders into what had the promises of being a perfect shift. That is until the delivery pops up. \"Shit, I'm going to Sunflower Square, there goes my perfect day!\" I was less than enthused but I put on my fake smile, grabbed my delivery as it came out of the oven. I was running 13 minute times from dispatch to return. I was hell on wheels. I was unstoppable. I was feeling good. \n\nI pull up to the apartment building 17 minutes after the customer ordered. I was on top of my game. I buzz her buzzer. Wait a mintue. Buzz again. \"Come on lady, your messing with my times.\" I think as she finally buzzes me in. I walk down the stairs and knock...and wait. In reality it was probably only a minute or two but it felt like forever.\n\nFinally I hear rustling in the house. She finally answers the door and I put on a big smile. \"Hello, how are you?\" Silence. \"Your total is $15.04.\" She hands me a $20. \"Alright, $4 is your change.\" I count it out and hand it to her and tell her to have a nice day when she finally speaks to me. \n\n\"Uh, don't you owe me more money?!\" \"Well ma'am, we don't carry change on us.\" \"Okay...so?\" \"Well, your total was $15.04 and I don't have $.96 cents on me. If you give me $.04, I can give you a dollar back but other than that there's nothing I can do.\" \"Well, what bills do you have?\" This unnerved me for some reason. The smile left my face and nice tone faded from my voice. \"Ma'am, it doesn't matter what bills I have on me, this is not a matter of paper money. The issue is coinage. I do not carry coinage on my person. Therefore I cannot give you the $.96, however if you have 4 pennies I can give you a dollar bill back. Other than that there is nothing I can do.\" She disappears into her apartment and reappears with 4 pennies, drops them in my hand, I hand her a dollar, give her the biggest fake grin I can muster, tilt my head slightly and give her a huge \"Have a nice day!\" dripping with sarcasm. \n\nNow, of course I could have handled this differently. I could have just ate the 4 cents, I mean, it's 4 cents. I could have just gotten it from the manager on duty. I could have done any number of things but I am fundamentally opposed to paying for my customers food, even if it is just 4 cents. I know, it's their change and we're supposed to give them the full amount back but we have never been told to carry change. If the lady wasn't a cunt I would have been nicer too...",
        "created_utc": 1440002106,
        "upvote_ratio": ""
    }
]