[
    {
        "title": "Four adults, one week",
        "author": "FaustusC",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8q224t/four_adults_one_week/",
        "text": "[removed]",
        "created_utc": 1528649391,
        "upvote_ratio": ""
    },
    {
        "title": "Encyclopædia Moronica: W is for Words Matter",
        "author": "Gambatte",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pzst3/encyclopædia_moronica_w_is_for_words_matter/",
        "text": "&gt; Communication is absolutely the bedrock of any relationship, whether it be romantic, platonic, business or any other sort of configuration. Indeed, one could make the argument that communication is the relationship, that two entities effectively have no relation to each other if communication - even if only the wordless presentation of one's existence - is not there.\n\n\\- Mason Williams, *aka* Tailsteak; *Leftover Soup* author's commentary, [page 734.](http://www.leftoversoup.com/archive.php?num=734)\n\n---\n\nIt was a Saturday in early winter - cold, but clear. Snow had fallen a few days previously, but had melted away in all but the coldest and darkest corners of town.  \nMy children were quiet and reserved; this would have been highly unusual, if not for the mucous that frequently ran from their various facial orifices. While I sought to battle the invading Sinus Goblins, trying to prevent them from gaining a foothold that would be difficult to dislodge them from, my wife tended to the children, seemingly impervious to their attack.\n\nSo it was with a specific lack of enthusiasm that I answered the suddenly ringing on-call phone.\n\n&gt; Dispatcher (D): Hey G.\n\n&gt; ME: Hey D, what's up?\n\n&gt; D: Do you look after *{site}*?\n\n&gt; ME: No. Wait, yes. Maybe? I think I might have gone there once, about six months ago? I remember a long drive but not much else.\n\n&gt; D: That's probably right; they're pretty far off. It looks like the site's on some weird support contract, so you probably almost never hear from them.\n\n&gt; ME: Makes sense. What's the issue?\n\n&gt; D: Well the Helpdesk just called me; apparently the site rang in, reporting that the screen is showing a *'system unavailable'* message.\n\n&gt; ME: Dammit!\n\nThe system could show many messages - some good, some bad. For example, \"system not ready\" was a standard message that meant the system was still booting up (startup time is approximately 10 minutes); however, \"system unavailable\" indicated that a serious error had occurred - the sort that can only be resolved by replacing the entire system completely. The process consisted of me installing the new hardware, a remote engineer configuring it, and then me testing it prior to departing site. A competent engineer could complete the remote configuration in about half an hour; however, my personal experience was that I would have to wait anywhere between 1.5 and 4 hours... and the wait was always much longer outside regular business hours.  \nLike on a Saturday. Like today.\n\nTo say that I did not want to deal with it would have been an understatement on par with calling Mt Everest \"that little incline\".\n\nBut I was on call. What I wanted was not an option.  \nIn the common vernacular, I was *\"le sigh.\"*\n\n&gt; ME: Yeah, okay, assign and push the job to me - I'll pick up a replacement system from the depot and get on the road.\n\n&gt; D: Um... Do you know how to do that?\n\nTo be fair, we recently switched to a new job system. Also, D just got a promotion, which means very shortly, he'll no longer be dealing with the after hours jobs.  \nFortunately, I had just spent two hours in an intensive training session with the new system, so I had a pretty good idea of what needed to be done.\n\n&gt; ME: Yes. Maybe. I'll have a go.\n\n&gt; D: Cool, the job number is 12345.\n\nI quickly downed a couple of painkillers, and got to work.\n\nAfter battling through the login system for the job management software, I quickly found the job. With a little educated guessing on the specifics of the process, I soon had it assigned to myself, even taking the time to send myself the required SMS notifications (because otherwise the status sits on PENDING DISPATCH; actually sending the notification changes it to DISPATCHED, allowing me to carry on with the next steps).  \nPaperwork¹ completed, I quickly changed into a clean uniform, grabbed my keys and headed in to the depot. Fortunately, I have fresh systems boxed up and ready for immediate pick up for exactly this situation, so I grabbed one and ~~dropped~~ carefully placed it on the passenger seat. Then I punched in the site address to the GPS.\n\n&gt; ETA: 1 hour 45 minutes\n\nWell, crap. I knew my Saturday was already shot, but the realization that I won't see home again until well after dark suddenly hit home.  \nI started the engine and pulled on to the road.\n\n---\n\n^(¹ \"Paperwork\" is an odd term for an activity completed entirely in the digital realm - I imagine it will one day end up much like the) ^[floppy](https://i.imgur.com/Ft7oopQ.jpg) ^(is today.)\n\n---\n\nThe miles hissed away beneath the tires; except for one quick stop for road snacks, I'd been driving constantly. Snow still littered the edges of the roads - it seemed that at this altitude, it was less prone to melting. It didn't help that a large section of the drive was under repair; the roadworks had stretched for miles and miles. I guesstimated that I'd averaged at least 20% under the speed limit; this was borne out by arriving almost half an hour after the original estimated arrival time.  \nBut finally - at long, long last - I pulled in to the site.\n\nIt was deserted.  \nThis is not unusual - the system itself is mostly autonomous, with most usage occurring in either late at night or early in the morning.\n\nI checked the screen.\n\nThere was no error message.\n\nAll systems appeared to working correctly. I grabbed my test equipment from the van and carried out a full system test.  \nIt passed on the first try.  \nNo errors.\n\nI picked up the phone.\n\n&gt; ME: Hey D!\n\n&gt; D: Hey G, are you at site yet? What did you find?\n\n&gt; ME: Yes, I just arrived. And as for what I found... I've got nothing. It's all working perfectly.\n\n&gt; D: Well, damn - that's weird!\n\n&gt; ME: I know - 'system unavailable' is usually a complete replacement, right?\n\n&gt; D: It is in my experience!\n\n&gt; ME: Okay, well... I guess I'll just close the job then, and drive another couple of hours to get home then.\n\n&gt; D: Yeah... I mean, there's not much else you can do... Did you...?\n\n&gt; ME: Yep.\n\n&gt; D: Oh, and did you check...?\n\n&gt; ME: Sure did.\n\n&gt; D: Huh. Well, if all that's clear, then I guess there's nothing for it, except to close the job.\n\n&gt; ME: Okay, I'll do that now.\n\nThen I saw something.\n\n&gt; ME: D, I'm going to break my cardinal rule here, and curse loudly on a customer's site. It's OK; this place is abandoned.\n\n&gt; D: What? Why? Huh?\n\n&gt; ME: ***[7DW](https://en.wikipedia.org/wiki/Seven_dirty_words)!!!***\n\n&gt; D: What's going on?\n\n&gt; ME: Check the job notes.\n\n&gt; D: What? Okay... oh, ***[7DW](https://en.wikipedia.org/wiki/Seven_dirty_words)!!!***\n\n&gt; ME: That's what I said!\n\nIn the job notes, the third sentence read:\n\n*Screen shows error message* **'system not ready'.**\n\n&gt; D: I'm sorry, G; Helpdesk told me it was 'system unavailable' and I never thought to check what he'd actually written down in the job notes - I assumed he knew that UNAVAILABLE is different and distinct from NOT READY.\n\n&gt; ME: Well... sh!t happens. I guess the system reset for some reason, someone tried to use it while it was starting up, got the NOT READY error and reported it to Helpdesk, who recorded it correctly in the notes but passed it on incorrectly during the verbal escalation.\n\n&gt; D: Yeah, sounds about right.\n\n&gt; ME: So... it was probably working correctly again by the time I had finished assigning the job to myself in the system.\n\n&gt; D: That message never sticks around for more than 15 minutes; you're probably right.\n\n&gt; ME: Well... I'm going to go home now. I'll let management figure out what to do with this job on Monday, because I figure I'm going to be pushing five hours² of time and a half, for a job that I didn't actually need to attend, for a customer who gets billed time and materials.\n\n&gt; D: Yeah, this is going to suck.\n\nD is located in the same office as the managers that are going to have to deal with this.\n\n&gt; ME: Better you than me, bud.\n\nWith that, I disconnected the call, started the engine, and got on the road once more.\n\n---\n\n^(² May your preferred deity bless after hours call out time blocks.)\n\n---\n\nFour hours and change after I'd left, and well after the Golden Orb of Fire had once again been swallowed by the Black Serpent, I finally returned home. I immediately swallowed another round of painkillers, devoured a [small bucket of ice cream](https://www.deepsouthicecream.co.nz/product-page/rum-raisin-500ml), and passed out for some eleven hours.\n\nThe Sinus Goblins were not successful in establishing a foothold this time, but at least I still felt like crap.",
        "created_utc": 1528623644,
        "upvote_ratio": ""
    },
    {
        "title": "The woman that knew it all",
        "author": "IAmAUser4Real",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pzm7y/the_woman_that_knew_it_all/",
        "text": "[removed]",
        "created_utc": 1528620631,
        "upvote_ratio": ""
    },
    {
        "title": "sometimes two mouses are better than one",
        "author": "harrywwc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pzfq1/sometimes_two_mouses_are_better_than_one/",
        "text": "last year a colleague damaged her right (dominant) arm with an OOU/RSI^* -style injury. This hand, obviously, uses the mouse a lot, and this was causing more than a little discomfort.\r\n\r\nAt first she tried just moving the mouse across the desk for her left hand to use, but the buttons were (of course) under the 'wrong' fingers. So, she asked me for a second mouse (without explaining why) and she plugged it in, but still had \"issues\".\r\n\r\nShe finally asked me \"how do I change the mouse buttons?\" and so I showed her where the rodent's settings were in Win10.\r\n\r\nBut she **still** hadn't explained what was going on.\r\n\r\nShe struggled along for a few more days, but came to me in frustration (and more than a little pain, no doubt)… \"every time I want to use the mouse on my left hand, I have to go into the settings to swap the buttons. And when I want to use the one on my right hand, I have to swap it back.\"\r\n\r\nAdd to that, the mouse on her right hand was \"too heavy\".\r\n\r\nI had a think. She needs two mouses [yes, I know, the plural should me \"mice\" - but a long time ago a certain bunch of 'Murikans deemed that it is \"mouses\" when referring to more than one computer mouse], and she needs the one under her right-hand to be \"right-handed\" and the one under her left-hand to be \"left-handed\". It would also help if the right-handed mouse was lighter than a normal mouse.\r\n\r\nCan't do it with the one mouse-driver... hmmmm…\r\n\r\nI pulled out a light-weight wireless mouse ($low-GI-tech - although, why you would eat one is beyond me, but \"low-GI\" is supposed to be good for you) and put the dongle in the USB port, loaded the drivers, and configured it as a \"right-handed\" mouse.\r\n\r\nInto Windows settings and configured the (heavier / wired) mouse to be \"left-handed\", and she was \"good to go!\" and a happy camper!\r\n\r\ntl;dr - see title\r\n\r\npostscript - she moved to another job late last year, and called me earlier this year asking \"how did you solve that problem? I need to get the IT guy here to replicate the solution.\"\r\n\r\n\\* I would not wish Occupational Overuse Syndrome / Repetitive Strain Injury on anyone - I have a very mild case (years of poor typing practice as a coder) - once it sets in, there is very little relief until the inflammation settles down again, days or even weeks later",
        "created_utc": 1528617675,
        "upvote_ratio": ""
    },
    {
        "title": "Boil 'em, mash 'em, stick 'em in a stew...",
        "author": "Slightlyevolved",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pv4kr/boil_em_mash_em_stick_em_in_a_stew/",
        "text": "Real short post.  I just read a recent post about troubleshooting a variable name, and it reminded me about something that happened to me about two years ago.... \n\nI'm not a programmer. I'm not some script god, but with the help of the Googelers and some time, I've created a number powerahell and batch scripts to quickly run repetitive or otherwise time consuming tasks. \n\nUnbeknownst to me, a couple of my scripts had made their way into the hands of our LAN admin team. I found this out one day when I happened to see a familiar line roll by as I was troubleshooting a hanging issue in one of the server login scripts. I found that they had reused my script because it solved an issue they were having and now it runs on nearly 20,000 devices daily.... Anyway.... \n\nOne day I get an IM from the DBA manager. He'd discovered one of my powershell scripts and wanted to ask me about it. \n\nThe issue in question? \n\nWhy did I have a variable that stores the search pattern to run the script against, called $whatstatersprecious?\n\nNo. I did not have to ask him what script he was talking about. ",
        "created_utc": 1528571750,
        "upvote_ratio": ""
    },
    {
        "title": "Computer won't turn on? Brick it by installing a new HDD!",
        "author": "BeardedIntern",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pv04u/computer_wont_turn_on_brick_it_by_installing_a/",
        "text": "Hello y'all! FTP, LTL, you know whats up.\n\nI've been reading this sub for quite some time now but never really had a story to share.Now that I entered an internposition at a medium sized company in my city, specialized in OCR and corresponding software, I am finaly part of this mysterious and magical IT\\-world and hope I can share some fun stories in the future.So far I am thrilled to be part of it. This may be subject to future change.\n\nAnyway, I have my first story to share. Albeit from family techsupport.\n\n$me \\- BeardedIntern$bro \\- my brother\n\nI got messaged by $bro that his computer died without warning and wouldn't turn on again. Urgency Level: Doomsday!As his favorite (and only) IT\\-Wizard, maybe I was willing to help him out? Of course I was. But before I hop on my bike and take the half hour tour to our mothers home where he currently lives, I asked him a few questions. Maybe I could spare the trip and solve the riddle from my couch.The questions where as follows:\n\n* What did you do when it stopped working?\n* Did you smell anything funny when it happend?\n* Did you hear anything funny when it happend?\n* Do your other devices in your room still have power?\n* If you try to turn it on, does anything inside the case moves, blinks or gives a sound?\n* Is the light on your monitor on?\n\nI was confident that I coverd all the important parts. \\[Spoiler: I didn't.\\] He did nothing special, browsing some internets. didn't smelled or heared anything. It just shut off, no sound, no pop\\-upp, nothing. Everything else got power, the light on the monitor is happily glowing.Welp, off I go.\n\n\\- about 30 minutes later \\-\n\nI sit infront of his, now working, computer.\n\n&gt;$me: Did you tried what I just did?$bro: Uhm. Actually, no.$me: I see. Next time, unplug the powercord, wait a minute or \\&gt;two, plug it back in and try to turn it on again.$bro: Ok, sorry 'bout that.$me: It's allright. Could've asked you if you tried it. Guess I'm \\&gt;riding home again.\n\nI got up and was ready to leave when my brother showed my the new harddrive he bought, after asking for my advices on the subject. I offerd to install it for him.\n\n\\- about 10 minutes of tinkering with cable management and such \\-\n\n$me: I hate windwos.$bro (surfing on his smartphone): What? Why?\n\nI point at his monitor. \"Please select a proper boot device.\"\n\n$bro: Oh...$me: Yep. Maybe...\n\nI unplug his SSD from which the computer tried to boot, which has no OS installed on it, and tried again. Same prompt. Unplug the new HDD, only running his old HDD at this point.  Lo and behold! I got to the repair screen. That's something different, so it's progress. I don't like it very much, though. Shut down, plug the SSD back in, just to see what it will bring. Exactly nothing. Very well. I bricked it for the time being. I apologised, cursed $MS for being a twat about the new HDD and rode home.\n\nThat was yesterday. Today I gave him a bootable USB\\-Stick to start the repair in the hopes that that will fix the problem quickly. (I doubt it, to be fair.)\n\nWill come back with an update, advices are welcome. If I borked the formatting I will come back to adjust as best as I can. And as a last point, I am not a native speaker, so there might be some errors I overlooked. Correct me where necessary.\n\nEDIT: Today I went back to fix the mess. Asked a friend for some magical IT\\-Dust and got going. I wanted to start at point zero, just to see where I could go from there. The HDD with the OS into the first SATA socket. The SSD into the second. The new HDD into the third. Went into the UEFI to arrange the order of the boot devices. Also checked, that the MB recognized the drives. It did, I set the OS\\-HDD as first, then removable device and as third the optical dirve. Continued the boot process. Worked. Set a letter for the new drive, named it. Everything works as it should. I don't really know why it didn't before, but now it does. And that's enough for the time being. I read all your comments and use them to learn. About the tech and how I will post in the future. Thanks folks!",
        "created_utc": 1528570759,
        "upvote_ratio": ""
    },
    {
        "title": "That one time one of my users DoS'ed himself and didn't want to own up.",
        "author": "ExtraStrengthFukitol",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8puoio/that_one_time_one_of_my_users_dosed_himself_and/",
        "text": "    $me = new Reader(STAT_TIME_LONG);\n    $me2 = new Poster(STAT_NEW);\n\nA while back I worked for a food service chain, as back office IT. Being a relatively small company, I was pretty much the entire IT department. Much of my existence was solving issues for mostly technically illiterate end users who seemed to go out of their way to shoot themselves in the foot. Most of our stores operated on Linux-based point of sale systems that connect to local IP terminals connected to a switch. It wasn't uncommon for the system installer to leave a spare network cable plugged into the switch on one end in case of emergency.\n\nThe two people involved in this story:\n\n$ESF - me, the beleaguered technician\n\n$IPG - Ingenious [Product] Guy, who has a long track record of making everyone's working life miserable\n\nI sat down at my desk and see that I had a missed call and voicemail. I checked the call number and recognized the number immediately as $IPG. I gritted my teeth and played the message. Sure enough, it was $IPG but he sounded... different. There was something seriously wrong with his server and for once he was worried and didn't sound like he wanted to pick a fight. I took a deep breath and steeled myself for the callback.\n\n&gt; $IPG: Thanks for calling [Product Store], how can I help you?\n&gt;\n&gt; $ESF: *(doing my best to be sympathetic and polite)* Hi $IPG, it's $ESF. I got your message, what's up?\n&gt;\n&gt; $IPG: Oh man, I don't know what's going on, my computer keeps crashing and there's a bunch of junk on the screen!\n&gt;\n&gt;$ESF: Don't worry, we can figure this out. Can you go into the office and read to me exactly what it says?\n\nI'm put on hold while he moves to the back office where the server is. It's a kernel panic and once he reads enough of it, I know *exactly* what's happening. Here's the short version of what ensued:\n\n&gt; $ESF: Okay, I think I know what's going on. You have a network cable with both ends plugged into the switch.\n&gt;\n&gt; $IPG: No way, that's not possible!\n&gt;\n&gt; $ESF: Look, I need you to humor me here...\n\nFirst I have him locate the cable that goes from the switch to the server, have him unplug it from the switch, then restart the server. Then I ask him to plug the cable back in. Sure enough, it bombs immediately.\n\n&gt; $ESF: Yep. Unplug it again and leave it unplugged for now.\n\nI then walk him through tracing each cable that should go from the switch to the patch panel on the wall. Each one checks out until...\n\n&gt; $IPG: This one connects back to the switch!\n&gt; \n&gt; $ESF: Yeah, unplug it.\n\nI explain the extra cable and why it's there. I try to explain why plugging both ends into the switch is a really bad thing and what packet storms are, but that doesn't get very far.\n\n&gt; $ESF: Go ahead and reboot the server then plug it back into the switch and make sure everything is working again.\n&gt;\n&gt; $IPG: *(after a bit of puttering around)* Yeah man, everything's working again! That's awesome, I thought my system was destroyed! *(continues muttering about how his brother who sometimes works in the store probably screwed it up)*\n&gt;\n&gt; $ESF: It's all good. One last thing though. I'd suggest you take that spare cable and put it in your desk draw to keep it safe for some time when you might actually need it. Have a good day.",
        "created_utc": 1528568022,
        "upvote_ratio": ""
    },
    {
        "title": "What's the farthest you've traveled to plug something in?",
        "author": "McTouchButt",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8puiz5/whats_the_farthest_youve_traveled_to_plug/",
        "text": "[removed]",
        "created_utc": 1528566734,
        "upvote_ratio": ""
    },
    {
        "title": "Getting schooled by my 78 year-old Gran",
        "author": "U_RACK_DISIPRINE",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pton6/getting_schooled_by_my_78_yearold_gran/",
        "text": "Hi TFTS, unqualified 'family tech-support' here. As oldest of the grandchildren, it has become my reluctant task to help my family with all problems relating to The Google, The Internet Button (ie, IE), and Have You Tried Turning It Off And On Again. This includes increasingly senile Grandma, whom I am visiting for a fortnight to prepare her for a move to hospice in the near future.\n\nOld Gran isn't doing so well after having a couple of strokes. In terms of tech support, she is terrified by anything more complicated than a washing machine, to the point that when her TV showed her an unexpected message last night she turned it off in a panic and had to sit down and take some deep breaths before shakily turning it on again. What she had done was press the 'TV Guide' button. My mum had tried buying her what she thought would be a user-friendly tablet, but Gran was unable to do the quick taps required to push the buttons on the touchscreen, she could only press and hold. All this combined with her general confusion with life has made for a difficult fortnight.\n\nAll that said, she still manages to be sweet at times, and  the other day she bought a CD of what she hoped was some good pop music that my generation liked. This CD turned out to be Cliff Richards, which is not my style, but I was touched that she was thinking of me so I fired up the CD player. This is an ancient beast which used to be part gramophone, at least 30 years old. She hadn't touched it since her husband died, but after a dust off and a plug in, it fired up nicely. \n\nThere was one problem though - the CD drawer wouldn't open. There was a big round button that said open/close, and I jabbed away at it, but it wouldn't budge. I tried pressing it from the front, from the side at every angle, even wiggling it in case a wire had come loose, trying to find the magic touch for 15 minutes, but nothing worked. I told Gran that it was busted and prepared to switch it off again, when she suddenly overcame her fear and gave it a poke herself. \n\n...and it worked. You see, I was using the quick taps that most buttons and touchscreens these days needed, but dear old Gran was pressing slowly and holding, and that's just what the old machine wanted! Sometimes an old machine needs an old touch",
        "created_utc": 1528559554,
        "upvote_ratio": ""
    },
    {
        "title": "One does not simply pluralise a plural...",
        "author": "gargravarr2112",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ptcc4/one_does_not_simply_pluralise_a_plural/",
        "text": "A humorous one here, I'm just the observer but hopefully it still counts as tech support. Our company's $product generates unit tests for a wide range of languages, mocking input data as necessary.\n\nCharacters:  \n$TL - Team Lead  \n$QA - QA guy  \n$SM - Scrum Master\n\nSo on Friday afternoon, $TL posts to the company Slack:\n\n&gt;$TL: \"It is my great pleasure to award this sprints 'bug of the fortnight' to $QA who we now dub 'Bilbo Buggins'. We haven't quite worked out the reward, but congrats\"\n\nwith a link to a Jira ticket. Opening the ticket gives this:\n\n&gt;Raised by: $QA\n&gt;\n&gt;Ticket title: Pluralisation issue in naming of mock variables when mocked class has a name that is already pluralised\n&gt;\n&gt;Ticket description: Overview:\n&gt;\n&gt;Issue found during testing of ticket 28xx [Closed] and mentioned there, but discussion result was that this is not considered as blocking for the ticket.  \n&gt;Steps to Reproduce:\n&gt;\n&gt;   create a testmethod that calls a method from a force-mocked class with a pluralised class name such as \"StupidHobbits\"  \n&gt;   run $product force-mocking the \"StupidHobbits\" class to generate test-cases for the testmethod\n&gt;\n&gt;Expected/Actual Behaviour:\n&gt;\n&gt;Expected: variable names should have correct spelling  \n&gt;Actual: there is a variable named \"stupidHobbitses\"\n\nIn the Comments of the ticket:\n&gt;Comments: $SM added a comment - 8 minutes ago\n&gt;\n&gt;Won't fix - $team impressed with the grammar.\n\nGave us all a good laugh on a Friday :D",
        "created_utc": 1528556516,
        "upvote_ratio": ""
    },
    {
        "title": "The Nanohabit™ Handbook. Available now",
        "author": "NanohabitHandbook",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8prbn8/the_nanohabit_handbook_available_now/",
        "text": "[removed]",
        "created_utc": 1528530804,
        "upvote_ratio": ""
    },
    {
        "title": "An Imposter in the Wild",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pqkci/an_imposter_in_the_wild/",
        "text": "[removed]",
        "created_utc": 1528520359,
        "upvote_ratio": ""
    },
    {
        "title": "TFTS Top Tales - May 2018",
        "author": "MagicBigfoot",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pq4el/tfts_top_tales_may_2018/",
        "text": "Hi Everybody!\n\nWell another month has come and gone, and another pile of awesome stories have been left in the TFTS coffers.  \n\nHere are 31 of the best submissions from May, but of course there are lots more to be seen every day!\n\nSubscribe and tell a friend about TFTS!\n\nAlso you might enjoy this [relevant comic](http://www.smbc-comics.com/comic/boot).\n\n ~ magicB ~\n\n###TFTS TOP TALES - May 2018\n-----\n_5/1/18_ : [l] [You're good with Linux. We'll train you.](http://www.reddit.com/r/talesfromtechsupport/comments/8g9b03/only_25k_for_a_server_lets_get_the_100k_version/) _by Universal_Binary_  \n_5/2/18_ : [s] [Oh geez, don't call me that.](http://www.reddit.com/r/talesfromtechsupport/comments/8giula/being_lazy_gets_you_the_most_work/) _by curtludwig_  \n_5/3/18_ : [m] [Well how do I get it fixed then?](http://www.reddit.com/r/talesfromtechsupport/comments/8gq9xk/an_angry_professor_and_his_coffeedamaged_laptop/) _by Universal_Binary_  \n_5/4/18_ : [s] [How would that work?](http://www.reddit.com/r/talesfromtechsupport/comments/8gxwah/please_bring_your_computer/) _by ambercore1000_  \n_5/5/18_ : [l] [Can you hear him?](http://www.reddit.com/r/talesfromtechsupport/comments/8h6g68/please_maam_please_listen_to_what_im_saying_so_i/) _by LineageOSLover_  \n_5/6/18_ : [m] [I don't remember anything like that at all.](http://www.reddit.com/r/talesfromtechsupport/comments/8hch5g/what_do_you_mean_its_all_gone/) _by microseconds_  \n_5/7/18_ : [xl] [Why didn't anyone think of that?](http://www.reddit.com/r/talesfromtechsupport/comments/8ho39p/industry_professionals_have_tried_to_fix_this_kid/) _by cc452_  \n_5/8/18_ : [s] [Make sure you get it in the right place...](http://www.reddit.com/r/talesfromtechsupport/comments/8hureq/spreadsheets_more_powerful_than_you_could/) _by UnshornDiergar_  \n_5/9/18_ : [l] [Follow me.](http://www.reddit.com/r/talesfromtechsupport/comments/8i7whk/network_enlightenment_with_a_borderlineillegal/) _by Universal_Binary_  \n_5/10/18_ : [s] [I have one last issue.](http://www.reddit.com/r/talesfromtechsupport/comments/8iht90/incompetent_auditors_trying_to_be_clever/) _by lawtechie_  \n_5/11/18_ : [m] [Hey, sorry to bother you but...](http://www.reddit.com/r/talesfromtechsupport/comments/8inh85/for_the_41st_time_the_issue_has_been_reported_and/) _by spottedbastard_  \n_5/12/18_ : [s] [You said all caps, right?](http://www.reddit.com/r/talesfromtechsupport/comments/8is16a/sometimes_there_are_good_users/) _by ratticus_norvegicus_  \n_5/13/18_ : [s] [What does connect mean?](http://www.reddit.com/r/talesfromtechsupport/comments/8j82rn/no_wifive/) _by devdevo1919_  \n_5/14/18_ : [l] [OK, give us some time to do the needful.](http://www.reddit.com/r/talesfromtechsupport/comments/8jbj87/we_did_not_do_it_because_no_one_told_us_to_part_2/) _by MediocreSupport_  \n_5/15/18_ : [l] [How do I do that again?](http://www.reddit.com/r/talesfromtechsupport/comments/8jnr53/are_you_sure_you_are_an_electrician/) _by TraitorousTraveler_  \n_5/16/18_ : [m] [Well funny story about that...](http://www.reddit.com/r/talesfromtechsupport/comments/8jux7a/water_is_not_conductive/) _by TraitorousTraveler_  \n_5/17/18_ : [m] [Unplugging and plugging it in doesn't help.](http://www.reddit.com/r/talesfromtechsupport/comments/8k4ad4/never_squander_a_good_outage_and_how_to_train_a/) _by Universal_Binary_  \n_5/18/18_ : [m] [This is the worst company I have ever worked for...](http://www.reddit.com/r/talesfromtechsupport/comments/8kcik5/how_can_you_run_out_of_isp_numbers_there_are/) _by networkedquokka_  \n_5/19/18_ : [m] [I don't think I have one.](http://www.reddit.com/r/talesfromtechsupport/comments/8kfm3r/i_just_want_to_access_my_email/) _by squazify_  \n_5/20/18_ : [s] [I haven't touched anything.](http://www.reddit.com/r/talesfromtechsupport/comments/8kul3s/router_needs_power_to_work/) _by Marilynkira_  \n_5/21/18_ : [l] [No. That's playing with fire.](http://www.reddit.com/r/talesfromtechsupport/comments/8l22x7/the_worst_epidemic_of_component_failures_ever/) _by Universal_Binary_  \n_5/22/18_ : [m] [This is going to make my job so much easier!](http://www.reddit.com/r/talesfromtechsupport/comments/8law2s/tech_support_in_2018/) _by tanooki__  \n_5/23/18_ : [s] [I don't know what you're talking about...](http://www.reddit.com/r/talesfromtechsupport/comments/8lg3w9/ive_never_had_a_passcode_in_the_5_years_ive_owned/) _by Sn0__  \n_5/24/18_ : [s] [It just doesn't open!](http://www.reddit.com/r/talesfromtechsupport/comments/8lv5m6/google_is_against_me/) _by Conflituosa123_  \n_5/25/18_ : [s] [You really think it's that dangerous?](http://www.reddit.com/r/talesfromtechsupport/comments/8m34oa/yes_lava_would_definitely_be_the_cause_of_your/) _by TheLightningCount1_  \n_5/26/18_ : [s] [Yeah, hi. My internet is not working.](http://www.reddit.com/r/talesfromtechsupport/comments/8mbcpq/my_internet_is_not_working_could_it_be_the_fact/) _by devdevo1919_  \n_5/27/18_ : [s] [We are already over budget.](http://www.reddit.com/r/talesfromtechsupport/comments/8mfz4w/dont_order_any_upgraded_equipment/) _by SuperSecretSpare_  \n_5/28/18_ : [m] [My husband set it up.](http://www.reddit.com/r/talesfromtechsupport/comments/8mpymb/i_mean_its_not_technically_wrong_to_set_up_your/) _by speckledspectacles_  \n_5/29/18_ : [s] [I am Mountain Wombat.](http://www.reddit.com/r/talesfromtechsupport/comments/8myr94/i_am_the_great_and_powerful_oz/) _by mountainwombat_  \n_5/30/18_ : [m] [We just need you to hook it all up.](http://www.reddit.com/r/talesfromtechsupport/comments/8n6q1y/just_hook_it_all_up/) _by zanfar_  \n_5/31/18_ : [s] [I don't know what happened...](http://www.reddit.com/r/talesfromtechsupport/comments/8nhj0q/your_laptop_wont_turn_on_again_and_you_dont_know/) _by autruip_  \n\n-----\n\nThe full set of [TFTS Top Tales by month](https://www.reddit.com/r/talesfromtechsupport/wiki/index#wiki_the_compleat_best_of_tfts) can be found in our wiki.\n\n\n_^(All stories and quotes are copyright their original authors.  No re-use without permission.)_\n",
        "created_utc": 1528515316,
        "upvote_ratio": ""
    },
    {
        "title": "My iCloud Drive is completely full of photos... Why should I trust Google with them?",
        "author": "hrbrox",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8poxv2/my_icloud_drive_is_completely_full_of_photos_why/",
        "text": "Inspired by [this tale of over 9000 baby photos to be removed from iCloud.](https://www.reddit.com/r/talesfromtechsupport/comments/8pli1l/human_resources_and_its_over_9000_baby_pictures/) I recently went through a month-long saga with my neighbour trying to accomplish the same task. Fair warning, it's pretty long but there's a reward if you get to the end!  \n\nI got a text from my neighbour that her phone was saying her iCloud storage was full and she couldn't take any more photos. Disaster, same as the 9000 baby photos lady she has thousands of pictures of her 2 kids and various animals. She has a 32Gb iPhone, a 100Gb(ish) Microsoft Surface and several 1Tb external hard drives at her disposal but was also paying monthly for 50Gb of iCloud storage. I'd been called several times before to help organise her photos and videos and transfer them to the external drives for backups because the Surface was getting full. She decided (without asking me) to start paying for iCloud so she would have all her photos backed up without my 3-hour visits every few months. She also said she wanted to use iCloud as well as the external drives because if there's a house fire, having all of your photos on external drives doesn't help. Fair enough.  \n\nShe asked if she should just pay for the next level up, 200Gb. I told her no, because she filled 50Gb in about 8 months, 200Gb wasn't much of a price increase but she's going to have the same problem in just under 2 years and the solution then will be to pay 12x what she originally agreed to. I did some research trying to find out how to set up photo stream between her phone and her Surface then found you can get an iCloud for Windows app and set up a sync between the two.    \n\nI set up the app and start by downloading everything off her iCloud to the Surface. We are in a rural area. We get an average download speed of about 5mbps. I set it going and told her not to touch it, I was heading home and would be back tomorrow once it had downloaded all 50Gb. My intention was to download everything, back it up, then delete everything and have iCloud start again from empty.    \n\nCame back the next day hoping to see two full download folders... nothing. About 6 photos in the 2018 folder, nothing in the 2017 folder. Shit. Forgot to change the power settings on the Surface. Screen switched off about 5 minutes after I left and stopped the download. *Sigh*. Set it going again, this time change the settings on the Surface \"Battery Power - Screen switch off NEVER\" told her again not to touch it and left. Came back a couple of days later and it still wasn't done. Took about a week total to download everything. We deleted a few of the longer videos off iCloud (after making double sure they were backed up already) to free up some space and let her take pictures again. That was mistake number 2. It immediately filled up the space we freed up with more photos that hadn't synced yet, extending the amount of time we needed to download everything to the Surface.    \n\nThis made me realise the plan wasn't going to work. As soon as we emptied her iCloud, it was immediately going to fill up with every photo still on her phone and we'd end up with duplicates everywhere and not the full 50Gb of useable space. Time for more research. I discovered the gem that is Google Photos. Same as iCloud Drive but unlimited free space for 'high quality' photos. Same sort of payment structure as iCloud for 'Original quality' photos but the limit for high quality is higher than an iPhone can take photos at anyway so it's irrelevant.  \n\nSet up the upload to Google photos to take everything we'd just downloaded off iCloud. Our upload speed is an order of magnitude worse than our download at roughly 0.2mbps. This is the part that made it drag on. If this was my phone and my photos I was dealing with I would've switched off iCloud at this point, let google photos do its thing off the Surface and not worry about not having my photos on my phone for a bit. Because it was my neighbour I felt less comfortable with this. I didn't want to delete everything then have her turn round and say \"Where is this photo? it was the best photo I ever took of [kids]! I need it!\". I wanted to get it all done and be able to tell her \"I'm deleting every photo off your phone, but just go to this photos app instead and they're all there!\" So until google photos was done I didn't want to empty iCloud, just to be sure.   \n\nThe entire iCloud download plus the photos that were already on her Surface just about filled it so to get everything onto Google photos without slowing the Surface to a crawl required some juggling and several visits to reconfigure the Google Photos sync. Move the 2017 folder to external drive. Back up 2018 to Google, swap them over to back up 2017, then move all of it to the external drive and move the most recent back-up back to the Surface to be uploaded to Google too. I dread her asking me to put the contents of her (full) 1Tb external drive on there too once she realises how neat it is to have it all in one searchable place.   \n\nA few weeks go by, and she finally gets sick of not being able to take photos so calls me round again to FINISH THIS, ONCE AND FOR ALL. I download the Google Photos app to her phone and set it to sync as well to make sure everything that didn't make it to iCloud is safe. I sync her phone to her computer and download everything new too just to be sure. Then I go to switch off iCloud. Hold up.  \n\nPressing the off button next to photos prompts a message that 8000 photos will be deleted from the phone. This was an unexpected problem. I didn't realise it would delete every photo off her phone too. Turns out the first thing it did when her 32Gb phone started to get filled up was suggest she optimise space by keeping the original photos on iCloud and only a copy on the phone. So almost every photo on her phone was only a reference to the original in iCloud not actually stored on the phone. I switched the setting to Keep Originals and it started downloading them. It quickly filled up, I deleted some apps (with permission) and some of the biggest videos but no dice. Then I realised, 32Gb phone, maybe 28Gb useable space and a completely full iCloud of 50Gb trying to download.    \n\nI kind of hid. Gave her a brief summary of everything, told her to leave google photos open so it could back up everything it could and escaped. The next day I get a panicked text that she literally can't use her phone, everything she tries to do results in a pop up 'iPhone storage almost full!' it moved all of her apps and data to the cloud to try and make space for the photos and obviously failed. So we went nuclear. She finally decided she didn't care if some stuff went missing, she wanted her phone back! I switched off iCloud. 6000 photos hadn't managed to download and were deleted. I figured that should have cleared enough space to use her apps and stuff again, nope. Deleted all videos except for the last month, nope.  \n\nWent through the storage options, restarted her phone a few times and finally after about 10 minutes the storage advice section popped up something useful 'Clear your recently deleted photos? You will regain 10Gb of space!' I almost threw her phone, can't believe I forgot that. Deleted everything and magically her phone became useable again. I pointed out that even with all of that she was still going to struggle for space on the phone again soon with the volume of photos she takes. Luckily Google photos has an option to delete from your device everything that has been backed up. Otherwise you have to select every photo individually. Used that to (almost) completely clear her photos out and it was finally over, a solid month after I started.    \n\nIt shouldn't have taken as long as it did. She kept saying things like  \n&gt;Why do they make it so difficult to stop using iCloud?  \n&gt;*Uhh, cause they want you to keep paying for it...*  \n&gt;\"What do you do? Why don't you use iCloud and have this problem too?\"  \n&gt;*I have a macbook with a 525Gb SSD and a 128Gb iPhone so my computer takes all my photos off photostream seamlessly and I have plenty of storage anyway. Plus when I take 15 photos of one thing in an attempt to get a good shot I go through them later and delete the 14 shit ones.*  \n&gt;\"Why is it free? What if Google decide to stop it and I lose all my photos?\"  \n&gt;*Why is trusting Google with them any different to trusting Apple?*   \n\nThere was some good that came out of this month-long odyssey, I got paid in puppy cuddles, she got a new cocker spaniel somewhere around week 3 and it was adorable. I also agreed with her \"What if the house burns down?\" logic and set up my own Google photos to back up everything off my computer and phone. Every photo I have is now safe and I love using it, anyone who has a large photo collection I highly recommend it. The image recognition is amazing. Someone asked about my new car the other day, I searched 'car' in google photos and it brought up every photo it identified as containing a car, including the ones where they were covered in a foot of snow! I feel like I need a \\#spon or a r/hailcorporate after that, sorry! Those who made it to the end, [here's a slightly blurry reward.](https://imgur.com/a/HFxjLtm)\n\nTL;DR My neighbour takes far too many photos, more than can be contained in any single device that she owns. Takes a month to successfully juggle them all between devices and get them backed up on both an external drive and in the cloud. I get paid in tea and puppy cuddles.",
        "created_utc": 1528503368,
        "upvote_ratio": ""
    },
    {
        "title": "The One-Year Print Job",
        "author": "alexbuzzbee",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pnu8a/the_oneyear_print_job/",
        "text": "LTL, FTP, etc.\n\nDialogue rewritten because I can't remember the details. Both it and the regular text is probably poorly written.\n\nAt $company, we're in the process of reorganizing our Azure tenant so that it makes at least some sense. Right now it's a mess. As part of this, I've been monitoring network traffic so we can set up proper vnets and firewall rules. I was going over the packet capture from $legacyApplication, when I saw something very odd: SNMP and raw print traffic to an IP address well outside of our private network.\n\n&gt; **$me**: Hey, $manager, come look at this. The $legacyApplication server is talking to this IP address [*indicates $randomIP with mouse*], which is registered to the DoD Network Information Center. In Ohio.\n\n&gt; **$manager**: What? That's bizarre. I can't think of any reason it should be doing that...\n\n&gt; **$me**: Well, yeah, neither can I. I'll keep looking.\n\nI took a deeper look at the packet logs and saw that the $legacyApplication server was making thousands upon thousands of SNMP requests to this random, apparently DoD, IP address. For the moment, I set up firewall rules to block the traffic just in case it was malicious.\n\nI paused in my analysis of that for a while to look at some other traffic, but when I came back I looked up \"Windows making random SNMP requests\" and found a forum post where someone mentioned Print Spooler. I RDCed into the $legacyApplication server and checked the printers, and voila, a network printer was set up at $randomIP with SNMP enabled. I opened the print spooler to find a single print job, one page long, submitted by $manager on 2017-04-04.\n\nI went and found $manager again.\n\n&gt; **$me**: So I figured it out. [*frantically trying to log on in time for a dramatic reveal*]\n\n&gt; **$manager**: What was it?\n\n&gt; *$me*: Print Spooler.\n\n&gt; **$manager**: Print Spooler? I still think it's $legacyApplication trying to print-\n\n&gt; **$me**: [*finally finishing logon*] It's right here in this printer's properties... ports... there. [*indicates $randomIP in port properties*] And in the print queue... The culprit is you.\n\n&gt; **$manager**: The culprit is me. Wait, 2017-04-04? That's... old.\n\n&gt; **$me**: Yeah, um. It's been trying to print this same document to a non-existent printer at someone else's IP address for over a year. Well, not really \"print to,\" more like \"print at.\" I think we can \"stand down yellow alert\" on this one.\n\nIt turns out that $manager was trying to set up printing via RDC on the $legacyApplication server for the users a while back, which is where the print job came from.\n\nSo that's the tale of how a test print job from over a year ago sat in the print queue of a non-existent printer on a cloud server caused a brief security panic and possibly flooded some random server with SNMP requests.\n\nEDIT: Spelling.",
        "created_utc": 1528493988,
        "upvote_ratio": ""
    },
    {
        "title": "No power button",
        "author": "Floofyboy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pngwd/no_power_button/",
        "text": "$User: \"Hello, my computer is completely frozen, i can't do anything\"\n\n\n$me: \"Ok well please turn it off with the power button\"\n\n\n$User: \"There is no power button on my computer\"\n\n\n$me: \"That's not really possible. What's the computer model. I can send you a picture of the power button.\"\n\n\n$User: \"Its a Samsung\"\n\n\n$me: \"That's your monitor. What's the model of the computer\"\n\n\n\n... I hear background noise where someone seems to be helping the user\n\n\n$User: \"Oh we found it! We found the computer's power button!\"\n\n\n$Me: \"Have a good day\"",
        "created_utc": 1528491096,
        "upvote_ratio": ""
    },
    {
        "title": "Rest In Peace",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pnf11/rest_in_peace/",
        "text": "[deleted]",
        "created_utc": 1528490693,
        "upvote_ratio": ""
    },
    {
        "title": "Expected Phone Behavior",
        "author": "meancini",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pmzfs/expected_phone_behavior/",
        "text": "[removed]",
        "created_utc": 1528487475,
        "upvote_ratio": ""
    },
    {
        "title": "Human Resources and It's Over 9000! Baby Pictures",
        "author": "NYFranc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pli1l/human_resources_and_its_over_9000_baby_pictures/",
        "text": "Over the past decade of IT Help Desk/Administrator, I dealt with my share of odd IT requests and situations. These days, I work with a tight\\-knit group that provides level 1 tech support to various companies in various industries. Boy, this was a fun one from the Human Resources manager of one particular company a couple of days ago.\n\nSo, it was a typical Wednesday morning at first, I was drinking my coffee with a pair of double chocolate muffin tops. Enjoying the calm before the storm and then the Help Desk phone rang from the manager of Human Resources herself. The HR director developed a reputation of a micromanager with a swift mood swing. So, I braced myself and answered the phone.\n\n&gt;$NYFranc: Good Morning, this is Help Desk, $NYFranc speaking.  \n&gt;  \n&gt;$HR: Help Desk?! Thank god, I need help. It's Over 9000!  \n&gt;  \n&gt;$NYFranc: Huh?! What's over 9000?! The NASDAQ?!  \n&gt;  \n&gt;$HR: No, silly man. The baby pictures on my iPhone. I'm not tech\\-savvy and I need IT to salvage my baby memories from myself. I ran out of space on my 32GB phone and I want space for the new memories.  \n&gt;  \n&gt;$NYFranc: You got an iPhone. So, I will assume you got a Apple account. You most likely synced your pictures on the iCloud. You can download the pictures from the iCloud and once that's done. Delete them off your phone and we'll make a few tweaks so the iCloud data don't overwhelm your phone.  \n&gt;  \n&gt;$HR: I don't remember my account info nor I want to do that. I'm very busy and need an immediate fix.  \n&gt;  \n&gt;$NYFranc: Ma'am, you're the director of HR. You just called IT Help Desk and **started a ticket using a Dragonball Z reference from the Japanese anime cult classic, Dragonball Z**. If you want a fix, you will wait until tomorrow morning when I will be on\\-site. As soon you arrive at the office, I will give you my undivided attention.  \n&gt;  \n&gt;$HR: Are you sure you can't do this remotely? I'm a busy woman.  \n&gt;  \n&gt;$NYFranc: The call is being recorded and I ain't risking my job over baby pictures. You're the HR Manager, **YOU CAN MAKE PEOPLE WAIT!** If you cherish the pictures of your child that much, your subordinates **WILL WAIT** and when you're good and ready, you'll see them!  \n&gt;  \n&gt;$HR: You're the 1st tech guy I ever spoke with that convinced me to wait on anything. Fine, but I expect results, $NYFranc.  \n&gt;  \n&gt;$NYFranc: Deal.\n\nAfter the call, I informed my counterpart on-site Help Desk supervisor my plans for tomorrow. He saluted me for taking the challenge. After that, I popped a couple of Tylenol and guzzled them down.\n\nThe next day, I got there at 9 o'clock, sharp and entered her office. The HR director smiled instantly and told her subordinates to not disturb her until further notice.\n\n&gt;$HR: You are a man of your word, $NYFranc. I asked about you after our call yesterday. Various staff members told me the same: direct, forceful, smart, punctual, and no.1 rule: **make sure you got COFFEE!** I wish my husband was that manly. He got money, but that's it.  \n&gt;  \n&gt;$NYFranc: Thanks, let's get started.  \n&gt;  \n&gt;$HR: Did you have your coffee?  \n&gt;  \n&gt;$NYFranc: Yes, I did.\n\nI planted myself down on her Executive Leather chair and she proceed to express endlessly about these three things in this order: 1) iPhone storage, 2) baby pictures, 3) Japanese Anime\n\nI humored her on all three with whatever I knew and then my audit on her phone finished. **IT'S NOT OVER 9000 BABY PICTURES! IT'S OVER 20,000 BABY PICTURES!** Holy smokes! It's a freaking museum to first born children everywhere.\n\nHer face flushed in embarrassment and I calmed her down and told her, \"No worries, it's my job\".\n\nThen, I began the process of migrating 20,000 baby pictures and moving them into a flash drive. She gave me a surprise hug and talked about her 2nd baby coming in the upcoming weeks. She re-emphasized that she needs room on her phone to take more baby pictures. I advised her to get a phone with more storage, so this ticket don't have an immediate sequel.\n\nShe chuckled and waited patiently for the picture migration to finish. After two hours, it was all done. She gave her thanks to me for my hard work and she allowed her neglected subordinates permission to see her again.\n\nAn hour later, the head of IT Operations approached me and told me that he was stunned I managed to shut down Human Resource for two hours. I replied, \"**what's done is done, my friend. I didn't want this haunting me**.\" He advised me to be more diplomatic with the other managers and thank me for handling the ticket. Tune in next time on Tales From Tech Support.",
        "created_utc": 1528476631,
        "upvote_ratio": ""
    },
    {
        "title": "When the user knows more than you do, but doesn't use it",
        "author": "SomethingSpecialMayb",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8plbr5/when_the_user_knows_more_than_you_do_but_doesnt/",
        "text": "Hi All, \n\nLTL/FTP and all that, this short story literally just happened. \n\nI work at an ISP supporting a business system and one of my colleagues got in touch with me about an issue she was having.\n\n**$user** will be the user\n\n**$me** will be me\n\n**$bossOfUser** will be the users boss  \n\n**$sysAdmin** is the admin of a system which will become relevant   \n\n*\n\nSo our story begins!\n\n*\n\n*\n\n*\n\n**$user**: \"particular process isn't working\"\n\n**$me**: \"ok, let me take a look\"\n\n**$me**: \"process is definitely working, i've sent through a few requests as you and as $bossOfUser and they've worked\"\n\n**$user**: \"but i haven't had any notifications\"\n\n**$me**: \"that's odd, i'll check to see if the system sent them\"\n\n**$me**: \"ok, the system send you emails at 16:43 and 16:45, have you not received them?\"\n\n**$user**: \"no, nothing\"\n\n**$me**: \"oh someone has just walked up to $sysAdmin and asked if email is working, perhaps there's an issue\"\n\n**$me**: \"yes it sounds like there is an outage at the moment\"\n\n**$user**: \"oh yes, the email server is down\"\n\nhead desk impact in\n3\n\n2\n\n1",
        "created_utc": 1528475360,
        "upvote_ratio": ""
    },
    {
        "title": "Changing the password on an inactive account is always a fruitless exercise",
        "author": "Fribanaw",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pkrqm/changing_the_password_on_an_inactive_account_is/",
        "text": "Hi All, infrequent poster, but I don't seem to have many interesting stories that I can post without giving away too much of where I work...\n\nYesterday however I had a situation come up that struck me as a surprisingly new one for me and my fellow techs in my department (should have suspected it would happen one day, but we didn't think anyone would actually do this).  For quick pre\\-amble to explain, I am tech support for an access control system solution.  While I do have back doors into systems, it requires a remote session, and usually either turning on said back door from in the program, or using a physical link to the server via serial cable.\n\nI will be $me and my caller will be $HR for the rather clueless HR director who called.\n\n&gt;$Me: Thank you for calling tech support, this is $Me speaking, may I start with your name please?\n\n&gt;$HR: Yes, this is $HR, we have one of your \\&lt;redacted, but not event quite correct company name\\&gt; systems and my password stopped working, can you reset it for me?\n\n&gt;$Me: Unfortunately, I do not have any remote administration capabilities to your system to do this, but could I get you to try logging in with the default credentials? They are *username* and *password*.\n\n**(As a side note, I find it scary how many installers and sys admins leave these at default)**\n\n&gt;$HR: No, that didn't work, is there any other way to fix my account?\n\n&gt;$Me: Possibly, is there anyone else in your organization with a working login available right now?  If so I may be able to walk you through resetting your password with that login.\n\n&gt;$HR: Yes, $HRDrone has a login and hers is working right now\n\n&gt;$Me: Excellent, here are the instructions for her to change your password for you \\&lt;Insert simple 5 step process\\&gt;\n\n&gt;$HR: Ok, I will get her to do that, I'll be right back\n\n5 minutes later...\n\n&gt;$HR: Ok, $HRDrone did it, and I can login now, but it says I'm not allowed to do \\&lt;insert routine task here\\&gt;, also we had to change my username because it said it was already in use.\n\nHad a bit of a sinking feeling here, because as call center tech support, I am being measured on call times, and I feel like this will take much longer than it should.\n\n&gt;$Me: Ok, would it be possible for us to do a remote session with $HRDrone so I can see what is happening and help fix your account?\n\n&gt;$HR: Yes, that should be fine, let me transfer you to her\n\n&gt;$HRDrone: Hello, $HRDrone speaking, how may I help you?\n\n(Great, a cold transfer, I always love those...)\n\n&gt;$Me: Hi $HRDrone, $HR transferred me to you so we can do a remote session and fix her account up.  Can I get you to go to \\&lt;insert remote session website here\\&gt;?\n\n(Guidance on getting connected provided here)\n\n&gt;$HRDrone: Ok, can you see my screen yet?\n\n&gt;$Me: Yes, can you please open the Access Control system for me now, so I can get things corrected?\n\n&gt;$HRDrone: Yes, here you go.\n\nAt this point, I searched for $HR in their system, and curiously I found 2 listings for $HR, one marked Active, the other being Inactive.  Checking the Active listing, I found an account with no logical permissions, just door access, and with no card/pin set to make use of said access.\n\nI then proceeded to check the \"Inactive\" account, it seems to have full logical permissions to the system, has the original username too.  I changed the account to make it active, and sure enough, the login now works.  Of course, I did not leave it at this, I quickly pulled up an audit on the account, and lo and behold, marked inactive just a couple of hours prior by $HR.\n\nFrom here, I gave a quick rundown of how $HR broke her own account, found out what they were *trying* to do, and advised how to actually do it.\n\n**TL;DR** Changing the password on an inactive account is always a fruitless exercise.\n\nEdited for formatting correction, silly editor issue",
        "created_utc": 1528471434,
        "upvote_ratio": ""
    },
    {
        "title": "Issues with PowerPoint",
        "author": "VG_ADTerminal",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pjc7s/issues_with_powerpoint/",
        "text": "I worked on the internal helpdesk for a large European bank for a while, this is the call that made me decide it was time to start looking for a different job\n\n\n&gt;$me: Thank you for calling blahblahblahblah\n\n*I take the caller's details*\n\n&gt;$me: So what seems to be the problem?\n\n&gt;$idiot: My PowerPoint isn't working!\n\n&gt;$me: Oh, okay! What happens when you try to open PowerPoint?\n\n&gt;$idiot: Huh?\n\n&gt;$me: You said that you were having issues with PowerPoint, so what seems to be happening when you try to use PowerPoint?\n\n&gt;$idiot: What are you talking about? My PowerPoint for my laptop isn't working!\n\n*Ah, gonna be one of those kinds of call eh?*\n\n&gt;$me: Run me through what you're trying to do with PowerPoint and I'll try to help.\n\n&gt;$idiot: I'm plugging my laptop into the power point, but it's not charging!\n\nShe was calling the plug socket a power point. I can't understand that she didn't see how that would be confusing, not to mention wall outlets aren't exactly IT equipment. If you bank with *large European bank* I would consider moving your money elsewhere.\n\n\nEdit: Just to reassure the idiot-apologists, this took place in the UK, 'power point' is most definitely not a common term for a plug socket/wall outlet",
        "created_utc": 1528459528,
        "upvote_ratio": ""
    },
    {
        "title": "Issues with PowerPoint",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pj9wr/issues_with_powerpoint/",
        "text": "[deleted]",
        "created_utc": 1528458929,
        "upvote_ratio": ""
    },
    {
        "title": "You literally paid us to do that two weeks ago...",
        "author": "Ulfsark",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8phk8l/you_literally_paid_us_to_do_that_two_weeks_ago/",
        "text": "Hey guys, I work for a small MSP that supports mostly schools. Part of that involves using 3rd party software for managing Fruit devices. Generally managing these are pretty simple, get the Fruit devices linked to the system, and push out apps, settings as necessary. \n\nI receive an email asking if we will be removing the remote management from the new Ipads. By design, when you factory reset the device it asks to be joined to the MDM software again and requires credentials for that to be entered. Turns out they had factory reset their iPads in hopes to connect a new fruit account... (We did not add any accounts to these as they are not needed to get programs as they are managed by the 3rd party program) \n\nHowever, what they actual did is undo part of the project they had paid for recently. A few days prior they asked about the fruit accounts , and I had mentioned that they could add a new fruit account in the settings and even remove the current one if it existed,  I explicity said \"You do not need to reset it\" \n\nLooks like this project is getting a phase two...",
        "created_utc": 1528437975,
        "upvote_ratio": ""
    },
    {
        "title": "\"I have no internet and no tv\"",
        "author": "Someguywithstories",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pf8fi/i_have_no_internet_and_no_tv/",
        "text": "Hello everyone\n\nLet me start off by saying that a friend sent me this subreddit, I've never had a reddit account, but I do now.\n\nI work in tech support for an internet and TV provider, and I honestly thought that a lot of the stories you heard or read were fake ones, jokes made by tech people just for laughs.\n\nI was wrong. oh boy I was SO wrong. I've had my fair share of dumb people, but this is one that will stick by me for many years.\n\nWoman: My internet and my TV aren't working\n\nMe: Alright, what do you see exactly on the TV?\n\nWoman: Nothing\n\nMe: Is the TV on right now?\n\nWoman: No\n\nMe: Could you turn on the TV please?\n\nWoman: No I can't, it's not working. the fridge and the microwave are working though\n\nMe: Alright, what lights are burning on the modem right now?\n\nWoman: None\n\nMe: Ma'am I think you have a burt fuse\n\nWoman: But my microwave and fridge ARE working right now\n\nMe: Ma'am, could you please grab a lamp or something that is currently working and plug it in where the TV is right now and see if it still works?\n\nWoman: alright one sec\n\nWoman 2 minutes later: alright it works on the other socket but not on this one\n\nMe: Ma'am you have a burnt fuse\n\nWoman: So... will you guys send someone over to fix it?\n\nI have many more stories to tell. ",
        "created_utc": 1528415741,
        "upvote_ratio": ""
    },
    {
        "title": "Thanks Windows",
        "author": "ConsumeLettuce",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8peebe/thanks_windows/",
        "text": "On mobile sorry for format.\n\n I'll keep it short. I work at a local tech support store/serice/retail thing where you can call and get people to drive to you or bring the stuff in to get fixed. Anyway I'm working in store as my car is getting fixed. Drive job pays better but this will do until car is fixed.\n\nOh boy. I wish fate hadn't kept me in store this day. An older lady, probably 60s comes in carrying a 2 ton laptop. Who knows how old but running win xp. She says her son told her the upgrade to windows 10 was free and asked me to update it. I explain to her that that was a limited time promotion and wasn't even by our store, it was by windows itself.\n\nShe then hands me a printed screenshot of the windows 10 free upgrade add we all got and says she got that recently. (Prob a lie) This is supposedly validation. I explain that this is not a coupon and that we don't even sell windows.\n\nShe scoffs and walks to my coworker not 5 feet from me who heard the whole thing and asked him the same thing as if it never happened.\n\nEventually she leaves muttering something unintelligible.\n\nHow do these people exist?\n\nTLDR: Oldish lady asks us to update win XP laptop to win 10 In 2018 for free.\n\nEDIT: I have posted part two.",
        "created_utc": 1528408548,
        "upvote_ratio": ""
    },
    {
        "title": "Seriously? Yeah, its my fault.",
        "author": "Fearme4life",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8peafw/seriously_yeah_its_my_fault/",
        "text": "Okay so this happened yesterday. I am a cable technician who is contracted by a large very hated ISP. I was doing an internet+tv install and  this happened right as I was wrapping the job up.\n\nSo when I set up the modem+router combo unit I asked the customer what name and password they would like for their WiFi. They gave me a name and the password was _____011. I entered this into the modem and then SHOWED her my screen so she could confirm it was correct. She says it is fine and writes it down.\n\nWhile I wait for the WiFi name to get changed I go and explain how to use the tvs and then she pulls out her macbook to connect to the WiFi. She tries to connect and gets incorrect password. Hm. Well she probably just typed it in wrong happens all the time. This time I see the paper she wrote and see her type it in and bam same incorrect password. That is strange. So I take her macbook and try myself and same thing. She decides to leave me to it while she keeps unpacking.\n\nSo I am connected on my device so I know it is working. Well did some research and says sometimes might have issues connecting to 2.4 and only connects to 5. Our new modem gives both networks the same name so I go in and differentiate them by adding -5G to the 5 band. I try again and same incorrect password error on both 2.4 and 5. I try rebooting the macbook and try again. Nothing. I go into network wifi settings and try forgetting a couple of the old networks and toggling WiFi off and back on. STILL nothing. I reboot the modem (REALLY didn't want to because I am connected just fine and it can take up to 20mins to fully boot up and for diagnostics to show up and I can't leave the job without the diagnostics showing up). \n\nAfter I wait for everything to come back up I try again and still does not connect. I am getting increasingly frustrated and I decide I am going to just try changing the password. I log back in and go to the password and see _____011 and then I realize what the damn problem is. This old lady told me _____011 and then wrote down _____001. I brought this to her attention and she says, \"Yea _____001 that is correct.\" Then I tell her she told me _____011 and then also checked it when I showed het and said it was fine. So I went back in and changed it to _____001 and connected everything just fine. So yeah, totally my fault for not realizing she did not write down what she told me.\n\nTL;DR: Cust chooses wifi name and password, but writes down different password and then states thats the password she wanted after 40 minutes of not being able to connect.\n\nThis job was so frustrating. I should have paid more attention, but thats what I get for making assumptions. I am typing this up on my work phone. as I am being driven home so I apologize for any typos or grammatical errors.",
        "created_utc": 1528407699,
        "upvote_ratio": ""
    },
    {
        "title": "The internet in the entire region is broke - let's reset your modem to fix it!",
        "author": "trazom28",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pdnh3/the_internet_in_the_entire_region_is_broke_lets/",
        "text": "[removed]",
        "created_utc": 1528402909,
        "upvote_ratio": ""
    },
    {
        "title": "Permission Denied means Out of Memory",
        "author": "ITKangaroo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pd0ph/permission_denied_means_out_of_memory/",
        "text": "I work part-time at an IT helpdesk at my university. We don't usually get anything more complex here than a Mac user having trouble using the university's printers because the instructions provided by the university are missing a step, so this one was a little unexpected!\n\nThe administration here has been trying to use some piece of software to perform optical character recognition on teaching assistant evaluations. Except every time the scanned PDFs were read by the software, it would read one page then spit out a permission denied error.\n\nWhile we worked on figuring out why this error was appearing in the first place (the program definitely had access to its own \"temp\" folder!) PDFs were read using a temporary workaround we discovered. The program would read one page before spitting out an error the first time it was read, but if all the data was deleted and the PDF was read again, it would read two pages this time! Each successive page would then be read with further delete-and-reread operations.\n\nThe manufacturer's knowledgebase indicated that the error was definitely a permissions error and gave several suggestions to try - all of which failed. After contacting their own tech support team (they were quick! If the tech who responded to our ticket 30 minutes after we sent it in reads this, you're awesome.) we learned it was not a permissions error at all, but in fact a system resource issue. Since the PDFs had been scanned in a different orientation than the template, the software was using too many resources attempting to flip the pages around in order to read them, and failing. We got the administrative computer an Adobe Acrobat license, flipped all the PDFs 90 degrees, and the admin was able to complete their OCR task without any more hiccups.",
        "created_utc": 1528398250,
        "upvote_ratio": ""
    },
    {
        "title": "\"But why can't I have Team Spacegoats for a distribution list name???\"",
        "author": "Daefish",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pc9kq/but_why_cant_i_have_team_spacegoats_for_a/",
        "text": "Players involved:  \n**$Me** - Me of course!   \n\n**$BWISODS** - Boss who is sick of Developer's...poop   \n\n**$\"ScrumMaster\"** - Scrum Master in this story - Quotes are because I do not believe that Scrum Masters are real positions (sorry in advance to all real Scrum Masters out there, this job has seriously soured me to them)  \n\n**$HRHero** - one of the first times I've ever been thrilled beyond words by HR  \n\nMy company has a policy that all distribution groups are formatted in a specific way for searchability and also professionalism.  \n\nGenerally it's \"Department-TeamName.Function\" - So Dev-ProductName.Beta1 for the Beta 1 testers of our product that Dev is working on.    \nSimple enough and no one has had ANY problems with it since they started enforcing it.  \n\nEnter the Scrum Masters.  We hired about 5 of them last year and most of them (including $\"ScrumMaster\") are good people who work hard - my personal bias against their job role aside, I won't ever claim they aren't dedicated and hard workers.   \n\nAfter their teams started coalescing, we started getting...odd...team name requests (yes, I get it, they're probably in line with Agile's principles).    \n* Team Narwhal  \n* Team Spacegoats  \n* Team Unicorn  \n* (and the one from today, Team Kiwi)  \n\nWhen I got the distribution request for Team Spacegoats from $\"Scrum Master\" I immediately forwarded it to $BWISODS and asked him if this was an appropriate name for us to have, even if we prefix it with Dev-.   \n\n\nPart of the issue is these distros are sometimes used for client/customer facing emails.   \nI really take issue to a professional development company, emailing professional [our industry here] customers regarding product we are trying to develop and sell from an email address of Team.SpaceGoats@company.com.  \n\n$BWISODS agreed with me and told me to shut it down.  I denied the ticket request with verbage equating to \n&gt; \"This was denied by upper management.  Please direct any issues with this request to upper IT management\"  \n\nFor the next three weeks I received daily emails asking $Me about why the ticket was denied.  I responded, always professionally with \n&gt; \"This was not my decision to deny this group, please contact $BWISODS for the reasoning behind it\"   \nFinally after a couple weeks, I got one final email: \n \n$\"Scrum Master\":  \n\n&gt; I still do not understand why this is not allowed to be a distribution group name.  We need this distribution group because it defines our identity as a team.   \nI get the need for professional purposes, but why can't I have Team Spacegoats for a distribution list name???\n\n\nEventually the emails subsided and all around stopped.  \n\nToday, I got a new ticket that came in asking for a new distro to be created, this time of the name \"Team Kiwi\"  \n\nBefore I even had a chance to read the ticket notes, $BWISODS emails me and says \"Just...no\"   \nI had to talk to $BWISODS about something else this morning so I mentioned Team Kiwi to $BWISODS.  \n\n$BWISODS laughed and asked me if he ever told $Me what happened with Team Spacegoats.   \n\nTurns out... after $\"Scrum Master\" sent me that last email, $\"Scrum Master\" went to **$HRHero** about this.   $\"Scrum Master\" *formally complained about this issue to $HRHero*  \n$\"Scrum Master's\" complaint included the verbage that $BWISODS unfairly denied this request and that there was no reason for it to be denied.   \n$HRHero's response is legendary:  \n&gt; \"This request was rightfully denied by $BWISODS.  In fact, if $BWISODS had approved this name change, I would have fired him personally once I found out.  \n\nStrangely enough I haven't heard from $\"Scrum Master\" about this ever since.  \n",
        "created_utc": 1528392845,
        "upvote_ratio": ""
    },
    {
        "title": "You gotta give me something to work with here",
        "author": "PingPongProfessor",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pc6eq/you_gotta_give_me_something_to_work_with_here/",
        "text": "[removed]",
        "created_utc": 1528392207,
        "upvote_ratio": ""
    },
    {
        "title": "Not Above an I Told You So",
        "author": "Voxmanns",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pc051/not_above_an_i_told_you_so/",
        "text": "[removed]",
        "created_utc": 1528390978,
        "upvote_ratio": ""
    },
    {
        "title": "Remote controls are tricky things...",
        "author": "rexkwando52",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pbum4/remote_controls_are_tricky_things/",
        "text": "Reading another tale made this pop into my mind today...\n\nSo I help my brother from time to time, now he's an ISP only, but a few years ago he provided satellite TV and IPTV which he gave up due to countless tales such as this.\n\nSo we're wiring up an apartment for ADSL, and he's doing the final touches so asks me to pop to one around the corner. It's a French woman who says her satellite receiver isn't working and has been bugging him for days (he didn't supply the box or satellite so had no recourse to get there immediately). So I get there and take a look.\n\nBox is powered on, ok. So let's check the scart cable... Seems fine. Tv is on the correct input and has a signal, but is just displaying a black screen. Try to access the box settings and nothing happens when I press the remote.\n\nIt can't be can it?\n\nI hear other people say these things but it won't happen to me? \n\nCorrect. The batteries were in the remote control the wrong way round....\n\nSwap them round and everything works fine. I was too embarrassed for her so I said just give me 10 euro and I'll be on my way (standard callout for non warranty calls was 50).\n\nFacepalmed so hard I broke my nose.\n\nTl:Dr. If nobody knows your batteries are the right way around, will your TV still make a sound? ",
        "created_utc": 1528389884,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, you can pay me to not fix your computer!",
        "author": "IAintShootinMister",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pbtmc/sure_you_can_pay_me_to_not_fix_your_computer/",
        "text": "LTR; FTP\n\nI own and operate a small 3 man MSP/Break-fix business in a town of less than 15,000 that was just given fiber-to-the-home. A lot of my time is spent pulling new CAT6  and installing Unifi gear for SO/HO. This town is being blasted into the 21st century at ludicrous speed, and I get some fun stories out of it. \n\n\nClient calls and tells me that her laptop is taking a literal hour to boot and bring up Windows, and once its up it's nearly unusable. She tells me that it started shortly after the last Windows Creators update. I ask her to bring it by the house. \n\n&amp;nbsp;\n\nme: So let's take a look at it. \n\nclient: See, it comes up but it's taking forever just to login. I called my IT department and they're sending me more RAM.\n\nme: IT dept? This isn't *your* laptop? \n\nclient: No, work sent it to me. \n\nme: [Taking my hands off it] Whoa, nope. Sorry. You need to go through them, I can't touch another companies tech. They likely won't pay and you'll end up in trouble. \n\nclient: [Smarter than she seems] Nope, here's the email on my phone. I already asked for permission to bring it to you because I don't know how to install the memory. [Pulls up an email chain between her boss (the VP of Sales) and Johnny IT, and forwards it to me.] \n\nme: Seems like the hard drive is clicking, and nothing is pulling up after the initial login. I can try and pull the hard drive and copy everything off? Might take me an hour. Say, $60? \n\nclient: Sure, can you get me a price on installing the RAM they sent, a new hard drive, and Windows? \n\nme: Yep. [Mocks up a price sheet, email it to client.]\n\nclient: Great, I sent that off to my boss. Let me know when it's ready and I'll swing back by. \n\n\n&amp;nbsp;\n\n*Two Hours Later*\n\nclient: [text message] Hey, Johnny IT says that *their* version of Windows is different, so you don't need to install one. \n\nme: Great, do they want to send the image over? Or are you going to send it back to home office? \n\nclient: Hold on, I got a strange email from VP of Sales. \n\nme: No problem, just let me know what's up. Files are off and hard drive is out if you wanna pick it up. \n\n&amp;nbsp;\n\n*Next Day* \n\nclient: Hey, here's the email from VP... [Screenshot] \n\n&gt; From:Dummy, VP of Sales\n&gt; \n&gt;CC: Johnny IT\n&gt;\n&gt; To: Client\n&gt;\n&gt; Subject: Local IT \n&gt; \n&gt; I've talked it over with Johnny IT and it seems that the local guy is either incompetent or is attempting to overcharge you. We don't have a Windows image for him to install and we won't pay for a new one. HP laptops come with a free Windows image. When the new hard drive is installed just press F11 and it will install Windows. \n&gt;\n&gt;We'll pay for the RAM and new hard drive install, but we're not paying to install Windows. \n&gt;\n&gt;Dummy, VP of Sales\n\n&amp;nbsp;\n\nme: You know that's not how that works right? \n\nclient: Yeah I tried to tell him it wouldn't be there. And Johnny IT refuses to call you and won't let me give out his number. \n\nme: No problem. So they've authorized me to install the hardware, and *you* know it will be a paperweight when I'm done because there is no OS...? \n\nclient: Yep, just do what they'll pay you for. \n\n&amp;nbsp;\n\n*Two hours later* \n\nme: Alright, come pick her up. She's useless, but she's paid for. Say where did you get this \"work\" laptop from? \n\nclient: Oh, they just had me pick one off Amazon and they paid for it and shipped it straight to me. \n\nme: They didn't have it sent to them first to have *their image* installed? Lol\n\nAnd that is the story of how I got paid to *not* fix a computer. \n\n&amp;nbsp;\n\n\n**Aftermath:** \n\nEventually, client came back and paid me out of her own pocket to install a Windows image, using the license that Windows auto-assigned based on the hardware. After all that, it turns out it was just a basic home license and they didn't have any special software.\n",
        "created_utc": 1528389689,
        "upvote_ratio": ""
    },
    {
        "title": "\"The whole system is down! Get there now!\"",
        "author": "bigfatguy64",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pbsbk/the_whole_system_is_down_get_there_now/",
        "text": "backstory:  I (FatGuy) spent a summer working as a sort of IT guy at my Dad's (Dad) office after his long-time IT guy/Office Manager retired abruptly.  This was a small doctor's office with probably around 12-15 employees.  I was by no means an IT expert, but I could fix most of the issues that came up, which 9 times out of 10 were \"the printer won't work.\"  in the very rare case that it was something I couldn't solve with a quick google, I knew enough to not mess with anything, and outside of adding a user to the Active Directory once, I generally left the main server alone.\n\n&amp;nbsp;\n\nMost of the women working there (office was pretty much all women) could use a computer well enough to do their jobs and get to facebook but that was about the extent of it.  There was one early-mid 40s big redneck woman in particular that was completely computer illiterate...for the sake of this story, let's call her Kevin.  Kevin had been a receptionist at the office for at least 5 years.\n\n&amp;nbsp;\n\nScene: 7:30am, morning of 4th of July.  \n\n&amp;nbsp;\n\nMe: passed out after drinking with my buddies the night before.\n\n&amp;nbsp;\n\nDad: (throws bedroom door open...running in in a panic) **FATGUY! WAKE UP!  There's something major going on at the office.  I think we've got a virus or something!  The whole system is down! You gotta get there now!!**\n\n&amp;nbsp;\n\nMe: Good one dad....it's 4th of July and even if it wasn't the office doesn't open until 9.\n\n&amp;nbsp;\n\nDad: This isn't a joke.  Kevin came in to get caught up on a few things.  She's down there right now and just called.  She said the machines keep crashing when she tries to turn them on....she's about to try to get on the server and see what it does.\n\n&amp;nbsp;\n\nMe: **YOU KEEP KEVIN OFF THAT SERVER! I'M LEAVING NOW** (the thought of Kevin touching the server immediately put me into a panic)\n\n&amp;nbsp;\n\nafter making record time to the office ...\n\nMe: Okay Kevin, I need you to show me exactly what's happening\n\n&amp;nbsp;\n\nKevin: (flustered) Okay, well I tried to turn on my computer and it gets halfway through the loading screen and then just turns off.  Then I tried another computer and it won't even turn on at all. See, watch.\n\n&amp;nbsp;\n\nKevin walks to her computer, presses the power button, the machine starts to boot...I notice Kevin is still holding the power button...the machine turns back off.  Then Kevin walks to second computer, presses the power button, \"See, it won't even start to turn on...the screen is still black....what the hell is going on?\"\n\n&amp;nbsp;\n\nAt this point, realizing exactly what was going on, I reached Picard levels of facepalm.  I walk to the first computer, press the power button, release the power button, computer boots just fine.  Then I walk to the second machine and flip on the monitor.  Worked like a charm.\n\n&amp;nbsp;\n\nKevin asked me to make up some elaborate story to tell my dad about how I fixed a major problem, but I thought the truth was better than any story I could have come up with.  Needless to say, almost a decade later and Kevin still hasn't heard the end of it.",
        "created_utc": 1528389440,
        "upvote_ratio": ""
    },
    {
        "title": "Email does not work without toner!",
        "author": "networkedquokka",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pbnun/email_does_not_work_without_toner/",
        "text": "While working at a fortune 50 company we had the pleasure of supporting a svp who was VERY imporTant. One day, rather than logging a support ticket (takes too long) he told his very important undrerling to tell somebody to call us to report than he was waiting for a very urgent email that was delayed because the printer was out of toner.\n\nNew techs quickly learned that his new, shiny computer was mainly for show - he never touched it. His secretary would print out his emails and place them in a folder on his desk for him to read, write out a longhand response, then return to his secretary for her to type up the message and send. No toner, no emails.",
        "created_utc": 1528388550,
        "upvote_ratio": ""
    },
    {
        "title": "The day the PFY graduated, but not before \"DAMN YOU, $BOSS\" echoed across the room",
        "author": "Universal_Binary",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pb26e/the_day_the_pfy_graduated_but_not_before_damn_you/",
        "text": "I was once $Boss, and from time to time I had PFYs (Pimply-Faced Youths, young/inexperienced in IT) reporting to me.  Sometimes I got to watch them grow so much in skill and confidence that they ceased to become a PFY almost right before my eyes.  But, in this case, not without one last hiccup.\n\nTo recap from my earlier story about this PFY ([Never squander a good outage](https://www.reddit.com/r/talesfromtechsupport/comments/8k4ad4/never_squander_a_good_outage_and_how_to_train_a/)):\n\n/// cue flashback ///\n\n&gt; I was constantly trying to drill into the PFYs:\n\n&gt; 1) Check the simple things first.  EVERY simple thing.\n\n&gt; 2) Question all assumptions.\n\n&gt; 3) Don't give up\n\n&gt; When a PFY got stuck and came to me for help, I would always ask about the simple stuff before giving other advice. (You've got to LIVE the rules to internalize them.)\n\n&gt; At the beginning, this would result in many trips back to the equipment, to personally verify that it was plugged in, that the power cable was seated properly (on both ends!), that the network cable was plugged in, etc. This was always accompanied by a quantity of annoyed muttering.\n\n&gt; As they got better, they would come to me saying, \"The box won't turn on, and I've checked both ends of the power cable, verified the outlet works, etc...\"\n\n/// back to the story... ///\n\nSo one day I had this conversation with a PFY:\n\n&gt; Me: I need you to install Linux on this computer.  It'll ask you a few questions.  Here are the answers you'll need.\n\n&gt; PFY: I've never used Linux.  I don't know anything about it.\n\n&gt; Me: I know.  That's why I assigned the task to you.\n\n&gt; PFY: Oh.  &lt;eye roll&gt; Great. &lt;/eye roll&gt;\n\nPFY had been with the company for awhile by this point, and was getting to be good.  I knew he could handle it.\n\nOff he went to the workbench in the lab.  It was in the opposite corner of our open-plan office from my desk.  He started off fine.  Then it started getting noisy.  I heard grunts.  Groans.  \"Dammit!\"  And other visible signs of frustration.  But I left him alone.\n\nAnd he didn't give up.  It was a personal thing with him now - he was determined to solve problems himself, without asking me for help.  He hated it when I solved a problem that he couldn't.  So he kept at it.  Googled, power cycled, everything.\n\nFinally, after an entire hour and a half of frustration, he came over to me.\n\n&gt; PFY: I just can't get this thing on the network.  And before you ask, I've checked everything.\n\n&gt; Me: Any error messages?\n\n&gt; PFY: Yes.  [ shows me ]\n\n&gt; Me: That means the NIC doesn't see a network link.\n\n&gt; PFY: I know.  But I made sure it's plugged in!\n\n&gt; Me: Is the switch working?\n\n(There was a little desktop switch underneath the workbench.)\n\n&gt; PFY: Yeah, other machines on it are working.\n\n&gt; Me: Then go back and double check the network cable to the PC.  Make sure it's plugged in tight on both ends.\n\n&gt; PFY: I'm sure it's fine.  I've checked it at least 20 times!\n\n&gt; Me: Just do it.\n\n&gt; PFY: &lt;really annoyed&gt; FINE.  &lt;stomps off noisily&gt;\n\n20 second later, echoing throughout the entire open-plan office, we hear, VERY loudly:\n\n&gt; PFY: DAMN YOU, $BOSS!\n\nSoft chuckles echo around the office...\n\nHe came over to my desk.\n\n&gt; Me, unable to entirely suppress my grin: Oh, was the network cable unplugged?\n\n&gt; PFY: Yes.  The network cable was unplugged.  AT THE SWITCH.\n\nThat was the very last time the PFY missed something obvious.  He went on to work for several tech companies, being a star tech at each, and recently getting a thoroughly-deserved promotion.\n\nOne day.... Oh yes, one day he will have PFYs.  On that day, I'm going to call him up and ask him to check his network cable.",
        "created_utc": 1528384182,
        "upvote_ratio": ""
    },
    {
        "title": "Jokes too real man",
        "author": "NetT3ch",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pay23/jokes_too_real_man/",
        "text": "One of our call centers has been having a trouble lately with their phones. Since the call center makes money it is generally “drop what we are doing and fix it” kind of work. Tuesday morning, a call center ticket comes in. “We are having trouble with our phones” Our director grabs the ticket. Weird, normally I take those…\n\n\nWednesday morning. Ticket comes in. “We are still having trouble with our phones, can we please have someone look at them?” Director grabs it again. This is really weird…\n\n\nI IM him, “Hey do you need me to take a look at those?” \n\n\n&gt;Him: No, we are handling it.\n\n\n&gt;Me: You know, if we got rid of the call center we wouldn’t have these issues…\n\n\n&gt;Him: LOL\n\n\nThis morning the entire call center is laid off…\n\n\n&gt;Me: I was joking man!\n\n\n&gt;Him: Too late, took your advice\n\n\nWe had just set up a new call center that shared responsibilities with each. I personally thought it was because we were growing but I was told it was because they want to have the call center in the town the corporate office is in.\n",
        "created_utc": 1528383334,
        "upvote_ratio": ""
    },
    {
        "title": "Using serial numbers to work out the difference between 1/I, O/0 and B/8",
        "author": "Turbojelly",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pat4i/using_serial_numbers_to_work_out_the_difference/",
        "text": "A recent story here brought back some bad memories I thought my good friend Jack had buried.\n\n\n**Wiggly lines.** (No, not the ones from a broken CRT, those pesky memory ones)\n\n\nThere I was, a young jelly, turboing around his new temp job. Well, I say new, I had been working at the other site (closer to home) and had recently been moved to this one due them hiring someone with a degree that didn't last as long as I did. Unfortunetly for me the other site had been pretty good at equipment disposal and while I had worked on it, I wasn't prepared for The Room Of Discarded ~Crap~ Equipment. This room was on the 2nd floor (3rd for you yanks) of a building, it was a sturdy room but there were no classrooms at this level, which meant no disability lifts Of course, being English, the lifts worked up until the Management had annouced it open and slapped themselves on the back for being so disabled aware, at which point they promptly broke and were covered in tape (both litterally and figuretly). The room also worked as a heat trap.\n\n\nSo one hot summers day I was assigned to the 1st of a 3 part ~nightmare~ plan. Move old equipment into the room. You see, old equipment was dumped everywhere, server room, backup room (that contained the universities generators), the equipment room (\"I'll break it down later\") and a random triangular shaped room IT used because no one else wanted it. We had a trolley, but as tradition goes, its wheels were the envy of every surly shopping trolley. Work work work.\n\n\nPart 2. Asset time! You may remeber from a previous tale of just how much I want to say \"**Thank** you\" to people who placed serial numbers. This is where it started. Pages and pages of handwritten notes of all sorts of s/n's where produced by me. The work was roasting and the preassure to finish was pushing down on me. When I reached my limit I managed to escape the heat trap to the air conditioned calm of the office where I got to have the interesting task of inputting my written figures into excel. Now, I expect by now you can see my typing skills aren't the best, my handwriting skills are far worse. Trying to define between I/1 0/O and B/8 on the equipment was hard, working it out from my scrawled hand was even harder. Many mistakes where made, many repeated trips to recheck s/n's where performed. Finally I had a technique down, with extra strong lines on 1's. Lines through 0's and very straight B's. Day after day I repeated my own version of Sisyphus until finally, the boulder stayed at the top of the hill. I was free! Or so I thought.\n\n\nPart 3 was thrn revealed. Move all equipment into an empty ground floor room across campus for the disposal company to collect and do the paper work, but you csn't guess where this empty room was in relation to the rooms I had moved equipment out of several weeks before, actually, I bet you can. The paper work was easy enough though, a couple of functions pulled all the relavant information out and auto completed the form for me. Moving the equipment I had lugged upstairs back down again helped me discover my spirit could become an Olympic Limbo Champion. Yet I persisted and I won. Well I thought I had. When the delivery lorry turned up, it was a 2/3 full transit van. \n\n\nBugger.\n\n\n\nTl:dr I'm not crazy. Institution!  \nYou're the one that's crazy. Insitution!  \nYou're driving me crazy. Institution!  ",
        "created_utc": 1528382243,
        "upvote_ratio": ""
    },
    {
        "title": "What a lie looks like.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8pasfq/what_a_lie_looks_like/",
        "text": "[removed]",
        "created_utc": 1528382094,
        "upvote_ratio": ""
    },
    {
        "title": "CEOs and their printers: Part 2",
        "author": "superzenki",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8paqw6/ceos_and_their_printers_part_2/",
        "text": "[Part 1](https://old.reddit.com/r/talesfromtechsupport/comments/8osbcy/ceos_and_their_printers/)\n\nOne day as I'm working at my desk like normal, I see an email come through. Something about our Provost having printer problems. This should be fun...as I'm reading it, my boss comes up to make to ask if I got the email, and if I can take care of it. I let her know I would. The email was forwarded from our CIO's assistant (CIOA), original from the Provost's assistant. Let's call her EA for Executive Assistant.\n\n\"$Provost has requested a new color printer. I didn't want to put a work order in because I wanted to see if you can have someone handle this ASAP. Can you recommend a new color printer for him? He currently has an HP. He wants this removed from him office as soon as the new one comes in.\"\n\nI let out a heavy sigh and call EA before going to find another printer.\n\n&gt;$Me: So can you give me a rundown of what's going on with the printer?\n\n&gt;$EA: Every once in awhile a message pops up on the menu. He asks me to look at it, I clear it. But then it comes back and I don't know what to do about. He's tired of dealing with it, he just wants a new one.\n\n&gt;$Me: And you haven't $Vendor about it or even placed a ticket with us whenever the message came up?\n\n&gt;$EA: No.\n\n&gt;$Me: Alright, since I was already given instruction to replace it, I'll see what I can find. I don't exactly know what our stock is so it will take me some time to make sure it's working without issue.\n\nI go down to our stockroom and locate the \"dead printer\" from the last story. Still just sitting there, collecting dust (a lot of times takes place between these stories) I boot it up and try to run some test prints, one of the toners seems to be out there and I can't find a replacement. I start checking other color printers and they either have problems or have no toner. I never seem to have the downtime to call our vendor on these.\n\nI finally remember we have an extra unused printer from a ticket I did a few months ago. CIOA did order the printer requested for the ticket, then ordered another one on accident, thinking that she hadn't ordered it (things like this happen enough, see [post](https://old.reddit.com/r/talesfromtheoffice/comments/6polw9/because_ordering_things_is_hard/) here). I asked her to process a return for it to get our money back and spend it on supplies we actually need. She said she talked to Dell, the vendor, and they refunded the money over the misunderstanding but didn't need to return the printer.\n\nSo now I have a Dell color printer I can give $Provost. It may not be our standard but it's not unheard of in the environment and we can add it to our service contract. I get to his office and he's there, but leaves as soon as I get there to let me install the printer. It's a USB printer if I remember correctly so it's pretty straight forward. I run some test prints and confirm it's good to go.\n\nI take out the old printer and talk with $EA about the new one. I let her know I'd be putting it on a service contract that would cover supplies and repair. I would send her the information as soon as it's added, and to please call them as soon as something happens on the printer and avoid us having to replace it again.\n\nAfter I got back and set the old printer aside to have it repaired, I sent off an email to my boss and CIOA, explaining the issue and what could have been prevented had $EA just called our vendor. Citing this example and my last tale, I said that the University is throwing money away by paying for a monthly support contract on these printers, and then never using them. Then even more money gets wasted on new printers that don't have to be bought. I urged them to explain this to the higher-ups in this sense and maybe they'd understand things from a financial perspective, considering we're not in a great position right now.\n\nYou'd think that would be the end of that, but there's one last part to this story. When something $Provost's new printer broke down, a coworker of mine was called over to try and fix it. When he couldn't, he called $Vendor and placed a ticket. $Provost didn't like how long he'd have to wait for them to fix it, so he wanted a backup printer in place until then. $CW brought over one and set it up, then had to go and switch the printers back once his main one was fixed. So now he has a backup printer in his office.",
        "created_utc": 1528381741,
        "upvote_ratio": ""
    },
    {
        "title": "Two gaffs by same government organisation!",
        "author": "muzzsjm",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p8751/two_gaffs_by_same_government_organisation/",
        "text": "Someone posted on here yesterday about drilling through into a server room and it reminded me of two stories nearly 10 years ago when I was doing 2nd line support and project roll out work for a government organisation here in the UK.\n\nThis public sector organisation/company I contracted with for nearly 4 years had several buildings on a site where each building varied in age. As money was tight, moving sites or upgrading buildings was way down on the list of things to do. One building where our IT team was based had a toilet and shower on an upper floor. This room just happened to be above a newish server room and small data centre. There was an unfortunate incident where a toilet pipe burst over a weekend resulting in the whole IT department being called in asap by worried security.\n\nThis pipe bursted and resulted in leaving a lot of servers and equipment covered in an unknown brown/black smelly liquid/semi solid goo. I can only imagine a scene out of ghostbusters when the pressure must have released out of the pipe. It was only by chance that another alarm went off in the building that security had gone to investigate. Luckily nothing actually penetrated any cases or chassis to cause damage but very close to taking out a small data centre IMHO. We decided to throw away a lot of monitors, cables and odds and sods rather than clean them. Needless to say a few years later that server room was moved off site and a lot of it virualized. The citrix server they had was therefore known as the \"shit server\" whenever it crashed. \n\nI swear for about 6 months after there was a musky damp smell in that room made worse by the aircon circulating it. Backups would often failed on one of the servers but as management were so busy with user issues this was not a priority! MIND BOGGLES they got lucky with only about 8 hours down time whilst we cleaned the place up.\n\nThis same team/department a few years previous when I had not long started as a contractor had made another gaff in the same building. They had decided to use an upstairs room to store old crt monitors and computers during a hardware fresh swap over to flat screens and new computers. This room housed two pallets of new equipment and was the dumping ground for all the old crt monitors and computers. All that extra weight had caused the floor to start creaking and making noises. \n\nSomeone from the accommodation team advised with the building being so it wasn't a good idea to store a couple of tonnes of IT equipment in there. Literally years and years of old computers, crt monitors and furniture had to be removed over a weekend without the aid of a lift. I remember finding anold 14\" touch screen crt monitor, a 386 IBM PCm boxes of old floppy disks and an old Yamaha 1980s musical keyboard. Bare in mind this was around 2007\\-2008 so floppies for example had been phased out about 5/6 years before.",
        "created_utc": 1528354688,
        "upvote_ratio": ""
    },
    {
        "title": "Loss of Color on IPTV service",
        "author": "stereoroid",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p7y5u/loss_of_color_on_iptv_service/",
        "text": "(This really happened to me specifically - I didn’t read or hear about it from anyone else, and it’s not fiction.)\n\nI work for an $ISP which offers IPTV, and when I started I took customer calls on shifts. This was about four years ago. One evening I got a call from a customer complaining that her TV signal had lost all color, and was showing the picture in black-and-white. The particular set top box we used had a component output (SCART, since we are in Europe), so was she using that? No, she had a modern TV and used HDMI. After a bit more back-and-forth, we figured out that other channels were fine, the problem was limited to this particular channel.\n\nSo I brought up that channel on our test system, and sure enough, it was desaturated, all black-and-white. The channel was TCM, and they were showing a movie that had been made in the 1940s: a black-and-white movie.",
        "created_utc": 1528351785,
        "upvote_ratio": ""
    },
    {
        "title": "The toilet partition that took down an entire building's internet...",
        "author": "Kabukikitsune",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p739g/the_toilet_partition_that_took_down_an_entire/",
        "text": "Sub title:  Why did you put the server *there*? \n\nOkay, while I wasn't in tech support at the time, this was some what my fault; and since then it's left me wondering what the particular company was thinking...if at all.\n\nSeveral years ago, my father and I ran a company where we installed toilet partitions in bathrooms.  It was a pretty high paying job (figure 5 to 10 grand per bathroom), with relatively easy work load. No more than three or four hours a day, if that. Depending on the number of bathrooms being installed, that is.\n\nIn this particular case, we had been called in to replace the partitions in every bathroom on the floor for this company.  They had recently been purchased, and that floor (previously unused) was being converted into a cube farm.  Since the floor hadn't been finished in the first place, we needed to add all the fixtures and partitions.  Due to various laws in place, we were limited in the type of hangers we could use, settling on something called \"full height\" brackets.  Basically an aluminum channel that goes the full height of the partition, and attaches at three or four places, as opposed to the usual small brackets and two attachment points.\n\nIn any case, after checking the building plans to make sure we weren't going to accidentally drill into anything dangerous, like power cables, or water lines for sprinkler systems, we set to work getting ready.  The first few bathrooms went fine, with us getting two or three done before we ran into problems.  \n\nAbout halfway through the next install, one of the crew complained that he had 'hit' something with his drill.  That something had produced all manner of aluminum strips and scrap, making him think he'd hit a metal beam or something.  He hadn't been shocked, nor had water started spraying through the hole; so we told him to stop where he was while we sort out what happened.\n\nWe're consulting the plans, finding that there wasn't anything in that particular wall, when a rather harried fellow came running into the room.\n\n&gt;Fellow:  What did you just do? You shut us down! Fix it, fix it now!\n\n&gt;Me:  Wait...what?\n\n&gt;Fellow:  We just went dark, and customers have business to do! This has to be your fault!\n\n&gt;Me:  We're hanging partitions...so how is this *our* fault?\n\n&gt;Fellow:  I don't know, it just is.\n\nWe immediately stopped work, and started investigating. It didn't take long to figure out what we'd hit.  Walking around outside the cube farm area, we discovered a locked door; complete with a rather interesting keypad entry.  Calling down to the building security, we informed them of the problem and asked what was behind the door.  After several minutes of searching, they informed us that it was the server farm for the company. \nOh... great.\n\nEventually someone from IT popped up on the floor, and after much complaining and consideration, agreed to check the damage.  Guy returned about five minutes later to inform us that we'd hit a server.  So... yeah.  The guy had drilled through the wall, the back of the server, and right into one of the blades. (how the guy didn't get shocked is beyond me.)  This was likely to cost us dearly.\n\nThankfully we ended up being off the hook when it was revealed that there wasn't any interior drywall in the server room.  Literally it was just open support channels, and one sheet of plaster (drywall) hastily plunked on the outside to make it look secure.  No one ever expected someone to have to drill into it, and didn't consider the consequences of having the servers less than an inch from the newly hung drywall.\n\nCompany ended up losing quite a bit from that, I'm told, both from the less than secure nature of their server farm; and the damage caused.  It took us another month to finally finish the contract, after another construction crew had to be paid to actually secure and finish the server room.  \n\nThe company closed about a year later, having gone bankrupt.  Given how blasé they were about security...I can't say i'm surprised.\n\n\n\n\n",
        "created_utc": 1528342603,
        "upvote_ratio": ""
    },
    {
        "title": "Wasn't us!",
        "author": "GreenEggPage",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p6qih/wasnt_us/",
        "text": "I get a call from a large medical office that I support complaining that their internet is down. Take a look remotely and confirm that they are dark, hop in my van and head 15 minutes down the road. I fly into the parking lot and immediately notice a boring machine sitting in the bar ditch. I walk out, look at the little flags, one row of which had been planted by our ISP.\n\nI look left, there's the boring machine. I look right there's a pile of dirt. I look at the flags marking a straight line betwixt the two. Wander on down to the workers.\n\n\"Hey, I think you guys might have bored through our cable connection.\"\n\nWorker 1 looks at the flags and the machine and the dirt pile, looks back at me and says, \"you're probably right.\"\n\nWorker 2 waddles up and asks what's going on. I repeat myself. \"Nah. Couldn't have been us.\"\n\nOh, I'm sorry - it must have been a MUTANT GOPHER FROM THE NUCLEAR BOMB PLANT 20 MILES AWAY, huh?\n\nAfter another one of those incidents, they finally decided to spend $35 a month on a backup internet connection (Internet Insurance is what I call it.) ",
        "created_utc": 1528339220,
        "upvote_ratio": ""
    },
    {
        "title": "Suicide JBOD",
        "author": "MordecaiKravits",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p59hl/suicide_jbod/",
        "text": "Sometime about two years ago, we had a customer needing to move a managed appliance (and JBOD) to a different location about 1000 miles away (it's in Africa)\n\nThey were already on our radar as compelete morons, so we made them a document with pictures, indicating what to move, how to move it, how to power it down, and how to set it back up again once it's at the destination. The key piece of information here is that we told them to remove the PSUs while in transit. The same with the disks in the JBOD (they're all labelled), which have their own shock resistant packages.\n\nWe get a call a few days later;\n\n**Moron1:** Hello, yes, we've just migrated our appliance, and it's not powering on.\n\n**Me:** Are the power supplies showing red lights?\n\n*silence*\n\n**Moron1**: I think so.\n\n**Me**: I need you to *know* so.\n\n**Moron1**: Okay on sec.\n\n*It doesn't help that this guy has a thick African accent that I can barely understand.*\n\n**Moron1**: They are showing a red light, yes.\n\n**Me**: Okay, what happens if you press the power button?\n\n**Moron1**: Nothing, there's no lights on the PC (he called it a PC)\n\n**Me**: Okay, is it plugged in, and is the power to the device turned on at the switch?\n\n**Moron1**: Erm, yep, it's plugged in.\n\n**Me**: Nice. I'm not sure what to suggest. I can understand one PSU going bad, but not both. Do you have anyone else there that can check?\n\n**Moron1**: Yes. *whispers to his colleague in another language*\n\n**Moron2**: Hello, what you want me to do?\n\n**Me**: I need to make sure the server you're looking at is plugged in, and that the PSUs are showing a red light.\n\n**Moron2**: Yes.\n\n**Me**: \\*sigh\\*, okay. One sec.\n\n*me having a moment to think*\n\n**Me**: Do me a favour. Try to push the PSUs into the device, you might hear a click.\n\n*I hear two clicks*\n\n**Moron2**: Okay now there is a red light on them.\n\n*internalised rage*\n\n**Me**: So when I asked you earlier if there was a red light, and you said yes, what did you mean?\n\n**Moron2**: Yes, the red light is on now.\n\n*Critical Hit!*\n\n**Me**: Okay, great. Try to turn the server on.\n\n**Moron2**: It's on now.\n\n**Me**: Great, is the JBOD, the big box full of hard drives connected to the front of the server?\n\n**Moron2**: Yes, it's plugged in. There are a red lights on it.\n\n*weird*\n\n**Me**: Fine, give me 15 minutes and I'll try to connect and make sure it comes up correctly. I'll call you back.\n\n**Moron2**: k bye.\n\n*click*\n\nSo now I'm trying to connect, and the ENTIRE raid is degraded. It's not detecting any disks as valid, which is odd because there is multiple redundancy.\n\nHere is where it gets juicy, you've seen nothing yet. I call them back, Moron1 answers;\n\n**Me**: Hey, so it appears the raid is messed up, did you place the drives back into the device in order?\n\n**Moron1**: Yes they are numbered correctly.\n\n**Me**: Are all the lights red?\n\n**Moron1**: Yes, everything is red.\n\n**Me**: Okay, cool cool cool. Hey listen, what does the label on the main server say?\n\n**Moron1**: It says \"M\\-01 (S\\-01)\"\n\n*The label contains the accompanying JBOD name*\n\n**Me**: What about the JBOD, what does *that* label say?\n\n*I'm not even slightly prepared.*\n\n**Moron1**: Erm, \"S\\-02\".\n\n**Me**: You've disconnected and moved the wrong JBOD 1000 miles from it's accompanying server. I can't help you. You need to deliver this one back to it's origin, and S\\-01 needs to come here.\n\n**Moron1**: Oh.\n\n**Me**: Did you read the instructions we made you? I'm not sure how you managed to disconnect this JBOD from a server you were not supposed to touch. You've now rendered two servers unavailable.\n\n**Moron1**: I don't know.\n\n**Me**: There's nothing for us to do here, move S\\-01 and S\\-02 to their relevant destinations, connect it up, and call me.\n\n**Moron1**: Okay we'll do that, thanks.\n\n*YOU'RE FKING DAMN RIGHT THANKS*\n\nThey didn't even call back. Took them a few days to move everything back, and when they connected it up, everything cam back on it's own, and they closed my ticket. I never spoke to those people again.",
        "created_utc": 1528326189,
        "upvote_ratio": ""
    },
    {
        "title": "“Please stop scheduling things with users for me without telling me...”",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p4min/please_stop_scheduling_things_with_users_for_me/",
        "text": "[deleted]",
        "created_utc": 1528321051,
        "upvote_ratio": ""
    },
    {
        "title": "A good laugh at the office",
        "author": "joyous_occlusion",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p4ddm/a_good_laugh_at_the_office/",
        "text": "A few days back, I got an email from a department head asking to assist a user to access an RDS portal as this person \"was able to access it before, but now it's not working.\" Our software lead ($dev) was cc'd on it as well.\n\nFirst of all, the URL the head included in the email was wrong. Second, there was no indication where the user was located (onsite, offsite, at a colocation, etc). Last, no contact information was provided for the user except for an email address (oh, and not to be forgotten, no ticket was opened).\n\nI sigh as I explain to my junior tech ($jt) the missing information and how to respond to such requests.\n\n$dev comes over after I verified the site actually works, and the following conversation ensued:\n\nME (to $jt): ...so the only thing I can do at this point is assume nothing and email this person to reach out to me so I can ask a few questions.\n\n$JT: I see. So everything is working, but this person just can't get on?\n\nME: Correct. My guess is this person is working remotely and doesn't know that they need to be on the VPN, they're at another site on a guest network that can't access our network, or something else they're not doing right.\n\n$DEV: Like reading their instructions?\n\nI looked at the email, and it was a thread that included attached instructions on what they need to do to access our RDS system, both locally and remotely.\n\nWe all got a good chuckle out of that, then out comes our boss, red faced and tears streaming out of his eyes from laughing, saying, \"Oh, no, we can't POSSIBLY expect anyone to read ANYTHING correctly, can we?\"\n\nAfter that, the last two hours of the workday were pretty much over.",
        "created_utc": 1528319056,
        "upvote_ratio": ""
    },
    {
        "title": "\"What do you mean I didn't check where the buried lines were?\" an Air Force story",
        "author": "JackTheBehemothKillr",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p481v/what_do_you_mean_i_didnt_check_where_the_buried/",
        "text": "First deployment was Kuwait.  \n\nI was a comm guy in a fairly sleepy shop.  About the most we had to do was monitor circuits, update crypto, run wiring inside buildings, and once a night we had to turn the porno off.\n\nAnywho, people don't really recognize how much of a pain in the ass rain is in the desert.  Out in the sand, its not an issue, it drains quickly and its like it was never there.  However where people build and live just under the sand is this hard-packed amalgamation of sand, rock, and other crap that doesn't let the water drain.  Half an hour of rain can lead to a foot of standing water in some places.\n\nWell, spring rains came one night and drenched the entire base.  A road down by the flightline was completely cut off by the rain.  Some of the Security Forces (cops) were upset that they couldn't patrol the entire flightline and were whining about that (they were likely more upset that one idiot drove his cop car straight down the road and sank it so the hood was below the water.)  So the Security Forces commander calls the Civil Engineering commander and gets some guys down there with a wide variety of heavy equipment, including some goober with a ditch witch.\n\nSomewhere around midnight they get to work cutting a channel to best allow the water to drain.  Almost the very first thing they do is run across a fiber optic bundle that supplied internet and the various secure comm lines to the entire base.  Everyone got woken up, even people that had no knowledge of repairing fiber optics (meaning me) and were put to work.  Somehow I managed to get chosen to work with C.E. and verify where the buried lines were.  This basically meant slogging through knee-deep to mid-thigh freezing water trying to find flags.  Until that had been completed our commander didn't allow any more C.E. involvement other than that necessary to unearth enough of the bundle for us to repair it.  About halfway through that C.E. was able to get a pump setup and start draining the water.\n\nEnded up taking the guys fixing the bundle 5-6 hours standing mid-thigh in freezing cold water to get the bare necessities back up and running and get the planes flying.\n",
        "created_utc": 1528317948,
        "upvote_ratio": ""
    },
    {
        "title": "Headset Usage Problem",
        "author": "perljun",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p3pp3/headset_usage_problem/",
        "text": "Hi folks,\n\nobligatory \"long time lurker, first time poster yada yada\"\n\nI'm a system administrator, mostly storage and virtualization but since we only have one 1st tier helpdesk technician my colleagues and I also do 2nd tier helpdesk.\n\nSo this happened yesterday. I get a notification about a new ticket titled \"headphone usage problem\". Check who created it and instantly facepalm. \n\nBackground info, our executive board consists of 4 people and they share 2 secretaries. In their infinite wisdom they deciced to get rid of both secretaries at the same time and hire two complete new assistants (their terminology). \nThat was two month ago. Obviously those two month were filled with tickets, mails and phone calls á la \"who's responsible for ...\", \"how do you.....\" and so on. I really tried to give them the benefit of doubt because they were both new but after a month I just dubbed them \"dumb and dumbr\" and just try not to break my desk with my head.\nOur telephone system is VoIP and since we also have an in-house customer callcenter we also have client software on our computers for extended features. If you're not a callcenter agent you don't really need it but it has some features people like to use e.g. copy a telephone number from an e-mail and paste it in the client to dial.\n\nSo the ticket reads:\nHello,\nit is with regret that I have to inform you, that I can no longer use my headset. Everytime I dial a phone number using the phone software it phones out from ext$2 which belongs to my colleague instead of ext$1 which is mine. Instead I have to cumbersomely use the keyboard on the phone to dial. Immediate assistance ist required.\nSincerely dumb€r\n\n1st thought:\nWhat does that have to do with the headset?\n2nd thought:\nWhat's cumbersome about using the bloody dialpad on the phone?\n3rd thought:\nOh man, I bet dumber is using dumbs extension to log into the client software.\n\nSo I reply:\nHello dumb€r,\nWhat number do you input into the program when you open it?\n (Please note the absence of any technical terms as to not overload dumbers brain)\n\nInstead of an reply in the ticket I get a phone call.\n\ndumb€r: (long winded repeat of everything in  the ticket)\n\nMe: Yes, yes but what number do ..\n\ndumb€r interrupts: (another repition)\n\nMe: I understand but what num..\n\ndumb€r interrupts: (another repition with interjected \"I can't work like this, nothing works\")\n\nMe interrupts: Do you mind if I log on remotely?\n\ndumb€r: Not at all (gives me ID and password)\n\nI log on and check the number she's using and of course she's using ext$2 instead of her own ext$1. I log her off and try to log her in with ext$1. An error pops up \"You're allready logged in\" \n\nMe: Huh?\n\ndumb€r: I tried that but it gave me the same error. So I tried to trick it by putting ext$1 as the password.\n\nMe(facepalm): It wouldn't log you in so you tried to trick the program by using ext$1 as the password for ext$2?\n\ndumb€r: Yes, but it is still not working. Why doesn't it work?\n\nMe: Well, it's not working because you're using the wrong login and you can't use the right login because someone else is using it.\n\nLong story short, I went up to the top floor checked both their logins and just as I thought dumb was using dumbers extension. Logged both of them off and told them to use the right numbers to log in.\n\nIt's a three digits extension and they're not at all similar. It's also on their phone display.",
        "created_utc": 1528314269,
        "upvote_ratio": ""
    },
    {
        "title": "How To Fix HP Printer That Keeps Going Offline In Windows 10 And Mac?",
        "author": "griffinmark",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p3ob6/how_to_fix_hp_printer_that_keeps_going_offline_in/",
        "text": "[removed]",
        "created_utc": 1528314014,
        "upvote_ratio": ""
    },
    {
        "title": "How To Fix HP Printer That Keeps Going Offline In Windows 10 And Mac?",
        "author": "griffinmark",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p3lb3/how_to_fix_hp_printer_that_keeps_going_offline_in/",
        "text": "[removed]",
        "created_utc": 1528313412,
        "upvote_ratio": ""
    },
    {
        "title": "It Doesn't Work",
        "author": "philosowrapter",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p2x37/it_doesnt_work/",
        "text": "Backstory: I'm the lead software developers at a marketing company of around 150 employees.  We haven't always had someone on tech support so when people had issues with computers they just came to me and my developers because \"we know computers\".  \n\nThe printer problem:  Printers suck, we put a man on the moon and printers never just work.  I consider it a form of job security for anyone technical.  But our printer wasn't working and they were going to throw it away.  My team didn't have a printer so I said \"We'll take a look at it and if we get it to work we'll just use it\".   We were met with some criticism for taking up this task.  The CEO of the company and one of our lead marketers.  They almost chanted for an hour straight \"It doesn't work\" and we were also laughed in our face saying \"You think you can do that\".  The game was afoot.\n\nUpon looking at the printer's setup it wasn't connected to the network.... so we did the logical thing and connected it to the network.  After doing this we found that we could not connect directly to the IP no matter what protocol was selected.  Because printers.  So I did the next logical step and installed the driver from online.  I then connected to the printer and printed the now infamous phrase in the office: \"It Doesn't Work.\"  I proceeded to bring the printer back into the CEOs office and laid the freshly printed warm paper and let him know we actually didn't need a printer for our team.\n\n",
        "created_utc": 1528308592,
        "upvote_ratio": ""
    },
    {
        "title": "Where did my data go?",
        "author": "squazify",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p2at9/where_did_my_data_go/",
        "text": "So a little backstory for this, I had been the sole employee of a branch of a small computer store. We had 3 locations and mine just existed because they didn't want to close the store. This also meant that when several employees quit and there wasn't enough people to handle the work at the other stores I got the excess workflow.\n\n3 characters in this story.  \n$ME: James Franco  \n$AO: Asshole store Owner\n$CX: Clueless Customer\n\n# Act 1: Set up for failure\n\nAs mentioned before, several people had quit so there was a lot of overflow. The main branch sent me all of the computers that needed windows reinstalled. I had gotten a call from the owner.\n\n&gt;$AO: \"What's taking so long?\"\n\n&gt;$ME: \"The backups, I don't have a NAS here, so I can only really back up 1 or 2 machines at a time.\"\n\n&gt;$AO: \"Well what about the machines that don't need backups?\"\n\n&gt;$ME: \"I've been backing them up just in case, it's saved my ass too many times to not back them up.\"\n\n&gt;$AO: \"I don't care. We are way behind schedule, I need you to only back up the machines that say they need to be backed up.\"\n\n&gt;$ME: \"Ok, fine.\"\n\n# Act 2: Enter the fool\n\nSo now I have about 15 computers in my store that need to have windows reinstalled when a customer walks through the door. This is somewhat rare because that store probably only saw 2-5 customers a day.\n\n&gt;$ME: \"Hi, how can I help you?\"\n\n&gt;$CX: \"I was hoping that I could get a Format and Reload\"\n\n&gt;$ME: \"Oh ok, are you sure you want a format and reload?\"\n\nIt should be noted at this point that there is a sign above me that says what services we offer and format and reload basically says \"We reinstall windows on your computer\"\n\n&gt;$CX: \"Yeah, I want that.\"\n\n&gt;$ME: \"Oh ok, do you want your data backed up, or have you already done that?\"\n\n&gt;$CX: \"Oh I've backed up all my data so don't worry about that.\"\n\n&gt;$ME: \"Alright, sounds great, I'll get right on that.\"\n\nSince this was a customer at my store I decided to have his computer be the next available one, which lucky for him wasn't too long afterwards. I quickly went to work on reinstalling windows. I called him mid day the next day informing him that all the updates were done and his machine was ready. He was at work and informed me that he would pick it up that night.\n\n#Act 3: Houston we have failure\n\nI come into work the next morning to see him holding his computer outside the store door. _Ugh great, it's too early for this shit_ I disable the alarm and go around and open the front door.\n\n&gt;$ME: \"Can I help you?\"\n\n&gt;$CX: \"What did you do to my computer?\"\n\n&gt;$ME: \"Is it not booting?\"\n\n&gt;$CX: \"When you pull it up nothing's there.\"\n\nOh ok, probably just booted to a black screen for the first time. I swap another computer's spot real quick to see if it boots. Pulls up fine. Probably no big deal. Right?\n\n&gt;$ME: \"It looks like it pulls up fine to me. Was it doing this before?\"\n\n&gt;$CX: \"None of my stuff is there.\"\n\n&gt;$ME: \"You asked for a format and reload.\"\n\n&gt;$CX: \"Yeah, so where is my stuff\"\n\n&gt;$ME: \"It got removed when I reinstalled windows.\"\n\n&gt;$CX: \"Why would you do that? I just wanted you to remove the viruses\"\n\n&gt;$ME: \"Because you asked for a format and reload. It says on the sign that we reinstall windows on that. If you look further up the sign you could ask for a tune-up or malware removal and that would have gotten rid of the viruses for you.\"\n\n&gt;$CX: \"Well, get my stuff back.\"\n\n&gt;$ME: \"Ok, well you mentioned you had a backup. Do you have it on a external drive or is it online?\"\n\n&gt;$CX: \"Oh I can get that.\"\n\nProceeds to open up My Documents.\n\n&gt;$CX: \"It's gone!\"\n\n&gt;$ME: \"Yeah, do you have it on like a flashdrive or on an external hard drive? Or do you have a backup service?\"\n\n&gt;$CX: \"No, you have to get it back. There's 4 years of my quickbooks data on there and the deadline for taxes is next week!\"\n\n&gt;$ME: \"I'll see what I can do.\"\n\n#Epilogue\n\nIn the end I tried running some recovery programs on the drive, but never was able to find his quickbooks data. I did get one phone call from the owner though.\n\n&gt;$AO: \"I have a customer calling saying you lost all of his data!\"\n\n&gt;$ME: \"Yeah, the customer asked for a format and reload, and didn't want the data restored.\"\n\n&gt;$AO: \"Why didn't you back it up?\"\n\n&gt;$ME: \"Because you told me not to because it was taking too long, remember?\"\n\n&gt;$AO: \"Well, he's writing bad reviews on facebook, make sure this never happens again.\"\n\nI started backing up data again when reinstalling windows, even on machines that didn't ask for it. I'm not sure what the moral of the story is. I quit that job not too long later for other reasons.",
        "created_utc": 1528304304,
        "upvote_ratio": ""
    },
    {
        "title": "It's *always* DNS",
        "author": "extensiondenied",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p29zn/its_always_dns/",
        "text": "Quickie because I'm still scratching my head about this one.  \n\nWas tracking down a domain issue (rant for another day) at a fairly new client. Their previous MSP was nice enough but I've had problems since day 1. Exhibit A: outdated passwords on the documentation they handed over. Exhibit B: OUIs missing from the switches they deployed shortly before we took them over. (*That* particular problem I have seen enough times it's my first go-to for a phone not working.)  \nExhibit C: Their domain. It's not contoso.int but it might as well be with how badly it's named.  \nI was on the PDC looking for a mapped drive setting. No GPOs for it, so perhaps a script? So I tried pulling up \\\\\\contoso.int to get to the Sysvol folder.  \nNada. Timed out. On the PDC. And ping turned up 172.16.1.5, which wasn't responding and had no ARP entry.  \nSo of course, as my favorite shirt declares, it's DNS.  \nThey had old/nonfunctional nameservers out the wazoo, some dating back years. Plus the secondary DC was missing in spots. I tidied up the records and cleared the caches, then switched back to cmd. Nslookup gave me the right response!....but ping didn't. Even after multiple courtesy flushes.  \nI was still thinking it was a latency issue. But a nagging bit of doubt after working on desktops doing the same thing pointed me to the hosts file.  \nAnd there. it. was.  \n&gt;172.16.1.5      contoso.int  \n\nDeleted the entry and everything came up fine.  \nAnd the scripts I was looking for were there but unapplied. So I still have no idea how their drives are getting mapped besides manually.  \n  \n*****  \n  \n**TL;DR:**  \n&gt;Can't be DNS   \nThere's no way it's DNS  \nIt was DNS  ",
        "created_utc": 1528304146,
        "upvote_ratio": ""
    },
    {
        "title": "so *that's* how!",
        "author": "ditch_lily",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p24fi/so_thats_how/",
        "text": "[removed]",
        "created_utc": 1528303073,
        "upvote_ratio": ""
    },
    {
        "title": "Completely Encrypted",
        "author": "Selben",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p1n3x/completely_encrypted/",
        "text": "**Do you like to read in Chronological order? Here is the [Index](https://www.reddit.com/r/Selben/comments/60r5ps/timeline_for_tfts_stories/)**\n\n \n\n&amp;nbsp;\n\n \n\n$Selben: Me! Tier 2 help-desk technician for a mid-sized company, with a very skeleton-crew help-desk. 10 of us total providing 24-hour coverage (not including supervisors) for 2500+ people company-wide.\n\n \n\n$HRDrone: Random HR person.\n\n \n\n$HRLead: The HR ~~Hivemind~~ manager.\n\n \n\n$Sup1: Previously in sales. No IT background and causes more issues than he solves.\n\n \n\n$Sup2: All around great supervisor. Worked his way up from the support line and understands how the helpdesk works. Being the night-shift manager makes communication with all shifts difficult.\n\n \n\n&amp;nbsp;\n\n \n\n$Selben muted the customer and yawned. It was the last day before a holiday weekend and had been a long shift. Despite only three calls and two emails for the entire day, none of the techs were allowed to leave early, just in case an important issue arose. $Sup1 was pacing around the office and in a particularly bad mood since he had been given the responsibility of locking up the building when the techs all left.\n\n \n\n&gt; $Selben: Okay… Now reboot.\n\n \n\n&gt; $User: It won’t reboot!\n\n \n\n&gt; $Selben: Click reboot.\n\n \n\n&gt; $User: Oh, its rebooting now! Is it done?!\n\n \n\n&gt; $Selben: Let’s wait for it to reboot…\n\n \n\n$Selben finished all his notes for the ticket, then stared down at the time, waiting for it to magically speed up, while occasionally responding to the customer with the occasional ‘Yep, just wait! And what do you see now?’.\n\n \n\n&gt; $User: It’s working now!\n\n \n\n&gt; $Selben: Great, have a wonderful weekend!\n\n \n\n&gt; $User: Okay, bye!\n\n \n\n$Selben then along with all the other techs returned to staring at the empty call queue\n\n \n\nWith two hours remaining, $Selben watched as a couple other techs finished their shifts, nodding in solidarity as they headed out. Another hour passed with no calls or emails, $Selben sat quietly. $Sup1 was on his cell chatting with someone, looking a bit more cheerful as the day was finally coming to an end. Once $Selben was off his shift, $Sup1 could also leave - from what he overheard $Selben concluded $Sup1 had a date. With ten minutes left, naturally $Selben’s phone began to ring, he could practically feel the dagger like eyes from $Sup1 across the room.\n\n \n\n&gt; $Selben: Thank you for calling, this is $Selben.\n\n \n\nA panicked voice came from the other side.\n\n \n\n&gt; $HRDrone: This is $HRDrone from HR!\n\n \n\n&gt; $Selben: Okay.\n\n \n\n&gt; $HRDrone: I need to take care of something urgently! But you can’t look at it, because the information is confidential! I need this file completely encrypted!\n\n \n\n&gt; $Selben: Okay, no problem! That should only take a couple minutes.\n\n \n\n$Sup1 stood next to $Selben’s desk, pointing at his watch. $Selben muted the call briefly and explained it was someone from HR. $Sup1 threw his hands in the air and stomped back to his office.\n\n$Selben was eventually able to get $HRDrone to give up some of the “classified information.” It was something that had to do with a legal issue, so to be emailed around it needed to be encrypted. Simple enough. $Selben offered to connect in and show how to use the software they normally use. However, $HRDrone refused to let him connect in case he tried to look at the files. (*Sigh*) After two and a half hours, $Selben was finally able to walk $HRDrone through installing the software and encrypting the file. $HRDrone seemed happy about the success and finally the call ended.\n\n \n\nNo sooner had the receiver hung up, $Sup1 was practically pulling $Selben out of his chair and pushing him out the door. Besides the minor delay, $Selben had a good holiday weekend. The whole company was off, and the IT Department was included - three worry-free days of bliss.\n\n \n\nNaturally upon returning to work Tuesday morning, $Selben was ~~ambushed then captured~~ greeted and taken to a side office by some HR ~~minions~~ employees. $HRDrone, $Sup2, and the head of HR were already waiting. Everyone was very upset, so $Selben sat and patiently waited to be fired for something he had (or hadn’t) done. After the long weekend it’s sometimes tough bounce back into things without coffee.\n\n \n\n&gt; $HRLead: I need to know why things were handled *this* way.\n\n \n\n&gt; $Sup2: Please explain to us what the problem is.\n\n \n\n&gt; $HRDrone: HE! (*points at $Selben*) took forever to encrypt my files and then it didn’t even work. I’m betting is was because he was in a rush to leave on Friday. This is poor customer service!\n\n \n\n&gt; $Sup2: $Selben is more than capable of running the encryption software. I doubt he just didn’t do it.\n\n \n\n&gt; $Selben: Ah, well, I was told to not connect to the machine, so I spent two and a half hours walking $HRDrone through the process.\n\n \n\n$Sup2 raised an eyebrow.\n\n \n\n&gt; $HRLead: Why wouldn’t you let him connect? He’s part of IT.\n\n \n\n&gt; $HRDrone: It’s part of *The Files*\n\n \n\n&gt; $HRLead: You mean *The Files*?! Of course they can’t see them!\n\n \n\n$Selben refrained from letting his eyes roll into the back of his head.\n\n \n\n&gt; $Sup2: Okay, let’s just fix this - can we look at the file?\n\n \n\nAfter much convincing that seeing a filename wouldn’t let IT know the contents of *The File*, they got $HRDrone to show *The File*. As $Selben expected, it was encrypted, and no issue could be seen by him or $Sup2.\n\n \n\n&gt; $Sup2: So, what’s the…\n\n \n\n$HRDrone interrupted, holding up a hand with a smug look. He opened an email, dated before the call to $Selben on Friday, where the file had been shared with him from $HRLead, and opened it.\n\n \n\n&gt; $HRDrone: See, it’s not encrypted at all! Also, watch this.\n\n \n\n$HRDrone pulled out a thumb drive. $Selben bit his lip after making the realization of what was about to happen. $HRDrone put the drive into his machine and was able to open the file stored on it without decrypting it as well.\n\n \n\n$Sup2 and $Selben glanced over at $HRLead, who had gone quiet. His jaw was actually dropped. $Selben was impressed at how closely $HRLead suddenly resembled a cartoon character.\n\n \n\n&gt; $Sup2: Okay, I’ve seen enough. $HRLead, we will schedule some training for your staff on how encryption works in the next week.\n\n \n\n&gt; $HRLead: Agreed.\n\n \n\nAs a recap, $HRDrone thought once you encrypted a file that ALL copies of the file in any location would also be encrypted. All HR reps were scheduled to go through a mandatory training over the next month on how to use the encryption software and expectations of how it should function.",
        "created_utc": 1528299731,
        "upvote_ratio": ""
    },
    {
        "title": "The printer won't work",
        "author": "crapengineer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p1jwg/the_printer_wont_work/",
        "text": "A call came in to visit site to diagnose a printer fault at a customer's site. Now bear in mind this call has bean through our diagnostic process and it's not been resolved and it is deemed that an engineer is needed. I phone up to check the details and see if I can fix it remotely because I'm a lazy bugger.\n\nAn older woman with a very upper crust voice answers. She tells me that it is vital that I get this printer working ASAP as it's vital to their business. I ask her to check a few things and she tells me that I'm wasting time the other chappie on the phone couldn't figure out what was wrong. I should get in my little van and come here to fix the printer. I again ask her to look at the front of the printer and tell me if she can see any lights. \"No it's completely dark.\" she reports. Is the mains cable plugged in? \"Of course it is, it's already been checked\". \"How about the other end of the mains cable?\". \"That won't have been unplugged, it's down the back of a cabinet no one would have touched it.\"\n\n\"Would you just check it please?\". \"I'll have to put the phone down, just a minute\". I can hear huffing and puffing and things being moved. The I hear a muffled \"Well, who the bloody hell unplugged that\".  She come back on the phone and says \"I think there was a loose cable, it all seems OK now thanks\".",
        "created_utc": 1528299060,
        "upvote_ratio": ""
    },
    {
        "title": "Data recovery on a folded (yes, folded) MacBook Pro",
        "author": "azRyMHk0ZTBzNF8K",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p14na/data_recovery_on_a_folded_yes_folded_macbook_pro/",
        "text": "Yes, that's right. *folded.* Take a look at your nearest laptop, or search for an image of one. Imagine if you drew a line down the middle and bent the laptop roughly 90 degrees about that line. That's what rolled into our desktop queue on Monday, with a note that said \"can you recover data? important thesis work,\" along with the client's contact details.\n\nI later learned the client was walking at the top of a tall winding staircase surrounding a large open column of air (perfect for dropping things down, apparently) and they dropped their laptop off the edge after tripping. 8 unfortunate stories later, this laptop managed to break the floor tiles at the bottom of the stairs, and the laptop itself, which landed on its edge, looked liked someone stronger than I had gotten angry and just bent the thing across the middle.\n\nThe poor tech who got assigned this one was considering writing it off as an impossible recovery job, but when we looked at the client's details and realized who we were dealing with, we decided that it might be a good idea to at least try. (That's a different story.) After a bit of prying, we managed to get the bottom plate off of the device, and realized that we had previously replaced the HDD with an SSD for this same client. A glimmer of hope came out of this discovery, and the tech quickly worked to remove the SSD from the chassis. The logic board, snapped in two, was unsalvageable to an almost comical extent, but the SSD came out without any problems and had no data corruption whatsoever. We managed to return the entire contents of the drive to the client, and after a lot of paperwork they managed to get a new device from our stockroom out of the deal.",
        "created_utc": 1528295923,
        "upvote_ratio": ""
    },
    {
        "title": "The laminator and the plug socket",
        "author": "buggerlugseng",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p0xg1/the_laminator_and_the_plug_socket/",
        "text": "I worked as a tech in schools and was in the office when I got given an urgent ticket:\n\nThe network has gone down in half of the school we need it up and running now. \n\n1st line had done the usual are all the lights on in the switches ect. \n\nThis school had had several network issues so I got sent to investigate. The visit went like this:\n\nI arrive and go to the switch cabinet at that side of the school where I see 8 empty plug sockets and a laminator plugged in and the switch plug laying on the counter. I promptly plug it back in and low and behold problem solved. I moved the laminator and put a sign covering the switch plug saying do not unplug. I inform the school what had happened and leave. \n\nThe next day I receive a frantic call stating the network was down again. I ask them to check the plug and am assured that it is plugged in and that, that is not the issue. \n\nSo I head to the school go to the cabinet and see it is back to the laminator being plugged in and the switch unplugged. I carry out the same procedure and take the IT link there to show them and tell them that they need to check this before calling. All is well and IT link is happy. \n\nThe next day guess what? Another call about the network being down. Speak to IT link and he assured me he has checked the plug and that is 100% not the issue. I begrudgingly go back to the school and discover that it has been unplugged again. At this point I had, had enough. I went and found the headteacher and IT link and had the following conversation:\nMe: someone keeps unplugging the switch causing your network to keep dropping, this is the third time this week and it’s starting to cost you a lot of money; £75 a visit to put a plug back in the wall.\nHT: well why didn’t you tell us this was the issue!!??\nMe: I told reception staff and IT link.\nIT link cuts in: no you didn’t, you said it was network problems like we had before.\nHT: this is unacceptable, I’m calling your office as this is beyond a joke.\nMe: can I show you an email quickly?\n\nProceed to show her the emails to IT link stating the problem and how to fix the issue, including pictures.\n Safe to say I walked out of there happy and IT link did not.\n\n\nOn a site visit a couple of weeks later I found out a TA had been unplugging the switch as she had been told to use the far right socket on her induction prior to the network cab being installed.",
        "created_utc": 1528294383,
        "upvote_ratio": ""
    },
    {
        "title": "WIFi is down!",
        "author": "mountainwombat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p0jnk/wifi_is_down/",
        "text": "A quickie for the middle of the week.\n\nI am an old  semi retired, semi burnt out tech who left the glamour of IT in the big city to spend my declining years in a small country  town\n\nJust got off the phone talking to a small business located around 40 Kilometers from my office. The desktop (yep they only had one)  was was successfully printing to the network printer, but the laptop (again they only had one) was  not.\n\nThe business was run by a married couple who are usually able to solve their own problems  and as I started asking   questions the husband  put me on speaker so both he and his wife could answer them.\n\nMe: can you  see the internet?\n\nHusband: Yes no problems on my desktop.\n\nWife: Not on my laptop.\n\nMe: The laptop is connected wirelessly isn't it?  When did the trouble start?\n\nWife: That's funny I was cleaning the office, I picked up the router to dust the shelf and when I got back to my desk printing didn't work. Oh! I've done something silly haven't I?\n\nThr router had a manual button to disable WiFi, and somehow she had managed to turn it of when the router was picked up. I told her to go to the router and press the WiFi  button on the side. router, and all was working again.\n\nTLDR: It is not always the printer, Sometimes cleanliness is next to network outages.",
        "created_utc": 1528291203,
        "upvote_ratio": ""
    },
    {
        "title": "An ode to \"This is Urgent and must be Fixed by CoP\"",
        "author": "Grubbery",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p0f25/an_ode_to_this_is_urgent_and_must_be_fixed_by_cop/",
        "text": "[removed]",
        "created_utc": 1528290137,
        "upvote_ratio": ""
    },
    {
        "title": "Logging onto Windows with a different username STILL doesn't change your username on a 3rd party website.",
        "author": "networkedquokka",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8p08ub/logging_onto_windows_with_a_different_username/",
        "text": "One of the applications we use requires a browser plugin. From time to time this plugin fails and has to be reinstalled - a process which usually involves much manual editing of the registry and hunting down configuration files for termination. Occasionally things are so messed up it is quicker and easier to reimage the machine and start over: the plugin configures itself under each individual user's profile and, on a shared computer, there can be dozens of profiles. From time to time I see the plugin working under some profiles but not others, hence the rewipe because I don't feel like going through each individual profile and making the fixes.\n\nOne of the profiles is kiosk mode which is pretty locked down. You can use the third party application and not much else - it hobbles the user to an extent, but when their regular profile is borked it will get the job done until I pull the machine to wipe. So I tell the user to log in under the kiosk account and they're good to go.\n\nUsers frequently believe that when they log in under username: kiosk their username on the third party site *also* changes to username: kiosk. I then get another call saying they can't log in to the 3rd party site.\n\n$me: ok, what is your 3rd party username\n\n$user: kiosk - that's what you told me to log in with\n\n$me: no, that's the account to log onto Windows. Your 3rd party username is unchanged\n\n$user: Oooohhhhhhhhhh\n\n$me: ...\n\nBONUS: Many users repeatedly, as in every three months, believe that when the 3rd party site forces them to change their password EVERY other password is changed along with it - local computer, email, payroll, I haven't seen anybody think their bank account password changes yet, but give it time.\n",
        "created_utc": 1528288523,
        "upvote_ratio": ""
    },
    {
        "title": "Tales From Aircraft Maintenance (sort of): Tank you very much",
        "author": "ITSupportZombie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ozx2m/tales_from_aircraft_maintenance_sort_of_tank_you/",
        "text": "A few years back I was deployed to $DeployedLocation. I was assigned to our local command post equivalent for a few months because I was “good with computers”. Our setup was most definitely austere. The squadron was set up in a mix of cargo containers, tents and other scavenged equipment. There were permanent facilities nearby but we were not welcome there due to my officer being a selfimportantjackass. I, however, was able to secure a single network link to connect us to their network and the outside world.\n\nBeing an avionics tech, I knew the basics of signal flow and the basics of how networks function. That made me the IT guy for my unit. The problem was, our “compound” was located across the street from where I could get the line run from. Being the highly skilled scrounger and all\\-around McGyver that I am, I took one of my airmen and fabricated a steel guard so cars wouldn’t run over the cable and destroy it. It worked for a few weeks…\n\n…until a tank ran over my cable guard and crushed it.\n\nMy officer, being who he was, demanded I fix it immediately and he didn’t care how. Once again, I take my airman and go a’scrounging. I was unable to locate another length of cat5 that would run the length I needed and was unable to secure crimpers to make my own cable. We did locate a few patch cables and my airman had one of his better ideas.\n\nSolve the problem with duct tape. We patched in several lengths of cat5 into the crushed cable and used duct tape to splice and bind the patched lengths.\n\nProblem 2. We cannot run it across the road again. There are trees lining this road on both sides.\n\nI boost my airman into the tree and we run the cable up one tree (bound with duct tape), through the tree (bound with duct tape), across to the other and down.\n\nWe restored network connectivity in under 3 hours after a tank ran over our network cable.\n\nAs a thank you for my effort, my officer sent me back to the flightline and back to turning jets.\n\nNote: Later that week I got the injury that ended my Air Force career.",
        "created_utc": 1528285364,
        "upvote_ratio": ""
    },
    {
        "title": "Words failed me.",
        "author": "thelonepenguin",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8oww4d/words_failed_me/",
        "text": "I'm not proper tech support but since I started with this small company at entry level customer service, I've proven to be enough of a self-starter to get promoted several times to somewhat of a data analyst/client reporting master/basic coding resource and I'm often backup IT/Tech support for a lot of the team. \n\n\nIn any case, I had developed some automation of menial work that also allowed for some helpful data points and trends to be displayed on a user-friendly dashboard on the fly out of my own desire to see what I could do.  The CEO found out about this project and asked me to deploy it to one of the directors (Director, for now).  Once I walked Director through how it all worked, there was one aspect that she requested that needed some work; fixing this required my collaboration with a developer currently on an extended vacation.  No big deal; I was able to devise and document a set of something like 7-10 steps that would work fine until it was fully automated. \n\n\nThis particular Director was, of course, not great with any kind of tech and really struggled with anything to do with Excel beyond simply opening a file.  I knew this would be painful for her so I took pains to type out each step complete with snips of what each step looked like, color coding, the works.  I emailed her these steps after reiterating why it was needed, that this was temporary, etc., and also included someone close to her in her office (we don't work in the same location) who I knew would be able to help her out if she couldn't reach me with issues.  Additionally, I let her know that I would be flying to her location for a week very soon and I would absolutely make time for her while in the office as she struggled a bit with following along in screen sharing. \n\n\nFast forward, and I'm at her location.  I try to drop by her office a couple times but each time she tells me she's too busy to talk.  Okay, I guess.  On that Friday, my last day there, within my last hour, I'm in a meeting with the CEO, a couple other of execs, and a couple directors and I'm largely taking that time to field questions and discuss areas for improvement.  I'm suddenly interrupted mid-sentence by Director flinging the door open.\n\n\n\nDirector: [Me], why isn't the dashboard ready for use?? It's so important!\n\nMe: [blinking a few times] It requires some upgrades but is functional... did you get my email outlining the steps needed?\n\nDirector: Yes!  I need to test it!  I don't have time!\n\nMe: ...\n\nDirector: ...\n\nCEO: ...\n\nEvery other exec/director in the room: ...\n\n\n\nIt was silent in the room for an uncomfortably long time.  I legit wondered if she was suffering some kind of stroke because... what does any of that even mean??\n\n\nMy response was just to pretend that it never happened.  I picked up where I left off, addressing everyone in the room but her.  At some point, she left and closed the door behind her.  No one mentioned what had happened but I received a delivery back at my home office the following Monday of a bottle of wine from the CEO with no explanation.\n\n\nI think Director realized she was acting insane because she was able to process my instructions for a while before the promised update occurred.  She left the company not too long after that.  To this day, I replay her words over and over trying to figure out what she possibly thought I could have helped her with...",
        "created_utc": 1528251409,
        "upvote_ratio": ""
    },
    {
        "title": "I was at a complete loss fords words.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8owtg6/i_was_at_a_complete_loss_fords_words/",
        "text": "[deleted]",
        "created_utc": 1528250778,
        "upvote_ratio": ""
    },
    {
        "title": "We need you out there ASAP!",
        "author": "NetT3ch",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8owrfs/we_need_you_out_there_asap/",
        "text": "On a Friday afternoon I got a IM from my boss “Hey buddy, we need you to drive to (Insert 4-hour drive here) to fix their network” (I work remotely but nearest to this sales center.)\n\n\n&gt;Me: When?\n\n\n&gt;Boss: Well, we’d like you to leave your house at 5AM tomorrow morning if you could... Tomorrow is Saturday and they have a large sales conference tomorrow at noon. I know how long it will take to get you there and I want you to have a couple of hours to troubleshoot just in case”\n\n\n&gt;Me: It’s a Friday…\n\n\n&gt;Boss: I know but to sweeten the weekend deal, we have two options. You can go tomorrow, you’ll get all the OT you want, a suite in a 4-star hotel, and you can stay the night Saturday and Sunday, and have a fully paid Monday off while you drive home, or we can send you Monday morning, you spend the night and be expected back at your desk Tuesday afternoon when you get in.\n\n\n&gt;Me: I’ll start packing….\n\n\nSo, I go forth on my adventure at 5AM Saturday morning. I arrive roughly at 8:30AM and ask the receptionist where $SalesPerson is. I’m told, unfortunately she does not come in until 11:30, 30 mins before the sales presentation and three hours from now. What about $SalesManager? I asked “Oh, he’s off today” Okay… I call my boss. Goes to Voicemail.  Now, I’m a random to the operations staff of the place since we handle IT for specifically the sales personnel that works in this place so they don’t know me from Adam. But I try. I walk back up to the receptionist.\n\n&gt;Me: Hi, I’m NetT3ch, from XYZ, I’m here to fix the network for XYZ staff. Is there any way you can reach $Salesperson or $Salesmanager?\n\n\n&gt;Her: Umm sure I can try $Salesmanager, his cell is his contact info….\n\n\n30 minutes later $Salesmanager rushing through the door to greet me.\n\n\n&gt;$Salesmanager: Oh man am I happy to see you!! Our network has been down for days! We haven’t been able to process any sales or show any of XYZ’s company’s online marketing!\n\n\n&gt;Me: Oh… Sorry to hear that… well let’s get started. I brought all the tools to fix this ASAP!\n\n\n&gt;$Salesmanager: Well I hope you’re better than *XYZ’s helpdesk tech*! We’ve spent over 8 hours on the phone this past week and we couldn’t figure it out!\n\n&gt;Me: *XYZ’s helpdesk tech* is a friend of mine, I didn’t know he’d been working with you…\n\n&gt;$Salesmanager: Yeah! We’ve been trying to fix this all week! And I’m glad you’re here but I wish you would have told me you were coming and I would have been here waiting!\n\n\n&gt;Me: No one told you I was coming…?\n\n\n&gt;$Salesmanager: Nope!\n\n\n*Internal sigh*\n\nThe next 30 mins are him walking me through the physical infrastructure, chatting to me about how the AC doesn’t blow a certain way and since I’m from corporate I have some pull to get that air redirected…. \n\n\n&gt;Me: Okay so to be clear, this is your modem, (while physically touching the modem, then the cable leading out) which feeds into the firewall with this cable… *Click* \n\n\n&gt;Me: I… Ummm…. Check if your PCs are online now.\n\n\n\n&gt;$Salesmanager: Hey they’re back! How did you do that?!\n\n\n&gt;Me: Heh….\n\n\nI’m chewing someone out, actually I’m chewing everyone out.\n\nI enjoyed strong drinks on the beach for two nights on the house and actually poked so hard at *XYZ’s helpdesk tech* and $boss for their complete failure at communication that I almost got wrote up.\n\n\nEDIT: My company is a sales company. We routinely rent out Hotel ball rooms for 3 months at a time. We throw up some TVs, wifi, a FW with a site to site VPN back to us, etc. This Saturday was a Holiday weekend so it was expected to have higher than avg sales. Whether or not I got the network fixed Saturday or not they'd still be selling 7 days a week. \n",
        "created_utc": 1528250318,
        "upvote_ratio": ""
    },
    {
        "title": "User disability causes an unexpected problem",
        "author": "ravencrowe",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ovdc4/user_disability_causes_an_unexpected_problem/",
        "text": "As with most tech people, I am my parents' personal tech support line. My dad is legally blind, so most of the things he needs assistance with are related to not being able to see well. His vision is 20/200- his vision is mostly a big blur, but he can read if he holds the text up to within a few inches of his face. Glasses do not help his vision.\n\nA few years ago he got his first smartphone (an iphone). He quickly learned his way around using Siri and the text-to-voice features, and had the font size on his phone set to approx 100px which made it possible for him to read it. \n\nWithin his first few weeks with his new phone, he asked me for help with a weird problem. He told me that every time he tried to call his office's voicemail to check his messages, when he tried to type in his password, the screen would go black on him. I took his phone and tried checking the voicemail, and it worked fine. I couldn't reproduce the issue with his screen going black. Feeling stumped, I told him to do it himself so I could see what he was doing.\n\nMy dad dialed his office voicemail number and put the phone to his ear. The message prompted him to enter his mailbox password. He took the phone and held it in front of his face, one inch away from his eyes, while his pointer finger reached to press the number pad. The screen went black. That's when I realized, he was holding the phone so close to his face that it was triggering the proximity sensor (which makes the screen going black the way it does when you hold it up to your ear during a call). \n\nWhen I told him the problem, he adjusted to hold the phone far enough away to not make the screen go black. Since then he's been super happy with his iphone.\n\ntl;dr sometimes you have to ask a user to show you what they're doing to cause a bug to happen",
        "created_utc": 1528238796,
        "upvote_ratio": ""
    },
    {
        "title": "Customer Would Not Let Me Help Her On The Phone...",
        "author": "Wyodiver",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ov3v2/customer_would_not_let_me_help_her_on_the_phone/",
        "text": "I used to work on mailing systems in South Florida.  I did phone tech support in the morning, then set out to do repairs, installs, etc.\n\nI took a call from a secretary who was complaining about her postage machine making a horrible noise.  I looked up her company equipment inventory and found that she had a certain light-weight model that I knew had just enough of a gap between the counter it was on and the bottom of the machine, allowing a common office item, paper clips, to get under it, making a disconcerting vibration and loud noise.\n\nI tried and tried to get her to just lift the front of the machine up and sweep the debris away.  It weighed all of about 10 pounds.  Well, she wasn't having it and demanded to have a field tech come to her office and fix it.  I explained that her company didn't have a service contract and that they would get charged $150 for the \"repair\" and $75 for transportation as it was going to be a 100 mile round trip.\n\nSo she went half the day without being able to get her mail out, and got charged $225.  I got there, lifted the front of the machine, and swept the paperclips away.  She was pissed, but I had practically begged her on the phone to at least try.\n\nIt was a nice drive.  ",
        "created_utc": 1528236859,
        "upvote_ratio": ""
    },
    {
        "title": "Server handling rules.",
        "author": "crapengineer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8oulfs/server_handling_rules/",
        "text": "[removed]",
        "created_utc": 1528232986,
        "upvote_ratio": ""
    },
    {
        "title": "What are those red splotches?",
        "author": "T4V0",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ou39w/what_are_those_red_splotches/",
        "text": "Hello TFTS, LTL and FTP here.\n\n$me is me and $NE is the new employee.\n\nFirst some background about the small business I'm in:\n\nWe're a small civil engineering firm(with focus on small), and due to lack of resources new employees take more time to set 'em up, but one such employee wanted to start early, so we asked him to bring his notebook with him to set it up.\n\nHe brings his dusty Semp Toshiba notebook (which according to him some keys don't work),then he sits on the chair, lays it on the desk, lifts the screen and proceeds to boot it.\n\nAs the screen raised so did my eyebrow, there were dark red splotches all over its surface. While startled, I composed myself and began to troubleshoot:\n\n$me: So what keys aren't working?\n\n$NE: I don't know exactly...\n\n$NE: (opens a browser and starts typing)\n\nAfter he typed some letters, a few of them were numbers, which led me to:\n\n$me: (presses fn + num lock buttons)\n\n$NE: What!? What did you do? Its working now!\n\n$me: I turned num lock off.\n\nFrom what I could see he was very relieved (probably wasn't using it for quite some time thinking it was broken). Then I asked:\n\n$me: And what are those red spots on the screen?\n\n$NE: Those? I burst a pimple on my face and the blood splat on the screen.\n\n$me: (internally hurls)\n\n$me: Well, why didn't you clean it then?\n\n$NE: Oh? I'm not really sure...\n\n$me: Sigh... (grabs a disposable rag and some cleaning solution).\n\nAfter a few wipes, the screen is crystal clear (and the rag way more gross than it was before)\n\n$me: Well if you want you can leave the notebook here and I'll install $SomeSoftware (after a really long time).\n\n$NE: Ok. Thanks! (gets up and exits the office).\n\n$me: (internally) I wonder if we really should give him a laptop...\n\nPS: He got one.\n\nEdit: Gramatical errors.\n\n  \n\n\n  \n",
        "created_utc": 1528229420,
        "upvote_ratio": ""
    },
    {
        "title": "\"The Monkey Room\" (x-post from AskReddit by request)",
        "author": "MotherFuckin-Oedipus",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8otgn6/the_monkey_room_xpost_from_askreddit_by_request/",
        "text": "[removed]",
        "created_utc": 1528224973,
        "upvote_ratio": ""
    },
    {
        "title": "Just Hyperlink It!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8osn72/just_hyperlink_it/",
        "text": "[removed]",
        "created_utc": 1528219196,
        "upvote_ratio": ""
    },
    {
        "title": "When the CEO asks for your password, but you're a huge goon",
        "author": "asscheeques",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8oshaa/when_the_ceo_asks_for_your_password_but_youre_a/",
        "text": "[removed]",
        "created_utc": 1528218019,
        "upvote_ratio": ""
    },
    {
        "title": "CEOs and their printers",
        "author": "superzenki",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8osbcy/ceos_and_their_printers/",
        "text": "This title probably triggered a lot of people but I wanted everyone to know what they were getting into. I've dealt with a lot of printers in my experience and can usually get it working if it's not a complicated hardware repair. I've also dealt with certain CEOs being the special snowflakes who expect everything to work 24/7, and our CIO just can't say no to them.\n\nThe first tale started when my director asked if I was available to install a printer for our CFRE (Central Fund Raising Executive). Luckily I didn't have anything going on that afternoon, and the new printer was already ordered and inventoried in our stock room. We set up a time and I brought the printer over to install. I had looked at the ticket she assigned me and it simply said \"My printer is dead. I need a new one.\" I look at the history, it went to Procurement, and our CIO's assistant simply ordered a new one based on our standard. No scope and assess, no checking with our team if we had any stock printers that would work. Just jump the line for this executive and forget about the budget (charging other departments for their IT equipment? What's that?). I knew this wouldn't be the end.\n\nI bring the printer over, the CFRE isn't there as most executives want their IT work done while they're not in meetings. His assistant let me in, and the first thing I do is assess the printer since I don't have anyone watching over my shoulder. I turned it on and watched it come to life. I printed out a config sheet and supplies status page. Network configured, not low on supplies at all. I even did test printers from his computer just fine. Did the printer really just get turned off and he had no idea how to turn it on? It wouldn't surprise me. The biggest kicker is that the printer was on a service contract, and if it was actually did, there was a good chance our vendor could fix/replace it because we already paid a monthly amount for service/supplies (these were charged to departments for their printers, or were supposed to be anyway).\n\nI decide to just replace the printer, the decision made was way above my pay grade and I knew to just do what my bosses told me to do. I get the new printer set up and functional, bring the old one back. I debate between telling my director or just not saying anything at all, and choose not to say something. Anybody in IT here who's assistant director level or above is trained to appease executives, so what would be the point?\n\nI was going to write another story but this one is long enough on its own. I definitely have more printer stories to come though (and have written quite a few in the past if you look up my posts).",
        "created_utc": 1528216844,
        "upvote_ratio": ""
    },
    {
        "title": "Yes, let's do the only solution.",
        "author": "abenatuesda",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8os50e/yes_lets_do_the_only_solution/",
        "text": "(Just a brief introduction - I'm part of a group that provides level 1 and 2 help desk support for multiple clients. it's been standing policy written into all of our contracts that we do not transfer to management ever. If there is an issue with a way something is handled, it is always brought through who we consider \"contract holders\". That way all disputes and requests are vetted to be within the confines of the contract - of course extras are always possible via an \"a la carte menu\". However, most employees (or in this case, students of the university) are unaware of this except at the most organized client. This is a story of a student who are too embroiled in the problem to see a solution.)\n\n\n\nStudent: Hi I need to buy a code to $Famous$Math$Lab$Product$\n\n\nMe: Okay, that is outside of my ability here but you can purchase those at our bookstore. I can transfer you to the bookstore if you'd like to discuss that with them.\n\n\nStudent: No, you don't understand. This is an online course. I'm on the other side of the state.\n\n\nMe: The bookstore has an online portal in which they sell the codes to access $Famous$Math$Lab$Product$. Once your purchase the code, you can then input the code in your settings to gain access. The bookstore can walk you through the process.\n\n\nStudent: (Acting fed up) You're not understanding me. I want to speak to your manager.\n\nMe: Unfortunately, our managers are not in the same phone system and cannot be transferred to. However, our bookstore can resolve the issue for you. Would you like me to transfer you?\n\nStudent: (Audibly straining) You. need. to. transfer. me. to your manager. It will NOT be a pleasant conversation.\n\n\nMe: It is standing school board and contract policy that we do not transfer to managers. Our bookstore can resolve your purchasing issue. Would you like me to transfer you?\n\n\nStudent: (much louder) MANAGER. NOW.\n\n\nMe: We don't do that here. Would you like to speak to our bookstore so they can resolve the issue?\n\n\nStudent: (quietly)...Yes I'd like to speak to the bookstore.\n\n\nMe: Not a problem. I'll put you on hold for just a minute and transfer you directly.\n\nTransferred the student without delay and away from me ASAP. ",
        "created_utc": 1528215586,
        "upvote_ratio": ""
    },
    {
        "title": "Text Support",
        "author": "crapengineer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8os22o/text_support/",
        "text": "[removed]",
        "created_utc": 1528215016,
        "upvote_ratio": ""
    },
    {
        "title": "The Creepy Old Man From Craigslist | A tech support story from when I was 15.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8orvtl/the_creepy_old_man_from_craigslist_a_tech_support/",
        "text": "[removed]",
        "created_utc": 1528213706,
        "upvote_ratio": ""
    },
    {
        "title": "Press ctrl-D, like I asked.",
        "author": "crapengineer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8org1w/press_ctrld_like_i_asked/",
        "text": "I once drove for 3 hours through heavy holiday traffic to type ctrl\\-D to get a server to boot. On arrival there was nowhere to park except the directors spot. The job was very urgent according to the customer so I parked up in his spot and carried on into the building.\n\n5 minutes later stood in front of the server and looking at the server terminal there was no output. Customer was yabbering on to one of his colleagues and not paying any attention. I held down ctrl\\-D on the terminal and cycled the terminal power.  Bingo , two seconds later the server is booting. \"What did you do\" shouts the customer when he noticed the server coming back to life. Pressed ctrl\\-D and power cycled the terminal like I asked you to do over the phone.\n\nI didn't get to hear his reply because at that point the director came in shouting the odds at full volume that some one had parked in his spot. That'll be me, I'm just leaving!",
        "created_utc": 1528210450,
        "upvote_ratio": ""
    },
    {
        "title": "How to not use version control",
        "author": "Soccer21x",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8or4uv/how_to_not_use_version_control/",
        "text": "Last year I was employed as a contractor into a company that didn't really have anyone who knew how to develop. The reason I was contracted was they had a large quantity of ColdFusion code on their server.\n\nMy job was to convert this ColdFusion code to raw PHP... Kill me.\n\nBut it paid extremely well, and I really only averaged ~4 hours of work a day to satisfy my requirements.\n\nAlong with all the ColdFusion, the servers had a rule in place that allowed users to add and edit files, but no one could delete anything. So the directories were massive since there were multiple .pdf.bak.bak.bak files, and even a .txt file which was named, \"Hey Jim, next time you see this can you update [x]\".txt, which was then an empty file.\n\nSo I spent about 6 months converting everything over to PHP, setting up VC, creating a test environment, asking for feedback to make sure everything was behaving properly. And when it was all good to go, I did my final push to VC to the group name that I'll just abbreviate 'gn'.\n\nSo here the master branch is, all converted. I contact the gn manager and tell them that I've updated all their files, and that we've removed the ColdFusion from prod. A security scan is run, and it comes back spotless (go me!). For any new updates they should work with a specific coworker to push their files.\n\nFast forward to last week (I completed my work around June of 2017), and I get an email from my old manager asking some questions about the work I had done (I'm still with the company, just on a different project).\n\nSo I start digging. The first thing that I find is a repo on VC named 'gn-final'. So I start digging through that repo, and they've simply pulled the php files I wrote from my gn repo, and kept them next to the .cfm files that existed before we got rid of them.\n\nApparently they had some changes to make, and used this gn-final instead of branching from my repo, and our security guy got a lot of alerts that new critical security issues had been deployed in production. Now we have a meeting today to discuss proper deployment procedures.\n\n\ntl;dr: Removed security flaws and a year later a group put the exact same flaws back into production.\n\nEdit: Meeting just finished. Some more digging makes it look like their developer made changes in the 'gn' repo, not the 'gn-final' repo. Then when they asked for their changes in production, they used the 'gn-final' repo. They also have a branch that they've been using for their deployments for a different directory that they've never merged into master...",
        "created_utc": 1528208079,
        "upvote_ratio": ""
    },
    {
        "title": "All of the tech support in the world couldn't save me from myself.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8oqyod/all_of_the_tech_support_in_the_world_couldnt_save/",
        "text": "[removed]",
        "created_utc": 1528206738,
        "upvote_ratio": ""
    },
    {
        "title": "Email Migrations with End Me!",
        "author": "themainlineinc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8oqt1h/email_migrations_with_end_me/",
        "text": "[removed]",
        "created_utc": 1528205428,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting versioning to say the least",
        "author": "400HPMustang",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8oqk0t/interesting_versioning_to_say_the_least/",
        "text": "[removed]",
        "created_utc": 1528203204,
        "upvote_ratio": ""
    },
    {
        "title": "I've been working in WAN/VLAN area for 30 years!",
        "author": "terere",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8opzys/ive_been_working_in_wanvlan_area_for_30_years/",
        "text": "This one is gonna be a bit different than most of the stories over here.\n\nI work with a product which needs access to all the servers in the company network.\nWe have received a report from one of the users that our tool can't reach a certain server anymore. I checked the mail conversation and there was a network technician involved who mentioned something about VLAN/network migration which could be the reason.\n\nI looked up the server in CMDB and it sure turned out that the IP address was changed.\n\nSince the IP address change was the sole reason why the server lost connectivity, I asked the network guy if he could send me a full list of new IP ranges which were implemented.\n\nHis response:\n&gt; It's OBVIOUS that when server is moved to a new vlan, its' IP address changes.\n\nWell, it was not so obvious to me. And I still did not get the list of new network ranges, so I had to ask again.\n\n&gt; I am not sure if the IP address needs to change if the vlan changes. Vlan configuration is done on L2 after all. Anyway, can you send me the list of new network ranges?\n\nI totally did not expect what came after\n\n&gt; I've been working in WAN/LAN area for 30 years, you don't need to teach me about networking.\n\n\nI mean, I understand that the vlan migration was probably done on L3 as well, but you don't have to go all out, when someone suggest you that theoretically you may not be correct.\n\nNeedless to say, I still did not get the list of new network ranges.\n\nDamn, some people are really fragile.",
        "created_utc": 1528197673,
        "upvote_ratio": ""
    },
    {
        "title": "From Service Desk to Bollywood Dancer, or How I Tried to Fix Everything and Everyone and Failed",
        "author": "a_lost_sheep",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8onju2/from_service_desk_to_bollywood_dancer_or_how_i/",
        "text": "[removed]",
        "created_utc": 1528168714,
        "upvote_ratio": ""
    },
    {
        "title": "Candy Crunch Saga",
        "author": "Insomalian",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ongmg/candy_crunch_saga/",
        "text": "To make things simple I'm Help Desk at a repair shop performing computer repairs ranging from network issues to having a fist sized hole through a screen; on top of remote support. I do all sorts of repairs to say the least. Well one day I had quite the odd ball.\n\n\\[T\\ being myself the technician]\n\n\\[C\\ being the client]\n\nMinding the front desk as I was filling in for another Technician, a man, and his wife walks in. They have this old Dell Inspiron which they had claimed started to run slow and on top of that couldn't run \"Candy Crunch.\" I took a look at the PC after it had finally booted up. There were some updates that couldn't go through for the machine. Threw some run-time errors and explained to them that a wipe and re\\-installation of the OS would more than likely remedy their issue. The one thing that truly mattered to this man was the ability to run \"candy crunch.\" We go over pricing and turn around time and he agrees to leave his laptop.\n\nEnsue the next day. I had finished the laptop after making a VHD of his HDD for a data backup, and a new OS with some of his apps. I go over some points such as \"Candy Crunch\" to make sure it was a quality job and call.\n\nT\\ \"Hello C\\ I have just finished your laptop, its running quick with little hick-up, and all your updates have gone through.\"\n\nC\\ \"Oh that's just fantastic, I'll swing by later today to pick up my laptop. I cant wait to play \"candy crunch\".\"\n\nT\\ \"Absolutely sir we will have your laptop on the waiting rack for you to pickup.\"\n\nTime passes as I'm working with other machines and C\\ finally comes in and picks up. Candy Crush was running completely fine on Google Chrome so I knew my job was complete for T\\... or so I thought. I received a call thirty minutes later from C\\...\n\nC\\ \"This is complete B\\-. I paid you people to fix my PC so I can play my F- CANDY CRUNCH. AND I STILL CAN'T PLAY\"!\n\nT\\ \"Sir I'm completely sorry, I even made sure that cand-\"\n\nC\\ \"NO IT'S NOT WORKING. SO WHAT AM I SUPPOSED TO DO? DROP IT OFF TO HAVE YOU PEOPLE CHARGE ME AGAIN JUST TO PLAY CANDY CRUNCH. THE GAME IS FREE\"!\n\nAt this point I have a hunch to the problem's solution but I also couldn't help this strange anger build up in me. I even made sure candy crush works before making the call and yet another thing; your'e not even saying the name right.\n\nT\\ \"Sir we give a 30-day service guarantee, I would be pleased to help you. Before anything else, are you in front of your PC\"?\n\nC\\ \"YES\"!\n\nT\\ \"Okay please open up google chrome and type speed test in the search bar.\"\n\nC\\ \"fine.. I hate chrome anyways. Now what.. run it I suppose. If I knew these were your tools I'd do this work myself.\"\n\nT\\ \"Well I only use this site for very specific problems, this is just to get an understanding of your network speeds to an extent and yes please run it.\"\n\nRunning out of patience on my end. The test goes for about the usual 30-50 seconds.\n\nT\\ \"So how is it going.\"\n\nC\\ \"Better if I could play my damn game but the thing gave me two numbers, a five and a six and a half or so.\"\n\nI took the biggest sigh off phone. I did all I could to fix C\\ problem and I did fix it. But I cant fix Internet speeds...\n\nT\\ \"C\\ could you please play candy crush on chrome I would like to know how it runs.\"\n\nC\\ \"WHY? The Candy Crunch runs like crap on fire fox and internet Edge why would it run any better on this garbage browser\"?\n\nT\\ \"Sir please try it.\"\n\nOne eternity of a minute later...\n\nC\\ \"...\"\n\nThe moment of pause. The sweet break in\\-between deep angry breathing to a more calm state. The man had not said anything for a solid minute. The next thing I could hear is even sweeter.. the \"Candy Crunch\" theme. It played for about 15 seconds until C\\ finally said something..\n\nC\\ \"..why. Why cant this run on FIREFOX\"!\n\nAt this point I've had enough and I did what technicians should never. I had to do it to em' with facts. Told him that his internet barely has enough to even load the game let alone play it on other browsers and that potentially Chrome was the better browser due to the fact that it \"optimized\" the game over the rest of the ads on Facebook. I told him how the computer now runs without any issues and that he should honestly call his ISP for a better package that way \"Candy Crunch\" will play flawlessly on any browser from anywhere in his house. At that point He had enough and just agreed and went to go call his ISP.  Later when the day was over I sat in my car for a solid minute just thinking to myself \"Google Chrome is better optimized to play Candy Crunch.\" I never would have or ever wanted to say something that dumb in my life, let alone say it to calm someone in a candy crunch induced rage. He later showed up with another device for repair and apologized for yelling and cussing.\n\nTl;Dr\n\nGoogle Chrome is optimized for limited internet connections to specifically run \"Candy Crunch\".",
        "created_utc": 1528167858,
        "upvote_ratio": ""
    },
    {
        "title": "RTFE: A Tragedy in 3 % 1 Acts",
        "author": "rmacd",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ommvv/rtfe_a_tragedy_in_3_1_acts/",
        "text": "VLTL;FTP;on_mobile\n\n# RTFE^*^error\n\n## ACT I\n\nEnter stage left:\n\n$rmacd (for it is he)\n\n$1LS: first line support\n\n$maint: maintenance programmer \n\n$rmacd is suffering, it's a Monday morning and has a cold. Doesn't want to be there but hasn't been long on the job, trying in vain to assume some air of professionalism. Isn't really in the mood for fun and games when suddenly:\n\n\n_PING_\n\n\nGah. It's one of our first-line support, $1LS. =&gt; \"Open chat window\"\n\n\nNo fewer than 20 seconds later, SfB (or `rhymes_with(\"Sync\")`, as it was then) has finished ~~taking hostage~~ allocating 120MB of my precious RAM and the faintest outline of a chat window begins to splutter onto the screen.\n\n\n&gt; Good morning $rmacd [smiley emoticon]\n\nNot now it effing isn't.\n\nI struggle; the most laboured of replies is formulated over many minutes:\n\n&gt; Hi...\n\n\nNow there is one - and only one - reason I'd be getting a message from $1LS. Something is broken and - invariably - it's easier to just leave the ticket in the queue and ask me the question when I get in, than read the documentation I've literally spent ~~hours~~ days writing. F me. Here goes.\n\n&gt; $1LS: We have been trying to make $routine_change and $maint and I can't compile your code\n\n&gt; $rmacd: ...\n\n&gt; $1LS: It doesn't work\n\n&gt; $rmacd: ... I mean, ok - I get that \"doesn't compile\" == \"won't work\", but you gotta give me something to work on here ... What was the error? Where are the logs?\n\n\nNow just a quick bit of background, we were mainly a Java outfit at this point. All our support (offshore) were contracted solely as JEE support techs. That is literally part of their job description (this becomes important). \n\n\nThe application? Entirely orthodox: a JEE application about as old as humanity itself and one which would bite you in the arse and send you into an apocalyptic wild goose chase if you as much as blinked when it was looking at you. Younger me - being the budding and ~~naive~~ enthusiastic young programmer I was, offered to try tidy it up a bit - add some logging, mavenize for some dependency management and packaging ... etc. But of course, as happens, this only serves to catalyze the process by which I eventually turn into the sole point of contact for the application.\n\n\nBut yes. Logs. In fact I was very proud of the logging. So much so, I remember specifically, _excitedly_ writing in the system documentation that as long as `TERM=1` it would give you some beautifully colorized logs. The thinking being, that even if you were on the lower end of the scale of \"0\" thru \"unable to read instructions\", you would still clearly see any bright red lines angrily hissing \"ERROR\" at you and, you know ... fix them.\n\n\nOr so I thought.\n\n\n&gt; $rmacd: Have you sent the logs through yet?\n\n&gt; $maint/$1LS: Sent now, please do the needful [sic] [smiling emoticon]\n\n\nwtf is this\n\n\n&gt; $rmacd: Did you mean to send me through a screenshot of your desktop?\n\n&gt; $maint: Logs are in the bottom [smiling emoticon]\n\n\nYes. I can see your desktop, Eclipse and the bottom console showing about 2 lines from stdout. I don't even.\n\n\n&gt; $rmacd: Can you send me through the application logs please? \n\n&gt; $maint: Yes sure sir\n\n\nOutlook displays an ominous-looking preview in my inbox. [_click_]\n\n\nNow I don't know if you've got these points in your life where it feels like everything froze and you still recall precisely everything about your surroundings, what you were doing, who you were with. Mostly associated with traumatic events.\n\n\nThis was one of those events.\n\n\nNot only has $maint sent me another screenshot but - clear as day - in my beautiful, colorized output, in bright red, right in the middle of his screen:\n\n\n    [ERROR] No compiler is provided \n    in this environment. Perhaps you \n    are running on a JRE rather than \n    a JDK?\n\n\nF me I'm done. [_sign out_]\n\n\n$rmacd: Hey boss, I'm not feeling too good, do you mind if I go home?\n\n\n_Exit, pursued by a bear_\n\n_edit: format_\n",
        "created_utc": 1528160321,
        "upvote_ratio": ""
    },
    {
        "title": "How to NOT sound like a tinfoil hat person",
        "author": "kestreldreams",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8omg2m/how_to_not_sound_like_a_tinfoil_hat_person/",
        "text": "[removed]",
        "created_utc": 1528158666,
        "upvote_ratio": ""
    },
    {
        "title": "What's your speed again?",
        "author": "techghosty",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ol6lx/whats_your_speed_again/",
        "text": "Keep in mind this happened 10 or so years ago, I was 1/4 of the sysadmin/.../... Team.\n\n$me = me/sysadmin/netadmin/backup guy/Blackberry guy... well you get the idea...\n$1.    = Tier 1 support/help desk monkey that talks too much\n$BB  = Our boss' boss\n\nI got a work order in from $1 \"Computer at &lt;site&gt; isn't connecting to the network but had lights on the NIC\"\n\nI had seen this sort of issue from &lt;site&gt; several times.\n\nI believe I said \"That's &lt;insert interesting word (s) here&gt; it!\"\n\nI locked my computer. Ignored the quizzical looks from my co-workers and boss. Picked up pickaxe handle (~1m of solid hickery )\n\nWalked to the other end of the building (~50ft), passing $BB (about halfway), with this pickaxe handle over my shoulder in plain sight. He pipes up as I'm passing him\"How's it going?\". He had stopped walking and held his face in an expression of mixed emotions (Should I be concerned? Should I stop him?... Etc). \"I'm doing great, how about you $BB?\" \"I'm good.\" He replies dragging out the word good like he is not sure if more conversation is safe and of letting me go would amount to a mountain of paperwork...\n\nI enter $1 (and his co-worker's) area, he is alone and sitting at his desk.\n\n\"What do you need to remember about the network at &lt;site&gt;?\" I ask (Pickaxe handle on should, not referring to it or motioning it in anyway).\n\n\"Ohhh\" he meekly replied (&lt;site&gt; had a legacy 10meg switch, he had a habit of seeing NICs to 100 full to mitigate complaints of slow connections. A well known issue within our IT.)\n\n\"I'm sending the ticket back to you. Fix it.\" I turn and walk back to my desk, to my boss and co-workers asking what went on. (A conversation that would have taken 20 minutes or more without... an active listing enabler)\n\ntl;dr - Far too talkative help desk monkey couldn't remember basic network structure, tried to make it my problem (again). I had a short conversation with him while holding a pickaxe handle.",
        "created_utc": 1528148193,
        "upvote_ratio": ""
    },
    {
        "title": "Stupidity from Callers",
        "author": "CaptainP00ptart",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ol1zp/stupidity_from_callers/",
        "text": "[removed]",
        "created_utc": 1528147216,
        "upvote_ratio": ""
    },
    {
        "title": "Off to a great start!",
        "author": "jisuanqi",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8okkwk/off_to_a_great_start/",
        "text": "Part of my duties is to coordinate the company cell phones, helping users with configuring them, adjusting plans, etc. \n\nIt's usually mundane, with the occasional surprise like single user 50GB data overages or a broken phone brought to me that looks like it's been retrieved from inside Mt. Doom.\n\nSo I'm informed (days late, mind you) that big Mr. Swingin' D. McImportantPerson has transferred here from one of our offices in another country and needs a cell phone.  \n\nOK, No problem. Just another break cut short. I'll make it up on the back end of the work day. \n\nWe have certain models that we are authorized to order, and that have been approved based on a whole slew of criteria including cost, functionality, compatibility, etc. They aren't the absolute latest model, but they certainly aren't old, and they're all brand new when ordered.\n\nI have everything ready to go, and the order confirmations go out. Immediately Mr. McImportantPerson forwards one of the emails to me, asking:\n\n*\"(Phone Model)? Really? Is there a war on or something over here? Do you people really not know they have released (DesiredModel) now?\"*\n\nAt which point, I had to reply and CC my boss, referring him to the policy that I followed when getting his phone ordered.  I haven't heard back, but this doesn't seem like the best way to endear yourself to not just a new office, but a new country as well.",
        "created_utc": 1528143795,
        "upvote_ratio": ""
    },
    {
        "title": "Internet super powers",
        "author": "LeonHeimdall",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ok0gw/internet_super_powers/",
        "text": "STL, FTP, let me know if I messed up this post, I am new to the readits. Little about me: I am an employee who is working as a front line help desk rep for a large university; most of the questions are people losing their usernames and/or needing to reset passwords. This call happened today; a little background, I had already provided her with her username after verifying stuff I had to. TLDR at the end.\n\nCast:\n\n$Me – “That guy”\n\n$Ca – Caller who needed help\n\n$me = Well I am happy I was able to help out, anything else? \\(something I would come to regret asking\\)\n\n$ca = actually yes, I need to update my password\n\n$me = ok, are you currently in front of a computer that has access to the internet\n\n$ca = Yes\n\n$me = ok, if you would go to $\\(website we use to fix passwords\\), you should see the “forgot password” option in $\\(Huge letters and school colors\\) in the middle of the screen.\n\n$ca = no.\n\n$me = no?\n\n$ca = no.\n\n$me = what do you see?\n\n$ca = \\*\\*reads off list that sounds like a google search\\*\\*\n\n$me= ok, so $ca, did you put this into the address bar or did you do like a google search for it?\n\n$ca = I put it in the address bar\n\n$me = that is odd, how about I remote into your computer to help you out. In order to do so, I would need you to click on a link that I can send to the e\\-mail address that we have on file.\n\n$ca = no that is on my phone, not on the computer. I have a different e\\-mail on the computer \n\n$me = … k… can you go to $\\(mail provider’s website\\), and log in that way? I can only send it to an e\\-mail on file, due to privacy and FERPA guidelines.\n\n$ca = no. That e\\-mail is on my PHONE, this other e\\-mail is on the COMPUTER.\n\n$me = ok… what is the “computer e\\-mail”\n\n$ca = \\*\\*reads same e\\-mail but with a number 2 at the end. $ca made a new e\\-mail for every device they had\\*\\*\n\n$me = ok, \\*\\*\\*adds alt e\\-mail so I can send it to that one\\*\\*\\* click this link, I will use $remoteprogram to help\n\n\\*\\*remotes in\\*\\*\n\n$me = ok, so you see how you typed this into the Bing \\*shudder\\* “search field”, don’t do that, just do it in the address bar  \\*shows the difference between the two\\*\n\n$ca = They. Are. The. Same. Thing.\n\n$me = … so when I type it in you see how it gets you to where I want to go?\n\n$ca = that is because you are doing it on your computer, MINE goes to the other thing. Ya’ll need to learn how to help people, because you can do that with your IT access, I don’t have the same permissions on the internet that you do!\n\n$me = …k…  \\*\\*clicks links to get to password reset pages\\*\\* so just fill this out and you will be good to go. \n\n$ca = ok thanks, I would have figured it out but I guess you saved me a little time. BYE \\*hangs up\\*\n\nTLDR; Did you know that e\\-mails can only be attached to one device AND that web browsers/what the internet will do for you can change b/c IT personnel have super internet powers? TIL!",
        "created_utc": 1528139716,
        "upvote_ratio": ""
    },
    {
        "title": "But my employee starts today!!",
        "author": "joosier",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ojrt4/but_my_employee_starts_today/",
        "text": "I got a status request for a purchase order in my queue this morning.\n\nI looked it up and it was for a high end workstation that we have to build to spec with parts we don't have on hand. \n\nThe order was placed on Friday,  Today is Monday.\nThe order status is \"Order placed with vendor - awaiting parts.\"\n\nI called the customer back and let them know the status of the ticket. \n\nAs per the title, the customer let me know that this HAD to be completed within the hour if not today because his employee started today!\n\nStandard procedure for a new employee is to submit their needed equipment at least 30 days for standard equipment, longer for special order equipment.    I referred customer to those requirements but got the usual laundry list of desperate refusals to accept reality (in no particular order): \n\n1) Passive aggressive threat about the financial cost of the employee's idle time being blamed on IT. \n\n2) Rhetorical (from my point anyway) questions about how the new employee will spend their time now? \n\n3) Demands for the tracking numbers for the parts so they can track the shipping themselves. (We don't even have those yet)\n\n4) Ad hoc employee evaluations (very negative) for my entire department and eventually myself. \n\n5) Dire apocalyptic prophesy about the impact on the company if not the world or human life in general  if their employee does not get their system in a few hours (bit my tongue to keep from suggesting we send a tech to re-image the customer's own similar system for the new employee to avoid this Extinction Level Event)\n\n5) Demands to talk to a manager (No managers were in yet so I sent my manager an urgent email requesting they call the customer ASAP.  I CC'ed the customer as requested AND I even went the extra mile to CC the customer's manager along with a quick explanation of the situation.)\n\n\nEdit: Forgot to add my favorite line from this rant: \"this is unacceptable!! You folks have had the ENTIRE WEEKEND to work on this request!!\"  - dammit - that should have been this post's title! \n\nUpdate:  new user got a regular loaner system from the local techs so he could at least set his password, access his email ,etc.    High end system is going through the regular process.     ",
        "created_utc": 1528137930,
        "upvote_ratio": ""
    },
    {
        "title": "How to spend 2 weeks troubleshooting something that wasn't needed anyway",
        "author": "bizitmap",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8oia86/how_to_spend_2_weeks_troubleshooting_something/",
        "text": "So I'm not \\~technically\\~ tech support, I'm in the training department, but this month I got an opportunity to cosplay one of you and the fact there's any alcohol left on this planet is amazing. Our team hosts a server with training courses on it we've developed. It generates surprisingly little drama but one day, in comes this email from a small company who resells an application our company makes:\n\n**$Partner**: Request to retake $Coursename \\[all shoved in the subject line with no email body content\\]  \n**$me**: Hi $Partner, I've reset your course for you.  \n**$Partner**: I am trying to open the training session but it won't load on 3 different browsers.  \n**$Me:** If it continues to not load, can you describe what symptoms you are seeing? For example, if it hangs on a spinning animation or a white screen.  \n**$Partner**: I am still seeing the same thing NO CHANGE. This needs to be resolved!!!\n\nThat last email is first thing 7am Tuesday morning following Memorial day Mon, when our last correspondence was Friday. Real sweet. \n\nWe bat a few more solutions back and forth with no forward progress, I'm stumped since it's just a Flash app and this is the first time it's not worked for someone. I schedule time for a phone call with him, call, and I can IMMEDIATELY hear he's just *seething.* Answers are very short. I dig deep and pull out my best customer service voice as I've overheard our support team put on.\n\n**$Me:** Hi $Partner! This is $Me from $Company, I understand you've been having some issues loading one of our training courses.  \n**$Partner:** HI.  \n**$Me**: Okay, I think I can help you figure out what's happening here. I see you've already opened the support link I sent you, is it alright if I take control of your mouse?  \n**$Partner:** YES.\n\nSo now I'm on his machine, I go to our website, go to the course and..... *it loads immediately*. I have to do absolutely nothing, the course works totally fine.\n\n**$Partner \\(suddenly very, VERY deflated\\):** It didn't do that before, I swear.  \n**$Me:** I see. I'm glad we could get it working for you though, now th\\-\n\nNow, for the first time, I'm actually looking at the training course. It's REALLY old, based on an older version of our product. In fact I have no idea how he found it, our home page has big buttons pointing at the new training.\n\n**$Me:** Can I ask which version of $Company's product you're running? I ask because this training course is for version 1, almost all partners are on version 2 which has been completely rebuilt and has a totally different GUI and changes under the hood.  \n**$Partner:** I'm not sure. I'll show you. \n\nLoads up our program. It's version 2. None of the training they wanted for 2 weeks applies at all. ",
        "created_utc": 1528127059,
        "upvote_ratio": ""
    },
    {
        "title": "LONG : Not touching that customer again with a 10 foot pole",
        "author": "malizeleni",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8og528/long_not_touching_that_customer_again_with_a_10/",
        "text": "[removed]",
        "created_utc": 1528107067,
        "upvote_ratio": ""
    },
    {
        "title": "Mr J encounters the fatal right click",
        "author": "Es452002",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8og3bg/mr_j_encounters_the_fatal_right_click/",
        "text": "[removed]",
        "created_utc": 1528106461,
        "upvote_ratio": ""
    },
    {
        "title": "We don't know where this script is coming from!",
        "author": "punxsutawneyphyllis",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ofofz/we_dont_know_where_this_script_is_coming_from/",
        "text": "This happened over the course of the past week, and finally ended today.\n\nThe Characters:\n\n$Me: The only programmer at the company\n\n$Supe: My somewhat tech-savvy supervisor\n\n$AdGuy: A PPC ad guy, who also does SEO and other analytics-related stuff.  For those who remember my previous story, yes, this is $NewGuy.\n\nOne week ago, $Supe approaches me.\n\n&gt; $Supe: Hi, you're going to hate me for this.\n\n&gt; $Me: Okayyyy, what's up?\n\n&gt; $Supe: We have an analytics script on CompanySite that we can't find the source of.  We used to add this script via TagManager, but that was giving us duplicate stats.  We know the script is working, because we're still receiving the stats.  We had an outside guy try to find this a while back, but he couldn't find anything.  $AdGuy needs to make sure that this script only sends anonymized IP data, to be compliant with GDPR, so this is very important.\n\n&gt; $Me: Do you have any other information?\n\n&gt; $Supe: Nope.\n\nSo I proceed to grep the entire server for this script.  I cant find it or any reference to it, except in cached pages.  I go back to $Supe.\n\n&gt; $Me: So the script isn't on the server.  This most likely means that it's being inserted by an outside service.  Can you think of any service that you might have set up that you're not using anymore?\n\n&gt; $Supe: Nope.\n\nGreat.  So the next day, I visit every analytics and code insertion service that I know the company uses, and check each one.  Nothing.  Then I try MetalBrowser's tools, and discover that the pageview request URL created by this script already contains a directive to anonymize the IP address.  Awesome, right?  I relay this information to $Supe, but he tells me to keep looking because he still doesn't want scripts with unknown sources running on CompanySite.\n\nI proceed to bang my head on this for a couple more days.  Then I hit on the idea of loading CompanySite incrementally, so I can see when this script appears, and hopefully what adds it.\n\nToday, I load the page incrementally.  The analytics script has already appeared at the first breakpoint.  There's only one other script loaded, something with a gibberish file name.  I open it up in the sources tab, and it says...CumulusFire?  The load balancer?  Why would that insert an analytics script?  I open up the company's CumulusFire account, and see a link to something called \"Apps\".  And there's an analytics app installed.  I uninstall it, and reactivate the script in TagManager.  Five minutes later, $Supe arrives in the office.\n\n&gt; $Me: I found the source of the script, apparently someone installed it via CumulusFire.\n\n&gt; $Supe: Oh, right, I forgot we'd done that!\n\n&gt; $Me: *facepalm*",
        "created_utc": 1528100670,
        "upvote_ratio": ""
    },
    {
        "title": "A shouting mob, tears and a wookie roar.",
        "author": "ITSupportZombie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ofmrl/a_shouting_mob_tears_and_a_wookie_roar/",
        "text": "Last year, we migrated to Windows 10.\n\nIt did not go well.\n\nAbout half way through my migration schedule, I had to do an office of old ladies that were very resistant to change in all ways. They were in an uproar when the menu at their favorite lunch spot was updated. All new computers and a new operating system would be extra fun for me.\n\nSide Note: My coworker and I listed out all the problem offices/users and divided them up so we both got an equal amount of problem users.\n\nOn the day the migration was scheduled, I showed up to their office at the scheduled time. They were of course not ready for me. No backups done, matter of fact they were still working as if nothing was going on. They received no less than 5 general emails and each received a calendar invite with clear instructions, and the date and time of the migration. They chose to \\(unsurprisingly\\) ignore them.\n\nWhen I showed up to do the migration I was ganged up on and told what a terrible person I am for changing things on them.\n\n\\&gt;How dare I disrupt their important work with this?\n\n\\&gt;Can’t they have an exception?\n\n\\&gt;We are still getting used to Windows 7!\n\n\\&gt;Come back later, we are busy!\n\n\\&gt;You don’t have my permission to touch my computer!\n\nI politely explain to them that this was put out in multiple meetings, by email and the flashing reminders that just popped up on their screens reminding them that this was happening. I politely ask them to pull up the email from the CEO stating that this is mandatory and all exceptions will have to be submitted in writing 2 weeks ago. I explain that I am doing my job and if they refuse this migration, I will lock their computers out until the migration has been completed.\n\nThey continue to refuse to allow me access to their computers.\n\nAt this point I am tired of going in circles with them and calmly walk of the office and return to mine. Once at my desk, I lock their computers in AD and send a remote restart. Their computers are now locked out. Within 5 minutes, they all storm into my office hurling insults, accusations and one is begging me to give her an exception. I repeat my speech about this being mandatory and I do not have the power to exempt anyone, even the scheduling of this was out of my hands.\n\nOnce again tired of going in circles with them, I call the CEO directly. He backs my actions and orders them to allow me access.\n\nI return to their office to perform the migration. Taking the CEO’s suggestion, I recommend the ladies go take a coffee break and come back in 30 minutes. I back up the user data, swap the computers with new hardware and restore their profiles to the new computers. Task complete!\n\nIt wasn’t.\n\nFor anyone who reads these stories, we all know this isn’t where it ends.\n\nAbout the time that the ladies were finished taking their hour long 30 minute break, it is time for lunch. I make a point of taking a full hour away from my desk each day at a set time whenever possible. I sit on a bench outside, reading a book. I find this helps me recenter myself. My users \\(generally\\) know that I am to be left alone during this time. I become surly when I do not have my midday break.\n\nThe ladies weren’t having it. About 15 minutes into my lunch, they all came storming out to where I sit, foaming at the mouth and hurling abuse even before they were close enough for me to understand them. When the mob finally gets to my bench, I remind them I am on lunch and would be back in my office in 45 minutes.\n\n\\&gt;How dare I take a lunch break when they are having computer issues!\n\nI know that they will continue to mob me until I relent. Normally, I do not allow my lunch to be interrupted, but I know this will only be made worse if I do not go now. We proceed to their office and I ask what the issue is. Immediately I am overwhelmed by the most basic of issues.\n\n\\&gt;What is my password?\n\n\\&gt;How do I log in?\n\n\\&gt;Where is all my apps?\n\n\\&gt;Give me back my old computer!\n\nThree of the four ladies are yelling at me, the fourth is sobbing quietly at her desk. She tells me that this is all too much change and maybe she should just retire. I know what needs to be done.\n\nI give the loudest Wookie roar I can \\(my throat was sore for a bit after\\) to get their attention. The yelling stops, the room is silent but for some muffled sobs and all eyes are on me \\(including some from people in other offices now\\).\n\nI spend the next two hours training them on how to navigate Win10 and made four new friends for life. These four old ladies were some of my best customers from that point on because I took the time to educate them and make sure they knew what to do.",
        "created_utc": 1528099974,
        "upvote_ratio": ""
    },
    {
        "title": "No you!",
        "author": "RaDus1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ocnh4/no_you/",
        "text": "This will be a short one.\n\n**Background:**\n\nA few years back I worked as a L1 support for a phone company. Horrible job. This is one of the stories that stuck with me.\n\n**Story:**\n\nIt was around noon when $C [customer] called. He had heard about our offer where he could call *one* other phone number for free. As such, he had bought that service.\n\n\nThe customer is required to log in to their account and input the number manually, after which it will be free to call that number, as long as you hang up before the 2 hour mark. Calling the same number, within seconds of hanging up, was allowed.\n\n\nThe issue $C had, was that he was getting billed for calling this number and he wanted to know why. I quickly recalled the 2 hour rule and went to check; all of his calls were less than 2 hours. Good boy. So I went to check the number he had provided for the service. Guess what, the last numeral was wrong. I told him this. He refuted having made a mistake and demanded a full refund. I told him I could see in the logs, down to the exact second, when he input the number and his IP at that time.\n\n\nHis reaction? Blaming me (personally) for changing the number after he had input it, because he knew he didn't make a mistake. I told him that even if I sympathized with him, the amount he demanded refunded was way above what I was allowed to refund, so I couldn't refund him even if I wanted to.\n\n\nThis unleashed another storm of slurs and personal critique; something along the lines of being a liar, corrupt, incompetent, etc.\n\nLuckily, the company policy allowed us to hang up on customer if they verbally attack us, so I did.\n\n**-CLICK-**\n\nTL;DR: Guy got billed for a mistake he made, then blames me for it.",
        "created_utc": 1528068262,
        "upvote_ratio": ""
    },
    {
        "title": "My nemesis, TerrorByte!",
        "author": "MordecaiKravits",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8obhyb/my_nemesis_terrorbyte/",
        "text": "Hello! After a long time of not having any stories to share, I come to what may very well be my last ever tale. I should be moving to a non-customer facing role soon, to live my dream in code, where the only enemy is my own mind! \n\nI wanted to make this last story special and memorable, for myself mostly. This community is one of my favourite on Reddit, and the levels of camaraderie I've experienced here is unmatched. We can all let off some steam by blasting our customers and end users in a safe space, and I truly believe it helps us all in our careers. We share a common perspective, and unlike my most other aspects of my life, I feel like I belong here. This is why I present to you the story of TerrorByte. It's heavily modified from actual events, which may be difficult to pick up on, but I included a TL:DR at the bottom anyway. Please excuse any horrible formatting, it's 6AM here, and I've not slept!\n\n_Our story begins long ago. Our hero, a pokey startup, forms a cloud, the glint in their eyes and the fire in their heart paving the way for great things. The \\~\\~spice\\~\\~ data flows, and they expand with rapid efficiency, quickly surpassing 1 exabyte of storage. The number continues to rise, and constant improvements, monitoring, and preemptive problem solving result in years without a single data loss event. The world felt.. balanced._\n\n_I'm afraid, however, this plot is not without strife. The storage repositories, although 80TB in size, were no match for the sheer mass of a JBOD full of raw 4K footage. Will the unlimited storage policy be the folly of our hero?_\n\nTerrorByte, our villan, hatches his evil plan to find the limit of 'unlimited', and ponders in his lair, becoming excited at the potential reward for his success, elite status in the league of evil end-users. \n\n\"Muahaha, if only I can find their limit. They cannot possibly be infinite. I shall find their weakness, and bamboozle them into oblivion!\"\n\nHis mind set, he begins the upload of his 4k footage. To his misfortune, EOL (Evil Online) provides only ADSL broadband, with only moderate upload speeds! *gasp* - He waits. His beard grows, the wallpaper peels from the walls, and dust begins to coat his lair. TerrorByte remains at his console, waiting for the right moment. Time passes.\n\n\"Let us check our progress! Muahah.\"\n\n_**Status Indicator: 10%**_\n\n\"Nooooooooo. Those incompetent fools!\"\n\nTerrorByte phones our hero's cloud support team, and furiously demands that they resolve the ridiculous speed issues to their system. Support are sympathetic, however ultimately, they explain to him the implications of such a large upload, and also the logic of attempting to store 80TB of data in the cloud. They also indicate that while they offer unlimited storage, there are limitations to the infrastr-- _**click**_\n\nHe hangs up the phone, repressing the interaction lest it damage his pride, or his evil doings. He continues to upload, and brood. \n\nAfter some time, TerrorByte falls into a catatonic state. His lifeless body awaits the siren's call. \n\nSeasons pass, times change, wars come and go, but TerrorByte remains with a sole purpose, to overload the cloud. His resolute nature drives him to continue living, until the day he can report his success!\n\n...\n...\n\n_**ping!**_\n\n...\n...\n\n_**ping!**_\n\nTerrorByte stirs, energy waning. He stands, and hunches over his console. When he realises the origin of the beeping, he sprouts into life as if he'd never been in his stasis. \n\n\"Oh my, it's here, my time! IT'S FINALLY DONE! MUAHAHAHAHAHAHA. THE SYSTEM HAS FAILED, I'VE WON\".\n\n_**Status Indicator: Upload Complete**_\n\n\"Wat.\" TerrorByte stumbles back, unable to contain his fury. \"What is tHe MeAnInG oF THIS!!\" \n\nHe slams his fists down onto his console, and immediately picks up the phone to contact support. However, not wanting to let on his evil intentions, he plays it cool. \n\n\"Hello, this is Cloud Support, how can I help?\", said the employee on the other end. \n\n\"Oh, hai. Yes, I, erm, just wondered if you could check my account, to make sure there aren't any... _problems_ with it? I'm storing a lot of data and it would be a shame if something....._happened_ to it.\" He struggles to absorb a snigger. \n\n\"Oh, wow, I see you're storing 79TB. That is a lot for cloud storage, and I would seriously recommend against continuing to upload. Our repositories are only 80TB, and this is something I'll need to bring to the attention of management, as you could encounter data loss if it becomes full.\"\n\n\"No, no.\" said TerrorByte, \"I can go ahead and remove some data, there's no need to take it any further. In fact, I'll get right on that now.\"\n\n\"Okay sir, good luck, and let us know if you have any problems.\"\n\n\"Oh, I will. ^^muahahahahahahaha\" _**click**_\n\nTerrorByte regroups for a last push. He makes copies of existing data, and begins a further upload. This time, there shall be no sleep. His eyes would be glued to the console for the duration of the transfer.\n\nAfter a while, his eyes became heavy, and he found himself wanting to slip back into a slumber, but he knew he must remain vigilant. One again, time passes.\n\n...\n...\n...\n\n_**ping!**_\n\nHe jolts upright, scarcely believing what he sees.\n\n_**Status Indicator: Unable to process**_\n\nHis eyes begin to well up, followed by a torrent of wailing. He wept for some time, the satisfaction of his ultimate evil endeavour too much to bear!\n\n\"My life's work. My masterpiece. It's over.\"\n\nHe picks up his phone, Cloud Support on speed-dial. \n\n\"Hello this is Cloud Supp-\"\n\n\"Yes yes, nevermind the pleasantries. Are there any problems with my data?\" - He sat smugly, awaiting a response.\n\n\"Hmm, it appears that you've filled up an entire repository, and we've been trying to contact you to rectify it.\"\n\n\"AH HA, I've uncovered your lies! You do NOT provide unlimited data storage. It's all a sham! You fools, I shall tell the world, you will be out of business! Muahaha, you FOOLS!\"\n\n\"Sir, I'm sorry we couldn't get in touch with you. Is your email address still meatbeater69@eol.com?\"\n\n\"What? Fine! I shall play your games and extend my pleasure for your downfall! One moment.\" \n\nTerrorByte attempts to log into his email EOL account.\n\n_**This account has been suspended.**_\n\nAt this moment, he turned to face the other side of his lair, away from the console. A pile of letters stacked to his own height dominated the space. He rested the phone, and walked to them. Each one was stamped \"OVERDUE. PAY NOW\". He tore into the one at his feet, at the bottom of the pile. They were from EOL...\n\n_Dear Mr Byte, we have noticed a substantial amount of data transfer on your account, and as per our fair use policy, which is part of our unlimited data package, we will be charging you per GB for any further data transfers you make. You will find this cost appended to your monthly bill. _\n\n_Yours sinisterly, _\n_EOL._\n\nTerrorByte ripped into another letter.\n\n\"Oh no. God no. Please god no.\" \n\n_**Statement Balance: One Billion Dollars**_\n\nHe began to visibly shake as he hobbled back over to the phone, the support rep patiently waiting. \n\n\"Hello sir, did you manage to find the emails from us?\"\n\n\"You. You beat me. You saw through my plan, and foiled me at every turn. I'm ruined. I thought I would bring you down by finding your storage weakness, but... but... but I'm the fool. No this cannot be. The data transfer costs. Why was I so BLIND. It cost me...\"\n\n\"Oh, I'm sorry sir. This _is_ a lot of data though. What did it cost?\"\n\n\"It. Cost. EVERYTHING\". \n\nTerrorByte slammed down the phone, sat back into a chair, and remained catatonic for some time. The pain of defeat too much. His ego was shattered.\n\nHe was later expelled from the league of evil end-users for his incompetence, and wandered the lands forever more, causing minor inconvenience for IT staff, but ultimately having no power with his tarnished reputation. \n\nTL:DR --&gt; A customer kept transferring his data to our cloud, seemingly to test our claim of 'unlimited storage', even when we told him to stop because he would have major issues down the road, and that 80TB is probably too much to justify cloud storage. He filled an entire repository despite these warnings, and wasn't able to use it any longer.",
        "created_utc": 1528058312,
        "upvote_ratio": ""
    }
]