[
    {
        "title": "An unusual delivery",
        "author": "schrodingers_lolcat",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4fjjhh/an_unusual_delivery/",
        "text": "Just found this on /r/Italy and thought of you:\n\n[Italian cops disguised as pizza delivery guys arrest a Mafia boss](\nhttp://www.theguardian.com/world/2016/apr/18/mafia-police-pizza-delivery-boys-arrest-boss-italy)",
        "created_utc": 1461097108,
        "upvote_ratio": ""
    },
    {
        "title": "Hey Pizza Guys and Girls!",
        "author": "Bamfdrew",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4fj2gk/hey_pizza_guys_and_girls/",
        "text": "So I'm not a pizza guy, but I do need some expertise from a seasoned driver. \n\nI'm a writer, but I haven't been published for a few years now because I started doing other jobs. I'd just like someone to answer up an interview I did for my new freelance website that's going up this week. All my writing samples are focusing on one topic, and I went with the mighty pizza. It's not going into a magazine or anything, but you could always show your friends the link when it's posted or something. \n\nThanks in advance :)",
        "created_utc": 1461091317,
        "upvote_ratio": ""
    },
    {
        "title": "Doing extra stuff for the job.",
        "author": "MoistWalrus",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4fhh1z/doing_extra_stuff_for_the_job/",
        "text": "Yesterday my GM was stressing about sells and I mentioned the possibility of running a promotion. My GM had a few that we had been thinking doing for a bit and picked one. We just had to design some flyers to advertise. Since I am an working towards a degree in advertising and public relations, I offered to help out. I went back to my house and designed something simple in about an hour. I showed my design to my GM and owner, and they loved it. We are getting prints made today to start handing out. \n\n\nDo you do anything to help out your shop, other than your regular driving duties? ",
        "created_utc": 1461071249,
        "upvote_ratio": ""
    },
    {
        "title": "Do you ever get pulled off the road?",
        "author": "Tr2v",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4fg8bb/do_you_ever_get_pulled_off_the_road/",
        "text": "Question in title. \n\nMy store has a habit of pulled drivers off the road, sometimes even when it's busy, to do other things. One always does half of the inventory during dinner rush. One gets pulled off to just do dishes. I was pulled off today to sweep the parking lot and premise (only because the big boss showed up). Then once I finished, I was asked to go on cut. I had had it. I was scheduled open to 7pm. I was pulled off the road just before 5 and only had 6 deliveries so far all day - 4 of which did not tip. I had basically only done dishes and cleaning all damn day and now that we were actually starting to get orders, I get pulled off. I was asked to do cut for a few minutes and agreed. 30 minutes later, I was still stuck there. I walked at that point. I'm there to drive. I accept shit wage because of the tips. If I'm stuck in the store, I have no shot at tips. I understand why we pull people off the road, but it's always for short periods where they might miss 2 deliveries tops. I was off for 1.5 hours by the time I walked. During dinner rush, that could have easily turned my $6 in tips into $60. So does your store do this shit?",
        "created_utc": 1461045258,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think this justified getting in trouble over?",
        "author": "BallaForLife",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4fapme/do_you_think_this_justified_getting_in_trouble/",
        "text": "A little backgroung I work at a mom and pops delivery business that delivers food (pizza too) for the local restaurants in town. We're technically a \"membership\" so we get paid per delivery (5$ per deliver pretty crappy) plus tips. We have this guy who orders from us at least once a day sometimes twice a day and doesn't tip ever, not once. We have a nickname for him and everything. I finally decided to ask him after getting his crappy delivery (no tip of course) why he doesn't tip in a very polite way of course if we're doing something wrong or if he just can't figure out the website  (it's rare if he doesn't order online) or if maybe he just doesn't believe in tipping which would put me at peace. When I asked him he said \"you know, I've thought about it over the years but never really struck me as something I've needed to do but maybe I will eventually.\" So I told him that's cool I just wanted to make sure all of us drivers are doing ok or if I can change anything cause every buck counts especially how we get paid and he said were doing a fine job he seemed satisfied and I left. After my next order he apparently called my boss and complained and my boss took me off the schedule for a week as punishment saying I was definitely in the wrong and should never ask, which normally I would agree with but when we get paid like total shit and we have a guy like this I thought maybe I could at the least see what's up? Am I just crazy or was it justified to ask him?",
        "created_utc": 1460963864,
        "upvote_ratio": ""
    },
    {
        "title": "I just finished a 9-9 with almost nonstop pouring rain, and let me just say...",
        "author": "talyorz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4f9k25/i_just_finished_a_99_with_almost_nonstop_pouring/",
        "text": "Texas needs to chill out. But I made like $150 so its all good.",
        "created_utc": 1460943173,
        "upvote_ratio": ""
    },
    {
        "title": "In which the customer accuses me of calling his wife a bitch.",
        "author": "kirokatashi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4f89yi/in_which_the_customer_accuses_me_of_calling_his/",
        "text": "I took a delivery of one pizza and two ranch cups to the one hotel in our area where we can't go to the rooms. I call the customer's room on the phone in the lobby. There is no answer, but a lady comes in and says the order is hers. I have her confirm the room number and tell her the total is $18.something. She pulls out a wad of cash, takes out a 20. Now a guy comes in and the lady has him take the pizza. He asks about the ranch, I tell him it is in the box, and he checks the pizza and ranch. The lady asks how my day has been. I was about 7 hours into what ended up being a 10.5 hour shift, it was rainy and busy so everything had been late all day and people take it out on the driver. I tell her it has not been very good and her change is $1.something. She says she is sorry my day was bad and to just give her the dollar back. I give her the dollar and go to leave. As I am getting to my car, the guy comes out yelling \"Who a bitch? Who a bitch?  \nMe: What?  \nHim: You called my girl a bitch!  \nMe: No?  \nHim: *a bunch of angry stuff I didn't quite catch.*  \nI go back the store, the manager is on the phone with a customer, so I tell a coworker (who is treated as just under manager) about it. She says the guy called while I was driving back and she and the manager were laughing about it. Then the lady from the hotel calls and says her pizza was supposed to be thin crust and it wasn't. Manager (who took the original phone order) disagreed, but we agreed to send out a thin crust. Manager says he will take the pizza because apparently the guy said I was lucky he didn't beat me up and take my money when he called, and he was going to come to the store in the morning. Another coworker said the giy was trying to pull something (I don't know the specifics) before I took the order and we shouldn't have made it in the first place. We let the manager who would be opening know about it and she had me write out my side of the story. I have a reputation of being honest, helpful, and nice, and the managers do not do anything to us about baseless accusations, so I am not terribly worried, but I work in about 3 hours. We will see what happens.  \n-Update-  \nHead manager was in. I asked if he heard about last night.  \nHM: I did. Why are you calling people a bitch?   \nMe: I didn't call anyone a bitch.  \nHM: (jokingly) What did you call me? No one came up here about it, don't worry about it.  \nSo good end I guess. ",
        "created_utc": 1460924382,
        "upvote_ratio": ""
    },
    {
        "title": "Best pizza delivery guy ever",
        "author": "quzimaa",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4f881y/best_pizza_delivery_guy_ever/",
        "text": "[removed]",
        "created_utc": 1460923613,
        "upvote_ratio": ""
    },
    {
        "title": "How did you get the stripper to deliver pizza?",
        "author": "AmberDifranco",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4f2z7a/how_did_you_get_the_stripper_to_deliver_pizza/",
        "text": "As previously mentioned, I deliver pizza in a tourist area. Since this is a tourist area most of my deliveries are to cabins or hotel rooms. Anyways, last night I delivered to this cabin. I couldn't find somewhere to park other than the middle of the road because there are so many cars. I get to the door, it's open but I still knock because I'm not going to randomly wander into someone's cabin. After a minute of knocking someone finally notices that I'm standing here. Apparently this was a bachelor party. The drunk groom took one look at me and screamed \"DUDE HOW DID YOU GET THE STRIPPER TO BRING PIZZA WITH HER?\". I was a bit taken aback. After explaining to them about 5 times that I was, in fact, not the stripper, they felt bad and tipped me $25. All in all. It was a good night.",
        "created_utc": 1460829944,
        "upvote_ratio": ""
    },
    {
        "title": "Wild Goose Chase",
        "author": "ChickenMcThuggetz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4f1ztl/wild_goose_chase/",
        "text": "I hate people that give the wrong address multiple times. Yesterday I took a call and made sure to read the guy's address out to him complete with apartment number to confirm. Get there and knock, they didn't order a pizza. Call, read them the address yet again, and they say it's apartment 3, not 6. Go to 3, nope not that one either. Call a third time and this time when I read the same address out the guy finally pipes up saying that was his old address like 3 years ago. How the fuck. Next time I'll have them tell me their address before I say shit so they can't just agree. And of course his new place is on the edge of our delivery radius...",
        "created_utc": 1460815133,
        "upvote_ratio": ""
    },
    {
        "title": "\"Sir, what is your address?\"",
        "author": "Dat_Feral_Drood",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4f0y99/sir_what_is_your_address/",
        "text": "Common thing for most people to know..... unless you're new to the Air Force base.  Well this dude gave me the street name of which I live on just outside the base.  So I can tell you if it starts at the 200s and ends in the 400s.  This dude kept saying is adress is 35B and is in a duplex.\n\nThinking this dude is crazy I tell him \"sir the street starts at 270, there is no 35B on this street\".    Proceeds to joke and say he doesn't understand how his friend gets anything delivered there like it doesn't make sense to him either. \n\nBoss googles the address and sure enough a 35B shows up on google maps at the location of the 270 address... So I say find and take the order.  Well sure enough can't find the damn place and proceed on to next delivery I have in car. \n\nHour passes by I call him back and he said his friend just got back let him ask her.  She gets on phone and said shes at 358 blah blah blah... it's at the corner of so and so....\n\nseriously..... 358 and 35B   I can't help but to laugh my ass off and tell her what happened and she lost it.   Took the order and of course stiff but w/e ultimate face palm. \n",
        "created_utc": 1460791445,
        "upvote_ratio": ""
    },
    {
        "title": "Hotels?",
        "author": "DeliveryChick",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4eznck/hotels/",
        "text": "At my store we've recently had issues dealing with the front desk of certain hotels. Usually we go to the room unless instructed otherwise.  How do your stores handle hotel deliveries? ",
        "created_utc": 1460766475,
        "upvote_ratio": ""
    },
    {
        "title": "I was in a Dominos and cops were being sold uniforms for sting operations. Is this normal operating procedure for a Dominos?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4ez4e3/i_was_in_a_dominos_and_cops_were_being_sold/",
        "text": "[deleted]",
        "created_utc": 1460758619,
        "upvote_ratio": ""
    },
    {
        "title": "Delivering at Rush Hour",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4ez3lg/delivering_at_rush_hour/",
        "text": "[This is the process](http://www.thewebcomicfactory.com/comic/tales-of-pizza-pizza-rush-hour/) I used to go through delivering pizzas at the height of rush hour.",
        "created_utc": 1460758315,
        "upvote_ratio": ""
    },
    {
        "title": "A classic fight from my Pizza Hut days",
        "author": "BlueRaspberry",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4ewbpm/a_classic_fight_from_my_pizza_hut_days/",
        "text": "I used to be a shift manager at a Pizza Hut. One night during the dinner rush, I was on the oven and a waitress (we had dine-in service as well) was calling out the names of customers' orders as they were boxed up. I noticed one guy had been sitting in the lobby for a while and I asked the waitress if he was still waiting on his order and she said yes. Finally I finished cutting and boxing all the orders during the rush and every order had been given out except one. I called out the name on the order and the guy from earlier came up and got it. Now I'm angry because his food had been ready for twenty minutes and we had wasted his time. I asked the waitress why she had told me that he was all set when his food was waiting in the hot bag and she said she forgot to call his name. Now I'm extra angry because I had just asked her to make sure she was calling customer's names and she had just \"forgot\". So I raised my voice when telling her I was angry she had wasted that man's time and went back to work.\n\nHalf an hour later, a tall, muscular man walks in and come up to me. \"Are you BlueRaspberry?\" he asks.\n\n\"Yes, may I help you?\"\n\n\"I heard you were yelling at my girl. I ought to knock you out!\"\n\n\"No, she had just forgotten to give a customer his food for twenty minutes, so I got upset and raised my voice.\"\n\n\"She said you yelled at her in front of everybody. Listen here: I'm fresh out and I don't mind going back to jail again. You treat her nice and we won't have a problem.\" He gives me a dirty look and walks out.\n\nI decide to call the GM and tell him what happened. I finish the conversation by saying, \"I didn't know her husband was fresh out.\"\n\nThen the GM says, \"No, that's not her husband. That's her boyfriend. Her husband is in Afghanistan.\"\n\nClassy.",
        "created_utc": 1460720664,
        "upvote_ratio": ""
    },
    {
        "title": "\"Sorry, I'm broke right now\"",
        "author": "Striker__Eureka",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4ev661/sorry_im_broke_right_now/",
        "text": "Then why the fuck are you ordering $50 worth of pizza and wings?!",
        "created_utc": 1460695479,
        "upvote_ratio": ""
    },
    {
        "title": "I'm standing here waiting for the customer...",
        "author": "Chronoblivion",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4eu7uc/im_standing_here_waiting_for_the_customer/",
        "text": "Ticket says \"delivery time 7:30\" which is exactly when I knocked on the door. The man here told me she went to the bank to get change for a $100. Why would you not be home when you're told it would be here?\n\nI told him I'd wait 5 minutes at most. As of now it's been about 3. I'm betting she won't make it in time.\n\nHow was your shift tonight?",
        "created_utc": 1460680427,
        "upvote_ratio": ""
    },
    {
        "title": "Cockroach Lady and Other Fun Stories (Really Long!)",
        "author": "squiiints",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4etdhq/cockroach_lady_and_other_fun_stories_really_long/",
        "text": "So, I actually work for a delivery service that will deliver anything from anywhere and I do this under a contractorship, which basically just means I'm given a written request and have to agree to do the request. Pizza is pretty common, but I also deliver things like sushi, burgers, etc. Groceries are also not uncommon requests that I get. In my 1100+ deliveries, I've run across some bizarre customers.\n\n\nFirst up, and honestly the most disgusting thing I've run across, was Cockroach Lady. I forget what I was delivering, but it's not important. Anyway, it's starting to get dark and as I'm walking up to her house, I notice the majority of her house is white and then there's this random, haphazardly painted patch of brown on one side. Weird, especially for such a nice neighborhood, but I ignored it and rang her doorbell. I'm left standing there for a couple minutes and start to hear a scratching noise. At first I'm thinking it's a cat or something in the bushes and I look to my right, hoping to pet it.\n\nNope, no cat. That scratching is coming from the brown paint. Which turns out to be, you guessed it, giant f-ing cockroaches. I'm only given a minute to be absolutely horrified before this older woman opens the door, takes the order from me, and then asks me to help her pay on the app. So I'm trying to help her and out of the corner of my eye, I see what I thought was a moth flying at my face. No, again I'm wrong. It's a giant cockroach the size of my ear, happily landing on my face.\n\n\nI'm kind of expecting this woman to be embarrassed by this, but she isn't. She just nonchalantly apologizes as I'm panicking and end up shoving the roach into her house. She still doesn't seem bothered by this. Once I'm done helping her, I drove to the nearest restroom and scrubbed my face raw with hand soap and paper towels.\n\n\n-----\n\n\nNext story- Now, I'm not sure if this gentleman was on drugs or just paranoid, but I've heard similar stories of this guy from my coworkers, and it's just strange. Basically, he orders a bunch of food, usually totalling $30-45. The weird part comes when you try to punch his address into Google Maps, because it always comes up as either non-existent or literally just a field/abandoned building.\n\n\nThe first couple times I got this guy, I just texted him and asked him to verify his address. He would give me the same address listed on his order, and I would have to explain that Maps is trying to take me to a field in the middle of nowhere. He would convince me to drive there, see that it was indeed a field/abandoned building, and then give me a real address to an apartment building.\n\n\nSo I go to the new address, obviously, and then realize he didn't include instructions for getting in or even his apartment number. I text him again, and after some persuasion, he tells me to leave the food either on the bench across the street or on the sidewalk in front of his building. The first time, I just left it and drove off. The second time, I hadn't received a second order, so I just waited. 20 minutes passed and this guy still didn't come down to get his food. I'm not sure if he ever does, really.\n\n\n----\n\n\nI have a lot of other stories but this is long and I'm getting tired of typing. So last one.\n\n\nIt's about 9:30pm on a Friday night and I get an order in. Pretty simple, just pick up some Asian food and deliver a couple blocks away. I accept the order, text my customer Hello, and place her order over the phone with the restaurant. As I'm driving there, she asks me if I can stop and grab her something else. I let her know that we're only allowed to go to one place per order.\n\n\nNow, I'm partially at fault because I did kind of piss her off, but legally I'm not required to pick up anything that's not in the original written request. She immediately goes off on me, tells me to cancel the order. I do that right away, because honestly it's late, I get off in 15 minutes, and I don't want to spend the next hour dealing with this lady.\n\n\nA couple minutes later, I clock out and think I'm done with her. Nope. She spends the next half hour harassing me over text as I'm driving home. Unfortunately I wasn't able to stop anywhere to block her, so I just watched as she sent me these ~~scathing~~ embarrassing texts the whole way home. Why people get this upset over a pack of cigarettes, I will never know.",
        "created_utc": 1460668727,
        "upvote_ratio": ""
    },
    {
        "title": "Pepperoni rolls",
        "author": "MoistWalrus",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4erlcr/pepperoni_rolls/",
        "text": "Has anyone at Papa John's tried them yet? My manager and I are thinking about trying some for lunch, but aren't sure.",
        "created_utc": 1460646871,
        "upvote_ratio": ""
    },
    {
        "title": "How much should I be tipping on a freebie pizza?",
        "author": "bananabrownie",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4epvxo/how_much_should_i_be_tipping_on_a_freebie_pizza/",
        "text": "Lurker/random redditer here -\n\nSo I normally order from Papa John's and as you all know, they have a rewards system. Every now and then I earn enough points for a free pizza. Usually when I get free food (for whatever reason), I'll tip based on what the regular price of the food is. In this case, I usually tip based on the value of the pizza (even though I'm getting it for free) so typically $5. \n\nThis time around, I got a weird look from the delivery guy when I did that (it was separate from the delivery fee/tax/etc - so it's not like I made the tip part of the fees) - is it possible he expected a bigger tip since I was already getting the pizza for free? ",
        "created_utc": 1460614411,
        "upvote_ratio": ""
    },
    {
        "title": "I'm sorry, were you unaware you lived in an apartment?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4ej8d5/im_sorry_were_you_unaware_you_lived_in_an/",
        "text": "[deleted]",
        "created_utc": 1460509700,
        "upvote_ratio": ""
    },
    {
        "title": "A fellow diver didn't tip.",
        "author": "jloper",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4eiush/a_fellow_diver_didnt_tip/",
        "text": "As a fellow driver (Domin-ho's), anytime I tip a minimum of $10 on a good weather day. I tip $20 for bad weather/really late orders. I'm not asking $10. I just want like $5.  I had a fellow driver put \"$0.00\" in the tip line on the receipt (the day after I tipped him $10.23). So now, when he delivers to me I tip $1.00. Every time, he asks about my big tips I used to give. I tell him those are for drivers who respect me enough. I kept the crappy receipt and showed him when he asked. His jaw dropped and he just left. Now he tips every driver $5.00\nSo now he gets my usual tips.",
        "created_utc": 1460504096,
        "upvote_ratio": ""
    },
    {
        "title": "College towns",
        "author": "chanchan69",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4egfnj/college_towns/",
        "text": "So I will be going back to school this fall and was just curious. What has been yalls experience with delivering in a college town? Are the tips decent? Or is everyone a cheap bastard that refuses to tip? ",
        "created_utc": 1460472804,
        "upvote_ratio": ""
    },
    {
        "title": "Working in a dense area.",
        "author": "panderpmonium",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4eeqnt/working_in_a_dense_area/",
        "text": "This week I'm working for a store in the middle of a high-density area with plenty of high-rises. It takes a while to get around even tho I dont go many miles. I looked today at NY city and found quite a few dominos at least within Manhattan. It made me wonder, since most people there use trains, buses, bikes, or a combo of 2 or more, do the drivers get in and drive or also use bikes and public transportation?",
        "created_utc": 1460438759,
        "upvote_ratio": ""
    },
    {
        "title": "I resigned. I wrote a 2-week notice and everything. They took me off the schedule.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4eebsn/i_resigned_i_wrote_a_2week_notice_and_everything/",
        "text": "[deleted]",
        "created_utc": 1460431181,
        "upvote_ratio": ""
    },
    {
        "title": "I finally quit last week!!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4ee4z4/i_finally_quit_last_week/",
        "text": "[removed]",
        "created_utc": 1460428189,
        "upvote_ratio": ""
    },
    {
        "title": "Turns out girls get awfully horny on weed too.",
        "author": "panderpmonium",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4e4xwh/turns_out_girls_get_awfully_horny_on_weed_too/",
        "text": "[removed]",
        "created_utc": 1460271355,
        "upvote_ratio": ""
    },
    {
        "title": "Training new drivers",
        "author": "MoistWalrus",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4e4ncw/training_new_drivers/",
        "text": "Because of an unfortunate event my shop had to let a handful of people go at once. We just hired 2 new guys, and I am in charge of training them. Any pointers or advice on how to train two people at the same time?",
        "created_utc": 1460264076,
        "upvote_ratio": ""
    },
    {
        "title": "Have a good weekend to you all",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4e3x3l/have_a_good_weekend_to_you_all/",
        "text": "I've worked for a pizza place almost 5 years now and over time became the main opener. After a long long time of having evenings and weekends filled up with work I finally have an entire weekend off.\n\nGood luck to you all and hope that customer gave your their gate code for the complex, or their last name to dial them on the call box. Hope they remember their apartment numbers. And I hope they don't try to order and beat you guys to their own home on their way home from work.\n\nMay your tips be fat and routes be safe",
        "created_utc": 1460250297,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of signage is used for a soft top? I have a Jeep and don't want to rip it apart.",
        "author": "shadomoon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4e3qik/what_kind_of_signage_is_used_for_a_soft_top_i/",
        "text": "I'm looking at driving for Dominoes. I'm hoping they have magnetic signs as well.",
        "created_utc": 1460247127,
        "upvote_ratio": ""
    },
    {
        "title": "A 19 yr old pizza delivery guy helped save a man's life by performing CPR on the customer who was turning blue outside the house. He said, \"I left a pizza boy and came back a pizza man.\" His tip was 25 bucks. (x-post r/todayilearned)",
        "author": "Miskatonica",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4e3of0/a_19_yr_old_pizza_delivery_guy_helped_save_a_mans/",
        "text": "Here's the article: http://www.postindependent.com/news/16943384-113/glenwood-pizza-delivery-driver-performs-cpr",
        "created_utc": 1460246192,
        "upvote_ratio": ""
    },
    {
        "title": "That time that customer passed out in front of me",
        "author": "roxas596",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4e35py/that_time_that_customer_passed_out_in_front_of_me/",
        "text": "Soooooo a couple months ago I was delivering to a hotel. Went up to the room, younger guy (looked about 25) opened the door,  I told him how much it was, and he went to get the money. He then immediately passed out onto the floor, nearly hitting his head on the table. I was kind of just like \"oh fuck, oh fuck, oh shit\" and didn't really know how to handle it so I just kind of yelled for help, about 2 minutes later he just woke up. I said \"uh you ok dude???? I literally thought you died right now\" and he replied \"oh yeah, sorry about that, I have narcolepsy, it happens once in a while.\" Dude went to get the money again and he passed out AGAIN. this happened 4 or 5 times. Afterwards he gave me a hug and a $15 tip. I left and drove back to my restaurant wondering if that just really happened. I swear the weirdest shot happens to me sometimes",
        "created_utc": 1460237955,
        "upvote_ratio": ""
    },
    {
        "title": "Delivering to other restaurants",
        "author": "jennej_dtsab",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4e282v/delivering_to_other_restaurants/",
        "text": "I just delivered $85 worth of food to the wait staff at a local bar&amp;restaurant and got no tip. Honestly, of all people I to get stiffed by, it's those that also live off tips? Unbelievable.",
        "created_utc": 1460224140,
        "upvote_ratio": ""
    },
    {
        "title": "What would YOU have said/done?",
        "author": "Derring-Do_Dan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4e1dxr/what_would_you_have_saiddone/",
        "text": "This happened to a co-worker, not me. So, there's this American Legion we deliver to, in a town just across the state line. It's about a twelve minute drive, each way. The people who order from there usually tip decent. But this time, my buddy gets there, gets the money from some drunk dude, gives him the food, and Drunky hands him a five and says, \"and this is for you.\" All good, except that some girl says \"hey I want five bucks!\" and Drunky actually *takes the money from my buddy's hand* and gives it to the girl! then shrugs and says \"sorry pal.\"\n\nWell, he just left. Now, it's one thing not to tip, but I definitely would have called the guy a lowlife or something like that. I definitely would have said SOMETHING. What about you guys, how would you have handled that?",
        "created_utc": 1460211226,
        "upvote_ratio": ""
    },
    {
        "title": "You want money? look 300$",
        "author": "eklvxvzn",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4e0nb2/you_want_money_look_300/",
        "text": "[removed]",
        "created_utc": 1460193158,
        "upvote_ratio": ""
    },
    {
        "title": "Sick customers",
        "author": "daddydomino",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dyosn/sick_customers/",
        "text": "So, we had a customer order carryout last week. They called back the next day and claimed the food made them sick, along with five other people in the house.  So, the protocol is that we call the previous 5 people before they ordered and the 5 people that ordered after them to do a quality check and ask the customers how their experience was with us, those 10 people all said, good, great, fine.  They saved us a sample and demanded that we send it off to get tested, which spent the night in their trash can and they brought it in the next day. Corporate sent us this fancy styrofoam box with cold packs and a UPS shipping label to send it in.  So, today the GM called them to look over the paper work to make sure the account of what happened was correct and ask them if they could come by the store to sign it.  They didn't know when they'd be able to come in and sign it even though they only live about 4 blocks away, but they did want a delivery. So they ordered two pizzas and guess who was up to deliver it.....yep, me!  So I offered to take a clipboard with the paperwork on it to have them look over and sign.....now, everyone's favorite game.... guess the tip.lmao",
        "created_utc": 1460153421,
        "upvote_ratio": ""
    },
    {
        "title": "Stop posting videos.",
        "author": "rdeluca",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dx1x8/stop_posting_videos/",
        "text": "~~Stop posting videos in text posts.~~\n\n***Edit2:*** You can post videos that contain a story from a delivery person, as that IS the content of this sub. \n\n(**example of good content**: [Dis video from \n he posted here ages ago. I love this video.](https://www.youtube.com/watch?v=KpCb1tUSZlM&amp;nohtml5=False) \n\n\n But random things that are loosely related, only due to having pizza, or prank videos are not welcome.\n\n~~I have link posts removed on purpose.~~\n\nThis isn't /r/videosaboutpizza \n\nEdit: (it exists now, I posted my favorite pizza-related video there)\n\nAlso - this is in response to 4 only vaguely related crappy prank/rude/has nothing to do with the sub videos that got posted in the last 24 hours. Really weird how it all happened at once, but I felt like I had stab the snake in the stomach instead of cutting off the head of the snake so it would stop hydra-ing.",
        "created_utc": 1460131444,
        "upvote_ratio": ""
    },
    {
        "title": "If you ever wonder why the pizza guy is skeptical about giving free food, this is why.",
        "author": "ryumichael",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dw0bk/if_you_ever_wonder_why_the_pizza_guy_is_skeptical/",
        "text": "[removed]",
        "created_utc": 1460115941,
        "upvote_ratio": ""
    },
    {
        "title": "Not Much Worse Than a Coworker Who Stiffs/Tips Like Shit",
        "author": "SirCollin",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dv04k/not_much_worse_than_a_coworker_who_stiffstips/",
        "text": "My coworker (insider) has been ordering delivery recently. Most of the time she gets it completely free, or for the delivery price. She lives on the third floor of her building. She tips like trash or stiff our drivers. She's even ordered at 1:20am (we close at 1:30) and stiffed the closing driver.\n\nI was so relieved when my manager actually called her out on it the other day and told her not to order delivery anymore.\n\nThis girl's friends and family both tip awful. Just recently got a $1 tip from an apartment of 4 of her young adult friends that was all coins. After hearing about her terrible tipping habits, everyone in my store has lost any respect for her (she's a pretty shit employee too).",
        "created_utc": 1460091884,
        "upvote_ratio": ""
    },
    {
        "title": "in the ER right now. make lines are sharp.",
        "author": "Mustard_Icecream",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4duzqj/in_the_er_right_now_make_lines_are_sharp/",
        "text": "Getting some stitches in my thumb. Its real deep. Be careful with the makeline",
        "created_utc": 1460091654,
        "upvote_ratio": ""
    },
    {
        "title": "I was hoping this was satire.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4du8r1/i_was_hoping_this_was_satire/",
        "text": "[removed]",
        "created_utc": 1460078778,
        "upvote_ratio": ""
    },
    {
        "title": "Ken the Hermit",
        "author": "afambelafonte",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dskux/ken_the_hermit/",
        "text": "Ken the hermit had no phone, no electricity, and basically looked like one of the wild men from Two Towers. He lived in a large shed behind a condemned house. He'd ride his bike to the store, order for delivery, then race home. It was a pretty long ride, and there were times when we beat him there.\n\nKen the hermit's shed behind the condemned house was in a large wood, and to get to it you had to take a small hike though knee high grass. But you didn't hike. You laid on your horn until Ken came around.\n\nOne day Ken didn't show up when I honked, so after a while I figured I'd risk it. I get to his shed and outside is a huge frigging parrot next to a giant stack of empty pizza boxes taller than I was. I knock, and the parrot starts screaming at the top of its lungs like a woman being straight fucking murdered. \"AAAAAAHHHHHH OH MY GOD AAAAAAAHHHHH FUCK OFF FUCK OFF FUCK OFF!!!!!\" Ken had a wood axe next to the cage, which I grabbed and tossed into the long grass so Ken the hermit wouldn't have it handy. I set the pie down, pounded on the door, and didn't quite run away, but I proudly but briskly and urgently walked back to my car.",
        "created_utc": 1460055755,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery Pet Peeves. What's the most annoying things that happen to you?",
        "author": "Austin_MX5",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dsh0b/delivery_pet_peeves_whats_the_most_annoying/",
        "text": "For me its every time I go to a hotel or a resort. When walking to the elevator, waiting on the elevator, or in the elevator, people will always go,\"oh thats mine, you can just give it to me now\" or \"let me have a slice\" and then just snicker like it was hilarious. I swear to god I want to punch these people in the face. If it was one or two every month I'd be fine with it, but I shit you not it happens like 3 or 4 times a shift. Everybody thinks they are so funny and they are the first ones to come up with that, but everybody and their mother pulls this stupid fucking joke and it really gets on my nerves.",
        "created_utc": 1460054406,
        "upvote_ratio": ""
    },
    {
        "title": "I was ambushed after a delivery",
        "author": "RealLifeTaken",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dplnx/i_was_ambushed_after_a_delivery/",
        "text": "Before leaving the store I saw the address I was delivering too and remembered I delivered there the day before. It was a weird delivery and I wasn't too excited to see them again. This time I get there at night and I was in a hurry because it was going to be the last delivery before my shift ended.\n\nI pull up and immediately I feel like something is wrong. I go make the delivery and exchange a little banter with the customers. When the customer starts locking the screen door I felt uneasy. So I turn to go back to my car and it's too quiet outside. I step between two of their cars and stop. I wait for awhile just listening and seeing if the coast is clear.\n\nThat's when suddenly 3 guys in hoodies come at me. They point their guns at me and tell me to hand over everything. Which I do. They have me give up my phone's passwords to turn off iCloud so it can't be tracked. 2 of them start walking down the road and I begin to think the worst was over and I'd be free soon.\n\nI was wrong.\n\nThe leader is pissed that he's only getting my phone and $50 from the cash delivery I just did. He calls to one of the other guys for my car keys. He forced me into the car and told me to drive. He directs me to a bank and tries to get me to clean out my bank account. I go through the process because he didn't understand daily limits, so I had to work down until an amount was approved for withdrawal.\n\nHe's getting agitated and has me drive to a gas station. Asks me if I have anything to cover his face with! He puts the gun in his jacket pocket and follows me into the store. I try to make eye contact with the people inside, but no one is looking up. The ATM won't process anymore and he finally says it's time to go.\n\nHe wants me to drive towards a Walmart. Then he directs me to go onto a side road that has been abandoned by the city. I was sure this is where he was going to execute me. We pull into empty office parking lot that has no lights and he is making phone calls about what to do. \n\nThis is when my manager calls to see if everything is alright. He has me answer and puts the gun to my head so that I won't alert him. After the call he leaves the gun there and tells me he thinks I'm lying and hiding something from him. That he's going to have to kill me now. I tell him I'm not lying and he has me beg for my life. This is when he gets another phone call and he wants to try one more ATM. Tells me to drive towards Walgreens. On the way there he realizes it's been almost an hour since the crime started and changes his mind. He was me pull into a parking lot near a fence. He threatens me one more time, asking if I still live at the address on my driver's licence. He tells me he will come find me if I cancel my cards.\n\nHe steps out and tells me to make a left turn and not to stop. He makes his escape into the neighborhood. I drive almost 40 over the speed limit getting away, not knowing if his buddies had a car nearby. I get to a safe area and find a place to call the police.\n\nI don't know what to do with myself now. It's been over a week. No one's been caught yet. \n\nMaybe you guys have some advice on this.\n\n\nEdit: Just to clarify, I didn't think the people who ordered the pizza were involved in the robbery/kidnapping at first. But now I'm highly suspicious that they would have two big orders in two days. Weird feelings about them the whole time. When I was being robbed in their driveway I remember seeing someone looking out the window. They were all young people, but the two groups were different races. They lied on TV about not seeing anything, but hearing something outside. Later saying they found my pizza bag on the ground. None of them called the police. I saw one of them watching the whole robbery.",
        "created_utc": 1460004653,
        "upvote_ratio": ""
    },
    {
        "title": "I'll Never Understand People Placing a Delivery Order When They're Not Even Home.",
        "author": "LowTarOfThePothole",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dkx3p/ill_never_understand_people_placing_a_delivery/",
        "text": "First delivery of the night a couple of weeks ago.\n\nI get to the address, which is an apartment complex. I get to the door and buzz the apartment number and wait. Shortly after I pulled up, a girl pulls up behind my car and approaches the building, so I wait some more, assuming that she lives in the building. It's a tiny foyer, so I step back and hold the door for her while I wait outside. I always hate this situation, because I'm the outsider, and even though I'm in uniform and carrying a pizza bag, people are typically wary of the stranger about to enter their building. \n\nShe also ends up waiting on the call-box, so I ask her if it's normally spotty, considering I haven't gotten a response yet myself. She says she's not sure, as it's her friend's apartment she's trying to get to and she's not even sure if it's the right apartment she's buzzing (turns out it wasn't). Now it becomes a pseudo-race with calling to see who can get ahold of their tenant the quickest. My customer's not picking up and apparently neither is her friend. After a second attempt, she gets buzzed in and I follow in after her, which again, is not how I like approaching the situation, but I'm not getting an answer from this guy expecting a delivery. \n\nI go up to his apartment and knock. No answer. I knock louder and still, no answer. I give the guy a call and again, no answer. I knock and then call again. This time the dude answers and I tell him I've got his delivery at his door. I already know what he's going to say next.\n\n\"Oh.. Well, I'm actually, like, 2 or 3 minutes from my place right now.. Would you mind waiting around?\"\n\n\"I'll meet you out front.\" Not trying to sound super annoyed, but come on, man.\n\nFast forward 10 minutes later and the guy finally pulls up. He can sense I'm peeved, he knows he fucked up, he still tips me for my inconvenience, but what the fuck? Granted, I got there in 20 minutes and our standard promise time is half an hour, but why chance it? What's so god damned important about getting home from work right when your food is arriving? Just order it once you pull up if you want to unwind with it. You'll have plenty of time to get in, do your thing, and then be ready to answer your door when you're requested food has been delivered to you. ",
        "created_utc": 1459932038,
        "upvote_ratio": ""
    },
    {
        "title": "First delivery was apparently not a typical one",
        "author": "MikLickers",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dkjen/first_delivery_was_apparently_not_a_typical_one/",
        "text": "Just found this subreddit! So, first day (about a year or so ago) delivering for Swiss Chalet. Order comes in for edge of the city at a small airstrip. \n\nMy first delivery ever, down a long road that ended in a large private hangar, the instructions read \"Park in front of dumpsters and honk horn.\" I did, and this huge guy comes out of the hangar pays me and takes the food without saying anything. I just assumed that's how most deliveries worked.\n\nA few months later we were talking about crazy deliveries and one of the cooks said \"yeah, when they said the new guy was taking it I thought you were going to get stabbed or something\" ",
        "created_utc": 1459922745,
        "upvote_ratio": ""
    },
    {
        "title": "This made me happy on the inside",
        "author": "doggxyo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dk1a0/this_made_me_happy_on_the_inside/",
        "text": "[removed]",
        "created_utc": 1459912874,
        "upvote_ratio": ""
    },
    {
        "title": "\"I hope I gave you enough.\"",
        "author": "AnneFranc",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4djrfb/i_hope_i_gave_you_enough/",
        "text": "No, two bucks on 41 isn't enough, but I'm not in a position to say that. When you ask if I'm sure, I can't say \"well, why don't you throw me a little more, since that's just under 5%.\" How do you have handle this? I'm relatively new to delivering, 2 months in, maybe a little more. I've served for years, so it's not like I've never encountered this, it's just kind of different feeling. ",
        "created_utc": 1459908464,
        "upvote_ratio": ""
    },
    {
        "title": "Corporate driver asking about local driving for references",
        "author": "universetwisters1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dj590/corporate_driver_asking_about_local_driving_for/",
        "text": "First of all, if this is a violation of rule #2, I apologize.\n\nTo the point, I've been a driver for Pizza Hut for about a year and a half and I do computer animation as a hobby. A coworker introduced me into a program called Source Filmmaker and I'm hooked on it. Me and him are fixing on making a series that puts our crazy sights and experiences delivering pizzas on the metaphorical screen. Character models have been made, sets, scripts, etc. but one thing I'm still wondering about is how small local stores work in comparison to the big chains (since the characters work for a local joint in the middle of nowhere rather than a big chain in a tourist town. Hence I don't have a good reference). Rather than just googling and looking for comparisons, I'd rather ask here, again, if it's allowed. Some questions or points I'd like to ask are:\n\n*How many deliveries does a driver at a local store have compared to one at a chain store? I deliver in a fairly suburbanish tourist town and I get 10-20 deliveries on a busy day. \n\n*How many drivers are there altogether? Is 3 enough or is that too little?\n\n*Do the stores have their own fancy electric interfaces? Here at Pizza Hut, we have (1) a fancy screen on the computer that lets us take customer's orders with ease and (2) a sorta less fancy screen that shows where the deliveries are going with the addresses and all. Do local stores have anything like this or do they just write it all down on paper and hand it to the cook or something like that?\n\n*Where do local stores get their dough and other ingredients from? Do they just buy them locally or do they have a supplier like chain stores?\n\nAnd that's all I can think of as far as questions go. Any bit of info helps and again, if this violates rule #2, I'm sorry.",
        "created_utc": 1459899140,
        "upvote_ratio": ""
    },
    {
        "title": "Had to call your attention to this thread, where a polite request from a Domino's employee brought out the pitchforks.",
        "author": "cardinal29",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dhjan/had_to_call_your_attention_to_this_thread_where_a/",
        "text": "[removed]",
        "created_utc": 1459877942,
        "upvote_ratio": ""
    },
    {
        "title": "The Story of Crazy Old Rydel",
        "author": "morethanso",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dh6vz/the_story_of_crazy_old_rydel/",
        "text": "I think it's safe to say we probably all have a million customer stories - there's the good, the bad, and the absolutely unbelievable (like that time I used my transgender Assistant Manager as my fiance to get out of some creepy dude hitting on me without said manager finding out for months) - and here, I'm posting my...well, let's call it favorite.\n\nI've been a manager for 5 years and, to be honest, one of the better customer service reps my shop has had over the years. And most of the time when customers are shit I can take it with a reasonably sincere smile. But there's this one lady. She only orders once a year - usually in August/September - and she always, always, always has a problem with her order and, of course, I'm always the one to deal with her. So here's the story of Crazy Old Rydel (C.O.R.).\n\nWe have these apartments in our area that the residents have to buzz you in at the entrance to the building. The apartments are primarily for older and handicapped people - not exactly a nursing home, not exactly regular apartments - and they're decent for tips most days. Anyway, C.O.R. lives there and as I start her order she, 1, doesn't know the address (thankfully, I did) and 2, didn't have a phone connected yet as it was her first day in the apartment (I let her use a neighbors phone number as a connect with an assurance that we'd be able to reach her there). As we're going through the order, she is obviously annoyed at my asking so many questions (\"handtossed, pan, or thin?\"/\"And what would you like on your pizza?\") and I can tell she's a woman who gets frustrated easily. Finally, at the end of her order I remind her that she has to buzz my driver into the complex and she basically loses her shit.\n\nScreams about how she doesn't know how to do that and the driver should just come in - not possible, I keep trying to tell her to no avail. I ask a driver passing by as I'm on the phone if they have any clue how to buzz in and they are as clueless as I am. As I'm telling her she needs to contact the management at the apartment complex, she hangs up on me. I give it a minute and then figure, okay, she's not ordering then. Thirty minutes later I get another call from her screaming about why isn't her 'fucking food here, you lying ass bitch!'. I tell her, calm as I can be, that I never got a confirmation on her order or that she'd be able to get the driver in, so I never put through her order. I tell her if she'd like to stop cursing at me I'd take her order again, but I wouldn't do it while she was screaming at me. Of course, this just makes her scream louder. I hang up. That's the last I hear from her that day.\n\nFast forward a year. I look at the caller ID on our phones, recognize the name but not from where. As I start taking her order it dawns on me who she is. Most of the order actually went okay, including the confrontational \"buzzing in\" reminder. I did let her know, though, that my particular location had switched to the fried wings, in place of our previous baked ones (we'd made the switch about a month before, so I was still reminding people of the change). As she was ordering her wings she kept calling them \"plain\". I say, \"Well, did you want them mild, then? Or would you like them naked - no sauce on them at all? I can send a sauce on the side if that works.\" Of which her response was to parrot the word 'plain' back at me several times. So I say, \"Okay, well, I'm going to send you mild wings, okay?\" And she confirms the order, everything is good to go and, ten minutes later, my driver is leaving with it. Low and behold, I get a call from her screaming about the wings. My usual reaction is to apologize for the mix up and resend the wings out for free but she just wouldn't shut up. \"Listen here you bitch,\" she started with the nastiest, angriest voice I think she could come up with. \"I want my fucking wings, you cunt.\"\n\nAaaaand that's where I decided we aren't playing our little dance anymore. I tell her I'd love to send her more wings - I'll even take off the delivery fee - but she's going to have to pay for them again because I confirmed with her the flavor and type on the phone and she had agreed. As she starts to really scream I tell her I'm not having it, that I remember her from the troubles she caused last time, and that she needed to calm down if she wanted me to remain on the phone. \"I've never ordered there before!\" Yeah, okay. She calls me a bitch again and I say, \"Okay, I'm hanging up now.\" Click. Five minutes go by, the driver is back (stiff, of course) and telling me how crazy the woman was (heh) before she calls back again. She says, \"I'm trying to be calm,\" her voice is anything but, \"But you fucked up my order and I'm gonna keep calling until I get what I paid for!\" I say, \"Okay, that's fine, but I'm not sending you anything free. If you have a problem you can talk to my GM, who will be here at 4pm tomorrow.\" Proceed with more cursing and me hanging up on her a second time. About a minute later I get another call, from her neighbor/friend trying to rectify the situation but I told her that C.O.R. is an adult, I tried to settle things with her and she decided to curse at me instead. If she'd like she can talk to my GM tomorrow.\n\nShe never called my GM and she's yet to place another order. I'm hoping she's given up on pizza in general because I wouldn't wish her on any of my competitors.\n\nSo, what was your worst customer experience?",
        "created_utc": 1459873593,
        "upvote_ratio": ""
    },
    {
        "title": "Two tales from last night of why the heck would you do that",
        "author": "the_eluder",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dgzh4/two_tales_from_last_night_of_why_the_heck_would/",
        "text": "So last night I had two separate incidents that make me wonder, WTF are people thinking when they order.\n\nFirst one is a house where the customer normally takes a long time to come to the door.  I get there and knock, no customer.  I look at the slip, it says call when you arrive.  So I walk back to my car, and dial the number.  Ring, Ring, Ring.  No answer.  So I walk back to the house, and wail on the door.  Ahh!  Results.  The customer appears.  I tell her I called, but she didn't answer the phone.  She's like, \"Oh, I just put that in there because I can't hear the door knock when I back in my bedroom in the back of the house.\"  WTF.  YOU ordered the food.  You should expect someone to eventually arrive with it.  How about sit in the living room, you know, right next to the door, where you can hear the delivery arrive.\n\nSecond delivery, almost at closing time.  It's to a semi-shady apartment complex, but they do appear to be trying to turn things around.  I get there and knock on the door.  I wait.  I hear talking in the background.  Still, no once comes to the door.  I knock again, still no answer.  I hear more talking.  I ring the doorbell.  No answer, still talking.  Finally, after having been there for 3-4 minutes, I beat on the door like a cop before a drug raid.  The door magically opens.  Guy is like I'm so sorry, I was wearing noise cancelling headphones.  Again, WTF?  Why the hell are you wearing noise cancelling headphones after you ordered a pizza.\n\nOne last bonus story of stupidity.  We get an order to an apartment complex, apartment 0131.  The first digit is the building number, so I'm pretty sure it's apartment 131, but it could also be apartment 1031, and the customer dyslexicly typed in the apartment  Before I climb the stairs to potentially the wrong apartment, I give a quick call to confirm.  Sure enough, it's apartment 131.  When I get to the door, I tell her I had to call because with the unnecessary leading 0, I wasn't sure this was the correct apartment.  She replies that it was OK, people call her back to confirm all the time.  Is a little bell not ringing in her head?  We don't put unnecessarily leading 0's in front of numbers for a reason.  It's because you are doing that that you apparently confuse everyone you give your apartment number to. ",
        "created_utc": 1459871013,
        "upvote_ratio": ""
    },
    {
        "title": "Small victory over slag security guard at local hospital.",
        "author": "LeverActionDruid",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dfvhj/small_victory_over_slag_security_guard_at_local/",
        "text": "I'm pretty sure most of us loathe delivering to hospitals of any kind, but the one hospital/emergency center in my delivery range has been a double pain in my ass due to the security guard that always seems to be hovering by the front desk when I deliver there.\n\n\nI worked a security gig for awhile, so I'd met the type before. He could be doing security at a Dairy Queen and would act like he's a 9-11 first-responder at all times. He always leaps at the chance to sign the credit card slips for everyone -- even if they're nearby -- and I've seen him smirk while drawing a line through the tip field on the three-five credit slips for all the individual orders. \n\n\nUntil last week I'd always just dealt with it as despite the silly fury that rises up from being stiffed, I always respected the fact that the nurses and doctors who ordered were possibly doing something important at the time and gave the emergency center some leniency with allowing someone else to sign -- which I don't do anywhere else.\n\nThis delivery was large though so on top of lugging two stuffed hot-bags in, I also had to deal with the Byzantine process of figuring out who was who and what in the pile of pies and side-items belonged to each of them, and, with that, I wasn't in the mood for Crewcut McFuckface to reward me with the numerical equivalent of \"go fuck yourself.\"\n\n\nCrewcut McFuckface: \"I'll sign those for you.\"\n\nMe: \"Sorry, but I need the cardholders to sign their own slips.\"\n\nCrewcut (taking an indignant tone): \"I've signed them before.\"\n\nMe: \"Sorry, I need them to sign their own slips.\"\n\nCrewcut (now openly shitty): \"Well, they're all dealing with a trauma right now, so if you want them to sign themselves, I hope you're ready to hang out here for thirty minutes.\"\n\nMe: \"Sure, no problem. I'll wait.\"\n\n\nLiterally sneering, he left the front desk area and went into the back. Another lady at the desk, which I'm assuming was the nurse-receptionist (if that's a thing), who clearly wasn't dealing with anything at the time, tells me she can sign for her order. Before she was finished signing, the other four people came out from the back and lined up to sign their slips and casually eat food at near the front desk -- eating contently despite the fact that their imaginary trauma patient was imaginationally dying at the time. \n\n\nInstead of leaving with nothing other than doubt about my current source of income as usual, I left with $12. $5 from the receptionist, $2 from each of the three nurses, and $1 from the doctor -- go figure.",
        "created_utc": 1459853244,
        "upvote_ratio": ""
    },
    {
        "title": "And the winner is....",
        "author": "TheVoicesSayHi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dfj69/and_the_winner_is/",
        "text": "So this is going to be short but I only just got back on the road tonight after being sidelined for a while so I thought I'd share.\n\nSo I get back from a run tonight and after I clock in the phone rings and I pick up:\n\nMe: \"Thanks for calling papi juan's in shithole, can I offer you some over priced food at a slightly more reasonable price?\"\n\nDude: \"Hey I just placed an order and I'd like to cancel it the name was *gives name*\"\n\nMe: *I look and see his order is already in the oven* \"Alright sir, that's no trouble I can do that for you. Do you mind if I ask why?\" *I ask because if possible I can save the sale, maybe offer a discount etc so the pie in the oven doesn't go to waste that sort of thing*\n\nDude: \"Oh well I had ordered from Pizza the hutt but they had said it'd be a while so I ordered for y'all but they're here now so I don't need yours\"\n\nMe:\"...........\"\n\nDude: \"so yeah I'm good but y'all have a good night\"\n\nMe: \"...you as well sir, enjoy your dinner\"",
        "created_utc": 1459844578,
        "upvote_ratio": ""
    },
    {
        "title": "Delivering in Chapel Hill tonight...",
        "author": "iftreescouldspeak",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dfepw/delivering_in_chapel_hill_tonight/",
        "text": "Was a SHIT SHOW. Haha I don't even know how to describe it. All the closings of the roads don't even make sense to me.",
        "created_utc": 1459841284,
        "upvote_ratio": ""
    },
    {
        "title": "The Pizza Guys (x-post from /r/TalesFromAdultStores)",
        "author": "mstarrbrannigan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4df3tl/the_pizza_guys_xpost_from_rtalesfromadultstores/",
        "text": "We had a pretty good relationship with one of the pizza places in town. They'd give us coupons and vouchers whenever they could, and while we couldn't offer the same (I tried to get management to give them valued customer cards, which offered a 10% discount everyday, but they wouldn't have it), we'd tip really well. \n\nAnd they'd often spend their tips in our smoke shop when they'd stop in. I'm not going to say all pizza guys/gals are stoners, because they're not, but the ones who worked at this particular shop pretty much were. I learned they would argue about who got to deliver our pizzas, just because they wanted to be able to stop in and pick up wraps or papers, or just check and see if we had anything new.\n\nThis pizza place was catered towards the young adult/college crowd. As such, they were always chill and goofing around, even when you called to place an order. One night I called, and after listening to their advertisements that play when you're on hold, a guy answers the phone.\n\n&gt;Pizza Man- Thank you for calling [Pizza Place.] What can I put in your mouth?\n\nWhich was definitely not the standard phone answering phrase, and therefore I was entirely unprepared to respond.\n\n&gt;MSB- Dude, you caught me totally off guard.\n\n&gt;Pizza Man laughs- How can I help you?\n\n&gt;MSB- Uh, well, this is [Sex Shop.]\n\nHe laughed and I heard him tell the cooks, who also laughed. He said something about hoping they record calls for quality control purposes or whatever.\n\nI told my coworker, BC, who responded with \n\n&gt;BC- I wonder what management would say if we answered like that? \"Thank you for calling [Sex Shop], what can we put in your hole?\"",
        "created_utc": 1459834478,
        "upvote_ratio": ""
    },
    {
        "title": "My coworker is a serial non-tipper",
        "author": "heavencondemned",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4debgb/my_coworker_is_a_serial_nontipper/",
        "text": "I just wanted to express that just because someone at a business doesn't tip, doesn't mean no one there does. We all tried to convince her that it was fucked up but she doesn't care. Apparently she doesn't tip at restaurants either. Anyone have any ideas on how to get her to tip? Should we just ignore it and hope for the best? We're all kind of afraid to order from the place she does because there's always the chance we'll get that one asshole that does something to the food. I know the majority of people won't, but she's so damned smug about not tipping it has to be rubbing the delivery folks the wrong way.",
        "created_utc": 1459820869,
        "upvote_ratio": ""
    },
    {
        "title": "How to get written up or fired at your job.",
        "author": "KodyBurns",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dcock/how_to_get_written_up_or_fired_at_your_job/",
        "text": "Kinda long so here's a TL;DR\n\nI call to order take out from a place, get hung up on 3 times, and after finally making my order and going to pick up the food, I'm treated very rudely. Still decide to tip 10 dollars, and the rude employees catch me at my car to apologize and say thank you for the tip.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nI'm a driver and have shared many stories here, but this story is about a time I was a customer. \n\nIt was right around Christmas time a few years ago, and my wife and I wanted to grab take out for dinner after I had gotten off work. I had gotten a gift card for a certain place (I'll leave out the name) and I wanted to use it. It was 9:25 when I called, and they closed at 10.\n\nI call once, and immediately hear the phone pick up and *click*. Then a dial tone. I figured maybe it was an accident. I call again. Same thing. I call a third time, and again I'm hung up on. I told my wife the fourth time I call will be the last. Either something happened or they reeeeeally don't want an order. \n\nFinally on the fourth call, a woman answers. Extremely rude, she asks \"What do you want?\" She's kind of huffy on the phone and I can tell now that they obviously didn't want to take any more orders for the last half hour of the night.\n\nI tell her my order, and get down there in 15 minutes. It's now 15 minutes before their actual closing time, and after walking in, I'm getting absolute death stares and glares from everyone behind the counter. While the female server is bagging my stuff up, I try to lighten up the mood and ask the man who's ringing me up how he's doing, was it a busy night, what are your plans for New Years, and he's only giving me one word answers to anything I say, just generally being an asshole. \n\nThey hand me my food, they hand me the gift card slip so I can sign, and I put a ten dollar tip on there because what the hell it was a gift card, I came in relatively late, and I could tell they were all not having a fun night. I grab my things, tell them have a good night, to which nobody replies, and I walk out towards my car. I left the place 10 minutes before their closing time. I didn't think I really ruined their night that bad. \n\nJust as I get to my car, the woman who initially took my order over the phone bursts through the double door with the guy who rang me up, and they both yell out to me, \"Thank you so much!!!\" then just the female says, \"I'm so sorry I hung up on you so many times!\" \n\nIt was like out of a damn movie. I just shook my head, smiled and said \"Have a happy New Year guys.\"\n\nShe basically confirmed to me everything I had initially thought. I went back the next day and told their manager exactly how I was treated and what happened. He was furious. \n\nNever once in my life have I done that to a customer. Especially a full half hour + before closing time. ",
        "created_utc": 1459798143,
        "upvote_ratio": ""
    },
    {
        "title": "Not getting political, just inspired by another post and wanted to share some anecdotal observations",
        "author": "redout9122",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4dccor/not_getting_political_just_inspired_by_another/",
        "text": "I work in the South. And my state has South in the name. Just some background.\n\nI've been noticing, of course, the usual crop of signs, and I've been taking mental notes on how different supporters tip. Here's what I've found.\n\nThe most common sign I've delivered to, surprisingly, is Bernie Sanders (who got blown out here). I've had about ten customers with Bernie signs in their yards or driveways. These are *real* hit-or-miss. Half have been tips and half were stiffs. The half that tipped were all really good (a $3, the rest were $5 and above), and honestly, the stiffers just kinda bite because the most frequent political affiliation of people who insult my job are liberal\n\nI've had one Kasich customer. $7 or $10 tip every time.\n\nTwo Trumpers. Both stiffs.\n\nTwo Rubio supporters, both were tips of over $5.\n\nMiscellaneous observation: there's an inverse relationship between the amount of religious bumper stickers/decorations I see and the amount of my tip.",
        "created_utc": 1459793970,
        "upvote_ratio": ""
    },
    {
        "title": "Subtle win over a serial stiffer",
        "author": "detachedmind",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4db4er/subtle_win_over_a_serial_stiffer/",
        "text": "So last night I'm reading an address and although I don't remember the customer, I remember they didn't tip. \n\nSo I go to the cigarette-littered house and of course it takes 3 rings for this DeeDee Kong looking woman to emerge. The total was $13.50 and she hands me $20 and 2 quarters. Now this time i ask \"How much change do you need back?\" Hoping maybe she'd have enough decency to say just 5 or something.\n\nSure enogh, $7 back. So I kinda give her an \"or course\" look and pull up change. Im cointing out all my 1's and she says can I get a 5 and two 1's? Without looking up I count out 7 dollar bills and say, \"nope, thats for tipping customers.\" Turn around and walk off like a boss. \n\nI could tell she was glaring at me as I walked as she didn't close the door till I was halfway down the driveway. I love being able to non-rudely zing stiffers. Ended the night with $90 so fuck her!\n\nEdit: I'm just sharing a story, I didn't ask if what I did was right or wrong.\n\nEdit 2: The \"customer\" did not complain. I actually told my boss what happened and we laughed. Its okay guys. \n",
        "created_utc": 1459777503,
        "upvote_ratio": ""
    },
    {
        "title": "Damn you, wind!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d9m2w/damn_you_wind/",
        "text": "[deleted]",
        "created_utc": 1459745133,
        "upvote_ratio": ""
    },
    {
        "title": "Can't make this shit up...",
        "author": "bluePMAknight",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d98oz/cant_make_this_shit_up/",
        "text": "Before I get into this, I'm not trying to make a political statement, I don't give a fuck who you support or hate, but the political part of the story is relevant to my story.\n\n\nTL;DR CRAZY guy tries to get into my car because I was \"speeding through his neighborhood\" calls me anti-American because I have a Bernie sticker on my car.     \n\nI deliver pizza in Oklahoma for a certain company that rhymes with shizza shmut. I'm way up in the northern area of town (where all the richest people live) I'm in a hurry because I'm the only delivery driver on staff and we already have several orders. I may have been speeding slightly. No more than 7-8 over. I think the speed limit was 25 and I was in the low 30s. My bad. I'm behind a black BMW that was going about the same speed, and the guy suddenly SLAMS on his breaks. I stop, pass him, and think it's just another prick driver. (They're everywhere up here) I pass him and he starts tailing me, flashing his lights, giving me the finger, screaming something that I couldn't hear. Etc.     \n          \nI noticed he was following me so I tried to lose him but he chases me for 2 MILES, before I get trapped in a cul-de-sac and he parks his BMW horizontally in the street so my car can't get out. Next thing I know he's screaming at me through my window telling me to call the cops on myself (wat). I crack the window and (this is where it gets good) tell him to get out of my way, and that I was working. He was screaming more and I tried to drive over the curb to get away from him. But he JUMPED ON THE HOOD OF MY CAR. After that, I rolled up my windows and tried to film him, but my phone has too much crap on it. He tried to open my door, but they were locked (Thank god) I told him my name was Jeremy (it's not) and I worked for a different company and to call my manager if he wanted to complain and he believed me. (even though I'm wearing a shmizza shmut shirt and hat, and have shmizza shmut bags in my car. (Lol again)     \n     \nThe BEST PART OF THE STORY: After I asked him if I could please go he said \"I'm sure you'd like for me to let you go for free with that socialists tag on the back of your car! G** D*** anti-american!\"     \n\nAs he drove away I saw the Trump sticker and thought, \"Well, that explains that.\"",
        "created_utc": 1459738463,
        "upvote_ratio": ""
    },
    {
        "title": "Im on vacation thanks to this guy.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d7rkb/im_on_vacation_thanks_to_this_guy/",
        "text": "[deleted]",
        "created_utc": 1459715231,
        "upvote_ratio": ""
    },
    {
        "title": "Question about tipping when ordering through a service like BeyondMenu?",
        "author": "Awetumn",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d6v9g/question_about_tipping_when_ordering_through_a/",
        "text": "I've noticed when ordering delivery online lately, that a lot of restaurants are actually using a professional ordering/delivery platform run by a 3rd part (I get redirected when placing an order). I don't mind this, and it's actually pretty convienent to pay and tip online (especially when ordering as a group, and everyone in department only has twenties, or no cash at all); however, I've noticed a trend when tipping via card online...\n\nAs a rule, I ignore any delivery fee charged online for the order (as I'm not sure what percentage, if any goes to the driver, and it's usually well below what I'd feel was a reasonable tip), and when I have cash on hand, I just opt for tip on delivery  (which I note online). However, the times in which I have simply added the tip to my online order, and noted it to the delivery person when signing for my food (and, yes, I check to make sure my credit slip reflects the added charge), they ALWAYS look crestfallen - no matter the amount. \n\nI know cash is king, but is there something else shady going on with these food app/delivery platforms I should be aware of?",
        "created_utc": 1459702480,
        "upvote_ratio": ""
    },
    {
        "title": "Do you guys (&amp; gals) distinguish between residents when considering a household a \"stiffing\" establishment?",
        "author": "Awetumn",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d6qzt/do_you_guys_gals_distinguish_between_residents/",
        "text": "My friend lives with two other guys that are notorious stiffers. My friend, on the other hand, is a notorious delivery person/waitstaff sugar daddy. \n\nHe refuses to order delivery from the national chain (that continues to deliver 3 hours later than many local establishments), because he assumes his orders will be associated with his roommates', and he'll get cold pizza.\n\nWhen you guys note s****y tippers,  or otherwise difficult customers in the computer, is this info linked to the phone number/person on the account, or is my friend right that the delivery person is just going to note the address for delivery, and behave accordingly? (I acknowledge that how/if I driver penalizes serial-stiffers varies greatly among drivers.)\n\nI also just assumed after delivering to us for the first time, and being tipped appropriately, the driver would note/distinguish future orders from the same household. Am I being overly-optimistic?",
        "created_utc": 1459700605,
        "upvote_ratio": ""
    },
    {
        "title": "Tax question. Is it worth it to try and claim my mileage on my taxes?",
        "author": "heresmyusername123",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d5ia7/tax_question_is_it_worth_it_to_try_and_claim_my/",
        "text": "As taxes are coming up for this year, I'm curious how many here will claim their delivery car expenses? My delivery job is my main job and I'll be getting a decent refund regardless, but I'm wondering if I can get anything extra for my mileage? Every shift I write down how many miles I start at and how many I end at. Let's say I have down maybe 12,000 delivery miles from 2015 and receipts for some oil changes and brake work, how much of that can effect or add to my current refund? Sorry if I sound totally clueless on this, because I kinda am haha.",
        "created_utc": 1459672896,
        "upvote_ratio": ""
    },
    {
        "title": "Things customers can do to make our jobs easier",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d5d3y/things_customers_can_do_to_make_our_jobs_easier/",
        "text": "[deleted]",
        "created_utc": 1459668689,
        "upvote_ratio": ""
    },
    {
        "title": "APRIL FOOLS",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d557k/april_fools/",
        "text": "[deleted]",
        "created_utc": 1459663050,
        "upvote_ratio": ""
    },
    {
        "title": "If it's snowing sideways and you stiff your driver, I hope there's a special place in hell for you",
        "author": "hardhitsscott",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d4h67/if_its_snowing_sideways_and_you_stiff_your_driver/",
        "text": "Freak snowstorm came through tonight, complete with. 40 mph gusts. Got stiffed 4:out of 5 times. All I can say is paybacks coming, and it will be a bitch.",
        "created_utc": 1459649773,
        "upvote_ratio": ""
    },
    {
        "title": "For you ghost story lovers.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d33j2/for_you_ghost_story_lovers/",
        "text": "[removed]",
        "created_utc": 1459627957,
        "upvote_ratio": ""
    },
    {
        "title": "Whats the furthest from courteous you've been to a customer?",
        "author": "Justin33710",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d2oxi/whats_the_furthest_from_courteous_youve_been_to_a/",
        "text": "Got any good snide remarks that you've made without going over the top or full on arguing? Lets hear em.",
        "created_utc": 1459622185,
        "upvote_ratio": ""
    },
    {
        "title": "Tips and Other Small Things",
        "author": "nonamenoslogans",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4d0nlg/tips_and_other_small_things/",
        "text": "My usual standard tip was $2 for many years.  After reading your stories I decided to up it to $4 or $5 as well as talk to my delivery drivers a bit more, do small things for them (dead pen, I've got one, take it with you), and vocally notice things like clipboards and stuff. I think I've seen a definite change in service.  Thanks for this sub.",
        "created_utc": 1459582990,
        "upvote_ratio": ""
    },
    {
        "title": "Real Batman Toy: Spoiled Brat! Give Me A Slice of Pizza! 9-Year Old Refuses To Share!",
        "author": "realbatmantoy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cuwti/real_batman_toy_spoiled_brat_give_me_a_slice_of/",
        "text": "[removed]",
        "created_utc": 1459504954,
        "upvote_ratio": ""
    },
    {
        "title": "Ideas for optimizing tipping",
        "author": "StatistIdiotOfTheDay",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cqwpp/ideas_for_optimizing_tipping/",
        "text": "[removed]",
        "created_utc": 1459443374,
        "upvote_ratio": ""
    },
    {
        "title": "Florida bicycle deliveryman climbs over moving train to make delivery.",
        "author": "Fat_Head_Carl",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cqsxo/florida_bicycle_deliveryman_climbs_over_moving/",
        "text": "Not a JJ deliveryperson...can someone explain what would drive someone to take their life in their hands??? \n\nNo way: http://www.upi.com/Odd_News/2016/03/29/Cyclist-making-Jimmy-Johns-delivery-climbs-over-moving-train/4631459262753/",
        "created_utc": 1459442021,
        "upvote_ratio": ""
    },
    {
        "title": "A lucky bit of optimism",
        "author": "AvarethTaika",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cqpop/a_lucky_bit_of_optimism/",
        "text": "TL;DR (because I'm not a great writer): customer we hated delivering to moved and was replaced by a rather nice woman; all parties relieved.\n\nAs with any delivery place, we have this one place that literally no one ever wants to go to. Garbage everywhere, horrendous B.O., building falling apart, never tip more than a few cents, and to top it off they're not particularly nice people (probably due to the interpersonal tension between tenants). Well, I got to go to this lovely place last night. As another driver was gathering his order, I jokingly said, \"maybe they moved out, or maybe they'll tip!\" The other driver of course laughed at my optimism, saying that he'd be willing to bet they didn't move out. But hey, I'm more or less a happy person so I can at least hope, right?\n\nNow, when I got there, something was off. There was no garbage outside aside from one single bag all tied up and off to the side. The building was undergoing repairs. It smelled, but not as bad. Then the customer answered the door: a larger black woman who was extremely nice and tipped $2. I hadn't been here in a while so I was rather relieved, but wasn't sure if that was the same person or not (last I knew, this customer was a larger white woman with a mustache). I texted the other driver asking if the customer matched the description of the usual person. \"No way! Woulda lost that bet!\" was his response.\n\nWhen I got back, he asked if I was joking, so I described the repairs and such. I've never seen anyone so happy to know someone left! Even the boss was glad to know we didn't have to deal with that disgusting place anymore. And, I feel safer knowing the customer won't yell at me for parking on the wrong side of the building despite going to the correct door because she didn't want her mother knowing she was getting food. Like I said, interpersonal tension. lol",
        "created_utc": 1459440866,
        "upvote_ratio": ""
    },
    {
        "title": "TIFU By calling the Police on a serial stiffer",
        "author": "Erghiez",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4coylh/tifu_by_calling_the_police_on_a_serial_stiffer/",
        "text": "(Update for those interested) - Apologies for going AWOL. I had intended to update those who had taken the time to offer me their advice on the matter much earlier on in the day but circumstances tied my hands. I went down to my local P.D. to offer my statement and cooperation if needed. The Officer taking my statement had assured me that if the Officers who responded to my call had seen the same things I had seen, that the chances of my name ever coming up were slim to none. As per the law they couldn't give me any information on the incident. The whole process took less than an hour of my time and it feels like a huge weight has been lifted off of my shoulders. \n\nI was also asked to return to work today. Less so because of the incident and more-so because are are perpetually under staffed and they needed the help, but while I was there I had a chance to talk to my Store Manager and Franchise Owner who I believe had misunderstood the circumstances. I offered them a copy of my statement so they could see it in writing. They still weren't happy about it but seemed to 'accept' it. \n\nTo those concerned about the NDA or validity of said NDA; We use an NDA to 'protect' our Dough recipe and one to protect our customers identities and information. Since the issue of the NDA comes up very rarely I doubt anyone knew exactly what it contained despite every employee there signing it. So far it pretty much comes down to Dough and Customer addresses and phone numbers.\n\n(end of update) \n\n\n(TL;DR - Drug addicted serial stiffer ordered food. Was on hard drugs with children present. I called local PD upon seeing children were present. Customers relatives are sending death threats and vandalizing driver vehicles while local PD are trying to figure out who it is.)\n\nA little bit of background information is in order. I work for a company that has an insane Delivery radius. It isn't uncommon to Delivery 10 miles out making for 20 mile round trip Deliveries with an insignificant $1 per run compensation. The customer in question lives on the border of our Delivery radius. His house is right behind a local College that we service, and we only service him because the College is as far as we go which is just over 10 miles from our store. \n\nI'm not familiar with other Store set-ups but the Day shift is usually 1 driver and 1 insider until 4 or 5pm. We're usually busy the second the store opens. This of course is mostly because of our lengthy drive distances. \n\nAt any rate. I've delivered to this customer a few times and I am always met with a combo punch of Marijuana, that eggy smelling B.O., dirty diapers and cat-piss smell. Aside from that he isn't a dick at the door, just really high. \n\nUp until today the only indication that there were children living in this trolls nest was the smell of dirty diapers which I usually attributed to this individuals inability to neither wipe his ass appropriately or use a laundry machine. \n\nAfter knocking on the customers door and waiting for close to 5 minutes a child no older than 4 and wearing nothing more than a training diaper answered the door. The kids eyes were blood shot and his face was flush. He nodded his head and walked around the inside corner from where the front door stood. \n\nI could see from where I was standing the guys legs as they draped over a chair. I assume the customer had been sleeping. I didn't think anything of it. The child pushed his legs and mentioned that the 'Pizza Man' was here. A man grumbled something and strained as he exited his chair. While I was waiting I briefly scanned the rest of the surroundings.\n\nIt took me a second to register that there was a woman passed out on a couch. The color of her jeans and shirt seemed to blend into the couch upholstery, but it was also a dimly lit room. In front of this couch was a small rocker chair designed for twins. Only one spot was occupied. \n\nI'd noticed what looked like a needle protruding from the woman's arm but dismissed the notion as I couldn't clearly see, and I likely wasn't going to get a good look anyway as a man approached me. I handed him his receipt and a pen which he promptly dropped. As he bent over to grab it a small cluster of maybe 5 or 6 hypodermic needles fell out of his shirt pocket. He wasted no time picking them up and handing me back my receipt and taking his food.\n\nI spent the next 15 minutes as I drove back to my store debating on what to do. I contemplated calling the Police right then and there, but figured I'd ask my supervisors their take on the matter. \n\nWhen I got back my GM had just arrived. She was sitting in her car smoking a cigarette with our Day shift supervisor. I approached them and discussed what I had seen and asked for their input. I was immediately told that in no way, shape or form was I to call the Police, and was promptly reminded of an NDA we sign when we are hired on. \n\nThe NDA is a bit vague but I assume it ensures crew members aren't sharing personal information with outside sources. I asserted that this was a legal matter and the proper authorities needed to be informed. I was advised against it and reminded that in doing so the Customer would likely figure out that it was one of our drivers who had called and that could create an unsafe environment for the rest of our staff.\n\nI called the Police and Child protective services anyway. Right then and right there. \n\nMy boss was not pleased and immediately contacted her supervisor. I was told to go home and placed on a brief suspension until they determine if this violates our NDA agreement.\n\nNot more than two hours after I had gotten home, my boss had called me to inform me that an assumed relative of the customer contacted our store with a series of death threats to our staff. Someone had shown up and vandalized two of our drivers vehicles and so far no one was able to identify the people who had done it, nor have the local PD been able to find anyone responsible.\n\nAt this point, if I am allowed to return to work, I'm not sure I want to. My local P.D. has my information and is currently maintaining my anonymity at my request but keeps trying to convince me to file a formal report on what I had seen.\n\nUsually I ignore the fact that this guy is high as a kite when I deliver to him. Many of our customers are blitzed when we arrive. Just a part of the job. This was just the first time I had seen something of this caliber. Despite my real world concern for those kids, I won't even pretend for a second that I didn't feel the slightest bit of an asshole tingle knowing that vengeance was mine. ",
        "created_utc": 1459407987,
        "upvote_ratio": ""
    },
    {
        "title": "Gut Instinct, Situational Awareness, and YOU!",
        "author": "LabialTreeHug",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cotke/gut_instinct_situational_awareness_and_you/",
        "text": "**Scene:** \n\nMonday night, a few weeks ago. We close at 3am; the only ones there after midnight are myself and our closing manager, a fellow ovary-haver I will call H. \n\nOrders are piling up (Mondays are usually slow enough that we'll be out by 4.30 or so, sometimes 4), she's stretching dough and cutting shit up fast as can be, and I'm zipping back and forth with one bag after another and my drop box brimming with slips and cash. Customers are being told over an hour for delivery time, as our teleporter is not quite ready for human *or* pizza testing. \n\n\n2.30am and I can see the light at the end of the tunnel.  I'm on a double that isn't great, but it's just little ol' me behind the wheel, so a crappy double it shall be! Thank goodness for audio books. \n\n**Getting to the Motel 6** \n\nI had called the number for this customer before I left to let them know it was on the way and we'd not forgotten about them despite the long wait, and the lady I spoke with was very polite and understanding, and said it was no problem.\n\nI get to the room with the cash order of $18.55, and knock.\nA young (maybe mid to late twenties) man answers and seems taken aback at the total. \"Shouldn't it be free, since y'all took so long?\"\n\n\"Sorry, sir,\" I replied, my tone the cheery-but-firm that only comes from a near decade of deadening customer service. \"I don't have the authority to give discounts at the door, and the manager would have told me before I clocked out your order if there was a discount.\"\n\nAfter a few minutes of arguing, he tried the classic: \"What if I were to call up your manager right now?\"\n\nI beamed. Finally; he'd be told off properly. She does not take shit, and she sure as **hell** does not take kindly to people holding up her drivers. \"Sure! Got your phone? I'll give you the number right now.\" \nHe looked disappointed at my eagerness, and dialed. After hanging up, he turned to me and said, \"She said to just go ahead an' give it to me free.\" \n\n\"Hmm, that doesn't sound like her. Lemme try her.\" He immediately started getting his shit together (ha, yeah, you know I caught you), and H called me before I could dial her. She confirmed in no uncertain terms that he was to pay for the pizza if I hadn't already given it to him yet, and I assured her he was getting his money right now. \nAt last I have a crisp 20 in my pocket and am scurrying along to my next delivery on the other side of the zone. \n\nNow, this next bit I can only guess was from him having seen the receipt in my hotbag for the next customer, or maybe a copy fell out when I was opening it to get his food, I won't ever really know. \n\n**The Next Delivery**\n\nIt's an apartment complex with a well-lit exterior, call box, and cameras. \n\nIt also had a car idling with its lights on, facing me as I parked kitty-corner to the complex.\n\nStrange. Maybe they're just dropping of or picking up someone from the apartments. Whatever. \nBut something told me to pay particular attention to the car, and as I did, I made note of the plate, make, model, and colour. I took a glance in the cracked-open window and got a rough shot of the driver's features, giving a friendly smile and a little nod as I passed. Just your local pizza girl, no threat here!\n\nThat same little voice, feeling, whatever, told me to slow down and keep an ear out. Sure enough, as soon as I turned towards the building, I heard the car pull away and turned to see it pull up with its driver side inches from mine, and the window coming down.\n\nI drop the hotbag and sprint to the car (turns out the secret to getting me to exercise is threatening my income) in time for him to pull his hand back from whatever he was about to do to my window and roll his mostly up, and stood between his and my car, arms crossed, spine straight, adrenaline at full force.\n\nHe informs me he was \"sent\" to \"sort out\" a \"problem\" his buddy'd had with a pizza girl it seems \"owed\" him money. \n\nYears of drama class took the helm, and I told him calmly but sternly while internally flipping my shit that we carry no cash between deliveries and that I didn't bother with a change bank when out on a credit card order like this, and for goodness sake, does he *know* how many orders we get in a night? I might not even have taken it; it certainly doesn't sound like one I've had tonight! \n\nI don't know if it was my tone, posture, or just the fact that a woman had spoken back to him instead of emptying my pockets and running, but he drove off after demanding my name (I provided a fake, of course) and trying to shoot one more watch-your-back glance at me like some kind of tough guy. \n\n**A Series of Unfortunate Coincidences**\n\nCalled cops right away, made delivery while waiting for them (the guy was nice about the late time even before I explained why I was shaking so badly), and gave my statement. \nI tried to call H's phone, but no response. Left a brief message, and hopped in the car. I got a few blocks away before realizing fuck, that shithead knows where I work and has already proved he'll send someone out to threaten me at a delivery address; what if he's at the store?! Man, I hope at least one of those squads is still there!\n\nI pull an illegal uturn in front of the departing cops to get their attention and flag one over. I said \"I know I'm probably just being paranoid, but would you mind driving back to the store with me?\" He gladly agreed and escorted me back. Better call H to give her a heads-up. No answer. Hmm. :/ \n\nWe pulled into the alley behind the store, but before he left, I asked if he would mind staying just another minute while I poke my head in and make sure H is there and alright. \"I realize it's silly, but I've tried calling her a few times by now and she hasn't picked up. I just wanna make sure, you know?\" He waited there while I unlocked the door and stuck my head in to call for her. \n\nNo answer. \n\nMaybe she's in the walk-in doing inventory; we closed 15 minutes ago, that's something she could be up to. No reason to worry, man. \n\nNow, tonight it was just her and me. Two women. No one else should have been inside of the store at that time, more than 10 minutes after close. \n\nSo when I heard a **MAN'S** voice, I got right the fuck out and told the cop there was a man in there who should not be. \n\nGot in my car, locked the doors, took off the brake, ready to book it if I have to. \n\nA tense minute later, the cop came out and flashed his light at me to let me know it was safe. The man had left (I heard the door chime just as I was running out the back), and H was just fine, and more than a bit worried about the cop she heard as he announced himself. \n\nWell, it wasn't who I'd feared it might be. \n\nIt was one of our goddamned Chatty Cathy customers who won't. Shut. Up. You know, the kind whose social skills are lacking, but are harmless and just want to talk? He had been rambling about something while H cleaned and she hadn't noticed it was getting past 3, and had just gotten him out the door as I came in. She hadn't answered her phone the thrice I called because she was talking to this fucking guy. \n\n\nSooooo yeah.\n\n\nI still feel alright doing closings; I honestly enjoy this job, and feel better knowing I can apparently keep my head just enough when shit gets at least low-to-mid-level sketchy. \n\nAnd remember: it is always, ALWAYS, **ALWAYS** better to feel silly and live to tell about it than careless and dead, kids!\n\n\nEdit: Hoooly shit this was longer in writing than it felt at the time.\n\nWent through and broke up more for hopefully easier reading!\n",
        "created_utc": 1459404802,
        "upvote_ratio": ""
    },
    {
        "title": "Laziest co-employee ever",
        "author": "StatistIdiotOfTheDay",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4co1g8/laziest_coemployee_ever/",
        "text": "One of my best friends from high school became employed at the same shop as me. I refuse to call him my co-worker after what happened last week. \n\nSo the pizza shop we're both employed at closes at 10 daily. There are typically 2 closing drivers, 1 closing manager, and 1 closing insider. It's usually another driver and myself who close together, but this day my high school friend was the closing driver. \n\nFor whatever reason, we were so busy this day so that all of the drivers were on the road for basically the entire time, and all of the inside employees were busy working hard making / cutting pizzas and taking orders. Whenever this happens, the dishes and pans pile up throughout the night. Around 75% of the time we finish all of the dishes in between each delivery and the pans as soon as we get a small stack. \n\nOn this night we didn't have any time at all. In addition to this, we had a 25 pizza walk in order at 8:30 that delayed everything AND we had no closing insider. When I came back from a delivery at around 9:30 there were no deliveries up, he was on the road, and I saw a record amount of work to do. I immediately got to work on the dishes, and when he came in figured he would start the pans. We had 4 giant stacks of pans that covered the whole table. He immediately went and made 2 slices of pizza, then they came out of the oven around 9:45, and started eating them. \n\nI said something to him about how he should wait until after work until he eats, then he just went back to slowly eating it. I had to work 2x harder and didn't get to leave until 10:40. A few days later the manager overheard me talking about this with another driver and said he was about to come over and say something to him but was so angry that he couldn't. \n\nHave you guys experienced a co-worker this lazy in the past? ",
        "created_utc": 1459390404,
        "upvote_ratio": ""
    },
    {
        "title": "so you're saying if i get you're medical card i can save money on prescriptions? I heard meat lovers with extra cheese",
        "author": "calvicstaff",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cnkw5/so_youre_saying_if_i_get_youre_medical_card_i_can/",
        "text": "some telemarketer who didn't seem to grasp the concept that we are a business not a personal line, we were slow and i was bored so i started ringing up an order for him, he hung up when i told him the price\n\n(edit, inb4 wrong your, edit wouldn't change title)",
        "created_utc": 1459383072,
        "upvote_ratio": ""
    },
    {
        "title": "As a tip, would you prefer a $2 bill tip or $3 in singles?",
        "author": "fuho",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cn6mu/as_a_tip_would_you_prefer_a_2_bill_tip_or_3_in/",
        "text": "[removed]",
        "created_utc": 1459377108,
        "upvote_ratio": ""
    },
    {
        "title": "Woman calls 911 over incorrect pizza order.",
        "author": "DreamtShadow",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4ckpil/woman_calls_911_over_incorrect_pizza_order/",
        "text": "http://fox61.com/2016/03/29/woman-calls-911-to-report-incorrect-pizza-order-from-hartford-shop/\n\nBesides the usual \"eat it and claim it's wrong\" what other ridiculous ways have you guys had for customers to try to get stuff free?",
        "created_utc": 1459343871,
        "upvote_ratio": ""
    },
    {
        "title": "My car got totaled on the job tonight",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cjxm9/my_car_got_totaled_on_the_job_tonight/",
        "text": "[removed]",
        "created_utc": 1459327515,
        "upvote_ratio": ""
    },
    {
        "title": "Angry old guy at work",
        "author": "StatistIdiotOfTheDay",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cj9d1/angry_old_guy_at_work/",
        "text": "So this guy I work with is ALWAYS in a bad mood. He's gotten multiple customers calling to complain about him being rude. Anyways, earlier today he was due in for work at 10 and I was scheduled in at 11. We have a policy that states you're allowed to start delivering 5 minutes before the time you're scheduled, to avoid conflicts with other drivers. He was out on a delivery, I clock in at 10:52 and start working on the prep for the day. He flips out immediately and starts screaming \"You can't deliver I'm next!\" Then I was like \"What?\" And he kept on shouting that he was the next. I was like \"Okkkkk you're next.\" I looked at the orders and saw that there was a $150 order to a place that usually tips $20-$25. I was like \"you just want that delivery right?\" And then he was like \"I wouldn't care. I'd be next regardless.\" The order goes in the oven, then 5 minutes later we get a delivery for a salad in the opposite direction. He had to take it and I got the $25 tip. It was a good day. ",
        "created_utc": 1459311688,
        "upvote_ratio": ""
    },
    {
        "title": "Transmissions Suuuuuuuuuuuuck",
        "author": "panderpmonium",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cif1r/transmissions_suuuuuuuuuuuuck/",
        "text": "Any new drivers or soon to be drivers, please be aware that ridiculous shit like your transmission blowing out can happen. Maybe set some money aside. Change your oil, fluids, and tires, or you WILL pay the price.",
        "created_utc": 1459298450,
        "upvote_ratio": ""
    },
    {
        "title": "Whoops, my bad.",
        "author": "KodyBurns",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4cgugh/whoops_my_bad/",
        "text": "I used to deliver to this girl who was probably lesbian but I had no clue at the time. I always thought I was delivering to a dude. \n\nShe always wore basketball shorts, Jordans, and a T-shirt, had shorter hair, but still long enough to pull up into a pony tail, was on the heavier side, and talked like a man. I thought this girl was just a Samoan guy. I know a few Samoans that looked basically just like her.\n\nAnyways, one day I deliver her a pizza and she actually tipped me for the first time ever. (It was only a dollar fifty, but whatever a tip is a tip) So I said \"Thank you bro! I appreciate it.\" and went back to work and told my coworker what happened when I got back.\n\nMy coworker starts laughing hysterically and goes... Dude... That's not a guy. I immediately turned bright red. Pretty embarrassing.",
        "created_utc": 1459276942,
        "upvote_ratio": ""
    },
    {
        "title": "21 and 14 year old charged with killing delivery man for pizza.",
        "author": "Nomsfud",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4c9l3d/21_and_14_year_old_charged_with_killing_delivery/",
        "text": "http://www.kens5.com/mb/news/police-delivery-man-was-killed-for-pizza/104942636\n\nBe careful out there y'all!",
        "created_utc": 1459160048,
        "upvote_ratio": ""
    },
    {
        "title": "New to Delivery: Optimal car to drive?",
        "author": "Mandy_Harpoons1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4c9cwp/new_to_delivery_optimal_car_to_drive/",
        "text": "So I just got a pizza delivery job, starting Wednesday.  I've been putting in a lot of time researching how to increase tips and maximize the return on my time (thanks for all the great advice here!)\n\nAnyway, I got to thinking, and surely their must be a \"best\" car to drive on deliveries.  I guess \"best\" would be defined as the car that is cheapest to operate on a per mile basis taking into account for both gas and repairs.  Does anyone have an idea what that car would be?  Would it be worth it in the long run to buy a car solely for delivery assuming I planned to stay at the job for a long period of time?  \n\nMy personal car that I plan to use for the time being is an 8 year old car, that gets about 25 miles per gallon in the city, and (knock on wood) hasn't had any major problems so far, and is worth ~4k with just under 90k miles.  Some friends who know a lot more about cars than I do, say I should get another 60k miles at the absolute minimum, but it's hard to say what kind of repairs may come during that period.  My biggest concern about taking this delivery job is that repairs to my car is going to eliminate my earnings.\n\nWhat do you all think?  Should I drive my personal car or make a long term investment by purchasing a car specifically for delivering?  Obviously, I would not be interested in buying a brand new car, but if there is a 15 year old car that is cheaper to run than my current car, I'd be open to using it for deliveries.  I certainly plan to stick it out for a month or so before I make any decisions, but if I'm still enjoying this job a month from now, I would be very open to buying a new car specifically for delivery, assuming the math makes sense.  What does everyone think?",
        "created_utc": 1459153288,
        "upvote_ratio": ""
    },
    {
        "title": "Recommended wallet?",
        "author": "jkafka",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4c8ty4/recommended_wallet/",
        "text": "As I've become better at delivering pizzas, my cheapo tri-fold wallet has become increasingly more difficult to manage later in shifts when I'm carrying a lot of bills. What are some recommended wallets that aren't expensive?",
        "created_utc": 1459140129,
        "upvote_ratio": ""
    },
    {
        "title": "The one where we get pranked.",
        "author": "notanotherjack",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4c7fwi/the_one_where_we_get_pranked/",
        "text": "Today was a shift like any other; the franchise owner expected it to be busy and...it wasn't. Towards the end of my dreary and uneventful shift, midway through the late rush, we get a call. I answer, and there is a seemingly quite frantic lady on the other end. The conversation is more or less as follows.\n\nMe: Thanks for choosing Domino's, notanotherjack speaking, how can I help?\n\nLady: Hi, sorry to be a bother, but my daughter got hold of my phone and managed to place an order. Can you cancel it?\n\nMe: Sure, give me one second.\n\nI put the lady on hold, check her order number, and see where it is on the makeline. It's already entered the oven. Luckily my store manager was slapping dough right next to me and noticed my unusual behaviour.\n\nMe: We need to cancel order #. Her kid got hold of her phone and placed an order.\n\nSM: Okay\n\nI get back on the phone with the lady.\n\nMe: Okay that's all taken care of for you. Have a nice night!\n\nAnd so my shift continued.",
        "created_utc": 1459116483,
        "upvote_ratio": ""
    },
    {
        "title": "General Questions/Discussion Thread #2",
        "author": "SpyroThBandicoot",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4c6o2r/general_questionsdiscussion_thread_2/",
        "text": "Greetings everyone! We're going to be using these threads to kind of centralize any questions that anyone might have about the pizza/general food-service industry. If you're an employee, new or old, feel free to discuss tips and tricks on making jobs smoother/easier. If you're a curious customer, feel free to ask whatever you want about our line of work.\n\nAs with all posts, please follow the rules.\n\n\n***General Questions Thread #1:*** https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3z3vrv/general_questions_thread_1/\n\n***The good 'ol 'Tips for new drivers' link in the sidebar:***\nhttps://www.reddit.com/r/TalesFromThePizzaGuy/comments/1cslcp/just_applied_for_a_delivery_job_advice_for_a/c9l3ycm\n\n",
        "created_utc": 1459104431,
        "upvote_ratio": ""
    },
    {
        "title": "I got to deliver to some cops tonight.",
        "author": "universetwisters1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4c4sgo/i_got_to_deliver_to_some_cops_tonight/",
        "text": "I deliver in a spring break hotspot. College kids getting drunk left and right and getting into fights front and back. Last year it got pretty wrecked due to the spring breakers. But alas, their presence pays my bills.\n\n The last delivery of tonight was to an address on a busy road on the other side of town with the instruction \"call while en route\" on it. I give it a call and I asked them if they ordered pizza. They said \"Yes, we're the -town- police department and we're parked in the big bus outside -bank-\". So I brave my way through traffic and get over there. I knock on the side of it and one cop lets me in, evidently there was just the one in that bus. I asked him if he's there because of some hostage thing because of HOSTAGE RESPONSE or something on the side of the bus and he said nah, it was just some command center for in case a riot breaks out again and he showed off all the riot gear in the back and I said it was pretty cool.\n\nHe signed his slip and we bid one another farewell. I didn't get a tip, but I didn't mind too much because one, seeing all the cool cop stuff was enough a tip, and second my brain was as dead as roadkill that late at night. I thought it was a cool experience to break up the constant college kids and so on. And that's all I got to say about that.",
        "created_utc": 1459062274,
        "upvote_ratio": ""
    },
    {
        "title": "Be safe out there!",
        "author": "Tr2v",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4c3wml/be_safe_out_there/",
        "text": "[removed]",
        "created_utc": 1459043221,
        "upvote_ratio": ""
    },
    {
        "title": "Redditor admits to being a prick to the delivery driver.",
        "author": "xanatos451",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4c1dsl/redditor_admits_to_being_a_prick_to_the_delivery/",
        "text": "[removed]",
        "created_utc": 1459003161,
        "upvote_ratio": ""
    },
    {
        "title": "Is it that hard to call?",
        "author": "MrHandsomeBoss",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4c0idf/is_it_that_hard_to_call/",
        "text": "So the room I have for my man-cave is at the back of the house where it's difficult to hear the doorbell. Especially if I'm hosting a few people for movie night or a sports game. I always put \"call xxx-xxx-xxxx when outside\"\n\nI get a call maybe 1 out of 3 times. I usually hear the dog go nuts from the bell(another reason I prefer a call) or someone who went to bed early will get up from the bedrooms at the front &amp; tell me. A few times I've waited ridiculously long, call them &amp; hear them tell me they left after no one answered the door.\n\nI'm considering stiffing the driver next time I don't get that call. I also rely on tips for a living as a server 5 days a week &amp; 1 day a week bartending, so I am a believer in tip karma. So I'd like some perspective since I've never done delivery. Is there something I'm missing? Do the order taker &amp; driver not communicate much? Or do the people that deliver to me just suck? Am I rightfully annoyed or is there something I just don't know as an outsider?",
        "created_utc": 1458980685,
        "upvote_ratio": ""
    },
    {
        "title": "What would you do in a situation like this?",
        "author": "Howley7",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4bzc7z/what_would_you_do_in_a_situation_like_this/",
        "text": "I deliever for a really busy father and son local pizza shop and we get a lot of deliveries to a high school near by. I've grown accustomed to not receiving anything worth calling a tip and honestly don't mind going but some of the kids are a huge pain in the ass to track down. Anyway, a few weeks ago I got an order to the high school and made my way there. \n\nI always call the customer when I am a street away from school so I'm only waiting a couple minutes rather than 5. I call the customer and got no answer, left a message. I parked out front and called again and she finally answered after 5 minutes and said she was inside and making her way to the schools administration office and asked if i'd meet here, i agreed. I waited, no joke, 7 minutes for this girl. She finally arrives and by this time an easy 10 minute delivery there and back has turned into 20 minutes.  I tell her the total which was something like 16.30 and she goes, \"I only have 14, thats okay right?!\" I looked at her completely dumbfounded, said nope that is not okay, and walked right out.\n\nIve had similar instances where they were a few cents off and said it was fine, but since she made me wait so long and was more than two dollars short, i didnt have much remorse. Am I an asshole? Has anything like this happen to you guys? I told my girlfriend and my buddy and they both said they would have done the same thing.",
        "created_utc": 1458955090,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery guys of Reddit, did a woman ever answer the door nude and/or offer you a sexual favor as payment? If so, how did you react?",
        "author": "TripleDsinThisBitch",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4by6ao/delivery_guys_of_reddit_did_a_woman_ever_answer/",
        "text": "",
        "created_utc": 1458936820,
        "upvote_ratio": ""
    },
    {
        "title": "Thanks guys! I took your advice and did decent today!",
        "author": "ellamayhem",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4bvghd/thanks_guys_i_took_your_advice_and_did_decent/",
        "text": "Hey fellow delivery drivers of reddit! I've been lurking here ever since I found this subreddit a few months ago. I love it! I've been delivering pizza for almost a year now, save 2 months I was on obligatory leave due to an accident I was in, meaning no vehicle.\nAnyway, a bit ago I read about asking the customer to fill out the entire receipt, as to maybe get a tip when they usually wouldn't even write anything in. I work for a small pizza and pasta joint in the armpit of socal, and my boss bought one of two stores from the previous owner, he's only been there a little longer than I have, so he's lax on a lot of the things I read about large chains. He doesn't care if they fill out the whole receipt as long as they sign it. I get so many stiffs on cards it's insane. And when I first started working there I was told the girls don't get tipped as well..which I found out to be very true, very quickly. \nSo today, I started saying, \"I need you to fill this out and then sign here.\" *cheesysmile* it worked!! First one gave me a 6 buck tip! 5 is usually the best. Second one tipped in cash but still filled it out even tho the person who answered the door had to bring it inside to someone else. But the third, was decent..and I never usually get asked about the price raises or if the delivery charge goes to me..but this lady did and said what a shame it was. \n\nJust a little story of my appreciation! I'll go back to lurking, till the next story warrents it. Thanks again guys! :)",
        "created_utc": 1458885567,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery got shut down today",
        "author": "panderpmonium",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/4bq9v6/delivery_got_shut_down_today/",
        "text": "Weather so bad in Denver, CO they made the call. Took 1 hr 20 min to make four runs, told them i was coming back and to route me, they said no. Ironically I didn't get stuck til I was within a quarter mile of my house.",
        "created_utc": 1458794801,
        "upvote_ratio": ""
    }
]