[
    {
        "title": "Microsoft Just Won't Ship My Order",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8fg8q4/microsoft_just_wont_ship_my_order/",
        "text": "[deleted]",
        "created_utc": 1524874653,
        "upvote_ratio": ""
    },
    {
        "title": "Normally post in r/talesfromyourserver, but today, I tried to order some pizza.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8fedra/normally_post_in_rtalesfromyourserver_but_today_i/",
        "text": "[deleted]",
        "created_utc": 1524857571,
        "upvote_ratio": ""
    },
    {
        "title": "How to talk yourself out of a nice tip",
        "author": "BabserellaWT",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8fe5qv/how_to_talk_yourself_out_of_a_nice_tip/",
        "text": "Background: Hubby and I are moving cross-country, from my hometown in California to *his* hometown in Georgia. We rented an RV instead of a moving van because A) it saves money on hotels, and B) we're moving our two cats as well and didn't want to confine them to carriers for several hours at a time. \n\nWe're not towing our car behind us, because it totally died a few months ago and we've been borrowing my dad's. We sold our car for scrap and will buy a car once we get settled. \n\nOur story: Yesterday, we were in a southern state and were taking a day to see a massive space center there. So rather than drive the RV down there, we left it at the RV park and called for a driver. (She's from the company that does NOT rhyme with \"tuber\".) \n\nShe picked us up in the morning and came for us at the space center at 5. We paid for both rides in advance, along with a tip. \n\nShe was super nice and bubbly on the ride there, letting us charge our phones, engaging us in interesting conversation, etc. I made the decision that I wanted to tip her even more at the end of the ride back to the RV park, which meant her final tip total would've been around 50%. \n\nHoo boy. \n\nOn the drive home (which was considerably longer because of traffic), the conversation somehow went into the topic of how different cultures approach standing in line. In the U.K., for example, the queue is sacred; whereas in some Asian cultures, queuing is just not something that happens. (I told her about an article I'd read regarding Imagineers' approach to building queue areas in Hong Kong Disneyland, for example.) \n\nBut that's when things sorta went off the rails.\n\nHer initial comments turned into a diatribe about how, \"This is America and they should just automatically know how to assimilate with our culture.\" (What? How would a Syrian refugee child be an expert on the cultural norms of another nation?) \n\nThen...omg, y'all.\n\nShe started another loooong rant about \"those dirty Puerto Ricans who invaded us last year.\"\n\nMe: \"...You mean the evacuees from the hurricane?\"\n\nThis was also the moment when hubby (sitting in the front seat) silently sent me a text that was basically saying, \"Wtf??\" Driver doesn't notice the incredulous tone of my question and continues her rant about how \"they want treat America like it's their own country.\"\n\nIt was all we could do to keep from facepalming.\n\nMe: [out loud] \"....You *are* aware that Puerto Rico is part of America, right? This *is* their country.\"\n\nDriver goes silent for a second because I think she genuinely forgot that important little detail. She then says, \"They're not a state, they're just a territory, so they're not Americans, they're from another country.\"\n\nHubby quickly steered the conversation another direction because he could see I was about to just *unload* on this woman. I text Hubby, \"Guess who just talked herself out of her nice big tip?\" just as he sends a text that says, \"We're not giving her that big tip now, right?\" (We share a brain sometimes.) \n\nTL;DR -- Driver lady who was gonna get a 50% tip from us unknowingly lost it by going on a racist tirade. ",
        "created_utc": 1524855784,
        "upvote_ratio": ""
    },
    {
        "title": "Customer",
        "author": "alamtaohid",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8fcasy/customer/",
        "text": "[removed]",
        "created_utc": 1524841261,
        "upvote_ratio": ""
    },
    {
        "title": "Rental Car Bakery",
        "author": "UserAccountDisabled",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8f9to8/rental_car_bakery/",
        "text": "I was renting an SUV as I needed a large vehicle. I travel a lot, so I rent cars a lot, and I know it's a thankless business and they deal with a lot of stressed out people. \n\nI get to the rental place, counter person takes my info, sends me out to the lot. I get out there and two employees are laughing their heads off and are clearly, utterly, stoned. High as a kite. I know the look. And hey, who cares, probably makes the job easier. \n\nOne of them takes me to find a vehicle. She's giggling uncontrollably, having the time of her life. Laughing at anything I say. It's charming, really. \n\nTo exit the lot you get your paperwork checked at a booth at the exit gate, she decides she'll get me out a little faster by running over there and doing whatever they do herself. Still giggling. \n\nNext day I got on their web site and sent a feedback message to them, saying their service at XXX branch was great and employee [her name] was just terrific, best customer service ever. \n\nI got an email back saying the feedback would be passed on to [her name]'s manager. \n\nBecause you know - it really was great service. And in that job I'd want to be baked, too. \n",
        "created_utc": 1524813877,
        "upvote_ratio": ""
    },
    {
        "title": "\"USA #1 Search Provider\" F&lt;?&gt;H - Suite Profile Migration. An amazingly dumb Cloud Support chat.",
        "author": "occam_rzr",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8f7jh5/usa_1_search_provider_fh_suite_profile_migration/",
        "text": "[removed]",
        "created_utc": 1524788746,
        "upvote_ratio": ""
    },
    {
        "title": "Google G-Suite Profile Migration. An amazingly dumb Google Cloud Support chat.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8f6ray/google_gsuite_profile_migration_an_amazingly_dumb/",
        "text": "[removed]",
        "created_utc": 1524781653,
        "upvote_ratio": ""
    },
    {
        "title": "No Alcohol, no service!",
        "author": "Adventux",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8f6alv/no_alcohol_no_service/",
        "text": "The wife and I went to a local Chicken restaurant. due to being very busy they seated us in the bar. when the waitress came to the table,her entire attitude towards us changed when my wife ordered Iced tea. when I saw that, I made a point of ordering Iced tea as well. she took our order. My wife were splitting a dish due to it being so big. 4 pieces of chicken.  she took my salad order then turned and all but ran off.\n\nNext time I see her is after she threw the one salad bowl on our table and all but ran off. \n\nSomeone else brought our food. and noticed we were splitting it so went and got another plate.  then she went and got us a plate and more green beans and another dinner roll, cold. she did not refill our drinks. she did not run our bill. \n\nHowever the tables that ordered alcohol she was at all the time, giving them great service.\n\nFor the record I was going to order a beer until her attitude changed.\n\nAll because we did not order alcohol.",
        "created_utc": 1524777785,
        "upvote_ratio": ""
    },
    {
        "title": "Plumber decides to charge me $2000/hour",
        "author": "experiencethrowit",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8f4jum/plumber_decides_to_charge_me_2000hour/",
        "text": "My wife and I both work insane amount of hours and have two small kids and recently moved to an old house. The house is old and we expected to have issues with it and every now and then we do. I'm handy with some things but don't have the time to get into what I would consider to be large repair projects at home so I hire professionals to do the work.\n\nWhen I'm picking someone to work with, it is very important to me that they answer calls and are reliable.  I'll be willing to pay significantly higher than average prices for someone like this.\n\nThere is a plumbing and heating company I use, which are pretty famous in northern NJ. You call them up, a guy shows up in clean, neat clothes, acts like a professional, listens to your problem, identifies an issue, **finds a price for it on his big book of all possible plumbing issues**, if you agree he does the work at the quoted price and the work is guaranteed. I'm sure if I looked around and spent time on it I could find another plumber to do the same job at a much lower rate. Perhaps even at half the price, but I don't care because these guys do the job right and on time and it is easy for me. I've used this company a couple of times and I'd rate them A+.\n\nA week or so ago I noticed some slushing noises in the floor of our bathroom and I assumed the toilet bowl got dislodged or something and each time we flush there is a minor leak that seeps into the wood. Annoying, but no problem, I'll call the company up and have them fix it. We have some other major plumbing work that needs to be done, and I decided to get all of this done at the same time.\n\nThe guy comes over. Looks at the leak. Goes downstairs to the basement. Back upstairs. Pokes around a little bit and then comes up with a story about what probably is going on. He mentions broken pipes, that he has to cut open the walls, this and that. I ask him if he's sure and he says he is experienced and is 98% sure it is as he described. He opens his **big book of prices** and does some calculations and comes up with a price of ~$3,000. It's a shocking price tag but I trust this company and this has to be fixed so I agree to the price. He says its such a big job that we have to reschedule to an early morning and he will need multiple people from his company to help him. The total price for all of the jobs we agreed to is about $8500 with the leak being the most pressing.\n\nWe schedule to today.\n\nHe comes over by himself and before he starts the work, I ask him if the job turns out to be easier than he expected would I still have to pay him the full amount. I remind him that he said that there is a 2% chance it might be something simple. \"Of course, we'll knock the price down\" he says.\n\nHe gets to work by himself, takes the toilet bowl off, identifies that the flange needs to be replaced, replaces it. Puts the toilet back on and is done in 1 1/2 hours. No cutting the walls, no replacing pipes, no leak investigation, nothing.\n\nI reminded him that he said he would reduce the price if the job was easy and I tell him I think the job is easy. He said he would reduce the price by $400. I said I'd be willing to pay $1500 which is very generous. He said his manager would never agree. I asked for a price breakdown of the $3,000 and that I wanted to match those prices to the book. He said that the customers are not allowed to see the book and he refused to show it to me. Now, I worked with this company many times and this book as a part of their sales material. They used it to justify their high prices. \"Sorry the book says it costs $400\". I was pretty sure I was getting fucked but that made it certain for me. I cancelled the other work and told the guy to leave. He left me an invoice for $2600 (he gave me a $400 discount).\n\nI called up the company and talked to the plumbing manager who told me the price to change a flange is $460 in the book and that is what the company would charge me. He also said the company policy is to show customers the book and that he would have a talk with the plumber to understand why he didn't show me the book.\n\nThe manager fixed things for me but I was shocked that their employee would behave this way. I told the manager they could continue to work on the other projects but that I didn't want to work with the original plumber they sent me.\n",
        "created_utc": 1524764292,
        "upvote_ratio": ""
    },
    {
        "title": "Today my friend was threatened by domino's staff for complaining about the pizza.",
        "author": "Werewolf1996",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8f3i06/today_my_friend_was_threatened_by_dominos_staff/",
        "text": "[removed]",
        "created_utc": 1524756376,
        "upvote_ratio": ""
    },
    {
        "title": "Clueless alarm-technician tries to take me for a scripted ride",
        "author": "gertvanjoe",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8f1k2v/clueless_alarmtechnician_tries_to_take_me_for_a/",
        "text": "So my alarm system started acting up and send low voltage (AC/DC failures) to the control room. \n\nI am an electrician ( with UPS experience) so naturally I poke around inside the panel a bit. Ok the battery isn't charging. Poke around some more, ok the power supply is shot. Make note for next time I'm at the hardware store. Take battery out, charge it so the control room can shut up for a while. \n\nThe supply transformer is a DB mount C-Rail supply so it's not something just laying around on normal hardware-store shelves it seems. O well, have to wait till next time I'm in the city. \n\nControl room calls gets more and more frequent ( yup I'm easily annoyed(battery likely on its way out because of the frequent deep discharges (standard 12V Lead acid geld battery))) so I end up telling them to come fix it and charge me then. For the interim I take out my gate motor battery and put it in there so the tech can at least rule out the (now dying really fast due to hurting badly from several deep cycles as the crappy panel does not switch of on a decent discharge voltage but just keeps going till it can't no more) \n\nTech arrives while I'm not there (wife is at home) and after \"poking\" around tells her it's the battery that died. I told her what I saw and did so she tells him to call me. \n\nAT ( alarm tech) : Hi sir your battery is dead\n\nME (playing totally clueless): O ok, how do you know\n\nAT : It's only measuring 11V and it should measure 12\n\nME : Interesting. So how do you know the other parts are fine\n\nAT : The battery you have in there is a really low quality battery and we will have to replace it with our high quality gel based battery\n\nME : And how much will this cost\n\nAT : The price is 4x ( where X is the price of a normal 12V 7 Ah battery at the store) and the installation will be Y. \n\nME : ( having had enough ) Listen here Mr Alarm tech. I took the battery out of my gate motor 2 days ago and put it in the panel to prove to you it's not the battery. If you went through the trouble of measuring the DC_IN connections you will see it's dead too. I don't have time to buy a DB mount transformer now and whoever installed the panel though it wise to run the DC to the panel halfway across the house with alarm panel wire so I cannot use the wiring to supply AC to the panel and then install a transformer. I also don't feel like ripping out stuff and drill holes to install new wiring now. \n\nYour \"high quality battery\" is going to die again in 4 days due to nothing charging it.  \n\n----------------\nHe hands the phone to my wife and according to her is visible upset and slams the panel door and my cupboard door where the panel was installed in. I say goodbye to my wife and call control room, report his behaviour and cancel my contract with the company. \n\nThe real kicker was that the very same guy had to come and remove the company's radio unit from the alarm panel. I simply introduced myself as \"the guy you talked on the telephone 3 days ago\" and watch him go beetred",
        "created_utc": 1524737862,
        "upvote_ratio": ""
    },
    {
        "title": "Salty Food",
        "author": "Distinct_Wishbone",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8ewonm/salty_food/",
        "text": "[removed]",
        "created_utc": 1524687168,
        "upvote_ratio": ""
    },
    {
        "title": "Free Food Made My Day, too ...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8euwyo/free_food_made_my_day_too/",
        "text": "[deleted]",
        "created_utc": 1524673763,
        "upvote_ratio": ""
    },
    {
        "title": "Caught the Airline in a Pickle of a Lie",
        "author": "b_imarb",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8eun6v/caught_the_airline_in_a_pickle_of_a_lie/",
        "text": "[removed]",
        "created_utc": 1524671743,
        "upvote_ratio": ""
    },
    {
        "title": "Free food made my day",
        "author": "crazybitch19",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8ervpf/free_food_made_my_day/",
        "text": "I was reminded of a time when I was the lucky recipient of free food and thought I would share the story that brightened my day.\n\nSo I went to a popular sub shop with my SO, one of my favourite places to eat out. I've discovered over the years that when ordering it's easier to say what I don't want than what I do. So I make my order, as does my SO, and we move down the line for our subs to be made.\n\nI've mentioned before that I have pretty bad social anxiety, it came in to play here. So I watched as the guy making my sub added the dreadful, disgusting, despicable, unwanted topping. It's no secret I don't like confrontation, and I had no problem picking what I didn't want off, so I didn't mention it to sub guy.\n\nWell he must have noticed the look on my face and realized his mistake. He immediately started apologizing profusely and picked off every last trace of the unwanted topping, offering to make me a new sub. I was reassuring him that it was fine, I didn't even need him to pick them off. Heck, my SO was distracting him while he was making the sub by talking about a local accident that had just occurred... It was an innocent mistake, no big deal.\n\nOnce we got to the cash our total came to around $7.50, half of what it should have been. He didn't charge for my sub at all, insisted that be the case. Free food yay! \n\nThis happened a while ago, and I have returned to the shop many times since. Unfortunately the guy does recognize me every time I go in, and remembers this 'incident'. On a positive note he has made my subs perfectly ever since, you rock sub guy!",
        "created_utc": 1524643246,
        "upvote_ratio": ""
    },
    {
        "title": "Hotel I'm at advertised high speed internet but doesn't have working internet.",
        "author": "SoSpursy",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8epnwv/hotel_im_at_advertised_high_speed_internet_but/",
        "text": "I am at a popular very large hotel chain. I stay at this same hotel once every 3-6 months for a week. Last time I was here was six months ago and their internet was down. It was frustrating but they had been good to me before so I stuck it out. They told me that they were having issues that management was in the process of taking care of in the next couple of weeks.   \n  \n  I'm back again and the internet is actually even worse. Some devices won't connect others connect but won't load webpages. I spoke with the on duty manager and he said that they have just recently rehired all new management because the old ones didn't take care of problems such as this. They are now in the process of replacing their internet and it will be good in the next couple of weeks. I will be speaking with the general manager tomorrow and I don't really know what to say. I will be here another 5 days. I am here with my toddler son and we have already set up the room with all of his toys and made it a temporary home away from home. I don't want to move to another hotel, it will really be a pain. I was planning on getting work done while I was here, watching movies on Hulu, and Skyping with family. They advertise high speed internet, I feel like I should be compensated for this. Like I said, I don't want to move now I'm here, but I'm not getting what was promised. And advice on what I should say?",
        "created_utc": 1524618484,
        "upvote_ratio": ""
    },
    {
        "title": "The day they got an ice cream shake they didn't ask for",
        "author": "quackgunner",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8enbjp/the_day_they_got_an_ice_cream_shake_they_didnt/",
        "text": "Note: ice cream shake is an anonymous name for a food item sold by a fast food chain.\n\nA few months ago, my parents came home with an ice cream shake. Now, this is odd because they are on a low carb, high fat diet (and have been for months). It was also odd because they don't partake in fast food like I do, even if they could go with bread-free options for burgers.\n\nRegardless, it was some time later when I learned the reason for it.\n\nThey went through the drive-thru to order a 50 dollar gift card. (Dear fast food employees, do you prefer if people buy gift cards in store or through the drive-thru? Just wondering. They were wondering too). It was 9 o'clock at night, so it was basically empty. The employee, at hearing the 50 dollar gift card order seemed to freeze up in confusion. There was stammering, mostly inaudible, followed by a \"will that be it?\"\n\nAnd then, the funniest part: \"Your order is 1.49 (made up price, it was a dollar and something, but can't remember), please pull up to the next window.\"\n\nIn confusion my parents pulled up to the next window, wondering if he had said the wrong price by accident. Nope.\n\nHe rang them up for a chocolate ice cream shake, and here they ran into employee #2. He was trying to hand them a chocolate ice cream shake, and my dad said we had ordered a 50 dollar gift card, and NOT an ice cream shake. \n\nEmployee #2 looks really confused at this. They don't have 50 dollar gift cards. They have 20 dollar gift cards, though.\n\nCue some rushing around and back and forth between the two employees, in which they were trying to figure out how to remove the chocolate shake from the total and add two 20 dollar gift cards. \n\nThankfully, there was no one else in the drive-thru line as they proceeded to try it out for a couple minutes, in which things were merely weird and confusing and neither of them really knew how to run the register. I will add there was no yelling or screaming or anger involved. \n\nEventually my dad said \"we'll just take the shake AND two 20 dollar gift cards\" and that was that.\n\nI found it funny when they told the story and just plain weird. I can only guess they were new employees who probably should have had someone else supervising, but it worked out in the end.\n\nCan't go wrong with a chocolate shake.\n\nSo nothing special in the story, I just found it funny so I thought maybe some of you would find it funny too.",
        "created_utc": 1524599029,
        "upvote_ratio": ""
    },
    {
        "title": "Broke my heart",
        "author": "WriterOfRomance",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8emftn/broke_my_heart/",
        "text": "Was waiting patiently for a dining court employee to refill the food I wanted, not saying a word. And, when she sees me, she rushes to refill the item I wanted, apologizing for keeping me waiting. I assured her it wasn’t a problem and she thanked me for not yelling at her.\n\nI was horrified at how afraid she was. Clearly, she had been yelled at before. The very idea that someone would yell at this sweet lady made me want to cry. How are people so rude?",
        "created_utc": 1524592460,
        "upvote_ratio": ""
    },
    {
        "title": "Do you have any white friends?",
        "author": "IAmA_Wolf",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8ej03f/do_you_have_any_white_friends/",
        "text": "Warning: racism is mentioned in this post. I'm terribly sorry if anything here offends anybody. I am just sharing my outrage. (This story happened a few months ago)\n\nA new second-hand clothing store opened up in town, so I thought I'd pay it a visit one afternoon after a haircut. I had been browsing for a few minutes, when the owner approached me. A male, about 50 years old, with a creepy and intimidating demeanor. It takes about 2 seconds for his small chat (\"Thanks for coming in to my new store! Nice day, huh?\") to turn... weird.\n\n(Mind you, I'm a female in my mid-twenties)\n\nHim: (rambling) So, how old are you? Do you live close by? Do you work, what do you do?\n\nMe: Uhh, yeah, I live in town and have a full-time job\n\nHim: I'm looking for a nice young girl to work in my store. Do you have any friends who might want a job?\n\nMe: (utterly creeped out) Uh, maybe, if I think of somebody I'll let them know\n\nHim: That would be good. Just make sure they're white\n\nMe: (HOLD THE FARK UP) Ummm, what do you mean, *make sure they're white?*\n\nHim: (Obviously unaware of why I might be asking this question) Oh, you know, people in a small town like a nice white girl to be serving them, I'm sure you have some nice friends\n\nMe: You can't say that\n\nHim: Say what?\n\nMe: You're saying you'll only hire *white* people? That's racist and discriminatory, not to mention illegal. Are you serious? (I didn't even mention the sexism)\n\nHim: (hesitating and stumbling over his words now) Oh, you know what I mean, a nice girl... I don't like the girls who can't speak english well, the Asians and Europeans and Indians... They can't understand customers and their accents are hard to understand... I need somebody who is from a small town like this one...\n\nMe: I think you might want to hire somebody who can *speak english*, but you can't discriminate based on nationality. So, what about my Asian girlfriend who speaks english perfectly? Could she get a job here?\n\nHim: Uhhhh, well, is she looking for a job? I don't know.\n\nMe: Seriously, you can't say that you \"only want to hire nice white girls\", that's disgusting and racist.\n\nSo then I left with him rambling and trying to apologise and keep me in the store. I wish I'd told him that I would be telling every single one of my \"nice white friends\" never to shop there, but I was too stunned and didn't want to be in his creepy presence for any longer.\n\nOh, and I have told everybody I know about what happened. I don't think his business will last long here. We do live in a small country town, and I'm sure I'm not the only one who has experiences his racism.",
        "created_utc": 1524560311,
        "upvote_ratio": ""
    },
    {
        "title": "The checkout lane’s town crier",
        "author": "Goodeyesniper98",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8ehqj0/the_checkout_lanes_town_crier/",
        "text": "I often go to a popular chain outlet store with my mom and aunt. The checkout line is all one line and then it splits up between different checkout lanes. Almost every time I’ve been at checkout, they have a woman my aunt and I have dubbed the “town crier”. She’s an older woman that works at the store who will position herself near checkout with a cart of random clothing items and will yell and “hype up” the checkout line while trying to sell extra last minute items. She’s extremely loud and annoying and will shove random items in your face trying to get you to buy them. I went with my mom and aunt yesterday and the town crier was there as usual. I ignored her and was chatting with my aunt. At one point I turn around to say something to my mom but instead I find the Town Crier about 5 inches away from my face, waving a women’s blouse in my face and screaming “ISN’T THIS CUTE!” I gave a startled yelp and I fell backward into a rack of overpriced candy, almost knocking it over. I wanted to tell her not to sneak up on people but by the time I got up she was already terrorizing another customer. I’m a young adult male who almost exclusively wears heavy metal t shirts and I have absolutely no idea why she was waving a women’s blouse in my face. ",
        "created_utc": 1524543439,
        "upvote_ratio": ""
    },
    {
        "title": "If you work in customer service, what are your biggest pet peeves?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8egqym/if_you_work_in_customer_service_what_are_your/",
        "text": "[removed]",
        "created_utc": 1524533547,
        "upvote_ratio": ""
    },
    {
        "title": "Local thrift store policies encourage the sales associates to be absolute dicks to people.",
        "author": "QuantumDrej",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8efw4s/local_thrift_store_policies_encourage_the_sales/",
        "text": "I've shared this elsewhere before, but I thought it might be okay to throw up here.\n\nThere's a really big thrift store in my area, bigger than any of the Goodwills and often has better stuff.\n\nAs of the past couple of years, they've not only been hiking prices, but have introduced somewhat draconian policies to go with it.\n\n**If it doesn't have a price, you can't buy it.**\n\nPreviously, if an item didn't have a price, they'd give it to you for 99c. Nowadays, if the item doesn't have a price tag, they don't let you have it at all. Now, this would normally be a good policy to deter people from trying to remove price tags or pretend \"it fell off\", but the problem here is that they don't even let the people have it who are *offering money*.\n\nI've also seen them take items from customers if they realize it doesn't have a price. A woman searching near me on the same aisle one day asked a passing sales associate if the hair straightener she found had been tested. The sales associate looked at the item and told her, but then took another quick look at the item and said something like, \"Oh, this isn't priced, I have to take this,\" and walked quickly away before the woman could say anything. Isn't the first time I've seen them be that abrupt, either.\n\nAt the register, they automatically take things from your pile on the counter and toss it into a bin to be repriced and will not negotiate a price for the item whatsoever. Even things like cheap kids' toys get this treatment, even if the parent is literally offering several dollars more than what the item is worth just to avoid having a crying child on the way home. Some people have just left all of their items at the counter and left in anger at this policy.\n\n**If the bag is opened, you can't buy it.**\n\nThis one makes the least sense to me. They pack some items in flimsy plastic bags with prices on them. The policy is if the bag was open, you can't buy it. Yet people who genuinely offer money for the full price of the bag are denied. Another theft deterrent, I suppose....but people are offering money. And again, some are offering more than the item's worth. That's not something a thief would do, especially if they have other items they're paying for. \n\nAnyway, the people who actually fill the shelves and whatnot seem nice. It's the managers/sales people who are kind of rude about what items you can buy and which ones you can't. ",
        "created_utc": 1524525455,
        "upvote_ratio": ""
    },
    {
        "title": "[CROSS POST] The time I was so flustered I nearly walked out without paying.",
        "author": "ithomasina",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8edncs/cross_post_the_time_i_was_so_flustered_i_nearly/",
        "text": "[removed]",
        "created_utc": 1524507585,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting experience with adidas customer service!",
        "author": "DropRollSports",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8eba19/interesting_experience_with_adidas_customer/",
        "text": "[removed]",
        "created_utc": 1524488605,
        "upvote_ratio": ""
    },
    {
        "title": "Skip the dishes is amazing.",
        "author": "fuccforsucc",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8e84rv/skip_the_dishes_is_amazing/",
        "text": "[removed]",
        "created_utc": 1524449938,
        "upvote_ratio": ""
    },
    {
        "title": "Those are not free samples",
        "author": "Moglo825",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8e4nab/those_are_not_free_samples/",
        "text": "I was trying on sunglasses the other day looking in one of those little mirrors, when a lady comes up to the mirror beside me with a handful of makeup. She proceeds to try on two different shades of lipstick and some eye shadow before dropping it all back in the discount bin and walking away. Disgusting! She probably stops there every morning before work to do her face. ",
        "created_utc": 1524417382,
        "upvote_ratio": ""
    },
    {
        "title": "A Sincere Request",
        "author": "StainedFingers",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8e1bw5/a_sincere_request/",
        "text": "[removed]",
        "created_utc": 1524374639,
        "upvote_ratio": ""
    },
    {
        "title": "Thanks Local Fast Food Breakfast Place",
        "author": "soon_to_be_something",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8e0sgf/thanks_local_fast_food_breakfast_place/",
        "text": "I went to a Local Fast Food Breakfast Place (LFFBP) with a large group last week. Large groups are always difficult and we had one waitress for the 30 some of us sitting at one long table made up of a bunch of 2 and 4 seat tables pushed together. \n\nAs it is with big groups all the food came out at different times. I had the “Southwestern Scramble” or something like that, basically scrambled eggs with cheese, salsa, and avocado on top.  It’s LFFBP so you can’t expect super high quality food, but it’s cheep and filling. The cheese seemed to be the cheese you can get from the grocery store in a bag (pre-shredded) and the salsa was also mediocre. What was really incredible was the avocado. \n\nYou know how it’s hard to catch an avocado at the right time so it’s ripe? This one was perfect. It was the right amount soft and very flavorful. It was literally the best avocado I have ever had in my life. \n\nSo thank you LFFBP for letting me have that, it was the best part of my day!",
        "created_utc": 1524367667,
        "upvote_ratio": ""
    },
    {
        "title": "Another Awesome Fast Food Worker",
        "author": "DuckyFluff",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8e04j3/another_awesome_fast_food_worker/",
        "text": "If you read my last post, you know I eat out way too much.\n\nDifferent local fast food chain this time. Ordered some food to go for the wife and I, got home to realise one item was missing.\n\nReturned to the store, receipt in hand and that cashier recognized me immediately and asked about the forgotten item, which was apparently sitting up by the hot shelf(??warmer??).\n\nTold her it was no issue, they offered to make me a fresh batch but I declined, was given a coupon for any free sandwich.\n\nAround 10 minutes from ordering to returning home the 2nd time so no big deal, definitely appreciate the coupon. You rock.",
        "created_utc": 1524360119,
        "upvote_ratio": ""
    },
    {
        "title": "Bike shop employee refused to help me, even after I tried to pay him for a 30 second task.",
        "author": "Catsdrinkingbeer",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dwjaq/bike_shop_employee_refused_to_help_me_even_after/",
        "text": "[removed]",
        "created_utc": 1524325568,
        "upvote_ratio": ""
    },
    {
        "title": "Called out for using a child ticket!",
        "author": "M90Motorway",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dvtvv/called_out_for_using_a_child_ticket/",
        "text": "This happened last year on the underground. I was on a train carriage with four other people, me and one friend at one end and her friends at the other end. This was on a school trip and we were all given child tickets from the company running the underground. At one stop a ticket inspector got on and asked me for my ticket. She saw my ticket and started asking me questions such as where I was traveling from. I was a bit confused but answered all her questions. She then said that I was using a child ticket but was too old for it (I was 16, almost 17 at the time). She took me and my friend off at the next stop leaving her two friend on the train. At the station another inspector asked if we were in a group. This is because they usually just give child tickets to groups. I told them I was and they both apologised for splitting us up from a friends and asked us if they knew where we were going. We said we were fine and went on our way, getting the rest of out friends at our destination. I understand that the ticket inspectors were only doing their job and hold no hard feeling against them!",
        "created_utc": 1524318376,
        "upvote_ratio": ""
    },
    {
        "title": "Complaining and swearing about a free breakfast",
        "author": "meminemi",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dtrln/complaining_and_swearing_about_a_free_breakfast/",
        "text": "Hate to share negative stories but this just blew my mind. Also first time poster and English is not my first language!\n\nA few months ago I stayed in a hostel in Hanoi. It was a really nice place and amazing value for money; free breakfast, free beer for one hour at night, and free walking tours &amp; pub crawls, all for just 5 euros a night. \n\nSo one morning I was enjoying my free breakfast when this Rude Backpacker dude came in to ruin the atmosphere. They had a small menu where you could choose (!!!) which breakfast you preferred. It mentioned they all came with some fruit and unlimited coffee and tea. This guy comes in and orders with a lot of loud swearing. Probably fotgot plenty of swearing in this convo.\n\nRB: Shit they only have pho (Vietnamese soup) or toast. I hate the fucking beef in pho. \n\nHe proceeds to order whatever.\n\nRB: And can I get some juice with it?\n\nHostel Girl: For juice you have to pay extra, but we have unlimited coffee and tea!\n\nRB: Oh for fucks sake, so what is the cheapest drink I can order?\n\nHG helps him with the drink order.\n\nRB: On the menu it says its with fruit, I want an apple.\n\nHG: Oh they all come with a banana!\n\nRB: Jesus, alright, banana it is.\n\nSo he finishes up this order with more swearing. A little later and he receives his food. Apparently they forgot his banana and he lets the whole room know with more swearing and being a dick about it. I was feeling so ashamed towards the staff considering these were all extra services on top of the low price we paid.\n\nI've seen so many travellers complaining about the costs in countries where everything is extremely cheap, which just doesn't seem right when you're a rich white person travelling in a poor country. Craziest thing must have been the backpackers begging on the street to get funded for their world travels. (but I guess that's a whole different story)\n\nWhat I'm trying to say is, I guess, acknowledge your privelige and don't be a dick in a country where you're a guest.\n",
        "created_utc": 1524287552,
        "upvote_ratio": ""
    },
    {
        "title": "Freo X Cashplek Good Morning Official Video @NegledPro",
        "author": "negledpro",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dslsv/freo_x_cashplek_good_morning_official_video/",
        "text": "[removed]",
        "created_utc": 1524273599,
        "upvote_ratio": ""
    },
    {
        "title": "Paranoid grocery store rando decides that my sister and I are following him",
        "author": "KitchenSwillForPigs",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dpsqk/paranoid_grocery_store_rando_decides_that_my/",
        "text": "I don't know about you guys, but every time I hear the phrase \"I love to mess with people,\" I immediately assume that whoever is talking belongs in a post from iamverybadass or iamverysmart. I do not go out of my way to embarrass or confuse random strangers. However, my sister and I are generally in agreement that if someone acts like a dick in public, we're not going to bother being polite in return, and may even fuck with them a bit, if the occasion calls for it. \n\nA few weeks ago, my sister and I walked into our local grocery store in pursuit of a simple mission: cheese and elbow macaroni. We walk in and immediately head for the pasta aisle. The cheese aisle is against the far wall beyond that, so it's a pretty easy trip, and we're in and out in less than five minutes. \n\nWe grab our noodles, and we're about to cross an aisle to the cheese when an ~~elderly~~ older man appears. We stop to let him pass and he makes eye contact with me, so I smile. He immediately starts muttering to himself: \"Fucking bitches, following me around. I'm so goddamn sick of it. Stupid fucking bitches.\" mutter, mutter, mutter. \n\nFirst of all, as I said, we had literally been in the store for four solid seconds. Second, I had never seen this dude in my entire life. Third, why the ever loving fuck would two women in their early twenties follow a five foot tall, middle aged man with protruding nose hairs around the grocery store?\n\nI intended to ignore it, but my sister spent a few years in Manhattan and came back to the southwest considerably more spicy than she had been when she left. She lets out this laugh, this sitcom-y, perfectly executed, belly laugh. He looks aghast. Either he thought we couldn't hear his insults and name calling from two feet away, or that we would never dare draw attention to it. She looks him dead in the face and says \"No,\" as if she were responding to the most ridiculous, outlandish question ever asked. \n\nThe dude turns bright red and starts to skitter away. Unfortunately, he's going in the same direction we are. He keeps glancing over his shoulder, clearly pretty embarrassed. Every time he does, my sister just keeps eye contact with her eyebrows raised in a way that said \"You feel like a dumbass now, huh?\"\n\n At last we have our cheese in hand and depart. It was so surreal, I thought I'd post it. I cannot fathom what would make this dude believe that we were stalking him through the grocery store, to the point where he needed to insult us multiple times. ",
        "created_utc": 1524248496,
        "upvote_ratio": ""
    },
    {
        "title": "When Customer Service makes your mom cry...",
        "author": "StefMcDuff",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dp3xw/when_customer_service_makes_your_mom_cry/",
        "text": "Last week, my mother and I went to a very well known bra store that tends to advertise with the skinniest models they can find to find some bras for my wedding coming up in May. I only recently started shopping here, and the quality and customer service had been awesome for me- so I wanted her to get fitted and find a good, comfortable, quality bra for the wedding.\n\nMy mother is a bit larger than average. (She's lost 13 pounds in the last month though! So proud of her!) She wholeheartedly believed that women of her size couldn't shop somewhere like this. I told her about my experiences and she was willing to get sized and see if there was anything that might work for her.\n\nSo, we go in and I immediately tell the associate what I'm looking for (my size, and the fact that I need a multiway bra that can be used with a halter dress) and she directs me to where they are and helps me find my size. I grab two different ones so that I can try them on and see which one fits best. \n\nI then introduce my mom to the associate and let her know that she needs to be sized and we're looking to get her a bra or two after, if she finds something that's comfortable. She directs us to their \"bra specialist\" who does all the sizing.\n\nShe pulls my mom back into the fitting area while I try on the bras I pulled. I can hear mom talking to her and explaining about my wedding (the BS called out and said congratulations) and how she's never been sized before and how she didn't think someone like her could shop in this store. I hear her tell the specialist \"I hope you don't get too grossed out having to see all my fat,\" while she's getting sized.\n\nThis AMAZING bra specialist told my mom that she was beautiful. That she was absolutely perfect the way she was. After getting her measurements, the BS went and got a \"try on\" bra to see how it fit on my mom. She made comments to my mom about how she didn't need anything that's going to make her look fuller, just something with a little lift. Mom tried it on, the BS asked how it felt- told her that it looked fantastic on her.... \n\nAnd mom started crying.\nHappy tears.\n\nThis amazing young woman boosted my mothers self esteem SO MUCH that day. (there was a lot of conversation that I didn't capture here, but every time my mom would say something about how she didn't like the way she looked, this gal flipped it around on her and complimented her)\n\nShe explained that unfortunately, they didn't carry her band size in store, but that the girl at the register could help her order online to get the same bra she just tried on. AND if she needed it sooner than it could be shipped, there was another (non-them) store just down the way that carried her size in store.\n\nMom ended up picking out two bras from their online store with this girls help. (She even got one in her favorite color!!)\n\nI ended up calling the next day to talk with her manager and HEAPED the praise on. Coming out of that store, my mom was a completely new woman. She told me before we left \"I never would have thought that someone like me could come here and get a bra that fits right. And that they would be so nice to me!\"\n\nEdit: I called corporate today and they said that the compliment will go up the chain at corporate and then down to the district manager then back to this lovely young woman! I also left an online review for her as well! And last but not least, I'm getting the receipt from my mother today so that we can fill out the survey for her as well!\n\nThank you all so much for the kind words!! My mom is my best friend and seeing her so happy and confident was amazing!",
        "created_utc": 1524243222,
        "upvote_ratio": ""
    },
    {
        "title": "Would you like a table or booth?",
        "author": "mcbride-bushman",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dmtz8/would_you_like_a_table_or_booth/",
        "text": "So awhile back I went to a local franchise of a restraint chain, and normally before they seat you they ask table or booth but not that night\nAlso this restaurant doesn’t do reservations\n\nG= me \nH= hostess\nM= Manager\n\nSo she asks us how many (4) and takes us to the back seating area, she starts to lay our menus down on a table, but my dad works construction and has for the past 30+ years so it’s better for him if he has a booth.\n\nG- I’m sorry but can we have a booth?\n\nH- uhm, I’d have to see if any are open.\n\nG- so how were you supposed to know if we wanted a booth or table?\n\nH- we sit you at a table unless you ask for a booth\n\nG- ok, what about those 2 right there?\n\nH- I don’t think so, I already wrote you down for this table.\n\n(At this point I motioned for them to just sit at the booth) \n\nG- ok well can you change it to a booth?\n\nH- I’ll go look\n\n(At this point I was done with the hostess and I understand you have to distribute customers evenly between the zones so that your waiters get paid but still if I ask for a booth with open ones right next to us I don’t see why that’s a problem) \n\nSo the manager walks past\n\nG- excuse me but we would like a booth, but we were never asked our preference and there’s this booth here that’s open?\n\nM- I’m sorry, you can go ahead and sit there.\n\nAnd that’s about it, like I stated earlier I understand equally distributing customers but when I ask for a booth when there’s plenty of open booths I see no problem, but what is y’all thoughts?\n\nTL;DR hostess doesn’t ask about our seating preferences and then makes it seem like a problem, and then manager makes it seem like it was never a problem",
        "created_utc": 1524223494,
        "upvote_ratio": ""
    },
    {
        "title": "Finally someone who can identify competent users",
        "author": "FabianRo",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dm2g9/finally_someone_who_can_identify_competent_users/",
        "text": "I read a lot in r/talesfromtechsupport recently and I have quite a bit of experience of supports going through a long first level support with me first before finally talking like I'm not an idiot. So I expected something similar when I contacted my laptop manufacturer. But...\n\nBackground: I bought a new laptop (actually two, because the first one just wasn't delivered at all) and it has an operating system on it that is meant to be temporary and I definitely want to switch it for some other Linux version anyway, because for example I can't even install programs from the console.\n\nSince the laptop is tiny, it has no CD drive, so I have to create a boot medium myself. Trying SD card: Sadly not. Trying to find a USB stick: There aren't any left. Once I had about 20, but they like to disappear/not be given back. So my father brings one of those giveaway sticks in a business card his company has. I try to put the OS on it and get \"security boot failure\" when trying to start. I try to put a different OS on it using a different program, I get \"corrupt LZMA\". Because I know quite a bit, but I'm also not an expert, I decide to contact the laptop's manufacturer, instead of trying 100 different OS and installation program combinations and possibly breaking something.\n\nI start their live chat, tell them about my problems and the first message (after \"hi, my name is, please wait while I read\" and after I tell him about the LZMA stuff) is: \"You have to set the UEFI as trusted in secureboot.\" So I go into BIOS, find the option, he tells me I have to set a BIOS password and gives me the correct path to set as trusted. In less than 15 minutes my problem was solved, despite him taking a bit for every answer (maybe he did something on the side) and despite the error message having absolutely nothing to do with the actual problem. If I had to solve this on my own, I would have never guessed that it was a permissions issue, because the error message pointed into an entirely wrong direction.\n\nApart from the support guy being generally competent, I wish tech supports for other big companies would learn a lesson from that: If the user mentions installing different Linux systems, creating boot mediums or other stuff that beginners don't do, they should assume that they know how to click and so on. Thankfully in this case they did.",
        "created_utc": 1524213036,
        "upvote_ratio": ""
    },
    {
        "title": "We don't have your rooms. I don't know what to tell you.",
        "author": "sgguitarist94",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dkhq0/we_dont_have_your_rooms_i_dont_know_what_to_tell/",
        "text": "Me and my family went to visit a very popular tourist city in the American Southwest a couple weeks ago and the crap that we went through to get our hotel rooms was ridiculous.\n\nWe made the 5 hour drive to this city, at which point we went to check in to our hotel.  We had made the reservations several weeks prior for 1 room with two beds and one room with 1 bed.  We get into town, go to check in, and the smarmy sonofabitch working the front counter looks up at us and goes \"yeah, I'm sorry, we don't have any rooms with double beds available.  I don't know what to tell you.\"  And puts on a smug look.  I should mention here that this hotel was not some mom and pop little thing, this hotel was part of a global chain.  And my mother is a member of their top tier rewards program.  So to not only have them basically decide to ignore our reservation but also deny one of their better customers was a little iffy.  But we were tired and were just like \"whatever, we'll find another place to stay,\" and asked for a cancellation and refund.  The Smarmy SOB once again looked smugly at us and said \"no, that won't be possible.  We're still going to charge your card.  We won't be able to process a refund for at least 72 hours.\"  \n\nIt was on.  My mother called international hotel chain corporate, and explained our situation.  Corporate guy found it very odd as well.  He then tried to call Front desk SOB.  Both Front desk SOB and the manager at the front desk heard the phone ring, looked down at it, saw who it was, and proceeded to ignore the ever loving fuck out of it.  The corporate guy calls my mom back, and says they aren't answering their phone.  My mom is like \"yeah I know I just watched them ignore it.\"  \n\nAt that point the phone rang from someone who wasn't corporate.  Frontdesk SOB picks it up without hesitation.\n\nMy mom is still on the phone with corporate man, and he requests that my mom hand her personal phone to the frontdesk SOB so he can talk to her.  She has to inform him that she can't since he is now on the phone.  \n\nThe slow burn begins in this guy's voice.  He instructs my mom to give this man her phone when he hangs up, and she does so.  The man walked into the back office and emerged looking a little whipped.  He announces at long last, however, that two rooms had just opened up and we would be able to stay.\n\nThey also gave us vouchers for the 21 dollar a person crappy breakfast.\n\nTL;DR: Man tries to stop us from staying at a hotel but still wants to charge us, corporate goes full ape on him.\n\n",
        "created_utc": 1524193980,
        "upvote_ratio": ""
    },
    {
        "title": "Awesome Fast Food Worker",
        "author": "DuckyFluff",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dkejj/awesome_fast_food_worker/",
        "text": "Went to the local chain fast food like I do way too much and ordered some food. \n\nGot my tray, holding it by the bottom and side while having an ice cream/ drink cup full , brain didn't recognize how physics works and over the edge did it go. \n\nNo damage done, worker offered to give me a new one, I declined since it was still contained (somehow) and didn't end up on the floor, just kind of aestheticly damaged I guess.\n\nWorker calls for a new replacement anyways, let's me keep old item along with new one so had one for myself and the wife who originally ordered one.\n\nDidn't have to make me a new one but I definitely appreciate it, nice to see someone so willing to make another happy, even with basic things.\n\nHopefully good karma goes her way.",
        "created_utc": 1524193083,
        "upvote_ratio": ""
    },
    {
        "title": "16 month old spills drink...chaos does NOT ensue",
        "author": "stephan1emar1e",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dk0pr/16_month_old_spills_drinkchaos_does_not_ensue/",
        "text": "My family lives in a semi-hipster city in the South, and there is a really cool roof top hotel bar which offers amazing views of said city. My husband and my best friend was in town, so we wanted to show him the sights. \nSo four adults and one toddler go all the way up to the roof and order a few drinks and appetizers. I’m still breastfeeding occasionally and haven’t had a drink in a while, so it hit me pretty hard. My son is reaching for my phone in the table and I was going to hand it to him when he suddenly changes course and grabs my glass by the stem, spilling it all over the table and my husband’s lap. The bar manager almost instantly appears out of no where with napkins, and then leaves to grab a dish rag. She comes back with a dish rag and tells me she asked the bartender to make me another drink as I’m apologizing profusely for the mess my son made.\nShe tells me. “Don’t worry about it, it’s a bar!  Spills happen all the time!”\nI felt terrible, and didn’t want to be one of those parents whose kid makes a mess in public that someone else has to clean. \nThe entire staff was sweet to my little one, and even gave him some free house-made potato chips. I made sure to leave a really good tip and tell the bar manager how much I appreciated the way she treated us. When we got home, I called the hotel and spoke with the overall manager so that he knew how exceptional our service was tonight. \n\nGoing out with kids is a crap shoot. Mine is pretty well behaved, but accidents happen. Thank you so much to everyone in service who is kind, and understanding. Our night was really wonderful because of people like you. \n\nEdit: 2 typos",
        "created_utc": 1524188582,
        "upvote_ratio": ""
    },
    {
        "title": "Free Food?",
        "author": "bagout123",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dis54/free_food/",
        "text": "There is a place near my school, I eat there often enough at lunchtime between hours. But it’s always extremely full of people, so the workers don’t particularly notice frequent customers. \nAnyway, uninformed me has only 5£ and it’s an old 5£ note, the new ones have just come out and this place stopped accepting the 5£ notes.\nI’m paying and I pull my five pound note out, to which she tells me they don’t accept that anymore, she then asked me if I had card, to which I replied negatively to. I then started to walk away from the counter towards the exit after having handed back my items, she picks them up, and insists I take them, she even says it will come out of her paycheck and I won’t have to pay for it.\nI take it. After a bit of argumenting “No no I’m fine” “I insist”.\nI come back the next day and see her, I attempt to pay her the 5£ and she refuses says it’s ok and that I could keep it, and still refuses to let me pay for it. But eventually she gives in.\nNice to know that she is ready to give on impulse and that there are people out there.\n\nTL;DR Nice lady sees i cant pay gives me food anyway out of her paycheck to a stranger, next day refuses to let me pay for it then eventually gives in.",
        "created_utc": 1524177198,
        "upvote_ratio": ""
    },
    {
        "title": "Acer can identify competent users",
        "author": "FabianRo",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8de1ir/acer_can_identify_competent_users/",
        "text": "[removed]",
        "created_utc": 1524138586,
        "upvote_ratio": ""
    },
    {
        "title": "Just wanna to get my teeth cleaned.",
        "author": "Ish_N_Chips",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8dbeoe/just_wanna_to_get_my_teeth_cleaned/",
        "text": "So I called the dentist last Thursday to make an appointment on Wednesday and they said I could either come at 8:30am, 9:00am or 12pm so I say I'll come at 12pm. They call me Monday to confirm that that times still works with me and I tell them yes.\n\nThen Tuesday they call me at 5:20pm, but I miss the call cuz I'm watching a movie. I see the missed call at around 5:30 and the message they left says that there's been a change in the schedule and that they'd like to reschedule me at 9am on Wednesday and if I could call them back to confirm the appointment. So I call them back but it goes to voice mail and I forget to leave a message cuz I wanna get back to my movie. I look online at their hours and it says they're open from 8:00am to 5:00pm so why they'd call me after hours then tell me to call back is beyond me. \n\nI'm like fuck it I'll just set my alarm for 8 Wednesday and call them to reschedule my appointment for another time. I wake up and call them around 8:30 and it doesn't even ring or send me to voice mail. I look to make sure I’m calling the right number and I am. I do that 4 times within the span of ten mins and all four times it does the same thing so I'm like fuck it I'm going back to bed.\n\nI wake up at 11:57 with a missed call from 11:30 and message from them saying, \" Hi we just want to confirm that you are coming in for your appointment at 12\". \n\nWhat the fucking fuck you fucks",
        "created_utc": 1524105410,
        "upvote_ratio": ""
    },
    {
        "title": "Credit card problem",
        "author": "idiotmonkey12",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8d8rj9/credit_card_problem/",
        "text": "TL:DR changed credit card company after my feelings of injustice. \n\nSo the 9th is when my bill is due. On March 1st I send out my $300 payment, auto pay, confirmation number, the works. \n\nBy March 10th, it still hasn’t cleared. I call my bank, they say CC has it, they just didn’t cash it. I call CC and they say they don’t even have it in their system. I give them $400 to make sure that I don’t get a penalty. \n\n$300 check clears March 12 and $400 clears March 14. \n\nSo I email them a million times to see if they can credit the $400 for April’s payment. Radio silence. So my mistake is not calling them. \n\nI get not one but two letters dated April 12 that I don’t get until April 17. The first states that my account is in delinquency and if I pay xx amount, it will be fine. The second says that they are suspending my account because I didn’t pay the amount. Again, both dates April 12, received together on April 17. \n\nI call, I’m patient for an hour on the phone after work and then completely blow up, lose my shit after they tell me there is absolutely nothing they can do. \n\nI cannot believe that 8 years of their bullshit ends like this. Some have been telling me that they did something wrong, I should call back, idk. So now my 9k cc limit is down to 6k because I immediately changed companies. I guess that’s a good thing, don’t need that money over my head. ",
        "created_utc": 1524082412,
        "upvote_ratio": ""
    },
    {
        "title": "When they didn't have the item I needed in stock",
        "author": "dinosaur_apocalypse",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8d75af/when_they_didnt_have_the_item_i_needed_in_stock/",
        "text": "I just remembered this story from last summer. I was gathering supplies for doing field work. (Geology research in a national park.) I was doing my research online, figuring out which retailers had the items I needed and who had the best prices. At this moment in time, I was looking into the best carboys for the job. I called a local sporting goods retailer to see if they had the ones on their website in stock.\n\nThis conversation followed:\n\nCustomer Service (CS): \"Thank you for calling [redacted]. How can I help you today?\"\n\nMe: \"Hi. I was calling to see if you have a certain item in stock--.\"\n\nCS, cutting me off: \"No.\"\n\nMe: \"Wait. What?\"\n\nCS: \"No. We don't have anything in stock.\" *click*\n\nEntirely bewildered, I took my business elsewhere. Still gave me a bit of a chuckle. As my friend said, \"That person is 100% done with customer service.\"",
        "created_utc": 1524070258,
        "upvote_ratio": ""
    },
    {
        "title": "Had to visit the little boys room.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8d5tqr/had_to_visit_the_little_boys_room/",
        "text": "[deleted]",
        "created_utc": 1524060051,
        "upvote_ratio": ""
    },
    {
        "title": "Customer rep tells me that something doesn't exist, I tell him that it does and make him look it up",
        "author": "shooshrooms",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8d3xwx/customer_rep_tells_me_that_something_doesnt_exist/",
        "text": "I was switching from one phone carrier to another and already had a phone for the carrier I was switching to. I bought a prepaid sim kit online directly from the new carrier, one that includes 1 mo. of a $40 plan \"free\" all for the sweet price of $25 total.\n\nWhen I called to activate, this guy kept trying to get my payment information to add a plan or asking if the kit came with a prepaid fill card. I kept telling him that no, my sim kit didn't come with a prepaid fill card, that the kit came with a month of the plan free, and that this is a real thing that I bought directly from the carrier's website.\n\nHe doubles down and tells me in a sassy tone that nothing like that exists and that I will need to provide payment to activate today. Finally, he googles the kit and discovers that it is in fact a real thing.\n\ntl;dr Customer service representative specializing in activating phones doesn't know the activation products his company sells ",
        "created_utc": 1524038073,
        "upvote_ratio": ""
    },
    {
        "title": "Banking woes",
        "author": "Fictional_fantasy",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8d1lai/banking_woes/",
        "text": "My husband has been banking at the same bank for over ten years. He convinced me to switch when we started dating. I’ve been there about 3 years now. \n\nThey have always been borderline rude to me when I’ve gone in. My finances are not what they think they should be.\n\nThey make small comments here and there about my finances. For example, my phone bill was taken out of my bank a week early and ended up overdrawing my account. I got told I was immature and needed to manage my finances better. I had no idea the bill was coming out early.\n\nI have two checking accounts and a savings account. When I deposit my paychecks I tend to put them in my main checking to pay my bills. If my savings or other checking are low they say I should put it in there because those have less money.\n\nIt’s annoying but I’ve just dealt with it. My husband is their favorite customer and they just treat him so well. It’s crazy how they treat him so well and then are just rude to me.\n\nWe are considering moving to a bigger city nearby and went into the bank today to get an estimate on home loans. As soon as the lady found out I had student loans she started chewing me out. Told me I was irresponsible and that I should get a job (I have two) and not spend on anything (food is kind of a necessity), and that I should have been able to get through school without taking out loans.\n\nI got upset and told her going to university is expensive. I’ve been trying to not take loans but they cut my financial aid when I got married and i just can’t afford it and my bills. I was upset but managed to stay polite. But at that point I was done.\n\nI went and sat in the car and cried after that. I’ve tried to get through school debt free but it’s hard when I am paying for it completely on my own. \n\nI’m definitely switching banks after this. I’ve felt like I’m being judged every time I go in and this was just the last straw. ",
        "created_utc": 1524012148,
        "upvote_ratio": ""
    },
    {
        "title": "!Faith in customer service restored!",
        "author": "maggiemaysummertime",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8d0uiy/faith_in_customer_service_restored/",
        "text": "[first time poster long time lurker, apologize for any formmating issues on mobile, tried posting in another subreddit and was rejected so this is edited for this sub]\n\nHi fellow Reddit folks! So yesterday morning I was checking my bank statements ( as I do regularly for obvious reasons) and I discovered a $4.99 charge for some digital content purchased with a well known online shopping site. I was clearly confused because I do not buy digital content from that site  I primarily use my device play store. I go to investigate what this charge was on my account under order history digital content, and all hell broke loose. I was livid I discovered multiple game purchases ranging from $.99 to $6.99 for yesterday day all the way back to the beginning of 2017 total charges equaling $24.86. \n \nFirst things first I of course change my password, unregister all devices, and remove any saved payment options from the account to prevent any further suspicious charges. I then question my sister about my nephews used devices ( he is the only other person I have allowed access to my account) and the devices where abouts. Turns out he has no devices. They have been taken from him for the last month, and he only uses the Xbox and any wifi is restricted from his use. Ok so after I investigated all other possibilities I relent with the thought \"ok it's only 24 bucks no big  deal I spend that in an hour , so whatever, my account is secured now it can't happen anymore.\"\n\nFast forward to today, and I can't stop racking my brain about it. I decide to open a service chat with customer service representative (CSR) just to get some information on what type of device the content was downloaded on. Now you need to know folks, before I decided to do this I went and read the digital content terms of use and it clearly stated NONREFUNDABLE, so I did not enter the chat wanting or even requesting a refund JUST INFORMATION. Well I politely explained what's going on, and that I've read the terms , do not intend to dispute any charges with my bank given it was such a low amount and the charges back dated to last year to the csr.\n\n Y'all let me tell ya within 5 minutes  the  csr  gave me a  FULL REFUND FOR EVERYTHING!!! I was utterly suprised and oh so very thankful. I mean not that I would have missed that $24 at all, but it was a wonderful unexpected transaction ( slightly as unexpected at the culprit's horrid game selectios lol). This exchange restored some of my faith in csr's. Moral of the story be polite, understanding, DO YOUR OWN RESEARCH BEFORE HAND, and you may get some unexpected outcomes!\n\nP.S Thanks Selva great customer service on your behalf!! :)\n",
        "created_utc": 1524005701,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'm calling the police!\" \"I AM the police!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8czlww/im_calling_the_police_i_am_the_police/",
        "text": "[deleted]",
        "created_utc": 1523995672,
        "upvote_ratio": ""
    },
    {
        "title": "Congratulations, /r/TalesFromTheCustomer! You are subreddit of the day!",
        "author": "SROTDroid",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8cvz6t/congratulations_rtalesfromthecustomer_you_are/",
        "text": "http://www.reddit.com/r/subredditoftheday/comments/8cvz1a/april_17th_2018_rtalesfromthecustomer_for_tales/",
        "created_utc": 1523966490,
        "upvote_ratio": ""
    },
    {
        "title": "I was just looking for a job",
        "author": "allbeefqueef",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8cuc05/i_was_just_looking_for_a_job/",
        "text": "[removed]",
        "created_utc": 1523944432,
        "upvote_ratio": ""
    },
    {
        "title": "Ignored in a Store Over Acne.......",
        "author": "Xeno_Prism_Power",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8ctfog/ignored_in_a_store_over_acne/",
        "text": "So a friend of mine had just bought some new makeup, and one of the items was some highlighting powder in a heart shaped compact. She showed it to me because she thought I'd love it, and I did. So I asked her where she got it.\n\nI decided to go there today to purchase some of my own. Now, I'm not 100% sure this was the reason for what happened, but I can't think of anything else. I'm currently dealing with a not so nice breakout on my face, due to hormonal issues and stress. I never wear acne when I'm having a breakout like this because I've found the short term concealment is not worth the lengthening of the breakout. So I went makeup free today except for some bright pink lipcolor.\n\nWell, I get in there, and I'm having a bit of trouble finding the item. So I go over to a store employee who tells me she'll be with me in just a moment. About 45 seconds after she says that, two people come in through the door, and she goes to help them, and busies herself picking out stuff for them, never saying anything about helping me.\n\nSo I'm thinking 'okay, that was weird' and start looking for another employee. Mind you, I just want to know where one product is, nothing that would have taken too long.\n\nBut the other employees seem all busy doing consults, so I tried waiting around for a bit. The employee I'd originally spoken with seemed to finish with her customers, because they go up to pay with something, so I started in her direction, but she took one look at me and walked across the store and found someone else to help.\n\nSo I'm here, twice walked away from, and I'm not sure what was going on. I tried waiting around a bit, but only the lady that was doing whatever she could to avoid me seemed to free up, and she'd immediately look around for someone else, not me, to help. So I figured I'd try again another day and left.\n\nI still don't understand what was up with her, and I don't think I was dressed oddly (Jeans, an aqua sweater, and brown boots) or behaving oddly, so I'm thinking it was that I was not made up and the acne was showing, but if anyone reading this has any idea, please let me know!",
        "created_utc": 1523934293,
        "upvote_ratio": ""
    },
    {
        "title": "Apparently if you’re not a US or Canadian citizen you’re not allowed to buy alcohol at this huge pharmacy chain.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8ctdto/apparently_if_youre_not_a_us_or_canadian_citizen/",
        "text": "[deleted]",
        "created_utc": 1523933797,
        "upvote_ratio": ""
    },
    {
        "title": "I go to order but end up teaching math",
        "author": "SKlalaluu",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8cra3j/i_go_to_order_but_end_up_teaching_math/",
        "text": "On the road and stopped for lunch at a fast-food place.  My order total was $6.07.  I already had like 5 $1 bills.  I didn't want to get 4 back if I paid with a $10.  So I handed the cashier $11.07.  She grabbed the $10 bill with one hand and the $1 bill with the other and tried to give me the $1 bill back.\n\nMe: Why are you handing that back?\n\nCashier:  The total is only $6.\n\nMe: Yes, but the change will be $5.\n\nCashier: &lt;does not compute&gt;\n\nMe: Look, 6 plus 5 equals 11, right? So the change from $11.07 for a $6.07 order is $5.\n\nCashier: &lt;looks skeptical&gt;\n\nMe: Just punch it into the register and see what it says.\n\nCashier: &lt;punches in 11.07 and the register says the change is $5&gt;\n\nMe: &lt;I take the $5 bill and leave wondering what world we live in that a 20-something doesn't know that 11-6=5?&gt;",
        "created_utc": 1523914709,
        "upvote_ratio": ""
    },
    {
        "title": "I think the Cashier just gave up",
        "author": "water2770",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8cqdco/i_think_the_cashier_just_gave_up/",
        "text": "[removed]",
        "created_utc": 1523907663,
        "upvote_ratio": ""
    },
    {
        "title": "Store manager apologizes for bad customer experience, but what does his message mean?",
        "author": "rasorasoraso",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8cksz3/store_manager_apologizes_for_bad_customer/",
        "text": "[removed]",
        "created_utc": 1523850996,
        "upvote_ratio": ""
    },
    {
        "title": "A baffling telephone sales call",
        "author": "DoubleDot7",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8ci242/a_baffling_telephone_sales_call/",
        "text": "Sales lady: Good day, sir. We would like to upgrade your line from copper ADSL to fibre, for no additional cost. \n\nMe: At that price, will my data speed, cap or free call times increase? \n\nHer: No, it all stays the same.\n\nMe: I signed up during a promotion. Do I get to keep my monthly discount? \n\nHer: No.\n\nMe: I'm not interested. Good bye.\n\nHer: Wait, wait! Don't you want to know what the difference in price is? \n\nMe (confused and curious): Uhhhhh, ok? \n\nHer (proudly says): With our new package, you will pay 10 Dollars more per month! \n\nMe: Thank you for the generous offer but I'm still not interested. Good bye. \\*facepalm\\*",
        "created_utc": 1523824809,
        "upvote_ratio": ""
    },
    {
        "title": "A different tale of birthday shenanigans",
        "author": "liquidklone",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8cfl52/a_different_tale_of_birthday_shenanigans/",
        "text": "On mobile, so spelling and formatting should be absolutely perfect.\n\nSo a few days, I had a birthday dinner that reminded me of [another post](https://www.reddit.com/r/TalesFromTheCustomer/comments/82laf0/mediumyou_dont_want_whip_cream_in_your_face_let/) on this sub.\n\nMy family took me out to eat at a restaurant I have never been to before. Wasn't my first choice, but it turns out it was really good. \n\nI was halfway through my meal when all of a sudden, I see them come out with a big hat, and a sopapilla. I was totally suprised by that, they stood behind me while singing and put the hat on me. I know it's gross, but whatever, am I right? Then a spoon appeared in front of my face, and I'm like, wait... what's going on here? Are they feeding me? That's so weird. So I went to take a bite of it anyway, because my sister and nice are about to piss themselves laughing. And before I knew it they was spreading it all over my face.\n\nI had no idea that was going to happen, it was pretty funny. I thought it was weird and awkward, but everyone enjoyed it, so that made me happy. \n\nEdit: [Pics or it didn't happen!](https://imgur.com/a/qqwqT)",
        "created_utc": 1523803834,
        "upvote_ratio": ""
    },
    {
        "title": "US Redditors: When was the last time you had to spend 10+ mins waiting for a customer care agent? And which company was this.",
        "author": "impish19",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8cdjn7/us_redditors_when_was_the_last_time_you_had_to/",
        "text": "[removed]",
        "created_utc": 1523774520,
        "upvote_ratio": ""
    },
    {
        "title": "Service workers, there's hope for the future!",
        "author": "throawayaccountssh",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8cbhzd/service_workers_theres_hope_for_the_future/",
        "text": "Here's my story:\n\nI went to a renowned ice cream shop. They have lovely flavours like avocado, bean, etc. The line up was around the block. They hand roll waffle cones which was quite a time consuming process, but the best thing is this:\n\n\nIt's actually someone's JOB to parade up and down the line handing out a list of their ice creams, how to order, prices, etc. On the top, in HUGE font it says:\n\n\"WE ARE A SMALL, BUSY ESTABLISHMENT. IN ORDER TO REDUCE WAIT TIMES, PLEASE HAVE YOUR ORDER PREPARED BEFORE YOU ENTER. IF YOU DO NOT HAVE YOUR ORDER READY YOU WILL BE ASKED TO LEAVE AND RETURN TO THE BACK OF THE LINE.\"\n\n\nIn sum? Hurry the fuck up. We're here to serve you quality ice cream - not talk shit about the weather.\n\nThere's hope for the future!\n\n",
        "created_utc": 1523749882,
        "upvote_ratio": ""
    },
    {
        "title": "I'm usually very shy but this lady really got under my skin.",
        "author": "Meewah",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8cbc8a/im_usually_very_shy_but_this_lady_really_got/",
        "text": "Today I was at a beauty store spending way too much money (I'm so weak 😫) and my daughter and I decided to get our brows done. The lady manning the bar that day was a super sweet, older English woman. Seriously, she was awesome.\n\nSo she's waxing me when this older lady walks up. We'll be Me, OL (older lady), and BL (brow lady). \n\nOL: \"Do you have time to do my brows?\"\nBL: \"No, I'm sorry I dont right now I'm getting ready to leave for a wedd... \"\nOL: \"THEN I GUESS YOU DONT HAVE TIME FOR ME DO YOU!!\" (It wasn't a question, she was walking off waving her arms in the air like BL had wasted her time or something.)\nME: \"Bitch, you dont have to be rude!\" \n\nShe, of course, ignored me and kept walking. I normally dont say stuff like that but BL was so sweet and this lady had absolutely no reason to be rude to her. She was trying to explain to her that she was going to her daughter's wedding shower but she'd be back around 3:45. OL wasn't having any of it though. \n\nBL thanked me for standing up for her and said that lady ruined her day 😔. It was sad. She cheered up a little by the time we were done though. Hopefully her daughter's wedding shower was enough to bring the smile back to her face. ",
        "created_utc": 1523748227,
        "upvote_ratio": ""
    },
    {
        "title": "March 29th, damn it!",
        "author": "BefWithAnF",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8ca89u/march_29th_damn_it/",
        "text": "TLDR: Schedule manager lacks basic reading skills. \n\nA few months ago, towards the end of February (important) I found a tattoo artist I liked on Instagram, &amp; she directed me to email their scheduling person at the shop- a shop I’ve been to in the past, as it happens. After a bit of back &amp; forth, they told me \n\nTHEM: her days at the shop are such &amp; such, when is good for you?\n\nME: How about 1 PM on Thursday the 29th?\n\nTHEM: I am happy to assist you, but I see that Janda will actually be out of the studio next week and unavailable Monday, March 5th. After this date she will be back to her usual schedule of (blah blah blah).  Let me know if there are any dates and times that will work within this time frame and I'll be happy to book your consultation.\n\nME: Yes, I meant Thursday the 29th of March, so that's just fine. \n\n(Here’s where it gets weird)\n\nTHEM: I believe you are referring to Thursday, March 1st. Unfortunately, Janda will not be available until after March 5th, so we will need to book a consultation for after March 5th, on a Sunday, Monday, Thursday, Friday, or Saturday.\n\n(I scrolled back through our email convo, wondering if I had made a mistake. I didn’t.) \n\nME: No, I'm referring to Thursday, March 29th, the final week in March, about four weeks from now. Do you schedule consultations that far out? If not, I can email you in a few weeks. \n\nI worried that I had been a bit terse, but the next email they realized their mistake &amp; we booked an appointment. If I hadn’t been to that shop before, though, I probably would have just said “fuck it” and taken my ~$2,400 worth of work somewhere else. ",
        "created_utc": 1523737767,
        "upvote_ratio": ""
    },
    {
        "title": "I was that kid who ordered ridiculous combinations of food",
        "author": "muscularmouse",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c9mr6/i_was_that_kid_who_ordered_ridiculous/",
        "text": "Not sure if this story belongs here, but this happened when I was maybe 12 years old, and me, my dad, and my uncle were at a sandwich restaurant. We sit down at a table, the waitress gets us situated and gets us our drinks, then we start looking at the menu for dinner. \n\nSo because I was so young, I was a picky little shit but I didn't want to order from the kids menu. So I look at the \"adult\" menu and see something that catches my eye: the BLT sandwich. I was mostly skimming through the description but I especially liked it because it had bacon in it, but because I am picky I didn't care for some of the other ingredients in the sandwich. So I planned what I wanted removed from the sandwich and prepared to make my order as the waitress took the orders from my dad and uncle.\n\nWhen she gets to me, I start to stutter a bit because I'm embarrassed that my request may sound a bit crazy, but still I make my order:\n\nMe: \"Umm, could I get the BLT, but could you take out the lettuce and the tomatoes?\"\n\nEveryone is dead silent looking at me like I was an alien, and my dad is trying his best not to burst out in laughter. The waitress must have picked up on my dad's stifled laughter because she then said to me:\n\n\"So.... You want the BLT sandwich... But without the \"L\" or the \"T\"?\n\nAt this point my dad loses it and my uncle is probably face palming or something (I can't remember), and I realized my mistake. I had no idea that BLT stood for \"Bacon Lettuce Tomato\" Sandwich, so I essentially ordered a B sandwich.\n\nMy dad then swiftly took over and ordered something much more reasonable for me, after apologizing to the waitress.\n\nTL;DR: I ordered a B sandwich",
        "created_utc": 1523732283,
        "upvote_ratio": ""
    },
    {
        "title": "A kindness from a stranger",
        "author": "Caliah",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c8te0/a_kindness_from_a_stranger/",
        "text": "Many years ago I was working late in my downtown desk job and I was starving. There was a little grocery store that I used to frequent that was owned by a really nice woman who was an African immigrant. She had a little deli counter and would make sandwiches to order. \n\nSo that night, I was stuck at work with no food or cash. I had a single check with me that I thought would be my saving grace and I walked over to get a sandwich. When I paid and ripped the last check out, it ripped the check in half to where it couldn’t be used. I was SO embarrassed. I didn’t have anything else and I really needed that sandwich. She didn’t flinch at all! She told me I could have the sandwich and come back the next day to pay. I was overcome with emotion and gratitude. That would NOT happen at one of our big groceries. It was such a kind gesture that meant so much to me. That she would trust a stranger to return with her money. \n\nI did return the next day with the money. I continued to shop there until they finally closed down. That bit of kindness  and humanity stuck with me and to this day I try to shop locally owned businesses. ",
        "created_utc": 1523725194,
        "upvote_ratio": ""
    },
    {
        "title": "Are those my cookies?",
        "author": "tee-arr",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c8q1s/are_those_my_cookies/",
        "text": "Apologies if this is isn't the right sub, if there's a better place let me know but I feel it's TFTC material!\n\nSome background: I often buy protein cookies online and in bulk to save on cost. The downside is that they arrive in a huge box and I'm usually between work sites so won't be in to receive the package. Luckily there is an option to send that parcel to a local convenience store, then pick it up from there at your leisure.\n\nSo I've done this a few times, and once again I go to pick up my package. The cashier behind the counter can't find it, so I tell him they sometimes keep it in the back because of it's size. He reemerges a few minutes later, still unable to find it. In the meantime I've checked with the courier's website and confirmed that it has been delivered and not returned.\n\nI know what the package looks like, so they kindly let me behind the counter and through the back to see if I can spot it, but no luck. At this point the cashier and I aren't quite sure what to do, so he asks me to leave me my details and he'll pass it on to the manager when he comes in.\n\nAs I lean on the counter writing my details down, a familiar sight catches my eye. It's a box of protein cookies, opened up for sale. Next to it is another box... and another. The three flavours I had bought were out on the counter for sale! I point this out to the cashier, show him my order email and he looks aghast. He apologises profusely, but to be honest I'm just glad they are there and I find the situation pretty funny.\n\nTwo cookies had sold, so he offered to return the package as damaged, but I'd rather just take what is there. He keeps apologising and tells me to take something to cover the value, so I just grab some coke and head on my merry way, almost-sold goods in tow.\n\nTL,DR: Go to pick up my online order from convenience store to find someone had opened it and thought it was stock to sell.",
        "created_utc": 1523724322,
        "upvote_ratio": ""
    },
    {
        "title": "Catch 22",
        "author": "Darby1978",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c7ug4/catch_22/",
        "text": "I changed my broadband provider and received a welcome email telling me I can log on to my account to see my bills. So I click on the link to log on but am told I first need to register to create my account. So in order to register I need my email and account number. I haven’t yet been told my account number, so I click to find the FAQ which tells me where to find my account number. This tells me I can find my account number on the top of my bills! The very bills that I can’t yet see because I need to register. So frustrating!",
        "created_utc": 1523715845,
        "upvote_ratio": ""
    },
    {
        "title": "Badly run drive thru rant",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c7pvi/badly_run_drive_thru_rant/",
        "text": "[deleted]",
        "created_utc": 1523714564,
        "upvote_ratio": ""
    },
    {
        "title": "Cashier yells at me for not having enough to pay for my food.",
        "author": "jadia20",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c69ey/cashier_yells_at_me_for_not_having_enough_to_pay/",
        "text": "This actually happened a couple years ago when I was in high school. I went back to the place where it happened recently which reminded me of this story. \n\nSince at the time I was barely 16 and didn't have a job, I still got an allowance from my parents. I only had a few dollars left of my allowance but I was really craving food from a popular donut chain restaurant.  I'm not sure how it is at other locations but for this particular location, there was no screen to show your total in the drive-thru and the cashier would only tell you the total once you pulled up to the window. I ordered my food and proceeded to drive up to the window. \n\nWhen the cashier told me my total, I realized I was short by a few dollars.\n\nMe: I'm sorry I just realized that I don't have enough to pay for all of it. Could you take off x and I'll just have y?\n\nCashier: *yelling* Why did you order food if you knew you couldn't pay for it?\n\nMe: *speechless*\n\nCashier: We already made the food and now we have to throw it away! Next time don't order food if you can't afford it.\n\nI just apologized and paid for what I could actually afford. Back then, I was still pretty shy and afraid of confrontation. Today, if he talked to me that way he would get an ear-full. I was embarrassed and upset but didn't confront him about it. Strangely enough, the next time I returned to that restaurant (about a year later), the same cashier took my order and I watched as he registered who I was. He was much nicer that time around.\n\nEdit: There seems to be a bit of a misunderstanding here considering that I'm constantly clarifying in the comments. I was definitely wrong for wasting their time &amp; money. Even if they didn't tell me the total, I should've checked my math and the amount of money I had in the first place. My issue wasn't that he corrected me, it was *how* he did it. I should have been more careful, but that doesn't justify being yelled at. I hope that clears things up.",
        "created_utc": 1523693701,
        "upvote_ratio": ""
    },
    {
        "title": "This can’t be real.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c5xx9/this_cant_be_real/",
        "text": "[deleted]",
        "created_utc": 1523688688,
        "upvote_ratio": ""
    },
    {
        "title": "Wedding Invitation order",
        "author": "gobonas13",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c3cl4/wedding_invitation_order/",
        "text": "[removed]",
        "created_utc": 1523659881,
        "upvote_ratio": ""
    },
    {
        "title": "Guess she doesn’t want to work.",
        "author": "theteacher1990",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c3b7z/guess_she_doesnt_want_to_work/",
        "text": "A few days ago I wanted a steak so I stopped by my local butcher on my way home from work. Unfortunately, the place was closed on that day and I went to a nearby “meat market” which I had never been to before. When I first stepped in everything looked nice, the place was clean, and everything was neat. I grabbed a few things and I stood by the meat counter since I could see the employees in the back and they had not noticed me.  Out comes the owner and notices me, he then tells a young girl that was in the isles loudly talking on her phone if she could help me. She starts screaming at the guy telling him to do it because she’s busy.   At this point I told the owner that it’s ok I’m not buying anything and was leaving.   He told me that they had just bought the store and were waiting for the inspectors... well that explains why everything was spotless.  I told him that the princess doesn’t want to work and that I won’t force her as I left the door.      I think she was his daughter because there’s no way a normal boss would put up with that.  ",
        "created_utc": 1523659555,
        "upvote_ratio": ""
    },
    {
        "title": "For Here or To Go?",
        "author": "callentch",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c2lk6/for_here_or_to_go/",
        "text": "FTP LTR.  I've posted in the comments section before but this is my first submission.\n\nMy (now ex) husband and I lived in Germany on and off throughout the 1980's. My husband was active duty army and I was his \"spouse,\" (a military designation.) We were stationed in the very lovely town located in the Bavarian Alps, made ever lovelier by the presence of a DacMonalds.\n\nNow I had, in the past, stumbled through ordering at a german DacMonalds a few times using mostly English and finger pointing but I decided that this time I was going to make the entire order in German. I had been in country a couple of years and I hadn't been in this particular place before.\n\nI stepped up to the counter, took a deep breath and ordered: \n &gt; eine Viertelpfünder mit Käse, eine klein Pommes frittes, und eine klein cola.\n\n[one quarterpounder with cheese, one small French fry and one small cola]\n(or words to that effect. Its been awhile and I'm not sure anymore of the grammar or the spelling)\n\nI was pretty much proud of myself, but much to my dismay the young woman behind the counter looked up, met my eyes, and said:  \n &gt; For Here or To Go?  \n\nI was crushed! JK. I still joke about it 30 years later\n\nedit: formatting and I had to Google german spelling\n\n     ",
        "created_utc": 1523653341,
        "upvote_ratio": ""
    },
    {
        "title": "Don’t shit where you eat, don’t eat where you’ve worked",
        "author": "potatoasts",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8c00x3/dont_shit_where_you_eat_dont_eat_where_youve/",
        "text": "Backstory:\nI used to work at a small Mexican (Well, more TexMex but they called it Mexican food) restaurant owned by a huge corporation. We can call it Insane Juan’s, for the sake of the story. It used to be a chain restaurant and slowly but surely they started dying off and the location where I had worked is the last one in existence. \n\nNow while I was there, we had a handful of really good servers, people who had been doing it for years, were motivated to get their job done and do it well. Flash forward to march, it’s about six or seven months since I quit working there because I had to return to my college 6(?) hours away from there. I left on great terms planning to potentially come back in the summer again if I couldn’t find a place to live and job closer to school. \n\nStory: \nSo spring break rolls around and I decide that’s where I want to take my family out to eat, my brother and sister in law, my dad, my niece and I all go to get some Mexican food and to have a good night out together. \nWe get there and nobody acknowledges us for a good few minutes, the assistant manager comes up and seats the couple in front of us, pretending she doesn’t remember me, and then disappears. Our waitress comes after another couple minutes and takes us to a table in her section and then once again disappears. After about 10 minutes she comes back and gets us chips, salsa, and drinks and takes our order. 20 minutes later she comes back to ask about the sauces and toppings we want. \nLet me just take a second to explain how their order input system works, it’s basically all or nothing, it won’t even let you put in the order unless you select a sauce with the foods that need one. So I know she hasn’t put in the order yet. \nI go up to the only girl still working there that I know and ask her if it’s a new inexperienced server and she tells me no but that the girl has already put her two weeks in and doesn’t care how she treats customers. Great. \nSo another 15-20 minutes goes by after that and I flag down the waitress and ask what’s taking so long in the kitchen, she says there was a big top that came in and their order got put in first so now the kitchen is backed up. At that point I was upset and my family started to leave. Had she put in the order when we gave it to her, we would have had our food and it wouldn’t have been an issue. \nMy brother and I waited and I said “hey can you go get me (asst. manager’s name) please?” The asst. manager comes over all smiles and asks what we need, we calmly explain the situation and she replied “Okay.... and?” And so that’s when I explained how when I had worked there that would have been an issue that would have been taken care of and the server would have some sort of reprimand for acting like that because she wanted to throw around some attitude. The only thing the manager said about the situation was “okay, yup, okay, uh huh” which only annoyed us more. She didn’t even comp the drinks (the only things we had actually gotten that we ordered) and so my brother threw down some cash and stormed out. \nI called the regional manager on the way home because I had heard that he was someone who could get shit done, apparently not because from what I’ve heard nothing has changed aside from a $25 gift certificate good for insane Juan’s, “turtles”, or “House ¡olé!” the three restaurants owned by this one larger Mexican food corporation. \n\nMoral of this story: \nDon’t eat at Insane Juans because they suck and if anyone at Larger Mexican Food Corporation sees this, you’ve been slowly smothering this restaurant you own for a long time but still letting it bring you profit, just kill it and put a house ¡olé! In its place. ",
        "created_utc": 1523633308,
        "upvote_ratio": ""
    },
    {
        "title": "Lactose intolerant, ordered coffee with no milk, got coffee with milk",
        "author": "dreamyWillow",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bzlj3/lactose_intolerant_ordered_coffee_with_no_milk/",
        "text": "This happened so many times!! \n\nWhy do they even ask if they’re going to get you whaever they want instead of whatever you want?\n\nThis is quite serious too, I get bad reactions from even the tiniest amounts of milk. Normally I check and return it if I find it has milk but sometimes (like the last time it happened), I was in an airport,  I was in a rush, ordered an Americano to go and this happened. I only noticed when I opened my coffee cup in front of the gate, a train ride away from the coffee shop. *sigh*",
        "created_utc": 1523629943,
        "upvote_ratio": ""
    },
    {
        "title": "Spent 20 minutes walking around an empty store before we were “served”.",
        "author": "tommygun641",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8byy3m/spent_20_minutes_walking_around_an_empty_store/",
        "text": "This happened a few years ago. I went with my mother to a furniture store to buy recliners.\n\nWe entered and realised that the place was empty except for us and three workers. Two of the workers were girls in their mid 20’s sitting at a display table and chatting about their boyfriends whilst the third was a guy practically asleep at his computer.\n\nWe walked around for around 20 minutes whilst all three ignored us until the man got up and walked over.\n\nMan: what do you want?\n\nMum: oh hello, I was looking to buy some recliners an-\n\nMan: they’re over there. \n\nThe man then walked back to his computer and sat down. The girls were still talking.\n\nAfter that my mother just said “screw this” and we walked to the shop next door that sold the same kind of thing. We were approached about a minute after entering the store and left after 15 minutes having bought the recliners.\n\nAbout 6 months later i was listening to the radio and the news was on. They said \n\n“and the people of (my town) have all voted for the worst business in town and it goes to (the store). The most common complaint by residents is that they are too busy having conversations with each other to help you”\n\nMade me giggle",
        "created_utc": 1523624272,
        "upvote_ratio": ""
    },
    {
        "title": "Awesome discount",
        "author": "bts88",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bwq1l/awesome_discount/",
        "text": "I went to buy some cupcakes today and the box said 50 cent off. The cashier looked at it and said \"I'll give you 50% off.\" ",
        "created_utc": 1523596017,
        "upvote_ratio": ""
    },
    {
        "title": "because the man MUST pay for food.",
        "author": "rabbitwitch420",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bwhj2/because_the_man_must_pay_for_food/",
        "text": "a couple months ago, my boyfriend and I decided to get some food after work. we head on down to the mexicamerican fast food place and head in to order. \n\nnow for context, my boyfriend was in between jobs and I was making enough money to comfortably buy our food, which he felt bad for but I didn't mind at all.  \n\nso we go on to order, rung up by an older lady who admittedly was pretty blunt and rude. now comes the time to pay! she tells me the total and I whip out my card. this lady says \"he's not buying your food?\" I don't really know how to react. I mean, obviously not. it's none of your business anyway. so I tell her no, I am paying for it. then she asks me WHY. well, I explain to her that I have a job and I enjoy spending the money I earn, and I don't mind treating my boyfriend and I. She actually says \"what use is a man that can't buy your food?\" at this point I can't believe I have to explain this to anyone. \n\nI reply with \"I don't need a man to buy my things. that is why I have a job. i have him around because I like him.\" \nto this woman that was, i guess, totally crazy. The whole experience sucked and I was pissed the entire time. BF was already beating himself up because he didn't like that i had to cover the costs atm, and then this bitch brings back some old fashioned sexism and makes him feel even worse. \n \nI don't understand why that was even her business. I don't understand why she thought that was a perfectly polite thing to say. why even waste energy commenting on who is paying? something so insignificant? It's been months and I am still salty. I don't even know if it's rational to be this mad, I think I'm mostly just pissed because she made BF feel worse about a crappy situation he was already beating himself up about. ",
        "created_utc": 1523593234,
        "upvote_ratio": ""
    },
    {
        "title": "Server was...",
        "author": "Nick31415926",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bw4cd/server_was/",
        "text": "[removed]",
        "created_utc": 1523589292,
        "upvote_ratio": ""
    },
    {
        "title": "What do you mean, I have to pay for something I ordered off the menu?",
        "author": "IAmA_Wolf",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bvhyj/what_do_you_mean_i_have_to_pay_for_something_i/",
        "text": "Hubby and I went to have dinner at a small local Thai restaurant a few weeks ago. The only customers at the time were the two of us, and a family of 4 at another table. There was also a man about 50 years old at the register paying for his meal as we entered.\n\nWe seated ourselves while this man argued with two young girls at the register. The conversation was going as such, he will be PM for Prawn Man and the young female employee will be YFE:\n\nPM: I'm spending $53 on food, surely you can afford to throw in a measly $4 worth of prawn chips for free??\n\nYFE: Sir, the prawn chips are $2 per serve, and you ordered 2 of these, so that is why there is a $4 charge on your bill.\n\nPM: Well the other restaurant throws them in for free all the time! Why should I pay for these prawn chips?\n\nYFE: You ordered these off the menu, with dipping sauces, which stated the price next to it. You ordered two servings, and this needs to be paid for. I can't give them to you for free, the manager sets the prices.\n\nPM: Well, let me speak with the manager then!\n\nPM and YFE go to the kitchen so this guy can speak with the manager, and when they come back out, she's charging him only $49 for his meal.\n\nPM: (In the most smug voice I've ever heard) Thank you so much for not making such a fuss, girls. Have a nice night.\n\nThe two young girls begrudgingly smile as he leaves. I just had to say something, so I went up to the girls at the counter after he was gone:\n\nMe: I just wanted to let you know that I heard what that man was saying, and I think he was being ridiculous. If he ordered food off the menu, then why does he not expect to have to pay for it?! Why couldn't *he* afford a *measely* $4 if he was spending soo much on his food already? What a jerk.\n\nThe girls seemed very happy that I was on their side and thanked me for my kindness. When we paid for our meal, my husband said \"And we will be paying the full amount of our bill!\"",
        "created_utc": 1523583108,
        "upvote_ratio": ""
    },
    {
        "title": "For the love of low prices, do not touch people without warning",
        "author": "iswearimachef",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bvh3w/for_the_love_of_low_prices_do_not_touch_people/",
        "text": "So today I was at a discount store that offers low prices on nice brand name stuff. Now, one thing to note about this store is that no matter how conscientious you're being about not getting in the way, you will inevitably be in someone's way. Usually, customers will say \"excuse me\" or stare at you politely until you move. Today, however, I was apparently in an employee's way while browsing an endcap. The employee, a tall buff man with large hands, decided that the best way to ask me to move was to place his hand under my neck. It wasn't a polite shoulder tap, it was like he was cupping my neck. I went through a bad situation when I was a teenager, and while I spent a lot of time in therapy and do not suffer many lasting effects, I still have issues with people touching my neck. Naturally, my PTSD kicked in and I screamed bloody murder, turned around, and swung at him. Luckily I missed. He didn't apologize or anything, just said \"excuse me\" and walked by me, like nothing had happened. Meanwhile I'm incredibly embarrassed and on the verge of a panic attack. I literally just left my cart there and walked away. (I know, that's a terrible thing to do. I sincerely apologize if any of you on here were the ones who had to put away my buggy today.) I'm incredibly upset. Who touches people without permission? And who the heck doesn't apologize for making someone scream and react in terror, even if it's clearly an accident?",
        "created_utc": 1523582881,
        "upvote_ratio": ""
    },
    {
        "title": "My suitcase went the wrong way around the world.",
        "author": "LinusDrugTrips",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bv0ry/my_suitcase_went_the_wrong_way_around_the_world/",
        "text": "This story is from 6 years ago, but i thought it was interesting enough to share. \nSo I went to New Zealand in 2012. I live in London so it's about the same distance either way around the world. On the way there we stopped off at LA to refuel etc. But, on the way back we went via Hong Kong (it was probably cheaper).\n\nWhen we got back to London, we went to collect our bags. We probably waited about 30 minutes watching the conveyer belt go round, and then went to the staff of the airline we were using to see what the problem was. They asked if any one of us were [my mum's name]. \nThey told us that our bags had arrived a couple of hours earlier on a different flight which had come via LA. So, while we were in Hong Kong, our bags were on almost the opposite side of the globe. \n\nIt turns out that the person in a small airport in a town in New Zealand had messed up because they put the wrong label on the bags. \n\nLuckily our bags got there before we did or we would have been waiting for a while. ",
        "created_utc": 1523578664,
        "upvote_ratio": ""
    },
    {
        "title": "Worst Motel Experience Ever",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bts4y/worst_motel_experience_ever/",
        "text": "[deleted]",
        "created_utc": 1523568036,
        "upvote_ratio": ""
    },
    {
        "title": "Wrong Price",
        "author": "tinamu",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bthba/wrong_price/",
        "text": "Today I was studying at the faculty building with my friends. Being in the Architecture Faculty, we have a studio just for ourselves so most of the time we order food to eat there. Delivery guy called to tell he is outside the building so we went out. When we were about to pay, we realized that the price is not the same. We told the guy what the price should be because we added an extra ingredient but the guy had no clue. Then we asked to see the order ticket, we realized it wasn't our order. In fact, he wasn't the right delivery guy. Our food was around the corner. We laughed and went to the right delivery guy to get our food.",
        "created_utc": 1523565697,
        "upvote_ratio": ""
    },
    {
        "title": "A quilt debacle",
        "author": "tdscm",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bswvb/a_quilt_debacle/",
        "text": "So I’ve felt like crap since yesterday, resulting in me being at home in my bed, sleeping a ton, instead of living my life. \n\nToday I get stir crazy and decide to drag my sorry butt to store for sick essentials. Soup, pizza, vitamin C, the works. I hobble around the store at a snails pace because I’m achy, and on the way out pass the clearance aisle. I decide to take a look, because I may be sick, but I can still appreciate a good deal, you know?\n\nI spy a pretty quilt, and pick it up literally just to inspect it. I don’t need a quilt, I don’t want a quilt, this is purely just for Science. I happen to notice it isn’t marked, and it’s colorful and I like it, but no quilts for me. Once again... I do not need a quilt.\n\nBefore I can put it back on the shelf, here comes a loud woman with a disgruntled employee behind her. “THEY ARE ALL HERE ON THE CLEARANCE RACK,” she yells. “BUT THEY ARE RINGING UP FULL PRICE.”\n\nOh, the drama. I have to stick around, because I live for this kind of stuff. But before I can even think, the lady points at me. “SEE? SHE WANTS A QUILT TOO!”\n\nI go stiff. The employee and the woman peer into my hands, spying the unmarked quilt. The boisterous woman has made me a part of her own agenda. She continues to yell, and anyone who knows me knows that I. Hate. Confrontation. I pretty much never speak up for myself, which gets me into all sorts of weird debacles.\n\nThe yelling lady attracts more customers and before I know it, I’m surrounded by more women admiring these quilts. “What?! Clearance quilts?!” I kid you not, this all unfolds exactly as stated and is not a dramatization.\n\nThey all flock like birds and pick up quilts, multiple quilts, all the while letting the yelling lady question the employee, who was on radio with a manager. She looks at us all and counts us up. “Yes,” she says into the radio. “There’s six of them here and they all want quilts.” She stares into my soul. I relate to her silently, but I’m not sure she can feel my sympathy. She tells us she understands, she tells us the manager is coming, she tells us someone will be fired for this if this is a mistake (I AM NOT JOKING!!!)\n\nMaria the manager arrives ten minutes later, all while the yelling lady is asking, “Where is she?? I’ve got things to do today!” (I also shop for quilts on clearance when in a hurry, lady.) By the way, all the ladies are still huddled into the corner but I’m dead center with my cart and there’s no way to make a discreet escape— and even if I could, I’m invested. I need to see how this ends.\n\nAfter much debacle, Maria states there’s been a mistake. The quilts are not on clearance. Some styles are, but they’re plain and still 40 bucks. “I don’t want that one,” the yelling lady states. “I want this one!!! It’s colorful and pretty!!!!”\n\nMaria stares at her. She stares at the employee. She stares at the quilt.\n\nAnyway, long story short.... I own a quilt now.",
        "created_utc": 1523561350,
        "upvote_ratio": ""
    },
    {
        "title": "got my chicken burger without the bun and vegetables.",
        "author": "vkk20",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8brv1d/got_my_chicken_burger_without_the_bun_and/",
        "text": "a few hours ago i ordered a chicken burger a side of rice, that comes with the burger and a slice of cheese cake from a very well-known restaurant.\n\nafter an hour (which is less the the expected time) the burger came without the bun and vegatbles. i called the restaurant and they told me they will send a fixed order.\n\n the man asked me what my side was and i told him it was rice, but the rice did arrive and is just fine. the man said they will send it again with the meal because i didn't get the full experience. \n\nwhen i got the delivery 20 minutes later, which is very fast, it came with a new dessert.\n\n10/10 customer service. also left another tip for the second delivery man which is something i dont usually do when they mess up, but the service here was so good i felt happy to leave the tip.\n\nedit: spelling",
        "created_utc": 1523553280,
        "upvote_ratio": ""
    },
    {
        "title": "ordered a chicken burger without he bun.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8brs5x/ordered_a_chicken_burger_without_he_bun/",
        "text": "[deleted]",
        "created_utc": 1523552672,
        "upvote_ratio": ""
    },
    {
        "title": "Upset Sandwich Employee",
        "author": "ghostbear15",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bk3cw/upset_sandwich_employee/",
        "text": "Not sure if this goes in this sub or not, so I apologize beforehand!\n\n&amp;nbsp;\n\nWalked into TrainStation today during lunch and it was a lot busier than usual.  This customer seemed to be giving the manager and another worker some problems cuz the worker seemed really annoyed and angry.  He roughly grabbed two chip bags from the display and walked fast towards the customer and just handed it to him without saying anything.  Very awkward.  I've seen this worker before and he's usually really nice so I wasn't sure if it was the customer or if he was just having a bad day.  \n\nThere's quite a few people and orders ahead of me (some online orders), so I'm standing in line for a while and I see him get progressively angrier and more annoyed because the lady in front of me had a bunch of complicated orders and kept asking for things to be put in or taken out.  \n\n\"No, sorry.  I didn't want that.  The jalapenos go on the other sandwich.  No. That one.  Yeah.\"   \n\nI'm getting anxiety at this point lol.  It's finally my turn and I smile at the guy and say \"footlong honey oat please :)\" He kinda sighs and walks to the back to get more honey oat.  Then he looks up at me.  I let him know I want a spicy Italian, again smiling and being polite.  I continue on letting him know what I want on my sandwich while continuing the smile and say thank you, no thank you, or please.  At the end, I say \"and black pepper and that'll be it. Thank you!\"  This is when he surprised me.  \n\nHe cut my sandwich, was halfway done wrapping, then he stopped, looked up at me, and said \"Thank you.  Thank you for being nice.\"  And he smiled.  \n\nI know it's not much, but it really made me feel good.  He probably was having a bad day or had issues with rude customers so it felt nice to make someone else happy.\n\n&amp;nbsp;\n\nTL;DR Worker was annoyed/angry with another customer.  I was friendly/polite and made him feel better.",
        "created_utc": 1523476734,
        "upvote_ratio": ""
    },
    {
        "title": "I apparently need a man with me to buy a pair of bolt cutters",
        "author": "idwthis",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8bb4dp/i_apparently_need_a_man_with_me_to_buy_a_pair_of/",
        "text": "So a little background first. My front door knob broke. It was one of those brass lockable knobs, you know, button on the inside keyhole on the outside. And if my front door were normal, it'd be an easy fix, but no. See, my door opens toward the outside, instead of into the inside of the house like every other front door in existence. Why, I do not know. \n\nAnyhoo, the mechanism inside of the knob and lock just failed to unluck, so it is stuck shut, and no amount of dry graphite to lube up the parts and jiggling the tumblers would get the damn bolt part to slide back in so we could open the damn door. And since it opens out, the door jamb is in the way of getting a table knife or old credit card into the space to get that little twatwaffle lock pushed back to open the door. \n\nSo here I am today, after a good couple of hours of being on my knees with a lockpicking set and a can of the dry graphite staring unhelpfully at me, I decide to just go buy a pair of bolt cutters or aviation snips to just cut through the metal asshole pieces and get this shit out so I can open the damn door and replace it with a brand new knob and lock. \n\nWhy don't I call a locksmith? Because all of the quotes I got were for 200 bucks, and we just had to pay over 300 for a new starter on one of our cars, so our emergency fund is a bit low and hell, I know I can do this. Why pay that much when I can spend less than half of that to do it myself? \n\nI decide to stop at a helpful hardware store, and this *place* was conveniently located next to the office building of my SO. \n\nSo I go in, wander for a second as I text SO that I'm next door if he wants to grab what he needed out of my car that he forgot this morning, and I find the aisle with the tools I'm looking for. \n\nI'm standing there staring at the bolt cutters, and then I go down the aisle to check out the angled aviation snips, trying to decide which would fit better into the doorknob hole and all that jazz. \n\nThen a female employee asks if I need help. I say I'm trying to decide between these two items, and why I'm buying them one or the other. Big mistake. Also, I'm a chick, too, and to have had this exchange happen with a woman working in a hardware store just blows my fucking mind. Me will obviously be me, and E will be employee. \n\nMe: Well, I'm trying to decide between the small bolt cutters and these angled snips, I have a weird problem to fix. \n\nE: Oh? What are you gonna be cutting, honey? \n(I feel I should mention I'm 34, short, and white. The employee is about my age, just a wee bit taller than me, heavyset and black. And I found it weird when strangers say things like \"honey\" and \"sweetie\" or whatever.) \n\nI proceed to tell her what I've told you all already. \n\nBut she didn't understand what I was saying. \n\nE: oh you just gotta get a screwdriver and take out the screws and everything will slide right out. \n\nMe: yes, but the lock broke while the door was closed, it can not be opened, and one of the tumblers seems to have snapped apart, so no amount of jiggling and graphite lube is going to fix that. And I'm not going to pay a couple hundred bucks to a locksmith, when I can just do it myself. \n\nE: Why don't you get your daddy to do it for you? \n\n\nAll of my what here. My dad is dead, and even if he wasn't why the hell does a man have to do anything for me?  Because I'm a tiny little \"girl\" and she thinks I can't use some damn bolt cutters? \n\nMe: I don't have a father. \n\nE: Oh, uh, brother? \n\nMe: No. \n\nAnd I walk away back over to the other end of the aisle to look at the snips again. \n\nAnd that's when the SO strolled in and I went up and kissed him and the employee scurried away. \n\nI tell SO what just happened, he thinks it's funny in a way, and sure, I do too, to some extent. \n\nBut you would think a woman, in a damn hardware store, who must get the occasional man thinking she doesn't know anything because she's a woman, wouldn't be so damn quick to do the same to a woman customer! \n\nI bought the angled snips. And they worked just fine, I didn't need my man, my father or a brother to do it for me. My fingers are a bit stained from the graphite but that's about it. Nothing a little Lava soap won't get rid of.  Everything is set to go with the door, and I did it all on my own like the big girl I am. \n\n\n",
        "created_utc": 1523392433,
        "upvote_ratio": ""
    },
    {
        "title": "New employee smokes",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8b9ena/new_employee_smokes/",
        "text": "[deleted]",
        "created_utc": 1523380714,
        "upvote_ratio": ""
    },
    {
        "title": "‘You didn’t say that!’ Actually I did... several times",
        "author": "Belle-ET-La-Bete",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8b8qok/you_didnt_say_that_actually_i_did_several_times/",
        "text": "A few years ago, I used to manage at a small movie theater. I usually got out around 20 or so minutes after the last movie ended which on the weekends would be pretty late. One of those late nights, I was craving some Golden Arch.\n\nSo I drive over to the local 24 hour one and decide to get the chicken sandwiches with no lettuce (their lettuce is DISGUSTING imo. I won’t touch the stuff. And no, I can’t just ‘take it off.’ It’s hard to pick all the chopped up pieces out and when you hate the stuff, you can just taste it on the sandwich after). I give my order to the guy on the other end but for whatever reason he can’t understand me. I repeat, two chicken sandwiches, no lettuce. He repeats back ‘ten piece chicken NUGGET’\n\nNooooo. Two chicken sandwiches NO LETTUCE. He still hears chicken nuggets. Finally I get so flustered I just yell ‘TWO CHICKEN SANDWICHES!!!’ That time he got it. He apologizes for the miscommunication and puts in two chicken sandwiches. I pull up to the window. Guy apologizes again, I say it’s all good, pay, grab my food and pull out. I pick out a sandwich to start eating and realize that because I had been struggling to get this guy to hear ‘chicken sandwich’ I forgot to tell him on the last order NO LETTUCE. The damn thing is covered In it.\n\nSoooo I pull back around through the drive thru. There’s a couple of cars ahead of me so I have to wait. I get back to the window and that guy is gone. Instead this bigger guy is there and I think he looked like a manager (or at least I thought. Who knows?). So I hold out the bag and explain ‘hi I’m sorry about this I wanted these two chicken sandwiches without lettuce’ \n\nThe guy is incredibly irritated. ‘You DIDNT SAY THAT in your order!’\n\nI’m really taken aback, especially since I thought he was a manager at first. I stay calm and say ‘well actually I said it when I started ordering but there was a pro-‘\n\nThen he SNATCHED the bag out of my hand and started marching away with it.... great. I work as a server and I’m CONSTANTLY telling people it’s okay to tell me if somethings wrong with an order and I’ll get it fixed no problem. But An angry man fighting me on what I ordered working a graveyard shift just didn’t give me confidence in trusting the food....\n\nThe guy came back, wordlessly thrusted the bag in my hands. I ended up throwing the food away and going to bed hungry. :/",
        "created_utc": 1523376127,
        "upvote_ratio": ""
    },
    {
        "title": "Need something?",
        "author": "HatmanMax",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8b5fon/need_something/",
        "text": "I was at a tech shop with a fruit logo. I'm standing near an employee helping another customer. I'm staring at the different versions of the item I need, trying to work out which one. This guy finishes with his other customer, looks over at me and, after a minute, says \"need something?\" in a very uninterested voice. Kinda rude right off the bat. \n\nWe get the transaction dealt with, I pay card on one of their mobile machines and get the receipt emailed. Then comes the worst part... he hands me back my card, as I'm trying to put it away before I start walking he kinda stares at me, and instead of a \"have a good day sir\" or anything like that he just goes \"You're done.\" I walked away before I could think of how to respond. ",
        "created_utc": 1523340026,
        "upvote_ratio": ""
    },
    {
        "title": "She scares us.",
        "author": "BrogerBramjet",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8b49tu/she_scares_us/",
        "text": "  So this is about a friend of mine, not me.\n\nMy friend and his wife leased an upscale SUV.  It was a first model year version (car people just went \"Uh-oh!\").  But this is a company known for it's quality.  He's 6' 5\", she's 5' 4\" in heels.  At the time, she was home with the kids.\n\nThe truck started having problems.  She'd pack up the kids and go off to the dealer.  A week later, another problem, another trip, and another hassle.  After a year, it was getting too much.  Tempers were flared.  Words exchanged.  Next time there's a problem, the service manager, now on first name basis, says to my friend, \"Can you come, your wife scared a couple guys.\"\n\nThe dealer decided to replace the truck with a new one.  A few years later, the lease was up.  They decided to downgrade a little and buy a new one.  Problems?  What Problems?  Runs like a top.\n\nOne Friday, she needs to go out of town to a family thing- like 200 miles out of town.  On the way, she stopped and got an oil change and a safety check.  50 miles from her destination, no power steering.  Got to her goal.  Her brother finds out it's dry.  Fill it up, works fine.  Two hours later, no power steering.  She calls my friend, PISSED!  He calms her and says he'll take care of it.\n\nHe calls the dealer.  Talks to the same service manager.  Tells him what's happening.  \"She has to drive 3 hours to return.  How do you think she'll feel?\"\n\nThere's a pause.  \"When she comes in Monday morning, we'll have a new &lt;top model&gt; gassed up, ready to go, free of charge.  We'll move over the kids seats and she can leave.  When we find and fix the problem, we'll deliver the truck to you.\"\n\nTurns out the guy checking it out had over tightened the cap on the power steering fluid and twisted the reservoir cracking it at the housing.  Just enough to bleed off the fluid over time.",
        "created_utc": 1523327721,
        "upvote_ratio": ""
    },
    {
        "title": "She Wants a What?",
        "author": "CFODad",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8b3y1g/she_wants_a_what/",
        "text": "So my wife is in hospice and really does not eat much anymore. A little earlier on in hospice she would get hungry for very specific things that were sometimes odd. One day she says she would like a Chateaubriand (we had shared one on a special night years ago so maybe that was the reason).\n\nWe are in “whatever you want” mode so someone googles up a location and I make the call. It’s a very nice restaurant that doesn’t do To Go so I explain the situation. The manager gets on and says it will be ready on 20 minutes.\n\nWe arrive and the manager and two other employees have the steak with two soups. I realize this guy must be familiar with Hospice to include the soups when I notice the chef has cut the Chateaubriand into very tiny pieces understanding that’s probably all she could handle and we wouldn’t have quality steak knives at a hospital.\n\nBrought tears to my eyes and one day I will return to this place. I talk it up every chance I get.\n\nShe ate like two bites but it was worth it.\n",
        "created_utc": 1523324672,
        "upvote_ratio": ""
    },
    {
        "title": "another microsoft one?",
        "author": "Brokenmindrig",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8b3dx4/another_microsoft_one/",
        "text": "[removed]",
        "created_utc": 1523319685,
        "upvote_ratio": ""
    },
    {
        "title": "Dear irate customers",
        "author": "Thisdeepend",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8b30ne/dear_irate_customers/",
        "text": "[removed]",
        "created_utc": 1523316348,
        "upvote_ratio": ""
    },
    {
        "title": "Random gal at fast food drive-through paying for my mom's drink",
        "author": "pulsar512b",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8b2365/random_gal_at_fast_food_drivethrough_paying_for/",
        "text": "Hey! So, this story is *technically* not mine, but my mom's. So, she was going up to buy her coffee by the drive-through. She orders it, and when she goes up to pay, the guy tells her the person in front payed for her drink. She waved at the person. She noticed the person had an out-of-state license plate. Sadly, she didn't pay it forward.",
        "created_utc": 1523308641,
        "upvote_ratio": ""
    },
    {
        "title": "I knew dealerships were bad, but....",
        "author": "hennem11",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8b1yxh/i_knew_dealerships_were_bad_but/",
        "text": "I’m a 22 year old female. I’ve heard all sorts of horror stories about young women trying to buy cars and basically not being taken seriously at dealerships, but I decided I could handle it. \nSome backstory: My mom bought my first car. It was a bomb car and my 17-18-19 year old self did NOT know how to care for it. I went away to school a few hundred miles away, and the long drives did some damage. Finally, after 7 years of diligent service, my poor little car sprung an oil leak that I didn’t happen to pay attention to, and I locked the engine up. \n\nI found a car of the same make and model, just a few years younger, for a reasonable price on one of those websites that list dealerships alongside owner-sold vehicles. I thought it would be my best bet, and I hitched a ride to the dealership to seal the deal. \n\nThe salesman was a little pushy at first, but then understood that I was there to buy This Car, not That Car, or even This Car But Look It’s Got Better Milage/It’s Younger/Costs More Money. The actual purchase of the car went pretty easily.... \nUntil the next morning, when the check engine light came on. \n\nI called the sales guy back at his personal number and left a brief message. I had checked all the things you should when your CE light comes on (gas cap tightened? Check the oil? Etc) and told him so. He got back to me later on that night. He called me by the wrong name (kinda understandable but I also just wrote you a check for ~$6000? And I told you my name twice in my voicemail?) but we decided it could be worked out. He told me to come in and pay for it to be serviced at their service center. Here’s where it all went wrong. \n\nI wanted to know if the dealership had known something was wrong with my car when they sold it to me. It just seemed a little sketchy that the light came on less than 24 hours after I bought it. I asked for a copy of all of their records related to assessment and intake. Easy enough, right? \n\nThe sales guy emails me page one of a two page document noting that they changed the oil and checked the other fluid levels. Not what I asked for, so I emailed him again. \nCue radio silence for days. \nI send him another email. Nothing. \n\nAt this point I decide to look up his manager at the dealership. I call and get his voicemail. I tell him exactly what’s going on. \n\nAt this point I know what’s wrong with my car: charcoal canister. The part is quoted to me at ~3-400$ by NamelessAutoPartStore. \nI call the Used Sales Manager FIVE DAYS IN A ROW YOU GUYS. I leave all the same details. \nI’m emailing the sales guy. I’m texting him. I’m calling both of them and getting NO RESPONSE! \n\nAt this point I’m 100% convinced that they sold me a car that they knew had an expensive, faulty part and are trying to get away with it or think that I just won’t do anything. And I definitely don’t want to just pay them more money- they’re quoting me ~700 for the part, plus labor! \n\nPerhaps the most infuriating thing is that every week, I’m getting auto-generated emails from the sales manager like “Do you love your new car? We bet you do! :)” every time I responded to these emails, I was ignored. \n\nAll in all, I never got a call back until I filed a complaint with the BBB and left a scathing Google review a whole month later. Then the Sales Manager called me, saying the salesman said it had been taken care of, and he had no idea what was going on, despite my five increasingly frustrated voicemails. Yeah, right... At least they ended up fixing it! Never again with a dealership, though. Never again. \n\nEDIT: sales guy didn’t email me to ask about my cat. ",
        "created_utc": 1523307728,
        "upvote_ratio": ""
    },
    {
        "title": "/r/TalesFromTheCustomer is looking for mods!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/needamod/comments/8b1n8s/rtalesfromthecustomer_is_looking_for_mods/",
        "text": "[deleted]",
        "created_utc": 1523305311,
        "upvote_ratio": ""
    },
    {
        "title": "Server rubbed me wrong at the last minute",
        "author": "crazybitch19",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8ay1ni/server_rubbed_me_wrong_at_the_last_minute/",
        "text": "My SO and I were out at a great little Korean place for lunch; known for its delicious food rather than for its less than stellar service. This time was different, the food was amazing and so was the server. \n\nShe was helpful, attentive, polite, and just overall gave solid service. Then things went a little south while I tried to pay. I messed up, I couldn't find the right button on the machine to input a tip. There was no one around to ask so I figured, what the heck, and skipped it. Before you worry, I didn’t decide to not tip or anything, I had just remembered that I had change in my pocket. \n\nSo, I finished up paying and went to my table where my SO was, along with my stuff. I had a $5 bill in my hand and the server came up from behind me and practicing her projection said, “YOU KNOW, tips aren’t included in this price” pointing at my receipt. Flustered, I told her I was tipping cash and was going to leave it on the table, flashing the $5. I think she was surprised, she even asked if I wanted change back. I just held it out to her and then left as fast as I could.\n\nI have really bad social anxiety, I understand that no server wants to get stiffed, but ‘calling me out’ for it was not cool or appropriate. Especially as she did so quite loudly, in front of the other three or so tables that were around, without even checking the table or waiting to see if I left a cash tip. \n\nI am not one to not leave a tip, but man did she ever make me want to take back my tip. I realize this isn’t a super interesting story, sorry for the low dose of drama but it shook me up and I needed to vent. \n",
        "created_utc": 1523277075,
        "upvote_ratio": ""
    }
]