[
    {
        "title": "Basically Every Tech Support Call I've Had Ever",
        "author": "GlissandosNTrills",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/516s01/basically_every_tech_support_call_ive_had_ever/",
        "text": "Me: Okay so we've finally resolved your issue after 45 long unpleasant minutes of getting you to follow simple directions. Is there anything else that I can help you with?\n\nCx: Actually yes there is, and it's really simple but I'm going to overcomplicate the hell out of it for shits and giggles and then blame you for it.\n\nMe: Awesome! I'm totally looking forward to listening to you whine for 45 more minutes and not listen to a word I say. Excuse me while I examine my life choices and contemplate suicide for the remainder of this call.",
        "created_utc": 1473034287,
        "upvote_ratio": ""
    },
    {
        "title": "Account Verification: Weird Secret Questions and Answers!",
        "author": "OctopusDarling",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/514z4s/account_verification_weird_secret_questions_and/",
        "text": "At my previous job we would often use the secret question / answer as an extra verification method with live contacts. Some of the more interesting ones I've heard come from extremely old people or younger teens. Here are some examples:\n\n* Name of your first pet? - Dildo (She said it was a cat that always purred)\n* Who was your childhood hero? - Satan (I actually had to get the kids mom on the line because he wasn't old enough to make account changes...and he had to tell her the answer)\n* Where was the first place you flew? - Airport (...)",
        "created_utc": 1473010219,
        "upvote_ratio": ""
    },
    {
        "title": "Thanks for the flowers, but now what?",
        "author": "SurrealExpressionist",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/513whd/thanks_for_the_flowers_but_now_what/",
        "text": "Hey guys,\n\nLTL;FTP\n\nSo I used to work for a a well known dept store (DS). I was the person that placed orders for customers and sort out issues with payments, loyalty cards, etc etc.\n\nI got a call from a pension-aged lady one time asking about a cardigan. \n\nPension-aged lady: $PAL\n\n\n&gt;$Me: Hi, there. Your through to DS' customer service team. You're speaking to Surreal. ^([Asked security questions which she passed]) How may I help?\n\n&gt;$PAL: Hi Surreal.  My flowers came through today. They were very lovely, and came in plastic wrapping. My vase came with them too.\n\nNow, when I heard this I thought great! This'll just be a customer wanting to leave a good review for the store. Yeah, no.\n\n&gt;$Me: Oh, thanks, PAL. What can I do for you today?\n\n&gt;$PAL: Well I don't know what I should be doing next. What do I do?\n\n&gt;$ME: ......Ummm. Okay. So PAL, the next step is to fill the vase with some water. About half of the way. Then proceed to take the wrapping off the flowers and put them into the vase.\n\n&gt;$PAL: BUT HOW DO I DO THAT?!!\n\nSo I repeat the steps once more and she's not having it. Insists on speaking to a manager; which wasn't going to happen for this type of call. Hell would freeze over first. \n\nSo I look over to one of the new employees that I just trained. He was free. I switched computers with him and told him to give this lady the same steps as I did. She accepted, and told him that I had no idea what I was doing. Okaay.\n\nGladly, I no longer work there, but have so many stories.",
        "created_utc": 1472994528,
        "upvote_ratio": ""
    },
    {
        "title": "Punishing You Makes You Happy",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/513nbs/punishing_you_makes_you_happy/",
        "text": "Warning: this is less a story than a tirade. Somehow, *somehow* I made it through without swearing.\n\nDress codes are degrading. I spent so many years in call centers that my whole wardrobe eventually converted over to \"biz-cas\", that perfect look that says \"if I don't wear this type of shirt and this type of pants someone will yell at me.\"\n\nOh the dignity, the utter *self respect* I am afforded by living in an environment where someone can tell me what to wear like I'm 7 years old and being yelled at by my mom... gosh does it ever make me feel *great*...\n\nA lot of call centers have little cliques of people who spend a ridiculous amount of time fretting over dress code. They'll debate allowable numbers of inches for shoulder straps and skirt hems for women, and make sure men don't wear jeans and tuck their shirts in.\n\nThese entitled little... come on man, you can write this post without swearing... these people often spend their days hunting for someone who dares step out of the rules of dress code and reporting them, *demanding* that someone *do something*.\n\nI had a blue shirt once. It was comfy. I loved it, actually. But unfortunately when seen from across the call center (a half football field away) it looked like a jean shirt... so I was sent home without pay to change it, and was expected to come back and complete my shift.\n\nThey did this all the time. You can imagine the utter humiliation of even just seeing a coworker have to put up with this, let alone having to go through it yourself. It degrades us all the moment it happens.\n\nI remember asking at different places why they were doing this to us. Surprisingly the answer was the same no matter where I went: \"Because when you dress good you feel good and when you feel good you work better.\"\n\n***Excuse me, do I look like I feel good right now?***\n\nI swore revenge but never came up with a way to get it, other than to eventually escape call centers entirely and live in a world where jeans and a t-shirt are a basic staple of a normal human being's wardrobe.\n\nBut I remember the one guy giving me that line, a real kool-aid drinker who through a big grin with teeth like a piano keyboard told me that keeping the dress code \"up to a certain level\" made people feel good and more productive.\n\n\"But... aren't I the best authority on what makes me feel good? Because I'm pretty sure feeling uncomfortable about my clothing choices makes me feel bad.\"\n\nHis expression... it wasn't that he was confused, because that would indicate that he actually thought about what I'd said... more like he was wondering why I didn't understand his obviously correct insight.\n\nRarely have I been more tempted to violence in the workplace.",
        "created_utc": 1472989215,
        "upvote_ratio": ""
    },
    {
        "title": "Slurring by the end of shift.",
        "author": "nntndo",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/512llk/slurring_by_the_end_of_shift/",
        "text": "Has anyone else ever had an issue with slurring towards the end of a long shift? We've had a lot of people quit lately, back to back calls, and changes in service that are causing a lot of misdirects. \n\nBecause of this, instead of saying my greeting 70-80 times a day, it's moving towards 110-120. I notice that i begin slurring towards the end of my shift. Does this happen to anyone else? My co-workers think I'm crazy, but jaws hurt like crazy. \n",
        "created_utc": 1472964772,
        "upvote_ratio": ""
    },
    {
        "title": "I hate what this job has turned me into, so I'm starting over.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/512aex/i_hate_what_this_job_has_turned_me_into_so_im/",
        "text": "[deleted]",
        "created_utc": 1472959357,
        "upvote_ratio": ""
    },
    {
        "title": "No, I'm not an attorney",
        "author": "LookingForScaryStuff",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/511ik3/no_im_not_an_attorney/",
        "text": "Before the story starts I want to say that I'm typing this on my phone so sorry for any mistakes this story may have. \n\n\nCurrently I have a job at another call center that some family and close family friends work at. It's fun because I know people there. It's a small place but this story takes place at the last call center I worked at. I won't give names but they were corporate and well.....treated their workers like machines rather than functional human beings. This happened halfway through my time there and this is one call I won't forget.\n\nThe company I worked for had several accounts for law offices and we took messages for them. One day I got a call from a very \"polite\" gentleman. Let's call him D.\n\n*call pops up on my queue*\n\nMe: Law Offices, how may I help you?\n\nD: Yeah I need to speak with an attorney or lawyer or whoever can help me.\n\nMe: Alright sir, what seems to be the issue?\n\nD: I got thrown out of a ambulance.\n\n(I go quiet letting myself soak up what I just heard.)\n\nMe: I apologize for what happened sir. I can take a message and send that to someone who can call you back. They can help with the problem.\n\n(Caller gives me his info and type it down with a bit of small talk.)\n\nMe: Alright si-\n\nD: Are you an attorney or lawyer?\n\n(Pausing to silently take a deep breath)\n\nMe: No sir I'm just an answering service.\n\nD: Are you some type of dipshit?\n\nMe: I'm sorry?\n\nD: I need to talk to a lawyer or an attoney!! Not for you to take some dumbass message so I can sit on my ass and wait!!!\n\nMe: Sir I apologize but I can only take a message.\n\n(Caller goes quiet for a moment.)\n\nD: I told you I need to speak with a lawyer or an attorney. You some type of dipshit?\n\n(By now I couldn't care less for what this caller needs. I disregard what he says.)\n\nMe: Sir can you hold for just a moment?\n\nD: Don't you fuc-\n\n(I cut him off before I could let him insult me more)\n\nI raise my hand and my supervisor comes over and asks what's up. I tell her my story and she tells me that she'll take the call. I transfer it over to her.\n\nFrom what I heard, D used some racial slurs because my supervisor has a African-American name. \n\nI quit the job I had at that call center three weeks later.",
        "created_utc": 1472947129,
        "upvote_ratio": ""
    },
    {
        "title": "Stupidity So Common It's Cliché",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/510eqr/stupidity_so_common_its_cliché/",
        "text": "Working the 'ol residential Internet tech support line one night. \n\n\"You need to get someone out here! The Internet isn't working at all! We're trying to run a business here!\"\n\nDude watch the attitude... I could cut your service off completely for only paying the residential rates... deeeeep breath...\n\n\"Okay, so what does the browser say right now? What kind of error are you seeing?\"\n\n\"Nothing, it's just blank!\"\n\nBlank? Maybe... a really slow website?\n\n\"Sir can you try just going to the address bar and type in Google.com and hit Enter?\"\n\n\"Okay...\" I hear him one-finger typing excruciatingly slow, with a big loud POK for striking that Enter key. \"Ya, nothing. Nothing at all.\"\n\n\"So you're not even seeing an error message?\"\n\n\"Nope, no error.\"\n\n\"Hmm well we'd normally get some kind of error... alright well let's get back to basics: can you unplug the power to the modem, give it about ten seconds, and then plug it back in?\"\n\n\"Can't you just send somebody out?\"\n\n\"Sure, but let's do these basics first. I'd rather just have you up and running right now, wouldn't you?\"\n\n\"Ugh, I guess... Just a sec.\"\n\nHe puts the phone down and comes back like 5 minutes later. I have no idea what he's been up to.\n\n\"Ya I'm hitting Enter and nothing is happening.\"\n\n\"Okay but did you unplug the modem and plug it back in?\"\n\n\"Yes I'm not an idiot! And now I'm typing... hang on let me try it again, G, O, O, G... where's the L, it's so hard to see in here it's really dark...\"\n\n\"It's dark in your office?\"\n\n\"Ya there's a power outage.\"\n\nThere's a... motherfffffffff..........\n\nGod... I'd heard of other people taking this call. I've heard of other people troubleshooting unplugged stuff, trying to get modems working in flooded rooms, during hurricanes, etc... always thought they were making it up. Always thought they were lying. And then it happened to me. \n\nWow.",
        "created_utc": 1472931534,
        "upvote_ratio": ""
    },
    {
        "title": "Nice Empathy There...",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50ytlx/nice_empathy_there/",
        "text": "Was working a cable TV customer service job, guy calls up to talk about his overdue bill, ends up breaking down in tears.\n\nHis wife left him. For his best friend.\n\nNow he wasn't asking for any special treatment and we'd already sorted out a course of action, so for the most part I'm just talking to him as one human being to another.\n\nHim: \"I can't even keep up with my basic utility bills and my ex called me up to talk about the steak dinner they were on...\"\n\nMe: \"Oh man I am so sorry...\"\n\nThe tears are just getting worse. The guy is having a meltdown.\n\nUnfortunately I was new... and I hit a button that I thought would just switch screens but... I hung up on him.\n\nOh crap oh crap he's gonna kill himself or something...\n\nSo I call my supervisor over. I tell him I had a guy who was totally breaking down on the phone, etc etc, and I accidentally hung up on him.\n\nSo my supervisor goes: \"Wait for it...\"\n\n\"Wait for what?\n\n\"Sshh sshh sshh...\" and he's got his finger pointing in the air and he's looking like he's listening for something. \"There. He shot himself. You can move on to the next call now.\"\n\nHe smiles, gives me a slap on the shoulder and moves on.\n\nDang.",
        "created_utc": 1472909684,
        "upvote_ratio": ""
    },
    {
        "title": "Awkward moment from a political \"survey\" job.",
        "author": "sash5034",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50yl40/awkward_moment_from_a_political_survey_job/",
        "text": "Quotation marks around survey because they were glorified campaign ads for whoever paid for them, but I digress.\n\nThe phone system worked with some sort of auto dialer. Call comes in.\n\nMe: Hello -introduction-\n\nKid who answered phone: Um hello...\n\nMe: Is there an adult I can speak to? \n\nKid: Um my dad is in the shower...\n\nMe: Okay, what about your mom? \n\nKid: Um my mom is in the shower...with my dad...\n\nMe:......okay then, I'll call back later.\n\n\nI have more stories, mostly painful.",
        "created_utc": 1472905451,
        "upvote_ratio": ""
    },
    {
        "title": "[Advice] My training begins on Monday.",
        "author": "IIMisakiII",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50y64z/advice_my_training_begins_on_monday/",
        "text": "[removed]",
        "created_utc": 1472895779,
        "upvote_ratio": ""
    },
    {
        "title": "Perfomance dropping- any advice?",
        "author": "Souzy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50y0r3/perfomance_dropping_any_advice/",
        "text": "So I do outbound market research. \n\nI do it pretty okay on most days, getting enough interviews. \n\nBut the last 2 days I had 1-2 interviews in 4 hours! That´s not okay.\n\nBut I didn´t change anything about the way I talk or work..\n\nI would like to know from you if there are maybe factors I am overlooking here or blind spots I don´t see myself but which are important from your experience.\n\nWould be thankful for any ideas or advice. \n\nAs I said, I didn´t change anything, most days I had enough interviews but the last 2 days were a bummer and I really don´t know why. ",
        "created_utc": 1472892158,
        "upvote_ratio": ""
    },
    {
        "title": "My biggest pet peeve",
        "author": "WeaponizedOrigami",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50x8qe/my_biggest_pet_peeve/",
        "text": "Me: \"All right; can I have your mailing address, please?\"\n\nCustomer: \"It's 123 Babbling Brook Lane....hello?\"\n\nMe: \"Yes, ma'am?\"\n\nCustomer: \"Yes, it's 123 Babbling Brook Lane, apartment 12....hello?\"\n\nMe: \"*Yes,* ma'am?\"\n\nCustomer: \"Okay, so it's apartment 12, and it's in Petal, California....hello?\"\n\nMe: \"*Yes?*\"\n\nCustomer: \"Why aren't you saying anything?\"\n\nMe: \"I'm waiting for you to give me your zip code.\"\n\nCustomer: \"Oh! It's 12345!\"\n\nMe: \"*Oh*kay, so that's 123 Babbling Brook Lane apartment 12 in Petal, California 12345?\"\n\nCustomer: \"Yes. The call dropped a couple times there, I'm glad you got all that.\"\n\nTHE CALL DIDN'T DO SHIT, YOU JUST STOPPED TALKING.\n",
        "created_utc": 1472875852,
        "upvote_ratio": ""
    },
    {
        "title": "Well, one of us shouldn't make assumptions...",
        "author": "WeaponizedOrigami",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50wzu4/well_one_of_us_shouldnt_make_assumptions/",
        "text": "Customer: \"I want to do X on your website.\"\n\nMe: \"Our website actually does not support X, you'll need to do Y instead.\"\n\nCustomer: \"You shouldn't make generalized assumptions.\"\n\nMe: \"I'm sorry? Unfortunately X is just not supported by our website.\"\n\nCustomer: \"But you don't know *why* I'm trying to do X.\"\n\nMe: \"Unfortunately, X will not work at all, no matter the reason. You would need to do Y.\"\n\nCustomer: \"But you don't even know my situation!\" \n\nThen we had a circular conversation about how our website works, really, this is how it works, this is how it's always worked, you're just gonna have to take my word on this. ",
        "created_utc": 1472871601,
        "upvote_ratio": ""
    },
    {
        "title": "Tier 2s and Team Leaders, what is the worst escalated call that you had to take?",
        "author": "Clbull",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50weh1/tier_2s_and_team_leaders_what_is_the_worst/",
        "text": "",
        "created_utc": 1472862447,
        "upvote_ratio": ""
    },
    {
        "title": "Yeeees",
        "author": "Nevrend",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50vsbf/yeeees/",
        "text": "Instead of getting annoyed with stupid questions now I Just say this in a weird voice. \"Yeees.\" Sort of sounds like Jerry Seinfelds stomach voice with George if anyone remembers that. The funny thing is it works. The customers seem to get it that their question is so dumb it doesn't deserve a serious response. ",
        "created_utc": 1472853980,
        "upvote_ratio": ""
    },
    {
        "title": "Literally on the call center floor laughing",
        "author": "butterfly1334",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50uwm3/literally_on_the_call_center_floor_laughing/",
        "text": "Some guy called to complain about the taste of our product and my rep said \"what does it taste like\" and he said \"a lady\" and she didn't get what he meant so she said \"what does a lady taste like\" and he said \"urine\"  OMG I literally laid in the floor laughing",
        "created_utc": 1472843178,
        "upvote_ratio": ""
    },
    {
        "title": "\"She hurt my feelings\"",
        "author": "municipalitybee",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50uete/she_hurt_my_feelings/",
        "text": "Just had this conversation with a water customer :\n\nCustomer: Why would you turn my water off on the same day the cutoff notice said I had to pay?? \n\nMe: It looks like your account hasn't been completely paid off since February, so it would be higher on the cutoff list. \n\nCustomer: BITCH YOU DON'T PAY MY WATER BILL WHAT DOES IT HAVE TO DO WITH ME NOT PAYING OFF MY BILL SINCE FEBRUARY FUCK YOU BITCH \n\n*click*\n\nThen she called back and told a coworker I had hurt her feelings... For answering her question. ",
        "created_utc": 1472837521,
        "upvote_ratio": ""
    },
    {
        "title": "So this just happened.",
        "author": "SirGuido",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50tlh7/so_this_just_happened/",
        "text": "Just worked my way through a call with this quiet sullen sounding customer and at the end, as usual I asked if there was anything else I could help him with.\n\nC: Yes, there is.  I need you to do something important for me.\n\nMe: Ok?\n\nC: And I am deadly serious about this.\n\nMe: yes, sir?\n\nC: You have a great weekend and enjoy your holiday ok?\n\nMe: Absolutely!  Thank you sir!\n\n\nSometimes customers are awesome.",
        "created_utc": 1472827849,
        "upvote_ratio": ""
    },
    {
        "title": "Enjoying the positive people!",
        "author": "ShyguySquid",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50tk6d/enjoying_the_positive_people/",
        "text": "Happened a couple of weeks back but helped out a customer in Telstra (Large Telecommunications Company within Australia) who had some major issues with their phone that they got from a store; called through to me of course for a different issue that was easy to resolve quickly thankfully.\n\nCustomer said they've been having an issue though with their mobile and had a complaint raised via the Telecommunications Ombudsman and usually that's a red flag to get out of the call but being who I am decided I can have a look at it to see if I can at least look at what was happening and possibly help with anything but of course gave no guarantees that I could even touch it if a complaint had already been raised as the process is typically to go to the complaint case manager.\n\nHad a look at seemed there were a few issues as they had been put on a plan that lost a feature that allowed them to upgrade their phone due to being moved onto a plan that comes with no phone. And this issue brought through a few avenues in the company so I was quite confused at that point that no-one was able to solve it.\n\nI offered a new phone on a plan; threw in some discounts with approval from my manager and customer accepted it as a resolution for the complaint and it was at that moment once everything was really resolved I realized I followed the wrong process for a TIO complaint and that I resolved it by accident.\n\nCustomer was thrilled in the end and loved my work and that was the main thing; after the call I called through to the complaint team and said to them that this complaint has been resolved and left full detailed notes about it and that it was eventually forwarded on to the case manager and the complaint was resolved as well.\n\nThen a couple of hours later; [this was forwarded to me via. our social media team.](http://i.imgur.com/3qbib4z.png) Made my day that the customer was so thrilled so I really do enjoy working in a call centre. A lot of people say it's monotonous work but there's not many jobs where I can work away on someone's account while having friendly bants with someone and it's these kinda things that really make it great to work for.",
        "created_utc": 1472827408,
        "upvote_ratio": ""
    },
    {
        "title": "Oh you were \"hacked\", were you? Okay...",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50t0fu/oh_you_were_hacked_were_you_okay/",
        "text": "Recently I posted about a mom who [wouldn't take responsibility for her kid](https://www.reddit.com/r/talesfromcallcenters/comments/50ms8j/refund_denied_happy_sigh/). Well, sometimes it's man-children who can't take responsibility for themselves.\n\nThere are a few games out there that appeal to men, and generally involve fighting with other players over territory. They're easy to find: just look for an icon with an angry screaming face. Boom, you found one.\n\nWhile some play it in teams and strategize, there's always the option to \"pay to win\". You can just buy resources, buy larger armies, buy upgrades, whatever, and boom, you are teh winrar.\n\nI've fielded calls where guys were angry that our system shut them down because they were spending too much. One guy called once a week to have our techs unlock his account because he literally spent ***thousands a week*** in one of these games, totaling well over my annual income every two months, and there was just plain no way to convince our system that this was normal, authorized behavior. These guys were fun to talk to actually... real chill. I mean, if you had that kind of money to blow on stupid blips on your phone you would be pretty chill too.\n\nBut this story isn't about that guy. This is about a guy who thinks he figured how to get free credits by calling in.\n\n* Dude: Ya there are all these charges and I didn't do them.\n\n* Me: Okay let me look... oh I think I see them. From \"Super-Duper Manly War\"?\n\n* Dude: Ya that. I don't even know what that is. I think I was hacked.\n\n(I look at his account. This has been a thing with him. He's called twice already for refunds claiming he was \"hacked\"... got one for $10,000, another for $13,000. He's going for $15,000 this time, getting bold. \n\nStrictly speaking, if there's a legit security concern we disable the account... but that's a one-way trip. There's no bringing an account back once we do it. We treated them as \"accidental\" in the past because there's only ever been the one phone on his account. Account notes say they went through password changes, locked in-app purchases on his device, etc.\n\nI give him one last out...)\n\n* Me: Okay looks like this has happened a couple of times before... do you have more than one phone in the house?\n\n* Dude: No it's just one phone.\n\n* Me: Okay and it's the same phone that downloaded XYZ app yesterday?\n\n* Dude: Ya, I'm talking on it.\n\n* Me: Okay... so here's the difficulty: this happened a couple of times already now and we changed the password and locked in-apps. There just isn't a hack that can pretend to be your phone, honestly that's just beyond impossible, so that leaves us with just one option and just one option only: someone entered a code to switch in-apps on, and then someone knew your new password and entered that too. Sooooo... do you think maybe instead of being hacked, maybe this was... an accident?\n\n* Dude: No absolutely not nobody else uses my phone and I didn't do it so I know for sure I was hacked! Your security sucks! Just give me my refund!\n\n(You asked for it... )\n\n* Me: Oh wow. Well we take security issues very seriously and since you're positive you were hacked, we're going to take actions accordingly.\n\n* Dude: Finally!\n\n* Me: Okay, so I've permanently disabled your account due to this security threat, and I'm arranging for a refund now...\n\n* Dude: Wait... what?\n\n* Me: Oh, I disabled your account. You won't be able to use this login to make purchases ever again, but neither will your hacker. Since it's pretty clear you don't spend any money you can just create a new account and re-download your free apps...\n\n* Dude: Don't disable my account!\n\n* Me: Well we have to. It's really not an optional thing. If someone is hacking this account and password changes don't help, this is what needs to be done to prevent a hacker from using your credit card. It's basic security policy.\n\n* Dude: But I won't be able to access... um...\n\n* Me: Oh don't worry looking at your account your legitimate downloads were all free stuff anyway. They can be re-downloaded under the new account.\n\n* Dude: Can we reverse that though?\n\n* Me: Oh no don't worry. It's permanent. There's no possible way anybody will ever access this account to make \"hacked\" purchases ever again.\n\n* Dude: ... okay.\n\n(Kiss your game account goodbye man. Evil grin.)",
        "created_utc": 1472820071,
        "upvote_ratio": ""
    },
    {
        "title": "\"What am I meant to do now!?\"",
        "author": "sledgehammer7",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50rqn8/what_am_i_meant_to_do_now/",
        "text": "I used to work for a mail order company that sent out sweepstakes promotions to hundreds of thousands of households around Australia and New Zealand (our office was based in Australia).  If you live in AU or NZ you've probably received one of these letters at some stage.\n\nThese sweepstakes letters were designed so that to be eligible to win the prize you had to buy one of our products but the wording on the letters made it sound like you were either already the winner or had been selected in a very small group of people to be eligible to win.  These sweeps letters would explain in pretty exciting language how we would hold an official ceremony in Sydney to present them with their prize money and it would include a big dinner function for them and their family, sightseeing cruises around the harbour, etc, etc. The prizes really did exist and people really did win them but your chances of winning were something like 1 in 4 million for every entry you made and the prizes were only drawn once a year, even though we sent out sweeps offers pretty much every day.\n\n*Side note: I don't know how we weren't continuously sued. In my opinion the wording was totally misleading but I guess there were enough terms &amp; conditions included to skirt around any legal issues. The marketing team used to change up the wording pretty regularly but it was always some variation of the same thing.*\n\nWorking in the call centre for this company meant that every 3rd or 4th call was explaining to someone that they weren't actually the winner and that the letter was an invitation to enter the draw in return for buying a product. It got very tiring but we had some great scripting that defused the majority of these calls without needing to be escalated.\n\nFrom time to time we had to deal with people who would walk into our building with these kinds of queries. Normally our receptionist would handle it but when a more complicated issue would come up one of our call centre team leaders would be dispatched to attend to the matter.\n\nOne of the most heartbreaking situations that I head to deal with occurred one day when I got a call from our receptionist asking for me to come downstairs and speak with a customer who had arrived. I should have asked for more information at that point to prepare myself but I disconnected and went down to find out what I could do to help.\n\nI stepped out of the elevator into our reception area and I could see a little old lady (OL) probably in her 80s sitting and waiting for me with a stack of sweepstakes letters in front of her. I greeted her and sat with her and she explained how she had been a customer with us for a long time and that she was so excited to have finally won the big prize. The draw usually took place in December each year but this interaction happened in April, if memory serves.\n\nAs with many of our older customers, they love to chat and rather than diving straight into explaining why she hadn't won, I engaged with her a bit to try and build a bit of rapport and asked her about how long she'd been buying from us.\n\n&gt; OL: Oh, I've been buying from your company for years and years. My husband and I live in a small town in country New Zealand and we always do a lot of our shopping by mail order. We've got 3 children and 8 grandchildren and we buy all of our birthday and Christmas presents from you because it's so nice to pick from the catalogue\n\n&gt; Me: That's lovely! Do you enter the sweepstakes very often?\n\n&gt; OL: Yes! We've been entering for a very long time. I thought we'd never win a prize but look at these letters. My husband couldn't believe it when I showed them to him. Here take a look!\n\nShe excitedly pointed me towards the pile of letters in front of her and I picked one up to check it out in the extremely minute chance that it was a confirmation of winning (although if memory serves we did all confirmations by phone at that point). I noticed that the address at the top of the letter was a NZ location. I could also tell that it was one of our more recent sweeps offers - definitely not a winning letter.\n\n&gt; Me: Oh, I see. By the way, are you here on holidays? I noticed that these are addressed to you at a New Zealand address.\n\n&gt; OL: On holidays? Oh no, dear. We don't really have the money to take trips... well, up to now at least!\n\n&gt; Me: Ah... (sinking feeling)\n\n&gt; OL: It's so exciting that we were able to bring our family to let them see us win the big prize, finally. My daughter kept saying that there was no chance we would win but here we are!\n\n&gt; Me: So, if you don't mind me asking, how many of your family are here with you?\n\n&gt; OL: Well, it's me, my husband, my daughter and her son, my son and his wife and their two children. My youngest and his family couldn't make the trip because of work.\n\n&gt; Me: And you've all made the trip over from New Zealand together?\n\n&gt; OL: Well, my daughter and her son live in Perth but we got them tickets to meet us here. Everyone is so excited.\n\nI didn't really know what to do. This was way beyond my authority to deal with. This old lady had brought herself and 7 of her family members to Sydney to watch her win a prize that she hadn't actually won. I felt absolutely sick. Had she called us before doing anything we could have explained that she hadn't won and she wouldn't have spent all of that money on flights but in her excitement she had convinced everyone else that she had won and nobody in her family had actually looked at the letter and seen that it was just one of our regular sweeps offers.\n\nI had to leave her there and get our customer service manager who in turn had to get our marketing director involved. After breaking the news to her about her mistake and the ensuing tears and drama, we offered to put her and her family up in a nearby hotel because they hadn't actually booked any accommodation. The rest of her family had been waiting in a pub across the street. We made arrangements for them to be flown back to their respective homes but I can't recall whether we offered to reimburse her for her flights over. I don't think we would have as it was her error in the first place.\n\nAfter this situation, I had to really think about whether or not I could continue to work there. Whilst this was the worst one I ever had to deal with, I couldn't in good conscience continue to defend a company who would try and mislead people into buying products with the slim chance of winning a prize. I quit that job shortly after.",
        "created_utc": 1472794806,
        "upvote_ratio": ""
    },
    {
        "title": "Sir, if you would stop yelling at me I could explain.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50rqjp/sir_if_you_would_stop_yelling_at_me_i_could/",
        "text": "[deleted]",
        "created_utc": 1472794754,
        "upvote_ratio": ""
    },
    {
        "title": "Have an interview at a call center tomorrow. Please help me with what types of questions they will ask.",
        "author": "whatamigettininto",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50pa4s/have_an_interview_at_a_call_center_tomorrow/",
        "text": "Hi everyone, the type of job I'm applying to will involve making outbound sales calls for a marketing company. What types of questions will the interviewers typically ask and what type of responses are they seeking?",
        "created_utc": 1472760778,
        "upvote_ratio": ""
    },
    {
        "title": "The bill was OVER NINE THOUSAND!",
        "author": "Rhodoferax",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50oh58/the_bill_was_over_nine_thousand/",
        "text": "Just a quickie, since this wasn't me.\n\nLast Monday was a slow day due to being a bank holiday in the UK, where our client is based. The dude behind me calls us over to have a look at one customer's bill. The bill was, as you can guess from the title, a little over £9,420 for one month.\n\nIt seems someone at this number had been calling a 09 number repeatedly. For those not in the UK, 09 numbers are premium rate - phone sex lines, fortune tellers, and other general shady people. From what I overheard, this guy naturally demanded a refund, but of course nobody in the centre is able to credit multiple thousand pounds.\n\nAs far as I know he ended up being sent to the fraud department.\n\nMoral of the story - if you're in the UK, don't call a number that starts with 09. Also, don't call 118118. I did deal with a customer whose bill had a £60 charge on it for a 13-minute call to directory enquiries.",
        "created_utc": 1472751754,
        "upvote_ratio": ""
    },
    {
        "title": "There has to be a way out of this...",
        "author": "doctorwize",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50nzis/there_has_to_be_a_way_out_of_this/",
        "text": "Long story short I was told I would not be given the management position at a call center I work at, which the biggest perk was not being on the phone. I won't bore you with my reasons why I am looking for a new job or the long list of complaints as almost all of them can be found in the testimony of me and countless others in this subreddit. \n\nI am seeking advice and guidance on how to get out of this call center and customer service in general. I have an undergraduate degree in Political Science, 5+ years of consistent work experience,two years at my present company which I received a temporary position as manager relief, no felonies, etc.\n\nSpeaking to a coworker about this he mentioned my biggest card is to become a teacher. Working in Florida, I would need to take a subject exam and can be hired on a \"temporary basis\" while I have three years to complete my certification. That to me is the most logical choice. Math would be the best choice to become certified in since hiring is strong for math.\n\nBut, I want something more immediate. I am not sure what the hiring cycles are for teachers but I imagine they do most of their hiring during the summer. I want to find a job in 30 days if possible. Maybe it is a long shot goal but I am willing to try. \n\nWhat industries should I look into? Anyone had a successful transition? I simply don't want to be on the phones taking calls. I imagine even a management position in retail would be better than having to deal with escalations all day. I'd even take a pay cut if it would give me peace of mind. \n\nI see the writing on the wall. I am not sure how long I can keep my stats up. I feel that I may be walked out honestly.  I already updated my resume to every job searching site I could find, contacted all my references to let them know I am looking for a job, and reached out to those who left our company to see where they landed. \n\nI want out.\n",
        "created_utc": 1472746422,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not tech support",
        "author": "SirGuido",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50n854/im_not_tech_support/",
        "text": "As I've mentioned before I work at a bank and part of my job is to support users access to our website.  Nearly every day I get at least one call where the user thinks that because their computer/tablet/phone is messed up and keeping them from our site that its our job to fix that problem.  \n\nJust had a customer complain that every time he goes to our site, his login information is already there.\n\nC: \"How does it know that its me?  Will it give that information to anyone?\"\n\nMe: \"Sir, its not the website that's saving your information.  Your browser does that.  And it always asks first.\"\n\nC: \"What's a browser?\"\n\nI feel like there should be a license that you should have to obtain before being allowed online.",
        "created_utc": 1472737355,
        "upvote_ratio": ""
    },
    {
        "title": "Refund denied! (happy sigh)",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50ms8j/refund_denied_happy_sigh/",
        "text": "So I was working for a place where we handled inquiries mostly about mobile purchases and in-app purchases. Before I continue, for legal reasons: no it's not the place you're thinking, it's some other one.\n\nSo generally if someone's kid gets on their phone and racks up a bunch of purchases in a game, we'll refund it. It happens. Of course, we ***only*** refund it after telling them how to block that type of purchase, sending them written instructions, *and* offering to walk them through those settings.\n\nIf they call back about the same issue a second time, that \"offer\" of walking them through becomes conditional. No refund unless we work together to block this stuff.\n\nSome of these refunds can get big. I handled a $9,000 refund once, a friend of mine did $15,000. Kids just pound on that purchase button every day for a month thinking \"I'm winning!\" Honestly it's rare they do it on purpose.\n\nThe problem comes with the entitled soccer moms:\n\n* Mom: What are these charges? This is ridiculous, there's no way we could have done this!\n\n(I look... hmm. \"Dragon Vale\" strikes again. Lots of kids are doing this one.)\n\n* Me: Okay, looks like these were purchases from inside a game.\n\n* Mom: What? Nobody around here plays a game! Nobody!\n\n(Oh god it's gonna be one of those...)\n\n* Me: Okay, well looking at these purchases it looks like they all came from the same phone, the one that downloaded XYZ app a couple of days ago. Did you download that app?\n\n* Mom: Yes I downloaded that app, but it's a free app!\n\n* Me: Yes... stay with me here... so we know that physically someone went on that phone, the one it looks like you're calling me on, and went into the game called Dragon Vale. Now from what you were saying it sounds like that wasn't you... does anybody else ever use your phone? Do you have any kids?\n\n(At this point in the background I hear a kid whining...)\n\n* Mom: Sweetie you can have the phone when I'm done...\n\n(I jump in before she can dive back into her lie and dig her hole any deeper...)\n\n* Me: Sounds like a little one wants to use the phone too! (As sincerely cheery and affectionate tone I can manage.) It's okay, if they did this it happens, there are things we can do to work with this.\n\n* Mom: How is this possible though, a kid shouldn't be able to spend my money!\n\n* Me: Oh I agree. That's why a password is needed to enable purchasing. Do you remember putting your password into your phone at any point?\n\n* Mom: Well he needs the password in order to play his game!\n\n(I cringe and walk her through how passwords work and what they're for... we refund her thousands of dollars of purchases. I send her documentation to block in-app purchases. I offer to walk her through the settings... she declines. Shocker.)\n\n(Not one week later, same person calls. I somehow get her for round number two.)\n\n* Mom: There are even more charges on my bill! This keeps happening! It's ridiculous!\n\n* Me: I agree that is absolutely ridiculous. I see here that we went through the password thing last time, and... did you get a chance to go through those settings?\n\n* Mom: Yes, yes I did everything!\n\n* Me: Okay well that's weird because it's coming from the same phone. How about we check the settings now?\n\n(She gives me pushback but we eventually get to the settings. Untouched. I propose flicking the little switch that will make this problem go away forever.)\n\n* Mom: I shouldn't have to do this! It shouldn't be allowed!\n\n* Me: Well it isn't allowed, at least not by us. What you have in your hands right now maam is a bit of technology. It's not a person. It can't look at the person who's playing Dragon Vale and decide if it's a grownup or a child. So what we did is we made it so you need to put your password in to make a purchase. That's what passwords are for... and it sounds like that keeps getting put in somehow... so we can just use this setting and you're good.\n\n* Mom: *But I shouldn't have to do this and I want a refund now now now!*\n\nGod... I talk it over with my super. We agree that if we can at least get her commitment to do the setting, and get her to acknowledge that she's the one putting the password in, we're good to go.\n\nFor whatever reason she's good with that. Many thousands of dollars refunded.\n\nThree weeks later she calls back. I didn't take it but I saved the reference number so I could keep track. Imagine my utter, staggered shock that she got even more in-app purchases from Dragon Vale! Notes said:\n\n- Customer says this isn't her responsibility.\n- Explained that we can't prevent her from entering her password, only she can do that.\n- Customer refused to block in-app purchases.\n- Previous agent offered to walk her through twice, customer refused both times.\n- Has been sent documentation twice.\n- Two previous refunds.\n- Refund denied.\n- Customer asked for escalation.\n- Refund denied.\n- NOTE: Account has been locked against any future refunds! If customer calls back, DO NOT OFFER REFUNDS!\n\nFeels good man.\n\n**Update**: I can't tell you the exact amount she ended up paying in the end as it was just too common an occurrence... it was four digits anyway. I did find a note I left for myself and I did screw up one number though: my all-time highest refund was $23,000. Double that for the biggest I'd heard of. Special case though... maybe for another day... ",
        "created_utc": 1472730742,
        "upvote_ratio": ""
    },
    {
        "title": "Store Info Inquiries",
        "author": "karibjerseygirl",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50mj0t/store_info_inquiries/",
        "text": "One of the least fun things that happens at my job, is the question about specific stores.\n\nWithin the past week someone asked \"where is your biggest store in my state\" to which I responded with \"use our store locator to find all our stores in your state\".\n\nThen I had at least two customers ask how to use our website to see ONLY merchandise available at a certain location. For those, I smiled, asked for zip code and provided address, phone and hours for nearest store.\n\nThe whole time I was thinking, it wouldn't be nice say \"you wanna know what's at the store? Go take yourself to the store.\"\n\nGood times.",
        "created_utc": 1472725745,
        "upvote_ratio": ""
    },
    {
        "title": "Phone Games",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50kxk5/phone_games/",
        "text": "Some places I've worked we respected the call center, respected the client, and did our best to do a stand-up job.\n\nOther places the management were a bunch of jerks and the client were ignorant jackasses and all we could think about was: \"Please let it be me you fire today in your daily round of firings!\"\n\nWhen you're working in a place like that you need to do something to keep yourself from serious self-injury. So we started phone games.\n\n**Meow**\n\nIn this game you compete to see who can say \"meow\" the most often on a call. \"Meow sir if you've ever been in this situation, like you might be right meow, then...\"\n\n**Bad Line**\n\nAs you're talking lightly press your finger on the spring-loaded mute button on your amp box so that it doesn't quite click, but you can just barely make the line mute. Now cut the line in and out... this works better than just punching the button because it will sound more random, less rythmic, and the clicking of the button won't come through the recording of the call. Good for places with heavy monitoring... don't forget to stop taking calls after a few of these and complaining to your supervisor that nobody can hear you.\n\n**Eat**\n\nThis one is super simple. See how much food you can consume while taking calls. Difficulty level ranges from \"cheese slices\" to \"popcorn\". Bonus points if food is forbidden entirely where you work.\n\n**You Don't Say**\n\nWait for an angry customer. If you're working in one of these crap places they've designed everything to anger the people you're talking with, so it shouldn't take long. Next, when they're going off on their tirade, try and say \"you don't say\" as many times as possible. Ideally talk over them to say \"you don't say\", but the point is to fit it in as many times as possible. You'll be amazed at how creative you get with the intonation.\n\n**\"Sir\" vs \"Maam\"**\n\nAlways, always get the sex wrong. Always.\n\nI'm sure there were more but those are the ones I can remember... honestly it's been too long since I worked in a place horrid enough to warrant this kind of behavior, and even if I did I think I've been too old for a bit...",
        "created_utc": 1472696025,
        "upvote_ratio": ""
    },
    {
        "title": "I think i did a good thing",
        "author": "mee14x",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50kkwg/i_think_i_did_a_good_thing/",
        "text": "I work in an insurance claims center, my job is to file claims for customers that have been in accidents. However the company i work for has a rather confusing phone system. When customers are on hold to bring our hold times down they could put a \"If you are looking for road side assistance you have to contact your agent or pay for the service out of pocket and speak with your agent about reimbursement\" but they dont so i get calls like these.\n\nI had an old man call in and he's like *im 125 miles south of the texas oklahoma border. Im in a rest stop area and i see some trucks and a picnic bench. Can you send me a tow truck because my car has broken down* I give my required reply \"sir you have to contact your agent yada yada yada\" and he responds *well i am disabled so i can not even get out of the car to fix it. can you please look on your computer or something to find me a towing service?* At this point i do feel bad for the dude but my job doesnt allow unotherized web browsing so i had to tell him \"im sorry sir but there is nothing i can do\" He then says *well i guess ill just lay my seat back here and get some rest. Hopefully someone finds me in the morning and helps me. Ive already tried to call my daughter and shes not picking up the phone so i guess ill just lay here and hopefully im not dead in the morning* By this point i have no idea what to say to the dude besides that im sorry i cant help him further and that i wish him luck. He says *well if you see on the news tomorrow \"man found dead at truck stop\" you will know it was me!* and he hung up the phone. I felt bad so i checked that none of my supervisors were looking and i called him back and gave him some numbers to local towing places in the area. I think i did a good thing.\n",
        "created_utc": 1472691318,
        "upvote_ratio": ""
    },
    {
        "title": "Does this happen to anyone else?",
        "author": "mee14x",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50jo97/does_this_happen_to_anyone_else/",
        "text": "I work in a claims department and i have found on more than one occasion that i have male customers that pee during the duration of the call... Like i can hear everything from the *zip* *pee* *flush* *zip*",
        "created_utc": 1472679424,
        "upvote_ratio": ""
    },
    {
        "title": "This is Ruining America",
        "author": "SirMize",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50jgih/this_is_ruining_america/",
        "text": "This guy was just a huge pain in the ass.\nGuy was calling about the software he purchased, and how the charges were not right and his yearly contract was wrong, all valid complaints, but then he just started turning into a weird asshole. He definitely thought I was an overseas agent because I have a foreign name, but I am not. I was born here and have no accent.\n\nAss: I think its convient that the sales rep happened to call today to renew my plan, he is trying to make some money on the side.\n\nMe: Well he wouldn't benefit from that sir, because the charges go to the company not him.\n\nAss: he is trying to pull on over on me, I know whats going on\n\n*InnerMe: you dumb fuck, do you not get how sales people get paid*\n\nMe: well sir, there definitely seems to be some sort of billing error, I will have sales look . . .\n\nAss: this is what is running America, people trying to get shit for free, we need to stop giving stuff away to foreigners like you\n\n*InnerMe: can you just kindly shut the fuck up so I can fix your problem, I mean wtf does that have to do with anything*\n\nMe: Well actually sir I'm located her in the US, but give me a moment and I will get a sales rep for you to correct the issue.\n\nAss: Ok but I know they are trying to pull one over on me, you know I've been a customer for over 20yrs, do you know how many customers of yours have been with the company that long.\n\nMe: I have no idea sir, I don't have access to look up that information.\n\nAss: Well since your not going to say it, it would be very few, very very few. But you wouldn't know that since you work overseas.\n\n*InnerMe: Actually fuck stick, this comapny has bought a bunch of other companies, and is under one new company, so all our clients are basically long time users we bought, but I don't WTF that has to do with anything*\n\nMe: ok sir, well would you like to me to get you to slaes so they can work on your issue\n\n*InnerMe: or do you just want to continue to be a cunt and spin in circles*\n\nAss: yes get me to sales",
        "created_utc": 1472676870,
        "upvote_ratio": ""
    },
    {
        "title": "Where is my internet?",
        "author": "Eviltechnomonkey",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50jbic/where_is_my_internet/",
        "text": "This didn't happen to me, but I heard it recently from one of my coworkers that used to work at a call center I was also previously employed at. He worked there during the time that Hurricane Katrina hit.\n\nA customer called in complaining about not having internet. After confirming his account information, he started stepping through troubleshooting the issue. In the end he found out the guy didn't have a roof on most of his house either. He didn't have power at all, and he was upset that they could not get his internet back up that day while there was still major flooding in the area, lines down everywhere, and his freaking roof was missing.\n\nTL;DR: Some people prioritize having an internet connection over everything else in life.",
        "created_utc": 1472675258,
        "upvote_ratio": ""
    },
    {
        "title": "Ready to leave",
        "author": "Customerpunchingbag",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50j7mn/ready_to_leave/",
        "text": "hi guys,\n\nIve posted a couple stories regarding my IT support job in a large UK based call centre and I'm ready to leave, I'm ready to throw in the towel for so many different reasons. To give you an idea of my previous job, I was a sales rep for a large tech company and I loved the job, it was face to face service, paid well, consistent hours and you could actually walk around and have a laugh with your coworkers.\n\nNow unfortunately I was forced to leave due to a manager not liking me and getting me fired for a false accusation so after many weeks of job searching I was offered this position and took it because I needed work and they made it out like it was gonna be a good job.\n\nWhen we initially got in on our first day it seemed pretty cool, we were sat down with a desk trainer, sat through info about the company and such and got to go home at 2pm, awesome right? Things got a bit funny after we were told that we would be getting 4 weeks training and yet we were thrown on the phone after less than a week. \n\nI did not have a fucking clue what I was doing, sat there having to ask for help after every single call and nobody seemed to know what they were doing including a certain line manager who I'll go into more in a second. Here are the main reasons I want to leave and am sick of this job after only 8 weeks as I have a lot to say but will keep it brief:\n\n. Managment: Managment is absolutely shocking in this place. One of my line managers is no help whatsoever, when asking for help because you can't do something he asks other first line agents for help. He has the nerve to call people retarded and takes the piss out off people behind their backs and never to their face.\n\n. Toxic Coworkers: Toxic coworkers who kiss the managers arse's and have the nerve to tell other people what to do aggravates me to no end. Constantly shouting at me to take calls despite being told by managers not too, watching netflix or on facebook when I'm getting bombarded by calls.\n\n. Illegal breach of contracted hours: I'm only contracted to do 40 hours per week which is the usual legal amount without it being overtime, I'm doing 49 hours at points and are usually on weekends as well as week days and I don't get overtime.\n\n. Never getting paid on time: This goes without saying, I've not been paid twice in a row and am still currently in an argument with them as they are claiming to have paid me this week, my bank says otherwise. \n\n. Crappy callers: This is the most obvious one, I nearly lost it on a customer the other day who called me a cunt when he thought I had him on hold.\n\n. Depression: I already suffer with Chronic depression and this job does not help, I go to work miserable and come home miserable. I've become physically ill at work and have had to go home twice during the day from feeling so god damn bad.\n\nSorry for the rant guys I'm just so done.",
        "created_utc": 1472673968,
        "upvote_ratio": ""
    },
    {
        "title": "Three times is the charm",
        "author": "Kiva_",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50j0f7/three_times_is_the_charm/",
        "text": "So first off sorry if the phrase in my title is wrong I'm not a native speaker.  \n\nI was working on a rather slow day - slow enough to make notes and ACW while I am on ready. I(ME) work for a large regional energy provider (LREP) and had this angry customer calling (AC). Here is how it went down.  \n\nME: welcome at LREP. My Name is ME. How may I help you. \n\nAC: MY ENERGY IS CUT OFF AND I WANT IT WORKING RIGHT NOW OR I'LL SUE.  \n\nME: Okay I'll see what I can do for you so please give me your account information  \n\n\\- at that point I put the volume as low as possible - \n\nAC:[ACCOUNT INFO] I WANT IT DONE BY TOMORROW MORNING OR YOU INCOMPETENT IDIOT WILL LOSE YOUR JOB.\n\nME [after reviewing]: It appears that you are not eligible for a reconnection of your service right now. You got notice of late payments [on 4 different occasions] the last one including a notice of disconnecting your energy. Also please stop insulting me or I will disconnect this call.  \n\nFrom this point a quick summary: AC was on vacation and didnt read any mail. Over 3 months it piled up to around 2k of late payments 25€ late fees 150€ fees for failed disconnections and roughly 1.2k for outside disconnection (we basically cut the line). AC wasn't happy and called me an incompetent idiot. I informed him of the policy again and disconnected the call. The end right?  \n\n\nWell not really I made detailed notes and went back into the line. I get a call instantly which is weird because its a slow evening. Important to note: The pitch of my voice varies wildly between calls.\n\nME: Welcome at LREP my name is ME. How may I help you.  \n\nAC: well my name is AC and this is my [account info]. I have some late payments and want to make a payment plan so we can resume service. While we are at it I want to raise a complaint about Ms.ME. She was very rude, incompetent and refused to help me.\n\nME: [verifying account Information] Unfortunately you are calling after our billing department closes for the day and I am not allowed to discuss a payment plan due to the status of this account. Regarding the manner of your complaint: you have spoken to me earlier. I am willing to help and thank you for calming down. Now in regards to your issue - \n\nAC: But you are a man you can't be her.\n\nME: it certainly was me, i remember your voice and see my notes. Now moving on to your issue. Our billing department will ca- \n\nAC THIS IS BULLSHIT YOU ARE AN INCOMPETENT BASTARD - \n\nME I have already made you aware of our policy last call and will now end this conversation. Please call back after you have calmed down.  **click** \n\nNow I take a few notes again and tell my supervisor. Not because I have to, but we laugh over the situation  (the mix up, not the cut service).  \n\n-Back in the line- \n\nME: Welcome at LREP my name is ME. How may - \n\nAC: THIS IS RIDICULOUS FUCK YOU - and then he hangs up. \n\nI made some notes and went home for the day after forwarding the case to billing. 2 days later I get some info from the billing department: I made everything right(I requested feedback as I am pretty new) and they went out of their way to refuse payment plans - they looked for any issue they could find to refuse to payment plan and gave the customer a list. He has to pay the full balance including service fees before we even put the reconnection notice on his account. Because we need to dig up the ground he will be out of energy for about 1-2 weeks after payment. \n\nTL:DR Angry customer talks to me twice and hangs up screaming the third time, has no energy for many weeks to come. Which could have been resolved in one - if he were nice. \n\n\nAlso apologies for bad english or formatting I am on the phone right now will correct mistakes when at home. Please offer me advice on how to improve. I have tales to come and want to improve my writing style.  \n\nedit: some minor text fixes and spelling fixes.",
        "created_utc": 1472671656,
        "upvote_ratio": ""
    },
    {
        "title": "I quit my job today.",
        "author": "RichtersMask",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50iz6t/i_quit_my_job_today/",
        "text": "My shift ends in two hours, forty minutes.\n\nWhat crazy things should I do on the phone or taking an email? Go on, r/talesfromcallcenters, let's be mad lads.\n\nEDIT: TEN MINUTES.\n\nWe stopped taking calls before anyone gave any suggestions but thanks to everyone who cared anyway.",
        "created_utc": 1472671252,
        "upvote_ratio": ""
    },
    {
        "title": "POWER CORDS ARE MAGIC",
        "author": "TheLadyGuinevere",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50hckv/power_cords_are_magic/",
        "text": "This is not about just one call, but many. I work in what is basically level 1 tech support. Turn it off, turn it back on again. That didn't work? No system issues? Technician.\n\nThat kind of work.\n\nAt least once every couple of days, I get a customer who seems to have never heard of electricity before. They fit one of two categories: Older people who sound in their 60s (far too young to have issues unplugging the power), or in their early twenties.\n\nThe call goes something like this: (skipping Call intro)\n\n&gt; LadyGwen: Alright, I need you to unplug the power to both your modem and your router.\n\n&gt; Cust: I have no idea which one that is.\n\n&gt; LadyGwen: It's like a standard power cable you'd see on a phone charger, laptop, or toaster.\n\n&gt; Cust: The yellow one?\n\n(NOTE: The Ethernet cords we provide are usually yellow. They ALWAYS think it is the ethernet cord. Outside of phone chargers, have you EVER seen a yellow power cable? I sure haven't.)\n\n&gt; LadyGwen: No, that is the ethernet cord. You're looking for the power cord, which is typically black and round. It plugs into the power outlet.\n\n&gt; Cust: So you want me to unplug the yellow one?\n\n&gt; LadyGwen: *Rubbing temples whilst keeping up my friendly voice* No, you want the power cord. On that box you should have three cables, the one you are describing is the ethernet. Like a phone jack but bigger. You have to pinch it to pull it out. You also have a Co-Ax, which has to be twisted to pull out. The power cord is the only one that will pull straight out.\n\n&gt; Cust: This is too hard you should make it easier.\n\nAnd so on. My record is 15 minutes to get them to unplug things. If I get too frustrated I'll just do it remotely for the modem, but we can't do that for the router, so I have to get them to unplug it.\n\nI understand that most people wouldn't know what I was talking about if I said \"Your TX isn't good\" or \"Your desktop's NIC isn't pinging successfully\" but Power cords are so universal... No one capable of calling me has any excuse.\n\nEDIT: I forgot my ~~most hated~~ favorite phrase they throw in somewhere.\n&gt; Customer: \"Oh I'm just not good at computers\"\n\n&gt;LadyGwen Internally: \"That's OK because just about everything you touch has a power cable\" \nExternally: \"That's OK, that's why we're here to help.\"",
        "created_utc": 1472652461,
        "upvote_ratio": ""
    },
    {
        "title": "The Political Campaign",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50gr9b/the_political_campaign/",
        "text": "The one place I worked we all tended to float around from one campaign to another. Stuff came and went really quickly - mostly stuff you'd need 3 or 4 days absolute max to get trained on.\n\nOne day I was drafted to work on a \"political survey\" campaign for a certain American political party.\n\nNow for the purposes of this story I'm not gonna say which because people are super, super hostile when it comes to politics these days... just assume what follows was from that *other* party... do your best not to get into it in the comments on that level...\n\nSo for legal reasons, because you can't actually just call people up and say \"vote for us!\" because that's harassment and just plain awful, this was a \"survey\". But of course the survey was horribly, horribly biased.\n\nExample:\n\n&gt; Are you for tax breaks for the wealthy like X candidate, or do you think we should all be taxed fairly?\n\nOr how about...\n\n&gt; Candidate Y is proposing ABC bill which will fix everything. Do you support your troops or are you against this bill?\n\nUtter nonsense.\n\nBut the nice part was it was only going to be for three days.\n\nAnd the nicer part was there wasn't really any boring training, just \"read the script, don't engage in conversation.\"\n\nAnd the ***best*** part was that there was ***no QA***! (that's Quality Assurance, aka people listening to your calls to \"help\" you improve your performance)\n\nSo after day 1, when I went home and complained my little face off, and realized that nobody was listening to these calls. *Nobody*. They were just monitoring the dialer and making sure we hit a certain saturation on the calling list.\n\nSo...\n\n**Read As Quickly As Possible**: HellomynameisGalactuscallingonbehalfof123PartyIwouldliketoaskyouafewimportantquestions...\n\nThem: Dew whut?\n\n*Next call...*\n\n**Monotone Robot Voice**: Hello my name is Chimchar calling on behalf of the 123 Party. I would like to ask you a few important questions. Is this acceptable, yes or no?\n\nThem: Is... is this a real person?\n\nMonotone Robot Voice: Affirmative.\n\n*Next call...*\n\n**Bored Reading Stereo Instructions Voice**: Hell my name is Fabio and I'm... uh what does it say... calling on behalf of... \"123 Party\", apparently... and I would like to \"ask you\", okay, a few \"important\" questions...\n\nThem: Are you serious?\n\nBored Reading Stereo Instructions Voice: Apparently, ya! I mean that's what it says. Can I continue?\n\n*Next call...*\n\n**Heavy Hindu Accent**: Hello my name is Bindur calling on behalf of 123 Party. I would like to ask you a few very very important questions. Is this acceptable to you kind sir?\n\nThem: Are you even *in* America?\n\nHeavy Hindu Accent: Oh yes sir, very very in America. I was born in Wisconsin sir.\n\nTried crazy up and down tonal pitch voices, mumbly can't-make-out-a-word-you're-saying-son voices, all kinds of things.\n\nTurned out to be not so bad.",
        "created_utc": 1472643892,
        "upvote_ratio": ""
    },
    {
        "title": "You want me to credit your account $600 to cover your early termination fees because you have been with us for 6 months?... No...(Medium)",
        "author": "klutch65",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50fio4/you_want_me_to_credit_your_account_600_to_cover/",
        "text": "I work for a wireless provider. \n\nK: Thank you for calling, this is Klutch. Can I have your name please?\n\nCust: Unreasonable boar.\n\nK: Good evening Unreasonable. How can I help you?\n\nC: My fiancee had three of his devices stolen from him. We want to cancel the lines.\n\nK: I'm sorry to hear those were stolen. You have insurance so I reccomend doing the claim first, but if you still wish to cancel the lines there will be early termination fees for two of the lines and a buyout for the other, totaling around $600 dollars.\n\nC: We are not going to pay that. We don't have the devices anymore. Why should we? \n\nK: We sold these to you at a discounted rate under the expectation that you were going to stay for the two years. Since you are no longer going to be with us, we recoup our losses with the early term.\n\nC: Is there anything you can do? I've been a loyal customer...\n\nK: Your account has been open for six months. We are more than willing to assist you with your insurance claim but we are not going to waive early termination fees.\n\nC: We will leave (insert cell phone company here) because you are absolutely no help!\n\nK: Ma'am. These devices you got from us didn't cost a dollar to make, or even $100. We sold these to you at a lower price expecting you to honor your agreement with us. You can leave but we recoup our costs at the end. \n\nC: Please call me back Friday to assist with a line transfer and see what else you can do.\n\nK: Fine. \n\nDamn unreasonable boar failed my survey claiming that I didn't work hard enough for her... I wish I could call my bank and tell them that my six hundred dollar cell phone was stolen so I'm not going to pay it. ",
        "created_utc": 1472619426,
        "upvote_ratio": ""
    },
    {
        "title": "Best Wednesday ever",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50ek7d/best_wednesday_ever/",
        "text": "The one call center I worked at rented space in a building that had some government offices. This meant that when certain things happened, you couldn't make a judgement call or use common sense. You had to follow procedure.\n\nAnd by \"certain things\", I mean bomb threats.\n\nAnd by \"follow procedure\", I mean evacuate the entire building from top to bottom.\n\nWorking there was a nightmare. Outbound calls, generally cold-calling people trying to sell them some of the least desireable crap you can imagine. We got screamed at a lot. Worse, there was this one supervisor named... well let's call her \"Shrilley\" for her shrill voice... anyway she set everyone on edge if they weren't already. Always on the hunt looking for someone to get in trouble, and make a big public humiliating spectacle of it.\n\nMore on her later... this is supposed to be a happy story!\n\nSo due to the stress, occasionally somebody would call in a bomb threat to the call center, often saying, although not always, that the bomb was under Shrilley's desk. Horribly immature and mega-inconvenient for all the offices that had nothing to do with our call center in the rest of the building, but people were that desperate.\n\nIt was a guaranteed few hours off at least, and if you showed up for your scheduled shift, you were getting paid for that time you were standing around outside waiting for the all-clear while they searched the place.\n\nOne day as I walked up I saw people streaming out of the emergency exit. I flagged my supervisor down:\n\n* Bomb threat?\n* Bomb threat.\n* Okay but I'm still here right?\n* Ya you're officially on the clock don't worry.\n* Awesome.\n\nSo we hung out, got coffee, a few people went to the bar (and of course got in trouble from Shrilley), but generally we all had a good time waiting to go back in.\n\nExcept after a couple of hours they didn't let us back in. Apparently they'd found a \"suspicious package\" in the lobby and needed to wait for a special bomb squad robot to come in from out of town.\n\nSo we went out for dinner, hung out with our friends on park benches, had a few laughs. It got dark. Eventually the robot showed up and blew up the \"suspicious package\", AKA somebody's lunch they forgot in the lobby, and we were let in about an hour before the end of the shift.\n\nBefore being let back in the call center manager got us all together to let us know he was calling the shift early. We could all go home.\n\nWith pay.\n\nHad friends from the call center over to our place. Drank, smoked, played cards until 3am. Best Wednesday ever.\n\nAh to be 20-something again...",
        "created_utc": 1472605556,
        "upvote_ratio": ""
    },
    {
        "title": "Great. We tried to fix your problem and it ended up breaking the call center",
        "author": "UrMomLikesMine",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50e3ca/great_we_tried_to_fix_your_problem_and_it_ended/",
        "text": "Working in a call center is a lot like a rollercoaster. It's got it's ups, it's downs, sometimes it makes you so sick you feel like you're going to throw up on the person sitting next to you. Here's the story of how I apparently broke a multi billion dollar company's call center for most of one day.\n\nFor a week Id been calling the help desk. I wasn't as seasoned as I'd eventually become, so I was very worried I'd lose my job because of metric issues resulting from the problem I was having. I called them every day, sometimes twice to see what the status of my ticket was. \n\nTHE PROBLEM: If I placed a customer on hold, or set them up for transfer, they were stuck in this  purgatory where I couldn't get them back or execute the transfer. So my first transfer experience with this issue sounded something like this:\n\n&gt;Me: (Gave customer info to new rep) ... Alright I'm sending the customer over now, have a great day. \n\n*hits complete, nothing happens*\n\n&gt; Me: Uhhh, I hit the complete button on the screen and I think I may have broke everything. \n\nThe new agent releases, leaving me with a customer on hold. Every action I tried failed and they were stuck on hold. After a bit of arm flailing and miming screams of anger, I had to release the call. \n\nI think to myself, \"Welp, that next rep who gets them is fucked.\" I send a request to my manager to allow me an outbound, to which I know she'll either say no or not respond. I document contact history of what happened, and then I wait.\n\nNow the fact that I'm waiting for a call is odd all by itself. What's making it batshit crazy is the length of the wait. 5 mins go by, no call, 10 mins, nothing, 15 mins, at this point I'm bored enough to check the online queue board. It reads 85 calls in queue. \n\nNow, I know I need to call the help desk, but at this point we've been told that we need approval by management if it's anything other than something scheduled or you're about to shit your pants. So I walk up to my manager, who is deep throating a $5 footlong while simultaneously seeing how many times she can fold a post it. I attempt to explain my issue in words I hope she will understand. \n\n&gt;Me: Hey, I'm not getting calls.\n\n&gt;manager: *tries to talk with about 4 inches in his mouth, chews, eventually swallows and responds* \"What? Are you auto in?\"\n\n&gt;Me: Yup. I'm double green, there's like 80 CIQ.\n\n&gt;manager: Alright, put yourself in system problems and call help desk.\n\n\nI go back to my desk, to call the help desk only to discover that I can't even make outbound. My phone might as well be a decoration at this point. So I make the walk back to my manager who is now drawing an endless spiral on a piece of paper. \n\n&gt;Me: Alright, so I can't even make outbounds. \n\n&gt;Manager: Really? Why? I don't understand. You can't make outbounds?\n\n&gt; Me: Yea, you know, when you try to call someone, instead of them calling me. I can't do THAT. \n\n&gt; manager: No I got that, I just don't understand why this is happening to you.\n\n&gt; Me: No clue, I'm going to reset my phone. So I'm going to be showing as not logged in for a few. Ok?\n\n*she goes back to her happy spirals*\n\n&gt;Manager: That's fine. Just don't take too long.\n\nSo I reset, log back in, auto in and *bing* calls are coming in. Everything runs smoothly until I get a customer who immediately (as soon as I get the call) wants a manager. I place them on hold, interrupt my manager trying to recreate Starry Night on an Etch-a-Sketch and ask if she'll take the call. Of course she refuses and tells me to handle it myself, or to schedule a callback. \n\nI return to my desk, and to my horror, I can't get the call back yet again. So I abuse my company provided stress relief ball, grind down some more of my teeth, release the call and I'm once again not getting inbound calls. \n\nI go back to my manager to tell her, what happened and explain that I'm going to reset my phone but this time, instead of auto in I'll put myself on system problems immediately after the reset. I call the help desk to put in a ticket, and go back to taking calls. \n\nFor a week, I couldn't put customers on hold or transfer them. If they needed a different department, I'd have to give them the phone number and tell them they would unfortunately have to call it themselves. If someone who only spoke Spanish accidentally got to me, id try to tell them to call back, but I'd eventually have to hang up on them, sealing incorrectly in their mind that I'm probably a racist. My metrics bottomed out for that week. My surveys % dropped (the large percent of the clientele took the surveys), my first call resolution was dropping, I was getting emails from agents reviewing my calls asking why I have so many calls I'm disconnecting on. It was a nightmare. Until that one day.\n\nI come in, and everyone is standing at their desk. There's 300 calls in queue and climbing. So I get to my desk and ask my cube mate for some info.\n\n&gt;Me: what's happening, is no one taking calls?\n\n&gt;CM: No one CAN take calls. We were all auto in, but nothing's happening. So, they told us to log out. \n\nAt this point I'm laughing so hard that I probably look like an insane person. Turns out, my issue, has spread to everyone. The only difference is now IT has a fire under their ass, so they tell everyone to log out while they rush a fix. \n\nBy the time I got there, no one had been taking calls for 3 hours. At my 5 hour mark, someone from IT walks over to my section asking for me. \n\n&gt;me: Hey what's up, you asked for me?\n\n&gt;IT: Yes, I wanted to let you know that we cant fix your issue. You know, the ticket you submitted?\n\n&gt;Me: wait, why? You have to, I can't work like that. \n\n&gt;IT: the fix we rolled out for you, ended up creating the issue you see now. So we are going to reverse this, but it doesn't look like there's going to be any way to resolve your ticket.\n\n&gt;Me: that's not ok. I can't do my job, I'm going to get fired!\n\n&gt;IT: tell your manager, see if you can get another seat. The bottomline is, if we fix your problem, we break the phone system. \n\nHe then leaves, and leaves me in a state of shock and fear for my employment. Shortly after I receive a resolution ticket, noticing that my problem is fixed (by not fixing it). \n\nOver the course of the next few days, I change desks a few times. For reasons unknown to me, the problem is somehow linked to me. My manager eventually is asking me why my metrics are tanking, because her boss is concerned so I explain the dilemma. I tell her how it's either me, or the entire call center that has to deal with this problem.\n\n*she puts away Slinky, and now there's a fire in her eyes*\n\n&gt;Manager: That. is. bullshit. We are getting this fixed right now. \n\nNow in my mind, she walked down the hall in slow motion, with fan blowing her hair, and \"Rock you like a Hurricane\" playing loudly in the background. But in reality, im pretty sure it wasn't like that. \n\nA couple days later, my problem is officially resolved. When I go on break, I walk over to my manager's desk, who's caught up in doing that magic trick where you make a pencil appear to be rubber. \n\n&gt;Me: Thanks for getting my phone issue resolved. \n\n*she glances over at me, but continues waving pencil*\n\n&gt;Manager: I'm not going to leave one of my employees in a position like that, where they're set up to fail. You guys are like my kids. \n\n&gt;Me: Well I appreciate it.\n\n&gt;Manager: No problem, now get back to work. We don't pay you to stand around doing nothing. \n\n&gt;Me: I'm on break so it's ok, I'm not wasting company time.\n\n&gt;Manager: If you're on break, then go and enjoy it!\n\nI walk over to the break room, and put $1.25 into the soda machine and select Coke. Out rolls a ginger ale. \n\n&gt;Me: God fucking damn it! \n\n*arms flail in the air*\n \n I walk back to my desk with my stupid fucking soda and ponder all the decisions I've made that brought me to this point in my life.",
        "created_utc": 1472599364,
        "upvote_ratio": ""
    },
    {
        "title": "We'll give you something to complain about",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/50ay4k/well_give_you_something_to_complain_about/",
        "text": "Throwaway account, but time to start dumping stories from 15+ years in various call centers... I'll start with this story of petty revenge. It's long but it's fun.\n\nThe best place I ever worked at was, believe it or not, a customer service call center. For an entertainment product no less, so you know those customers were calling in feeling entitled!\n\nBut the place was really focused on *actually helping customers*, and we'd all discuss ways that we could make that happen regularly. Management listened. (I mean they weren't always effective but they tried.) Our survey scores were awesome. Our customers generally loved us because we knew what we were doing *and* we knew how to talk to them to finesse them into a happy place even when things were going poorly.\n\nIt was a very special call center. I kinda miss it.\n\nBut there's always someone complaining. Let's call the young lady \"Rosetta\". Tall, white, blonde, and impossibly skinny. Like you see her face and think \"oh, pretty!\" but then you see her neck and think \"whoa that's...\" and then the rest of her and \"omg do you need to sit down?\"\n\nHuge smile. But don't let her speak. That's when things go wrong.\n\nI worked days. She'd come in about 2 hours before I left. She would then start complaining. Loudly. This place sucks, so this b!tch the other day, blah blah blah... I'd have to cover my mic and talk a bit more than usual so the customers wouldn't hear her. They did anyway.\n\nWe complained. She complained more. She'd log in and go to the supervisor every single day to complain for at least an hour. Our supervisor was a pushover so Rosetta was able to do this daily. This sucked because the supervisor sat in the row with the rest of us, so we'd all have to hear her nonsense.\n\nThe straw that broke the camel's back was when she started complaining to me directly. If wind brushed one of her papers a little during the day and it was an inch to the left, she'd freak out that people were \"messing with her stuff\". \n\nOne day I'm talking to a customer and she pops her head up over the partition: \"Was someone sitting here earlier today? Who was sitting here?\" I shrugged and indicated that I was on a call. \"Okay but seriously was there someone sitting there? Because all my stuff's been moved around.\" She was so loud the customer couldn't hear me. I had to mute myself to verbally tell her what my shrug already communicated: I didn't notice if anybody had been sitting there today. Your desk is on the other side of the row. I don't generally pay attention.\n\nHUFF. Loud complaining to the supervisor for the next hour.\n\nOh it's on. \n\nThe next afternoon everybody in the row was lamenting Rosetta's imminent return. So I said: \"Look, if she's gonna complain anyway, might as well give her a reason.\"\n\nI'd been losing a lot of sleep for unrelated reasons and had been drinking nasty instant coffee to stay awake. Probably why I did what I did next. I took the lid off my coffee and shook it over her desk, leaving droplets that turned into dark brown flecks over the keyboard and desk surface. It was impossible to ignore.\n\nWhen she came in and lost her shit (and I mean LOST it), it was different this time. Instead of making us all depressed, it made us happy. Hmmmm!!!\n\nFrom there, everybody took it in turns to mess with her desk. One person rearranged the pictures one day. Someone else ingeniously stuck the tape up against fabric over and over until the slightest breeze would knock them down. Her keyboard was unplugged... That was a good one actually. The USB cord was unplugged at the keyboard. You just had to look down to see it. But she came in screaming: \"My keyboard is broken! All the stuff around here is garbage! Why can't they get stuff that works?\" A buddy of mine went over, picked up the USB cord, held it up and pointed at it, and then plugged it in with a big \"ta daa!\" hand motion. She tried complaining that someone did it on purpose. She was reminded that the cleaning staff does this all the time, and usually she doesn't have to worry about it because whoever uses her seat in the mornings plugs it back in... but nobody's been sitting there...\n\nEventually she demanded to be moved to a remote corner where nobody would mess with her stuff... which, genuinely, they were... NOW. This wasn't possible unless she switched campaigns, which meant a new supervisor. The new supervisor did not allow loud talking. Period. Rosetta was contained.\n\nMaybe we were jerks. Maybe that was bad of us. But hey, it's what she'd been asking for.",
        "created_utc": 1472561492,
        "upvote_ratio": ""
    },
    {
        "title": "Denying a manager callback, or my first step into call centre civil disobedience.",
        "author": "Ceelic",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/509mtw/denying_a_manager_callback_or_my_first_step_into/",
        "text": "Today, after dealing with many similarly frustrating customers over chat, a customer came into chat asking why her internet modem had reset at 2:20am and why her wifi password was no longer working. Sure enough, after checking the logs of the modem it did appear to have reset around 2am but it was back online in good shape. I advised the customer that I couldn't say why that occurred (as we don't have that information) as it could have been a number of reasons, but I told her we could try factory resetting her modem and then we would change her wifi password to something secure again. The customer immediately went off the rails demanding to know if her modem was being hacked and if her data was safe, and immediately asked for a callback from a manager so that they can review the logs of this incident with her. I told her that our manager, who does not have access to any secret tech support tools that we did not and was also the manager of the CSR's, was in no better position to help and that it was highly unlikely she (the customer) was being hacked unless somebody actually physically reset the modem. I offered again to guide her through the procedure of making it secure once more, but she declined and again asked for a callback from a manager and proceeded on her paranoid tirade. Again I declined, there was a bit of a back and forth and then she ended the chat claiming she would call in and get a supervisor over the line all the while mentioning my name for poor service. \n\nSure enough, after watching the account for a period of time she emails us with a full log of my conversation demanding that a manager call her back to speak to her about this \"security\" incident. At this point sensing that this was becoming a huge headache and regretting not escalating this earlier on (which I should have done to be honest, albeit my grumpy mood at the time) I bring the logs over to a supervisor to discuss the next course of action. She reads over the logs and says that I was correct in not giving into the customers demands immediately, but implied that escalating it at some point or rather would have been wise. She arranged the callback, and that was that. \n\nAnd that ended probably my worst day in this department, lol. I'm still half watching my email waiting for some sort of notice about this customer. Remember if your modem resets in the middle of the night then its probably the boogeyman trying to hack into your computer. ",
        "created_utc": 1472536554,
        "upvote_ratio": ""
    },
    {
        "title": "Quality Assurance will get you in the end.",
        "author": "sledgehammer7",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5046xc/quality_assurance_will_get_you_in_the_end/",
        "text": "I used to work in call centres as a team leader/quality assurance coach and part of my job was to coach and train new and existing staff on ways to improve their interactions with customers. I would do this in several ways: running example role play sessions, listening to recordings of recent calls and giving reps feedback on their performance based on a checklist, and (my favourite) pretending to be a difficult customer and calling up using a fake account. Sorry in advance for the below saga.\n\nOne of the responsibilities that our reps had to manage was trying to \"save\" customers who would call up to cancel a particular service. They could offer discounts (partial refunds), service extensions, give a small free gift, and if they were successful they would get $2 added to their weekly pay. It might not sound like much but when you factor in that they were handling something like 600 calls in a normal 38 hour week, some reps were raking in upwards of $200 extra per week on top of their regular hourly rate.\n\nMy job performance was partially based on how many call recordings I could monitor per week via our Quality Assurance system. The target that had been set for QA was virtually impossible to reach because I was the only one doing the monitoring for a team of 30 phone reps and I was supposed to monitor and give feedback to each rep every week. This is on top of my coaching and team leading duties as well as assisting on the phones almost every day because we were severely understaffed.\n\nAt the time this story takes place I was working with a real nutjob of a manager, Mel, who played favourites with people in the department when it suited him and was extremely erratic with his moods. One day you could be his best friend and the next day he would tear you a new asshole for some perceived error that he thinks you made (although he never actually took the time to learn the processes and policies that we worked within because, and I quote, \"As a manager all I need to know is how to manage people.\") On many occasions I had given him feedback that I couldn't cope with all of the QA responsibilities on top of everything else I was doing because there just weren't enough hours in the day but he usually just waved it off by saying I should only focus on the never reps because the senior reps knew what they were doing. I would counter by arguing that the senior reps had a tendency of being lazy if they're not kept in check but his answer was that he would monitor the senior reps because it didn't take up as much time. In reality, he didn't actually do any monitoring at all but he would get angry if he caught me coaching a senior rep instead of a new starter.\n\nIn any case, on one particular day I was listening to some call recordings and I noticed that the rep in question, Susie, had registered a save on a call where a customer was just making a payment. The rep was one of my top \"savers\" and so I thought perhaps she had just made a mistake with our clunky call system (a common occurrence). So, I listened to another call that she had listed as a save and the same thing had happened. As I dug deeper and deeper, I found that not only had she registered dozens of saves that week on calls about other things, she wasn't even attempting to save customers who called to cancel! By that point I had checked about 30 of her calls and I was furious. I printed off my findings and took them over to Mel's desk. He glanced at it and asked me why I had been checking Susie's calls because it was a waste of time and I should be spending my time helping the newer reps get up to speed. He then told me to check another week's worth of calls and come back to him with more evidence before he'd do anything.\n\nMel and Susie were very chummy. She had been a senior rep for a couple of years and they had actually worked together at a previous business so they knew each other socially. Resigned to my fate of a late night of listening to this rep defraud our save bonus scheme, I started playing back more and more calls. By about 5pm Mel decided to head home and Susie finished at the same time and left with him. I continued to listen to calls and probably about 95% of the saves she had recorded ended up being fake. I also noticed something a bit odd. A large number of the saves she recorded were listed with a reason of \"discount\". When a discount is accepted we would need to manually refund the customer's credit card via our payment system. Where were all of these refunds going? They were only small amounts - $5 here, $10 there - but none of the customer records showed they had been processed against customer cards. So I decided to dig a little deeper. The credit card system was pretty insecure and I could easily check the records of the cards that had been transacted upon by a particular rep and as it turns out Susie hadn't been processing any refunds at all... however, on a whim I just checked Mel's record log and lo and behold, his was FULL of mini refunds going to the same 3 credit cards over and over.\n\nRather than take the evidence to Mel, I knew this had to go further up the chain of command. I put all of the evidence I could find onto a CD (this was like 10 years ago) and put it on the desk of our General Manager along with an email I had sent him beforehand so that the next morning he would have all of the details and he could do with it what he wanted.\n\nAs it turns out, Mel had credit card debt that he racked up from online gambling. He had come to an agreement with Susie that she would process a heap of saves and pass the refunds on to him to put onto his credit cards. Because she was a senior rep he would be the one to monitor her calls so if it ever got picked up he would just ignore it. I guess he wasn't expecting me to do any of the work he said he would do. Overall Susie had been paid about $1500 in save bonuses and Mel had refunded himself about $5000 over the course of 6 months. Mel and Susie both didn't turn up for work the next day. A police report was filed against both of them and they were both fired immediately. I was brought into the GMs office to go through everything and about a month after it was all discovered I was discreetly paid a tidy bonus for \"preventing further losses\".",
        "created_utc": 1472463259,
        "upvote_ratio": ""
    },
    {
        "title": "This is my night. 65 minutes to go...",
        "author": "ermergerdberbles",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/503hg5/this_is_my_night_65_minutes_to_go/",
        "text": "Cx: I'm trying to add my new cell phone as a payee, it won't let me.\n\nMe: What error are you receiving?\n\nCx: Nothing!\n\nMe: Ma'am that's not true, what error are you receiving?\n\nCx: Nothing, it doesn't say anything.\n\nMe: (Let's try another approach) When you type in Bell, are you selecting Bell Canada or\n\nCx: [interupts] Yes\n\nMe: Ma'am allow me to finish the question so we can properly assess the issue.  Are you selecting Bell Canada or Bell Mobility?\n\nCx: Bell\n\nMe: Bell Canada or Mobility?\n\nCx: Canada\n\nMe: Ok, thank you.  Please change your selection to mobility.  Now enter your 14 digit account number.\n\nCx: It's not working\n\nMe: What are you keying in?\n\nCx: [8 digits]\n\n\nY'know what I'm not going to type the rest of this out.  You all know how this goes.  7 more rounds of the cx not listening and getting frustrated that it's not working.  In the end I resolve the issue with her and she is not the least bit thankful.",
        "created_utc": 1472448341,
        "upvote_ratio": ""
    },
    {
        "title": "If you could have an useless superpower, which one it would be?",
        "author": "nitrac",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/500hc0/if_you_could_have_an_useless_superpower_which_one/",
        "text": "Mine would be to telepatically bitch-slap people at will. \n\nOh, you're calling to complain that your order will arrive at the date we promised it would and not sooner? SLAP",
        "created_utc": 1472406489,
        "upvote_ratio": ""
    },
    {
        "title": "The lady who couldn't stop repeating herself.",
        "author": "koalaplum",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zzunj/the_lady_who_couldnt_stop_repeating_herself/",
        "text": "I work at an insurance company but not the department this customer needed to speak to and really the only person who could help was her agent and made the call 22 mins instead of the simple 3-5 min call it should've been. I'll call the customer RL, short for repetitive lady.\n\nRL: I want to know why I received something that's says \"date of loss\" from January.\n\nAutomatically I know \"date of loss\" means it's referring to a claim, I make the mistake of saying the word claim though and that sets her off.\n\nMe: Yes, I do see a claim that was filed in January on your acct but I don't see much more information, if you'd\n\nRL: WHAT?! A claim?!! I never filed a claim! I haven't filed a claim in a year and that was with a different car!\n\nMe: I apologize but that's all I'm viewing here, that a claim was filed, if you'd like I can leave an urgent message for your agent to contact you and explain further.\n\nThe call really should've ended here, I leave the message, boom go back into the call queue but no.\n\nRL: I've NEVER filed a claim with this car! Who did this?? Why would someone do this to me?? This is a breach of my security!!\n\nMe: I understand and I do apologize but your agent will have to explain further, I can\n\nRL: What on earth was the claim for?? It should have never been filed! What does it say??\n\nMe: I don't know, your agent would have to explain because I don't have access.\n\nRL: But how could this happen?? Are you going to raise my rates?? Why is a claim filed on my acct??\n\nMe: I don't know, your agent\n\nRL: but why?? \n\nMe: I will leave a message for your agent to explain why you received a notice in regards to a claim, what number would you like to be called at?\n\nRL: 123-456-7890, but what was the claim for?? I've never even filed a claim with this car!!\n\nMe: I don't know, that's why I will leave a message for your agent to call you back and explain. Is there anything else I can help with today? \n\nUnfortunately we have to ask if there's anything else we can help with at the end of the call, even if its numerous times to make sure there is absolutely nothing else the customer needs or our call gets graded poorly.\n\nRL: No but why is there a claim filed on my acct?\n\nMe: I don't know, that's why I'm leaving a message for your agent to contact you to explain, is there anything else I can help with today?\n\nRL: I find it very disturbing that you guys would file a claim when I did not authorize it.\n\nMe: I apologize that's why I'm leaving a message for your agent, is there anything else I can help with?\n\nRL: this is just so crazy this happened, I hope it doesn't ruin my insurance rates.\n\nMe: ya I'm sorry, was there anything else I can help with?\n\nRL: no I guess we're done, it's just crazy there's a claim filed under my name that I was never made aware of.\n\nMe: ya sorry again but thanks for calling 'company name', have a great day! \n\nI hung up before she could say anything else. ",
        "created_utc": 1472398293,
        "upvote_ratio": ""
    },
    {
        "title": "Yesterday was the day I finally snapped",
        "author": "Customerpunchingbag",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zymds/yesterday_was_the_day_i_finally_snapped/",
        "text": "I work for a certain large world wide IT support centre that has a multitude of service desks for other large companies. I happen to work on the one that provides IT and hardware support to a certain fried chicken joint. \n\nAt first I took the job as I imagined it was going to be a walk in the park, it paid and it was full time, I have never been so wrong in all my life.\n\nI have currently been there 8 weeks and I already snapped, for multiple reasons being:\n\n. Absolute shit management, nobody seems to know what they are doing.\n\n. A large amount of work for very little reward, I'm contracted for 40 hours per weeks and they have me down to do 5 weekends in a row and 7 day weeks at times, all for just over £8 an hour.\n\n. Little opportunity for career progression.\n\n. And the worst part for me and the bit that made me snap is a coworker we will call Amanda for safety reasons.\n\nNow Amanda is to put it bluntly a bit of a stuck up cow on a power trip just because she was a manager at a fast food place and because of that she thinks she's hot shit. Despite her not having a management position here she acts like one and for some reason seems to think she has authority over others who are on the same level as her including myself. She has a habit of sending calls back to you if she spots anything wrong with them, even if its the most minor thing like a spelling mistake and tells you to change them when she has no place to be telling you what to do.\n\nI was already on my last nerve yesterday due to dealing with stupid customers and being overworked when she started shouting at me, I mean literally shouting because I didn't log a user out of their admin account. Now fair enough I should have done it but the fact that she was actually shouting at me like I'm a child when I'm a full grown adult and she's just pushing 18 set me off. The conversation goes as follows:\n\nA: WHY DIDN'T YOU LOG THIS USER OFF??\n\nMe: Excuse me?\n\nA: YOU DIDN'T LOG THIS USER OFF THEIR ADMIN ACCOUNT, \"*&amp;£*\"(\"£(*(*\", DO YOU HAVE ANY IDEA THAT YOU'RE MEANT TO DO THAT??? YOU DO KNOW IF YOU DON'T DO STUFF LIKE THIS THEN WE'RE GOING TO FAIL CALLS AND YOU WILL FUCKING LOSE US OUR JOBS!!\n\nMe: First of all don't talk to me like that, second of all the call was originally assigned to you so what was stopping you from doing it, third of all do you think the customer is so stupid they couldn't have done it themselves? And finally don't ever fucking shout at me again, because you're not my boss, you're nothing special, unless you're a line manager or team leader don't ever think you can tell me what to do.\n\nThe office was kind of in shock after that one, I'm expecting to go in today and find out I don't have a job anymore but I will keep you all updated as to what happens when it happens, wish me luck. ",
        "created_utc": 1472373420,
        "upvote_ratio": ""
    },
    {
        "title": "I think the store associate meant to call the Clairvoyant department",
        "author": "Ancalagon1421",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zvnyk/i_think_the_store_associate_meant_to_call_the/",
        "text": "a little background for this story, as a credit card customer service agent i can not see the Point of Sale error codes when a credit card is ran. i have a different set of codes that i can take a look at once the authorization request gets submitted to the credit card company. the department that handles applications also has a different set of error codes that i cant see either.\n\nokay so store associate calls in; he is having some difficultly with completing a purchase and he gives some PoS related error code and provided the account number. i verified the error code but it honestly didnt mean anything to me as i cant look it up. i get the customer verified and pull up the credit card account for the associate, wile i am doing so, the associate tells me that the customer had an account that was closed (associate was not clear if the closed account was the number he gave or not). i am thinking \"well this should be an easy authorizations call,\" get the account pulled up and see that its security closed for inactivity. let the associate know and ask if he has the current number. here the store associate gets clearly annoyed saying something along the lines of \"no i dont have the account number, the error code is ####\" \n\nstill thinking this is an authorization issue i asked for a phone number or SSN so i can pull up the account. the associate, getting pissed now, tells me \"no! we just did the application, the error code is ####!\" so i ask for the reference number.  that pissed him off more; he said something about the error code and i dont know at that point i stopped listening. i got him to new accounts but i think i should have transferred to our clairvoyant department instead ;)",
        "created_utc": 1472324497,
        "upvote_ratio": ""
    },
    {
        "title": "What are things you wished people knew before they called in?",
        "author": "asshatclowns",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zubhi/what_are_things_you_wished_people_knew_before/",
        "text": "I really wish people knew that it is OK, sometimes even preferable to ask for a supervisor!  Sometimes, my limitations as a rep can't fix a situation that a sup can (no, i'm not talking about those spoiled whiney i-need-a-supervisor-haircut wearing ladies...).  I'm talking about that lovely granny who needs something done that I can't do but a sup can..like waive a fee.  ",
        "created_utc": 1472306329,
        "upvote_ratio": ""
    },
    {
        "title": "I just couldn't drag myself to work anymore.",
        "author": "sirithaeariel",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zshk1/i_just_couldnt_drag_myself_to_work_anymore/",
        "text": "Lots of rambling, just need to get these thoughts and feelings out to those who understand.\n\nI was on FMLA leave due to the severe anxiety attacks and depression it was giving me. \n\nI would go to work early just to be able to sit in the car for 45 min in order to have a good long cry and panic attack before going into the building.\n\nI loved my company and believed in it, I hated the job. \n\nI was just so worn out after 3 years. I didn't care anymore, I was mentally destroyed and going to therapy purely due to work. \n\nThe moment I quit it was like I just lifted all that weight off instantly. \n\nMy new job pays less and is part time, but honest to god the stress of money is lower than the stress of being at that place for one day longer.",
        "created_utc": 1472268654,
        "upvote_ratio": ""
    },
    {
        "title": "Motivation at work",
        "author": "asfinfrock",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zouyo/motivation_at_work/",
        "text": "Not a story, but I'd love some input! As a call center rep, what motivates you/what would motivate you more? I've recently been moved into a supervisory role, and I'm trying to come up with ways to encourage the team, so I'd love your opinions. Would you be motivated by offers of catered lunches for doing well? Public recognition? Longer break time?\n\nI'm open to any thoughts or suggestions!",
        "created_utc": 1472221641,
        "upvote_ratio": ""
    },
    {
        "title": "You might need to have a chat with your son",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zjm4i/you_might_need_to_have_a_chat_with_your_son/",
        "text": "[deleted]",
        "created_utc": 1472145098,
        "upvote_ratio": ""
    },
    {
        "title": "YOU MAKE IT SO DIFFICULT.",
        "author": "Fandom_Ginger",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zj88l/you_make_it_so_difficult/",
        "text": "First time posting, sorry for formatting I'm on mobile. \n\nSo I work for a call center for a pretty big financial institution which I will refer to as BANK. I deal with basic customer service issues as well as escalated online issues and a lot of the customers who call in are elderly. Here's a conversation I had with an older gentleman yesterday...\n\nMe: Thank you for calling BANK my name is Fandom_ginger may I have your name please?\n\nOG: MY NAME IS OLD GUY AND YOU GUYS MAKE IT SO DIFFICULT FOR PEOPLE TO CALL YOU! I'M LOOKING ON YOUR WEBSITE AND YOUR PHONE NUMBER ISN'T LISTED IN NUMBERS ITS JUST LETTERS. I HAD TO LOOK AT MY PHONE AND FIGURE OUT WHAT LETTER WENT WITH WHAT NUMBER IN ORDER TO CALL YOU GUYS. I AM VERY ANGRY.\n\nMe: well I'm very sorry to hear that sir. Do you have a debit card with us?\n\nOG: yes\n\nMe: well for your convenience our contact number is actually listed on the back of your debit card so you always have it with you. \n\nOG: (silence)\n\nAnd then the call proceeded as normal. I don't remember what he called for but that just really stuck out with me. ",
        "created_utc": 1472140833,
        "upvote_ratio": ""
    },
    {
        "title": "I put in my two weeks' notice",
        "author": "toomuchtostop",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zifu9/i_put_in_my_two_weeks_notice/",
        "text": "For the past two years I've done work from home customer phone support for an online retailer. Working from home was great, and I had no problems with my co-workers or managers, but still having that daily grind of back-to-back calls, rude customers, impossible metrics, and sitting on my ass all day was taking it's toll. I also worked until 8 PM so I missed out on many after work things I wanted to do. \n\nPlus it's just a monotonous, repetitive job. The script, the same greetings, the same issues and complaints over and over again. People having a fit about the $3.99 shipping charge. Also, feeling like a properly-trained chimp could do this job. \n\nBut what really motivated me to look for a new job was remembering how bad the holidays were last year. Frequently the queue was 1,500 people deep, and each caller was angrier than the last, and it lasted for almost 2 months.\n\nI recently accepted a job, one that I applied to just two weeks ago, and it has nothing to do with customer support, and has a much more altruistic mission. \n\nI just wanted to encourage the people here who feel trapped or stuck to keep or start applying for jobs. Doing it while you're currently working takes a lot of the pressure off and gives you some power back. For me, this is a job that was easy to get complacent with, especially because my co-workers are fine and I work from home. So I would remind myself how awful this job was at Christmas and that motivated me to send out more resumes. I hope something like that works for those of you who want out, too.",
        "created_utc": 1472131239,
        "upvote_ratio": ""
    },
    {
        "title": "Inhuman",
        "author": "GoodApolloImBurning",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zfh3r/inhuman/",
        "text": "I've been pretty much a lurker here reading stories to help my sanity from working in a call center myself. My company is just drenched in favoritism. It's been causing lots of problems, but nothing I could ever speak out about. However my manager pulled me into the kitchen (because he doesn't have an office to pull his peons into to talk to privately) for a come to Jesus meeting about my attitude in regards to recent things. \n\nDuring the talk I told him, \"This job makes me feel inhuman.\" \n\nHe responded with, \"You don't act human. I can't even read you.\" \n\nI've always been struggling with depression and I do have a lack of empathy, but I am human. \n\nI'm currently looking at other jobs. But I've been in this center, sorry, Central Station (because we go above and beyond that of a call center), for three years. Each day I come in, I feel myself die a little inside. If it wasn't for my friends, I don't know where I'd be today. \n\nSorry for the mess of text, my head is just a mess right now. ",
        "created_utc": 1472080997,
        "upvote_ratio": ""
    },
    {
        "title": "\"This is a Christian. Household.\"",
        "author": "IanGecko",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zf216/this_is_a_christian_household/",
        "text": "When I worked for U-derp I got a handful of calls about adult movies being charged on someone's bill. We always waived it the first time as a courtesy with a (notated) reminder that they can set up parental controls and in the future they were responsible for all charges.\n\nBut I had the exact same call twice. An older lady would call in and say there were adult movies on her bill, and after looking through her account I would say we had already waived those charges from a bill in the past and weren't able to remove any other ones.\n\n\"Sir, this is a Christian. Household. Nobody. Watches. Those kinds of films.\"\n\nI understand, ma'am, but because they're on the bill, it means somebody had to use *your* remote on *your* U-derp box to go through all the menus, select a title, and confirm it **3 times** before they watched it. If they hadn't done all that, they wouldn't be on your bill\n\nThis was 3 years ago so I can't remember if they got escalated or if the sups credited the accounts.",
        "created_utc": 1472075678,
        "upvote_ratio": ""
    },
    {
        "title": "Want to stick it out for a year",
        "author": "FedUp10910292",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4zf07y/want_to_stick_it_out_for_a_year/",
        "text": "But lately I feel sooooooooooooo fed up!\n\nYesterday was customer from hell day. I was abused more times than I can count, in fact I don't even remember what half of them said to me, I zone out now and just let them go for it. I'm used to it. \n\nIve been here for 6 months- closer to 7. I don't even know how I managed to stick it out this long. Every day feels like a drag. I work for a company with a good reputation. I know this will look great on my resume if I can stay for one full year.\n\nI'm ashamed to say I have never had a full time job before, this is my first one (I'm in my early 20's, only worked casual before). I hope this will lead to something better. \n\nHow can I stay for another 6 months? This week I just feel soooo burnt out. I usually am very diligent with exercise and nutrition and this week I have completely given up. The weather has been awful, it's been raining all week. I've been sick. I threw away a salad. I didn't go for walks on my breaks. I am just so over this lately. I've been grumpy every day having to get up and go to this shit place to put up with shit people.\n\nI get 1 second between calls if I'm lucky. What do you all do that helps you put up with this every damn day? I'm half way there, but i'm also completely fed up at this point haha",
        "created_utc": 1472075048,
        "upvote_ratio": ""
    },
    {
        "title": "Call centre just went into liquidation, everyone lost their jobs",
        "author": "ImInMediaYeah",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z95qg/call_centre_just_went_into_liquidation_everyone/",
        "text": "Did anyone else's call centre just go into liquidation, cease trading, and lay off everyone? Mine just did. What a tough day today was.",
        "created_utc": 1471991051,
        "upvote_ratio": ""
    },
    {
        "title": "I'm pretty deaf, can you please speak up?",
        "author": "great_cornholio_13",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z8478/im_pretty_deaf_can_you_please_speak_up/",
        "text": "**Me:** \"Hi, Can I speak to Mrs [Customer] please? I'm calling from Herpafone.\"\n\n**Customer** \"Hello? Can you please speak up please? I'm a bit deaf!\"\n\n**Me:** (as loud as I could without shouting) \"Can I speak to Mrs [Customer] please? I'm calling from Herpafone about the phone you've sent in for repair?\"\n\n**Customer:** \"Something Something dissection tangerine?\"\n\nI gave up after that. It wasn't that important, just a courtesy call. I updated the job notes and went on with my day.",
        "created_utc": 1471978598,
        "upvote_ratio": ""
    },
    {
        "title": "Do any of you work for a call centre that is actually...decent?",
        "author": "Ceelic",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z832y/do_any_of_you_work_for_a_call_centre_that_is/",
        "text": "This isn't a jab at all the negative stories here, I'm fairly certain they are justified. I'm just wondering if anyone has actually worked for a good call centre and has a story to tell. \n\nMe, I've been working in one for about a year and three months. I was doing phones for 8 months and now I'm on online chat and email which is INFINITELY better and more relaxing, but less engaging than phones. Working for a Canadian ISP, most customers are actually really nice if a bit uneducated (I do tech support). My centre includes a decent wage ($17/hr with annual increases, I was given an increase in the first four months due to good performance), fairly good health/dental benefits, stock options, an RRSP, sick days and a myriad of other incentives and discounts. Thats not to say that there isn't any negatives, there is still the same stat goals and the scheduling of course sucks..but I feel it could be a lot worse. There is also very little micromanaging, supervisors and managers will give you advice from time to time but you are mainly left to do the job on your own. I think anyone can appreciate this in a call centre, lol. \n\n",
        "created_utc": 1471978247,
        "upvote_ratio": ""
    },
    {
        "title": "Customers who get sexual",
        "author": "CassiopeiaV3",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z7ye9/customers_who_get_sexual/",
        "text": "Earlier this year I had a call where the man only spoke to me in a sexual manner. At the beginning of the call, of course, was my greeting which states my name. After the greeting he asked my name again and I told him.\n\nHe started repeating my name and many sexual remarks and threats that bothered me. To this day I still have nightmares about it. We cannot hang up on them, by the way. He had probably been doing that to people all day, but it felt very nasty and personal.\n\nNot too sure why I have had so much trouble forgetting it?",
        "created_utc": 1471976706,
        "upvote_ratio": ""
    },
    {
        "title": "I need your password",
        "author": "CassiopeiaV3",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z7w2o/i_need_your_password/",
        "text": "My personal favourite:\n\nMe: May I get your password to open the account?\n\nCustomer: I do not know my password!!!!!!! My date of birth is XX XX XXXX my address is 123456 Abc Road and my sister's maiden name is Jones! I went to Oak Pines School and my mother's maiden name is White!!! What else do you need??\n\nMe: The password.\n\nBahhh!!! All the useless information they spew. Just the password, kindly.",
        "created_utc": 1471975981,
        "upvote_ratio": ""
    },
    {
        "title": "Do they listen?",
        "author": "Stinkycat1",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z7hbb/do_they_listen/",
        "text": "Rant.\n\nCan I have your phone number?   \"My address is...\"  No  I need your phone #. \n\nSecurity password on your account?  May be your mothers maiden name?  \"1234\".   No.  It is not a number it is a name.\n\nPassword resets always have lower case letters.. I ALWAYS tell tem lower case letters.. even go as far as saying lowercase a as in apple.    I get to a letter \"is that lower or upper case?\".    Today feels like monday all over again. ",
        "created_utc": 1471971354,
        "upvote_ratio": ""
    },
    {
        "title": "Advice to stay busy in between calls?",
        "author": "ROGER_SHREDERER",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z7ful/advice_to_stay_busy_in_between_calls/",
        "text": "I've been doing outbound call work for about two months now and I've browsed reddit one too many times. How does everyone pass the time in between calls?",
        "created_utc": 1471970883,
        "upvote_ratio": ""
    },
    {
        "title": "Can't bring myself to do it anymore",
        "author": "Nevrend",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z74fj/cant_bring_myself_to_do_it_anymore/",
        "text": "Woke up yesterday and was having like an instant panic attack. The thought of having to speak with 100's of complaining people and seeing all my coworkers stressed up out unhappy faces actually made me vomit. So I called out sick. Same thing happened today. Today I actually got out of bed and got dressed and was about to walk out the door and I got that panicky feeling again. My heart started pounding and I thought I might collapse. I don't think I can do this anymore. Last week was just an enormous struggle. Masking my unhappiness / frustration with this job is getting more and more difficult. I am thinking about volunteering at an animal shelter or something like that until I find something else. 15 an hour (which might as well be min. wage around here) just isn't worth it to have to argue with a hundred people a day about some cheaply made foreign product. I would rather be broke than be forced to do this for a few bucks. I wasn't sure where to post this but you guys are usually pretty cool in this sub so thanks for reading.",
        "created_utc": 1471967223,
        "upvote_ratio": ""
    },
    {
        "title": "Invitations to go back",
        "author": "PantsPartyPirate",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z6frv/invitations_to_go_back/",
        "text": "I left my call centre several months ago, but they have recently taken on a major new client. Both me and my partner have received multiple emails (one from the offical agency who works with them, a couple from others) asking if we are still looking for work and want to come back.\n\nI am tempted to apply, and see if it is possible to negotiate (at least double pay instead of min. wage and better hours) given that I had such a great record and was one of the most experienced people there (or idiot for staying so long). It wouldn't be worth even thinking about with the previous conditions, but I feel that I could work it for double pay.\n\nWould anyone else consider this? Is even thinking a bottom line call centre would negotiate pay and hours a dream from another dimension or reality?",
        "created_utc": 1471958741,
        "upvote_ratio": ""
    },
    {
        "title": "\"I've already given you that\"",
        "author": "TheDroolinFool",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z5dke/ive_already_given_you_that/",
        "text": "Lovely start to my shift last night dealing with this weapons grade cunt. I won't bore you by typing out the entire conversation.\n\n*Apparently* this caller had already called twice and was expecting a call back - I check our ticket system; 0 calls logged and ask colleagues (its late so we're running a skeleton crew); nobody knows who this guy is.\n\nI tell this to the guy who proceeds to huff and puff like a teenage girl. I ask for his information so I can fix whatever probably mundane issue he is calling about and we then go around in circles for about 10 minutes while he barks at me \"I already gave that to you\" whilst I probe for simple information. [remember I just started my shift so he most definitely did not give it to me].\n\nOur calls aren't recorded (thankfully) and I have a low tolerance for this sort of bullshit so I tell him it wasn't me that he was talking to and I *need* his information to do anything - he complies whilst still moaning like a schoolgirl.\n\nIt turns out he needs a new password - it's a pain in the ass process that takes a while, which is great because now I get to listen to yet another boring rant about how long the call is taking.\n\nHere's an idea you tool, I completely get that giving information multiple times is frustrating *but* if I'm asking for it that means I don't fucking have it! I'm not going to ask you for something that I already have am I? So your whinging about already providing it is only wasting both our time!\n\nP.S if you're going to cry like a bitch about how long the call is taking maybe don't spend 10 minutes throwing a tantrum about having to provide your information?",
        "created_utc": 1471938946,
        "upvote_ratio": ""
    },
    {
        "title": "Retirees are silly people",
        "author": "WonderGinger",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z4xfl/retirees_are_silly_people/",
        "text": "Just as background, I am currently employed by a call center(I'll refer to it as Purgatory) whose corporate and management I feel are borderline bipolar in how they treat their employees. \nBetween 10/15 and 7/16 I worked customer service for flexible spending accounts, health savings accounts, and health reimbursement arrangements for a company I'll refer to flexpay. \nThe first few months were fine. I'm a pretty intelligent person, and marginally smarter than the average person they hire for that CC program under Purgatory. \nOut of nowhere, Purgatory gives us less than 6 hours to learn the inner workings of a different form of HRA that flexpay does the claims processing and accounting for, for a company that employers hire to administrate healthcare needs and HRA's for their retirees.(sorry about that run on sentence)\nSo they throw us into the water, and switch the call gating to just retirees. \nEventually they re-gated us for the original call flow we were doing on top of retiree hell. \nI should mention we received no raise for learning this stuff, and being smart, and dealing with senile people, I'm a bit salty. \nAnyway, one day I have the pleasure of speaking to a 70 year old man who is what I can only assume of Indian ethnicity, when this golden dialogue occurs:\n\nWG: Thank you for calling Purgatory, my name is WonderGinger. To better assist you may I have your first and last name?\n\n|OG(old guy) gives me his name, I go through through account verification, and other mandatory call req's like website(cause that's what old people care about), and get around to asking questions as to his reason for calling in.|\n\nOG*heavy Indian accent*: Yes, so I have a forty-nine dollar blue cross blue shield premium\n\nWG: Yes, I do see we've reimbursed you for that. How can I assist you with that?\n\nOG: Yes, uh, how much is it?\n\n|My jaw stops working and my brain shuts down for a good two seconds, and then I remember he is still there waiting for me to respond|\n\nWG: Your forty-nine dollar blue cross blue shield premium?\n\nOG: Yes, how much is it?\n\nWG: It's forty-nine dollars.\n\nOG: Ah, thank you. \n\n______________________________________________________\n\nThe rest of the call was uneventful and I ended up transferring him to a different department so he could contact his insurance provider.\n\nBut that's word for word what happened, and I'll never forget it. ",
        "created_utc": 1471929979,
        "upvote_ratio": ""
    },
    {
        "title": "Collections Notice",
        "author": "Ihavesomethingtosay9",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z3nl5/collections_notice/",
        "text": "I think it's funny how people think I care that they won't pay their collections notice. \n\nCustomer \"I'M NOT PAYING THIS COLLECTIONS NOTICE! YOU WON'T GET ANOTHER PENNY OUT OF ME!!!\"\n\nMe: *Cheerfully* Okay! \n\nSure, it'll go against your credit negatively, but at least you're not paying it. It's also not my problem, it's not going againgst MY credit, so I really don't give a shit. I can't MAKE you pay it, so.... what do you want me to do? Beg? I don't profit from it and my giagantic corporation will just write it off and not pay taxes on. Litterally no one cares but you. \n\nNo I will not remove it. No my manager won't remove it. No, corporate is the one that put that policy in place, so they're not going to disagree with themselves, so they won't remove it either. Yes... call the insurance commissioner to complain, they're the ones that approved this, but at least someone is hearing you out. ",
        "created_utc": 1471911183,
        "upvote_ratio": ""
    },
    {
        "title": "So I got off the phones and went to a store.",
        "author": "Mrmorgothbong",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z3jw5/so_i_got_off_the_phones_and_went_to_a_store/",
        "text": "Hey, apologies for any grammar issues. \n\nHey so a year back I worked in a customer service center in Ireland for ten years solid. This is something that I am not proud of but it is something I have had to do to pay for my family. It is a mystery how I got there in the first place but I did. I am finding it hard to describe a place which without naming the firm motto was \"hard work liberates us all\"\nI would like to state some of the anxieties of my time in this place. \n\nMicromanagement - Lots of it, Stats for almost everything, Complete and utter control all logged from the time to I started to when I quit. \nUnreasonable customers - Loud obnoxious people who have absolutely no soul. \n\"Service offices\" who basically are employed to spy on you and track your every move. ( No joke ) \nDumb challenges - how many hot dogs can you eat within a minute. \nDumb employee's - People that literally have a slave mentality built inside of them. They drink the \"kool aid\" for breakfast lunch tea. They refuse to even challenge anything which the management sadistically throw at them. \n\nPower hungry management - The  flip side of things, managers that pray on people weaknesses and exploit for their own agenda. I have seen management really enjoy tormenting their slaves. When I say slaves the ones they are exploiting. \n\nThen there was me. - I have always been someone that challenges everything and hold my ground, I honestly didn't find the customers that difficult but with the stress of the management pushed me over the edge.  I eventually got sacked four months back, I have started a new job working in a store and it is not great. I put heavy goods out on displace and deal with all the trash. You know what though? It kind of feel good at the same time, I am losing all the weight I put on in the call centre. Every time I get on my knees to stock a shelve I am forever grateful that I am not missing my train because of a psychopathy keeping me on the call's towards the end of the shift. \nNo body is watching my screen and monitoring my every word. \nIt is almost amazing getting away the clutches of total control and working in my new place, ok it sucks. nor is it my dream job. Yet the freedom you lose from working in a call centre is absolutely priceless. \n ",
        "created_utc": 1471909804,
        "upvote_ratio": ""
    },
    {
        "title": "My best friend got fired today.",
        "author": "thePDtactic",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z3gsj/my_best_friend_got_fired_today/",
        "text": "He couldn't be happier. He has worked there for 6 years since the place opened and I think his life just got better for the first time in a long time. He is a very depressed guy with a good sense of humor. He always seemed a little angry most of the time, but it wasn't him. He had just worked there too long. I have only seen him smile a few times since the year I have known him. He got walked out this morning with the biggest grin on his face. It gives me hope in a way. I'm happy he got out even if he was fired.",
        "created_utc": 1471908658,
        "upvote_ratio": ""
    },
    {
        "title": "Mattress nightmare",
        "author": "Wizard4877",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z368b/mattress_nightmare/",
        "text": "So I worked in a call center for a major online retailer that sells home goods. This crazy lady (CL) calls in regarding returning her mattress (we cannot take mattresses back if the packaging has been removed unless it is damaged/defective, this one was neither)\n\nME: Thanks for calling (COMPANY) my name is Wizard, how may I help you today?\n\nCL: I need a new mattress, the one that was delivered is ruined.\n\nME: I am so sorry! In what way was this damaged or defective?\n\nCL: It has paint all over it!\n\nME: ......The mattress is covered in paint? (This supplier sells only beds, the only way this could have happened is if the packaging was ripped at a DA that receives many different shipments and somehow a shipment of paint leaked on it, not impossible, but rare)\n\nCL: Yes, I was putting the bed frame together and leaned the mattress against the freshly painted wall and now it's covered in paint, you need to send me a free replacement NOW!!\n\nME: I am very sorry for the mishap, but unfortunately because we're not at fault we're not liable to replace it, you can dispose of that one and purchase a new one and I can give you 10% off for your troubles.\n\nCL: THIS IS UNACCEPTABLE, YOU CAUSED THIS PROBLEM AND YOU NEED TO FIX IT NOW FOR FREE!!\n\nSo this shit goes back and forth for a good 20 minutes, me asking why she just didn't put the mattress in a different spot instead of the freshly painted wall, which now needed to be painted again due to her lack of foresight or overall logic. No joke, she escalates to my manager and fucking starts fake crying (I listened to the call and it seemed forced, but who knows?) and he just comps a new mattress and gives her money off for a future order so she could buy new paint. We just lost $1k because someone didn't think to NOT lean her brand new mattress against wet paint.",
        "created_utc": 1471904812,
        "upvote_ratio": ""
    },
    {
        "title": "Stories of the Super Secure",
        "author": "WingAndTail",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4z1fwx/stories_of_the_super_secure/",
        "text": "Today I shall share a selection of short stories from Alarm Company about some possibly paranoid people.  \n\nBut before we began, a little information on codewords. They are a verbal password for the account and can be set to whatever you want them to be: first pet's name, deceased relatives, phrases you'd be ashamed to say in front of your mother, or anything else you'll be able to remember when prompted. Like any other password, you don't want it to be easily guessable and shouldn't tell it to other people unless they need to be able to tell it to us. And of course, if we ask you for it you should tell it to us because we are asking for a reason. Seems pretty simple, right? Right.  \n\n**Scam Guard**  \nAn alert comes down for a temperature alarm at a school somewhere. I'm checking in with the location so they can shut the freezer door or whatever.  \n\n&gt;**Me:** This is Alarm Company, we received a temperature alarm for the freezer.  \n&gt;**Lady:** Yea everything is fine here. They're restocking for the school year.  \n&gt;**Me:** Okay, do you want us to put the system in test mode while they're loading it so we won't call if it goes off again?  \n&gt;**Lady:** Sure, that'd be fine.  \n&gt;**Me:** Alright, could I get your name and the codeword please?  \n&gt;*Another voice is clearly heard in the background.*  \n&gt;**Other Voice:** *I think it's a scam!*  \n&gt;**Lady:** Oh, uh, I don't think you need that.  \n&gt;**Me:** If you want the system in test mode I will need the codeword.  \n&gt;**Lady:** No it's fine! *-click-*  \n\nCalled back 15 minutes later when it went off again and they didn't answer the phone, so we called the principal who was happy to give us the codeword.  \n\n**Cell Phone**  \nBurglary alarm comes in, no answer at the house so we send the police and start calling contacts. First up was the husband's cell phone, no answer again. Next was the wife's cell phone.  \n\n&gt;**Me:** This is Alarm Company, we have a burglar alarm for your residence and we've dispatched police.  \n&gt;**Wife:** Was it from the garage? We were a little slow getting out of the door.  \n&gt;**Me:** Yes it was, did you want to cancel the police?  \n&gt;**Wife:** Yea, I don't want to head back there.  \n&gt;**Me:** Not a problem, could I get your codeword please?  \n&gt;**Wife:** Oh I'm on my cell phone, I can't say it. Just cancel the police for me.  \n&gt;**Me:** I need your codeword in order to cancel them.  \n&gt;**Wife:** Well I can't say it over a cell phone so I guess we'll just have to head back home. *-sigh-* I really don't have time for this.  \n\nI get her eta and vehicle info and pass it on to the police, who I am sure are happy to spend their time going out unnecessarily.  \n\n**You First**  \nAnother burglary alarm, calling the home phone first.  \n\n&gt;**Me:** This is Alarm Company, we're showing a burglar alarm for your residence, is everything okay there?  \n&gt;**Woman:** Yea, everything is fine, forgot to turn it off before I let the dog out.  \n&gt;**Me:** Not a problem, could I get your name and codeword please?  \n&gt;**Woman:** My name is Name.  \n&gt;**Me:** And your codeword?  \n&gt;**Woman:** Don't you know it?  \n&gt;**Me:** I need you to tell me it.  \n&gt;**Woman:** If you don't know it I'm not telling it to you.  \n&gt;**Me:** I know what it is, but I need you to say it for me.  \n&gt;**Woman:** Well what is it?  \n&gt;**Me:** I can't tell you what your codeword is, you need to tell it to me or I'll have to dispatch the police.  \n&gt;**Woman:** You should already know it! I'm not telling you my codeword.  \n&gt;**Me:** Okay then, thanks for your time.  \n\nAnd again the police are sent out, followed by a call from the front office asking to cancel that dispatch because the homeowner had called in.  ",
        "created_utc": 1471884322,
        "upvote_ratio": ""
    },
    {
        "title": "Unexpected update from my previous post: \"Inspiration from an ex call center employee\". It unexpectedly got even better...",
        "author": "callcentrthrowaway",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yxrv7/unexpected_update_from_my_previous_post/",
        "text": "I posted [this here a few weeks ago](https://www.reddit.com/r/talesfromcallcenters/comments/4yfgpb/inspiration_from_an_ex_call_center_employee_if/) and I want to share more.\n\nIt's still only 1.5 years since I left the call center, but it did change me. I hope it isn't permanent. My GAD manifested there and it's slowly decreasing, but still present. Sometimes I'll be working and my heart will start racing for no reason. I also acquired the fear that I could be fired at any moment, and I hope that will go away in time too. My new manager is such a normal, professional person I have to make sure he doesn't know what a nutcase I am sometimes.\n\nSo, I have been in my new position at a new company for nearly 2 months now. On Friday afternoon my new manager put a 1-1 on my calendar called \"Meeting about goals, let's discuss progress\" I nearly cried, I thought I was going to get fired. It was End of Day Friday, too. I had only received positive feedback, but I thought maybe since I was so new they just wanted to fire me without any sort of coaching or feedback.\n\nWhen we met, my manager told me he was so impressed with my performance and he had decided to rearrange my position. He pointed out some of the operational duties I was in charge of and said they were hiring for some positions and as soon as those employees got hired, they would be taken off my plate. He then presented me with one of his projects he wanted me to partner with him on. It would be a new challenge I'm not familiar with (corporate financial modeling and I don't know anything about corporate finance), but if I wanted it, at the end of my year I'd be eligible for an additional bonus depending on how well I did. He then asked if I would like one of the new hires to indirectly report to me, (he would officially be their manager) and if that went well, at the end of my year, I'd be eligible to be a manager. I spent these entire two months working my ass off in fear of getting fired, completely forgetting that positive feedback and adult respect is a *normal* part of *normal* work environments.\n\nI don't know if this resonates with anyone, but I think it might because all I had in that meeting was my call-center mindset of being treated like a child who might get fired, and here I was getting higher level responsibilities, the mindless tasks being taken off my plate. I know so many people who are as smart and hard working as me that are *still* at the call center and I cannot figure out why, so I just wanted to post this as inspiration. I was a mediocre call center employee. My stats were decent, but the managers really disliked me, and now I am doing so much better in a more professional job in an environment that is *not toxic*. If I can help anyone out in any way--looking over a resume, framing your call center experience in a way that's transferrable to other positions, please don't hesitate to reach out. I respect you all so much for what you put up with every day and if you want out, you *can* get out!",
        "created_utc": 1471822623,
        "upvote_ratio": ""
    },
    {
        "title": "\"But it's my birthday!\"",
        "author": "expeditethisish",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yxc9r/but_its_my_birthday/",
        "text": "Hi again, same person with the Crazy Email Lady post not too long ago. Thought I'd share a funny but annoying story that happened today at work. \n\nSo I get a call from a customer who claims she lost her $150 gift card that she got for her birthday and wants a new one. Ok, so I hate gift cards. Gift cards are untraceable, we don't keep record of every gift card ever, and they're generally a pain in my ass because they make simple situations 900x worse. Anyway, I tell her \"I'm so sorry! However, we cannot replace misplaced or lost gift cards.\" \n\nShe asks, \"Why can't you give me a new one? It's not my fault I lost it! It's my birthday, and you're not going to let me spend money at **YOUR** company? I guess you don't want my birthday money.\"\n\nAgain, I apologize and ask if she's ever shopped with us before - I wanted to see if she had a registered account so I could maybe do something nice like give her 15% off her next order or whatever. She says, \"I can tell you my birthdate.\"\n\n\"Unfortunately, we don't keep records of customer solely by their birthdate - may I have your first/last name and email address?\"\n\nShe then tells me, \"Why do you want my name? Can't you just give me something - it's my birthday!\"\n\nThankfully the call dropped after this point, and I didn't hear back from her. The whole conversation made me wonder if she was lying in the first place, as we've had customers bluff their way into getting free shit from us before, but it was definitely worth a laugh.",
        "created_utc": 1471816436,
        "upvote_ratio": ""
    },
    {
        "title": "\"Don't you know who this is?!\"",
        "author": "welcomepleasehold",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ytwdb/dont_you_know_who_this_is/",
        "text": "Hi! I'm rather new to this subreddit and also to working in a CC, but I have a story about a customer I'd like to share with y'all. \n\nI work for a pretty big telco in Europe, been working for about six months. My job is to provide tech support for cell phones, tablets and mobile broadband. Normally it's as simple as \"try turning your device off and back on\", problem solved, customer is satisfied. Most of the customers I talk to are nice and grateful to get help, so it's a pretty nice gig compared to what working at a CC can be from what I've heard and read on this sub. The story I'm about to share does not, however, involve a nice and grateful customer. \n\nWhenever I answer a call, the customer info shows up on the screen automatically if they've provided a phone number or customer ID, and this one time I answer a call and the name that shows up is a local politician. It was their assistant calling in, called PA in this story (I'll call myself TS).\n\nTS: Welcome to \"telco\", you're speaking with TS, how can I help you today?\n\nPA: We have no service on our tablet. \n\nTS: Alright, how long have you experienced this issue?\n\nPA: It's been like this for over a month, why haven't you fixed it yet?\n\nTS: I'm sorry to hear that, have you called in about this previously?\n\nPA: No? It's just supposed to work and now it doesn't. \n\nTS: I understand. Have you tried switching the tablet off and turning it back on?\n\nPA: No we haven't, we shouldn't have to do that. You need to fix this problem right now. \n\nTS: Okay, would you mind restarting it while I'm on the line to see if it resolves the issue? If not, there are other things we can try to make sure it gets working again. \n\nPA: Do I have to? I don't have the passcode or PIN for it and I really don't want to bother my boss for this. \n\nTS: I understand, but in order to help you we'd really need to restart the tablet to begin with. \n\nPA: (obviously bothered by this) Fine, I'll just go ask my boss for the codes. \n\nThe line goes quiet for like five minutes until the guy comes back. \n\nPA: Okay so what now? I just restart the tablet?\n\nTS: Yes please, just turn it off like usual and I'll also update the information on the SIM card while it's shut off. This should help solving the issue. \n\nPA: (after a minute or so of silence) It's working now. What will you do to compensate us for the time it's had no service?\n\nTS: According to our policy you can only get compensation from the day you call in about the issue until the day it's resolved, so in this case the compensation would come out to about $1.\n\nPA: WHAT?! That's not acceptable, this thing hasn't worked for over a month, you need to reimburse us for this. \n\nTS: I'm sorry about that, but those are the terms you agree to when signing up for a subscription with us. If you had called in when you started having this issue it could have been resolved earlier. \n\nPA: This is unacceptable, CAN'T YOU SEE WHO OWNS THE SUBSCRIPTION? THEY ARE A VERY IMPORTANT PERSON! They work abroad a lot and the tablet not working has caused them a lot of trouble! \n\nTS: Yes, I can see who the owner of the subscription is, however the general terms and conditions apply to all of our customers. \n\nPA: I demand to talk to a supervisor, this compensation is outrageous. \n\n(Whenever a customer doesn't accept the compensation offered by front line agents, we are required to call the Customer Relations department.)\n\nTS: Will you please hold for a moment while I call our Customer Relations department?\n\nPA: Will it take long? I don't have much time. \n\nTS: It'll only be a couple of minutes, I'll be right back with you. \n\nSo I call CR and explain the situation and they only confirmed what I already told PA, and said that if I escalated to them he'd only get the exact same answer. \n\nTS: Thank you for waiting! I talked to Customer Relations and I'd be happy to escalate your issue to them, however you're going to get the exact same response I just gave you. \n\nPA: This is ridiculous, can't you see that this is a Very Important Person and this is a pathetic excuse for customer service. \n\nTS: I'm sorry you feel that way, but the terms and conditions are things you accept and agree to when subscribing to our services. What I can do for you is reduce your next bill by what you're entitled too, and you can either accept that compensation or you can choose not to. \n\nPA: Fine, we accept the compensation but this is NOT the last you've heard from us! *click*\n\nI still find it really annoying that he tried to play the VIP card when really, every client is treated the same unless they have a special contract, in which case they'd have another number to call for support anyway. Also, if this moron had called in a month earlier they wouldn't have been without service for so long. \n\nTL;DR personal assistant of a local politician tries to get special treatment despite not having contacted company for a month when they had no service on a tablet. ",
        "created_utc": 1471768225,
        "upvote_ratio": ""
    },
    {
        "title": "\"You're stopping us from catching a murderer\"",
        "author": "Bozzaholic",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ysyo5/youre_stopping_us_from_catching_a_murderer/",
        "text": "I used to work for a vending machine company and the gig was simple... Customer phones in, we record the issue and an engineer goes to site to fix issue.\n\nA few years ago we had a serial killer on the loose killing prostitutes, I live in a quiet area so this was huge news...\n\nIt's 4:45pm on a Friday and the office is winding down for the weekend. Most customer do not have weekend cover as its at a massive premium... \n\nMy phone rings...\n\n$Bozzaholic: Good afternoon, vending how can I help\n\n$Customer: This is regional police constabulary, we have an issue... We have lost the key to our self fill sandwich vending machine \n\n$Bozzaholic: OK I can order you a new key but as the manufacturer is Dutch and we don't stock that particular key it will take 3 working days or...\n\n$Customer: That's not good enough\n\n$Bozzaholic: yeah, or what can do is get an engineer to pop a key in first thing Monday morning\n\n$Customer: No. I need it now\n\n$Bozzaholic: I'm sorry but the engineer's work routes have been set for the afternoon and his last job is a 2 hour drive from your location and we've set the job up so its near his home. He will not make a 4 hour journey on a Friday afternoon to replace a lost key\n\n$Customer: I don't care. There is a murderer in the loose at the moment and your attitude is stopping us from catching him\n\n*my jaw drops*\n\n$Bozzaholic: I... Err... OK... I'll speak to the engineer to see what I can do but I can't guarantee anything\n\n*I spoke to the weekend engineer, begged him to go out on the Saturday morning in exchange for a lightened workload on another day*\n\nCustomer was unhappy that I didn't get a key out to them same day and I got a shitty  customer satisfaction survey",
        "created_utc": 1471751065,
        "upvote_ratio": ""
    },
    {
        "title": "The struggle of managing life and work",
        "author": "mrsdeltaeon",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yqkuz/the_struggle_of_managing_life_and_work/",
        "text": "\nThis job takes so much from people and their personal lives. This is a stressful job, as anyone can assume that dealing with the general public is stressful. But it also doesn't allow for much flexibility, even though at first it seems to be more than other places. The schedules are assigned through a bidding process based on performance and tenure, and you are mostly stuck with what you get. So if you have a schedule that doesn't align with school class times, then you either have to alter your school schedule or reject school all together. If you schedule doesn't allow for time spent with your family, either kids after school or before school, then they suffer feelings of neglect and you suffer feelings of guilt and longing for their time. There is a guy here who is getting ready to get married and has suffered from lack of time with his fiance. They both have alternate schedules, where he works at night and she works in the morning and she is off on weekends and he is off during the week (needs of the business). They never see each other, and obviously the relationship is suffering. From what I hear, his complaints to coworkers reached to a member of management who approached him and offered to allow him to go on unpaid leave. As good as that sounds, how long would a couple need to feel satisfied with not seeing each other? His job and hers will not change, the schedules will not later. Do they just need a few weeks to reconnect? What about afterwards? That is a band-aid, and maybe the best a business can offer for one particular person in this particular situation, but ultimately this employee is going to need to find another job with a schedule that aligns with his fiance. Maybe you are thinking the fiance could find something else, but the likelihood of finding a good paying job that has you working from 2:15p-11:15p with tues/wed off is unlikely, less likely than him finding a job from 8a-5p with weekends off as she has. Lets consider it was easy enough for her to find a similar job with the same schedule? Doesn't matter. This center has schedule bidding (mentioned before) done annually. How can his fiance expect to chase his schedule when it changes every year? \n\nWell, if it changes every year, what if he gets a better and more aligning schedule? That is defiantly possible, depending on the competition in the bidding. Would it be a viable option to expect them to wait until that happens, to put their relationship on hold (for 7 months as of right now)? Would a two week vacation (unpaid) allow them to reconnect and encourage their continued connection while their schedules differ (drastically) for the next 7 months?\n\nI am really feeling the hypothetical situations, so let me continue with another one. Let's say he gets a more helpful schedule, by chance that his performance and tenure was enough  to prioritize his preference and  not many other people competed for the same schedule, he landed it. Now him and his fiance (hopefully his wife by then) are finally having dinner and breakfast together, and weekends together for date night, emotional processing, connecting. When he comes home from working with the general public, the entitled and superstitious (sometimes outright insane) people who ask for things we either have absolutely no way to provide or can provide through means of exploiting the company and losing our job, all for their personal and irrelevant gain. These things we deal with, 20-40 people a day, customers and store agents, all demanding us to validate and empathize with their emotions and provide them with their unrealistic expectations, followed by the feedback of a supervisor who hasn't experienced being on a phone call for years on how it could have been better. The emotional drain from not just the one situation but the combination results in irritation and frustration, feelings of worthlessness and devalue resulting in insecurities, and the disconnect from people in general creeps into disconnect from loved ones. So lets say this guy is able to align his schedule with his fiance, but he comes home upset and she has a responsibility to understand and help him emotionally process. It happens every day so either she becomes disconnected from him and feels neglected, or is giving so much and receiving nothing in return and she feels taken advantage of. How do they repair that? Does a two week unpaid vacation allow for repair for that?\n\nWhat if they want to start a family and have kids?",
        "created_utc": 1471719831,
        "upvote_ratio": ""
    },
    {
        "title": "A thank-you to my supervisor",
        "author": "mrsdeltaeon",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yqi80/a_thankyou_to_my_supervisor/",
        "text": "Disclosure: This is still related to the work environment, however there is some backstory that is necessary to elaborate on to really exemplify the situation. \n\nWhile I am out of work on short term disability, my supervisor sends me a text message stating he received an email from insurance about my claim being denied. After a short panic attack I asked him to forward me the email to refer to, and I received no response. I called insurance, was told the claim was being reviewed still and recommended for denial, but had not officially been denied. Feeling both confusion and frustrated (with the ridiculous claim process and terminology) I continued my day. Later in the week I received the letter from my insurance on my claim being denied and the paperwork to file the appeal. I filed the appeal with over 30 pages of paperwork to legitimize my claim including physical examinations and imaging. I had my interview with insurance about my appeal, and the appeal was filed. \n\nAnd this is two weeks later my supervisor texts me back and says \"We need to talk. When can you talk on the phone?\" I reply something like \"I am available around 2pm.\" I receive his reply that was lengthy, and to summarize, he said we needed to talk about my claim being denied and that I needed to reach out to my insurance.\n\nSo, one, thank you for responding to me two weeks after the initial discussion of the claim being denied. \nTwo, thank you for being involved in something that you have no responsibility over. Insurance and short term claims are entirely my responsibility and as a supervisor you have no responsibility to notify or assist me with resolving the issues related to the claim. \nThree, thank you for not sending me the email you received and completely ignoring me when I found it important to communicate.\nFour, thank you for helping me in no way and doing more damage by annoying me over something I had already been frustrated, confused, and anxious over. \n\nWhen I returned to work he wanted to ask how I was doing, and after a period of honesty all he had to say was that I was too young to have the issue.\n\nThanks.",
        "created_utc": 1471718959,
        "upvote_ratio": ""
    },
    {
        "title": "Those people who don't know what a manufacturer is...",
        "author": "PM_TIT_PICS",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yqf8c/those_people_who_dont_know_what_a_manufacturer_is/",
        "text": "So I used to work at a call center for a sprinkler system manufacturer.  We'd make the stuff like the timers, sprinklers, valves, drip products, hose end products, etc.  Then we'd send them to the stores like the big orange one and the big blue one and people would buy them there.\n\nNow when people called in, we'd troubleshoot the issue with them and send out replacement parts if it was under warranty.  That's it.  We did no service calls (we're located in one call center and service all of North America for God's sake).  Some people did not get this.  Some people thought that we knew exactly how their systems were laid out (\"Hi, I live at 123 address.  Where are my valves?).  This story is about those people that don't know what a manufacturer is.\n\nMe: Me\n\nOL: Oblivious Lady\n\nOM: Oblivious Man\n\nMe: Thank you for calling [company].  How can I help you?\n\nOL: Our pipe is broken.  Can you send someone out to fix it?\n\nMe: Well we don't actually send people out on site to make repairs, I'd recommend checking the yellow pages for someone near you.  And anyway, we don't actually make the piping, just the sprinklers, timers, and valves.\n\nOL: But you guys installed it.\n\nMe: We definitely didn't install it...  Maybe a contractor near you did?\n\nOM (in background): Here give me the phone.\n\nOM: Listen here, we need you to come out and fix this today. Our main line for the sprinklers is broken so we had to turn off the water to the whole house!\n\nMe: Sir, we don't have any technicians that come out on site.  We only have phone support.  And like I said earlier, we don't even make those parts.\n\nOM: You installed this before we moved in!  Come fix it!\n\nMe: We don't have anyone who comes out on site so it wouldn't be us that installed it.  We're only the manufacturers.  Maybe try contacting your homeowner's association and they can tell you who installed it?\n\nOM: This is outrageous!\n\n*hangs up*",
        "created_utc": 1471717921,
        "upvote_ratio": ""
    },
    {
        "title": "Seven Years in an unnatural job.",
        "author": "Wolfgangmegahertz",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ypldy/seven_years_in_an_unnatural_job/",
        "text": "Reading over this sub brings back a lot of emotions and memories for me.  I no longer work in a call center (I'm a therapist now... which is a little ironic, I guess) but as much as it pains me to think about it, I must have spent about seven years working in different call centers. I've done tech support, customer care, billing, sales and directory enquiries.\n\nOccasionally I will meet clients in therapy who are suffering with call center related stress, so I get further evidence (as if it were needed) that the call center environment can bring about very real, painful issues.\n\nDuring my seven years I experienced a spectrum of situations unfortunately all too familiar to those posting on here. The targets you are given that are actually completely incompatible with other aspects of the job. Ridiculous rules and procedures that are completely counterproductive and only serve to create stress. Managers favourites getting preferential treatment. Callers who somehow manage to get deep under your skin despite your best efforts to remain calm and professional. Colleagues who either don't care/aren't trained properly which then results in your own workload unfairly increasing tenfold. That hard, hopeless feeling in the pit of your stomach as you start another working week.\n\nAll I can say, to those who are really suffering, is that it can get better. I really don't think most people are \"designed\" to work in such conditions. The repetition, the absurdity, the statistics and the pressure... it really is quite unnatural. Don't be afraid to try your hand at something different or at least squirrel your money away for your education so that working there becomes nothing more than a means to an end. Don't let your job define you. Nobody deserves to be at their wits end over something that is so meaningless. Sure we all need money to live and while we can't always stop the initial pain, we can choose whether or not to suffer.",
        "created_utc": 1471707410,
        "upvote_ratio": ""
    },
    {
        "title": "The day there was, what never could be",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yo7dq/the_day_there_was_what_never_could_be/",
        "text": "[deleted]",
        "created_utc": 1471684919,
        "upvote_ratio": ""
    },
    {
        "title": "Ripping people off for a living is eating away at my conscience...",
        "author": "BrokeJunkieFailure",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yn9y1/ripping_people_off_for_a_living_is_eating_away_at/",
        "text": "I work in a high pressure sales call center, partially because I was deceived during the interview and training process, but mostly because I'm borderline destitute, just scraping by and need every penny I can get.\n\nThe longer I spend, the worse it eats away at my soul. \n\nI can't help but to feel like the biggest sleezeball scumbag on every call. My superiors actively encourage me (and pretty much force me) to use dirty tricks, doublespeak and often blatant lies to close a sale, otherwise I face ridicule, accountability and ultimately termination for not reaching quotas. I always have a manager hovering over my shoulder making sure I'm sticking to the script and scolding me if a hint of humanity slips out of my mouth. People I'm selling to often express genuine gratitude to me for doing what they think is a favor to save them money and provide a beneficial service, when in reality I've just locked them into a shady contract and likely obliterated their financial security for the next few years. \n\nI feel horrible. \n\nMost of my victims are very elderly people who are clearly not all there mentally, living off of their social security checks and other gullible people who are also on a fixed income. It is just so filthy and wrong. \n\nIn my private life I warn everyone I come into contact with to avoid my employer at all costs, yet on the clock I have to put on a fake smile and pimp them out in an honestly dispicable manner for a minuscule paycheck, and I'm supposed to be grateful for the opportunity to do so. \n\nIt's so fucked up. \n\nI go home every night feeling like a conman who will end up deserving of the bad karma coming my way, but alas I need money and this job keeps me going... ",
        "created_utc": 1471667652,
        "upvote_ratio": ""
    },
    {
        "title": "working with people you don't like",
        "author": "deuxexandra",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yl076/working_with_people_you_dont_like/",
        "text": "We're all adults here and working with jerks is a part of life. What are some coping mechanisms that you use to get through their bullshit without it affecting you or costing you your job?",
        "created_utc": 1471637525,
        "upvote_ratio": ""
    },
    {
        "title": "I hope I never have to do this again",
        "author": "Hexerade",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ykr9v/i_hope_i_never_have_to_do_this_again/",
        "text": "I work in a call center for one of the major cell phone companies. This happened sometime yesterday. More of a vent than not because it keeps playing back in my mind. (Thanks to /u/Adventux for pointing me in the direction of this subreddit.)\n\nA woman calls in, must have been at least 75 years old, she's looking to disconnect a line. I start my spiel about trying to save the line (required), but it just doesn't feel right. I ask her why she wants to disconnect the line, and she tells me that her son passed away. I'm obligated to tell her that if she doesn't back up her content before I disconnect the line and she trades it in, she would lose that content. She just responds with \"Oh... I guess I better do that then...\"\n\nI'm helping her connect this phone to her laptop, and she's going through pictures and videos and the music that her son helped her set up. I hear the videos in the background as she watches them again. She tells me all these wonderful stories about him, the trips he took, the things he did. I'm genuinely having a tough time keeping it together, because he sounds like a great person and she sounds so sad and lonely, but she kept her composure so well.\n\nCall takes about two hours. We finally finish moving everything from her phone over to her laptop and I submit the disconnect. She thanks me for my time and for listening to the rambles of an old woman. I take a breath, and it comes back out as a sob. I didn't even realize that I had been crying for most of the call. Super has been listening in on the call for a while and he tells me to just go home early if I want, he'll cover if anyone asks what's going on.\n\nI love my job. Really, I do. Sometimes it's hard. Calls like this make me wonder if I can keep doing it.",
        "created_utc": 1471634708,
        "upvote_ratio": ""
    },
    {
        "title": "Following the script to a fault",
        "author": "scruit",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yk3bh/following_the_script_to_a_fault/",
        "text": "*Caller, not call center staff.\n\nI quit DirecTV a couple of months ago and they send me weekly beg letters to come back.\n\nI called them just now and asked that I not receive any more marketing from them.  The rep asked for my phone number to look up the account.\n\nThen, presumably following a script, asked; \"Is this number good to reach you with information and offers for products and services from DirecTV and ATT?\"\n\n\"NO!  Is that's the whole reason I'm calling! No!\"",
        "created_utc": 1471626528,
        "upvote_ratio": ""
    },
    {
        "title": "Customer is Rude to me for doing the job",
        "author": "SirMize",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yjt7b/customer_is_rude_to_me_for_doing_the_job/",
        "text": "Cx: I am still getting mailing to my address, I called in before to stop it but its still coming\n\nMe: sure sir, just give me a moment and I will correct that\n\nOn hold for 4mins, I fix the problem last agents didn't do anything\n\nMe: alright sir I got that corrected \n\nCx: I just want to let you know that the last agents only took a min to fix it, you took too long, just too let you know\n\nMy inner rage: Just so I'm understanding correctly you buttmunch, you are saying the last agents who clearly didn't fix your problem, because you had too call back did a better job than me, because they put you on hold for a minute and fixed nothing. And now you are insulting me for actually taking the time to fix your problem, fuck you cunt rag.\n\nMe: ok sir I will note that, thx for calling",
        "created_utc": 1471623436,
        "upvote_ratio": ""
    },
    {
        "title": "Inspiration from an ex call center employee. If you want to get to a better position, you can. Here's my story",
        "author": "callcentrthrowaway",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yfgpb/inspiration_from_an_ex_call_center_employee_if/",
        "text": "I started working at the call center about 2.5 years ago. I was 25, lived abroad for a bit and it was my first \"real\" job after college and I was regretting my liberal arts degree. I was there for one year. I made $16.75/hr, which barely covers cost of living in my area. The call center perpetuated my anxiety so badly. It was the most horrible job ever. The managers I had were awful people. The job itself was awful. I would go 1-2 days without eating. I couldn't do anything but sleep. I was petrified of getting fired for clocking in one minute late and all the usual bullshit I'm sure you're all familiar with.\n\nAfter one year I applied to another position in my company that was non-customer facing. I wrote a great cover letter and set up an informational interview with the hiring manager, prepared and got the position less than one week after applying. It was a lateral move doing IT/web support and operations. It paid $19.95 and had no set schedule, just claimed hours on time sheets. Did I mention I didn't even have a phone on my desk? It was a million times better than the call center, but at the same time, was also mind numbing, but that was just how it went in my company.\n\nAfter a year at job #2 I applied to a position outside of a company. In the role after the call center I learned a lot of SQL and Excel, which are very in demand skills. I interviewed and got it. I am now salaried at $58k with stock and bonuses. It's less stressful than either job. It's more interesting and it's a better atmosphere.\n\nI just wanted to post this for those who want out and don't know how to get out.",
        "created_utc": 1471562133,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting webchat I just got...",
        "author": "Linksys_to_the_past",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4yedtc/interesting_webchat_i_just_got/",
        "text": "I am typically a Sales Webchat agent and I do back up Retention Calls. Today this little gem of a webchat came through to me: \n\n\n\n\n**Sir says:**\n&gt;I need my internet password changed to shitabrick1, please\n\n\n\n\n\n**XXXX says:**\n&gt;Thank you for contacting HerpDerp! We're happy to help you with that inquiry but unfortunately for that request I am unable to help you through chat. We ask that you please call in at XXX-XXX-XXXX.\n\n\n\n\n\n**Sir says:**\n&gt;why not, cause I have done it before on here\n\n\n\n\n**XXXX says:**\n&gt;This is the sales webchat. I can not assist you as I am a sales agent, not an internet agent. \n\n\n\n\n**Sir says:**\n&gt;okay I understand thanks again\n\n\n\n\nI adjusted some of the words (like branding of my company etc) But I literally just copied and pasted this conversation. I can't tell if I'm being Trolled or if this guy was serious but regardless it gave me a pretty good laugh that I needed. ",
        "created_utc": 1471550042,
        "upvote_ratio": ""
    },
    {
        "title": "Moving Forward",
        "author": "Linksys_to_the_past",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ye6jn/moving_forward/",
        "text": "So, I recently decided I wanted to go back to school and get a degree in computer programming in between the usual slog of Call Center Work. \n\nI was wondering if anyone knew of any all online schools that aren't gonna scam the hell outta me? I know this seems like an odd place to ask but I feel that all of us here understand more what it means to get that degree and get out of this work more than the people I know personally. ",
        "created_utc": 1471547914,
        "upvote_ratio": ""
    },
    {
        "title": "OK, I don't feel good then",
        "author": "Mithriark",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ychtt/ok_i_dont_feel_good_then/",
        "text": "LOL. So you are going to set it up that I do almost all the work here. Take calls all day while other people sit on their ass and do nothing then blame me for people waiting on hold. OK, I don't feel good then. Your hold times just got even worse. Good luck with everything.",
        "created_utc": 1471529792,
        "upvote_ratio": ""
    },
    {
        "title": "\"You should have asked me more than once\"",
        "author": "rach-2912",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4y8k45/you_should_have_asked_me_more_than_once/",
        "text": "Nearly lost it at work today.\n\nMe: Good afternoon bla bla bla dpa ba bla bla. Stupid Customer(SC): I'm in (insert country here) and my roaming is not working on the phone.\nMe: Ok, I need to ask a few questions here to get to the route of the problem. SC: So you can't fix it then? Me: No I need to find out whats wrong first. SC: Make it quick.\n\nAnyway I'm too tired to give the full details of this conversation. So I start with basicS. I ask the customer to check to make sure the roaming is turned on in the phone and I check my systems to make sure she has credit etc. All fine.\n\nThen I tell the customer we need to check and change settings. So I spend AN HOUR AND A HALF!!! going through settings with the customer. All the while she questions everything I ask her to do and repeatedly asks if I know what I am doing. I try to be patient and calm and answer her repeated childlike \"whys?\"\n\n90 mins in and nothing works. I have checked everything I can possibly check. I advise the customer that there must be an issue with her phone and that she needs to contact the manufacturer.\n\nCustomer says that she pays for the service (she topped up by 15 two months ago) and that its my job to fix it. I tell the customer that I need to check something and I put her on hold to compose myself.\n\nI come back from hold and the customer is all \"I fixed it myself, my roaming was off so I turned it on, why didn't you check that?\"\nMe: \"Thats the very first thing I asked you to do you told me it was on\" SC: \"Well you should have asked me more than once\"\n\nThen she demands that I pass her though to a supervisor as I was incompetent.\n\nI seriously nearly lost it. I was lucky that my break was just after the call. I really wanted to just leave after that",
        "created_utc": 1471472382,
        "upvote_ratio": ""
    },
    {
        "title": "\"Well he's been no f**king help at all.\"",
        "author": "ossetepo",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4y5254/well_hes_been_no_fking_help_at_all/",
        "text": "I work in a bank call centre, mainly taking internet banking calls. Mostly people forgetting their passwords and having technical problems with the website. Most customers are really grateful for the help, even if I feel like I'm doing nothing other than giving out simple instructions. This was a call I had yesterday from a customer struggling to get logged in. \n\nMe: Hello, good afternoon etc.\n\nC: *fuming* You've locked me out of your internet banking again.\n\nMe: Sorry to hear that, let me take a look to see what's been happening.\n\nC: This has happened before, you know. I know all my details, you're not letting me on.\n\nMe: I'll certainly get to the bottom of this for you.\n\n......\n\nMe: I'm not seeing any log on attempts today with your username. Can you just confirm your username for me please?\n\nC: Are you even listening to me, I am trying to log on. It's your website that's stopping me from doing that.\n\nMe: Can you please just confirm your username, please?\n\n*sighs* it's abcdegf.\n\nMe: Ah, that's what's happening, you're inputting an incorrect username. It should be abcedfg.\n\nC: You're not listening to me, I know all my details.\n\nMe: I understand it's frustrating, but if you just type in abcdefg as your username, then your usual password, you'll be able to log on successfully.\n\nC: You're not listening to me, useless. \n\n*she puts down phone, forgets to hang up*\n\nC: Well he's been no fucking help at all, did nothing to get the website working again.\n\n------------",
        "created_utc": 1471433706,
        "upvote_ratio": ""
    },
    {
        "title": "Did I make a payment?",
        "author": "ermergerdberbles",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4y4b15/did_i_make_a_payment/",
        "text": "Cx: I see online that I made a $250 payment to Amex.  Did I make a $250 payment to Amex?\n\nMe: Yes\n\nCx: Thanks have a good night\n\nWhy are seniors awake and banking at 3:20am?\n",
        "created_utc": 1471418618,
        "upvote_ratio": ""
    },
    {
        "title": "How to become better at sales.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4y2b4g/how_to_become_better_at_sales/",
        "text": "[deleted]",
        "created_utc": 1471387050,
        "upvote_ratio": ""
    },
    {
        "title": "It's fine? Firetrucks!",
        "author": "WingAndTail",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4y04qt/its_fine_firetrucks/",
        "text": "Another Alarm Company story, though this one technically happened to my coworkers I was there for the whole ordeal. Due to the more complex cast of characters I'll do upfront introductions.  \n\n* **Me:** Innocent bystander/eavesdropper not actually featured in this story.  \n* **Facebook:** Coworker who gets her news and gossip almost exclusively from her Facebook feed.  \n* **Yahoo:** Other coworker who gets her news and gossip almost exclusively from Yahoo news.  \n* **Boss Man:** He's our boss and very picky about how the morning coffee gets made.  \n* **Rude Angry:** The man at the other end of the phone.  \n\nOur story begins with an alert for an equipment issue at Some Business. Facebook was up next and handled the alert, her conversation is paraphrased from what I heard and her post-call venting.  \n\n&gt;**FB:** This is Alarm Company we're sho-  \n&gt;**RA:** It's fine! We're testing, it's fine.  \n&gt;**FB:** Okay sir, did you need us to-  \n&gt;**RA:** It's fine!  \n&gt;**FB:** -put your system in test mode?  \n&gt;**RA:** I said we're testing! Everything is fine!  \n&gt;**FB:** Yes sir, do you want the system in test mo-  \n&gt;**RA:** It's fine! We're testing! It's fine, it's fine, it's fine!  \n&gt;**FB:** Alright si-  \n&gt;*click*  \n\nFacebook made some call notes about how lovely the call was and that Rude Angry declined to put the system in test mode. Before she had finished typing we see another alert for Some Business but this time it's a fire alarm.  \n\nYahoo was next in line and handled the alert, though Facebook did bring up that she just spoke to Rude Angry and it was almost certainly a false alarm. Despite this, our job is to follow instructions, to the letter, every time. So Yahoo dispatched the fire department because that's step one with fire alarms. Then she called the premise, step two, expecting a chat with Rude Angry, but no one answered. Step three was calling the contact list, and all three didn't answer so the fire department went on their merry way.  \n\nWe were all feeling a bit amused knowing that if Rude Angry had been a little less rude and angry he wouldn't being dealing with the fire department right about then and normally that would be the end of the story. But not too long after, maybe 30 minutes or so, we notice Boss Man is explaining what our job is to someone on the phone, someone who keeps interrupting Boss Man. Boss Man is not amused.  \n\nBoss Man explains why the fire department was dispatched, called Facebook over to tell him about her call, and then gives Rude Angry a stern lecture on why you call us to put the system in test mode before you start fiddling with the equipment. When he's done he comes out for coffee and let's us know we did exactly what we are supposed to do before going back to his office.  \n\n*TLDR: Guy takes out his bad day on us, making his bad day worse.*",
        "created_utc": 1471362047,
        "upvote_ratio": ""
    }
]