[
    {
        "title": "\"Its a mac so I thought it was all interlinked\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90x00c/its_a_mac_so_i_thought_it_was_all_interlinked/",
        "text": "[removed]",
        "created_utc": 1532256832,
        "upvote_ratio": ""
    },
    {
        "title": "Restart issue?",
        "author": "Spicy_Wings48",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90wjoh/restart_issue/",
        "text": "Starting the day with the following phone call.\n\nMe: Thanks for calling support, how may I help you?\n\nU: Yeah, my computer doesn't restart.\n\nMe: OK, where is it stuck?\n\nU: It's not powering back on.\n\nMe: Did you click on shut down, or restart?\n\nU: Shut down...\n\n_Me: explaining for user the difference between restart and shut down_\n\nMe: Can you go ahead and press the power button?\n\nU: Already did that, it's not coming up.\n\nMe: Nothing happens when you press the power button?\n\nU: Well, it does for a second, but it turns right off.\n\nMe: Which button did you press?\n\nU: The one on the computer.\n\nMe: Where is it located?\n\nU: Bottom right.\n\nMe: Ahh yeah, that's the power button for your monitor. You need to press the power button on actual tower.\n\nU: Is that in the server room?\n\nMe: No, it should be behind your monitor or under your desk.\n\nU: _Placed phone on speaker_ Yeah I see it. Oh! There we go.. Thanks! Bye!\n\nTldr; User tried restarting computer by pressing shutdown, then tried powering up by pressing the power button on the monitor. ",
        "created_utc": 1532250049,
        "upvote_ratio": ""
    },
    {
        "title": "Wait...You Want to do WHAT With Your Servers?",
        "author": "Lockerd",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90v45e/waityou_want_to_do_what_with_your_servers/",
        "text": "[removed]",
        "created_utc": 1532231342,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes Karma is a bitch (crossposted to /r/funny because it is)",
        "author": "imagine_amusing_name",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90so0h/sometimes_karma_is_a_bitch_crossposted_to_rfunny/",
        "text": "[removed]",
        "created_utc": 1532208314,
        "upvote_ratio": ""
    },
    {
        "title": "How am i supposed to fix that?",
        "author": "ifixtheinternet",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90sks6/how_am_i_supposed_to_fix_that/",
        "text": "So I'm looking at this new trouble ticket for hard down T1 internet service for one of my customers' stores.\n\nSpent a few minutes going through the troubleshooting done:\n\nPower? Yes\nRouter power cycled? Yes \nCables checked? Yes \nLight status? WAN = Red\nWow, they did everything they were supposed to! I get excited. I get to test something.\n\nObviously the WAN light being red is the problem (no sync). As I'm about to troubleshoot this, I see a note added at the very bottom in the last section \n\"Any other information that will help us isolate\"\n\n\"Yes, Store exploded.\"\n\nUm . . . . WTF\n\nI ponder for a few moments as I picture what apocolyptic conditions at this store could have spawned this trouble ticket. And, how they would have the light status if the whole damn store exploded.\n\nI see they provided an alternate phone # which must be someone's cell phone. The phone line must be down too.  \n\nI call with anticipation to find out what the crap is going on with this.\n\nC: Hello?\n\nMe: Hello, I'm ifix with ISP, investigating your service down, just have a couple questions.\n\nC: Haha, yeah.\n\nMe: so it says here, that your store exploded. \n\nC: Yeah sort of.\n\nMe: Okay, can you clarify, are you still at the store?\n\nC. Ya I'm here.\n\nMe: Okay, so how much of the store is left?\n\nC. Laughs uncontrollably and has to hold the phone away until he regains composure. \"Ya our water heater exploded and it set the whole telephone room on fire. The fire department just put it out.\"\n\nMe: Laugh uncontrollably and have to hold the phone away until I regain composure. Okay, I don't think we can do anything about that at the moment.\n\nHe actually agrees and I let him go.\n\nI send an email to the senior help desk staff, letting them know we can pick this back up after they're done remodeling the telephone room. ",
        "created_utc": 1532207537,
        "upvote_ratio": ""
    },
    {
        "title": "And they probably thought they were doing it right...",
        "author": "scienceboyroy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90s7i3/and_they_probably_thought_they_were_doing_it_right/",
        "text": "**Some background:** I work in a laboratory that runs blood tests for veterinary patients. There are very few tasks in the lab that I haven't done at some point, but these days I mostly work with computers. I maintain our databases, develop new features for the front-end client, and basically do everything from low-level tech support for my coworkers to writing my own LIS software.\n\nOne of my biggest projects lately has been the creation of an online submission form. The most time-consuming, tedious, and error-prone step in our whole operation has always been data entry; there's probably a correlation with the fact that anyone to whom we assign the task seems to hate it, but that's another rant. My point is that over the past year or so, I designed and implemented a system that we hoped would take the place of our old paper form, and by having our clients type their own responses, it would save us at least a couple of hours per day. I had little web experience prior to this project, but I designed it all myself, from the web form to the server backend to the integration with our database front-end client. I have a guy in our IT department who makes the changes to the official website, since I don't have the necessary permissions for that. \n\nThe way the system works is that the user enters the information on their clinic, the patient, the test(s) they want, and any other data they wish to provide in order to get more accurate interpretation from our experts. The form is designed to anticipate the most common mistakes our clients could make, and after dealing with them for 8 years, I've come to anticipate their moves pretty well.  \nOnce they submit the form (by clicking the \"Submit\" button), a confirmation page appears. It shows a barcode at the top, along with instructions to print it out and put it in the box with their sample (a copy is emailed to them at the address they provided, just in case they close the window without printing it). When we receive the sample in the mail, we scan the barcode and the information is populated in our database. This eliminates the need to have someone spend several minutes typing in the (often just barely legible) handwritten information from the paper form (which, I should add, our clients often seem to misinterpret).\n\nSo that's the general idea of it. We've been using it for a few weeks now, and as more of our clients make the transition to the online form, it does save us a lot of time and headaches. But a few days ago, I came upon a submission that caught me off guard, though it probably shouldn't have.\n\n**Here's where it gets interesting:** Someone had gone to our website to print out a copy of our old submission form. This time, however, they found the \"online\" submission form. They apparently reasoned that the \"online\" aspect referred to how they acquired a copy, because they proceeded to *print out a copy* of the web page, *write in their responses with a pen*, and stick that in the box with their sample. So of course they not only defeated the purpose of the online form (since we had to manually enter the data anyway), they actually did it in such a way as to circumvent several of the questions that only appear based on the user's responses.\n\nI had to send an email to the  guy in IT that handles the website; we decided to add some CSS so that when someone tries to print it out, **it will only print a short list of instructions on how the form is to be properly used**. While there's a brief instruction section at the top of the form, our clients (with few exceptions) have never been great about reading those. \n\nBecause as we all know, if users think they know what they're doing, they won't ever read the instructions.\n\n**EDIT: Another odd one from the next day...**\n\nI took a phone call from a tech who was trying to get to our old submission form, but when they clicked on the link, it took them to our new online form. They called to find out how to get to the old one so they could print it out.\n\nI explained to them that we were phasing out the old one and gave a quick run down on how to use the new one.\n\nA day or two later, I opened a package that was clearly sent through our online form (obvious because they had sent it using a FedEx label generated by the feature I had set up on the confirmation page of our form). I opened it up thinking that I would scan the barcode and be done with it, but no...\n\nInside, I found a copy of our old submission form along with the sample. Not sure what was going on, I used the FedEx tracking number to find the record of the submitted data and the barcode that should have been in the box (because of course I set it up so that all of this was available). \n\nWhen I pulled up the data they had submitted, it filled in all of the expected information, but in the patient history section (the part that usually requires the most work for the person doing the transcription, and therefore has the most room for error), it just said, \"See paper form included with sample.\"\n\nAs far as I could tell, they probably filled out the form, needed a shipping label, and then called us. They went online and filled out the form, but they didn't feel like typing out everything they had just written down. So they made us do it instead. ",
        "created_utc": 1532204395,
        "upvote_ratio": ""
    },
    {
        "title": "I Can't Turn on My Data",
        "author": "Deezl-Vegas",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90miz4/i_cant_turn_on_my_data/",
        "text": "[removed]",
        "created_utc": 1532144958,
        "upvote_ratio": ""
    },
    {
        "title": "Pay your bill.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90l5kg/pay_your_bill/",
        "text": "[deleted]",
        "created_utc": 1532131929,
        "upvote_ratio": ""
    },
    {
        "title": "All the best calls, combined....",
        "author": "NoxurnalGaming",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90klsn/all_the_best_calls_combined/",
        "text": "[removed]",
        "created_utc": 1532127184,
        "upvote_ratio": ""
    },
    {
        "title": "Yes, it IS as simple as *plugging it in*",
        "author": "arrrrik",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90jyj9/yes_it_is_as_simple_as_plugging_it_in/",
        "text": "So I work for a medium-small Federal agency that has a lot of roles, but mine specifically involves search and rescue. My day-to-day work involves supervising various operations from the comfort of a cold windowless room, but I also have a lot of information systems responsibilities at the local level, including project and program management.\n\nMy agency upgraded to Windows 10 about 6 months before this story begins. When that happened, my office went from users having four monitors (three at the desk and one on a giant \"wall of knowledge\") to two monitors- both on the desk. \n\nThe initial reason for this was that we'd had non-standard graphics cards before: ATI FireMV something or other that had no drivers or generic driver support for Windows 10. Now we were left to whatever the onboard would enable us to have, which according to our local support was a grand total of two. \n\nI was pretty hands off for this whole process; between classes, other IT projects I was running, and college on the side, I just assumed our local support was fine and that obvious things were being checked.\n\nAs it becomes apparent that we can't get the old ones to ever work, one of my sort-of supervisors finds a newer GPU that's listed as approved hardware and requests one for installation. It doesn't work. To this day, nobody's sure why it doesn't work. That was a dead end. \n\nAt this point, everyone just wants 3 monitors. Which nobody has even gotten that far.\n\nFinally I have some free time to start pushing this with our configuration board and after talking to our local support about options we could only imagine, I got a weird itch in the back of my head. \n\nI walked around behind my workstation, took a look at the rats nest of cords (something like 2 display port, 2 VGA, and 2 DVI-D cords tangled together), figure out what's going where, and plug one in. I have three monitors.\n\nSix months of work between our local support, our configuration board, and some IT minded workers and nobody had simply *plugged the dang monitor in.*\n\nI think part of it was the heavy focus on four for so long that nobody just tried for three, but a lot of it was everyone overcomplicating the issue. ",
        "created_utc": 1532121976,
        "upvote_ratio": ""
    },
    {
        "title": "Black is white, up is down, education is futile",
        "author": "drwookie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90jwl0/black_is_white_up_is_down_education_is_futile/",
        "text": "We support lots of departments on campus, which mostly have one of two machine types - Cupertino CA or Round Rock TX. We also deal with licenses, even for areas that have their own tech desk.\n\nCustomer calls in, heavy accent, so English isn't their native tongue. They need a software suite installed on their machine. No problem - I just need the inventory number off the computer so I can point the license at the right machine.\n\nI ask her to give me the tag number (large silver sticker with a barcode). She asks where it's located. This depends on the machine - could be the back, could be the top, could be on the bottom if it's a laptop. Best way to figure that out is to see what kind of machine it is.\n\n\"Are you on a [round rock] or [cupertino]?\" \n\n\"I don't know - it's a computer.\"\n\n\"Okay, is it a desktop or a laptop?\"\n\n\"It's a computer.\"\n\nOkay, I'll cut to the chase. \"Is it black or white?\"\n\n\"It's white?\" Yes she ended with a question mark. After telling her where to look, she still can't find the tag. Not on the back, nowhere else. I agree to come over.\n\n\"What room are you in?\"\n\n\"The basement\"\n\n\"Okay, is there a room number?\"\n\n\"It's 112.\"\n\n\"Okay, and the building?\" She's really not making this easy.\n\n\"SUT.\"\n\nOkay, at least that's next door. I go over. I go past the student consultant desk for their college and find 112. Nobody home. A girl from the tech desk runs out - I've found 112 adjacent. Why she told me 112 I have no idea. She shows me the computer. It's not white. Sort of the exact opposite. Black, if you will. A desktop from Texas with a name that ends in \"plex\".\n\nI show her the tag on the top of the machine. She says she didn't look there, just in back. I retrieve the tag number. I wonder what a person like this is doing at a tech desk. I head back to my office and push the license.\n\ntldr; tech desk student doesn't know what kind of computer, or what color it is, or where it's located, but does know the support number to call.",
        "created_utc": 1532121565,
        "upvote_ratio": ""
    },
    {
        "title": "A tale of two users (family story).",
        "author": "Onechordbassist",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90i5x6/a_tale_of_two_users_family_story/",
        "text": "I'm not much of a tech person. I know my way around a machine and saved my super old Macbook from several NDEs, I know how to build a machine and how to set up an OS, and how to use Google to at least get an idea of what on earth is wrong with the poor lil box again. This isn't a story about how I solved a problem. This is a story about two men who grew up before civilian computers were a thing and only late in their lives started using them regularly.\n\nFirst is my father. He's 60, for the next two months anyways, and he just... doesn't really find his way. I stopped explaining tabbed browsing to him because no matter what he will always open a window, type in the full address into the search bar, open the top link, and closes the browser to open it again for his next request. He'll always download sketchy software for his musical career that changes his home page to some sketchy ripoff search engine, and complain because his computer won't work... he also *never* reboots. If I borrow his laptop I just open it and Windows jumps into my face. He and my mom are complaining when I borrow their laptops and download *anything* at all because that 12MB Pdf file sure slows down your performance when it's sleeping there on your 600GB HDD... the more likely explanation is that your box is ten years old and overheats if you look at it funny. He once wondered why he couldn't access his work email from home (they never set up an environment for that) and both my parents insist on using webmail after I set up Thunderbird for both of them and explained it thoroughly.\n\nAn entirely different type is my grand-uncle (my maternal grandmother's brother). He's pushing 90 and didn't really use his machine until 4 years ago. For his 80th birthday we had broadband installed at his house (also an investment in the future, should he ever need a nurse a relative could move in with him without creating much stress for him). I explained Youtube and search engines to him, installed Thunderbird, explained that - and he actually uses it! He was a very quick learner too. And mind you, over the first two weeks I had to teach him double and right clicking.\n\nI just found my observation interesting, but I guess it's easy to explain. My grand-uncle was first exposed to computers when access had already become incredibly easy. Everything is self-explanatory. My parents, and especially my dad, OTOH, had their first real contact in the late eighties/early nineties, that weird phase when computers became a consumer product but they hadn't wuite found their way yet. Things were cumbersome, and since they already were in their thirties, the cumbersone way was what they learned, and how they approached it ever since.",
        "created_utc": 1532109104,
        "upvote_ratio": ""
    },
    {
        "title": "A printer. It had to be a printer.",
        "author": "DidYouKillMyFather",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90hwol/a_printer_it_had_to_be_a_printer/",
        "text": "I got a ticket near the end of the day, asking to install a printer on a computer. The branch in question was in a different time zone (I'm in  US-Pacific [GMT-07] and the computer was in US-Eastern [GMT-04]). I figured I wouldn't worry about it; after all, I had other tickets to work on that were much higher priority.\n\nThe next day I come into work and immediately get a message from one of my East Coast coworkers, telling me that this branch is calling and asking how the printer is coming. I told him to tell them I would call them a bit later. I do a couple of easy jobs and then begrudgingly call the branch. I listen to the phone tree that they have (which requires two button presses instead of one in order to speak with someone) and finally get in contact with a person... only to have the call disconnect.\n\nI call back and ask for the person who called in the ticket and then followed up, who had apparently gone to lunch. I informed the person that I was just going to install the printer and it would be good to go. This would be fine... up until she mentioned she needed scanning functionality.\n\nNow I wasn't sure if the driver we have in AD is set up with the scan functionality, so I said okay, but that meant I would have to get the driver from the website. The connection to our branches are about 1Mbps, so even downloading Java updates (60-ish MB) take about 5-10 minutes on a good day. The file for this printer was about 700MB (thanks HP). So I went and did other stuff while that downloaded.\n\nI come back after it finished and started the install process. Right away it asks to re-seat the USB cable. So I call the branch. The call disconnects. I call again. It disconnects. I call one more time, and finally get the person who called the ticket in. I instruct him to re-seat the cable. He does. The driver starts doing its thing. I tell him I'll call back if I run into any issues and we hang up.\n\nThe driver goes through the install process for about 20 minutes, stops at 99%, then fails. I want to restart the computer, just in case there's a conflict somewhere,  but that would require calling the store again, so I put it off.\n\nAbout an hour later I get a message from another East Coast coworker, telling me the branch is calling about the printer again. I was in the middle of another call and  said I would call back later. I do. It disconnects. I call again, and get the person who called the ticket in again. I tell him I want to restart the computer, but wasn't sure if it was okay. He checks with the people using it, who says it's okay, so I reboot. I hang up.\n\nOnce the computer comes back up I start the install process again. It asks to re-seat  the cable. Fuck. I don't want to call the store again, so I open notepad and say \"Please take out the printer's USB connection from the back of the computer.\"\n\n**Three. Fucking. People.** Saw it. They moved the window and one even tried to close it, but they didn't re-seat the cable. I opened another window, telling them to call me at my number. They didn't. I called them. Got disconnected. I called them again, finally got someone, told them to re-seat the printer cable again. They do, thank god.\n\nI say thank you and hang up. Continue the installer. It stops at 99% again and fails. I reboot the computer; screw it, I'm just going to install the driver from Active Directory. Check Devices and Printers. It's installed successfully. Hallelujah!\n\nI get the printer set up for the various programs they use and print a test page. I call them one last time; their phone system sounding like they were connected via an underwater line connected by tin cans. I get someone.\n\n&gt; $me: Hi, I want to know if the printer has printed something.\n\n&gt; $them (garbled): -et me shee... yesh, it -rint-d a *beezelborp*.\n\n&gt; $me: Perfect, I'm going to close this ticket! Thanks, goodbye! *hangs up*\n\ntl;dr - It was one of the worst printers, branches, and phone lines I've ever had to deal with.",
        "created_utc": 1532107335,
        "upvote_ratio": ""
    },
    {
        "title": "The front page of the internet!",
        "author": "HashDefTrueFalse",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90hpdm/the_front_page_of_the_internet/",
        "text": "LTL FTP. I've been told that people here would enjoy this story so I thought I'd share. Sorry in advance for any formatting issues. Here goes.\n\nI'm not exactly in tech support. I'm in Software Development/Engineering. However because I do \"computer stuff\" I'm automatically tech support for everyone who's ever heard of me. I'm regularly pimped out by my relatives to sort out tech issues. So I am in tech support, I'm just not paid for it... I know some of you feel my pain! This happened a while ago when my grandma wanted to get a laptop. I had been enlisted to help her get it going for the first time. \n\nCast:\n\n$me - Professional code monkey, turns caffeine into code.\n\n$gran - Whatever the opposite of a power user is.\n\nI'm at her house, standing next to her as she's turning it on for the first time. Windows first time use settings are on the screen.\n\n$gran - \"What are these settings?\"\n\n$me - \"It's just asking you to connect it to the internet and set some preferences.\"\n\n$gran - \"Oh. \" \n\nWe finish set up and get to the desktop.\n\n$gran - \"So how do I go on the internet and look at things.\"\n\n$me - \"You need a browser, I'll install Chrome for you.\"\n\nShe look confused. I know she isn't gonna remember that Chrome is how she accesses the internet so I rename her Chrome desktop shortcut to \"THE INTERNET\". Yes, all caps. It must be done. At this point my phone vibrates. \n\n$gran - \"Who's that.\"\n\n$me - \"Oh it's just a Reddit notification. It's fine.\"\n\n$gran - \"Oh, What's Reddit.\"\n\nI didn't really know how to explain what Reddit was in terms she would understand, and I was in the middle of setting other stuff up so I just said \"It's the front page of the internet\", smiled to myself, and carried on adjusting settings, thinking nothing of it. After I was done, I leave. The next day I get a phone call from her.\n\n$gran - \"I don't know how to get these boxes off this Reddit! Can everyone see the websites I've been on?\"\n\nI have no idea what she's talking about but it's only a 5 minute drive to her house so I go over. I look at the screen and smile. Chrome's \"New Tab\" page. She'd clicked the icon I labelled \"THE INTERNET\", and the first thing to come up was the \"New Tab\" page. Apparently she took it quite literally when I said that Reddit was the \"front page of the internet\". She thought Chrome's \"New Tab\" page was Reddit. She's adorable.\n\nShe was trying to get rid of the 8 boxes at the bottom that show your recent tabs. I showed her the little \"X\" icon on each and told her that Reddit was a website, not this page. We had a good laugh about it and I got rewarded with soup!\n\nI never showed her what Reddit actually was. She's not ready. And I wanted to preserve her innocence :)",
        "created_utc": 1532105953,
        "upvote_ratio": ""
    },
    {
        "title": "IT \"Bought\" $100,000 Worth Of Software; Use It",
        "author": "hidesinserverroom",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90hp69/it_bought_100000_worth_of_software_use_it/",
        "text": "This story comes from back years ago working in education. I was reminded of this here recently by a former co-worker. For some context in education, local education that is departments like to go to conferences or get cold called on new and improved software to increase grades, graduation rates, or whatever. In turn they like to ram through a purchase without consultation then shove it off, usually to IT to make work.\n\n***Backstory:*** This department in charge of increasing school work as it relates to graduation was approached by some company offering software that would be loaded on-prem but accessible through a portal both internally and externally. It promised alternate course work to meet minimum graduation work but in a more user interactive and one-on-one with small groups. Mind you this all happened about three years prior to this incident.\n\n\\--\n\n**Cast: $Me = Me, $DH = department head, $SG = server guy, $ITDir = IT Director**\n\nEvery two to three years the county would audit all purchases both for themselves, police/fire and school. Our year came up and the auditor shows up to comb through everything, the usual you both 500 computer where are they, you got this piece of equipment, blah blah, you bought this $100,000 software where is it loaded. Wait, what?\n\nAuditor bring this back to the IT director, he in turns calls the server guys and tech in to figure out who bought what and where it went.\n\n\\*Amended for brevity and memory\n\n&gt;$ITDir - We were audited and told we purchased $100,000 for this software title $SG scanned the network and we cannot find it anywhere  \n&gt;  \n&gt;$DH - Yes, but it was IT who was supposed to set this up for us.  \n&gt;  \n&gt;$ITDir - We only setup software we know about, if it was bought by another department without alerting IT we wouldn't know  \n&gt;  \n&gt;$DH - You should, IT maintains software, not us\n\nThis goes back and forth a little bit on who is responsible for what and when. Fast forwarding.\n\n&gt;$ITDir - Here's what we will do. Send over all documents and contacts along with software links etc. and we will see what needs to be done to get this working  \n&gt;  \n&gt;$DH - School board wants it done before the end of the month.  \n&gt;  \n&gt;$ITDir - Not going to happen, something like this that needs both an internal portal and external portal plus a client loaded on XYZ hundred number of computers will take several months providing we don't need to purchase any additional software/hardware.\n\nSeveral days after this occurs the $ITDir pulls us back in to get the list of what needs to be done. We go through all the docs and info to find out it requires a IIS or Linux Web Server, SQL/mySQL and gigs of module downloads(extra cost of course) loaded on a content server all both internal and public facing.\n\nIt takes us about 4 - 4 1/2 months to get this ready and another several weeks of SCCM pushes to the several hundred machines for the client.\n\nOh and best part because it had sat so long the $DH had to answer to why another almost $200k was spent on support to get this up and running along with the needed content.\n\nToday this product is now all subscription web based.\n\nTD;DR: Department buys software, fails to alert IT and one day when questions are asked who spent the money and why aren't we using it, it becomes a show stopper project.",
        "created_utc": 1532105912,
        "upvote_ratio": ""
    },
    {
        "title": "You smelled it?",
        "author": "Boucherwayne78",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90gx8s/you_smelled_it/",
        "text": "Long time reader, first time poster.\n\nI work at a construction firm, and I'm the IT guy on-site. Most of the time, my job consists of watching Windows updates roll by on new systems that I'm setting up for users, with the occasional question from a co-worker on how to use the internet and so-on. Most of our issues are pretty tame, and simply come down to user error or user knowledge level. I don't get to diagnose much, but love diagnostics, especially on hardware.\n\nAs I'm sitting in my office today (watching the windows 10 version 1803 update roll by for the millionth time) a co-worker comes in.\n\n$Me: What can I do for you?\n\n$User: My computer made a click sound and suddenly shut off.\n\n$Me: Let's go check it out.\n\nWe took a walk down to his desk, and the first thing I did was reach down to press the power button. I had an internal motherboard light on, could see that from the fan grill on the computer. That meant the computer had power. After pressing the power button, nothing happened.\n\nThe next thing I did was very strange to $User.\n\nI unplugged everything from the back, picked the PC up, and smelled the power supply. I got a big ol' whif of that magic smoke we all know and love.\n\n$Me: You need a power supply.\n\n$User: You determined that from smelling it?\n\n$Me: yep. I'll have you back up and running in ten minutes.\n\nThen I went to the basement, grabbed a power supply out of some old stock, smacked that bad boy in, and the user had only spent 15 minutes total out of commission. I felt glad that my PC diagnostics and hardware knowledge finally came in handy. I even tore down the old power supply to show $User what went wrong (a mosfet and a couple resistors got too toasty).\n\nTL;DR: User complained of computer randomly shutting it off. To the user's surprise, I diagnosed it by smelling the computer.\n\n",
        "created_utc": 1532100457,
        "upvote_ratio": ""
    },
    {
        "title": "You mean all of them?",
        "author": "SpideySense13",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90gue9/you_mean_all_of_them/",
        "text": "[removed]",
        "created_utc": 1532099878,
        "upvote_ratio": ""
    },
    {
        "title": "User solves his problem",
        "author": "Derivcolambda",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90gbjn/user_solves_his_problem/",
        "text": "I work in front-line support for an online SaaS company, through an in app chat service.   \nThe software is mainly used online through a web browser, but there is also a 'lite' version available from both iOS and Android, which syncs.  \nRequests from users can be anywhere on the spectrum from your Nana who can't log in to someone who knows Javascript coding asking how to create &amp; extract data via the API.  \nThis one is short and sweet, and I hope the formatting works out as this is my first time posting here.\n\nI'll be $Me and user will be $User.  \n\n\n&gt;$User: I'm updating data on my phone and it's not reflecting on the webapp.\n\n*\\[Thinking to myself\\]*  \nDamn it, not a mobile sync case! These tickets are very hard to troubleshoot as we spend most of our time providing support for the web app with only about 1\\~2% of tickets about the mobile app.  \n\n\n*\\[The troubleshooting begins\\]*  \nI check the back office and see $User's Android phone is on version xx.6 but the latest version is xx.8\n\nAlways a good idea to make sure users are on the latest version of course as old versions sometimes don't sync properly.   \n\n\n&gt;$Me: I see you're using an outdated version of the app on your Android device, please update to the latest version and let me know if this helps.\n\n  \n*\\[5 minutes of silence\\]*\n\n&gt;$User: Don't worry I've solved the problem. My phone wasn't connected to the internet.\n\n*Facepalm!*  \n\n\nAlways start from the start with troubleshooting is the lesson for me here :)",
        "created_utc": 1532095982,
        "upvote_ratio": ""
    },
    {
        "title": "It's not coming up!",
        "author": "ggppjj",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90g1uy/its_not_coming_up/",
        "text": "Hey all, quickie for you. I recently(ish but not really that recent) switched jobs from internet support to grocery/restaurant system support. We support a system known as 4690 OS, an ancient yet still updated and reliable checkout system used in quite a few places originally created by $Blue_Corp and now owned by $Toss_Shibas. The machines we have out in the field don't have HDDs in them, so they all boot PXE over the network getting an image from the controller. This, as you can imagine, is not a particularly speedy process, especially considering the networks at the stores are sometimes... less than optimal.\n\nI keep running into the situation where I tell the store personnel that it'll take about 10 minutes to have the register back to normal, but they keep seeing what is a normal boot process, thinking it's frozen, and rebooting it in the middle of it coming up, taking what should be a 10 minute call and making it a 20-30 ish minute call of just waiting for it to finish. \n\nThat's... pretty much it. Like I said, quickie.",
        "created_utc": 1532093892,
        "upvote_ratio": ""
    },
    {
        "title": "I\"m rude because you didn't email me back?",
        "author": "strra",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90fosl/im_rude_because_you_didnt_email_me_back/",
        "text": "I work for an  MSP and one of our clients is a business furniture company in the area.\n\nOver the past 2 weeks, the owner of that company has emailed us three times stating that the snipping tool isn't working (and that's all the info we have). Every single time she asks for assistance, I've remoted to her computer and am completely unable to recreate the problem.\n\nAll three of the times, I've asked her via email if she can show us the process they're using to get the problem she's seeing and have gotten zero response. Two of the times I tried to call and she was \"in a meeting but I'll leave her a message\". Again, zero response.\n\nThis last time, we get an email from our main contact over there asking why it hasn't been fixed yet. My response was exactly:\n\n***Hi \\[contact\\],***\n\n***We've logged in to her machine three times at this point and have been unable to reproduce it. We've asked \\[owner\\] if she could show us the problem happening but haven't gotten any kind of response about it.***\n\n***When can we schedule time with \\[owner\\] for her to show us the problem in action since we can't seem to get it to do it?***\n\nAgain, radio silence. The next day, our operations manager comes into the bullpen and tells us that \\[contact\\] had emailed him (and followed with a phone call) complaining that my response was very rude and I had a \"not my fault attitude\".\n\nHere's her email:\n\n***Hi \\[operations manager\\],***\n\n***I need to draw your attention to this email. Assuming best intentions on the part of your team, the \"not our fault\" response is highly inappropriate not to mention unhelpful as we try to solve the issue. We have been long time clients of \\[MSP\\] and are paying on a monthly basis for IT services. We expect to receive a high level of customer service with a can-do, patient attitude.***\n\n***\\[owner\\] is the owner of this company and has an incredibly full work schedule. Understanding that it is challenging to not get a response back immediately, if you ever have questions and can't get a hold of \\[owner\\], either \\[owner's son\\] or myself should be your default next in line contacts.***\n\nEven the CEO of our company (who tends to be a stickly stickler) read the email chain and failed to find a problem with it.\n\nThe best advice the co-owner could give me was \"next time add a smiley face?\"",
        "created_utc": 1532090869,
        "upvote_ratio": ""
    },
    {
        "title": "If you can't change my settings, give me the password to the admin account",
        "author": "InformantArgo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90flmv/if_you_cant_change_my_settings_give_me_the/",
        "text": "**LTL FTP** \n\nThis is my first time posting a story here, so if I've made any mistakes, please be gentle! For this story, I will be $Argo and the lovely chap that I'll be talking to will be Mr. Not-An-Admin ($MNAA)\n\nFor a bit of background, I work on the support desk for an online SaaS system used by organisation HR. As such, this software will often contain sensitive information of staff members stored in its database. Our support desk only offers assistance to people who are confirmed as admins. Cue this ticket coming in:\n\n$MNAA\n\n&gt;Hi support  \n&gt;  \n&gt;My name is Mr. Not-An-Admin and I've recently taken over from Mr. Admin for \\[CompanyName\\].   \n&gt;  \n&gt;Please give my account full administrator permissions as I don't have them right now  \n&gt;  \n&gt;Thanks, Mr. Not-An-Admin\n\nThe odd thing about this email is it actually came through from Mr. Admin's email account, but they pointed out straight away that they weren't Mr. Admin. Because of this, I knew I'd have to direct him to one of his in-organisation administrators, as having us give admin privileges to any random person who asked for it would be a GDPR nightmare.\n\n$Argo\n\n&gt;Hi $MNAA,  \n&gt;  \n&gt;Thank you for getting in contact. Unfortunately, due to our policies on data handling, I am not allowed to change your permissions without explicit permission from one of your active administrators.  \n&gt;  \n&gt;I have reviewed your system and I can see that you currently have 3 active administrators, including the one who has left the company. Either of the 2 remaining admins should be able to get you sorted out with those permissions.  \n&gt;  \n&gt;If they are having any trouble setting your permissions, please ask them to get in touch and we will be happy to guide them.\n\nAll good, right? Wrong. Not even 10 minutes later.\n\n$MNAA\n\n&gt;Hi $Argo,  \n&gt;  \n&gt;I think you've misunderstood. I've taken over from Mr. Admin. I need you to give me the admin permissions. Please action ASAP  \n&gt;  \n&gt;Mr. Not-An-Admin\n\nOnce again, I go back to the client.\n\n$Argo\n\n&gt;Hi $MNAA  \n&gt;  \n&gt;I did understand the request, $MNAA, however it is not something that I can action. As you are only a regular user, I cannot change your permissions to an administrator. This is part of the data protection policies we have outlined internally. As mention previously, please speak to one of the 2 remaining, active administrators.\n\nI really wish I could say this was the end of it, but it wasn't. Cue this follow-up email (again within 10 minutes)\n\n$MNAA\n\n&gt;$Argo.  \n&gt;  \n&gt;That is most unhelpful. If you cannot do it, please give me the password to an admin account that can and I will do it myself.\n\nThat's right. I'd told him I can't change his permissions because it would be a breach of data protection. Now he's coming back asking for an EVEN BIGGER breach of data protection. Needless to say, I was blown away by this request. To be honest, the passwords are encrypted, hashed and salted to Hell and back, so I couldn't give that out even if I wanted to. \n\n$Argo\n\n&gt;Hi $MNAA,  \n&gt;  \n&gt;I'm afraid I can't do that. Providing you with the password for an account that has admin permissions would be a serious breach of our data protection policies.   \n&gt;  \n&gt;Please speak to one of your administrators personally. I have already established that your account is not an administrator and therefore I cannot offer further support.   \n&gt;  \n&gt;Apologies for the inconvenience,  \n&gt;  \n&gt;$Argo\n\nFINALLY, he seems to get it. Although he does take one final shot at me in his final email.\n\n$MNAA\n\n&gt;$Argo.  \n&gt;  \n&gt;You have been most unhelpful. I will sort it myself.\n\nTicket closed. \n\nSometimes I have to question the thought process that goes through these peoples' heads. Would they seriously expect me to turn on major system application permissions for some random Joe Bloggs who emails in asking for these additional permissions? \n\n**EDIT**: Thanks everyone for all the feedback! I honestly didn't expect this to start so many conversations. In response to those of you who suggested I follow up with their security officers, while I didn't do that and instead delegated the job of calling the client company regarding it to their account manager, I followed it up with the awesome chap who manages their account today and apparently he was meant to be an administrator and the admin who told him to email support thought using the admin email account to do this would be clearance enough. We got it straightened out and as far as I am aware, Mr Not An Admin is now Mr. An Actual Admin.\n\nI'm happy to take your feedback on board and will use it to improve my service in future!",
        "created_utc": 1532090072,
        "upvote_ratio": ""
    },
    {
        "title": "Everything is Window’s fault.",
        "author": "hexLucifer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90fa0x/everything_is_windows_fault/",
        "text": "So this is my first post here, so I’m sorry if I get something wrong. \n\nI work in a rather small technical support company in my home-town. We get frequent calls and people coming in every day with issues and things of that sort. I have a lot of these, so I’m probably going to post many more.\n\nThis happened about 3 hours ago. \n\nOur company got a call on the support line, and I was the unfortunate person to answer it. C = caller. M=Me\nM=&gt;hello, this is *comapny name*, I’m *my name*. How can we help you today?\n\nC: &gt;Hey *my name*. So, I just recently updated my computer’s windows. Now it’s not working.\n\nM=&gt;okay, I’m going to need you to be a little more specific. When did you update it? What isn’t working, exactly? How long ago was it since you previously updated?\n\n**C gives me a long winded sigh, like I just asked him to take his computer apart and put it back together again.**\n\nC: &gt;I updated it last night. The computer isn’t working, the screen won’t come on. I update every time a new one comes out. Is that good enough for you?\n\n**I could tell he was getting infuriated, I had no idea why. I kept my calm tone as I continued to discriminate the issue down to what it could exactly be.**\n\nM: &gt;Okay, sir, are you able to go into the BIOS screen?\n\nC:&gt;“No idiot, like I said! My computer isn’t working!\n\nM: &gt;So you’re not able to see the BIOS screen at all? Can you see the boot logo of your motherboard’s distributor?\n\nC: &gt;Do I have to repeat myself again? Nothing is working.\n\n**At this point, I was believing it was a hardware issue rather than window’s fault.** \n\nM: &gt;okay. At this current moment in time, I believe it’s a hardware issue inside of your compute. If you’re able to, can you bring it into our shop at *address to my place of work*. We will look at the hardware and diagnose the issue free of charge. If it’s an easy enough fix, we won’t charge you with that either.\n\n**The c was getting angrier, I could hear him breathing heavily down the phone.**\n\nC: &gt;It was a S O F T W A R E update, no parts are broken you absolute idiot. Do you even know what you’re doing? Software, it can’t be a hardware issue, you just want my money! I’m going to somewhere better!\n\n**Before I could even get a word in, he had hung up.**",
        "created_utc": 1532087013,
        "upvote_ratio": ""
    },
    {
        "title": "Can you please check your connections...?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90d8ua/can_you_please_check_your_connections/",
        "text": "[deleted]",
        "created_utc": 1532064104,
        "upvote_ratio": ""
    },
    {
        "title": "Where I have to teach someone what a link is.",
        "author": "bananaclaws",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90cvvo/where_i_have_to_teach_someone_what_a_link_is/",
        "text": "I’m not technically IT, I’m an analyst, but I do a fair amount of work setting up fields in Salesforce and have been helping develop cases (basically a ticketing system) for our client services and accounting departments.   \n\nA couple days ago, I get an email.   \n\nThem: Hey, this weird error is happening sometimes.  \n\nMe: Okay, well next time it happens, send me a link to the account and I’ll look into it.  \n\nThem: Okay, here’s a tiny screenshot of what a case looks like. \n\nMe: I can’t read the name, please send me the link.  \n\nThem: Here’s a screenshot of the menu bar.  \n\nMe: Here’s a screenshot of my browser window with an example of what a Salesforce link looks like. Please send link.  \n\nThem: Here’s half the link, sent in the subject line of the email.  \n\nLuckily, that half link was enough, and I figured out the issue in about 5 minutes. ",
        "created_utc": 1532060606,
        "upvote_ratio": ""
    },
    {
        "title": "We’re tech support, not your secretaries.",
        "author": "QuantumDrej",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90bomc/were_tech_support_not_your_secretaries/",
        "text": "Yesterday, we identified an issue with a particular client’s software. It was an easy .dll replacement, nothing more - we just had to schedule the very brief period of downtime. Easy peasy.\n\nWell, $Client has a bad habit of having three men being the ones to call in about issues or make tickets. These three men don’t like to talk to each other.\n\nSince these three men all have ridiculously generic names, I’m calling them The Father, the Son, and the Holy Spirit, as they have been dubbed, in order of easiest to most difficult to work with.\n\nThe Father was the one to originally report the issue. I communicated with him on his ticket the whole way through, and thought that was that.\n\nThe Son called in about twenty minutes after we brought them back up demanding to know why there was downtime. We explained that The Father had reported the issue originally, and since it was critical, we had worked with him to get the issue fixed ASAP. He grumbles about how he wasn’t informed and that we need to reopen the ticket and CC him on an email to The Father so he has a record of what happened.\n\nAn hour after that, The Holy Spirit falls in. He’s notoriously short tempered and bad at explaining himself and tends to act condescending. None of this changed when he called in asking why no had informed him that there would be downtime. We told him there had been a case opened by the Father. He got angry that no one had CCed him on the email chain and demanded we send HIM an email off the case with all the details. \n\nOh, and he also followed up with a bunch of bitching about how we need to be letting him and the rest of the organization know when there’s scheduled fixes.\n\nTL:DR: I’m sorry for assuming that you all communicate internally about critical issues instead of demanding that we keep track of your emails.",
        "created_utc": 1532049758,
        "upvote_ratio": ""
    },
    {
        "title": "Getting \"Skype for Business\" off a computer is as easy as quantum physics",
        "author": "seekingrapperatx",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90awns/getting_skype_for_business_off_a_computer_is_as/",
        "text": "[removed]",
        "created_utc": 1532043191,
        "upvote_ratio": ""
    },
    {
        "title": "I went in to fix an email issue, left with a laptop",
        "author": "boosted_monkey13",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90arvo/i_went_in_to_fix_an_email_issue_left_with_a_laptop/",
        "text": "[removed]",
        "created_utc": 1532042089,
        "upvote_ratio": ""
    },
    {
        "title": "Indian IT guy introduces himself",
        "author": "Arheisel",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90a8g5/indian_it_guy_introduces_himself/",
        "text": "[removed]",
        "created_utc": 1532037805,
        "upvote_ratio": ""
    },
    {
        "title": "Classic case of IT can't read minds.",
        "author": "Avir94",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90a3ft/classic_case_of_it_cant_read_minds/",
        "text": "Short story from the day.\n\nBackground: Among other things, I manage the email lists for our company ~2000 users, giving people the correct access/basic instruction as needed. I'm more of the back-end guy sitting in the IT dungeon, so I don't go off to people's desks very much, we have other guys on site to do that.\n\n\nAnyways I've had a ticket sitting in my hopper since the beginning of this month in the \"Waiting for user to reply\" state. So I haven't touched it.\n\n\nToday I decide to clean out some of my tickets and I see this one.\n\nThe ticket is requesting help to use the email list software. Understandable, it can be a bit of a learning curve sometimes.\n\nMy last comment on the ticket was \n&gt;Me: \"Here is a link for a guide on how to manage your email list. Let me know if you have any other questions or need more help. \n&gt;\n&gt;link.to.internal.support.guide.com\"\n\nThis support article gives the basic how-to's for administering an email list, fairly basic.\n\nSince the ticket was over 2 weeks ago with no reply, I assume all is well for the user. So I close the ticket:\n&gt;Me: \"I see you haven't replied Angry Lady (AL), so I assume you were able to figure things out. I will close this ticket now.\"\n\nAnd you'd think that would be it. But no, this is TFTS. \n\nA few hours later I receive an email with the following\n&gt;AL: Dear Avir94,\n&gt;The support link you forwarded was not helpful and did not answer my questions. I asked for help to navigate the mail system, when you forward a link that doesn't help me, I don't really know how to ask you again for something I already asked for.  *That is the reason why I did not follow up.* I want to learn and I want to do it correctly, but not all of us are technically advanced nor learn in the same way. \n\nOkay... How am I supposed to know that you didn't find the guide helpful if you **don't follow up** and tell me?",
        "created_utc": 1532036804,
        "upvote_ratio": ""
    },
    {
        "title": "I don't want a new-to-me computer",
        "author": "GuppyZed",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/909zp0/i_dont_want_a_newtome_computer/",
        "text": "tl;dr: user doesn't want a new computer if it's not going to be good enough.\n\nBackground: My company runs leased PCs from a company that rhymes with Hell. These generally have a 3 year lease and we're *supposed to* replace them when the lease runs out. Well, when 2 guys support 15ish offices with quite a few pieces of hardware, that doesn't happen. We're currently running a \"if it ain't broke, don't fix it\" stance when it comes to replacing computers; both for our sake and the user.\n\nStory:\n\n    Request: 0023451\n    User: Bob\n    Item: Battery for \"outdated hardware model\"\n    \n    IT Manager notes: lease is up; replace\n\nBob: *\"important\"* user\n\nGuppy: some random fish\n\nITM: IT Manager; all around good guy and has our back 99.9999% of the time\n\n&gt;Guppy: Bob, due to the age of your computer we would prefer to replace your computer with a newer one from Hell. Please send us your user ID and password.  \n&gt;  \n&gt;Bob: Is this a new laptop? Or new to me?  \n&gt;  \n&gt;Guppy: It really depends what we have in stock currently. If anything with a run-rate has been returned, we will have to use that first instead of ordering anything from Hell.  \n&gt;  \n&gt;Bob: Can I go get my own and use it?  \n&gt;  \n&gt;Guppy *(internal)*: *Why in the world do you think that would be okay??? You work government contracts!*  \n&gt;  \n&gt;Guppy: That would not be possible.  \n&gt;  \n&gt;Bob: Well if you don't have anything in inventory that is better than mine, I'd rather just go buy my own battery.  \n&gt;  \n&gt;*emails IT manager the conversation*  \n&gt;  \n&gt;ITM: ... People can be difficult. Let him know in no uncertain terms, that he's getting a new computer.  \n&gt;  \n&gt;*reply to Bob*  \n&gt;  \n&gt;Guppy: Bob, any changes made to your hardware either need to be done by us, corp IT, or approved by the same. Since your computer is off lease, it is required that we replace it; especially since your battery is dying. Anything in stock still has a run-rate and will be newer and *(in theory)* better than what you are currently running on. Send us your current ID and password so we can finish this process.\n\nHopefully I don't have to update this post any time soon...\n\nEDIT 2: my position is somewhere between a tier 1 and tier 2 help desk. We are the \"front line\" for IT Support, but we also have a 3rd party call center. That call center handles password resets, and my position has no access to changing passwords; hence why we need their password to set up their profile on the new computer.\n\n ... our users are lazy and our standard work enables them... \n\nEDIT: Not even 5 minutes after posting this, and he emailed me his credentials...",
        "created_utc": 1532036066,
        "upvote_ratio": ""
    },
    {
        "title": "\"...Is it turned on?\"",
        "author": "thumbtackmassacrrre",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/909kyh/is_it_turned_on/",
        "text": "FTP, LTL. I work for a company that creates, sells, and troubleshoots their own software for a particular niche business. Our clients can choose to host their software on their servers or our own terminal servers. Technically we're only supposed to troubleshoot our own software and problems with our servers, but we get calls all the time for Microsoft Office because we use it by default in our terminal servers.\n\nMe: \"Thank you for calling \\[company\\], how may I help you?\"\n\n3rd party IT for the agency: \"Hi, I have a client here who uses your servers. She's clicking on Word and nothing is happening.\"\n\nI ask to get connected to the workstation so I can see exactly what's happening. When we get connected we can see how many monitors the client's workstation is using, and this client has two. The IT clicks on Microsoft Word on the desktop and I see it open on the monitor to my right. He doesn't say anything. I open Outlook, it also opens on the monitor to my right. I open Excel and it opens on the monitor to the left.\n\nIT: \"Hey, that worked! But why aren't the other programs opening?\"\n\nAt this point I'm a little confused. I can see the two programs to my right and their taskbar icons. I drag Outlook from the right monitor to the left monitor.\n\nIT: \"Wait, how'd you do that??\"\n\nMe: \"Um, is there a second monitor at the workstation?\"\n\nIT: \"Yeah, there's two.\"\n\nMe: \"Well...is it turned on?\"\n\nIT stays silent for a moment. I hear some shuffling and then get a quick:\n\nIT: \"Okayit'sworkingthankyoubye!\" \\*hangs up\\*\n\nAnd I spend the next five minutes laughing.",
        "created_utc": 1532033032,
        "upvote_ratio": ""
    },
    {
        "title": "Artificial Intelligence Nightmare",
        "author": "Breaking-Faith",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/908wm1/artificial_intelligence_nightmare/",
        "text": "Okay so this is the first time I have posted here. It's not strictly tech support but a dumbfounding experience I had during Beta testing of our product. \n\nContext: I work in a tech business start up that is specialised in creating integrated chat-bots that work on Facebook and other surfaces (such as google homes). We use Natural Language Processing (a form of AI) to make the bots humanistic. \n\nIn the beta testing of our new bot that is designed to comfort people suffering from substance misuse and encourage them to seek help we provided it to one of my friends. When I met them to ask for their review the conversation goes along the lines of:\n\nMe: Is there anything you want to say about the test?\n\nHim: Well the immediate reply was cool, but you guys are playing with fire.  \nMe: ...Okay, how so?\n\nHim: You realise you will have vulnerable people using this right?\n\nMe: Yes, that's the target audience\n\nHim: And they might be suicidal?\n\nMe: Well, yes, that's a possibility... what does this have to do with the product?\n\nHim: You do know if they're telling the bot they want to kill themselves. Over time it's going to learn this and tell another user to commit suicide.\n\nMe: (absolutely astounded) ... We use Natural Language Processing. It identifies words more accurately, it doesn't learn -\n\nHim: This is AI. You don't have control over what it does\n\nMe: No, it will only be able to respond with what the answers we physically provide\n\nNeedless to say I spent the better part of 30 minutes explaining this concept to him while he became more aggressive and said that we were acting recklessly and will live with the blood of users on our hands.\n\nI give up",
        "created_utc": 1532028154,
        "upvote_ratio": ""
    },
    {
        "title": "It's all spam, right?",
        "author": "GreenEggPage",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/908ipw/its_all_spam_right/",
        "text": "I used to work for an ATM transaction processor and would test new ATMs for compatibility with our system as well as working with the ATM drivers adding new features or fixing what broke. At the time, South Korea was becoming a new dominant player in the ATM market and several companies were bringing out new models. The biggest of those, we'll call them Kross, had an office in California and my contact there was a guy named Vic.\n\nOne day, Vic calls me and wants to know why I hadn't replied to his emails. I look and don't see any from him. He sends me some test ones, I still don't get them. I start looking through different folders and finally, in my deleted items folder, I find all of them, marked as unread. And then I remembered why...\n\nAt one point, while researching an issue with another Korean manufacturer, I had posted a question on their forum. They never replied to it, but I did get scraped by a bot and ended up on a bazillion spam mailing lists. All of which used the Korean character set. So I created a rule that chucked anything with that character set into the garbage. Vic was Korean. Even though he only used English when communicating with me, the Korean character set was enabled in the headers and got automatically dumped.\n\nVic was not happy when I explained what had happened... ",
        "created_utc": 1532025539,
        "upvote_ratio": ""
    },
    {
        "title": "Stolen Identity",
        "author": "lets_giorgio",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/908fzf/stolen_identity/",
        "text": "Hi everyone! Long time lurker, first time posting. I had some daft tickets but this one genuinely left me speechless.\n\n\nTicket comes in and the customer says she can't create a user profile, as the username is already taken, and she wants to know who's it it.\n\nI write up a SQL query to give to her to make sure the username actually exists, and asks that her DB team runs it:\n\n&gt;Cust: \"Oh we don't have a DB team. Can I do it?\"\n\n&gt;Me: \"Er, sure, if you have experience with SQL then by all means, I'm not in a position to tell you no.\"\n\nShe returns an error and it was obvious she ran it in the wrong DB, and doesn't have experience with SQL, so I added a line to make sure it runs in the correct DB. She then sends a screenshot of the user, with his ID, termination date etc. as if looking for the next step.\n\nI didn't know what else she wanted really, I figured the agent ID should be enough so I created another query to return the user's name. This is the conversation that followed:\n\n&gt;Cust: \"And if it's the same name as the person I'm trying to import?\"\n\n**I started questioning what I know because the answer seems so obvious I start to believe I've forgotten something.* *\n\n&gt;Me: \"Did you hire this person previously, or did you hire someone with the same name before?\"\n\n&gt;Cust, not even a minute later: \"This was a re-hire.\"\n\n\nSo, she re-hired someone, created a new profile for them, with the same username, and when told the username was already in use, raised a ticket to find out who it belonged to......\n\n\nShe didn't even need to create a profile, she just needed to re-activate the old one:\n\n&gt;Me: \"If this is a re-hire, then you can just reactivate their account by deleting the end date in their profile.\"\n\n&gt;Cust: \"It's already empty.\"\n\nShe then sends a screenshot of the new account she was trying to import, not the original account.  \n\n\nThankfully she saw her error while I was walking around because I just wanted away from my PC for a few minutes, and said I can close the ticket.\n",
        "created_utc": 1532025025,
        "upvote_ratio": ""
    },
    {
        "title": "My tech guy says it isn't a quad-core, where does it say that?",
        "author": "djronnieg",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/908fht/my_tech_guy_says_it_isnt_a_quadcore_where_does_it/",
        "text": "[removed]",
        "created_utc": 1532024932,
        "upvote_ratio": ""
    },
    {
        "title": "I may have accidentally saved someone a lot of trouble (or why you should check the spam folder in your email)",
        "author": "smallboy99",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9085nm/i_may_have_accidentally_saved_someone_a_lot_of/",
        "text": "A short call, but a rather funny one all the same.\n\n$Me = me, probably.\n$Cx = Customer\n\n&gt;$Cx - I'm trying to reset my password but I'm not receiving the reset email\n\n&gt;$Me - Have you checked your spam folder? These emails come from a no-reply address so can often end up in there.\n\n&gt;$Cx - Give me 2 seconds and I'll check\n\n&gt;$Me - No worries\n\n&gt;$Cx - No, all I've got in my spam folder is an email from the telecoms company saying... Oh... Saying they'll cut off my phone access at the end of today. That's not very good, is it?\n\n&gt;$Me - No, not really.\n\n&gt;$Cx - Uhhhh, I'll have to call you back later, this suddenly doesn't seem so important anymore.\n\nCx proceeds to hang up. He was actually really nice on the call, so I hope he does get his stuff sorted. Part of me is slightly sad our call didn't cut off when he told me what the telecom email was. But yeah, make sure you check your spam folder occasionally, kids. Your phone's may depend on it.",
        "created_utc": 1532023087,
        "upvote_ratio": ""
    },
    {
        "title": "Should I hurry?",
        "author": "curtludwig",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/907lbp/should_i_hurry/",
        "text": "Years ago when I was manning the frontline phones I got a call from a lady Marine Sergeant. I don't remember the issue but I do recall that the fix required rebooting the computer several times, so while it wasn't a particularly hard call it was time consuming.\n\nMeanwhile there was somebody else in her area talking, I could hear that he was speaking but I couldn't hear what he said, apparently it was inappropriate because:\n\n&gt;Sergeant: You will NOT talk like that while I'm on the phone. Sit down and shut up.\n\nI didn't say anything but apparently mouthy wasn't very smart because before I knew it,\n\n&gt;Sergeant: I warned you once, pushups, NOW.\n\nThe authority with which she gave the command nearly had me on the floor. Now in the background I can hear mouthy counting out pushups.\n\n&gt;Me: Uhhh how long will he do push ups for?\n\n&gt;Sergeant: Until I tell him to stop.\n\n&gt;Me: Should I hurry this along?\n\n&gt;Sergeant: Not on my account.\n\nApparently mouthy isn't the brightest bulb on the tree because the next thing I know she's got him doing one armed pushups and finally  he has to do pushups and clap. This I can hear pretty well,\n\n&gt;Mouthy: 1 -clap-, 2 -clap-, 3 -thud-\n\nMouthy apparently didn't make the third clap.\n\n&gt;Sergeant: Stay down, I'll deal with you later.\n\nFrom my end of the phone she was polite and extremely professional but I'm sure glad I was fixing her problem instead of causing problems for her...",
        "created_utc": 1532019288,
        "upvote_ratio": ""
    },
    {
        "title": "\"Oh and hook up my TV while you're here too.\"",
        "author": "maximumtesticle",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/907ht2/oh_and_hook_up_my_tv_while_youre_here_too/",
        "text": "Had to swap out a machine for an end user and it was nothing but trouble from the get go.  This person is by far the most computer illiterate person I have ever come across in a professional environment.  I work in a law firm where, you'd assume that being in school for so many years, lawyers would have at least *some* basic computer knowledge.  Nope.  Nope nope nope.\n\nThis particular person wanted to swap their PC for a laptop (aka status symbol), which is fine, it's a personal choice, not a good one but whatever.  Ordered the hardware, got it configured up and shot an email to, let's call her Bambi.\n\n&gt;**Email:**\n\"Hey Bambi, I've got your new laptop all ready to go, can you please let me know when a good time to install it would be?  To help avoid any work flow interruptions let me know when you'll be away from your desk for about 30 minutes.\"\n\n*a week goes by, no reply so I resend the email*\n\n&gt;**Reply from Bambi:** \"Ok, please by. -Bambi\"\n\nI call her.\n\n&gt;**Me:**  \"Hey, just got your email...I'm not sure what you mean here?\"\n\n&gt;**Bambi:**  \"Just do it whenever.\"\n\n&gt;**Me:**  \"Ok, well, what time works for you?\"\n\n&gt;**Bambi:**  \"Just come and do it whenever, I don't care.\"\n\n&gt;**Me:**  \"Sounds good, I'll be by later this afternoon.\"\n\n&gt;**Bambi:**  \"Well, what time???\"\n\n&gt;**Me:**  \"I'm not sure, what time works for you.\"\n\n&gt;**Bambi:**  \"Whenever.\"\n\n&gt;**Me:**  ::sensing the ongoing cyclical conversations::  \"3, I'll be by at 3.\"\n\n&gt;**Bambi:**  \"Ok, I'll try not to be busy then.\"\n\nWhatever, fine, we have a time, huzzah!  I gather up the hardware and waddle on over at 3 to see her fully immersed in like five word documents and some other research (I know, right, bet you didn't see that coming).  I asked her to please save and close her work so I can get down to business.  Immediately after asking her that she just pushed the power button on the computer.  Didn't save or close anything just ::boop:: power button.  Suppressing my rage I said,\n\n&gt;**Me:**  \"Oh...please make sure you click the Windows button and then shut down.\"\n\n&gt;**Bambi:**  \"The what?  This is how I always shut down.\"\n\n&gt;**Me:**  \"Ah well, in the future, please don't do that.\"\n\n&gt;**Bambi:**  \"What is this force log off pop-up I always see, also I'm losing a lot of my work because it's not saving.\"\n\n&gt;**Me:**  \"It's because you pushed the power button and didn't save and close your work.\"  (Sometimes I find it hard to say things without asking myself, \"Do I really have to say this out loud to another adult?\")\n\n&gt;**Bambi:**  \"Well at the last place I worked it automatically saved everything I did.\"\n\n&gt;**Me:**  ::screaming in my head::  \"NO.  NO IT DIDN'T.\"  ::out loud::  \"Oh, well, here you have to tell the computer you want to save.\"\n\nI finally got her to step away from her machine after a while.  And by step away I mean stay in here chair and slide two feet to the side while she played around on her phone and I tried to work around her.\n\nWhile I was finishing up, without looking up from her phone she says, \n\n&gt;**Bambi:** \"Oh and hook up my TV while you're here.\"  *pointing to a TV she plugged in on her desk*\n\n&gt;**Me:**  \"Sorry, what?\"\n\n&gt;**Bambi:**  \"My TV, I like to watch it sometimes.\"\n\n&gt;**Me:**  \"For business purposes?\"\n\n&gt;**Bambi:**  \"No, just like if something is going on I like to check it out on the TV and sometimes my secretary likes to watch TV on her break.\"\n\n&gt;**Me:**  \"We don't have any cable boxes or anything, also if it's not business related I can't really spend time on that.  I only handle and install firm owned equipment.\"\n\n&gt;**Bambi:**  \"Uh, you work in IT, right?  That's what you do!\"\n\n&gt;**Me:**  \"Well, no, it's not.  IT stands for Information Technology, which involves computers and data.\"  (I for real said that, I'm not embellishing for the story)\n\n&gt;**Bambi:**  \"Well, give me the name of someone that WILL hook up my TV.\"\n\n&gt;**Me:**  \"I don't have one, literally no one has ever done that here, we don't have TVs in people's offices.  We have some in the conference rooms but those are for meetings and again, don't have cable on them or anything.\"\n\n&gt;**Bambi:**  \"Well, SOMEONE needs to help me with this.  Give me a name.\"\n\n*I felt like I was being interrogated or something.  GIVE ME A NAME!  WHERE ARE THE DRUGS!!!*\n\n&gt;**Me:**  \"Feel free to call my boss.\"\n\n&gt;**Bambi:**  \"There, that's all I wanted, was that so hard???\"\n\n*At this point I didn't say another word until I was done and I just left and went straight to my boss' office.*\n\n&gt;**Me:**  \"Hey did Bambi...\"\n\n&gt;**Boss:** ::stopping me mid sentence::  \"Yeah, she called, I'll deal with it.\"\n\nThe sad thing is that where I work, attorneys throw fits and get what they want, which, fine, whatever, it's not my money or resources.  But when someone demands things I can't provide, I have no choice but to stand my ground.  I'm not sure if she got her TV hook up, knowing this place she probably did.  I was proud of myself for not budging on Miss Thing and her attitude though.  I can't fucking stand entitled people, especially when they're so unwilling to be fucking civil.  Just because you don't understand something doesn't mean you have to be a dick about it.  I'm not going to break the law and go to court and be like, \"Oh, you're a lawyer, just do law, make me not go to jail because that's what I want!\"",
        "created_utc": 1532018656,
        "upvote_ratio": ""
    },
    {
        "title": "Updates...",
        "author": "mk6dan1992",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/904wix/updates/",
        "text": "So I've been rolling out 1803 to certain people to try and get them to test that everything works as it should. I did one persons computer and they seemed to have a few issues.\n\nI'll put me as - Me: and them and User:\n\n*Phone Rings*\n\nMe: Hello IT.....\n\nUser: That update you've done has broken everything...\n\nMe: What do you mean it's broken everything what isn't working?\n\nUser: Well.. I've lost all of my drives..\n\nMe: What about the shortcuts on your desktop do they still work? can you get on the internet alright?\n\nUser: Yeah the shortcuts work and the internet works just when I go into my documents there isn't any folders on the side.\n\nMe: Right could I connect up and i'll have a look?\n\nUser: Yeah sure \n\n*Connects up and opens up file explorer*\n\nMe: Ah... I see the problem... there's a little arrow next to 'This PC' and if you click the arrow your drives should appear. \n\nUser: Oh.... Is that it? I thought they were all gone...\n\nMe: Nope they were there just not visible from that menu. But if you clicked on 'This PC' you'd have seen them. What were the other issues you had?\n\nUser: Well.. it was just that but because that wasn't working I thought everything would be broken. But thank you.\n\nMe: No problem, just ring if you've any more issues.\n\nDon't you love it when windows updates something and the slightest thing changes and the user thinks everything is now broken?\n\n",
        "created_utc": 1531998471,
        "upvote_ratio": ""
    },
    {
        "title": "Dual Displays",
        "author": "Neur0nauT",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/904qjg/dual_displays/",
        "text": "Just had a customer call to enquire on getting his dual displays working.  Had to share..\n\nThem: \"I've plugged in the HDMI cable, but neither display is showing up\"\n\nMe: \"You mentioned HDMI *cable?* Do you not have two cables for each display?\"\n\nThem: \"oh....wait.....I'm being stupid aren't I?\"\n\nMe: \"You've connected the HDMI between both monitors haven't you? like a daisychain?\"\n\nThem: \"Uh yeah....that won't work will it?\"\n\nMe: \\*faceplam\\* \"No it will not indeed....you will need two individual display cables connecting from each monitor into the rear of the workstation\"\n\nThem: \\*Giggles\\* \"OK, I get that...I'll go and look for another cable\"\n\nMe: \"You will probably need a display cable other than HDMI for the second monitor such as a VGA, DP, or DVI since your workstation may not have x2 HDMI ~~inputs~~ outputs*\"\n\nThem: \"Right....I'll check that out thanks, byeee\" \\*click\\*\n\nUnbelievable.\n\n*edited terminology mistake for the anally retentive",
        "created_utc": 1531996743,
        "upvote_ratio": ""
    },
    {
        "title": "Bought $1,500 laptop and nothing works",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/904mw8/bought_1500_laptop_and_nothing_works/",
        "text": "[removed]",
        "created_utc": 1531995649,
        "upvote_ratio": ""
    },
    {
        "title": "I hate when people ask for the password to the network",
        "author": "Lumo5",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/903ehv/i_hate_when_people_ask_for_the_password_to_the/",
        "text": "[removed]",
        "created_utc": 1531981834,
        "upvote_ratio": ""
    },
    {
        "title": "When freePBX strikes back!",
        "author": "harrye30",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9020ov/when_freepbx_strikes_back/",
        "text": "Okay, so bit of a backstory, I've recently taken on a role as a VOIP systems engineer  \nPart of my KPI's for this month have been to migrate 12 physical PBX/CTS to virtual machines. We currently run a xen environment with 10 blades. (shudders over xen)  \n\n\nAC = Angry Customer  \nMe = Me obvs  \nTL = team lead  \n\n\n\\---Set Scene---  \nI kick off a conversion through esxi and the vmware standalone converter before leaving the office at 5pm.  \nTravel home, grab a bite to eat and I'm sitting at home with a fresh piece of KFC and the dogs at my feet waiting for this export to OVF to complete.  \nExport completes and I import to our pool master. Spin it up and realise this box was built on Schmooze. Oh well. Break the grub bootloader and get into maintenance mode fix up the drive mismatch and get it booted up, add network adapters etc etc and shut down the old physical. \n\n5 MINUTES LATER\n\nBingo all phones at AC site are now back up and reregistered, check and test some calls with Asterisk and make sure call flow is working as intended. Revoke all SSH access. Check time and date as AC has had a number of issues with incorrect time conditions and public holidays sticking their phones in night mode! Everything works out fine and it all looks good for the night.  \n\n\nComplete 3 more migrations and head off to bed.   \n\n\nQueue 8am phone call from my TL.   \n\n\nTL = DUDE WHAT THE FRICKEDY FRACK DID YOU DO LAST NIGHT ON AC SERVER  \nMe = Err, exactly what was discussed in the project meeting.   \nTL = No calls are flowing for them. Nothing is working!   \n\n\nJump onto the box. run sudo hwclock  \n\n\n***JAW HITS THE FLOOR***\n\nliterally 30 seconds after I disconnected from the console the hardware clock had reset itself to GMT due it not being able to get a realtime reading from xen. A quick fix up later and everything is back up... or so I thought.   \n\n\nNo handsets are registering. By this time I'd said fudge it. Jumped in the car and headed to site (only 5 mins from my house). Get there, unplug all phones. plug back in. site comes up. and customer is semi-placated.   \n\n\nTravel to the office, proceed to get roasted by TL. Show him the logs from asterisk and the time change. By this time I'd woken up enough to have it dawn on me that there is still 3 other boxes to check &gt;.&gt; luckily none of them had the same problems. They are all running Centos compared to Schmooze. Facedesk at how simple the resolution was and kick myself for not waiting a few minutes longer before logging off.  \n\n\nTLDR; Building production machines for FREEPBX direct from their distro means you're ganna have a bad time.",
        "created_utc": 1531968666,
        "upvote_ratio": ""
    },
    {
        "title": "The guy who can't count",
        "author": "genaldar",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/901lhj/the_guy_who_cant_count/",
        "text": "Reading these stories inspired me to post this. If I posted it before my hiatus I apologize. Here there be paraphrasing. \n\nI work at a giant company doing level 1 tech support.\n\nM = me, C = caller\n\nM: Standard greeting\n\nC: I forgot my pin for my token and I'm working from home tomorrow so I need to be able to log in. \n\nM: since we're dealing with a login can I have the last 4 of your social security number?\n\nC: xxxx\n\nM: great let me get signed in. So you were locked, I've unlocked you and cleared your PIN. I'll walk you through setting up a new one. Enter just your token number and it will prompt for a new PIN. The new PIN has to be exactly 8 digits long. Digits are numbers only. It can't start with 0 and it can't be a simple sequence like 1 - 8 or 2 - 9.\n\nC: what's the set up website? \n\nM: we're not going to use that, go ahead and use the VPN client\n\nC: I'm in the office\n\nM: it still works, it would be redundant to stay connected but since it's how you log in outside of the office it's good practice. \n\nC: its not working\n\nM: let me get the monitor up, try again please\n\nC: it didn't work\n\nM: it says invalid PIN, did you maybe hit a letter?\n\nC: no\n\nM: did you start with 0?\n\nC: (agitated) no\n\nM: if it's exactly 8 numbers wrong correct? Not 7,not 9?\n\nC: yes of course\n\nM: let me send you an email, sometimes it's easier if you see examples\n\nWhip up an email illustrating what 8 numbers looks like.\n\nC: (extremely agitated) it still isn't working, it must be because I'm not using the website. Give me the website!\n\nEmailed user url\n\nM: okay I've sent you the website, please try again\n\nC: it still isn't working!\n\nM: let's try this, write out your Pin and count how many digits\n\nC: (even more agitated) 1 2 3 4 5 6 7 8 9, (calm) I'm going to try it without the last digit.\n\nM: that should help\n\nC: it worked, I'm sorry\n\nM: it's okay, now be sure to destroy the paper with your Pin. Have a great day.\n\nTLDR caller can't count and is unaware of that fact",
        "created_utc": 1531965149,
        "upvote_ratio": ""
    },
    {
        "title": "They're all dead, Dave. Dave, they're all dead.",
        "author": "Jacknamestheplanets",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/900wve/theyre_all_dead_dave_dave_theyre_all_dead/",
        "text": "At my $company I'm a UC engineer, covering mobile (cell) procurement tasks when my trusty sidekick is on leave. \n\nToday I was assigned a ticket from $user, due to finish with $company in a few days. He wanted to transfer ownership of his work mobile number to his personal name.\n\nThis is fine under policy, so I auto-piloted an approval request to his $manager.\n\n$Manager responded, declining the request. She left some notes saying $user was using his personal mobile number for work, that he was lodging expense claims each month for business related calls he'd made.\n.......\n\nI email $user, saying $manager has declined the request as she doesn't believe he has a work paid for service. \n\nHe replies, saying he does and gives me the mobile number. I double check it against the work billed services, it's not there.\n\nI reply, asking if he receives bills directly from the carrier for the number? \n\nHe confirms this, saying he receives bills each month and that he lodges expense claims each month with work for business calls.\n……..\n\nKeep in mind this guy is an engineer, has a university degree and presumably doesn't need help getting dressed each day.\n……….\n\nI explain to him that I can't transfer his 'work' mobile number to his ownership because he already owns it. It's his. He owns it, he pays for it, it's his. His is. Is his.\n\nHe comes back, states because the number is published in our GAL that he thought it was work owned. I'm exasperated and ask him about the bills, if he was receiving the bills directly from the carrier did that not confirm he owned it already?\n\nHe was a bit confused by the bills, yes, but just paid them.\n\nI wish him luck in his new job and close out the ticket.\n\nI cannot wait until my sidekick is back from holidays…..\n",
        "created_utc": 1531959418,
        "upvote_ratio": ""
    },
    {
        "title": "Can’t figure it out but they do?!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/900ori/cant_figure_it_out_but_they_do/",
        "text": "[removed]",
        "created_utc": 1531957586,
        "upvote_ratio": ""
    },
    {
        "title": "Where is the internet?",
        "author": "braindedned",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/900i16/where_is_the_internet/",
        "text": "I'm deploying new desktops, moving from Win7 to Win10, and I decide to start with the special child first.    All day long I'm answering rediculous questions, training related stuff, not actual problems.\n\nThe best of the day:\n\nProblem Child - \"Where is the internet?\n\nBrainded - \"You have two icons on your desktop, one for chome and one for IE, take your pick.\n\nProblem Child - \"But niether of them go to google, they go to the intrAnet.\n\nBrainded - \"That's the default start page for our org, just go where you want from there\"\n\nProblem Child - \"How?\"\n\nI just can't anymore.... I can't teach this lady how to type a URL into the address bar or change her home page.   I got actual work to do. ",
        "created_utc": 1531956051,
        "upvote_ratio": ""
    },
    {
        "title": "Why I have no faith in the legal system",
        "author": "smallboy99",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/90002j/why_i_have_no_faith_in_the_legal_system/",
        "text": "FTP, LTL, on mobile so sorry for formatting.\n\nSo for context I work for a company that manages an email system, I'm on the first line customer support team and get a lot of stupid calls but this one is probably the stupidest so far.\n\n$Me = Me \n$C = Customer (who is a lawyer of some sort)\n\n&gt;$Me - You've reached helpdesk how can I help you?\n\n&gt;$C - Hi, I'm a lawyer on an important case and I can't access my emails that I need for the case, you need to get me back in its important\n\n&gt;$Me - Okay that's not a problem have you tried going through the can't login process?\n\n&gt;$C - Yes I tried that and it said it couldn't find my account\n\n&gt; $Me - Oh okay can you confirm your email for me and I'll try and do the password reset from our end\n\n&gt;$C - yeah it's [name]@[company].com\n\nI search the email and it doesn't come up in the system\n\n&gt;$Me - I've searched the email you've given me and it doesn't seem to exist in our system \n\n&gt;$C - No the email definitely exists, you need to get me in now I have an important case I can't work on until I've accessed my email\n\n&gt;$Me - Are you sure you've typed it in correctly? A common issue is just simple typos in the email address.\n\n&gt;$C - Yes of course its correct I can spell my own name \n\nThis continues for about 10 minutes before my colleague (who has higher privellages in the system because he's 2nd line) gets back and I get him to search for all the users on that domain (something I can't do). I find $C in the list pretty quick. She's typed her email in multiple times, read it out loud to me multiple times. On exactly 0 of these times did she realised she was spelling her own damn name wrong.\n\n&gt;$Me - I've been able to find your account in our system. It was just a simple typo, the correct address is [correct address].\n\n&gt;$C - Oh yeah! I've been getting those letters the wrong way round the entire time! [Hangs up without saying anything else]\n\nSo yeah. That's the story of how I did a customer support call with a lawyer who couldn't spell her own name. Needless to say my faith in the legal system was not strong after that.",
        "created_utc": 1531952194,
        "upvote_ratio": ""
    },
    {
        "title": "I need ALL the information",
        "author": "Ecurat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zzxku/i_need_all_the_information/",
        "text": "So, this is my first post so I'm sorry for the formatting, also, I'm not a native english speaker, so there will be some ortography/grammar errors.\n\n\n\nMy work it’s a jack of all trades, it involves project management, system analysis, implementation, software testing, a little (almost inexistent) software development, and tech support of all the systems that I implement, one of them is responsible to integrate three other systems, this story it’s related with the development team of one of these I’ll call it **CCS** from customer care system.\n\n\n\nOne day I was in a 5 hrs travel to make an implementation in one of our call centers, the problem was, that I had some integration tests scheduled with the CCS team, so, we had to postpone them, next day, I was supporting remotely\n\n\n\n**CCS Guy**: *Your system it’s not working.*\n\n**Me**: *Have you erased the browser’s cache?*\n\n**CCS Guy**: *Yes, still not working.*\n\n**Me**: *Ok then it must be another thing please try again open the browser's console and tell me what error returns.*\n\n\n\nWell, I’m going to do a parenthesis here, the test that we were doing consisted in sending data to a third system, which it’s sent via webservices, we have two of them but for test purposes I’ve only configured one, so it was sending an OK message and one with an error which was correct. End of parenthesis.\n\n\n\n**CCS Guy**: *It’s sending an error from the webservice*\n\n**Me**: *That error it’s correct, that’s not the problem, can you send me all the text in the console so I can find the error*\n\n**CCS Guy**: *Ok, sending* Then he proceeded to send me a photo of the console showing the aforementioned error\n\n**Me**: *Nope, that’s the same error you mentioned, I need ALL the text in the console* \n\n**CCS Guy**: *Ok* He sent me a photo of the error that my system was showing (the same message)\n\n**Me**: *No, as I said before, that error it’s normal I NEED ALL THE TEXT your console it’s showing* \n\n\n\nAfter a frustrating half hour with this, the scheduled time for the tests was over so I asked them to send me the data of the browser’s console and the logs located in X folder in their PC so I could analyze it and help them with the error, and I received an email from them with the same photos they already sent me. After that, I found a configuration made by me that was the problem and solved it.\n\n\n\nBut that’s not all, before my correction, the CCS team leader went to complain with my director of me not being in the tests (remember, I was 5 hours of distance), well, he had the right to do it and there were nobody else to help him, so I’m not going to blame him for doing it, but, I don’t know what he said but whatever it was, instead of saying something like “Hey, Ecurat is not helping us please assign us someone who can”, he told something my director understood that I had done modifications in production environment (totally not true), so I spent the rest of the day explaining to him that the configurations were in a development environment.\n\n\n\nLater my director scolded the CSS team leader, so I hope he thinks twice before going to complain something with him (or at least think twice what’s going to say).\n\n\n\nTL;DR – I couldn’t go to do some tests with another team, the system I do support fails (my fault), guy can’t understand that I need ALL the information he could collect, his leader complains about me, my director misunderstand him and believes I’m making configurations where I should not, I explain that he’s wrong and the leader gots scolded.\n",
        "created_utc": 1531951669,
        "upvote_ratio": ""
    },
    {
        "title": "Help? My computer froze! Can you please help me.",
        "author": "Rug45",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zzszx/help_my_computer_froze_can_you_please_help_me/",
        "text": "So I get the following email from a user:\n\n I have a crazy deadline.  Any chance I caught you at a time that you’re free to come up to my computer?    \n \n\nLet me know…  \n   \nNow the back story on this user is every-time they call, email, or page me it's emergency. It's never \"Oh hey when you have a chance can you take a look at this issue or whatever. Everything is a priority. \n\nSo I make my way up to the users desk and \"No the computer is not frozen\", Excel is not responding. Why you ask. Because the spreadsheet they are trying to open is open by their boss who is 6 feet away and the pop-up windows letting them know this is behind one of the 30+ windows they have open.\n\nIt's individuals like this that cry \"Wolf\" when it's something different cause me to shake my head.\n\nNow back to surfing Reddit.",
        "created_utc": 1531950724,
        "upvote_ratio": ""
    },
    {
        "title": "I want to edit on Excel these receipts I printed.",
        "author": "atropicalpenguin",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zzsim/i_want_to_edit_on_excel_these_receipts_i_printed/",
        "text": "LTL, FTP. My dad runs a small business and I'm home from college due to summer vacations (not in the US) so my dad has me close to help him with work. \n\nThis morning he asked me to make a receipt for him on Excel, so he could just tap some numbers and get the total with taxes automatically. No problem, just make some tables and add simple formulas.\n\nI showed him later that day the receipt. He was happy at first, until he told me that he had already printed a bunch of those at a nearby store. What he wanted was to be able to edit the receipts on Excel then print them on the paper he already had, meaning that the values on Excel would have to fit on the preprint. I was annoyed as first that I hadn't understood what he wanted the first time but I told him that that should be easy with the original file. No need to deal with measurements or such.\n\nOf course, he didn't have it, he wanted me to make the receipt anew and for it to fit on his papers. There went my afternoon measuring cells and trying to make them match with those bloody receipts. \n\nTL;DR: Dad's receipts are the less efficient way to print receipts.",
        "created_utc": 1531950626,
        "upvote_ratio": ""
    },
    {
        "title": "“IT loses more stuff than the cloud does”",
        "author": "keegster30",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zzhhw/it_loses_more_stuff_than_the_cloud_does/",
        "text": "So I’m working on a project at my job trying to replace an encryption service with a new one and this conversation happens after I am done with the remote session and saving the encryption key:\n\nUser: Really - to a cloud? (The choice I chose is cloud active directory)\n\nMe:it gets saved to AD\n\nUser: what’s AD\n\nMe:active directory\nSo it stores your profile like our passwords, usernames, and phone numbers \n\nUser:I’m sorry, I thought the selector was cloud when you clicked\n\nMe:the AD is the cloud in this situation\nI had the same reaction when I was being walked through it\n\nUser:can we change it\nToo much stuff gets lost in the cloud\n\nMe:it’s not the cloud and won’t affect you as a user\nIt is stored in the domain\n\nUser:but you just said AD is the cloud\n\nMe:no that is technically our cloud option, it’s not in a cloud, stored on our domain\nLike instead of saying “store in active directory”\n\nUser:still - it’s a cloud - why couldn’t we use one of the other options \nIT loses more stuff than the cloud does \n\nMe: because that’s how our process works\n\nUser: so I should never mind ",
        "created_utc": 1531948353,
        "upvote_ratio": ""
    },
    {
        "title": "Absolute Certainty",
        "author": "TheTipJar",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zzb69/absolute_certainty/",
        "text": "A national charity organization was moving out of our building and into a new building they had renovated.  They had asked me to assist with their technology needs with the move.  At the time, I was swamped and couldn't take on the project, so I referred them to an MSP I frequently work with.\n\nInstead of going with my recommendations, they decided to go with a different MSP - one I would never recommend to anyone.  I will call them TMSP (Terrible MSP).\n\nFast forward.  Charity org is now in their new building.  They have everything setup for the most part, but are having a few issues with their new network that TMSP installed.  The printer company is there and for some reason they cannot get the scanner to email scans.  I was asked to investigate. I stated that TMSP and printer people needed to talk and that most-likely the issue lies within the firewall config.  Shortly thereafter, I get CC'd on an email chain from TMSP tech.  He states, and I quote, \"I can say with absolute certainty that we are not blocking ports 25 or 587 on the firewall/internet connection\".  Hmmm...\n\nThe director of the charity org is unsatisfied and wants me to figure it out.\n\nBecause I didn't have anything to do with the design or implementation of their network, I needed some information.  They had a new Watchguard firewall installed and some Ruckus APs.  I requested all of the necessary admin information for these devices from the director of the charity org.  She went back and forth with terrible MSP for a week before they begrudgingly provided the information to her (I should add that charity org is not paying a monthly service fee to TMSP to manage this device and they wholly own it).\n\nI was at charity org on Monday and looked into why their scanner couldn't email scans.  I tried a few solutions from the device and nothing was working.  I decided to look in to the firewall.  I'm not a Watchguard guy and haven't had to look at a config for one in the last ten years, so I was a little nervous that I wouldn't be able to figure it out.  It took me all of five minutes to log in to the firewall and see that TMSP had created specific policies allowing outbound traffic on specific ports.  Ports 25 and 587 were not listed.  I created a simple policy allowing port 587 traffic and now the scanner can send emails.\n\n\nTLDR:  Bad MSP is bad with the firewalls they install.  They were 'absolutely certain' that they weren't blocking any ports, especially 25 and 587.  They were absolutely wrong.",
        "created_utc": 1531947070,
        "upvote_ratio": ""
    },
    {
        "title": "Without operating system no working PC",
        "author": "genij1234",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zz9iu/without_operating_system_no_working_pc/",
        "text": "This is the first story I ever share and will propably be the last.  \nI am working at a small company and I am not working for tech support I am a developer. But I am responsible for the sockets and for the moving and connecting of the devices.  \nSo I have a basic understanding how everything should be connected and what to check if some device is not working as intended.  \nWe have a seperate Laptop to scan all USB-drive that are from extern. The Laptop has all Anti Malware software on it and is pretty easy to use.  \nThere are 2 coworker who usually do the checking of these USB drives. But on that special day both were on vacation.  \nSo another coworker(C) of mine has to scan a USB drive for malware, because he needs the data on this drive today. To her luck there is a pretty good instruction on how to use this Laptop.  \nThe instruction is made for someone who has totaly NO tech-affinity. Here is what the instruction looked like(loosly translated from german):  \n    The Laptop should be running. If not, power the laptop on. Check if the Laptop is plugged into a socket and the socket is on.  \n    The LAN cable should be connected to the Laptop. If not connect it to the Laptop.  \n    On the Desktop there is a file: Update Malware signatures. double click on that file.  \n    Wait for the update to complete(it can take up to 30 min)  \n    Open the Malware Scanner. {picture of the file}  \n    Select your USB-drive and start the Scan.  \n    That is it.  \nSo coworker just printed the Instruction and went to scan the USB drive for malware. After 40 minutes she comes back, and says the Laptop is not working as intended.  \nI never worked with the Malware Scanner Laptop, but I still go with her to take a look at it.  \nThe Laptop is running, I can see the desktop but I can not access any folder or start anything.  \nSo I try to turn it off by holding the button for 3 seconds. The turning on did not went as good, the Screen showed the usual boot up screen for a second, but then the laptop turned off again.  \nI wasted 30 minutes troubleshooting. I just want to give up, so I take the USB Drive that is lying next to the laptop to give it my coworker and tell her it is not working and she should write support (support can take from 30 minutes up to 3 days to come).  \nBut suprise suprise that is not her USB that she wanted to scan. That USB-drive was in the Laptop when she came, so she pulled that USB-Drive out and pluged her own in that slot. When she came to ask my help she had taken her USB-Drive with her.  \nSo in the end I learned that this USB-Drive that is always connected to the laptop has the main partition of the operating system on it. It is not labled and it looks just like the USB-Drives we give out to our externs.  \nI labled the USB-Stick with \"Operating System\" and added to the instruction following line:  \n    The PC will not work without the Operating System. Check if the USB with the lable Operating System is inserted in a slot.  \nEDIT: It got longer than I expected.",
        "created_utc": 1531946748,
        "upvote_ratio": ""
    },
    {
        "title": "This Door Won't Close",
        "author": "durgadas",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zz7ix/this_door_wont_close/",
        "text": "This just happened.\n\nSomeone panicked came to talk to me:\n\n\"It says 'the door won't close on the recorder.\"\n\nThe only way I can describe what the problem is: \n\n1. Get up, then stand in the nearest doorway to whatever room you're in, and then try to close the door. \n2. In the doorway you're standing in.\n3. Without getting out of the doorway.\n4. Then call tech support to get help.\n5. With a problem that only occurs when something is in the doorway.\n\nIt's a Marantz recorder. The card they put into it has a little button you press on a spring. This is for when you want to take the card out. You press it hard and it pushes out the card. Press it again, and it sticks out a little, preventing the door from closing. SHE SHOWED ME THE PROBLEM, EXACTLY. Then proceeded to ask me what the problem was...\n\nI honestly have never witnessed something so dumb in my life, or resolved a \"technical\" question that was so unbelievably obvious in my life. I'm just... dumbfounded.",
        "created_utc": 1531946365,
        "upvote_ratio": ""
    },
    {
        "title": "Grocery store IT short stories",
        "author": "lesethx",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zywja/grocery_store_it_short_stories/",
        "text": "Moar IT stories!\n\nI formerly worked for a small company that provides tech support to other companies.  These stories are all about 1 particular client, a local small chain of grocerry stores here.  Nice company, but most of their issues can be summed up to:\n\nStory 1\n\nClient: \"Thing is broken; please fix\"\nUs: \"Okay, we $$$ to buy a new X\"\nClient: \"Oh, nevermind then.\"\n\nPerhaps best example, near the end of me working with them, I checked our reports to find the oldest, must replace computers, and IDed 2 desktops, both 5 years old, and 1 of them making a worrying noise (I think it was a fan).  The client verbally and enthusiastically agreed to replace them soon.  That computer with the worrying noise died a week later, but the client only replaced that and not the other computer I showed them. /facepalm\n\n------\n\nStory 2\n\nThe cheapness issue also extended to billing.  They paid $X amount each month per computer (although our boss did all kinds of excepts, grumble).  At the time, we had shitty remote management software, so I kept a spreadsheet of each computer, by name and location (even room).  I tell the client they this many computers and they argued that, no, they had fewer commputers.  SO I showed them the spreadsheet to see how I came to my total and finally they agreed.  The next month they did the same thing.  It took half a year before they stopped complaining they had fewer computers (or at least that I heard).\n\n------\n\nStory 3\n\nA non-cheapness issue! This is a network setup that is a bit difficult to explain: client has several locations along 1 city block, but they all operate off the ISP from the main building, which uses 2 way attennae to send internet to the other locations on the same block (the other sites farther away do have their own internet).  Apparently these are meant to be used to send data a mile away, not half a city block, but the sub-locations get much slower speeds that the main location, even though we did about as much as we could to improve speeds.\n\nDid I mention the marketing dept was on one of the sub-locations?  Well they were, and if you dont know, marketing uses HUGE raw files for pictures and videos.  They frequently complained it would take a long time to download or upload those files from the server.  However, they also always had Spotify running.  No amount of explaining that Spotify was gravely impacting their network speeds would get them to stop using it; eventually the marketing dept moved to a new location with their own internet and the new dept that moved in had no network speed complaints.\n\n-----\n\nStory 4 \n\nThe main location has (had? I don't believe they would spend money to replace it) this OLD camera system.  It crashed often, but it was an easy fix: reseat the HDD.  The problem is that the \"room\" it was in is above the bathroom.  This requires obtained a ladder (easy enough), climbing the ladder into this spider-infested nook, then while Im doing my repairs (hunched over, btw), someone has to take the ladder away cuz it's blocking the path.  After I am done, I have to wait until I can flag down an employee to bring me back the ladder, which can take a few minutes (there may or may not be some footage of me making faces into a camera while waiting).  *Fuck that.*\n\nSo we tried to get the manufacturer to repair the system, however since it was an old system, out of any kind of warranty, and not even in production anymore, it would take like 3 weeks and some $3,000 to fix.  Client refused.  However we were able to convice the client to get a replacement HDD for the system and thankfully that cut down me having to climb up into the spider-nook from once a month to once a year.\n\n------\n\nStory 5\n\nClient at the time had their own email servers (I think they were the last to move over to something like Office365), which frequently had issues, included space.  Client had a media out-reach program promoting their store as a top 500.  They even included that article and award as part of their email signatures.  However, client failed to mention that to us.  The ensuing flood of email filled the servers resulted in email outage for a few hours.\n\n------\n\nStory 6\n\nNaming conventions.  So, this client likes to have everyone's email address be their first name.  Yeah, that frequently became an issue, so the \"policy\" was if that name was already taken, the user's email is their first name and last initial, no space or break.  This first became an issue when a new hire \"Chris T\" would have had the email christ@company.com.  \n\nAmazingly, that didnt change the policy, but the next time a new hire, \"Joe L\" would be joel@company.com, and they realized it would be confusing for people to think he was Joel.\n\nBefore that policy change, 1 guy with a common name chose to have an animal for his email (eg, dolphin@company.com).\n\n------\n\nStory 7\n\nNot really an IT story, but good enough for an ending.  Even though I had my own laptop, I frequently used their desktops, even to write emails.  Client also has a small bee farm on the roof of the main location, and since no AC, they open the windows when it is hot.  Also, I am highly alergic to bee stings.  \n\nOn this day, I was on one of their desktops, writing an email to the client basically about what I did that day, when a bees lands on my desk, near the keyboard.  I internally flip the fuck out, yet my arms remained calm.  I knew I had to get the email out, but rather than leave and retype it at home (seriously, end of day, dont wanna work!), I stopped what I was writting mid email and instead wrote\n\n**\"Oh shit bees! Im out\"**\n\nBefore I hit send and gtfo.\n\nNo one replied to the email.",
        "created_utc": 1531944227,
        "upvote_ratio": ""
    },
    {
        "title": "Try to take advantage after I do something nice for you? Enjoy having your project brought to a standstill.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zyp3n/try_to_take_advantage_after_i_do_something_nice/",
        "text": "[removed]",
        "created_utc": 1531942788,
        "upvote_ratio": ""
    },
    {
        "title": "Part Two: Who Needs Windows Updates; We Don't Need No Updates",
        "author": "hidesinserverroom",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zyl2w/part_two_who_needs_windows_updates_we_dont_need/",
        "text": "So this is a followup on the continuation of the  aptly named \"[Who Needs Windows Updates; We Don't Need No Updates](https://www.reddit.com/r/talesfromtechsupport/comments/8s8s2z/who_needs_windows_updates_we_dont_need_no_updates/)\".\n\nQuick and dirty on that in case you didn't read up. Customer asked for some recommendations on their network. Found them to be woefully out of date and in some cases never applying windows updates. Anyhow onward and fast forward a month.\n\nCustomer thought about it some more and asked us to proceed with a roadmap and hit some of their critical servers with patches and updates. All seemed to go well until the request come back again.\n\nThis time asking us to in detail catalog each singular update and service packs on what they are, what they change and a one to three week testing period in between each update before applying the next.\n\nWe of course reiterate that doing this would take weeks and even months possibly years of time to accomplish, possibly if ever. Unswayed by our brilliance in the areas of information technology, we put this on hold.\n\nTL;DR: Customer seems to think \"big company\" that supplies updates stills works in the fashion of XP/2000/2003 days when each program and/or component is updated with its own separate update.",
        "created_utc": 1531942017,
        "upvote_ratio": ""
    },
    {
        "title": "*Sigh* Today I was the user",
        "author": "SorinPlaneswalker",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zyf9h/sigh_today_i_was_the_user/",
        "text": "[removed]",
        "created_utc": 1531940922,
        "upvote_ratio": ""
    },
    {
        "title": "The Tale of the Battery Packages",
        "author": "Shooxjat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zy6my/the_tale_of_the_battery_packages/",
        "text": "First time posting here, and boy do I have some fun ones in my back pocket, but I'll save those for another time.  For now, we're going to discuss the reason I finally decided to post.\n\nCome on in folks, and sit down for the saga of the Battery Packages.\n\nSome background:  I'm a \"Tech Generalist\" (my job title is \"Technician\", which I was, once...) who works for an independent religious school somewhere in the United States.  My school is named after a saint, as a fair few of them tend to be.  This is important later.\n\nOne day, my school gets three packages of batteries from $Manufacturer, totaling 120 batteries.  This piques my interest since while we do have $Manufacturer's laptops at our school, we didn't order any batteries and we don't have any set of 120 computers in any case.  So I email the rep, asking WTF? Their reply was \"Here's the email of the lady who ordered them.  Are they not a part of your organization?\"  Her email address had a different domain than ours, and it belongs to a rather similarly named (same saint) school in $OtherState, though it's probably only a couple hours worth of driving from our location.  So I point this out.  A few days later, another message.  \"Oh, they're a different school than you.  Can you send the packages to them if I give you prepaid labels?\"  Being a nice enough person, I say sure - it gives the interns experience with mailing and packages.  So we get the labels, I check them for accuracy (they are), and the interns drop them off at the pack and ship place, and since it's prepaid that's all they need to do.  Today, I get... three boxes of batteries with a $OtherState address on the shipping label.  WTF?  \n\n\nEdit: It looks like not all the old labels were blacked out (like they usually are on incoming packages - this must have been because of the odd nature of the packages to begin with) when I had my interns attach the new ones.  \\*Sigh\\* I feel dumb now.  More training for all!",
        "created_utc": 1531939309,
        "upvote_ratio": ""
    },
    {
        "title": "[AMA] I've plugged in 6 usb devices correctly today on the first try, ask me anything",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zy4xo/ama_ive_plugged_in_6_usb_devices_correctly_today/",
        "text": "[removed]",
        "created_utc": 1531938979,
        "upvote_ratio": ""
    },
    {
        "title": "It only took 15 years",
        "author": "baseoverapex",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zxr04/it_only_took_15_years/",
        "text": "Warning, long post\n\n\nSo, my father in law is a lovely guy. Came from not a lot, worked extremely hard, and has become successful. This means that he has the money to buy nice tech toys, though he isn't so great at actually using them. I am not in IT, but am the de facto tier 0 tech support for these adventures.  \n\n\nThe problem is that he is a very bright guy. He's a family physician, but rather than make his money by charging high prices to rich people, his office is in the ghetto, his prices are the lowest in the island, and he works long hours, churning through huge numbers of incredibly loyal patients. He's nearly 70, and still works 6 days a week, starting at the crack of dawn. This means that he doesn't have the time to spend figuring technology out. He is prone to what I call quantum thinking; his brain processes all options simultaneously, so explaining stuff to him, and understanding what he has to say can be... difficult. I love him dearly, and we get on well socially, but he and I do not always work well together. I'm much more prone to systematically going through things and explaining them. He just thinks things should work. \n\n\nMy first introduction to his love-hate relationship with technology came with the palm pilot, so that tells you how long we've been doing this dance. He decides he wants this new thing, even if he's not sure why. So, because it brings him joy, we get it for him, and spend Christmas putting all his contacts in, and setting it up. He is very pleased. \n\n\n\nHe doesn't use it. \n\n\nSome weeks later, he picks it up, but the battery has died, and all his data is gone. He thinks batteries should last for months, not days, and, cursing, throws it back in the drawer, never to be used again.  \n\n\nThis is the start of a pattern repeats itself almost annually. Various Nokias, BlackBerries and others came and went. Each year he gets excited for the next new thing, and despite gentle reminders that he has no use for them, he insists that this gadget will be the game changer. He is a good guy, and gets really excited by all this, so we happily indulge him.\n\n\nHe does at least use the laptops that I set up for him, but it's never straightforward. He randomly assigns passwords for accounts, then promptly forgets them. I resorted to telling him to write them down; he's a doctor, so no-one can read them anyway. Not even him. Even if he could find the scrap of paper in amongst his stuffed filing cabinets.. \n\n\nGetting him to back stuff up doesn't work, so rather than lose all his reports, I set up Dropbox folders, and tell him to save them there. There are thousands of files, strewn in every corner of the computer. He'll spend a few months saving things in my docs, then switch to downloads, then the desktop, or wherever. To open a file, he opens word, selects the last doc, then saves a new copy. I've tried explaining the difference between programmes and folders, and how folders nest in one another, but I just can't get him to slow down sufficiently to listen to what I'm saying. Setting up templates didn't work either. I've had my wife try and explain, enlisted various techy family members, but no. IT support for him is a never ending cycle of firefighting.\n\n\nRecently though, we had a breakthrough. This Christmas, he decides that the iPhone 10 would be the answer to all his problems. Dutifully, we got one for him (thank God his birthday is on boxing Day, and we can give joint presents), and I went about setting it up. After years of wrestling with stupid fucking iTunes for Windows for him, I wanted to get him on Spotify, so we can make playlists for his office etc. But when you live on a tiny irrelevant island, setting up spotify is not straightforward (for example, Google play has no payment processing here, so I can't even download apps with a paid component). Anyway, after a lot of jiggling around, we give him his functioning phone, expecting never to see it again. \n\n\nBut then, something strange happened. He actually used it. He is sending WhatsApp messages, skyping his mother overseas, and actually taking the thing with him when he leaves the house! It's been a few months now, and it is still going. I am blown away by this. \n\n\nI just finished persuading him to get fibre installed so he can watch Netflix. He is  of course very excited by, and grateful for, this. And for the first time, I'm excited too. I really don't want to have to go back to torrenting all his favourite shows, and taking them down there on a memory stick that he will promptly lose…\n\n\nWish me luck.\n\n",
        "created_utc": 1531936367,
        "upvote_ratio": ""
    },
    {
        "title": "Uncooperative user",
        "author": "genaldar",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zwqwz/uncooperative_user/",
        "text": "I don't think I posted this one before, but I was inactive so long I may have.\n\nI work for a huge company at the level one help desk. A couple of roles ago (about 5 years) I was working on a Friday night. As it had been several years in paraphrasing and shortening the exchange. It was about a 15 minute call. M = me, C = caller\n\nM: Standard greeting\n\nC: my computer is slow\n\nM: okay, the first thing I like to try is have you restart the computer\n\nC: no\n\nM: I sorry, did you say no?\n\nC: I don't want to restart, it takes too long so I don't do it.\n\nTo be fair she was on xp and records could take a while thanks to all the bloat we load.\n\nM: ma'am I know it takes a while but our procedures call for a reboot for this issue. Also you're expected to reboot your computer at the end of your day so you'll have a nice clean instance when you work next.\n\nC: none of us reboot it's too slow and my supervisor said so and so said we didn't have to\n\nM: ma'am I don't know who so and so is, but regardless of whether you reboot daily you may do so now so we can proceed with the troubleshooting. It may even fix the issue.\n\nC: so and so is my Supervisor's boss, you should know who they are\n\nWe have over 100,000 employees, and I don't even bother remembering the CEO's name since I'll never meet him. But out of curiosity I check, her name drop is a nobody like 19 levels below the CEO. I'm like 23.\n\nM: I sorry I don't, but if you're refusing to restart all I can do is assign this ticket to level 2 support.\n\nC: do it!\n\nM: while I finish filling this out I should let you know this is a 2 day priority ticket, meaning it could be 2 days before they pick it up.\n\nC: (interrupting) I need it right now!\n\nM: I'm sorry, this group has gone home for the day. And as it's after hours on Friday they won't be back until Monday morning. The 2 days actually begins then.\n\nC: (interrupting) so it won't get looked at until Tuesday?\n\nM: no ma'am, it could be Wednesday morning before the ticket is picked up. And as I noted you refused to reboot your initial instruction will most likely tell you to reboot.\n\nC: well I don't need your help I restated and it's working now, no thanks to you *hangup*\n\nI put \"had user reboot\" in the solution field and pending closed my ticket.",
        "created_utc": 1531929639,
        "upvote_ratio": ""
    },
    {
        "title": "Batteries",
        "author": "aricelle",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zwnc6/batteries/",
        "text": "[removed]",
        "created_utc": 1531928944,
        "upvote_ratio": ""
    },
    {
        "title": "\"I just want to see my dad again\"",
        "author": "dannythetwo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zwm27/i_just_want_to_see_my_dad_again/",
        "text": "So this just happened about 5 minutes ago. \n\nI got a heartfelt email from a lady whos dad passed away a long time ago. She recently discovered that there are some digital files of some black/white video taken many years ago that has her dad. She got the videos and was distraught that they wouldn't play. That was when she reached out to me and ask if I could recover the videos. \n\nI have very little experience in recovering corrupted video files, but I told her I'd give it a shot. Today, I got a thumb drive in my office that was wrapped in several layers of foam and all encased in a yellow envelope with the word \"FRAGILE\" written on it all over. Took a while, but I finally unwrapped it and it was the thumb drive.\n\n Plugged it in and checked it out and figured out that the problem was that the video files were a format that Windows Media Player can't read. I opened it in VLC and they all worked fine. \n\nI called her to let her know the videos are perfectly fine and that I'll be giving it back to her with a program that can run the videos the way they were when she sent it (VLC installation file) and with copies that will run the video on WMP. She was ecstatic.\n\n Right now, I've got all the videos rendering to mp4 in Adobe Media Encoder. Pretty soon, I'll give the thumb drive back to her and she'll finally get to see her dad again after all these years. \n\nShe also said that she can't wait to show it to her family so they can see their brother, uncle, etc. again too.\n\nEdit: Formatting to fix paragraphs ",
        "created_utc": 1531928687,
        "upvote_ratio": ""
    },
    {
        "title": "I'm supposed to know what now?",
        "author": "mf9769",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zwfve/im_supposed_to_know_what_now/",
        "text": "Background: I'm the IT manager (read: only IT guy) at a certain multi-specialty medical practice. Very stressful, but I love the owners and most of the docs. Plus I've known the owners since I was a kid, and they specifically invited me to do the job once I proved I knew what I was doing and they realized they needed a full time IT guy.\n\nCharacters:\n\n$me: well if this ain't me, I should be in a hospital, not working at one.\n\n$doc: a doc who, while generally a nice person, is also a perfectionist that runs their own department with an iron fist\n\n$HRlady: the lady that does all our recruiting and is usually swamped because of our high turnover\n\nIn a similar vein to a story I read here a few months ago, this morning I received a series of messages from one of the physicians in the medical center I work in regarding the fact that their new girl manning the front desk in their department hasn't had her account set up and thus can't work. New girl also can't get to her desk because she couldn't open the door. This second part was apparently my problem because I'm apparently responsible for getting the staff their door codes (I'm not, and never have been. We have a guy who does that as one of the many hats he wears. He's been doing that for a couple of years now, though everyone in the building thinks I do it, despite it being clearly stated multiple times that I don't.).\n\nAbout 30 seconds prior to the wave of texts, I also got a call from one of the office managers warning me what was coming, as she'd just gotten off the phone with the understandably pissed off doctor. Turns out the girl couldn't open the door because she couldn't figure out that it was a sliding door, though to be fair, it was her first day, and we have exactly 2 sliding doors in the whole building.\n\nNow, I'm generally somewhat swamped, being the only IT and all, so I figured \"Oh shit...I forgot there's a new girl coming in.\" I check my ticketing system, and there's indeed a ticket for a new account. Usually, I create these during the day, or if marked urgent, early in the AM from my house. Except that the note inside is for a totally different person, assigned to a totally different department. So I call the doc.\n\n$me: \"hey $doc. So I never got a ticket with your new girl's name, or when she's starting. Any idea why?\"\n\n$doc: \"BLAH BLAH BLAH $HRlady. BLAH BLAH SPOKE TO YOU YESTERDAY. I BLAH SPOKE TO YOU ON BLAH. BLAH BLAH BLAH NOT DONE.\" (I feel I should mention $doc is a relation of one of the owners, and has also known me since I was a kid. In fact, I've been their patient, so they yelled but didn't curse. They're generally very nice and courteous to me, and the $doc in our conversations stands for %doc's first name, not doctor.)\n\n$me: \"Indeed, HR did speak to me yesterday. And did mention a new girl. But not for your department. And you asked me to go introduce myself to your new trainees when I came to make sure your department didn't need anything from me that I didn't know about, not that you were hiring them.\"\n\n$doc: \"NO. I JUST SPOKE TO HR. THEY SAY THEY SENT YOU THE TICKET. YOU KNEW ABOUT IT. DO THIS NOW. WE ARE GONNA BE BEHIND THE WHOLE DAY NOW. AHHHH.\"\n\n$me: \"Ok, yeah. I'll take care of it.\"\n\nI hang up, and check the ticketing system again. Confirm everything's been working fine for the last 72 hours. Call HR.\n\n$me: \"$HRlady, did you send me a ticket for the new girl last night?\"\n\n$HRlady: \"Yeah. I got done with her around 5ish, right before you left. Told you to set her up for tommorow.\"\n\n$me: \"Yeah I remember that convo, and that ticket, but that was for $otherdepartment, not $doc's department, no?.\"\n\n$HRlady: \"Wait, what? Hold up.\" *10 seconds later* \"Oh...shit. I sent only the one, not two. Ok, here's her name. I'm sending the documentation now. Get it done.\"\n\n$me: \"Ok, sure. It needs to be done stat according to $doc.\" *create the account, show the girl how to log in and such*\n\n10 minutes later, I get a call from $doc\n\n$doc: *really contritely* \"mf9769? I just want to apologize for yelling at you. Didn't realize it wasn't your fault, and we had a crazy morning. Sorry. I spoke to $HRlady and clarified everything.\"\n\n$me: \"Shit happens, $doc. Just remember, if it's not in the system, I don't know about it, ok?\"\n\n$doc: \"Yeah. Sorry.\"\n\ntl;dr: I get blamed for shit that's not my fault, because as the TFTS i mentioned reading at the top implies, IT is not, in fact, clairvoyant.",
        "created_utc": 1531927483,
        "upvote_ratio": ""
    },
    {
        "title": "Printer tech who doesn't know mac from windows.",
        "author": "mcaulr09",
        "url": "https://www.reddit.com/r/sysadmin/comments/8zjz6s/using_a_mac_is_no_excuse_to_not_know_windows/",
        "text": "",
        "created_utc": 1531926461,
        "upvote_ratio": ""
    },
    {
        "title": "My email keeps disappearing!",
        "author": "StopShoe",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zw9u8/my_email_keeps_disappearing/",
        "text": "I really hope your day is going better than mine.\n\n&gt;User: \"My email keeps randomly disappearing, I've reported this issue multiple times and you guys still haven't fixed it. I need my email blah blah blah\"\n\n*Sidenote: we use gsuite, and have been for over a year now. This user has only been here for around a month, and I remember helping him setup his computer and giving him the rundown on how things work.*\n\n&gt;Me: \\*remotes in, sees their email is open\\* \"Okay sir can you show me what happens?\"  \n&gt;  \n&gt;User: \"Well when I try to go to a client website, the email goes away\"  \n&gt;  \n&gt;Me: \"Okay so show me an example\"  \n&gt;  \n&gt;User: \\*types [google.com](https://google.com) in the address bar, doesn't open a new tab\\* \"see it just disappeared!\"  \n&gt;  \n&gt;Me: \\*Wishes I was Jesus and could turn my water into strong alcohol\\*   \n&gt;  \n&gt;Me: \\*Spends 15 minutes showing how tabs work\"\n\nI love my job, and enjoy helping people, but I can't comprehend how people can get a job in 2018 and not know the basic functions of a computer. ",
        "created_utc": 1531926322,
        "upvote_ratio": ""
    },
    {
        "title": "8 year old walks me through his networking fix",
        "author": "Gordo81",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zw89i/8_year_old_walks_me_through_his_networking_fix/",
        "text": "[removed]",
        "created_utc": 1531926024,
        "upvote_ratio": ""
    },
    {
        "title": "Service Calls aren’t there to help you catch up on work.",
        "author": "jisuanqi",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zw7hl/service_calls_arent_there_to_help_you_catch_up_on/",
        "text": "I work in a fairly large company with multiple offices around the world. I provide support to users working in our Big German ERP System^TM environment.\n\nThe root cause of 99% of the calls I take are user error. To be fair, many of them are due to the user having to only perform a particular task maybe once every quarter or so. Why the instructions available for such processes are not read is anybody’s guess, but a good bit of my day is spent telling people “No, click that button and THEN that button.”\n\nI received an email this morning that can best be described as a substantial amount of work disguised as a service call.\n\n\nThe email read:\n\n\n&gt;*Hi $jisuanqi,*\n\n&gt;*We’ve got to move these materials from one plant to another, but I’m getting errors. Please let me know when these materials are moved.*\n\n&gt;*Regards,*\n\n&gt;*$LazyUser*\n\n\n\n\nI immediately noted that the error was not in any way described. Big German ERP System^TM has loads of error messages which are all coded for ease of reference. I replied, first of all, asking why I would be doing this task rather than just fixing the error that $LazyUser claims he is getting, and for him to give me the actual error, because you don't go to the doctor and not tell him or her why you're there.\n\nI really try to refrain from copying direct managers on replies, but when people are trying to pass off work on people who have no business doing it, I think the manager needs to be aware that either the user is getting away with something or they cannot bring themselves to tell their manager that maybe they need help. Either way, it needs to be addressed.\n\nA short while after replying, I receive a response that the “error” has been “resolved” and no further action need be taken by me.\n",
        "created_utc": 1531925876,
        "upvote_ratio": ""
    },
    {
        "title": "Your job is to KNOW IT, then I'll focus on my job.",
        "author": "JoOngle",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zw0r8/your_job_is_to_know_it_then_ill_focus_on_my_job/",
        "text": "We often get calls where the user have no clue just how many software systems we support, or at least are supposed to support.\n\nWe support around 4000+ apps and software solutions, but more than often, our users expects us to know every one of them, down to every little detail, how to use them, regular bugs in their particular software of choice, and who manages them etc.\n\nMost of our users get to use 3-4 software solutions on a day-to-day basis, so when some of them calls, they will typically behave like this:\n\nMe: IT Support, how may I help you today?\n\nCaller: Article no# 103.285.12883.100 just went bust, I can't get it to release.\n\nMe: Could I ask you what software you're currently using?\n\nCaller: What I always use, every day, don't you know that?\n\nMe: Sir, no - sorry I am not aware of that until you tell me that.\n\nCaller: Ok, see this? And then I'm moving over to this, and this happens...\n\nMe: I can't see you. Do you want me to remote to your computer to see your desktop?\n\nCaller: Sure, please do.\n\n\"Request was Denied\".\n\nMe: You have to press accept in order for me to view your screen.\n\nCaller: Oh, do you see me now?\n\nMe: No, you'll have to click on the YES or ACCEPT icon/button.\n\nCaller: Where is that? (now the user has clicked on so many things that the request window is hidden somewhere).\n\nMe: Well, if you browse trough your windows, you'll find it, and just click YES / ACCEPT. Please.\n\n(User finally discovers it after a lot of effort)...and we're on!\n\nUser: Ok, do you see it now? \n\nMe: Ah, you're using \"obscure, local IT solution no#2432, let me wiki that and see if there's any known errors.\n\nUser: Excuse me? You see the problem, and you still don't know how to fix this?\n\nMe: I understand you're busy, but I am currently trying to locate a solution for your specific problem.\n\n(user mumbles grumpily in the background about incompetent IT, talks to coworkers about it).\n\nMe: Ok, I might have found the solution to your issue, you might have been entering the wrong area code in the order somewhere. \n\nUser: No, unlike you - I know my job, I've done this every day, when did you start your job did you say?\n\nMe: I'm still relatively new, I've been here for a year.\n\nUser: oh wow, just wow.\n\nMe: You may want to know we support 4000+ software solutions here, we don't stand a chance of knowing the inside-outs of every software out there, please be a bit patient with me, and I'll have you up and running in no time.\n\nMe: Ok, please go back to where you entered the Area code, and try this area code instead.\n\n(works!).\n\nUser: Mhmm...you could have just said so. (Click....)\n\nOh well.\n\nbest part about the job, we got some awesome colleagues, and not everyone is as stressed as in the above example, but you gotta be a jack-of-all trades and a bit of a pocket-psychologist in order to survive this.\n\nWhat do you think? Could I have handled this situation differently?\n",
        "created_utc": 1531924508,
        "upvote_ratio": ""
    },
    {
        "title": "First step of troubleshooting: call IT",
        "author": "Uzmeyer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zvw82/first_step_of_troubleshooting_call_it/",
        "text": "Hello TFTS, LTL, love this sub, always waiting for new posts while ~~slacking off~~ beeing on standby in case of emergency at work. Sadly (luckily) most employees here are pretty savvy so I don't have too many tales. This is not gonna be some incredible post but it just happened.\n\nEnter me sitting at my desk in the way too hot IT Bunker, trying to get some basic information out of a website for $someenterpricesoftware wich it is doing it's best to keep it hidden from me. Just an hour ago i had heroically fixed an issue with $shittyaccountingsoftware (I absolutely hate dealing with that garbage piece of software and i am certain it hates me equally, there will be some post about it someday) for $OfficeLady, when I get a call.\n\nThe phone displays \"$OfficeLady\"\n\nUh oh, this can't be good...\n\n&gt;**$Me:**  Hello, $Me speaking, what's up?  \n&gt;  \n&gt;**$OL:** Yeah, you see, there seems to be an issue with $shittyaccountingsoftware...\n\nOh goddammit please no i just fixed it..\n\n&gt;**$OL:** Oh wait, i fixed it. Thanks anyway! \\**hangs up\\**  \n&gt;  \n&gt;**$Me: ...**\n\nSigh.\n\nThis is quite a common occurance with $OfficeLady, im glad It wasn't anything major, but please, try at least *something* before calling me. Well, still better than $OtherOfficeLady, who often refuses to do anything and will rather wait for me to come over to do exactly what i knew needed to be done and could have explained in maybe 30 seconds.\n\nAnyway, hope i'll be back soon with a more exciting story, have a nice day.\n\nTL;DT: User calls IT before trying anything themselves, just to immediatley fix it.",
        "created_utc": 1531923561,
        "upvote_ratio": ""
    },
    {
        "title": "A gaming laptop for a client",
        "author": "kinkitup4u",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zsi2r/a_gaming_laptop_for_a_client/",
        "text": "A woman calls my shop, says she bought a laptop for her son so he can play his favorite game, and make videos recording himself play like his favorite youtubers. Working together, her and her son managed to get Steam installed but failed to install his favorite game. After several simple questions back and forth she revealed the laptop to be a Macbook Air.\n\n\nPause for sigh.\n\n\nI calmly explain to her that Apple computers aren't gaming computers, and many games simply cannot be installed on them. She asked what her options were, and I told her the most cost effective solution would be to throw together a basic PC with a half-decent GPU, and it would be a great gaming computer for his favorite game. The kid demands to have a laptop instead of a desktop, so together we decided that returning the macbook and getting a similarly priced non-apple laptop will be more than enough for his not-very-demanding game. She thanks me for my assistance.\n\n\nA week goes by and she shows up at my shop with her son (who I now realize is barely 10 years old) in tow. She places a Macbook Air on my counter, and explains that she tried to take the macbook back and get something for gaming, but her son had an otherworldly tantrum and absolutely demanded to keep the macbook. She spent days reading and tinkering and to her credit, installed bootcamp and had Windows 10 running natively, but now she is out of her element and can't figure out how to install programs in a Windows environment. I accept the job and install Steam and Ultimate Custom Night. (i know, i know..)\n\n\nAnother week goes by and she comes back with a laundry list of complaints. The game, and any other game he tries, run poorly. Screen recording programs don't work properly. He tried installing his other games but there's either not enough storage space, or the graphics card isn't good enough. I explain that the graphics absolutely can't be upgraded, but the storage can (though it's an insane process she wasn't willing to pay for) and she asked what her other options are. Once again, I suggested getting a non-apple laptop. She thought hard but turned the idea down, citing her sons tantrums, and exclaimed that if the kid can't be happy with what he wanted, too bad for him, she's done trying. ",
        "created_utc": 1531889804,
        "upvote_ratio": ""
    },
    {
        "title": "Two interesting users recently",
        "author": "whoreychan",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zs597/two_interesting_users_recently/",
        "text": "Some background, my coworkers and I do tier 1 and in some ways tier 2 tech support for a more obscure organization that exists somewhere between state and federal level jointed between two very different federal departments. (Think farms vs. missiles different) there is an office in every county of every state that each state has to support. \n\nThe first guy called because our sysadmin decided it was time to up the password requirement (without notifying tech support btw) and setup a script that would lock you out of certain things if your current password doesnt meet the new requirements. (Dumbly enough the error said password incorrect instead of something like \"Password needs to be changed\" or literally anything more useful) (Sysadmin decided that if anyone ran into the block [nearly everyone did we went from 8 characters mixed case to needing 10 characters, mixed case, with numbers and/or symbols and could not contain initials, names, or their DOB] they would call us and we would figure it out) (this happens a lot) (no I'm not bitter, you're bitter) the following conversation occurred after we figured this out so it went as follows. I am $ME, old guy is $OG.\n\n$ME: [Intro] How may I help you?\n\n$OG: I cant sign into [Our site] it says my password is wrong but it cant be it has been the same for almost 10 years \n\n[partly why the sysadmin put the block in] \n\n$ME: Yes, see we actually have a new security policy where we have to meet new requirements for passwords so you will have to change it. May I remote in to assist you with that?\n\n$OG: Fine fine. \n\n[I remote in. Open a new tab to go to the PW change page and help him change it. He changes it, I have no idea what it is.]\n\n$ME: let's try to login now, \n\n[Swaps back to other tab, he types in characters, password incorrect pops up] \n\n$OG: What I just changed it! \n\n[Skipping back and forth to where he eventually tells me the pw, it's his dogs name and  random string after with meaning to him.]\n\n$ME: let me try to put it in, is the first letter a Capitol or Lowercase?\n\n$OG: you mean passwords are case sensitive?! First email addresses now this? \n\n(Aside: email addresses used to be case sensitive, they haven't been for a little while) \n\nNeedless to say I had a good laugh explaining how they always were here. \n\n\nThe second is a shorter story about a lady that called today to yell at us for changing her PDF viewer. She managed to pickup some adware from an external  site she shouldn't have been browsing (Nothing bad just not work related) and thought we did it to her on purpose because she calls tech support a lot because she isnt good with computers and she thought that annoyed us. She was sure it was a practical joke at her expense. Our supervisor ended up opening her browsing history and showing her by going to the site how easy it was to just pickup the adware. She was embarrassed but understanding and I think grateful we were patient with her despite the accusations. ",
        "created_utc": 1531886374,
        "upvote_ratio": ""
    },
    {
        "title": "How to become an IT guy with no experience",
        "author": "aganbold",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zrn9b/how_to_become_an_it_guy_with_no_experience/",
        "text": "[removed]",
        "created_utc": 1531881866,
        "upvote_ratio": ""
    },
    {
        "title": "The day multiple emails were described as colors.",
        "author": "nightlyear",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zr3gc/the_day_multiple_emails_were_described_as_colors/",
        "text": "I’ve never posted here before and please forgive my formatting as I’m on mobile.\n\nSo a little background.  The company I work for is a merger of some 3rd party clinics and a main hospital system.  With this merger, users generally have multiple logins to remember and old employees from company A, generally have 2 email addresses, one from old company and one from hospital system.(why they didn’t make a new email system for new company is beyond me.)\n\nAnyways, I work tech support and we cover everything.  We don’t have levels to escalate to. We also rotate in and out of our”call center.” (Aka 2 ppl with a horrible week).  Here is a call I can’t forget and thought I’d share. \n\nM: me\nC: caller\n\nM: Thanks for calling IT, how may I help you?\n\nC: My email isn’t working,\n\nM: What kind of error are you receiving with your email?\n\nC:The blue one won’t let me in.  I need help as I have important emails on here.\n(I’m a bit confused by the color here, but on some workstations we are getting them on Win 10 and have Office 2016, while older systems have Win 7 and Office 2010)\n\nM:So you’ve recently been upgraded to the new Outlook and it’s not working properly, is that correct?\n\nC:No, I haven’t had a new PC recently.  I just need help with my blue email.  I can get into my yellow email fine, but I cannot my blue one. \n\nM:(dumbfounded) Ma’am I’m not sure which blue email you’re discussing.  Can you provide me with more information. What email address are we having issues with?  \n\nC:Idk it’s just the blue one.\n\nM:Let me remote in to get to the bottom of this issue for you.\n\nI remote in and find she is accessing our webmail instead of using Outlook. (Which she has both emails setup on).  Company A’s webmail is blue and company b is yellow.  It’s a wonderful aaaaha moment for me, as I’ve never paid much attention before.\n\nM: It looks like you’re accessing the webmail for company A, which the credentials you’re entering are incorrect.  \n\nC: I’m entering the correct ones.  See watch.\n\nM: I’m afraid you’re using the credentials for company b, which won’t work.  Try again using company a’s credentials, the same ones you’ve used to log in to the PC with.\n\nC: Oh it worked!\n\nM: Great!!! You do know you’re setup on Outlook with both and an icon is placed on your desktop.\n\nC:Yes I just prefer this way better.\n\nM:(eye roll). Have a nice day.\n\nWhile this isn’t the worst call I have had, we must remember this is a doctor, who saves lives.  Glad tech support can save the day, and maybe another life!!\n\n",
        "created_utc": 1531877158,
        "upvote_ratio": ""
    },
    {
        "title": "The literal dumbest thing I have ever done...",
        "author": "YaBoyJonston",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zqp34/the_literal_dumbest_thing_i_have_ever_done/",
        "text": "[removed]",
        "created_utc": 1531873852,
        "upvote_ratio": ""
    },
    {
        "title": "Skype message waiting for one of my technicians after a quick network printer mapping call.",
        "author": "mookdaruch",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zq4lx/skype_message_waiting_for_one_of_my_technicians/",
        "text": "[removed]",
        "created_utc": 1531869287,
        "upvote_ratio": ""
    },
    {
        "title": "Need a relationship partner.",
        "author": "Jesycka",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zp2fy/need_a_relationship_partner/",
        "text": "[removed]",
        "created_utc": 1531861274,
        "upvote_ratio": ""
    },
    {
        "title": "We don't support you, you left the company",
        "author": "Adam3324",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zog0i/we_dont_support_you_you_left_the_company/",
        "text": "Background, I work for 2 sister companies totaling about 400 users together. These companies operate separately to the outside world but are supported by a Corporate umbrella for like our CEO reports to someone at Corp who reports to the President of the entire Corporation on paper. We have an IT dept that is around 20 people with separate roles aside from a few developers and 2 sys admins and DBAs, supporting those 400 users and our Dept are the first contact for their IT needs, we occasionally have to request Corp IT help with certain items but users still work with us solely. This causes some confusion when users leave to a \"unsupported\" sister company.\n\nJust got off a call with an employee who a few months ago left us and moved to a separate company under the Corp umbrella that is not supported by our IT and has sole support from Corp IT. Albeit this employee not a week ago came by looking for a new laptop from us and my boss told them straight up we don't support him anymore and he has to contact Corp IT.\n\nMe=M  User=U\n\nPhone rings.........\n\n&gt;M: Adam3324  \n&gt;  \n&gt;U: Hi, Adam3324, I have this issue with my desk phone it's been happening for a while and I can't get to voicemails using it I have to use the company chat system, also I can't seem to clear my missed calls or view them, rambles on a few more minutes,,,,, can you stop by when you have time and take a look?  \n&gt;  \n&gt;M: I won't be able to stop by, you need to call Corp IT so they can troubleshoot the issue and help you. If they determine the hardware is bad which we do own that desk phone( and let you use it), then they can ask me to replace it but, you will have to call them.  \n&gt;  \n&gt;U: Ok, well it just started happening and it's been going on for a while, rambles rambles,  \n&gt;  \n&gt;M: You will have to call Corp IT, they can help you and with anything else you need.  \n&gt;  \n&gt;U: Ok, so who do I call up there?  \n&gt;  \n&gt;M: You call their support desk.  \n&gt;  \n&gt;U: So do you have a number for someone up there I can call?  \n&gt;  \n&gt;M: I don't have a persons number you need to call the support desk.  \n&gt;  \n&gt;U: Well what is that number?  \n&gt;  \n&gt;M: That number is XXX-XXX-XXXX and they can help you with this and anything else you need.  \n&gt;  \n&gt;U: Ok, so I will do that for the voicemail problem but, what about my missed calls on the phone it hasn't worked and the screen looks different that before.  \n&gt;  \n&gt;M: You will still need to call them, the screen might be different as a firmware update went out to our phones a week or 2 ago changing how some functions look and the backgrounds got reset.  \n&gt;  \n&gt;U: Well this problem goes back before a few weeks ago and the background is now white, what are we going to do to fix it?  \n&gt;  \n&gt;M: You will need call Corp IT at the number I told you and they can help with that and I will only be able to help if Corp IT determines the hardware is bad and want me to help swap out the physical phone.  \n&gt;  \n&gt;U: Ok well I guess I will do that.\n\nHangs Up.\n\nTLDR: Employee leaves to a sister company I don't support that has solely Corp (crap) IT support, asks for my help, I provide Corp IT's number, they reiterate part 2 of their issue, I have to again tell them to contact Corp IT and I will not be walking over to fix it.",
        "created_utc": 1531857005,
        "upvote_ratio": ""
    },
    {
        "title": "First post, and I can’t think of a good title",
        "author": "weneedthebitter",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zmtwb/first_post_and_i_cant_think_of_a_good_title/",
        "text": "I work in tech support for a company that involves me talking to everyone from vendors to shops to ITs to huge corporate companies, depending on the need. While our product is kind of a niche and we don’t have a large support team, I’m cross-trained in about 12 different applications, so my calls/emails/chats can vary greatly on a case-by-case basis. \n\nToday, a shop chatted in saying they had sent an order to the wrong vendor and needed to resend it to the correct one. S will be for the shop, M will be for me. \n\nS: “I sent this order to the wrong vendor and need to resend it to “x vendor instead”. \n\nM: “Sure, are you on your “orders” tab, and do you see that order listed? If you just sent it, it should be right at the top.”\n\nS: “No, it’s not there.”\n\nM: “Did you delete the order after you sent it to the wrong vendor?”\n\nS: “No, I didn’t delete it, I just sent it to the wrong one.”\n\nM: “Are you sure? If you just sent it, it would be at the top of the list and you could open it back up and resend it, but if you deleted it, it’s gone unless you re-do the order in your “outside system” and pull it back into the website.” \n\n(Our system has a small program which is locally installed, that exports files into a website, if the order has been deleted it can’t pull that file back in because it registers it as having been obviously “sent before”.)\n\nS: “I can’t re-do it, because it’s been “locked” in my system. I did remove “x” as a vendor though, and now the order is gone, can’t you resend it for me?”\n\n(They can re-do them even if they’ve been locked, it’s a simple matter of copying the info and starting a new file and pasting it all in there.)\n\nM: “Are you sure you didn’t delete the full order, not the vendor? Because it sounds like you deleted the order you sent to the wrong vendor.”\n\nS: “No I did not delete the order, can’t you just login and look at my account?”\n\nI login to their account and confirm that they did delete the order, as the vendor was still showing up in their vendor list. \n\nM: “The vendor is still showing up in your vendor list, and the order is missing from your orders tab, so you did delete the full order.”\n\nS: *immediately disconnects*\n\nUsually, these shops give me pushback and swear up and down that they never deleted the order. In the two years I’ve been doing this, the system has never found a way to delete orders. If anything, orders have gotten stuck and you can’t delete them at times.  \n\nI know this wasn’t the most funny or entertaining story, but aside from thinking of when I got verbally berated by an IT with a chip on their shoulder, or having someone yell at me because a server went down and they wanted me to turn it back on, this was the one that came to mind. ",
        "created_utc": 1531846377,
        "upvote_ratio": ""
    },
    {
        "title": "This is an email test. Have a great Friday!",
        "author": "karasuhebi",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zmmzi/this_is_an_email_test_have_a_great_friday/",
        "text": "[removed]",
        "created_utc": 1531845068,
        "upvote_ratio": ""
    },
    {
        "title": "No I will not do that, oh leave the site then? OK!",
        "author": "TravestyAU",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zmcg9/no_i_will_not_do_that_oh_leave_the_site_then_ok/",
        "text": "[removed]",
        "created_utc": 1531843090,
        "upvote_ratio": ""
    },
    {
        "title": "If it sounds impossible, it's probably exactly what happened (Alternate Version)",
        "author": "hutacars",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zl8mr/if_it_sounds_impossible_its_probably_exactly_what/",
        "text": "I’m a sysadmin for a company with ~1200 users, but in addition to my regular duties, I also serve as an impromptu escalation point for my colleagues. I have at least some level of involvement in probably 80% of our projects, so if someone is stuck I’m probably a good person to ask. \n\nOne of those projects is deploying new networking gear to every office, gear whose name rhymes with “her hockey.” This gear is generally pretty plug-and-play, but once in a while an oddity occurs as it did one day to $RegionalTechFieldManager (henceforth aliased as $RTFM). He’s a smart guy, but on this day he must have not put two and two together. \n\n$RTFM: hey $huta, I just finished installing $herHockey at this new office, but one of the PCs is still getting the old IP scheme. It’s definitely set dynamically, and I’ve renewed the IP and flushed DNS and still nothing. This doesn’t seem possible. What do?\n\n$huta: hm. Well usually that means there’s still a DHCP server on the network somewhere. What’s the gateway?\n\n$RTFM: it’s bla.bla.bla.115, which also makes no sense. It should be bla.bla.bla.1!\n\n$huta: well check the $herHockey dashboard, and see what device has that IP. Most likely there’s a rogue router somewhere. \n\n$RTFM: huh... that IP is for the $BittneyPowes stamp machine. That's impossible, it’s not a router!\n\n$huta: well, try logging into the Web interface to see what’s up. \n\n$RTFM: oh my... oh, geez. It appears this $BittneyPowes device has a server mode, presumably so you can connect it via Ethernet directly to a PC to add more money. I guess someone enabled it, forgot about it, and connected it to the network. I’m disabling it now. Thanks $huta!\n\n$huta: no problem. \n\nTL;DR: [if it sounds impossible, it’s probably exactly what happened.](https://www.reddit.com/r/talesfromtechsupport/comments/8ya4tz/if_it_sounds_impossible_its_probably_exactly_what/)",
        "created_utc": 1531835076,
        "upvote_ratio": ""
    },
    {
        "title": "Skype failure leads to much amusement as I add randomer",
        "author": "muzzsjm",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zjsla/skype_failure_leads_to_much_amusement_as_i_add/",
        "text": "[removed]",
        "created_utc": 1531821143,
        "upvote_ratio": ""
    },
    {
        "title": "Girlfriends learned a hard lesson in data backup!",
        "author": "muzzsjm",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zjl2t/girlfriends_learned_a_hard_lesson_in_data_backup/",
        "text": "Personal story for a change! Girlfriend has been doing a university course as part of a promotion at work. Data stored on the desktop of a Windows 10 Dell 7450 laptop. Laptop wouldn't boot last night just throwing errors and blue screens. \n\nLooks like an update corrupted and failed update... tried the usual Windows repair, copying files and forcing it to boot. No luck! battery low so I reckon its died during an update.\n\nShe goes mental I should have bought a more reliable laptop and this wouldn't happen with Apple stuff... uhhhh so where yours backup? you've been doing this for a month without backing anything up?\n\nBrowse the disk in Windows Repair folders and data missing, how odd! Plug the hard drive into my gaming PC works fine no hardware problem but no folders or files. Decide to do a Windows reset as it dumps files into windows.old and only removes applications/software.\n\nNOPE NOPE NOPE! WHY DIDN'T YOU BACK THIS UP????!?!?!?!?!?!?!\n\nSo here I am trying data recovery software... did find some old Word tmp files but been unable to convert them into documents.\n\nALWAYS BACKUP YOUR DATA! I spent ages explaining it's not the laptop and if she didn't have a USB stick OneDrive is literally built into Windows 10 and has 5gb of free space.\n\nHer gym iPod died a few months ago and she lost years of music and I'd have thought she'd learned her lesson.",
        "created_utc": 1531818620,
        "upvote_ratio": ""
    },
    {
        "title": "Cancel the migration at the worst possible time? Okay!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zj1x0/cancel_the_migration_at_the_worst_possible_time/",
        "text": "[removed]",
        "created_utc": 1531811988,
        "upvote_ratio": ""
    },
    {
        "title": "Windows 10 upgrade woes",
        "author": "edbods",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ziwgf/windows_10_upgrade_woes/",
        "text": "So we're currently doing a rollout of Windows 10 since Windows 7 is reaching its end of life. We normally schedule a time convenient for the user as it can take half a day since it's mostly done with SCCM through a network cable, even with a gigabit backbone as the upgrade process actually involves reimaging the device with Windows 10 and any required drivers, depending on whether it's a laptop or desktop.  \n\nBut we can't just go upgrading people's machines without backing up their stuff first, so my supervisor had a nifty little script he's been using for the past ten years to back up everything under the user's profile folder, as well as non-system files that may get saved outside of their user profile folder i.e. under the C drive but not inside C:\\Users\\Username. Anything that got saved outside the user's folder depended on the file extension, so that for example a whole bunch of .ini files from some random program wouldn't get unneccesarily copied.  \n\nMost people don't have an issue outside of not being sure where some of their files were at first, but so far there's been two rather outstanding cases.  \n\nThe first one was a guy who had MS Access databases saved outside of his user profile folder, under C:\\ and the backup script unfortunately didn't pick it up since out of the several hundred people in the offices at this particular location, only him and one other guy were known to have Access databases stored outside their profile folder, and so my supervisor's script didn't account for MS Access 2007 database files (.accdb), only pre-2007 databases (.mdb files). It sucked for everyone but after taking a look at the backup on the external HDD we save it to, and concluding that the files were lost, we got into a little argument, now I've never been good with confrontations but one thing I distinctly remember was his manager sitting next to him telling us that 'we don't back up our data, you guys do,' (we only routinely back up stuff on the servers) and when I asked him what if something happens between these backups, he replied that he didn't back up his data because nothing has happened to it yet. I was considering asking if he buys insurance before or after his house gets broken into but again, I'm not good with confrontations and so I just told him that we only back up data on our servers, and that we'd see if we can get the data off the drive.  \n\nHe and his manager kept rather quiet though when they and I, my coworker, supervisor, supervisor's manager all got into a little office to talk about this incident...strangely not mentioning how we back up their data and not the users...my supervisor was having a go at them saying that they shouldn't save stuff on the C drive and that he'd been using that backup script for the past ten years without issues, as well as pointing out how nobody else at this location had database files stored outside their user profile folder. We eventually came to a compromise, my supervisor's manager (he's more manager rather than IT oriented) saying that we should probably slow things down a bit so that this sort of thing wouldn't happen again and that was that. The user sometimes makes light remarks about the thing but I just roll my eyes remembering what his manager said about backups...sheesh.  \n_______________________\nAnd as for the second story...well this particular manager was saving his stuff normally, and after his laptop got upgraded he realised the contents of his Documents folder were missing. We got an email from him last week saying that he had missing files under my Documents and was wondering if we could retrieve them. The strange thing is that my coworker had upgraded his laptop *months* ago and he only emailed us last week about there being nothing in the Documents folder. My coworker was absolutely perplexed as to how this could be the case (his prior job was call center work, not so much software and hardware support with desktops and laptops) and told me what was happening. So I popped in the external HDD into my computer to take a look at his profile folder, see that there's absolutely nothing under Documents, save for Outlook's folder and one or two other automatically generated folders. This was pretty weird, since his Desktop folder was full of stuff. But then I saw it. A shortcut.  \n\nBut not just any shortcut, it was a shortcut to My Documents. I right clicked on it and checked out the properties...ooooooh boy. The shortcut's target was to C:\\Users\\\\**Public**\\My Documents, but the guy had no clue...all this time and for god knows how long, he was saving to the Public profile folder which didn't get copied over for obvious reasons. I don't even know how but that shortcut was there alright. Maybe one of the guys at the other offices set it up since the guy does move around a bit but he seemed accepting of it as we didn't hear back from him after my coworker talked to him over the phone recently.  \n\nOther than those two though, people seem ok with the upgrade, some of them grumble about Windows 10 though as they understandably disliked Win 10 to begin with but it's what upper management wants so what can we do.",
        "created_utc": 1531810263,
        "upvote_ratio": ""
    },
    {
        "title": "This time it’s my fault...",
        "author": "TheAlmightyZach",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zhabc/this_time_its_my_fault/",
        "text": "[removed]",
        "created_utc": 1531794371,
        "upvote_ratio": ""
    },
    {
        "title": "Web Browsers",
        "author": "Kodatine",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zh3rd/web_browsers/",
        "text": "Hi, I'm new to this board! But I had a story that, looking back, is absolutely hilarious to me. \n\nSo, I work for a webhosting company that supports, for the most part, small and medium sized businesses. As such, we get a lot of people that are kind of new to the whole web developing thing, and while that's usually awesome sometimes it's just silly. Example.   \n\n\nA woman calls in saying she's received a notification on her account that Internet Explorer does not work very well with our software, and because she's using it, she needs to switch to Chrome or Firefox. So, she admits she's quite computer illiterate and doesn't know how to download and install chrome.   \n\n\nI send her an email with the download link, and tell her to follow the instructions. Apparently I was not clear enough after telling her to click on the downloaded file. (Admittedly I said \"Yep, now you just click on it!\" in regards to running the installation)  \n\n\nShe tells me she did everything, and we decide to try logging in. She forgets her password. We go through resetting it. She forgets it again. She then logs in.   \n\n\n\"I'm still getting the same message\" and she reads it exactly as it appears - Now, I'm pretty sure she's still on IE at this point. I try to start a screen share session, but the software is busted on my PC at the moment because of an issue with logins to it that was supposed to have been resolved a week prior. Problem for another day, I shrug it off and decide at this point I've gotta teach this lady how to do a screenshot.   \nThis process takes about 20 minutes , but she seems to figure it out with some guidance.\n\nI explain pressing CTRL + V to paste the prtscn picture into her email. \n\nI then receive an email that just says \"V\"\n\nOk, round two. This time, I get a picture of her email box. Deciding this isn't working, I tell her \"I think you might still be in Internet Explorer.. did you double click the file you downloaded earlier and install it?\"  \nAnd I am met with this response.  \n\n\n\"You didn't say I had to INSTALL it\" - She had left the initial start up box just sitting there for an entire 58 minute phone call. \n\nTL;DR - Sometimes you have to explain that downloading something doesn't make it work. ",
        "created_utc": 1531792820,
        "upvote_ratio": ""
    },
    {
        "title": "Copier tech with awkward tools",
        "author": "Fufflemaker99",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zgsru/copier_tech_with_awkward_tools/",
        "text": "I'm a copier tech, and a female (relevant to story).\n\nThis morning, my first call was at a car dealership.  I got all finished up and my customer was thanking me and offered me some cucumbers from her garden.   I don't like cucumbers, but she was so sweet and so proud of them, i thanked her and took 3.  It was raining outside, so i put them in my tool bag and immediately forgot about them.\n\nFast forward to my next call that was an hours drive away..  After driving an hour, I arrive at call #2.   It's a call to replace a fuser in a big copier, so I gather my tool bag, keys, 2 phones, and huge box containing the new fuser.  I get inside, check out the machine, open the parts box, and get situated on the floor.  I'm now on the floor of a GYNECOLOGISTS OFFICE,  awkwardly wedged in a corner, and i knock over the open  tool bag and 3 HUGE CUCUMBERS roll out of the bag and tumble out of my reach.    I have NEVER tried to explain a situation so fast.   The ladies all laughed and laughed and said I had some good looking tools.   I was mortified.  So yeah, that was my day.",
        "created_utc": 1531790178,
        "upvote_ratio": ""
    },
    {
        "title": "Having fun with naming conventions",
        "author": "GreenEggPage",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zgemg/having_fun_with_naming_conventions/",
        "text": "(This isn't a super-awesome™ story but I think you'll enjoy it.) \n\nTLDR: Bored person has fun. \n\nAt my prior employer, after we had been bought out a couple of times, the great minds that be decided that every server needed to follow new naming conventions instead of the whimsical names that devs like to give things. *nix boxen get a U for Unix, P for Production, and then a 3-digit number. Our two primary processing servers became UP104 and UP106.\n\nI'm one of the smart-asses in the company and had already posted signs on the bathroom stalls for \"Employee Breakroom\" (the small crapper) and \"Executive Breakroom\" (the handicap crapper - that sign mysteriously disappeared after a week or two). Well, having a label maker handy, I decided that the urinals needed to be named - UP104 and UP106.\n\n10 years later, after we'd all been laid off and another company was occupying our former stomping grounds, I heard from a guy who worked there and knew the history, that they would call building maintenance and tell them that UP104 wasn't flushing right (or whatever the issue was). And maintenance knew which urinal they were talking about. ",
        "created_utc": 1531786983,
        "upvote_ratio": ""
    },
    {
        "title": "how to limit gpu usage",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zehqa/how_to_limit_gpu_usage/",
        "text": "[removed]",
        "created_utc": 1531772793,
        "upvote_ratio": ""
    },
    {
        "title": "Automatic Formatting is NOT Your Friend, or, My URL is Broken!",
        "author": "SnArL817",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zedvb/automatic_formatting_is_not_your_friend_or_my_url/",
        "text": "DevOps needs help setting up Puppet. Now the setup is pretty easy: you run a wget command to pull a script from your master server and pipe it to bash. Easy-peasy. We give devops elevated access to do this during server provisioning so that we don't need to install their apps.  \n  \nPuppet won't install. The command gives no output, and no reason for the failure. When devops runs curl against the URL, it says it can't reach it...obviously a network problem!  \n  \nI copy the command from the IM I get and paste it into my terminal window, and remove the pipe to bash. I want to see this script. Nothing. No response. We ARE passing the -**q**uiet option to wget, so I take that off. wget gives me a 404 error. Looks like the problem is on the devops server side! Ha! NOT. MY. PROBLEM!  \n  \nWait...what's that? The file I'm pulling...**install.bash%C2%A0** That's not right. I paste the command into notepad and replace all whitespace with actual spaces, then copy and paste into my terminal. wget now spews out a script.  \n  \n&gt; **Me:** Did you copy these commands from a Word document?  \n&gt; **Devops:** Yes. Why?  \n&gt; **Me:** It included nonprintable, invisible characters. Paste it into notepad and replace any blank characters with actual spaces.  \n&gt; **Devops:** WHAT IS THIS SORCERY? IT WORKS!  \n  \nRemember, folks, Microsoft and Unix don't mix.",
        "created_utc": 1531772080,
        "upvote_ratio": ""
    },
    {
        "title": "Who's on first? No. That's my last name.",
        "author": "TheLightningCount1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ze4ck/whos_on_first_no_thats_my_last_name/",
        "text": "Short one for you guys today. It created a nice little comedy moment that for us today. \n\nOne of my guys told me to pull the call. Saying that it was vital I listen to it and that it was extremely important. It went like like this. \n\n&gt; $Tech - Thank you for calling IT. This is $Tech. \n\n&gt; $user - Hello my name is Jennifer and I need my password reset. (fake name)\n\n&gt; $Tech - Sure thing one moment while I pull up that process. May I have your last name please?\n\n&gt; $User - Who (Fake name but similar.) \n\n&gt; $Tech - Yours. \n\n&gt; $User - Yes. Who. \n\n&gt; $Tech - Umm. Your last name. (clearly confused and worried)\n\n&gt; $User - Uhuh. Who.\n\nVery long pause. \n\n&gt; $Tech - Is your last name W H O?\n\n&gt; $User - Yup. \n\n&gt; $Tech -  I am guessing you heard that so much you just embraced it and make it your running gag?\n\n&gt; $User - Yes actually. \n\n&gt; $tech - *Defeated sigh* Your PW has been set to your last name backwards !1234321!  It will make you change it on login. \n\n",
        "created_utc": 1531770351,
        "upvote_ratio": ""
    },
    {
        "title": "Beyonce Nudes Helpdesk Ticket",
        "author": "alainathegirltech",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zdy4r/beyonce_nudes_helpdesk_ticket/",
        "text": "[removed]",
        "created_utc": 1531769202,
        "upvote_ratio": ""
    },
    {
        "title": "A complex problem with no easy solution",
        "author": "Yvonne_McGruder",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zdd91/a_complex_problem_with_no_easy_solution/",
        "text": "In a previous job I used to look after the mobiles (cellphones) for a professional services firm. One user was determined to get an iPhone, even though we didn't issue them, and as such his devices had loads of issues which were magically solved when we looked at the device.\n\nHis most recent issue was that his mobile battery apparently wouldn't charge, so I sent him a replacement new one.\nM = me U = User\nU: You HAVE to send me a new phone! Somethings gone wrong! (Sounding panicked) I need a new phone!!\n\nM: OK, [User] let's start from the beginning. Have you tried putting the new battery in the device\n\nU: YOU DON'T UNDERSTAND!! I NEED A NEW PHONE!\n\nM: Have you tried putting the new battery in your phone? \n\nU: You don't understand! I dropped the batteries on the floor!\n\nM:... OK, and did you then try to put the new battery in the phone? \n\nU: You don't understand! I dropped them on the floor! I DON'T KNOW WHICH ONE'S WHICH! \n\nM: If you try one battery and it doesn't work, then try the other one, that will be the new one\n\nU: But I don't know which is which?! \n\nM: You'll be able to tell which is which by if it works or not. \n\nU: Well,  we'll see... \n\nI assume it worked as I didn't hear back - nor about that \"problem\" anyway! \n\nEdit: Formatting cos I'm dense",
        "created_utc": 1531765383,
        "upvote_ratio": ""
    },
    {
        "title": "What do I do? What do you want?",
        "author": "drayle88",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zd89t/what_do_i_do_what_do_you_want/",
        "text": "[removed]",
        "created_utc": 1531764460,
        "upvote_ratio": ""
    },
    {
        "title": "Must need to write more detailed instructions",
        "author": "ultra_shea_bodycream",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zcdgb/must_need_to_write_more_detailed_instructions/",
        "text": "So our company is trying to be more efficient and secure in the way we log into machines and applications.\n\n This being said IT had just installed RFID scanners on all computers in the company so that our shop users won't have to log into anything with their ID # anymore. Instead they just scan their badge and access any page/application... yay for modern technology.\n\nAll seems to be going well with the deployment until one day we get a ticket put in saying something along the lines of \"No matter how many times I scan my badge I can't access any pages, something is broken!\" \n\nNaturally I go investigate.\n\nTurns out this user was going all the way OUTSIDE to the door which you must scan your badge to enter. He was scanning his badge THERE, walking in, and expecting the computer to have allowed him access.....\n\nCouldn't decide if this was more hilarious or horrifying.",
        "created_utc": 1531758775,
        "upvote_ratio": ""
    },
    {
        "title": "But if I submit this receipt twice, I'll have twice as much inventory!",
        "author": "LorixsTyring",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8zbvo4/but_if_i_submit_this_receipt_twice_ill_have_twice/",
        "text": "Hello all, Ive got both a mildly amusing and infuriating one for your monday morning.\n\nJust had my first call of the day and it was one of those \"special\" users, you know the kind. Well anyways this guy was trying to enter a transfer receipt into our system to update his inventory but he was getting a Web Request Error and the page would lock up. No big deal clear the cache, reload the browser and the problem goes away. Cue the face-desk conversation that follows...\n\n**Me:** Okay, I have cleaned up your browser, go ahead and try entering the receipt again.\n\n*User tries again and it successfully completes*\n\n**User:** Okay it looks like my inventory is good now, but if I do it again I will have twice as much inventory\n\n*Before I really even had a chance to get out of the \"....What?\" phase he goes back into the web page and clicks submit again. So naturally the system now thinks there is two identical transfer receipts and of course he has twice as much inventory.*\n\n**User:** See? now I have 200 more than i'm supposed to!\n\n*I'm pretty sure the T2 support guy could see my Monday morning despair at this point*\n\n**Me:** Well unfortunately I do not have the authority to manually edit your inventory so I will have to escalate this issue.\n\n**User:** Oh well can you get (insert CIO's name here) to help me? he always fixes my issues.\n\n**Me:** *(not really wanting to bother my boss's boss with this)* I can do that but he will not be in for a few hours, I could escalate this to *\\*person whose job it is\\** and they could get it taken care of in a timely manner if you would like?\n\n**User:** No thats okay I will wait for the CIO\n\nHappy monday everyone",
        "created_utc": 1531755317,
        "upvote_ratio": ""
    }
]