[
    {
        "title": "\"Open the internet...who do you think I am?!\"",
        "author": "hotcaulk",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/64lttp/open_the_internetwho_do_you_think_i_am/",
        "text": "Hello! I have Autism so it can lead to some interesting interactions on the phone, normally the result of me taking someone too literally. My broadband connection at my house was cutting out for about 3 hours every afternoon. It was day 4 of this so I called the help line. This is the conversation that follows between myself and PL (Phone Lady.)\n\n&gt; **ME:** *explains problem I explain above*\n\n&gt; **PL:** Ok, honey. Open the internet.\n\n&gt; **ME:** ...You mean my Network Connections?\n\n&gt; **PL:** No, honey. Open your internet.\n\n&gt; **ME:** What do you mean my internet? I don't own any of the internet. Do you mean my network places?\n\n&gt; **PL:** No, honey. Just open the internet.\n\n&gt; **ME:** Who do you think I am that I can just open the internet? Do you think I'm some gateway guardian that decides everyday whether or not the internet is open for public use? What do you mean open the internet? \n\nOk, so maybe I was kinda ranting at this point.\n\n&gt; **PL:** I don't know honey. Just get on the internet however you normally get on the internet to check your email and stuff.\n\n&gt; **ME:** ...Are you asking me to open my Web Browser?\n\n&gt; **PL:** I am just asking you to open the internet.\n\n&gt; **ME:** Are asking me to open Chrome, Mozilla Firefox, Safari, Opera, or Internet Explorer?\n\n&gt; **PL:** Internet Explorer! That's it! Open that!\n\n&gt; **ME:** Ok stop. We need to go over a couple of things.\n\nI went on to explain the difference between a web browser and the internet but before I finished she just passed me off to someone else. In the end I was happier with someone else anyways because I couldn't trust a word out of her mouth after that. Not that she'd lie but that just doesn't understand what she herself is saying.",
        "created_utc": 1491853081,
        "upvote_ratio": ""
    },
    {
        "title": "Birthday Balloons",
        "author": "Princess_Psycoz",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/64hr8j/birthday_balloons/",
        "text": "So my boyfriend has a birthday, one week from Monday/Today and I am throwing him a birthday party as he hasn't really had one since 14 and it's his drinking age in the US birthday. \n\nI went to a popular store in my town that is known for party supplies. There was a line at the balloon counter and I was 3rd in line. Both ladies at the counter were joyful. I stepped up to the counter and the lady I walked up to her face dropped when she saw me. I do believe she was a manager so I'll call her (M) and me as (C) for customer.\n\nM: how can I help you today? (She sounded unimpressed)\n\nC: I need about 15 balloons in a birthday bouquet.\n\nM: okay fine. Colors?\n\nC: red, blue and yellow (he wanted it Pokémanz go themed)\n\nM: okay fine. Anything else?\n\nC: (I used to work in retail, so I'm a bit taken aback by her tone) no, thank you.\n\nM:(she then takes my order details) here's your receipt, pay upfront. Use your name when you pick it up.\n\nAnd before I'd even walked away from the counter she was helping the next person. I get people have bad days, but in retail, you put on your game face and power through it. Her tone and overall demeanor just, irritated me.",
        "created_utc": 1491801562,
        "upvote_ratio": ""
    },
    {
        "title": "I have to believe previous guest, not hotel responsible for clock shenanigans.",
        "author": "DerDonald",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/64gqoj/i_have_to_believe_previous_guest_not_hotel/",
        "text": "Checked into all suites hotel, everything great, room on super special floor. Set alarm, wake up at time alarm was set for. Realize clock was set 20 minutes back, and AM was switched for PM. No biggie, I had nowhere important to be at any specific time. When I checked out I was asked about my stay and mentioned this aspect while repeatedly reiterating that it could not possibly be the hotels fault. FDC was more than apologetic. I'm just wondering if anyone has any possible explanations for the clock discrepancy other than previous guest maliciousness. Negative 20 minutes as well as AM/PM switch is quite a bit to have happen accidentally with no fix.",
        "created_utc": 1491787926,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for accessories for my new car and I find this.",
        "author": "PensiveGamez",
        "url": "https://www.amazon.co.uk/ESUMIC%C2%AE-Laptop-Eating-Steering-Wheel/dp/B01913DSPK/ref=sr_1_2?ie=UTF8&amp;qid=1491772744&amp;sr=8-2&amp;keywords=car+accessories",
        "text": "",
        "created_utc": 1491773028,
        "upvote_ratio": ""
    },
    {
        "title": "The Night My Dad Lost His Mind.",
        "author": "ThunderMack78",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/64efq4/the_night_my_dad_lost_his_mind/",
        "text": "**Insert \"first-time-poster\" line here**\n\nThis was a few years back, don't remember the exact year, but I was in high school. I had just left one of the school's monthly social events, and was about to go home with my mom and dad. \n\nOn the drive home, we stopped at an off-highway diner that we occasionally went to when we left these events. We walked in, sat down, got menus, all the same. Then the waitress came over to take our drink orders. \n\nNaturally, my father and I ordered sodas, while Mom just got water. Then, the waitress dropped the bomb. \n\n\"I'm sorry, the soda machine downstairs was turned off, and we can't get anyone down there to turn it on.\" \n\nI'm understanding, so I just got an apple juice. My dad, on the other hand...\n\nAs soon as the woman walked away, my dad blew up. \n\n\"How the fuck can they not have any fucking goddamn soda. This is such bullshit, what the fuck...\" It just went on and on. People from the next table over were staring, and I was just wishing I could disappear. Mom's trying to calm him down, but he wasn't taking, and it kept going until the waitress came back...\n\nCarrying two sodas. \n\nNot too big of a tale, but one that we never let Dad hear the end of. ",
        "created_utc": 1491761330,
        "upvote_ratio": ""
    },
    {
        "title": "I was the stupid customer this time",
        "author": "7_t_7",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/648gg3/i_was_the_stupid_customer_this_time/",
        "text": "The other day, my better half and I are at our local grocery store, now we're regulars there, but we both work retail, we know how that story goes.\n\nWe have a big order, and our cashier doesn't have a bagger. After we show our id's for the wine, and I punch in our rewards number, I start bagging our groceries so the poor cashier can get us through quicker. We were kind of making small talk with her, joking around. I wasn't paying attention to what the better half was doing specifically, but she's standing next to the terminal, so I assume she is paying while I am helping to bag the rest the groceries and load the cart. She assumed I paid when I punched in our information. We start to walk away, and the cashier just looks at us and is like, hey, you still need to pay. Easy enough, happily did so of course, just a bit awkward.\n\nEspecially when I look up, and the next guy in line is my co-worker. We had a good laugh over that one.",
        "created_utc": 1491675011,
        "upvote_ratio": ""
    },
    {
        "title": "Worst Hairdresser Ever!",
        "author": "madpandaswag",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/641a8i/worst_hairdresser_ever/",
        "text": "The lady didn't have an inside voice at all and spent the entire time shrieking in my ear about my hair being \"too tangled\" like bitch it's called curls. I have long, thick, curly and frizzy hair and the only time it's not tangled is when it's wet. She went on and on about how my hair is too tangled and too thick, no kidding you're a hairdresser, if you can't handled thick and tangled hair, you shouldn't be doing hair! \n\nShe spent a good 10 minutes trying to comb through my hair and it wasn't doing any damage and I was in so much pain I was literally in tears and had to make her stop. I requested a brush and after the 3rd time asking and her repeatedly telling me she doesn't have one she reaches into her drawer and pulls out *gasp* a brush.\n\nFor those of you who don't understand how switching from a comb to a brush could make a difference, I'll give you an example. When you try to open a can, you can open it using a knife, stab it and keep cutting into it, risk cutting yourself, risk spilling the can and put extra manpower on it and be done in 5 minutes or you can use a can opener and have it done in less than 30 seconds. A comb to curly hair is like using a knife on a can. It shouldn't be done, it's dangerous, it's gonna take longer and there are just better tools. \n\nAnyway, she hands me a brush that she literally had to reach out her hands to get and I then take it and in NO KIDDING, NO EXAGGERATION, 2 swipes I detangle my hair in less than 30 seconds when this bitch couldn't even get quarter of my hair detangled in 10 minutes. \n\nShe then spends the entire time shrieking in my ear about how thick my hair is and insinuating that she'd rather not do my hair because it's too much work. Like of course it's extra work, that's why I'm paying you more. She kept insulting my eyebrows which were on fleek because I just had them done 2 days ago.\n\nShe ends up cutting some of my hair and while she's cutting it, it gets a small tangle. Then she stops and begins straightening it which I didn't want because I don't usually straighten my hair unless it's a special occasion. If she straightens it and cuts it, there are gonna be some areas of my hair that'll be too short when curled, especially around my face making it look fatter or won't look even when it's curly again. I told her not to do it and she does it anyway. \n\nWhen she's done, half my hair is 1/2 inch longer than the other and I point it out to her and she doesn't believe me and tells me it's even. I put them side by side and nope they aren't and she doesn't believe me. She then wants me to pay 5 bucks extra to wash my hair so she can straighten it again to show me, what does that do? I have no idea. In the end we get into a shouting match and her coworker intervenes and she finally gives in and cuts it so it's even. \n\nIn the end I just pay her for the haircut and I don't even tip her because I'm never going back to that place! I've been there before and usually they do a great job, but never again. \n\nTldr: hairdresser spends 1 hour shrieking about how thick, tangled and curly my hair is. No shit, if you can't deal with tangles and curls you shouldn't be a hair dresser. Insults my on fleek eyebrows and cuts my hair unevenly. She also spends 10 minutes trying to detangle my corse, curly hair with a fine toothed comb and refuses to get me a brush which is at arms length, even though I ask from the beginning. After she hands me a brush I detangle it in 2 swipes as she continues insulting me and I just gray wall her",
        "created_utc": 1491581005,
        "upvote_ratio": ""
    },
    {
        "title": "Good argumentation leads to success (most of the times)",
        "author": "Maeghuanwen",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/63zm9u/good_argumentation_leads_to_success_most_of_the/",
        "text": "Hello dear community,\n\nI just read a story on Tales from Retail and it reminded me of two occasions when I was a customer and argued with the knowledge of me working in retail. I'm on mobile, sorry if the formatting is off. \n\nThe first story is about a makeup counter (called CC for certain counter) of a certain brand. I've heard that one of their rules is to not ask if a customer needs help, if that customer looks like he won't buy anything (what kind of rule is that?).\nI went to that counter many times and 8 out of 10 times I was left on my own with no assistance offered. \nSo one day I had enough. I don't like complaining but I felt so unfairly treated that I had to say something. \nI went to a girl working in that store (but not at CC) and asked her who the person for complaints would be since I knew that the CC has its own personell. \nShe delegated me to the assistant store manager and after I told her what I wanted she called CC's manager down. \nWhen that girl came downstairs I told her everything: I was seldom asked if I needed help, I was greeted with an arrogance I can't understand (don't you want to sell your products?), and on that special day I left the counter and when I came back all the other customers were taken care of but not me.\nCC's manager was quite shocked, I could see it in her reaction and assured me that it's nothing personal. I asked her if they base their opinion on the clothes the customer is wearing because it didn't matter if I wore expensive clothes or a normal outfit, they didn't talk to me. \nI also said that I'm also working in retail and I greet every customer, regardless if he wants to buy something or not. She couldn't believe the experiences I had and apologised. \nI said that I'm going there because I want to leave my money and the least they can do is to serve me. I stayed polite of course and in the end I got good advice and left almost 100€ there. \n\nThe second story is about an accessories store. My mum bought a  necklace on clearance but saw at home that it was broken in one place. The necklace wasn't marked as broken so the clearance didn't have anything to do with that. I wanted to take it back but the girl working there called her manager and then said she couldn't refund it because it was on clearance. \nThat's a very stupid reason imo. It was broken, my mum didn't change her mind about it. It was clear that had it been a necklace at the original price I would've gotten my refund. \nI told the girl that this rule is not very customer friendly but that I understand she can't do anything about it. \nLater I messaged HQ and they said they can't overrule a store manager's order (Wut?) and sent me a code with some % off that was only valid for like another three days or so. Not very satisfactory if you ask me. \n\nThe point is that I get annoyed, too, when I'm a customer and the line is long or something doesn't go the way I want it. But most people working in the stores are just the simple minions. They can only follow the rules. If you stay polite they'll try bending them. If you start getting aggressive they will stay their ground. \n\nSo stay nice, folks! \n\nEdit: grammar error",
        "created_utc": 1491561475,
        "upvote_ratio": ""
    },
    {
        "title": "Sales associate discouraging people from her own company's online store",
        "author": "jamswan",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/63xkr7/sales_associate_discouraging_people_from_her_own/",
        "text": "Today, I went to That Store in order to return 3 pairs of completely new shoes that I had ordered online but did not want due to them being the wrong size. I told this to the cashier after she asked me why I wanted to return the shoes. However, upon hearing my response, she said, \"Next time, just come in to the store to buy your shoes. It's easier for you, for me, and just easier for everyone\" in an extremely judgmental tone. The reason that I buy shoes online at all is because it is easier and usually more convenient for me, the customer. She moved on to reluctantly process the return, pausing to comment, \"You live right down the street! You should really just come in to the store next time\" which, in fact, is not true. I do not live that close to the location; I live about 20 minutes by car away, which is not \"right down the street.\" I do not understand why their online store exists at all with a \"easy\" return policy if when I try to return something, the associate pressures me not to use the website and to just come into the store despite it being more inconvenient than buying form the website. At the end, after making several more comments about the hassle that I was giving her from making her process the return, she informed me that I could not return these shoes in store due to the fact that I had previously selected the \"return by courier\" option on the website. I told her that the email that the \"return by courier\" service had sent as confirmation included a sentence that stated, \"Tip: Prefer to receive your refund right away? Return your purchase in any That Store store. \nFind a store.\" \nwhich indicated to me that I could still return my shoes to the store if I changed my mind. She claimed that she had no choice but to send me on my way with my shoes still in hand. All in all, this was a very frustrating experience that has deterred me greatly from buying shoes from That Store for fear of having to go through this again should I need to return any products.",
        "created_utc": 1491530899,
        "upvote_ratio": ""
    },
    {
        "title": "Yeah, our manager is useless. We know.",
        "author": "BrogerBramjet",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/63wuvd/yeah_our_manager_is_useless_we_know/",
        "text": "So I went to a Big Box electronic store a couple weeks ago and found a sign for... let's call it a \"Bob 6 $NewGameSystem\" Special Edition for $139 - $100 off regular price.  Due to upcoming expenses, I waited.  Today, I went back.\n\n  In the meanwhile, I'd checked online and \"$NewGameSystem Bob 6 Special Edition\" used was selling for $300+.  System but no game.  So I was in for a great deal.\n\n Bought it and brought it home.  Opened up the box.  No system.  Looked closer at the box.  \"Bob 6 **Premium** Edition\".  Available at the local game store for $50.  I saw NOTHING on the box saying game only.  So I went back.\n\n I'm ten feet from the service desk and the clerk speaks into his mic and says \"Manager to CS, Bob 6 again.\"  I explain the situ to the clerk.  Asst. Manager comes up, apologizes, authorizes the full refund, opens the register THEN asks if I'd like to make a formal complaint.  Clerk says he's taken likely the same box back 5-6 times in the last month.  They agree that the sign is misleading.  But their manager won't change it.  They take my complaint and apologize again.\n\n  I'm bummed, but not upset.  I'm even already over it.  But the manager that's trying to get rid of the units (having been around since X-mas) by mislabeling the sign?  Grrr.",
        "created_utc": 1491523062,
        "upvote_ratio": ""
    },
    {
        "title": "Do they actually train you on what to put on the burritos? Why even give them special names?",
        "author": "singuslarity",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/63uctk/do_they_actually_train_you_on_what_to_put_on_the/",
        "text": "I was at one of those fast casual-type chain burrito places, the one with certain sitcom-related menu item names.  I'm ordering for my wife, not me.  I ask for the specifically-named burrito in junior form.  This is the one that has guacamole on it.  I get through the beans/rice/meat section.  The next guy just stares at me.  CE=clueless employee, Me=Me\n\nMe: Yeah, whatever comes on the \"specially-named burrito\" plus cilantro.\n\nCE: You can get any of these toppings on it.\n\nMe: Yeah, I know, it's for my wife.  She wants whatever comes on it, plus cilantro.  That's what she told me.\n\nCE: *Blank stare*\n\nMe: (walks out of line to read the menu board) Shredded cheese and pico, plus cilantro.\n\nCE: (puts in filling and starts to wrap)\n\nMe: Oh wait.  That's the one that comes with guac.\n\nSo he unwraps it and puts guac on it.  I've noticed it's not just this place, but other places where you order in the assembly line form.  Why do the employees not know what comes on the specifically-named menu items?  Why even bother having them at all?  Just put \"regular burrito\" and \"small burrito\" on the menu.  Or \"6\" sandwich\" or \"12\" sandwich\".  Why are you making me go through the trouble of saying whatever goofy named thing I want?  Ultimately it's not a big deal, but jeez, you'd think employees would be trained on how to make specifically-named sandwiches.",
        "created_utc": 1491499121,
        "upvote_ratio": ""
    },
    {
        "title": "2 hours for this?",
        "author": "ahahahahahn",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/63qq8w/2_hours_for_this/",
        "text": "I went to order at this place near me which has 2 for $11 calzone deal online. Got a number higher than the $13.50 it should have been with delivery charge. Figured I'd call in to check it out. Talked to an employee about it, his total came up to over $16. Decided to tough it out and try online again, figuring it was the extra ingredients and it's not that much more money, oh well.\n\nOrdered two calzones, one with added bacon, ranch, spinach, and I changed the cheese (it was the only way on their website I saw to get the ranch IN THE SANDWICH, since there appeared to be no option to do so), the other with just added spinach. No problems there, it'll all show up on the receipt, so it should be easy to make--I worked for years at a pizza place, I know the drill with online orders.\n\nAn hour later, I've heard nothing back except from the automated email service, saying that my order had been received. Figured I'd give them a call to check. Since the place I worked at did special promotions all the time, I knew that it would be a busy night and that my order would take a while, so I was not angry by any means at this point, and they said that my order was out for delivery. Cool.\n\nFast forward another **HOUR**.\n\nThe \"manager\"--whom I found out was the manager through some online digging and whom we will call B--shows up to deliver my calzone. B was a hell of a guy. Not only did B not have the decency to say hello when he got out of his car after I had waited outside for a few minutes longer than he said on his call, but B got impatient with me checking to see if everything was there and warm. Having the experience I have in delivery service, I still gave him a $20 on the $15 order since I know that rainy days as a driver can be stressful, regardless of the fact that I have been an absolute money-saving *fiend* with my study abroad trip coming up this summer.\n\nAt that point, I would consider myself mildly annoyed. But I had food. I ran back upstairs to my dorm where my girlfriend was waiting. We open ours up, start digging in, and she says, \"This is way hotter than I thought it would be..\" Lo and behold, there is hot sauce in her calzone, something which would have been fine, if there had been any chance of even seeing that hot sauce was a part of the calzone on their website.\n\nAt THAT point, I was a bit upset, but I figured that it's a small issue that can be resolved on B's next trip around town--we live in a small college town in Ohio that's basically a grid; it wouldn't be that hard to swing by. So, I gave them a call. I got the same sad soul whom I can only assume got swindled into taking a job at this abysmal location. He eventually leads me back to B, after he couldn't answer my questions directly.\n\nAt this point, I was a bit exasperated, but not *angry*. That was about to change.\n\nMy conversation with B was short, but man did it leave a lasting impression. It went:\n\"I wasn't supposed to have hot sauce on this calzone.\"\n\"I'm not going to argue with you what comes on our calzones and what doesn't, the Cal Zombie has hot garlic butter.\"\n\"Your website does not say that it comes with hot anything.\"\n\"Yes it does, I know what's on our calzones, I'm not going to argue about it.\"\n\nAt that point, I was absolutely furious. So, I hung up, cut my losses, and ate my girlfriend's runny, grainy calzone, instead of my marginally less-disgusting calzone, regret and despair on my teeth.\n\nHonestly, I was just looking for a cheap dinner that I didn't have to go outside to get. But judging from the other reviews of this place, I can't say I'm surprised this happened. B is apparently a horrid manager, the place is a wreck, and the food is only halfway-decent if you're smashed. I completely regret ordering from this place, and I only hope that others can learn from my mistake... and that my food wasn't dropped or spit on for calling in the first time.\n\n[Here's](http://imgur.com/a/jXRT6) some pictures of their sad excuse for a website and the lack of hot sauce mentioned.",
        "created_utc": 1491451784,
        "upvote_ratio": ""
    },
    {
        "title": "REI online sales warning. I received a used gear item from REI in the mail today that was listed as new. • Crosspost: r/CampingandHiking",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/CampingandHiking/comments/63ozpj/rei_online_sales_warning_i_received_a_used_gear/",
        "text": "[deleted]",
        "created_utc": 1491432505,
        "upvote_ratio": ""
    },
    {
        "title": "Rude cashier",
        "author": "superzenki",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/63ogek/rude_cashier/",
        "text": "This was years ago at a big box store. I was doing my normal shopping, I went into a line with a pissed-off looking cashier. Now, I don't judge and I get that something could've just happened to offset your mood. I don't know how long you've been there and assume you don't want to be there. But don't be rude and take it out on customers for asking questions. The whole time, no conversation. No \"How are you today?\" even which I always get there.\n\nWhat really irked me was when I told her I wanted a gift card to purchase, and she said to grab one from behind me (I didn't see them above the candy). Her tone the entire time was just so offsetting.\n\nShe also rudely told someone she wasn't open anymore because her light wasn't on, which I get that is normal. Most of the time it's \"I'm sorry, my line's no longer open.\"\n\nI'm pretty sure she didn't even ask for coupons, or their other rewards cards, which I'm assuming they're supposed to do all the time. Luckily I remembered mine.\n\nI really wish I had followed up with the store or corporate after that but I pretty much just let it slip into the back of my mind because I didn't want it to keep bothering me.",
        "created_utc": 1491426532,
        "upvote_ratio": ""
    },
    {
        "title": "When a Medium isn't",
        "author": "themeatbridge",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/63nhzt/when_a_medium_isnt/",
        "text": "So this one just came to me, and wasn't anything exciting but I figured I'd share.  It was from the cafeteria at my college.  They offered a meal plan which included a sandwich or entree, a bag of chips, and a medium fountain soda.  \n\nIt's my first day, and I have my meal card (thanks mom and dad!) and no cash, so I order a sandwich, grab a bag of chips, and go fill up my soda while I wait for my order.  \n\nNow, there were no signs or labels on anything, so seeing three cup sizes, I grab the middle one and fill it up.  I'm waiting a bit for my sandwich, and I'm sipping away at my soda while I wait.  My order is ready, and I go to the cashier.  I'll be ME and she'll be Etymological Paradox, or EP for short.\n\nI swipe my meal plan card\n\nEP: That'll be $3.50.\n\nME: Oh, I got the meal plan.  Did it not swipe?\n\nEP: Meal plan includes a medium drink.  You got a large.  $3.50.\n\nME: My mistake, but the cups weren't labelled, and I don't have any money.\n\nEP: Why did you get a large cup, then?!\n\nME: I just said, there were three cups, and none had labels.  \n\nEP: You have to pay for the drink.\n\nME: Can I put the chips back and we'll call it even?  \n\nEP: No, you got a large drink, you drank from it, you have to pay for it.\n\nNote that up until this point, I had been nothing but polite.  Yes, I had made a mistake, but I thought it was an understandable mistake given the circumstances I'd described.  She got really angry, and she was so fixated on the fact that I had selected a \"Large\" cup that it raised my hackles and I felt the need to defend myself.  Not to mention, $3.50 for a fountain soda was fucking highway robbery.   \n\nME: I grabbed the medium sized cup.\n\nEP: You grabbed the LARGE sized cup!\n\nME: (pointing to the largest cup) Then what's that?\n\nEP: Extra large!\n\nME: Where is the small cup?\n\nEP: There is no small!\n\nME: Then HOW CAN THERE BE A MEDIUM CUP IF THERE'S NO SMALL?!\n\nEP: MEDIUM IS THE SMALL!\n\nME: DO YOU EVEN HEAR YOURSELF?!\n\n...\n\nWe stared each other down, and my lab partner came up next to me, bringing my attention to the fact that everyone was watching our exchange with quiet amusement.  I asked her if I could borrow $3.50, and everyone went back to normal.  I know I was the asshole in this story, but it still irritates me to this day.  \n\n",
        "created_utc": 1491417640,
        "upvote_ratio": ""
    },
    {
        "title": "My local Pepper Mexican Food has really gone downhill.",
        "author": "Aperson3334",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/63ncyy/my_local_pepper_mexican_food_has_really_gone/",
        "text": "This happened just a few minutes ago.\n\nME = me\n\nFSL = foreign sauce lady\n\nME: …and sour cream. (Pointing)\n\nFSL: Sour cream and cheese?\n\nME: No thanks, just sour cream (pointing again)\n\nFSL: I put a little cheese on, ok?\n\nME: No\n\nFSL: Well what do you want?\n\nSour cream! (Pointing with each word)\n\nShe eventually understood that I didn't want cheese.",
        "created_utc": 1491416366,
        "upvote_ratio": ""
    },
    {
        "title": "Apply for our credit card and get a discount! But you can't use it!",
        "author": "halpscar",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/63iruw/apply_for_our_credit_card_and_get_a_discount_but/",
        "text": "So I'm on with Clothing Retailer right now - online, cause, yknow, that's supposed to be easy. They popup at checkout with the 15% off store card offer, and I'm spending enough to make that worthwhile (oh hindsight, you tricky fool). So I signed up.\n\n\nI bought a house last year, on my own. My credit rating is pretty dang solid, although obviously I have a fairly high balance at the moment, but just for context - I flatter myself that I'm the sort of \"pays bills on time\" customer that is generally underwriting the kind of customers that...don't.\n\n\nIt pushes it all through and I'm preapproved, and all shiny, but I need to change the shipping address (neighborhood dog steals packages, neighbor hides evidence, whole 'nother post) - so I do that, and the order now won't go through. So I get into the live chat, and there is \"nothing they can do\". Can't retrieve card number, can't cancel card, \"call the bank issuing\" (she provides two toll-free numbers, I ask which one, provides a third. Seriously?!). Issuing bank obviously can't do anything until the physical card and accompanying bumf arrive, in 7-10 business days. Too bad.\n\n\nIt took 30 minutes of roundabout \"seriously, there's nothing we can do\" from the customer service gal, and me insisting to escalate, (CSR: \"but they can't do anything either\") to get even an attitude of helpfulness - the supervisor was professionally nice, whereas the initial CSR only barely made it to professional, IMO. \n\n\nI have a promise of waived expedited shipping, which is what I was going to use the card discount to underwrite, so if that works out it evens out, but I'm SUPER annoyed I fell for the \"preapproval/get instant discount\" bull, especially if the system is going to bork up like it did (I had already entered the alternate shipping address prior to the card application, so it overwrote that, so helpful). I worked retail for years and almost never complain, although I find the older I get, the less crap I'll put up with. You want my business? MAKE IT RIGHT. That card is getting canceled the minute it gets here, which is too bad for them as I just got an office job after working in an outdoors environment - I used to spend a lot with them during my last office stint, but I have a hard time thinking that the premium one pays goes toward a higher level of service.",
        "created_utc": 1491358523,
        "upvote_ratio": ""
    },
    {
        "title": "My dead sister in law is spamming people",
        "author": "YoudownwithLCC",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/639xji/my_dead_sister_in_law_is_spamming_people/",
        "text": "I've had a lot of bad experiences while shopping and whatnot but I'm also incredibly patient and I just try to look on the bright side of things. I guess all the pent up frustration I didn't realize I had, had to come out sometime.\n\nMy sister in law passed away very young at 35. She had cancer but everything was so quick we didn't really have time to prepare ourselves and we were still in shock and in the throes of grief. She was seriously the best person ever but I digress. \n\nShe was never married and since my husband and I were her beneficiaries, we took all the steps to cancel her accounts with everyone. About 2 weeks after her funeral, my mother in law got a message from an aquantaince telling her that she has gotten a few emails from SIL that are obviously spam but nevertheless shocking to get from a dead girls email address. My mil is still distraught at this point so I tell her I'll take care of it. \n\nI don't even know what the company is but my sister was into gaming and sci-fi and it appeared that an account she had set up with someone had just randomly started sending spam. Which is weird and shady to begin with but then I couldn't find a number to this place that is apparently in Australia so I had to live chat. Our conversation went a little something like this.\n\nMe- Yes, my sil has passed away and her account is sending spam. I need to get that shut down. \n\nWeird Company- Okay, what is her username and password?\n\nM- I honestly have no clue, we don't even know what company this is. We just have started getting complaints that her account is spamming people and for obvious reasons this is disturbing.\n\nWC- (to their credit they tried to be somewhat understanding) Of course, I'm sorry for your loss. I need her username and password to look into this. \n\nM- Like I said, we don't know this information. I can literally give you anything else. I have her email address, name, phone number, etc. I just need the spam to stop. \n\nWC- Well, Unfortunately we have no way to look it up other than the account name and password. \n\nAt this point I'm getting heated. \n\nM- What do you mean you can't look it up any other way? Why are you sending spam from someone's account in the first place? This is unacceptable. I'm trying to take care of this so my mil doesn't have to hear about her dead daughter sending emails from beyond the grave. This is incredibly disturbing. She just died. Do you understand? We have lost a loved one and you are sending emails from her account. What is wrong with you people?\n\nWC- Of course, I understand. What is her name and email address? \n\nAt this point I'm fuming and I have no clue why they tried to give me the runaround. I don't even know if they actually did anything but they told me to contact them again for further issues. No one has mentioned it again so I guess they could just use her email. ",
        "created_utc": 1491256207,
        "upvote_ratio": ""
    },
    {
        "title": "Sales guy lost a deal because of the delivery guys and their truck \"breaking down\"",
        "author": "RobbyTheRedneck",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/639jzn/sales_guy_lost_a_deal_because_of_the_delivery/",
        "text": "I purchased one of those overpriced air beds you see advertised on the tv.\n\nAfter waiting weeks after the purchase, it was the day for them to deliver. \n\nI disassembled my current bed and waited.  Though I was never contacted to confirm delivery, I did call the morning of to find out  was scheduled for a 3 pm slot.\n\nSo I wait. And wait.  At 3:04, I'm on the phone, on hold, to find out where delivery guys are.  At 3:24, I get a call on the other line to hear that my delivery is being scratched and they will be out after the weekend ends (it was a Friday).  At this time, the other CSR has me live and he can hear me ranting about delivery has to be today or I will have to reassemble the bed and I'm not going to take it down twice.\n\nThey explain that the delivery truck is broken and they can't get it fixed.   I tell them that in. Y line of business, you have contingency plans and that one plan is to have a rental go there to offload the broken truck and make the delivery.  I give them a couple of hours to figure it out and ask to be called back to determine if they can make it or not...as I have to spend hours reassembling the bed.\n\nI wait another 90 minutes.  They tell me Monday.  I cancel the sale.\n\n/because I never took delivery, there was no charge, no restocking fee, no freight, etc.\n\nI feel that I dodged a huge bullet.\n\n//current bed is a soft side waterbed that takes 1.5-2.5 hours to set up,\n",
        "created_utc": 1491253222,
        "upvote_ratio": ""
    },
    {
        "title": "Last night's Waiter",
        "author": "OSUpdt24",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/633lvt/last_nights_waiter/",
        "text": "*Warning, this is a little long*  \nMy wife and I have had an unusually lucky night last night.  \n  \nTo start with, we went to the local watering hole, to partake in some adult beverages before going to the movies, hashtag datenight. We were blessed to receive a free beer from the bartender as it was the last of the keg.  \n\nFast forward to dinner.  We were supposed to see a movie but it was sold out for the time we picked out, so we opted for the later time.  We had time to kill so we went to dinner at a fav restaurant close by. As soon as we were seated, we were immediately drawn to how loud, drunk, and obnoxious the 5 top right next to us was being.  We were not put off, as this would lead to a good amount of enjoyment in how ridiculous they were being. Our waiter was also their waiter, and boy could we tell how taxing that table was to him, even though he did not show it.  Anyways to summarize, not only him having that bad table, our drinks were late by about 10 min, as well as our appetizer and main course were the same delay, to no fault of his own.  \nOnce our food finally arrived, not too much later the drunk table left.  I had finished my beer and the waiter asked if I wanted another, I said sure!  He brings me out a different beer than what I ordered, said the bar was still backed up so the different beer was quicker and this one was on the house.  Second free drink of the night!  He then proceeded to apologize for the table and the wait, and we told him, you don't have to, he was doing a great job and it was not his fault.  He then told us how taxing that table was and how crappy they had been.  \nAs we are getting ready to pay, he brings out 2 pint glasses, and says thanks for understanding and these are yours to keep.  Needless to say we gave him a great tip for being such an awesome waiter.  As we are leaving, he stops us and says, \"Are you guys fucking with me?\" &lt;in a good way lol&gt;  We told him how great of a job he did, and that he deserved the tip for the shitty night he had, and for making ours great.  He then gave us hugs, and we parted ways.   All in all, that dude made our night amazing.  \n\nTL;DR Two free drinks, two free pint glasses, he made our night, we hopefully lifted his up.  \n  \n*EDIT:* Formatting",
        "created_utc": 1491181825,
        "upvote_ratio": ""
    },
    {
        "title": "A Tale of a Fellow Customer",
        "author": "TheThingintheCircle",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/632779/a_tale_of_a_fellow_customer/",
        "text": "I am still furious about this, though it happened a few hours ago, so perhaps writing it out will be cathartic. One always hears awful stories about customers from hell, but today I had the misfortune of witnessing a woman go from 0 to 10,000 and then be rewarded for her tantrum. \n\nI was visiting my friendly neighbourhood red store and, to my surprise, given my usual bad luck, I happened to find a couple things to try on. Upon reaching the fitting room desk, I paused to let a woman with a cart cut in front of me, as I am fairly she she'd have squashed me flat otherwise. I then had the pleasure of seeing her turn from seemingly mild-mannered grandmother to harridan upon being told, very politely, that unfortunately carts were not allowed in the fitting room. Well, this did not sit well with the Harpy from Hades, who simply *had* to be outside of her thirty-year-old daughter's fitting room. Apparently, from her tone and how nasty she was, it was some affront to her dignity—if she had any—not to break the rules for her.\n\nI told her quite sharply as I entered my own fitting room that she should be nicer, and to my delight it rankled her and she shrieked at her daughter that \"some girl told me I should be nicer!\". They were gone when I emerged, but by some strange twist of fate, half an hour later we ended up at the registers and at the next one over was....yep, the fifty-year-old woman who felt it necessary to berate two young women who had been nothing than polite and were simply doing their job. And, surprise surprise, she managed to get a $10 gift card, which was probably her intent when she threw her despicable fit. It nearly killed me to see someone be rewarded for that unthinkable behaviour, but sadly this seems to be the norm to appease customers who are not remotely in the right.\n\nI made sure to talk to the manager to be sure they knew those poor young women hadn't done anything wrong, but I am even now, hours later, aching to give that hateful shrew a bigger piece of my mind. ",
        "created_utc": 1491166679,
        "upvote_ratio": ""
    },
    {
        "title": "I can never go back",
        "author": "turtlessayrawr",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/631fu0/i_can_never_go_back/",
        "text": "About a week before my brother was heading to Fort Benning for basic, we decided to head to lunch before picking up our stepmom from work. We went to a nearby casual sit-down, were given waters, and started to peruse the menus when my brother's phone rang. \n\nLong story short, we *really* lost track of time and were late picking up our stepmom. \n\nOur server came by to take our orders and my brother said \"we're so sorry...something just came up and we can't stay\". She assured us it was okay and we asked what we owed for the water. She playfully nudged my brother with her elbow and said \"only a million bucks\".\n\nWe felt so bad, we pooled our loose bills and left $5 as a tip, wishing we could have left more just because of how much of an inconvenience we felt it must have been for her. Given that it was a school day afternoon, the place was dead as a doornail.\n\nIt was over a year ago and I still feel terrible. ",
        "created_utc": 1491159120,
        "upvote_ratio": ""
    },
    {
        "title": "Stores that sell you things by exploiting your insecurities are the worst.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/62xawa/stores_that_sell_you_things_by_exploiting_your/",
        "text": "[deleted]",
        "created_utc": 1491100587,
        "upvote_ratio": ""
    },
    {
        "title": "The Schizo",
        "author": "Gehenna64",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/62x0p0/the_schizo/",
        "text": "[removed]",
        "created_utc": 1491097091,
        "upvote_ratio": ""
    },
    {
        "title": "Scales at a store now have 3 decimal places. God help us all.",
        "author": "Persona_non_gratar",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/62m21d/scales_at_a_store_now_have_3_decimal_places_god/",
        "text": "Not a tale.  An observation.\n\nWhen I go to the deli section I'll ask (as an example) for about 2 pounds of cheese.  The exact amount isn't important for lasagna.  The people behind the counter try to get the amount as close to 2.0 pounds as possible which to me is a waste of time.\n\nBut I know why the deli people are hyper-sensitive to ensuring that they weigh out the *exact* amount that the customer asked for since some customers freak out if the amount isn't precisely what they asked for.\n\nWhich leads to me to the advent of scales in food stores that have 3 decimal places (e.g., 3.001).\n\nI haven't seen a scale (actually, knife edge balances) with 3 decimal~~s~~ places from the time I worked in an analytical laboratory (some scales had 4 decimal places).  These scales were kept in a humidity controlled environment.  As you're weighing something, the weight is increasing or decreasing as the chemical is absorbing or liberating moisture so we had to follow procedures to ensure that we had accurate and precise measurements.  \n\nBack to the deli section.  I imagine that there will be a bunch of incidents where the customer is going to blow a gasket when they see the weight of the product changing as the food is sitting on the scale.  \n\nI genuinely feel sorry for the clerks who have to deal with irate customers who want (and can never get) exactly 3.000 pounds of wet meat.",
        "created_utc": 1490975994,
        "upvote_ratio": ""
    },
    {
        "title": "Overly enthusiastic cashier pushing a charity while I'm fumbling with ApplePay [SFW]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/62lngs/overly_enthusiastic_cashier_pushing_a_charity/",
        "text": "[removed]",
        "created_utc": 1490972103,
        "upvote_ratio": ""
    },
    {
        "title": "A nice Christmas surprise",
        "author": "dannyg1019",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/62lljl/a_nice_christmas_surprise/",
        "text": "Look, I know Christmas was a while ago now, but I just found this sub and would like to share this story.  Okay? Okay =).\n\nSo I always try to do something small around Christmas as a random act of kindness.  One year it was leaving $20 with the cashier at a convenience store to use for other's purchases, stuff like that.\n\nSo last year I decided to do the \"Pay for the meal behind me\" in the fast food drive through.  So, I pull up to pay and I ask if they can also put the next order on my bill, and the drive through worker lights up and says that she's always wanted a customer to try this!  She tells me she has to ask her manager, and comes back a minute later and hands me my receipt, complete with the other persons items on it (it was a kid's meal too!  That made me feel even better!). \n\nSo I get home and break into my yummy life-ending burger and fries and start to think that my bill wasn't as high as I thought it would be.  Looking back at the receipt I realize I ONLY paid for the person behind me!\n\nI went back the next day to the same cashier and asked if that was a mistake.  \"No\" she said, \"That was our Christmas gift to you!\".  Cue all the feels and loving all the people that work there! \n\nEdit- names removed",
        "created_utc": 1490971554,
        "upvote_ratio": ""
    },
    {
        "title": "Cashier proves compassion is alive and well",
        "author": "imisscrochet",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/62irtq/cashier_proves_compassion_is_alive_and_well/",
        "text": "Before taking my 9 year old daughter shopping today I explained that we had $10 to purchase tonight's dinner, tomorrow's lunch, and a gallon of milk. I explained that there was no money for extras. So of course she behind playing for candy as we are standing in line at the deli.  I calmly repeated my explanation that we did not have enough money for candy tonight and she had some at home. She, of course persisted for several minutes while I continued explaining that it just was not in the budget and she would understand when she grows up and has to make these decisions herself. \n\nThe cashier was super nice, didn't say a thing. It wasn't until I was paying that I realized she gave me a deep discount on my food. It really touched me that she would help out a total stranger like that. You see, what she couldn't have known is the reason my budget is so tight this month.  My mother and brother died unexpectedly leaving me to pay all of their final expenses out of pocket. It has been a very difficult month, but small kindness like this help a lot. Thank you stranger for brightening a dreary day!",
        "created_utc": 1490929504,
        "upvote_ratio": ""
    },
    {
        "title": "[UPDATE] The night I was towed...",
        "author": "dudenell",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/62en1d/update_the_night_i_was_towed/",
        "text": "**Original:** https://www.reddit.com/r/TalesFromTheCustomer/comments/604o6f/the_night_i_was_towed/\n\n**TL;DR from the original:** Got towed while purchasing a burger from a *large burger corporation*, manager on duty refused to help me out.\n\n**Update:**\nI called corporate on Monday, knowing full well that the call would be recorded and go back to the franchise owner.\n\nI apologized to the franchise owner for yelling at his employees, but explained that I felt wronged in the situation.\n\nHe mentioned that he reviewed the video and he didn't believe the timelines matched up, but that he didn't want to waste anymore time on it and we agreed that he would pay for the tow.\n\nIn the phone conversation he asked for the receipts, I mentioned I sent a demand letter and he got a bit pissed at finding that out (was preparing to sue in small claims court).\n\nAnyways I got a money order for the tow yesterday, so I'm considering the manner resolved, and I will be avoiding all of *large burger corporation* businesses going forward.",
        "created_utc": 1490887704,
        "upvote_ratio": ""
    },
    {
        "title": "Top 6 Ways to Improve Customer Service",
        "author": "michaelcfd",
        "url": "http://www.trainingzone.co.uk/community/blogs/alice-jackson/top-6-ways-to-improve-customer-service",
        "text": "",
        "created_utc": 1490877634,
        "upvote_ratio": ""
    },
    {
        "title": "Wrong order but right price",
        "author": "whitethundar",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/62b3q7/wrong_order_but_right_price/",
        "text": "*this is a mom &amp; pop burger place*\n\nI actually frequent this place a lot. They have a 0.99 hamburger with purchase of a regular priced item. So, I usually order small fries with 2 hamburgers. But the Cashier punched in \"chili fries\" and 2 hamburgers instead. I'm not a good at confronting people and there were a lot of people behind me so I just let it be. \n\n*they're known for their chili fries*\n\nThey serve their phone call pre-ordered customers first. So, I ended up waiting 30+ minutes. I'm thinking I hope they didn't forget my order. Which they did. But one of the manager knew I was regular and had always ordered the same thing knew \"chili fries\" isn't something I ordered when she looked at my receipt. Asked me if that's what I ordered, I said \"No, but it's ok.\" She comes back with a large drink AND a $20 visa gift card! ",
        "created_utc": 1490838665,
        "upvote_ratio": ""
    },
    {
        "title": "The time the gift card worked too well",
        "author": "TheTravellingSoul",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/629cso/the_time_the_gift_card_worked_too_well/",
        "text": "Another post reminded me of this, happened a few months ago. On mobile who knows what i am doing.  \n\n  \nMe and a friend went to a cookie place here in the uk, asked for like 20 cookies, cause we are greedy and why not.  \n\n  \nAnyway when it came to paying my friend had a gift card which we handed over, the employee swore out loud and gave a look like we had just murdered a dog. She apologised and said she wasn't sure how they worked, but took it to the till did something with it and handed it back.  \n\n  \nWe were surprised when she gave the gift card back, but we didn't know the amount so maybe it had a few pounds on after the transaction. She was insistent giving the card back too.\n\n    \nIt had the full amount still on it (we went to another store of the same famous brand cookie place and asked) i still don't know why she gave the card back and not retained it, but free cookies, thank-you cookie fairy.\n\n  \nYes we ate all the cookies before the day ended, i regret nothing.\n",
        "created_utc": 1490820412,
        "upvote_ratio": ""
    },
    {
        "title": "All the attitude because of a gift card",
        "author": "Devilishtiger1221",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/625d35/all_the_attitude_because_of_a_gift_card/",
        "text": "Last night my friends and I decided to blow off steam by going to grab food. We happened to end up at a place I had received a gift card for. Upon handing it to the server (with my debit card to cover the rest), she scoffed and stomped off. \n\n\nAs she is running the ticket thru the system, we hear her say to her coworker 'I wonder if they could only afford this dinner because of this gift card. I bet they won't even tip me.\"\n\n\nI understand that waitresses get stiffed by people and sometimes you have preconceived notions about people but if you are within hearing distance of the customer I advise you shut your mouth. Your 30% tip just went down to 15 with an email to your manager about what I over heard. ",
        "created_utc": 1490775142,
        "upvote_ratio": ""
    },
    {
        "title": "Hisense and 3 Broken TVs",
        "author": "Michael_Scotts_Tots",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/622crj/hisense_and_3_broken_tvs/",
        "text": "[removed]",
        "created_utc": 1490736546,
        "upvote_ratio": ""
    },
    {
        "title": "Hisense and 3 Broken TVs",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/622a4t/hisense_and_3_broken_tvs/",
        "text": "[deleted]",
        "created_utc": 1490735809,
        "upvote_ratio": ""
    },
    {
        "title": "the hardest call center job?",
        "author": "[deleted]",
        "url": "http://nymag.com/thejob/2017/03/the-911-operator-who-works-the-graveyard-shift.html",
        "text": "[deleted]",
        "created_utc": 1490719442,
        "upvote_ratio": ""
    },
    {
        "title": "This Faire Is (almost) On Fire.",
        "author": "kellirose1313",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/61zzzx/this_faire_is_almost_on_fire/",
        "text": "[removed]",
        "created_utc": 1490714695,
        "upvote_ratio": ""
    },
    {
        "title": "Clipping Path Service {1000x700}",
        "author": "mrsohrab",
        "url": "http://imgur.com/a/8rn1S",
        "text": "",
        "created_utc": 1490713982,
        "upvote_ratio": ""
    },
    {
        "title": "customer service in a long project cycle, help!!!",
        "author": "power1024",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/61zi2g/customer_service_in_a_long_project_cycle_help/",
        "text": "[removed]",
        "created_utc": 1490709645,
        "upvote_ratio": ""
    },
    {
        "title": "Macy's worker tells all...",
        "author": "[deleted]",
        "url": "http://nymag.com/thejob/2017/03/the-department-store-worker-who-laughs-at-clothes-cost.html",
        "text": "[deleted]",
        "created_utc": 1490640379,
        "upvote_ratio": ""
    },
    {
        "title": "Party of three",
        "author": "daviiiiiid",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/61pnjt/party_of_three/",
        "text": "So my friends and I meet for brunch at a new place that opened just a few days before we went.\n\nI understand that some of the staff my not be 100% aquainted with their environment and potentially not a lot of experience.\n\nWe get there on their first weekend morning, the place is packed. We go to the hostess counter to tell her we're a party of 3. She marks us down and we wait for our table. After a while, we notice some larger groups that came after us were being seated before us. So we ask this hostess if we're up soon. We really can't hear what she is saying. She is not mute but there is only a faint whisper coming out of her mouth. We asked her to repeat once but we still couldn't hear and since she looked stressed out, we just nodded and let her back to work and we'd wait a bit more.\n\nThen it came to an unreasonable amount of waiting that we went back to the counter and the other hostess says that our table was ready for a while already. She asks the quiet hostess why she hasn't seated us. She suddenly finds her voice and tells her that that is a table for 4 and that we're only 3.\n\nThis restaurant only has small tables for 2 that can be put next to each other for larger parties, or booths for 4 or 6. They don't have any tables for 3.\n\nI guess she was waiting for a new triangle shape table to show up..",
        "created_utc": 1490582341,
        "upvote_ratio": ""
    },
    {
        "title": "Witnessing a major shop lift",
        "author": "iftreescouldspeak",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/61oglk/witnessing_a_major_shop_lift/",
        "text": "I've worked in retail since I've been old enough to get a job, so about 10 years ago. My current job is the first job I've had that is not retail related, but I still use my retail skills in everyday life. \n\n\nThose who have experience know when you go out, you subconsciously scan people. Especially in check out lanes. You notice their movements, and you just know when you're looking at a shop lifter. \n\nWell today, I had the day off. I decided today was a good day to dye my hair! So I head off to \"beauty supply store\". I've got all my items and am standing in line waiting. This store keeps all their clippers behind the counter, and they're really expensive. Two men walk in and start asking to see them, one of them pretends to be on the phone. The other walks around the counter and starts looking at the ones on the edge, particularly the most expensive pair. His friend tells him to get out from over there and starts joking with the cashier (getting her guard down) about it. The guy behind the counter asks to look at it. She takes it down along with two others they wanted to see. They start asking questions, and the cashier told them to hold on because the other cashier (who had a long line) knows more about them. They hang around for a few minutes, then bolt. \n\n\nMy first instinct was to drop my stuff and run outside to get a description of their vehicle and hopefully a plate number. As I'm running out I'm start thinking \"wow this is dumb. I shouldn't have done this\" so I kind of hesitated and just got the vehicle description and the first 3 letters of the plate. I hung around to be a witness (the cops took an hour to get there). \n\nThe cashier showing the clippers started having a panic attack, she was convinced she was going to get fired. I mainly hung around for her benefit, because there was nothing she could do. She did as she was trained. She didn't leave them unattended, she answered their questions. They just ran. \n\nANYWAY, that's my big story of the day!",
        "created_utc": 1490567900,
        "upvote_ratio": ""
    },
    {
        "title": "My local retro gaming shop",
        "author": "jamiegandolf",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/61d487/my_local_retro_gaming_shop/",
        "text": "It's kinda cool having a little retro gaming shop nearby my house. They also sell new games but I never think of them when a new game comes out.\n\nBut today we passed by and I wanted to go in.\n\nI thought it was a stupid question to ask but I asked anyway\n\n&gt;Me: Do you guys have any Nintendo Switches?\n\n&gt;Cashier: Mhm.\n\nShe pointed above her head on the shelf behind the counter and there stood 4 unopened boxes. The shit was glorious. I had never seen one in person because all stores nearby are sold out. Then I saw the price tag...\n\n**$399.99???**\n\n&gt;Cashier: Oh yeah, cause everyone is selling them for $400. Check on Amazon and Craigslist.\n\nI contemplated paying $100 extra for something that will likely be in store in a few weeks. I decided to be patient and wait. I don't even like Zelda anyway.\n\nI found Horizon for PS4 and decided to get myself a new copy along with 2 other used games.\n\nCashier brings out a sealed blue PS4 box\n\n&gt;Cashier: We only have this one Spanish copy. The box is in Spanish but the game is in English.\n\n&gt;Me: Huh? Uh...no, thanks, I'll just go to GameStop and get it.\n\n&gt;Cashier: Oh! Wait! We do have an English copy.\n\nReally... Now you do?\n\nI'm starting to see why this store never really took off and why I don't see a lot of customers. Thank God for competition.",
        "created_utc": 1490405769,
        "upvote_ratio": ""
    },
    {
        "title": "Manager told me that I made her day!",
        "author": "CaraMiaFire",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/618sty/manager_told_me_that_i_made_her_day/",
        "text": "I don't work retail, but I spent years doing customer service, and scheduling employees who did customer service, so I'm familiar enough to know to not be \"THAT\" customer. I always want to be the one they have a nice story about, not a bad one, ya know? I know that managers usually just get crap, so when an employee goes out of their way for me, or is super friendly, or remembers me, etc, I will often mention that.\n\nSo the other day I was in a local coffee chain, and the girl helping me was wonderful, fun and bright and just chatty enough, but not over the top. We talked about glasses for a minute (we both wear glasses, her's were cute, and I said so), and after I moved to the end to wait for my drink. The manager was standing near the register when I was leaving and she looked all frazzled and her arm was in a sling (I knew it was the manager, she had that look and was dressed differently), so I smiled and told her that I thought the girl at the register was great, really friendly and good at her job. The manager was all shocked... She couldn't believe it, said I made her whole day, she smiled so bright! As I was leaving, I saw her go over to the girl who had helped me, and I could hear her start the conversation by saying she got a compliment, then I was out the door. But I have to say, I felt just as good walking out as I bet the manager and that young girl did.\n\nIt's so easy to take one minute to be nice, and it makes *everyone* involved feel good. I do this fairly often, but I need to remind myself to do it more. I now have my boyfriend doing the same thing, he never used to compliment for good service/retail experience, just complain about bad ones. But I've seen him make compliments a few times now, I'm so proud of him for that.",
        "created_utc": 1490360759,
        "upvote_ratio": ""
    },
    {
        "title": "Boohoo.com - problems with returns (Australia)",
        "author": "LibraryLuLu",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60xqzy/boohoocom_problems_with_returns_australia/",
        "text": "[removed]",
        "created_utc": 1490219858,
        "upvote_ratio": ""
    },
    {
        "title": "The time my dad threw a milkshake at an employee",
        "author": "KJBenson",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60sm6h/the_time_my_dad_threw_a_milkshake_at_an_employee/",
        "text": "On mobile, sorry if formatting isn't good.\n\n\nSo I was at [frozen lactose lady] with my dad several years ago. I used to work with him and sometimes after work we'd grab some food from a drive through on our way home.\n\n\n\nThis one time we decided we were going to grab some milkshakes and ended up waiting in the drive through line for a while (I'm thinking it must have been a new employee or something working the drive through because it was kind of slow).\n\n\n\nWhen we finally got up to the microphone to make our order it sounded like the kid on the other end could care less if he got our order right. We had to repeat it to him time and time again, and he was all like \"so you want X?\" And my dad was all like \"no! I very clearly said Y!\"\n\n\n\nEventually it seems he got our order figured out so we moved forward ready to pay and enjoy it delicious shakes.\n\n\n\nWhen we got up to the window it turns out the kid had got our order all wrong. You could see the rest of the staff frantically running around trying to take care of the huge back up of customers they were having, no idea why they had this chump on the till. So anyways, we cleared up what exactly it was we wanted for our order and some girl in the back made up our shakes as fast as she could. When she put it on the counter she told the newbie to put lids on the shakes and with that she went back to work elsewhere.\n\n\n\nSo this kid just sets the lids on top of our cups, doesn't even try to push it down and secure it.  My dad points this out to the kid and is all like:\n\n\n \"hey, could you secure those lids? They're going to spill as soon as you hand them to me?\"\n\n\nThe kid, clearly ignoring my dad, just goes right ahead and hands us the shakes one at a time. First he hands mine into the car, it makes it safely into my hand where I can secure the lid. Next he tried to hand my dad his but as it reached my dads hand the kid squeezed the cup slightly and the lid popped off and started to drip all over my dads lap and hand.\n\n\n\nHe instinctively threw it right in the kids face which for once wasn't all doe eyed but fully alert.\n\n\nWe paused for just a second while everyone processed what had happened.\n\n\n\nAnd then he just drove away without a word.  I feel kind of bad for the kid, but at the same time he could've just payed even the slightest bit of attention.\n\n\nOh, and my shake was delicious, it was root beer flavoured.",
        "created_utc": 1490156940,
        "upvote_ratio": ""
    },
    {
        "title": "You had only one job.",
        "author": "[deleted]",
        "url": "https://i.reddituploads.com/c0b09468bf794096974232bd674d1fd6?fit=max&amp;h=1536&amp;w=1536&amp;s=c5f052b4f34222dc37f72dfb163ff207",
        "text": "[deleted]",
        "created_utc": 1490129580,
        "upvote_ratio": ""
    },
    {
        "title": "I'm really happy for you, and Imma let you finish, but Marigold12 is the worst tipper of ALL TIME.",
        "author": "Marigold12",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60piuf/im_really_happy_for_you_and_imma_let_you_finish/",
        "text": "Today I learned that I am essentially a piece of human garbage. I think I always had suspicions, but today was the epiphanic manifestation of that suspicion being confirmed.\n\n\nFor starters, I'm a bartender. That means I get tips and tend to carry cash on me so that I can spend the money on goods and or services. Being a bartender also means that sometimes I use sharp objects like knives, and on this particular weekend I had been using a corkscrew for a bottle of wine, because apparently I'm too big of a pussy to cut myself with something that isn't fucking embarrassing to be cut with.\n\n\nA couple days later I'm in line for a restaurant. One of those order-up-front and get the food brought to you type of places. You're familiar with them. So I'm ordering, making small talk with the waitress about her job, and what I should get, and things are going fine. She suggests something to get, and I take her up on it at this point its standard procedure because I'm capable of operating like a normal human in short stints.\n\n\nI figure, this girl is being so helpful maybe I should give her a tip. Why not, you know? What the worst that can happen? I reach into my back and feel a dollar left from one of my bartending gigs. Perfect. I drop the dollar into the tip jar.\n\n\nApparently the texture of a U.S. standard dollar is surprisingly similar to a bloody band-aid that you may have left in your pocket after you cut your finger on a fucking corkscrew. I learned this in the exact way you would imagine that I learned this. The look in her face when she saw that crusty band-aid resting like a newborn on top of her hard earned tips will haunt me until the day I die.\n\n\nWhat's worse is it was one of those vase jars with the skinny neck so I couldn't even dive into the jar with my hand to fish it out for her. I just stared at it like it was a Salvador Dali painting or some shit, trying to figure out how my existence had brought me to this point.\n\n\nI couldn't think of anything to say that would get me out of the awkwardness that I was feeling, so I just said the best thing my mind could come up with:\n\n\n\"That's a band-aid.\"\n\n\nShe nods. I debate plunging myself into the traffic outside. I figured I could either wait for my food and get poisoned, or leave. So I just left. I turned around and walked right out the door. I didn't even care that I had already paid for my food. Then I went home and showered like I was trying to wash away my sins. My guilt. My shame.\n\n\nTL;DR: Tipped a girl a bloody band-aid because I don't belong on this planet.",
        "created_utc": 1490122664,
        "upvote_ratio": ""
    },
    {
        "title": "Retail Revenge feels SO good.",
        "author": "TollyMune",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60p38u/retail_revenge_feels_so_good/",
        "text": "First time poster, not a long time reader but long over at tales from retail. I'll read here more. Promise. \n\nApologies in advance for formatting. I am on my phone. \n\nSo a few years ago, I was in one of my favorite stores. It's a small store, so when they're busy, the register line cuts right through the middle of everything. I'm in a line maybe 8  people deep. \n\nA newer employee, fresh out of holiday training, is doing his best to chat with customers in line and upsell a bit. As a regular there, I love chatting new product with employees. I knew I wouldn't want to purchase anything else, but the grandma/granddaughter duo in front of me are showing interest, so it becomes a little group convo in line. Very friendly. The grandma decides she wants some lotion that the employee was selling, and takes the container from his hands and continues waiting.\n\nDisaster strikes. \n\nI'll be M. Grandma Crazypants can be GC. And introducing..... timid cashier (TC)!\n\nBackground on TC: she is the tiniest employee there, and is a favorite among all of the regulars. She's just one of those \"so cute I want to put you in my pocket\" dainty types. \n\n\nSo GC opens the lotion she plans to buy and rubs it all over her hands and arms. Whatever. It's in your basket. You're buying it.\n\nWrong. \n\n&gt; GC: I don't want this. \n\n&gt; TC: oh, no problem. Just so you know for the future, all of our products have testers available. Next time you want to try something, just let us know and we will get it! \n\n&gt; GC: WHAT?? What did you just say to me??\n\n&gt; TC: (alarmed, confused, kind) just that we have open products you can try at any time. Once a product is opened or taken home by a customer, our company policy dictates we have to throw it away for safety.\n\n&gt; GC: are you saying I'm dirty??? THAT MAN GAVE THIS TO ME!! (points at the employee from the line) \n\n&gt; TC: it's totally fine, I was just letting-\n\n&gt; GC: LISTEN B----. I want your name, your manager, their name, and I want it f&amp;&amp;&amp;ing now. \n\nEnter manager. She sees me, asks the customer for whay happened. The whole time I am blatantly shaking my head at the wrongness of GC. \n\n&gt; GC: This rude little b//// told me a product I touched was tainted!! I have never been treated so rudely. And I have been a retail manager for 30 years!!(....sure you have.) I want her name and I want your name and I want your district managers cell phone number!!\n\n&gt; manager: Well I am sorry you were unhappy with your service today... \n\n&gt; GC: yes! This rude little b////- \n\n&gt; M: ENOUGH. You're the one being the f--ing b-----. No one gives a f----. You did something wrong, get the f### over it.\n \n&gt; GC:  well I am never shopping HERE again! \n\n&gt; M: good f---ing riddance, b---. \n\n\nShe and her very embarrassed granddaughter walked out, and TC burst into tears and came and hugged me. \n\nThe next year, I applied for a seasonal position and got it. In training, a returning seasonal asked of i was the regular they had heard about who \"flipped on a b----\". \n\nThe training manager said, \"yes, and it was epic. But we really don't encourage that while you're employed.\" ",
        "created_utc": 1490118506,
        "upvote_ratio": ""
    },
    {
        "title": "Locksmith Ellicott City MD- Locksmith Near Me 21043",
        "author": "lurleneqpkarmel",
        "url": "http://asecurelocksmith.com/locksmith-ellicott-city-md/",
        "text": "",
        "created_utc": 1490059870,
        "upvote_ratio": ""
    },
    {
        "title": "Now Hiring /Soon Firing",
        "author": "UserAccountDisabled",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60jm8q/now_hiring_soon_firing/",
        "text": "There's a diner in my town. Great place, great staff, great food, etc. \n\nThe general manager is a really fun, down to earth person. I usually sit at the end of the counter near where he and the servers congregate, we can crack jokes and share a laugh. \n\nLast week I get there and out front there's a big banner hanging out front: NOW HIRING\n\nI said to the GM, \"So the banner. \"Now hiring\" means, \"might be soon firing\". \n\nHe smiles, laughs, and says, \"Glad you said that, because I can't.\" ",
        "created_utc": 1490047627,
        "upvote_ratio": ""
    },
    {
        "title": "Customer vs Customer",
        "author": "UserAccountDisabled",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60jk18/customer_vs_customer/",
        "text": "There is a local car wash, when you get there they have two lanes to get in: one is \"exterior and interior\". Next to it is \"exterior only\".  The former typically has several cars in line, the latter is almost always empty, no wait. \n\nWhen there are enough cars in line in the first lane, it backs up to where the lanes turn at a right angle, and often the last car in the line will just be diagonal across both lanes. If there's enough room for them to pull forward out of the way, a quick two beep on the horn and the pull forward. \n\nI pull up in the exterior only lane, no waiting, six cars in the other one. Some guy is across the lane. Beep beep. There is easily 10 feet of empty space in front of him. Pulls forward a couple of feet, still in the middle. Beep beep again, nothing. \n\nGive him a somewhat obnoxious two or three second continuous beep. \n\nHe looks around, and I'm betting he thought there was this empty lane and he didn't need to wait in line. Didn't read the very large signs - more than one - explaining the layout. \n\nSo he whips in front of me and pulls to the front.  I follow. He has a convo with the service person, who seems to be explaining for a while - as if he's telling this guy three times. \n\nSo the guy finally throws his hands up in frustration, is saying something to the service person, and pulls forward to go around and get in line again. \n\nBy then, there are two more cars in the line he was in. \n\nI pull forward, say hi to the service person (I go there two or three times a week so I know all of them, and have helped a couple of them do their resumes). He's laughing, sure enough the guy thought I was trying to cheat on the line, and was mighty upset when he found out he'd made a mistake. Wanted them to clean his interior in the other lane anyway, because, I guess, he's special.  \n\nSorry dude who can't read the signs and can't just pull forward out of the way. You just made things harder on yourself. ",
        "created_utc": 1490047029,
        "upvote_ratio": ""
    },
    {
        "title": "I kinda got kicked out of a cafe lol I need opinions",
        "author": "1evis1ittleasshole",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60inx3/i_kinda_got_kicked_out_of_a_cafe_lol_i_need/",
        "text": "Let me preface this by saying I don't usual visit small cafes at all. I'm not a cafe lover so I've only been to the big corporate ones every once in a blue moon. I know that those places let you chill there whether you buy anything or not but it didn't occur to me that the same rules wouldn't apply here (as I've always been a paying customer a this small cafe). That was my fault of course. I just didn't appreciate how they let me know this however.\n\nMy problem was that the employee beat around the bush about telling me this before telling me in a snappy manner that I had to leave. I came in saying that I wanted to charge my phone. She politely directed me to where I can, cool.\n\nShe then *asked* me if I was buying anything and I said no my bank card was left at a bar I was waiting to open at 6pm across the street. That is definitely the point where she should've said \"I'm sorry but the seats and services are only for customers.\" or \"You have to buy something to stay.\" would've saved me the fucking time.\n\nBut nope after 5 mins of me sitting there they say, \"Oh, only costumers can use outlets.\" ok that's fair cool. Then another lady tells me again. I reassured her I wasn't using anything. Then the employee comes up like 15-20mins later (giving plenty of time to settle down huh?) and says \"Look this isn't a train station you can't sit around here, please leave.\" in a very bitchy way like she's ready for a confrontation. \n\nI admit I'm not the brightest sometimes and tbh I didn't really catch on to them trying to kick me out. I thought I was being pretty understanding like cool I know every place has rules but the pussyfooting around telling to simply gtfo only made the situation worst. JUST TELL ME UPFRONT WTF. \n\nWhy the fuck are people scared to tell customers what's what? This is why I hate passive aggressive people. I understand some customers are difficult but jesus.\n\n\n",
        "created_utc": 1490038393,
        "upvote_ratio": ""
    },
    {
        "title": "Opticians who can't see things",
        "author": "LolaFrisbeePirate",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60iin9/opticians_who_cant_see_things/",
        "text": "So I go to an opticians to pick up some new frames for my partner. They had been ordered and all that needed to happen was to put the lenses from the broken frames into the new ones. \n\nSo I go in and explain why I'm there, the person on the front desk takes the details and asks me to take a seat. Fine, all good. \n\n\nI'm waiting, they call my name, SECOND member of staff grabs the old and new frames to look at and calls me over to another desk. Looks at them then gets up \"I'll have to pass you to my colleague to get the lenses swapped, can you take a seat back over there.\"\n\nSo I get up and sit in my original place. Then a THIRD person takes the glasses and gets me to sit at ANOTHER desk, they proceed to look at the glasses again, get me to sign some paperwork and to pay for the service. All sorted and they set about taking the lenses out. \n\nThey then inform me that they can't get one of the lenses out so it will have to get sent upstairs to the lab which will be an hour and a half. OK, I agree to come back later, they take the glasses and case, bag them up and take them away. \n\n\n\nI return about a couple of hours later to collect them, give the details to a FOURTH person who disappears then gives the glasses to me. It's only as I'm leaving I notice they've given me a different case so I go back and ask a FIFTH person where is the case I handed in with the glasses. \n\nFifth person is like \"what do you mean that's our case for those frames.\"\n\nMe - \"Yes but I handed the glasses in to you guys in my partners glasses case, so where's the case?\"\n\nFifth - *rings the lab* \"what's your name again?\"\n\nMe- \"My name is ... but the glasses are under ... \"\n\nFifth -gives lab details \"there's no case up there. Was it a different colour? I have our case in black.\"\n\nMe - \"It was a black square case but it wasn't your case, it was my partners glasses case.\" *I check my bag to make sure I definitely didn't take it with me* \n\nFifth - proceeds to show me all of the shop cases\n\nMe - \"It's not those it's my partners case, let me ring them..\" *rings partner to confirm case type - black with the name of ... on them*\n\nFifth - \"we'll I can't give you the designer case because they are only the economy frames\" \n\nA SIXTH person then becomes involved and says to Fifth \"have you checked the repairs drawer?\" Looks through, can't find them. \n\nFifth then gives me another case.\nMe - \" that's not the case, it's black and square.\"\n\nFifth - \"well I don't know what you want me to do then because that's the box that they come in when you buy from us\"\n\nMe \"it's not a case from you it's a black case with... on it. Are you telling me you've lost my partners glasses case between here and upstairs?\"\n\nFifth - \"I don't know what you want me to do, that's the case\"\n\nMe \"that's not my partners case.\"\n\nSixth then sees me getting annoyed \"well rather than waiting around I'll take your number and we'll give you a call\"\n\nAfter leaving, I'm on the way home, my partner rings me to say they've left a message that they've found them LITERALLY MINUTES AFTER I HAD LEFT. So I was just like, tell them I'll pick them up in the morning. My partner rings back, they're not answering and now they're shut. \n\nOver 2 hours, three trips and six people later I realise, I'm so glad I don't need glasses. ",
        "created_utc": 1490036990,
        "upvote_ratio": ""
    },
    {
        "title": "I nearly made a manager cry yesterday...",
        "author": "Valaqueen",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60fpvf/i_nearly_made_a_manager_cry_yesterday/",
        "text": "You know the drill, long time lurker, first time poster on this sub. On mobile also, so apologies. \n\nLet me set the scene:\nMyself and my family went for a meal yesterday. This restaurant has an indoor soft play area for children. I was there with my 4yr old non-verbal autistic daughter. The restaurant was extremely busy, we had to wait for our table to be turned over, staff were very nice etc.\n\nNow on to the story...\nAfter our meal, my daughter and I went to the soft play area. I was sitting on the carpeted floor, watching her play. She runs onto the carpet that I'm sitting on and begins to pee. Knew not to pick her up and run because we'd have a trail of pee. \nI was mortified but she got too excited and just went for it. No harm done. \n\nI catch a waitress who is carrying a whole tray of drinks just to inform her and to ask if I can have some cleaning equipment to clean up my daughter's mess. The manager was right behind us and must have noticed that we were talking to one of the waitresses. Manager appears, waitress goes to finish serving drinks etc. \n\nI told the manager about my daughters accident and again asked for cleaning equipment because the staff are so busy, I'm not going to just walk away from that mess. The manager looks ready to cry, he keeps repeating 'are you sure?' and 'You have no idea how much I appreciate this'. \nTruly felt for the guy. \n\nAfter I've cleaned up the puddle of pee the manager pulls me aside and thanks me profusely, he then tells me in all the time of being a manager (20 years he said) no-one had ever offered to clean up after their own child when they have an 'accident'. \n\nSo moral of the story, if your child has an accident, anywhere, you offer to clean it up. It's no-one else's responsibility but yours and you might also make a lot of workers extremely happy and grateful! \n\n",
        "created_utc": 1490005570,
        "upvote_ratio": ""
    },
    {
        "title": "I usually post in Retail but here's a quick story as a customer just from tonight.... Karma strikes",
        "author": "Kara-El",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60ex1e/i_usually_post_in_retail_but_heres_a_quick_story/",
        "text": "So I'm on my way home from work and I stop at a convenience store to buy some Gatorade for my hubby and there's only the attendant and another guy who was probably 2 cans shy of being blasted drunk.\n\nI got my drinks from the cooler and walk to the front, where the carrier had grabbed a hot dog for the drunk. There drunk guy was quietly hurling racist remarks at the cashier who was Indian (and most likely Hindu), calling him a Muslim and how it was fucked up that Muslims don't get drunk. \n\nThe cashier ignored him and rang up my purchase as the drunk complained about a few other things that I ignored. I left with my purchase and just as I got in my car to leave, the drunk bust s through the door and as he does, he drops the can of beer and the hot dog he just bought on the ground. \n\nThe beer immediately explodes open and the hot dog flops onto the ground that ive seen the local homeless guy piss on in the past. He just kicked the beer and then picked up the now nasty dog and shoved the hot dog back in its bun and ambled off as I pulled out of my spot... Eating it",
        "created_utc": 1489990183,
        "upvote_ratio": ""
    },
    {
        "title": "How to get free cookies.",
        "author": "Sooner70",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60ehm9/how_to_get_free_cookies/",
        "text": "This happened a few years ago but I just found out about this sub tonight.  Alas.\n\nSo there's a local sandwich shop that's very much like a sandwich shop named after mass transit, but it's a mom/pop place. Anywho, one night I go in pretty late and there's only one guy working the counter and one other customer; a woman who shall henceforth be known as Phone Bitch.\n\nPhone Bitch is standing at the counter giving Sandwich Guy her order *WHILE* she's talking to someone else on the phone.  Sandwich Guy is doing his best, but when he's got a question (\"Would you like the sweet or spicy sauce?\") he's having trouble getting a word in edgewise because Phone Bitch is too busy talking on the phone to realize that he's asking her a question.\n\nI wasn't even part of the conversation but I was offended on behalf of Sandwich Guy.\n\nFinally Sandwich Guy gets to that final question.  \"Is this for here or to go?\"  Phone Bitch doesn't even pause her phone conversation and keeps yammering on to whomever about whatever was more important than the actual human being standing in front of her.\n\nSandwich Guy asks again.  Again he is ignored.\n\nSandwich Guy just shrugs his shoulders and moves down the counter to make her sandwich.  He makes it.  He puts it on a tray and he hands it over the counter to her.\n\nPhone Bitch squares her shoulders, sighs loudly and says:  \"I wanted this to go.\"\n\nIt wasn't my sandwich shop.\n\nHe wasn't my employee.\n\nBut I could see that beaten down look in his eyes.  The look of a guy who's been taking abuse from twats like this one for months or years through no fault of his own.\n\nAnd I just fucking snapped.\n\nAs I said, this was a few years ago so I don't remember how quickly I covered the distance between Phone Bitch and myself.  What I do know is that I was right in her face; nose to nose like a military drill instructor.  And I was screaming at her....\n\n\"HE ASKED YOU IF YOU WANTED IT TO GO.  **TWICE**.    IF YOU WOULD HANG UP YOUR GODDAMN PHONE LONG ENOUGH TO TALK TO THE MAN HE WOULD HAVE MADE IT TO GO YOU FUCKING CUNT!\"\n\n....Or something very like that.\n\nMy next memory is her grabbing her sandwich and running for the door (she didn't even wait for Sandwich Guy to bag it up).  She opens the door, and through tears just screams back, \"I hate this fucking redneck town!\"\n\n\"AND IT HATES YOU.  IF THAT'S A PROBLEM, LEAVE AND DON'T EVER COME BACK!\"\n\nShe left.\n\nI deflated a bit.  I turned around.  Sandwich Guy just looked stunned.  Someone else (manager?) had come out of the back during all of this, but he too was just staring.\n\nI said something along the lines of, \"I'm sorry.  I shouldn't have done that, but she was treating you like shit and it bugged me.\"\n\nManager Guy just smiled and said, \"The customer is always right.\"\n\nWith no further fanfare they made my sandwich.\n\nWhen I got home I opened the bag and.....\n\n...Hey, I didn't order a cookie but there is is.  Free cookie!\n\nAnd so it was.  As long as Sandwich Guy was employed at that shop (probably another 6 months), everytime I went there I would find a free cookie in my bag.  :)\n",
        "created_utc": 1489983365,
        "upvote_ratio": ""
    },
    {
        "title": "In A Blue Store, With A Red Shirt, Shopping",
        "author": "Alkuna",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60blx1/in_a_blue_store_with_a_red_shirt_shopping/",
        "text": "Mom and I are in a blue store, and Mom decides to take a spin through the clothing department. Sometimes we find some decent stuff for good prices in there. Due to mom having a bad back, I'm pushing the cart. I'm wearing a dark red shirt with a dragon on the front, and blue jeans. This is the kind of dark red you don't even see in the red store.\n\nNow we're on a slow meander, mom doing the touchie-feelie-holding up the shirt kind of shopping particular to someone in no great hurry. I'm just kind of half-leaning on the cart, making comments and opinions.\n\n&gt;\"Where are the bras?\"\n\nI don't look around. I pick up a shirt in a color I like, look at the front and put it back. Meh. Nice color, bleck design.\n\n&gt;Loudly, just behind me, \"Hey! Where are the bras?!\"\n\nI meet mom's eyes with a \"Oh no. This can't be serious,\" look in my eyes. She has been witness to several mistaken identities in the past. She covers a snicker.\n\n&gt;I turn around and see an old lady behind me. \"Try the other side of the clothing department, lady.\"\n\nI turn away from her.\n\n&gt;Old Lady: \"Well aren't you going to show me where they are?\"\n\nI turn, slowly, back to her.\n\n&gt;Me: \"Why the hell would I do that? You look like you're fully capable of walking there yourself, and you certainly look smart enough to follow the directions I gave you.\"\n\nHave you ever watched somebody swell up with anger before? It's like a combination of a puffer fish, and Harry Potter's Aunt Marge. It's kind of fascinating, kind of hypnotic, and in this old lady's case, kind of hilarious AND sad.\n\n&gt;I look her right in the eyes and say, \"Alternatively, you could ask somebody who actually WORKS here for help.\"\n\n&gt;She freezes, blinks, and actually looks me up and down before saying, \"Oh... you don't work here?\"\n\n&gt;Me: \"No. I'm shopping with my mother.\"\n\n&gt;She deflates, then snaps, \"Well you're just a rude young woman then!\"\n\n&gt;Me: \"Funny, when you're not being paid to be nice to a stranger who's bothering you, rudeness kind of happens, doesn't it? Next time look for someone in a store uniform. It helps.\"\n\nOld Lady flounces off.",
        "created_utc": 1489948840,
        "upvote_ratio": ""
    },
    {
        "title": "The night I was towed...",
        "author": "dudenell",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/604o6f/the_night_i_was_towed/",
        "text": "Actually just happened last night.\n\nWas Ubering and needed some food and to take a piss, so I pass America's largest burger store and park in the parking lot. Immediately walk in and went to the bathroom, after leaving the bathroom I went and got a burger.\n\nAs I was walking out, I realized that they had towed my car. So not only did I lose out on guaranteed $ for that hour, but now I have to pick up my car. \n\nTook a Uber to the tow lot, paid $150 to get my car out after 15 minutes. Went back to the store and the manager on duty refused to take responsibility for the situation at hand.\n\nOverall I spent $192 on a friggen burger. Going to try and deal with the Owner and corporate today and then get back on the grind.\n\n**Small update 3/20:** Franchise owner is being a jackass. Complained to corporate today. I'm a bit busy at work today but will be sending him a demand letter via certified mail tomorrow. I will go forward with small claims court if this isn't resolved.\n\n**Update 3/21:** Corporate has not called back after saying they would. Franchise owner has not called back. I sent a demand letter today outlining my damages.",
        "created_utc": 1489851648,
        "upvote_ratio": ""
    },
    {
        "title": "Dangerous bathroom, dismissive bitches",
        "author": "karmadoler",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/604gtq/dangerous_bathroom_dismissive_bitches/",
        "text": "I'm usually pretty easygoing, but recently at a wing place I took my daughter to the bathroom and the floor was so slick with moisture that the second my foot hit the tile I slid, my three year old slid, it was the most treacherous bathroom trip of my life, I was scared of falling with every single step. Seriously, ridiculously slick and a true hazard. No wet floor sign in place, I felt like the right and responsible thing to do was alert the staff.. right?\n\nSo once we came out, I deposited my daughter back at the booth with her dad and went up to the podium where three girls were 'working', aka bullshitting. I stood there for what felt like too long with no acknowledgment, a full few seconds of them clearly being aware of my presence but choosing not to notice me, so I finally said.. excuse me. \n\nAll three sets of eyes come up to meet me and the annoyance is just exuding from them all. I say, \"I just wanted to tell you, the bathroom is EXTREMELY slippery, it's really dangerous, me and my daughter both nearly fell. It's nearly impossible to safely walk in there without holding onto the wall.\" \n\nThree blank stares back at me. One finally flips her hair and gives an exasperated \"ok\". Nothing else said, they're just eying me, I eye them back. Again, the rude energy is just pouring off of all three of them. I turn to walk back to my family, and I hear the one who spoke to me say \"as if I give a fuck.\" And all three laugh.\n\nSo I pause in my step, the gall of it with me clearly still in ear shot just blows my mind. I go sit back down and tell my husband what just happened. He says I should go back in the bathroom and purposely fall, sarcastically. I'm more hung up on the disgusting behavior of the three employees. I'm trying to let it go, the food arrives and another ten or fifteen minutes passes. I can't resist the curiosity, so I go back to the bathroom and check. No sign, no water cleaned up. The three workers have come and gone from the podium a few times, but generally seem to just cluster up and chat whenever they can.\n\nSo at this point, my blood is kind of boiling. It made me just flat furious that they were being so negligent, so I walk back up to the podium girls. Same as the last time, they don't acknowledge me until I force them to. \"I need to see a manager,\" I said. \"I told you about the bathroom being dangerous almost fifteen minutes ago and I see nothing was done, there's old people and little kids in here that don't need to get injured today because you don't want to bother.\" \n\nAnd the mouthy girl says, \"what, are you a bathroom monitor?\" At this point, I say very loudly, I need a manager, NOW. \n\nManager comes over and whether they actually gave a shit or not, I don't know, but they acted pretty aghast and I didn't see the girls clustered up again for the rest of my meal. Thankfully most of this took place after our food had arrived so they didn't get to spit in it. It was also free, after this confrontation, because I told the manager I'm not one to demand free things but this was deplorable behavior and treatment and all but guaranteed we would never be back.. and we haven't been.\n",
        "created_utc": 1489849105,
        "upvote_ratio": ""
    },
    {
        "title": "The time the theater forgot about us. [Funny]",
        "author": "iamtoastshayna69",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/6029fk/the_time_the_theater_forgot_about_us_funny/",
        "text": "Looking at some clickbait about the funniest things people have ever heard in a theater made me remember this. Something like 6 years ago this happened.\n\nOur town used to have a theater that has now shut down because the owner is too much of a cheapskate to replace the projector that broke down. It was the only theater within 45 miles of my town. Now on to my story.\n\nI no longer recall what movie it was. But one day me and an ex went to watch a movie in said theater. We ended up being the only two people in the theater!!! We were in luck, or so we thought.\n\nScreen lights up and previews start playing. They were pretty interesting. Suddenly screen goes dark, lights are still off and there is no sound. We sat there for a good 5-10 minutes before I convinced my boyfriend to go see what was up.\n\nCome to find out, they forgot we were even in there and shut off the movie. They turned it back on and we watched it.\n\nI was naive and did not ask for a refund or anything of the sorts, (Owners are a big name family in town and monopolize everything so I doubt we would have gotten anything out of them anyway. It's been shut down for about 4 years now and even though a bunch of people raised money to replace the projector, the family refused to do it because they are rich assholes like that. The theater was located inside a grocery store with the same name as the family.) \n\n\nSo instead I just have a funny story about the time that a theater forgot about me and an ex and we had to remind them that we were still in it.",
        "created_utc": 1489808775,
        "upvote_ratio": ""
    },
    {
        "title": "Foreign Airport Debacle",
        "author": "spaceface124",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60263f/foreign_airport_debacle/",
        "text": "So technically, this post isn't about a business, but customer service was so spectacularly mishandled that I think it deserves a mention.\n\nMe and my family were vacationing in [foreign country], and a part of our trip involved flying from its capital to a more remote region. The return flight was scheduled to depart around midnight and arrive at the destination around two AM, but the flight crew encountered some \"technical difficulties\" and as a result, we had to take off two hours late. It wasn't such a big deal, as we could sleep during the flight. However, the real difficulties started when arrived on the tarmac. I'll identify myself as \"Me\" and the flight attendants as \"FA\".\n\nMe: (awaking on board the plane) So, are we deplaning soon?\n\nMy Family: No, we've arrived, but we've been here for an hour already. We're not sure what's going on. \n\nI manage to get the attention of a FA.\n\nFA: The airport is closed. Please rest assured that we are doing everything we can at this moment.\n\nMe (thinking): No, something must have been lost in translation. Major international airports don't shut down without prior notice.\n\nSoon enough, the FA was explaining the predicament to other awaking passengers. A crowd gathered near the cockpit and they looked pissed. I realized that the airport was indeed closed once I look out the window. Because I'm multilingual, I explained to as many other passengers as possible that we were indeed stuck inside the plane until the airport reopened.\n\nSoon enough, the airplane taxis to gate and we are allowed to deplane. It turns out that a skeleton crew arrived in time to service our luggage and unlock the doors. There were no unusual weather conditions or disasters that merited shutting down that entire airport for that long. In fact, our tour guide took it as a matter of course.",
        "created_utc": 1489807331,
        "upvote_ratio": ""
    },
    {
        "title": "...Where's the fire?",
        "author": "Rockeye_",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/60137y/wheres_the_fire/",
        "text": "I was at a grocery store. A group of friends of mine tend to meet up in the little dining area in one corner and play board games, and there's a pair of fire doors right next to it.\n\nIn the middle of one of our games, we see two burly men look around shiftily while heading to the nearby bathroom. When they come out of the bathroom they go straight out the fire door and run for it. One of them drops a USB stick on the way out. Obviously thieves of some kind. Note that going through the fire doors did NOT set off the fire alarm...\n\nBeing responsible citizens, we reported this to the nearest employee in, in hindsight, a shouty and confusing way. Somehow \"Two guys went out the fire doors with a bunch of stuff\" became \"I should pull the fire alarm.\" So she did. And it worked this time, sprinklers and all.\n\nTitle comes from what the shift supervisor asked her when he finally showed up.",
        "created_utc": 1489793702,
        "upvote_ratio": ""
    },
    {
        "title": "Fraud and the cost",
        "author": "SuperBigDick1",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5zzz38/fraud_and_the_cost/",
        "text": "On mobile so please forgive.\n\nSo I've worked retails since I was 16 and at this point I was 20 and renting an apartment with a couple of roommates. I decided we needed internet so called up a major provider and they stated they would send me a self install kit with the internet modem.\n\nThe day we go to move into our apartment the rental company tells us we will be moving into the same unit but 3 doors down as the one we were originally were going to move into isn't ready. No problem I call the provider and they say no worries that they will cancel the order and of course send me the new one at the new place.\n\nAll seems fine. That is until I move. I had managed to save up a good amount and live very poor in order to afford a small house for myself. It took months to get all the financing and stuff through as I was very young at this point. \n\nSo I finally move into my lovely new home and the mortgage company of course tells me that since I'm new they can check into my credit to make sure I still qualify? The guy pretty much said hey just don't get anything major in collections or the Mortgage company may ask to re evaluate your interest rate. \n\nI call the major provider to establish service at my new home. They tell me I have 3,000 of debt from an account that was set up a year ago for old apartment number. We went back and forth until I gathered that the first person sent all the stuff to the first apartment and the second and the order was never canceled. The people that moved in a couple days later used it until it got shut off and sent to collections.\n\nIt took me 7 days on the phone and over 50 calls. I was also sick and loosing my voice at this time. I just kept getting transferred. People were so mean and I was loosing it. Finally I'm talking to the collections department and they pretty much say I have to pay and I start sobbing. I start uncontrollably sobbing about how it's theft and they messed up and I'm going to loose my new home and I'm sick. \n\nI couldn't stop. I was sitting in my new home that still didn't have any curtains or furniture because I was worried about this bill. After that the employee somehow believed me and erased the debt. I continued to sob in disbelief that it was actually over.  I had never been more worried in my life about a debt. \n\nDuring my many conversations with the provider I repeatedly told them it was internal fraud probably for commissions and that they needed to investigate my calls as I had called to get it cancelled. Apparently they had been sending the collections letters for months to the original apartment and the person that lived there never thought a thing of it.\n",
        "created_utc": 1489781428,
        "upvote_ratio": ""
    },
    {
        "title": "Cashier is doing a \"social experiment\"",
        "author": "veryveryplain",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5zy7f0/cashier_is_doing_a_social_experiment/",
        "text": "Let me preface this by saying I have worked in retail/customer service my whole life (and still do). I know what it's like to deal with customers day in and day out. At work, I have tough skin. I can take the complaining and the screaming and the insults from customers all day long with a smile on my face. Outside of work, I'm extremely shy and I try damn hard to not be a nuisance to my cashiers or servers. I have never sent food back at a restaurant or not tipped well or berated a cashier. \n\nI just had my oil changed at an auto service chain. The guy comes to ask me to the cash register and I follow him. The register is in the same room as the shop and it is LOUD in there. On top of that, the guy talking to me is extremely soft spoken AND I'm hard of hearing. I have to strain to hear and lip read to fully understand people. So this guy is almost whispering, talking about the options for the oil change and I just agree to whatever the first option he presented was because I couldn't understand him. Then he mumbles a few more sentences that I can't follow and the following conversation happens. I'll be me, he will be Dbag. \n\nMe: So do I pay right now or afterward? \n(Dbag laughs and rolls his eyes)\nMe: Oh god, I'm sorry. You just told me when to pay, didn't you?\nDbag: Yeah. But I'm laughing because I'm doing a social experiment to see how many people actually listen to complete sentences. Most people don't. \nMe: I'm so sorry, I can't hear very well. That was my fault. \nDbag: No it's everyone. No one ever listens. \n\nSo I go back to the waiting room and after a few minutes he pops his head in and mumbles something. It's clear no one else can understand him either because they all look at him and kind of point to themselves. The guy says \"No, you\" and points to me. I follow him to the cash register and he tells me what they've done and the price and everything. I ask if I can pay now and he gives me this look that says \"Are you stupid?\" And just nods. So I pay and then he's just standing there so I ask \"Is that everything?\" And again he gets that fucking look. He asks if I want my receipt and I say no thanks and leave. \n\nI know this doesn't sound like anything. But if you could have just been there and seen these looks he was giving me. I cried the entire way home. I am so embarrassed. I've never treated someone like that, especially not a customer. \n\nUpdate: Thank you all for the kind words and advice. I called and asked to speak with a manager yesterday but the man I spoke to said the manager wouldn't be in for another week because he's on vacation. He said he was the assistant manager and could help me with anything I needed. I told him about what happened and said he knew exactly who I was talking about because I wasn't the only one to complain. Then he apologized and said he'd take care of it (I'm not sure what he means by that). He also offered to refund my oil change and send me a coupon for my next one. ",
        "created_utc": 1489764324,
        "upvote_ratio": ""
    },
    {
        "title": "Customer Service : Things Your Account Managers Are Doing Wrong",
        "author": "Convergehub_CRM",
        "url": "http://www.convergehub.com/blog/things-your-account-managers-are-doing-wrong-and-how-fix-them",
        "text": "",
        "created_utc": 1489747572,
        "upvote_ratio": ""
    },
    {
        "title": "More like tales from the parking lot",
        "author": "Miqotegirl",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5zwsxw/more_like_tales_from_the_parking_lot/",
        "text": "Okay, so a certain Mouse House has new parking garages and the signs are completely confusing. I've been going there for months and I get anxiety just driving around the place and I don't usually get flustered easily while driving.\n\nToday, I thought I had it down pat. 2nd floor was full but the first floor wasn't and had plenty of spaces. There is a sign as you come in telling you which level has space. You can't drive straight onto the first floor when coming off the main street, the only ramp takes you to the second floor and higher. Which was \"full.\" So I drove to the second floor and started following the signs to the exit, which will take you to the first floor too. First off, there are at least 2-3 parking spaces per row on the \"full\" 2nd level. I should have just taken one of those spaces but I started looking for the exit and ramp down the first floor.\n\nThe first well marked exit was blocked by metal bars and I was kinda baffled by that so I kept driving. The other exit was blocked as well. So I drove back a few rows and found another ramp and thought I finally found a way out. Nope. It was a one way ramp going up WITH NO \"ONE WAY ONLY\" SIGN.\n\nI quickly found out I was going the wrong way from some guy in a golf cart driving towards me. So I stop and roll down my window and he tells me I have to back up onto the same floor. I explained that I thought that I was going the right way and he said \"well, you're not\" and about that time, a car started coming up the ramp. I put my car in reverse but because the incline was so steep, even with an auto transmission, I started slipping forward every time I took my foot off the brake. The guy in the golf cart went and stood in front of my car and started screaming at me to stop moving forward.\n\nI lost it. I stuck my head out the window and started screaming back at him that my car was in reverse and I was slipping forward due to the incline. I didn't want to take the risk of running him over so I didn't move until he came around to my window to, I don't know, berate me some more. I pointed to my gear shift and said I can't help rolling forward on this ramp. It's too steep.\n\nFinally, I was able to back up and just wound up parking on the second floor. Should have just done that from the beginning.\n\nTL;DR - parking at the House of Mouse can be dangerous. The signs are shit and will do my best to avoid the new stupid parking structures as much as I can. They need to fix this ASAP.",
        "created_utc": 1489746156,
        "upvote_ratio": ""
    },
    {
        "title": "Why have reserved seating?",
        "author": "KissTheGuest",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5zt5r6/why_have_reserved_seating/",
        "text": "Sorry about the formatting. It is gonna be the dreaded mobile format.\n\nAnyways not too long back the boyfriend and I went to the movies. The local theater does reserve seating. I've never encountered that before, but the boyfriend assures me it is awesome. We are off to the movies!\n\nAll is well but when we get there people are in the seats. I don't blame them. They are the good seats that people typically go after. The problem occurs when the people don't want to move because suprise suprise the theater is mostly full on opening night and these are the seats they wanted anyways. Things get said and eventually an usher gets involved. \n\nExcept the usher doesn't want to get involved. \"A seat is a seat. Just sit somewhere else.\" Umm..then why do you upsell reserved seating? Like lets be fair and real here: If this was you would be pleased with your response? No! \n\nThe guy made the people move when it became apparent I was willing to go find a manager. It feels so petty but damn... we literally paid more to be able to sit there.\n",
        "created_utc": 1489696854,
        "upvote_ratio": ""
    },
    {
        "title": "Throw free meals in the direction of the (perceived) problem",
        "author": "Particlepants",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5zsstf/throw_free_meals_in_the_direction_of_the/",
        "text": "So I recently went to [roast beef sandwich chain] for a meal, as I was eating I noticed that the man in the button up shirt (presumably the manager) was being extremely friendly and amicable. I decided to go the chain's feedback service and compliment the manager. Weeks later I get a letter in the mail from chain. I paraphrase but it was something like \"we appreciate your feedback, regret our shortcomings and hope to serve you better in the future\" I also recieved 2 free meal cards. I entered the store and found said manager at the register, so as I ordered I showed him the letter and asked him if it affected him negatively in any way, he shrugged, said he hadn't heard anything about it and told me to enjoy my free meal.",
        "created_utc": 1489693363,
        "upvote_ratio": ""
    },
    {
        "title": "My friend insulted our young waiter and he avoided us all night",
        "author": "veryveryplain",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5znuao/my_friend_insulted_our_young_waiter_and_he/",
        "text": "My friend (29F) and I (27F) decided to go to dinner together. We sit down at the table and our waiter comes to ask for our drink orders. This teenage waiter was conventionally unattractive and mildly overweight. Before he gets a word in, my friend says, \"Omg you look JUST like James Cordan!\" I've never heard of this person but I had a feeling this wasn't a compliment. The waiter seemed like he knew this too and started turning red. I just said I didn't know who that was and started to order. \n\nShe pulled up a picture to show us and sure enough it's an unattractive, overweight white male. The waiter looks extremely embarrassed. I'm extremely embarrassed. I said, \"He looks NOTHING like that. You're blind.\" I proceed with my order and she tries to tell us again that he does look like that so I just talk louder and continue with my order. \n\nThe waiter never returned to our table. A different waiter brought our food, our drinks weren't refilled, the table wasn't bussed, and we had to track down our bill. The friend was pissed but I don't blame the guy. I'm so embarrassed by her. We don't go out often so I forgot she's really abrasive and just says whatever's on her mind. I told her in the car that what she said embarrassed the waiter and she just shrugged it off. \n\nDear waiter, I'm sorry for my loud-mouthed friend. \n\nEdit: I realize that James Corden has become more attractive through the years. With that being said, [here](http://imgur.com/aVZlBuU) is the picture she showed us. ",
        "created_utc": 1489629529,
        "upvote_ratio": ""
    },
    {
        "title": "Karma made him pay.",
        "author": "Wolfanini",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5zlb0c/karma_made_him_pay/",
        "text": "So when I was 15, my friend Jake and I took a trip to a burger joint for lunch. The drive through was wrapped around the building, so he parked and we went inside, only to find a pretty big line in store as well.\n\nIt's clear that the staff is working their asses off to handle the rush, but there's one asshole in line waiting for his order that will not quit bitching and demeaning the staff.\n\nHe's shouting, to no one in particular, \"I thought this was supposed to be fast food! Jesus! I mean what the hell are you guys even doing?\" \n\nWhile this is going on, I happen to notice he is standing on a $20 bill. Finally, after receiving his order, demanding a refund and leaving, I pick it up. I ask the nearest guy in line, \"Would this happen to be yours?\" He responds, \"No, it was probably that asshole's that just left.\"\n\nI bought lunch for as many people in that line as I could.",
        "created_utc": 1489603876,
        "upvote_ratio": ""
    },
    {
        "title": "Girl, why you so angry?",
        "author": "xTheDoctor88",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5zesi8/girl_why_you_so_angry/",
        "text": "This happened about 2 years ago, but it still leaves a sour taste in my mouth.\nMy best guy friend and I went to a local taco joint at about 2:30 am to get some delicious tacos as we had just left the bars. \nNow, this particular place is extremely busy at this time as it's one of the only restaurants that are open this late.\n\nThis is the delightful conversation we had with the cashier\n\nFriend = J  Cashier = C  Manager = M Me = me (obviously) \n\nC: \"What can I get you guys?\"\n\nJ: \"I want (blah blah blah) and she wants (blah blah blah)\"\n\nJ: \"Also, I really like your hair\"\n\nC: Very rudely  \"That isn't going to work on me\"\n\n\nAt this point we were really confused as J is very obviously gay. This particular night he happened to have bright red nails and was wearing stilettos. Obviously not flirting, but whatever, we didn't mean to offend her.\n\nJ: \"I didn't mean to offend you, was just trying to be nice\"\n\nC: rolls eyes \"Whatever, your total is $x.xx\"\n\nWe pay and move aside to wait for our food\nOur food comes out and we only get about half of what we ordered. So we go back to the cashier to check on the rest.\n\nJ: \"Excuse me, we are missing about half our order\"\n\nC: \"No, you got everything you ordered\"\n\nJ: \"We did not get blah blah blah\"\n\nC: \"Um well, you didn't order that\"\n\nMe: \"Yes we did, I was right here when he ordered\"\n\nC: *storms off and gets manager*\n\nM: “Hi, how can I help you guys?”\n\nJ: \"We didn't get all the food we ordered\"\n\nM: \"Hmmm, It looks to me like your order is complete\"\n\nJ: \"I think C missed several items, can we just put in a new order for the missing items?\"\n\nM: \"That's impossible; all of our staff is trained to read back orders. If you agreed to the order, than it's your fault\"\n\nJ: \"Um, ok. Can we just place another order then for the missing items?\"\n\nM: \"No, please leave\" *walks away*\n\n\nThe whole encounter was just bizarre. We didn’t eat there again.\n",
        "created_utc": 1489524214,
        "upvote_ratio": ""
    },
    {
        "title": "Key not working after extending my stay",
        "author": "superzenki",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5ze8un/key_not_working_after_extending_my_stay/",
        "text": "This happened last summer. I was in Orlando for a business trip staying at a pretty good hotel. I had to extend my stay for one more night and leave the next day. I called the hotel as soon as I found out and they said that would be no problem.\n\nThe next day, which would've been the day I had checked out, I was returning from work and had trouble getting into the lot. My key worked to swipe me in every single time prior to that day. I put two and two together and predicted having problems getting into my room.\n\nI went to the front desk, explained my problem and that I thought it might be related to me extending my stay. He did something with the key and assured me that it would work now. I had to walk to the complete opposite end of the hotel on the top floor (this was a big hotel) and guess what? It wasn't working.\n\nI went all the way back down to the front desk, he messed with it again and told me that if I still have problems, there are phones by the elevator. I went through the same song and dance again, just to find my card still not working.\n\nI called down to the front desk, and had to go down anyway just for him to give me a new key that finally worked. He didn't seem to associate it with the fact that I was supposed to check out that day but did not, but I don't believe that was a coincidence.",
        "created_utc": 1489519080,
        "upvote_ratio": ""
    },
    {
        "title": "Let him shoplift, was that wrong?",
        "author": "UserAccountDisabled",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5z9o0x/let_him_shoplift_was_that_wrong/",
        "text": "Let me preface this by saying, I'm one of those people who gets super annoyed when people don't obey the rules, and have no problem with confrontation. Why this is relevant will be evident soon. \n\nI'm in a long-standing charity store that sells donated clothes and other items (which is a whole other story).\n \nThey have racks of stuff, with the racks arranged in these circular formations. As I walk past one, I see a guy crouched down in the center of one of the circles of racks. He has a gym bag, and he's furiously stuffing things in to it. Obviously stealing, and he doesn't look at all homeless. \n\nHe looks at me, freezes, and looks terrified. \n\nI'm just about to do a \"WTF\" in a loud voice, get someone who works there, etc. \n\nAnd I freeze. Its a weird few seconds, both of us staring at each other. I'm thinking, how do I know what this guy's deal is? Maybe he's desperate for clean socks or shirts or something, maybe he has a friend who just lost everything. Maybe he's undocumented (he looked Latino) and a shoplifting bust will seriously mess up his life. \n\nHow do I know? I do know, its a bunch of used clothes from a place where everything is donated. Its not worth a whole lot, and was worth nothing to the people who donated it. Is it really worth it to maybe mess up this guy's life, or interfere when he could be helping someone else, over....this? \n\nSo I just nodded, and walked away. \n\nBut - I also let someone rip off a charity, and they use the money to help people who really need it. \n\nSo, maybe I did the wrong thing. \n\nI am certain that if the guy had been cocky or anything other than terrified, I would have thought, heck with it: you need to be stopped (though not using physical force, not worth it for something like this). \n\nBut he looked so scared, he knew it was wrong, I felt like that meant he was doing it because he had to, or had a good reason. \n\nIf it was a regular store, I wouldn't care, or not as much. But he was ripping off a charity. I could have told the staff to just watch out better for shoplifters, without outing him. But I didn't. \n\nSo....did I mess up? \n",
        "created_utc": 1489459835,
        "upvote_ratio": ""
    },
    {
        "title": "Cold pizza",
        "author": "superzenki",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5z5zlu/cold_pizza/",
        "text": "This happened about a year ago. I had some time to kill before seeing a movie and decided to get a slice of pizza beforehand at their small cafe. The slice is heated up in about 10 minutes, but after a few bites I find that the middle is still frozen solid even though the rest was hot, not just lukewarm. I go up and explain the problem, requesting a new piece.\n\nThis time, they cook it about 15 minutes. I can tell that they didn't slack on this because I started seeing black on the top, but not enough to where it was too burnt to eat. Before I take a bite, I check the middle and it's still somehow frozen.\n\nI'm annoyed because in the 25 minutes it took to prepare them, I didn't have any time to eat. I requested a refund and the manager was able to give it to me. Hopefully they addressed whatever problem was causing that, but I've avoiding pizza (and other food) from there since.",
        "created_utc": 1489422705,
        "upvote_ratio": ""
    },
    {
        "title": "A wireless phone provider held me hostage, then made me pay for it.",
        "author": "miianwilson",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5z533f/a_wireless_phone_provider_held_me_hostage_then/",
        "text": "My original post was removed, so: Resubmitted, without spelling out the company's 4 character name, because I learned that's against the rules... \n\nHad some trouble with a  very large wireless company I'll call \"HATE-e n t\". Me and family have had an HATE-e n t wireless plan for a couple of years. We used more data than we originally expected, so every month we were paying $15-$105 a month for overages. We all wanted to change carriers, so that we could get a plan more suited to our usage, but figured it wasn't worth it until the 2 year contract was up. Finally we finished our contract, and everyone called HATE-e n t to port our numbers to the new carrier. HATE-e n t  informs us we have to fill in a form to unlock our numbers from their network. No problem. We all fill out the form. We get an email 2 days later saying our requests are denied. So we proceed to repeat the process, verifying every detail is correct while on the phone with HATE-e n t. Denied. Again and again and again. In all we were denied 15 or so times, over the course of 4 weeks! I looked on my phone and saw that I'd called them 13 times over the month, trying to resolve the issue. \n\nApparently HATE-e n t had a system issue that was denying everyone who tried to unlock their phones. So we couldn't leave, and were being charged. On one of the last calls trying to resolve the issue a teller told me we absolutely wouldn't be charged for the month we'd been forced into by their system malfunction. She said she put it on our account notes, whatever that means. \n\nWell, as you can guess, the bill came and we still owed the $400 for the last month. And of course when I called to explain, we were told that they would not reverse the charges, and that they had no record of someone telling us we wouldn't be charged. She just kept repeating \"sir, you used your phone on this billing period\". And I replied \"yes, because your system wouldn't let us leave!\"  \n\nAnd of course the whole time we were already being charged for the new account we had set up on the new carrier. \n\nTL;DR HATE-e n t  computer fault held us hostage, and we were forced to pay for an extra month of service.",
        "created_utc": 1489413256,
        "upvote_ratio": ""
    },
    {
        "title": "AT&amp;T held me hostage, then made me pay for it",
        "author": "miianwilson",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5z3aaw/att_held_me_hostage_then_made_me_pay_for_it/",
        "text": "[removed]",
        "created_utc": 1489381784,
        "upvote_ratio": ""
    },
    {
        "title": "Notorious LameShop clerk lies out of his ass to me",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5yvebw/notorious_lameshop_clerk_lies_out_of_his_ass_to_me/",
        "text": "[deleted]",
        "created_utc": 1489271970,
        "upvote_ratio": ""
    },
    {
        "title": "The Subtle Differences Between Customer Support and Customer Service",
        "author": "Convergehub_CRM",
        "url": "https://www.kayako.com/blog/customer-support-vs-customer-service/",
        "text": "",
        "created_utc": 1489145991,
        "upvote_ratio": ""
    },
    {
        "title": "Three Mobile has a reward app - it's not very rewarding",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5ylexz/three_mobile_has_a_reward_app_its_not_very/",
        "text": "[removed]",
        "created_utc": 1489142377,
        "upvote_ratio": ""
    },
    {
        "title": "Sweet Sweet Revenge",
        "author": "Chaosmusic",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5yin70/sweet_sweet_revenge/",
        "text": "[removed]",
        "created_utc": 1489102588,
        "upvote_ratio": ""
    },
    {
        "title": "No coup for you! The tale about coupon dummies.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5yhrfs/no_coup_for_you_the_tale_about_coupon_dummies/",
        "text": "[deleted]",
        "created_utc": 1489093442,
        "upvote_ratio": ""
    },
    {
        "title": "The day I stood up for myself: Post Office woes",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5ygzr5/the_day_i_stood_up_for_myself_post_office_woes/",
        "text": "[deleted]",
        "created_utc": 1489086201,
        "upvote_ratio": ""
    },
    {
        "title": "I've been paying for it every time I've gotten it!",
        "author": "Cargirl227",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5ygxpm/ive_been_paying_for_it_every_time_ive_gotten_it/",
        "text": "Long time lurker, first time poster on reddit .. I have no idea how to format so please bear with me. \n\n\nSo I went to get lunch for work today, to sandwich/soup chain place. I've been going there for about a year now and getting the same thing. 3 bowls of soup, sides of bread for each one, 1 extra side of bread and a side of a specific cheesy bread. Every time I order the side of specific cheesy bread they have to hit side, then they either type it in or hit the button for the name of the bread. The newer people call a manager over, the manager does it and all is good. \n\n\nToday I ordered the same thing. Cashier will be C, I will be Me. \n\n&gt; C: We actually don't have that as a side. Are you sure you don't want the bagel? \n&gt; Me: Yes. I've been getting it as a side for months. They normally have to hit side and then either type it in or hit the button for it. \n\n\nSo she goes and gets the manager. The manager, who is this extremely sweet woman who I have dealt with multiple times when they forget one side of bread or something, comes over and they talk for a second while she plays with the computer. She finally tells the cashier that she can't find it and she will just give it to me and not to worry about it. Gets my name, goes back to what she's doing. \n\n&gt; C: She is going to give it to you for free this time but you will HAVE to pay for it for it from now on. But there's no button for it. \n&gt; Me: Ok... I have paid for it for months. But ok. \n&gt; C: Well she's the manager. \n\nAt this point I paid and walked away. I thanked the manager when I got my food but I am still so peeved at the cashier. I understand being new and not being able to find the button... but I am telling you I've been paying for this for months. I'm obviously not trying to get it for free. If there's not a way to get a slice of it on the side there wouldn't be slices of it available. What really upset me is her talking down to me. Don't talk down to customers if there's no reason to. If they hadn't been slammed and I hadn't already been late getting back I would have complained to the manager, at the very least to just tell her to talk to her cashiers about how they talk to customers. It's uncalled for.",
        "created_utc": 1489085669,
        "upvote_ratio": ""
    },
    {
        "title": "No, that's definitely not normal.",
        "author": "useyourbrain18",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5yc13v/no_thats_definitely_not_normal/",
        "text": "Lame title. Whatever. I was just reminded of this story from a post on another thread.\n\nI went on vacation last year and drove 7 hours to the destination. Checked into my hotel and didn't feel like driving anywhere for dinner.\n\nWe went downstairs to the hotel's supposedly fancy restaurant. I find a really nice pasta dish with chicken and fresh veggies. Yumm! What I got was a really nice pasta dish, fresh veggies, and PINK chicken.... It took me about 5 minutes to flag down our waitress again. She told me there was nothing wrong with the chicken..\n\nLook, I'm not a chef, but I can do some cooking. CHICKEN IS NOT SUPPOSED TO BE PINK. She told me and I quote \"That is how our chef cooks it. That means it's cooked well done.\" She took the dish back to the kitchen reluctantly... Then brought the same dish back less than 2 minutes later with the same chicken with grill marks (that were not there before).\n\nI also worked in food for about 8 years... If you serve raw chicken and place it on top of pasta/veggies, you canNOT serve that same pasta/veggies to a customer. \n\nWe noped right out of that restaurant. I was not about to ask her to take it back and make a whole new dish. ",
        "created_utc": 1489021606,
        "upvote_ratio": ""
    },
    {
        "title": "Peach Snapple",
        "author": "jericha",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5ybkhj/peach_snapple/",
        "text": "[removed]",
        "created_utc": 1489016515,
        "upvote_ratio": ""
    },
    {
        "title": "So apparently it IS a problem.",
        "author": "latche",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5yaznh/so_apparently_it_is_a_problem/",
        "text": "A few months back a new location of a restaurant my partner and I love opened right down the street from our house. We have been going there a long time, and we always get the same thing: he gets the corned beef hash, and I get the chef's omelet with the meat on the side, because I don't eat meat but he loves it. \n\nSo a few months ago we went to try the new location. Upon ordering I asked the waitress if it would be possible to get the meat on the side of my order (since even though it's the same restaurant, I thought it might be different at this location. She replied, \"Oh, yes, ma'am. Not a problem at all.\" \n\nA little bit later our food arrived, with no meat on the side. I figured they may have just forgotten to put it on the side, but the omelet was full of meat. No problem, people make mistakes. I called for the waitress, and she was very apologetic and they made me another omelet, which was delicious.\n\nThe next time we went there, we had the same waitress. I again asked her if it was possible to have the meat on the side, and she said yes. Our food arrives--guess what--meat in the omelet. We have the exact same conversation as before, and I gently mention that this happened once before. She is baffled, and tells me she has no idea how this could have happened, etc. etc. I tell her it's no problem, and wait ten minutes for the new omelet.\n\nThe third time we went, we had the same waitress again. This time I mentioned to her before we ordered that we had had this issue before, and this time just ordered no meat at all in hopes that that would clear up the problem. Food arrives--MEAT. They send a manager over to talk to me, and I explain the issue. He is extremely apologetic, comps the meal (which was very kind of him), and tells me he has found the problem and all should be good--the special instruction was getting sent to the bakery instead of the kitchen (??). He assures me that the issue is all figured out and I won't have this problem again. \n\nFor a few times I just ordered something else there, but last week I decided to  try the omelet one more time. We had a different waitress this time. I ordered the omelet, meat on the side, again asking if it would be an issue. I explained to her what had happened and asked her to please double check with the kitchen. She agreed. This time the food came out, with a dish on the side. My partner said \"Damn! They finally got it right!\" Right as I was about to take a bite, I glanced at the dish on the side. It had sausage and onions in it. Oh, shit--the omelet also comes with bacon. I look at the omelet closer--full of bacon. So somehow this time, they took out half the meat and onions for unknown reasons, but left the bacon in. \n\nI politely called our waitress over. She openly rolled her eyes and told her she had no idea how this happened, that she had double checked with the kitchen and things should have been A-OK. She was openly annoyed and flounced back to the kitchen. \n\nI'm dying to know what the hell is going on in the kitchen over there (does my vegetarianism upset them? do they not understand the instruction? WHAT IS HAPPENING), but that is the last time I try ordering that omelet. And before anyone asks, my partner would choose their corned beef hash over me, which is why we keep going. ",
        "created_utc": 1489010742,
        "upvote_ratio": ""
    },
    {
        "title": "Apparently, I was an asshole-customer.",
        "author": "b778av",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5y92kq/apparently_i_was_an_assholecustomer/",
        "text": "A few years ago, I wanted to buy a gift for my sister, because she helped me with a pretty big school project. That was on 12. February. I bought her some chocolate and a \"Thank-you\"-card. This card had the text \"I would be nothing without you\" written on.\n\nI brought all this stuff to the counter to pay for it and because it was on a wednesday morning, there were only a few other people in the store so I directly came to a beautiful young woman, blonde hair, about as old as I was bach then (about 18) who worked as the cashier. She scanned all the stuff I had and asked me, with a beautiful smile, \"So, who is your girlfriend?\" and I was pretty stunned because I did not expect this question. \"Excuse me?\" I replied and she asked me \"Who is your valentine?\" - to further understand this, I have to say that I felt really uncomfortable with my body (because I thought that I am really ugly), that I was bullied when I was young and that I was really insecure towards women - I was standing there completely perplex, staring at her, thinking that she is mocking me because I didn't have a girlfriend back then and I thought that it was so obvious that a guy like me can never have a girlfriend. She did really want to know who my valentine was and I told her to say me how much I had to pay and that she should leave me alone. My emotions were too strong for me so I started sobbing but unfortunately just when I started doing this, her boss came across, saw me and asked if anything was ok. As you can imagine, her boss told her to come with him to \"clear up some things about how to treat customers\". I went out and I have never seen her working there again and I feel pretty bad about it.",
        "created_utc": 1488992384,
        "upvote_ratio": ""
    },
    {
        "title": "Watched some customers nearly completely ruin some poor cashier's mood..",
        "author": "cl1i",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5y6jjh/watched_some_customers_nearly_completely_ruin/",
        "text": "So, a while back, I was off shopping at the mall for a new outfit to wear to my sister's wedding. I had no experience in buying formal clothing at the time, aside from the pickings at thrift stores. My mom had given me enough money to buy the whole outfit, and I had chosen Popular Clothing Store to go to.\n\nI got to where I needed to be for my dress shirt. I had decided that all the women's button up shirts were too feminine for my tastes, but I didn't know how men's sizing would translate to my body type. I waited around for a few minutes, and noticed an employee (E) making her way over to the register. Two men (M1 and M2) had been shopping around for a while before me and were now hovering around the register, so I figured that they should have her help first.\n\nE approached the register, looking bright eyed and bushy tailed. She was really young, and it's entirely possible that this was her first job.\n\n&gt;E: Sorry about the wait, I--\n\n&gt;M1: Do you work here?\n\n&gt;E: Well, I'm behind the register! :) How can I he-\n\n&gt;M2: If you don't work here then don't waste our time.\n\nI looked over and saw E's face absolutely drop. Her smile was gone, and she was suddenly less bubbly than she was before. My heart hurt for her. She agreed to help them anyway, and I stepped away to browse while I waited my turn for her help. I looked over every once and a while to see if they were checking out yet, and every time I looked she had this sullen look on her face, and the men seemed to be just as abrasive as they were earlier. After an eternity, they paid and left, and I timidly made my way over to her.\n\n&gt;Me: Hey.. um... if you're not busy I have a couple of questions about these shirts..\n\n&gt;E: I'm not busy at all. How can I help you?\n\n&gt;Me: :) Thanks. I don't really know which size of shirt to get for myself, and um, I keep getting lost in the store. I think that the best person to ask about it would be the chick behind the register, right?\n\nI gave her a wink and a nod, and suddenly she lit back up, smile back in full force. E even called another employee to watch her register for her, and went absolutely above and beyond with helping me pick out my ENTIRE wedding outfit, not just helping me size the shirt. It took nearly 45 minutes, and she escorted me from shirts and ties all the way down to my shoes.\n\nI'm so grateful for employees like E!\n\ntl;dr bouncy cashier tries to make a lighthearted joke with customers who immediately shoot her down. I wait my turn and then timidly ask for help and manage to make her smile. She then graciously spends nearly 45 minutes helping me find every single thing I needed.\n\n",
        "created_utc": 1488956824,
        "upvote_ratio": ""
    },
    {
        "title": "The Time I Was *That* Teenage Customer",
        "author": "turtlessayrawr",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5y5m2d/the_time_i_was_that_teenage_customer/",
        "text": "Apologies for formatting, am on mobile. The purpose of me sharing this is to maybe give a little hope to retail/fast food/other jobs dealing with the public that there are those of us dumbass patrons who either realize we were total twats, are struck with karmic punishment for our twatness, or both. \n\nThis tale takes place a few years ago. As some backstory, the event consisted of myself, my younger brother (Bro), our mutual friend (F), and our friend's girlfriend (GF). We were all in high school and of course, stupid teenagers. And as stupid teenagers do, we decided to go to our local big box mart and dick around because that was what The Cool Kids™️️ did. \n\nIt's important to note that none of us had jobs and thus, didn't realize what twats we were actually being (or in Bro's case, knew but simply didn't give a fuck).\n\nWe arrive at the big box mart and Bro and F make a beeline for the bikes. GF and I half heartedly attempted to keep them from fucking up all of the shit, but gave up and laughed at their antics. \n\nBro and F were racing child-sized bikes up and down the aisles and generally causing a ruckus. Before long, they had ditched the bikes and Bro decided to sneakily climb on an empty shelf while F and GF wandered an aisle down. \n\nI put my hand on the shelf and leaned down to tell Bro, in between giggling fits, that he really shouldn't be on the shelf. \n\nRight then an employee pushing a cart of merchandise/patron wearing an eerily similar outfit to that of the store uniform, rounded the corner and barked at Bro and I to get off the shelf and stop being hooligans. There was a lot of Bro calling her an old cunt and me being indignant that someone would suggest that I would climb on a shelf. \n\nBro and I met back up with GF and F. Bro and F decided to go to the upright enclosure containing giant rubber balls, and pulled some out and started throwing them at each other. GF and I had given up on any sort of wrangling of the hooligans, and just laughed along. \n\nThe same employee/employee lookalike tore us all a new collective asshole. Bro then called her more names. Why we didn't have security called on us, I don't know. \n\nWe left shortly after. A few months later, I graduated high school and got my first job...in retail. I came to loathe the teenagers who came in solely to goof around. It was that karmic punishment for my sins that I realized that retail is already a shitty job-there's no need to make life harder on the poor employees because I feel like I'm entitled to the laughs.\n\nTL;DR a bunch of ~*edgy*~ teenagers decide that being obnoxious in a store is a good idea. One of them receives justice when she starts working a shitty retail job dealing with the same kind of obnoxious teenagers\n\nEdit: I just fucking realized that I misspelled 'public'...I was wondering what was up with those 'pubic' comments...",
        "created_utc": 1488944117,
        "upvote_ratio": ""
    },
    {
        "title": "\"You should've been trained to use the thing!\"",
        "author": "tasos500",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5y2ic5/you_shouldve_been_trained_to_use_the_thing/",
        "text": "So, there was this sale at my local retailer for some Steam games, with Civilization V Complete Edition down at 10€. Quite a bargain, I said to myself and went there with the cash I needed. \n\nI go there and ask for the game, for which I get a card to pay for it. Afterwards at the register, they try using a Content Card machine, which runs on Android. However, the device needed to be connected to a WiFi network, and the thing wasn't online. But when they tried entering the settings, the kiosk app rebooted, blocking them from making a purchase. They tried rebooting the device altogether, but nothing changed. \n\nThey then admitted not knowing how to use the device, and refunded my purchase. I had to wait 15 minutes in a hot store, just to be told they couldn't get the game I wanted. The only good thing from this story is that I gave the money as change, but I got a 10€ bill during the refund.",
        "created_utc": 1488912355,
        "upvote_ratio": ""
    },
    {
        "title": "You're not actually closed. Just lazy.",
        "author": "bad_wolf_girl_77",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5y0ukf/youre_not_actually_closed_just_lazy/",
        "text": "A family member is in the hospital and was scheduled for an early surgery. The hospital is located about an hour from my hometown. The day before the surgery an aunt who was staying at the hospital had stopped for breakfast in a town between Hometown and Hospitalville. Scatterbrained aunt accidentally left her coat at the 24 hour Burger Place where she had breakfast. Since she was staying at the hospital and I was coming in the morning of the surgery she asked me to stop in and see if they had her coat. \n\nThe day in question (less than 24 hours after the coat was left. If it's important.) I pulled into the 24 hour Burger Place at around 4:30am. \n\nThe dining room was empty. There were no waitstaff around so I went to wait at the counter by the cash register. There was a man working the grill and loading a bag of food for the drive thru. He looked at me a couple of times while he was bagging the food and again as he walked to the window to hand the bag out to his customer. He looked at me again as he came back to the work area and wiped up a few spills. \n\nThen he turned and walked to the back of the restaurant and left me alone in the dining room. I looked around the cooking area to see if anyone else was hanging around. I waited around 10 minutes alone in the front of the restaurant. Finally I walked to the edge of the waitress prepping area and called out (friendly. Not angry.) \"hello?\" Twice. \n\nThe grill guy comes back out holding a piece of paper. \n\n\"Uhhh. Sorry ma'am. The dining room is closed. I was about to put this sign out.\"\n\nHe held up the paper and showed me. It had \"dine room close til 7.\" This was a full sheet of paper. That was written in small letters taking up approximately 1/8th of the page. (It should also be noted that there were four entrances to 24 hour Burger Place and he possessed only the one sign. \n\nI assured him I didn't want food and asked about the coat. He merely shrugged and suggested that I come back later that day and ask someone else. \n\nAs I was leaving he followed me to the door holding the sign and made a big effort to look like he was hanging it on one of the four doors. Of course he only had the piece of paper. No tape or any other means with which to attach it. \n\nI ended up sitting in my car for a moment to start my map and music but I looked at the doors as I pulled away. He was nowhere near them and the sign wasn't in sight. ",
        "created_utc": 1488899031,
        "upvote_ratio": ""
    },
    {
        "title": "Today I saw patience and respect for fast food workers. (x-post from /r/pointlessstories)",
        "author": "OtherAnon_",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5xy7ap/today_i_saw_patience_and_respect_for_fast_food/",
        "text": "I was told this place might enjoy this story, so here it is!\n___\n\nA few minutes ago, I was at a line waiting for my food at a fast food restaurant. It was slow, as in *very slow* and after several minutes (30 minutes at least) me along many other customers weren't receiving their food yet.\n\nIt was totally understandable though; there were at least 20 people in line, and the place had only one guy at the kitchen, one woman as a cashier and one manager coordinating and serving the food.\n\nThen at one moment, this one guy on the back steps forward and yells something like: \n\n*\"Can't you go faster?! I'm freaking starving here! Why don't you people have more staff?!\"*\n\nAt this moment everybody starts looking at him somewhat annoyed. Then he addressed the lady who was the manager.\n\n*\"Why don't you hire more people? You're the manager!\"*\n\nThen *everyone* began glaring at him. \n\n*\"She's not responsible!\"* Said the young students next to me.\n\n*\"Just wait it out like everyone else!\"* Said the mom with a child on her arms.\n\nAnd then the manager goes: *\"We're going in order.\"*\n\n*\"Well, tell him to go faster!\"* The man pointed at the man cooking and crossed his arms.\n\nThere were a couple of whispers afterwards saying how disrespectful he was, and then the two students told the manager the man was just \"talking shit\". I kinda hoped he spoke once more so I could respond to him and tell him to be more respectful of people who work their asses off everyday and who are treating us nicely, especially those who are making us food.\n\nBut he remained quiet, angered still.\n\nFew minutes later I got my food and by chance he sat right next to me. In fact I wrote half of this post while he was there. He sat down *\"aggressively\"* and ate pretty fast and then left behind his very, very dirty tray.\n\nI have to say, I was pretty happy that people were so respectful and nice to the workers, we were all hungry, but we understood there were people behind the counter and that is what matters.",
        "created_utc": 1488858834,
        "upvote_ratio": ""
    },
    {
        "title": "I was prompted to give a survey about my banking experience after closing my account with a bank. This is my response.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5xy1rf/i_was_prompted_to_give_a_survey_about_my_banking/",
        "text": "[deleted]",
        "created_utc": 1488856996,
        "upvote_ratio": ""
    },
    {
        "title": "My friends and I have a running joke that you literally have to die to get out of your contract with Sprint.",
        "author": "durentis",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5xwabk/my_friends_and_i_have_a_running_joke_that_you/",
        "text": "[removed]",
        "created_utc": 1488837918,
        "upvote_ratio": ""
    },
    {
        "title": "A forgetful customer",
        "author": "thorndawg1337",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5xvs4z/a_forgetful_customer/",
        "text": "Standered LTL, FTP on mobile\n\nI had a simple, but good experience as a customer recently. Gotta set the scene for you. Had a bad storm blow through a while back and a large tree fell over in the storm. Last Saturday we spent the day cutting that tree up and cleaning up the area. \n\nAs soon as we had that done, the day was almost over and I left to town to get some stuff for taco salad that we needed. Decided to stop at a certain roller blading drink stop to get a drink. Pulled through the drive thru, lady walked up (yup, our location doesn't rollersblade) and I forgot my wallet. She was quite understanding and told me to take it. I promised to come back and pay for it and I did. It was nice to see a little trustworthiness.",
        "created_utc": 1488833126,
        "upvote_ratio": ""
    },
    {
        "title": "You should indicate that you're closed",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5xtuqm/you_should_indicate_that_youre_closed/",
        "text": "[deleted]",
        "created_utc": 1488814601,
        "upvote_ratio": ""
    },
    {
        "title": "Sunday Brunch",
        "author": "AJClarkson",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5xpcby/sunday_brunch/",
        "text": "I didn't know whether to put  this here or in Tales From your Server.  I decided here, since I was a customer, not a server.  \n\nSo my Younger Daughter got her tax return, and wanted to celebrate by taking the family out to eat.  We decided on Sunday brunch, so after church, me and Hubby, Younger Daughter, Younger Son, Elder Daughter and Elder Daughters two sons (ages 3 and 2) went to the Many Nations Home of Flat Bread-like Goodness.  HOLY MOLEY!  We rarely go out to eat, so we were not prepared for just how crazy the brunch rush could be.  There was not room enough to take a deep breath; every table was full, it was LOUD, the wait staff was running nuts, and here we are, a 7-top with a wheelchair (me), a high chair and a booster seat.  \n\nSo the reason I write is our waitress.  She was WONDERFUL.  Despite the fact that the restaurant was insane, she was already in the weeds, and we were such a large group, she was cheerful, quick to answer questions, and perfectly patient with our special needs and last minute orders.  No, we were not overly demanding; we had like two substitutions  (nothing unusual), and that's it.  I specifically said to my family about my reading on Reddit of how bad things can get, and please keep special requests to a minimum, and they did.  We emphasized several times, \"Take your time, we're not in a rush.\" \n\nHer response to \"take your time\" told me that it had been a rough morning so far; she looked ready to kiss me for saying it.\n\nIf I had been in that girl's situation, well, I wouldn't have been in  that situation.  NO WAY could I survive being waitstaff in a restaurant as insane as that  one was; I'd have wimped out the first time somebody growled at me.  But this girl  (okay,  woman, she was late thirties, but I'm old, everybody looks young to me), she had a smile the entire time.  She was sweet, she was friendly. The kitchen forgot one of our items and she apologized two or three times about it (we reiterated, it wasn't her fault, and no big deal).\n\nAs the meal ended, and things were quieting down, we were able to speak to her a bit.  She had only been waitressing a week.  A WEEK.  This was her first brunch rush, and she was still able to smile.  She was able to put up with all the crazy that came in with us.  She made my grandsons giggle, and Younger Grandson wanted to hug her (he never gives out hugs to strangers)  Wow.  Just wow.  \n\nLong story short (too late!), she had done such a great job, I gave her a tip that was a little more than typical (my calculator said it was 23%, so hardly shocking) all the cash I had in my billfold (my daughter was paying on her debit card).  I just handed it to her, and she crammed it in her pocket uncounted because things were starting to pick back up and she needed to run.  But about five minutes later she came back and hugged my neck and whispered in my ear, \"You gave me too much.\"   My response was, \"Today, it was exactly the right amount.\"\n\nArrin, this is for you.  You may be new to the biz, but you did good, girl. \n\n(NOTE:  normally I know you don't hand tips over directly.  But as crowded as the place was, I didn't like the notion of just leaving money on the table and hoping it wouldn't be grabbed by some passerby. It didn't occur to me to put it on the card until I got home.  Like I said, we don't eat out a lot) ",
        "created_utc": 1488750830,
        "upvote_ratio": ""
    },
    {
        "title": "I'm ashamed of my mom in a way",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5xlsl5/im_ashamed_of_my_mom_in_a_way/",
        "text": "[deleted]",
        "created_utc": 1488699563,
        "upvote_ratio": ""
    },
    {
        "title": "When the Universe Tells You",
        "author": "rusty0123",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/5xkbov/when_the_universe_tells_you/",
        "text": "I'm out running a few errands today...or that was the plan. It's cold and rainy and I would rather be home curled up with a good book. \n\nFirst store I stop at, the card machine wouldn't take my card. I knew there was something wrong with the machine the minute I stuck my card in. There was way too much \"give\" in the slot. \n\nNow, I hate the card machines in this store anyway. I have a card with a chip. It won't let me swipe the card. If I try, it tells me to insert the chip. I don't like that because it makes me leave the card in the machine until the transaction is complete, and one of these days I'm gonna forget that card in there. Anyway....\n\nI can't swipe, and the insert slot is broken. Each time the machine errored out, the clerk said, \"Try again.\"  After the FIFTH time, I said, \"Something's wrong with your machine.\" \n\nShe replied, \"Oh, they're all like that. You need to hold the card in so it doesn't slip.\"\n\nWell, no. They are NOT all like that. I shop there often, and this is the first time it's happened. \n\nBut...I sigh to myself and try again. And again. And again. And FINALLY! It takes the card. \n\nAll this time, the clerk is standing there staring at me. She hasn't bagged my stuff. She hasn't done anything. So after I get the card to work, I start to bag my stuff. I guess she decides I can do this all by myself...and she starts checking out the next customer and throwing his stuff on top of mine. \n\nSo now I'm sorting through another customer's stuff to make sure I get all mine. \n\nGet it done and get out of there. \n\nHome and a good book is looking better and better. I decide the rest of the errands can wait until tomorrow. I'm gonna pick up some take out and go home. \n\nAt the take-out place my total is $9 and some change. I give the cashier a twenty. They have an automatic change dispenser. \n\nSo while I'm gathering my coins out of the dispenser, I see, out of the corner of my eye, the cashier turn away from me and SLIP MY $10 CHANGE IN HER POCKET!!\n\nAnd she goes running down the line to \"help\" another customer. \n\nI stand there in disbelief for a minute or two. No employee makes eye contact with me. \n\nI check my receipt. She's rung up the cash tendered amount as $10, not the $20 I gave her. \n\nSo I check my wallet, just to be sure. Nope. Gave her a $20. \n\nI debate for another minute or two, but it's hopeless. The register won't be over because she took the extra $10. The receipt shows I only gave her $10. \n\n\nI went home. FML",
        "created_utc": 1488676338,
        "upvote_ratio": ""
    }
]