[
    {
        "title": "What do yall think is a reasonable amount of time between pizza coming out of the oven and pizza arriving at the customers door?",
        "author": "FavoriteActorDennehy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6811ig/what_do_yall_think_is_a_reasonable_amount_of_time/",
        "text": "",
        "created_utc": 1493355053,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't want to be the asshole who orders 10 minutes to close\"",
        "author": "NotebookScribbles",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/680zoc/i_dont_want_to_be_the_asshole_who_orders_10/",
        "text": "It's unnecessary to say this. We both know you're still going to place that order.\n\nI don't mind making orders that close to closing time. I really don't. But don't apologize 80 million times, and stop asking if it's okay, over and over again, like I'm allowed to say no. Just order your stuff and be on time to pick it up, or be ready to answer the door if it's a delivery.\n\n**Tl;dr - stop making ME comfort YOU repeatedly because you're ordering at the last minute.**",
        "created_utc": 1493354350,
        "upvote_ratio": ""
    },
    {
        "title": "I am actually a pizza customer and this just happened.",
        "author": "SnazzyDragon62",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/680qnw/i_am_actually_a_pizza_customer_and_this_just/",
        "text": "I order a large 3 topping pizza from a well known chain on a special currently happening. The cashier kindly takes my order and said it will be 30 to 45 minutes. I am in the middle of a late overwatch session and need to slip out for some chips and beet as well but figure I have time. \n\nAnyways, to keep things short. He calls me. I'm a few minutes away. He is waiting at my house and trips off my curb when he comes to meet me. \nThe two receipts and his pen fly off into the might and I jump on grabbing them.  \n\nI tipped him 6 dollars and apologized for him having to wait for my irresponsible ass. ",
        "created_utc": 1493351035,
        "upvote_ratio": ""
    },
    {
        "title": "I think I made the right decision.....",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/680kmd/i_think_i_made_the_right_decision/",
        "text": "[deleted]",
        "created_utc": 1493348895,
        "upvote_ratio": ""
    },
    {
        "title": "Drivers: How much do you tip out your in stores at the end of the night?",
        "author": "Siigari",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/680gnf/drivers_how_much_do_you_tip_out_your_in_stores_at/",
        "text": "[removed]",
        "created_utc": 1493347527,
        "upvote_ratio": ""
    },
    {
        "title": "Pro'tip'",
        "author": "EPakaTHEBEST",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67yfox/protip/",
        "text": "I'm a pizza delivery guy - have been for 4 years. Just a protip.\n\n If you give me a cash tip and then also write that amount on the receipt where it says 'tip' and then write the added total - you just tipped me twice.  By the end of the night I'll forget who gave me cash for deliveries and claim that like any other tip. Sorry, but there's no proof that you gave me cash and I've honestly got nothing to lose.\n\n\nPro'tip'",
        "created_utc": 1493325809,
        "upvote_ratio": ""
    },
    {
        "title": "Tip Question",
        "author": "myacacct",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67xvmf/tip_question/",
        "text": "OK so I ordered some food through Uber eats. Now the bill was originally 26 bucks but with the discount it was now 11. I just want to know that since I gave the dude like three dollars in dollar coins.I was just wondering if that was a decent tip. I didn't make him come up like three flights of stairs I met him at lobby. Thoughts?",
        "created_utc": 1493320664,
        "upvote_ratio": ""
    },
    {
        "title": "Any franchises that provide their drivers with a car?",
        "author": "the12catholics",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67wk53/any_franchises_that_provide_their_drivers_with_a/",
        "text": "Hey everyone.\n\nRecently my 2001 VW Passat has been having engine problems and I'm left without a car. I wanted to work full-time this summer while I'm off from college, so I'm in a pickle.\n\nAre there any franchises that provide their drivers with a car?\n\nThanks for the help!",
        "created_utc": 1493308910,
        "upvote_ratio": ""
    },
    {
        "title": "Can I invite the pizza guy in for a quick blowie from the wife?",
        "author": "30under30_Gryphon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67wbdp/can_i_invite_the_pizza_guy_in_for_a_quick_blowie/",
        "text": ".. Or is this cliche &amp; over the line?\n\n\nWife &amp; I will be away celebrating our anniversary next week in a lakeside inn just outside of town.\n\nWe've had 2½ threesomes (mmf) over the years &amp; have joked about the pizza guy scenario.\n\nNearly invited the young driver inside last year but I hadn't talked it through 100% with the wife first, lost my resolve in the moment and had some lingering regrets for the rest of the evening.\n\n\nSo this year we'd really like to try it.\nWife would just suck his cock if he's in a hurry or rock his world if he was up to stay awhile.\n\n\nSo are we good? \nI don't want to come off as creepers or anything.\n\n\n[I apologise if this post doesn't belong here, wasn't sure where else to put it.]\n😉",
        "created_utc": 1493306719,
        "upvote_ratio": ""
    },
    {
        "title": "Low Income Areas/Crime Areas",
        "author": "Trubsy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67tj47/low_income_areascrime_areas/",
        "text": "Rant time. Why the fuck do we have to deliver to shitty parts of town? There's ~5 apartment complexes in my delivery zone that are notorious for gangs/drugs/robberies/break ins, etc yet every company around here delivers to them. \n\nI'm not supposed to take $50s on deliveries, but sometimes I make an exception. I got to the apartment I had a delivery for, knock a few times and wait about 5 minutes for a kid to open the door. He looks confused so I asked if anyone home ordered pizza. He said yeah and he'd be right back. About 5 minutes later he comes back with a clearly fake 50. Shit felt/looked like computer paper. I ask if they have smaller bills or a credit card because we can't take 50s and hear the mom about 10 feet away start bitching and yelling \"We ain't got nothin smaller than a 50 take the food back to the store then.\" Cool thanks for making me drive out for nothing. I went back to the same complex a little later and low and behold a guy from a different pizza company at the SAME apartment walking back to his car and leaving with pizzas still in hand. Most places don't take 50s, and ask over the phone if they do. Also, don't use clearly fake money and expect someone to take it. Lastly, don't bitch at them for not taking it.\n\nI really wish we could blacklist certain areas or at least certain customers, but nope.",
        "created_utc": 1493268634,
        "upvote_ratio": ""
    },
    {
        "title": "What do you say as you leave?",
        "author": "halo1278",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67tbtx/what_do_you_say_as_you_leave/",
        "text": "I usually just say \"Cheers/thankyou\" and I'll throw a \"seeya later\" on the end if they are a regular customer. \n\nThe reason I'm asking is because I deliver to 2 different blind guys, they both order pretty regularly, I always feel weird as I walk back to my car realizing I said \"seeya later\"... because they won't see me later... but I do it out of habit 90% of the time, I literally can't help myself. ",
        "created_utc": 1493265816,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery Discord",
        "author": "trmbnplyr1993",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67t8nj/delivery_discord/",
        "text": "Ever wanted to talk with fellow delivery drivers around the world on a more frequent basis? Well you’re in luck!\n\nWanna complain about your last delivery?\nHave some delivery advice to share?\nNeed to vent about your coworkers?\nWanna know what it’s like at other pizza places?\nOr simply want to just talk with like-minded people?\nThis is the place for you!\n\nCome join the Delivery Dudes Discord Channel and chat with other drivers from around the world. There are voice/text channels if you want to talk while you’re on the road or at home. \n\nThis is meant to be a friendly, relaxed environment for people to connect and discuss everything delivery! \n\nNOTE: This Discord Channel is for delivery drivers only!\n\n\nHere is the link and feel free to invite any friends that deliver! https://discord.gg/pDrMp7e\n\nThanks, \nMike aka Porkchop Express",
        "created_utc": 1493264669,
        "upvote_ratio": ""
    },
    {
        "title": "Kicking a 70 year old man out of my upper crust store",
        "author": "snuggleouphagus",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67sgeg/kicking_a_70_year_old_man_out_of_my_upper_crust/",
        "text": "I have spent the last two years working in stores in lower income areas where I refused service 2-5 times a day due to their location, attitude, or language. I managed to get myself transfer to the nicer part of town, the part where you could get mini bundt cakes deliveries (so serious). \n\nI was hard at work because I knew two 20 pies were going to drop within the next 20 minutes and my instore was 2 hours late. Not a big deal, I'm a bad bitch and had all 3 of my drivers in the store. They were all qualified to be managers but chose not to peruse promotion because they are in grad programs. I got this easy. Then the old man walked in. Walkered in. \n\nSince I have no instores I'm the only person on a till and have to explain our (recently more expensive specials) \"I got a two topping for $10 or a 5 topping/specialty for $12!\" He thinks. \"Can I get the two topping but adds some onions and peppers and sausage?\" ... \"no. That's a 5 top.\" \n\nHe places a two top order. Eventually. In the time this takes my first 20 pie has dropped. \"Ok sir. That'll be ready in about 15 minutes!\"  I usually quote walk ins less but I was concerned about the large order. I start busting ass so these orders don't run late. \"Miss? Can I change my order?\"  Of course. We haven't got close to making it so I quickly change it and get back to making pizzas. \n\nLegit. Less than two minutes later he screams \"is my pizza ready yet?!\"  And I remind him \"no sir, like I said it will be about 15 minutes from when you ordered\"  Now hell breaks lose. \"Bitch I don't work for [company] you do! You never fucking told me it would be 15 minutes! Want me to tell your boss you're a lying bitch?\"\n\nWell...I'm the assistant manager and boss man is on vacation so...I'm the boss. And...I have no problem tossing out customers. I did it on the daily at my old store. So \"Sir, here's your $10.60. You need to leave.\" \n\n\"I ain't leaving til my pizza is ready!\"\n\n\"No sir. I'm refusing you service. You have a refund. You need to leave. If you don't leave I will call the police.\"\n\n\"Call the police! Most of them are my friends!\"\n\n\"[Driver] would you pull up the nonemergency line?\"\n\nThe old man grabs his things and turns his walker towards the door. But takes time to yell \"you motherfuckers need to grow some balls so this bitch isn't telling you what to do!\"\n\nYep. My drivers who are in grad school to be a lawyer, doctor, and a biochemical engineer really should get their shit together. ",
        "created_utc": 1493255433,
        "upvote_ratio": ""
    },
    {
        "title": "Had to kick out a customer",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67sbmu/had_to_kick_out_a_customer/",
        "text": "[deleted]",
        "created_utc": 1493253931,
        "upvote_ratio": ""
    },
    {
        "title": "How can I get hired by the same company but a different franchise even though I had a bad experience with a former supervisor?",
        "author": "BadDrvrsofSac",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67pm4g/how_can_i_get_hired_by_the_same_company_but_a/",
        "text": "I worked for a pizza restaurant for the second half of last year. The job lasted from the end of July to December. Some things happened and I threatened to sue for discrimination. \n\nThe threat of a lawsuit changed the supervisor's attitude but she did make thing incredibly hard for me including looking for anything possible to write me up on. \n\nI did love my other managers and coworkers. It was just my supervisor who was the problem. Before the falling out happened I was working roughly 30 hours a week with overtime because I was one of the few drivers at the this restaurant. \n\nOh and when I gave my two week's notice they paid me with the use of a card that I had to setup instead of a check as I'm used to.\n\nWith that said I love pizza and it's something I'm passionate about. It's fun interacting with the customers I meet in town. I'm moving to another area and the same pizza company is right next door to the area where I'm looking at moving to. Is there a way I can convince them that I'm still passionate about this? \n\nThe falling out wasn't my fault at the other place. The supervisor just didn't like me but everyone else did. ",
        "created_utc": 1493227325,
        "upvote_ratio": ""
    },
    {
        "title": "Not getting tips a good enough reason for transferring?",
        "author": "pizzaman1234567",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67no58/not_getting_tips_a_good_enough_reason_for/",
        "text": "I've already put in my 2 week notice because I haven't been getting tips in my current neighborhood. I've applied to a couple other pizza places, till I get hired I'm planning to drive Uber/Lyft. If asked during the job interview, should I mention the lack of tips as a reason for transferring? Can you recommend some other good reason? Thanks.",
        "created_utc": 1493208278,
        "upvote_ratio": ""
    },
    {
        "title": "Delivering to a Nursing Home",
        "author": "mattied23",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67k05f/delivering_to_a_nursing_home/",
        "text": "I've since left pizza delivery all together, but enjoy reminiscing and reading through this sub from time to time  \n\nSo we used to get orders just outside of our normal delivery zone pretty regularly. Usually decent size orders consisting of meals for several of the staff. Each staff member would chip in $2 or $3, plus I got multiple delivery charges because they paid separately. Problem was that I would have to wait forever and a day for the people at the front desk to find who ordered the food  \n\nOne particular time that stands out is when I had been waiting for close to 10 minutes and one of the residents rolls over to me with her wheelchair and starts making small talk. She seemed to be talking normally but then began babbling. All of a sudden, the person who ordered the food comes around the corner, and scolded me for engaging in conversation with her patient. Ya know, because it's totally my responsibility to control her patient",
        "created_utc": 1493159141,
        "upvote_ratio": ""
    },
    {
        "title": "Former manager (pizza) texted the wrong number....",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67hrvp/former_manager_pizza_texted_the_wrong_number/",
        "text": "[deleted]",
        "created_utc": 1493138795,
        "upvote_ratio": ""
    },
    {
        "title": "Scary customers...",
        "author": "ArealPizzaGal",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67evq9/scary_customers/",
        "text": "I work for Domino's in a pretty small town  (population 14,000). Being a girl, it's normal to get obnoxiously hit on by customers I'm delivering to. We have this one customer who always asks for the 'pretty' girls to deliver to him. My store only has two girls (including me). I'd say he's in his mid fifties. My other female coworker took a delivery to his house  and he asked for 'that blonde girl'. I kind of laughed it off and ignored it. \n\nFast forward a few days. I'm working a late shift, it's around 11:30. I'm getting out of my car, about to walk into the store...when a vehicle pulls up next to me. It's the one customer who was asking for me. He rolls down his window and asks what I'm doing out so late. I say something along the lines of just working. He proceeds to invite me over to have some beers, I quickly refused and walked inside.\n\nHe saw my car, recognized it, and followed me to the store. That's what really freaked me out about the whole situation. Am I overreacting by that? ",
        "created_utc": 1493102024,
        "upvote_ratio": ""
    },
    {
        "title": "This one kid",
        "author": "BT4life",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67eonu/this_one_kid/",
        "text": "So a few weeks ago I get a double. I arrive at the first house and knock. I hear a woman say \"&lt;customers name&gt; your foods here!\" A guy maybe 17-22 answers and says \"I didn't order anything\" he confirms the address and I call the number. No answer. Manager tells me to move on. 2nd order is $150 15 minutes out no tip. Nearly an hour with nothing to show for it. \n\nAs expected I'm a little salty at this point, especially since the guys name was the same as the reciept. Next day he schedules an order and cancels right before it's done. Repeats twice. \n\nFinally I get my manager to blacklist him. But I want to know wtf his deal is. Is he telling his parents he's ordering pizza for cash? Does he really think it's funny?",
        "created_utc": 1493098908,
        "upvote_ratio": ""
    },
    {
        "title": "Dealing with drunks..",
        "author": "kneightwolf",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67efj6/dealing_with_drunks/",
        "text": "Tonight was fairly dead as far as business goes, and I ended up taking a delivery to a local bar late into the night. So I get there, look for the guy, and can't find him. Both me and another guy there tried calling him, but to no avail.\n\nAt this point, every customer and the bartender are offering to pay for it, and all I can tell em is \"im sorry, but I can't take your money. Something may go wrong and it may come back to bite me.\" \n\nSo now, I give the guy five minutes, and he still hasn't shown up. I call my boss and he tells me to come back to the store. On my way back however, the customer calls me and starts complaining, telling me to come back. I just tell him to call the store.\n\nSo I arrive back at the store, and my boss tells me that the guy is now at the bar, and to go back. So I go back out to the bar, and look for the guy. The guy that attempted to call the actual customer is being belligerent and claiming that he's the customer. Finally, the actual customer comes up, and immediately tries to pay with a $100 bill. \n\nI just politely tell him \"I'm sorry, but I don't have enough change to break that\". He kinda freaks out, gets change from the bartender, and pays for it. \n\nAt the end of the transaction, he just tells me \"look, I'm not mad at you, I'm just pissed at your management. They should have let you accepted the payment from the other customers. I even told your boss that you guys should gimme a discount and it can just come out of your pay.\" \n\nI just tell him something along the lines of \"I apologize for the inconvenience, but you weren't here when I showed up. It's none of our faults. Have a good night.\" \n\nHe ended up letting me \"keep the change\" (which was like 40 cents, which granted, is still more than I thought I'd get from this guy), and on my way out the door, I heard the guy shout \"Well I sure told him off, didn't i?!\". I couldn't help but to just laugh at his stupidity. It's not my fault that you weren't there when I showed up lol. And I didn't even speed to get to him.",
        "created_utc": 1493095285,
        "upvote_ratio": ""
    },
    {
        "title": "Over 12 hours of a major fire that shut down a major road and I'm the bad guy when we can deliver to you....",
        "author": "Deadpoolssistersarah",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67e4ma/over_12_hours_of_a_major_fire_that_shut_down_a/",
        "text": "Tl;dr- huge fire in my delivery area and we keep getting complaints when we cancel deliveries right next to the fire",
        "created_utc": 1493091371,
        "upvote_ratio": ""
    },
    {
        "title": "I hope they enjoyed their Dr. Pepper shower.",
        "author": "Purpleliketastes",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67drj9/i_hope_they_enjoyed_their_dr_pepper_shower/",
        "text": "So this happened about a week ago, it was near closing time and we rarely get orders past 11:00 PM so I usually spend that time cleaning and generally doing everything I can to get out of the store as fast as possible. \n\nWe receive an order this night, it can't be more than 10-15 minutes from midnight, I'm ready to finish up for the day but whatever, I suck it up and grab this guys' order of breadsticks and a 2 liter of Dr. Pepper. Sure enough it's the shitty ghetto trailer park on the northern side of town, where it feels like a maze because certain areas are closed off, the numbers on the trailers are sometimes impossible to read if they're even there and to finish it off the roads are terrible and have what seems like 3 or 4 speed bumps on every street.\n\nSo I get to the residence, I'm already agitated enough but this guy has the audacity to a.) tell me he really just ordered for the soda as they were all out and the corner store had just closed and b.) not tip a single dime after making me come out to this hell hole on a Tuesday night, well passed midnight at this point. On top of that he had this douchey attitude that wasn't outright disrespectful but you could tell he didn't give two shits about the guy handing him his precious Dr. Pepper, in his mind I'm sure he probably felt he was doing me a service in some twisted way.\n\nI'm heated enough, but not even 2 minutes after leaving this dick's house I get a call from my manager telling me that the customer had called the store to inform us that the guy ordered TWO 2 liters and asked if I could stop off at a gas station and pick one up and he would reimburse me. I'm steamed at this point but it has nothing to do with my manager (douches exist and I didn't read the ticket properly) and he's actually a pretty cool guy so I agree to do just that.\n\nI'm not ashamed of what I did, as if the bumpy ride back to his trailer wasn't enough, I grasped that 2 liter of Dr. Pepper firmly with both hands and gave it three (I counted) good shakes, at this point the bottle was as stiff as the justice boner in my mind. I get to his house and give him a \"my bad, here you go\" and drive off.\n\nI'd like to say that this made me feel 100% better, but the whole incident just left a sour taste in my mouth. Both this guys' selfishness and me witnessing this devious side of me that I've maybe only seen once or twice in my lifetime just left me bitter for the rest of the night.\n\nThinking back though, I don't regret a single shake.\n\ntl;dr - douche orders soda from pizza place minutes away from closing, doesn't tip and lives in a shitty neighborhood, I forget one of his sodas, go purchase one from a gas station and angrily shake it before giving it to him",
        "created_utc": 1493086984,
        "upvote_ratio": ""
    },
    {
        "title": "The first worst incident of my job.",
        "author": "psychickiss",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67db0k/the_first_worst_incident_of_my_job/",
        "text": "Hello there! I'm still a somewhat new driver, but I'm quite satisfied with the job that I have. It's only been four months since I started and this job beats any other job I had, minus maybe the halloween acting jobs I get involved with every year. I work between two stores of a small chain that has a few stores throughout the state, they stay open quite late and are fairly busy. One is located in the citys and the other is located in the suburbs and is considered the 'nice' part of the overall area. Managers and co-workers from both stores are pretty chill. \n\n\n\nThat was just the background though, this is where the story starts.\nThis was a morning shift on Thursday (aka 4/20), and we were fairly busy at the store. It was one of those days where the other day driver was getting all the tips and I was getting all the stiffs. I think overall I made about 31$ that day which is usually what I expect out of a day shift. We were slammed though during our lunch rush, where me and the other driver were getting 2-3 runs. \n\nIt was noon and I had three runs, one was to an apartment complex down the road, another across the street, and the last one was a bit further away but it was in that general direction. I went to the first one and it was annoying as it was one of those apartments that has multiple doors to get into it, so I had to spend a bit of time there and ended up getting tipped .83 cents as well as a nice '4/20' fragrance. \n\nMove onto the second delivery, it was a few subs and a cheese bread, ok cool. The place I go to though is in an area I've never been into. I had to talk to a security guard to get in, so I first thought this was like a retirement home or some kind of business. No, this place was a neighborhood of mansions, like these are the houses that you make when you want to get creative in the sims. I wanted to take pictures of some of these houses, but I had a job to do so I went to the address and pulled up. \n\nI noticed though that the insider who bagged up all of the stuff though forgot the cheese bread, and instead put in a small pepperoni pizza. I figured though I would explain to the customer that I would call the store and get it replaced right away if they didn't want it, and we would discount it off due to messing it up (or allow them to keep it). \n\nThe following exchange took place (as far as memory tells). \n\nMe - Me \n\nGuy - Not my buddy, but a docuhebag\n\nSMom - Soccormom wife\n\nMe - *knocks on the door* Hello there! I really have to say the house you have looks great\n\nGuy - \"You are 1 hour late, where the fuck is my food\" - (note we quote a 30-45 min time and it was only 13 mins late)\n\nMe - \"Oh its right here, however I noticed an error in the order\"\n\nGuy - What the fuck? You cant even get the fucking order right, god damnit \n\nMe - Oh well, we can ....\n\nGuy - I don't want to hear your excuses \n\n-He then grabs the food from me that I have and slams the door on me. I knock again, as I need to see what to do-\n\nMe - I need you to sign for that, so we can get your other order out here \n\nHim - Urgh fine.......\n\nSMom - -Takes the cheap tablet I use for people to sign their signatures on- \"What is this I don't understand\" \n\nGuy - This fucker is trying to get money from us, fuck him\n\n-He then slams the door on my face again, before I knock on it one more time\n\nMe - I need my tablet...\n\nGuy - I don't care, you fucking stole from me so I'll steal from you. \n\n-He then gets in my face, and this dude is fucking huge. He is about 40 some years old and he is a buff looking dude standing at about 6'5 or something-\n\nMe - \"Ok, well get it for you\"\n\nGuy - I'm going to get your ass fired you fucking fat fuck, go to the gym and do something with your life.\n\n-He then throws the tablet in the yard, but its sturdy as fuck so it didn't break or anything-\n \nGuy - Get the fuck out of my yard before I call the cops on your ass\n\nNow, I don't remember every line exchanged, but that was the summary of the situation. In all honesty, I'm not a strong person when it comes to stuff like this, hell I've taken a few therapy sessions in order to learn how to cope with negative conflicts, aggressive people, and general confidence issues I have. I was shaking pretty bad and had a rather violent panic attack. I had another order to do, so I called my manager, explained the situation, and went on the next drive. \n\nI was still shaking pretty bad, and even threw up a little bit in the trashbag in the car. The lady I went to after that house thought I was faking everything and signed a tip as zero and wrote in the reason saying \"come up with a better sob story\". All I told her was that the last delivery I had was a bit rough, and that was it. I ended up calling my mom on the way back to the store in order to try and cope, but I was still kind of messed up. \n\nWhen I went back to the store, I got to sit down for a little bit. It was the eye of the storm on our lunch rush so I got to breath it out and talk to my manager. We didn't call the cops or anything because there was no proof one way or the other, and the people did end up getting their cheese bread. Our store doesn't actually have a blacklist. (The one in the city does, but not this one), but I was personally blacklisted from going to that area every again par request on my part. He was still kind of new to being a manger, but I feel like he handled it well as he helped calm me down and talked to me like a normal human being rather than how previous managers at other jobs have talked to me. \n\nThe other driver was able to take the food to them and they were not outraged like before. The other driver though is a lot more apathetic than I am, and he has been in customer service a whole lot longer than me. I'm glad nothing had happened to him though as he was a lot smaller than me, and if this guy was as aggressive as he was with me, then I don't know what would of happened. \n\nI sort of got to talk about this in real time on one of the delivery discord servers, so the account that was given on there is more accurate as I'm someone who forgets small details whenever something even slightly traumatic (aka draws out a panic attack) happens to me. \n\n**TLDR:** Guy throws a tantrum for getting his food late and his order wrong, and it really scares the shit out of me and ruins the next couple of days for me, mentally. \n\nIf any of you guys know of any good coping methods in case any of this stuff happens again, I'd love to hear them. This kind of stuff doesn't happen much, in fact I was shown an online file of all 'aggressive reports' as well as 'police reports' made, and the total of both didn't even crack twenty reports in the past 8 years the store was there. I was just rather unlucky it seems. \n",
        "created_utc": 1493081812,
        "upvote_ratio": ""
    },
    {
        "title": "I'm so frustrated (again).",
        "author": "Jaitzche",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67cv2p/im_so_frustrated_again/",
        "text": "I posted a few weeks ago about dealing with another acting like a child. I don't know how to link it on here, but basically he accused me of skipping orders, went to manager and forced me to take a notoriously bad tipper at the edge of our delivery range while he got to take double after double. \n\nSo to today. \n\nI clocked in there were no deliveries up and The Child was out (17 mins, to be exact), delivery to Lemon goes up. It's the first one on the screen. As I route out the second one comes up. I go take the first one because it's clear across town and the next two are a double. I get back, he's on the next two. I'm working on dishes and he comes up and starts going off on me about not taking the second one because he \"knows\" it was up first. I told him Lemon was. He even admits that Lemon was 94 and Mechanic was order 95, but says I should have taken it. I told him the first one was up so I took it. He said he didn't believe me. I told him that was too bad and he said that it's okay, I got your back and that he's been a driver longer than I have. I immediately told the Gm who just kinda sighed cause of him. \n\nTwice now he's accused me of skipping deliveries, and now lying about it. I've had it with him.\n\nEdit: he goes on about me doing my job wrong, he hasn't had a topper on all day. ",
        "created_utc": 1493077017,
        "upvote_ratio": ""
    },
    {
        "title": "Ordering pizza and not tell your parents.",
        "author": "CruwL",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67chcl/ordering_pizza_and_not_tell_your_parents/",
        "text": "So last week I get a delivery for a single medium pep pizza. Plug it into my GPS and head out the door. It takes me to one of the local trailer parks, this one not as ghetto as some of the others. \n\nI get there and i'm following the house numbers as the count down to the one i'm looking for. I find what I think is the house but it but it doesn't have a number on it. I go up to the door and knock a few times and nothing. Go back to my car and call the number, a kid, probably early teens answers.\n\nHey your at the wrong house I can see you from my bedroom window. I'm down the other end of the street house next to the park. I get down there and its on a completely different street name... like not on the corner, but clearly on the different street. But this house has a number on it and it matches the order...\n\nOK whatever, grab the pizza and walk up to the door, and knock. \nLady slides a window open and yells at me \"we didn't order no pizza! \nthen yells down the hall: \"You order a pizza?\" \nloud voice from the back: \"No I didn't order pizza!\"\n\nCool sorry ma'am as I walk back to my car. Grab my phone Call the number back, straight to Voice mail...\nCall again straight to voice mail....\nCall my store and tell em what happen and they have me just come back to the store.\n\n\nLike WTF! wasted like 30 min\n\n\n",
        "created_utc": 1493072961,
        "upvote_ratio": ""
    },
    {
        "title": "Greasy",
        "author": "hilarity_king",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/67ak6b/greasy/",
        "text": "So, this was a couple days back, but anyways, this lady comes in to pick up her pizza, a pepperoni double cheese pizza.  She takes the pizza out of the store and about a minute later comes back in screaming about how her pizza is too greasy. Now, when I say screaming, I mean screaming.  She was really letting our manager have it, and he was maintaining his composure pretty well.  And in order to remedy the situation, he offered her another pizza, again a pepperoni double cheese and told her it would probably be about 6 minutes (how long our oven takes to put out a pizza).  \n\nThe problem here was that out oven was pretty full at the time, as it was a Saturday night and we were quite busy. So, at around 7 minutes, this lady went off again.  We had other customers in the store, but this lady just started screaming, \"You said my pizza would be ready in 6 minutes and it's been almost 10, I can't belive you call yourselves a pizza place.\"  Now everyone in the store was getting irritated and just wanted this lady to leave, but my manager once again went over and assured her that it would be out soon, and that we are sorry, but it's a busy night.  \n\nFinally, after about 2 more minutes after her outburst, we brought her pizza back out and she took a look at it again.  Then, she went off again about how greasy the pizza was and that she would never buy pizza from our store again, and left without taking her pizza.  \n\nI just don't understand how she expected a pepperoni pizza with double cheese not to be greasy, but we got two free pizzas for dinner that night.  ",
        "created_utc": 1493055111,
        "upvote_ratio": ""
    },
    {
        "title": "Little shithead 10 year old kids...",
        "author": "theroyaltymustdie",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/678t79/little_shithead_10_year_old_kids/",
        "text": "So I take this run to the local ghetto a few days ago, and it's a cash order for like $17.95 or so. I get there and this little white trash snotnose kid opens the door. Now, immediately, I can tell what kind of kid this little shit is by his facial expression and general attitude.\n\nSo, I ask him if his parents are home or something, and he's like, no, but they told me to give you this. So he pulls a crumpled $20 bill from his pocket and hands it to me. So I said, \"Okay cool, you need your two dollars back?\" And this little kid says, \"Duh, what, you think we should tip you? We're actually going out of town soon and we need to save up as much money as we can.\"\n\nMe: ಠ_ಠ k sure\n\nI hand him his 2 bucks. Just then I heard his dad yell from inside the house \"Keep the change!\" (I'm thinking, kid, you just told me that they weren't home...) So, I reach over to his hand and snatch my 2 bucks back, give that motherfucker one last dirty look, and walk away.\n\nGoddamn, some kids are fine, but some are duplicitous little demons.",
        "created_utc": 1493038014,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling trapped in my company",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/678qnt/feeling_trapped_in_my_company/",
        "text": "[deleted]",
        "created_utc": 1493037151,
        "upvote_ratio": ""
    },
    {
        "title": ".. Does no one here carry a firearm? I'm not saying let's shoot and kill people, but come on. To an extent, we have the right to defend ourselves.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/677rns/does_no_one_here_carry_a_firearm_im_not_saying/",
        "text": "[deleted]",
        "created_utc": 1493021600,
        "upvote_ratio": ""
    },
    {
        "title": "He was dedicated to quitting",
        "author": "DoeHare",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/677ow4/he_was_dedicated_to_quitting/",
        "text": "This guy I worked with seemed pretty normal, we both smoke(d) so we could talk a bit\n\nA week ago he takes a delivery around the corner from the store\n\nHe comes back, totally calm, saying he got robbed at knifepoint to our opening manager and district manager\n\nGoes to the back office says he's having an anxiety attack and needs to leave \n\nHe leaves, comes back out of uniform, quits, gives all the money he owed back and says his mom made him quit\n\nCops get called, Cops from the town the store's in show up, can't take a statement since it was in another jurisdiction and over statelines\n\nThose cops question him, he can't give a description and admits he made it up because he didn't want to work at Papa John's\n\nGot charged with filing a false report and something else ",
        "created_utc": 1493020128,
        "upvote_ratio": ""
    },
    {
        "title": "He offered me a bad tip",
        "author": "DoeHare",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/677nm9/he_offered_me_a_bad_tip/",
        "text": "Last week I made a run into the hood, knew I wasn't getting tipped\n\nGuy answers the door in his underwear and clearly fucked up on crack and watched the smoke pour (I've spent a lot of time in the slums, I know what crack smells like unfortunately)\n\nHe grabs my clipboard and gets 3 dollars in change, and says \"Hey man you need that dope I gotchu\" \n\nObviously said no and almost said Fuck the Money but the next run on the double I had with this gave me 5 bucks ",
        "created_utc": 1493019487,
        "upvote_ratio": ""
    },
    {
        "title": "She was furious at her son",
        "author": "DoeHare",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/677n3q/she_was_furious_at_her_son/",
        "text": "I've been dealing with crazy mental health problems lately so I haven't been posting much\n\nLast night I made a run about 10 minutes one way from the store for what was originally 2 bucks\n\nI get to the door, the guy who ordered it doesn't answer. \n\nHis mom does\n\nSo she takes my clipboard and sees the 2 dollars and she got angry\n\n\"HE ONLY TIPPED YOU 2 DOLLARS\" she exclaimed\n\nKnowing something was up but tried to be cool, said \"yes ma'am\"\n\n\"HE USED TO BE A DELIVERY DRIVER THIS IS UNACCEPTABLE\"\n\nShe rewrites an 8 dollar tip on there while I was laughing hysterically and told me \"This is never happening again\" and that she was gonna have a talk with him",
        "created_utc": 1493019212,
        "upvote_ratio": ""
    },
    {
        "title": "I might look like a madman when I do it, but it always gets me a decent tip",
        "author": "attlas93",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/675hk5/i_might_look_like_a_madman_when_i_do_it_but_it/",
        "text": "Sometimes if the conditions are right, (the delivery location is &lt;3/4ths of a mile out, the order isn't too heavy, it's daytime, et cetera) I won't bother getting into my car and I'll literally run an order out to the customer. I get a lot of nice comments at the door when I get there as usually the whole street sees me and it never fails to net me anything less than $4. There are a couple regulars that even ask for \"runner guy\" which sadly often gets answered with \"sorry, he's not working today\". I only really do it maybe once every 2 weeks or so since conditions have to be just right but it's always a really nice way to shake things up during a shift.\n\nI can't be the only one who does this though, have any of you guys ran a delivery before?",
        "created_utc": 1492989977,
        "upvote_ratio": ""
    },
    {
        "title": "The time I got robbed but got a $10 tip",
        "author": "inked_for_life",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/675h25/the_time_i_got_robbed_but_got_a_10_tip/",
        "text": "Not pizza but I used to deliver chicken wings in a college town in the northeast. \n\nOne night I was doing the usual college campus deliveries, which was 8-10 orders when slammed, which of course it was. So I get a delivery for one of the three dorms that are out of our delivery zone, but we included it because it was part of the college we delivered to that was actually in our delivery range. Think a northern dorm campus a few miles north of the main campus. \n\nSo I finally get to the dorm, get out of my car and give the kid a call, which results in no answer. Try again, still no answer. So as I'm standing there fuming, I notice out of the corner of my eye a kid coming around the building in a ski mask. A little weird, but hey, it was New England in the winter and it wasn't too late, maybe he just got back from skiing or snowboarding right? Unfortunately of course that's obviously not the case.  As he's walking by me on his way up to the dorm, he scans his keycard and opens the doors and out of nowhere just snatches the wings from my hand and slams the door shut behind him. I'm still pretty new at the job at this point so I just stand there, flabbergasted.\n\nAs I'm standing there, by the grace of whatever gods are out there, a (normally incompetent) campus security guard rolls up and asks me if that masked fellow just stole the food, which I reply quite angrily that, yes, he did in fact steal the food. So the security guard is standing there talking to his dispatch trying to figure out the best way to locate the masked bandit, when in a moment of clarity I think back to the unanswered phone call. \n\nThe delivery slip had a separate name from what the voicemail had. But we had caller ID in our system, so it automatically registers the phone you call from. You can probably see where it goes from here, I gave the campus security the name from the voicemail and the phone number and they were able to locate his room within minutes. They caught him in all his buffalo sauced glory, right in the middle going to town on said stolen wings. They brought him down to me where the obviously intoxicated guy was still swearing and denying any involvement. His eyes lit up with rage as he saw me standing there. He started swearing and screaming at me as the campus cop made him pay for the food, yelling about how I'm \"going to get a 10 cent tip.\"\n\nAt that point, the campus cop just looked at him and told him he'd better tip well or they'd have him charged, and the look of this kid just collapsing in defeat and misery was beyond beautiful. He handed me a $10 and after what seemed like eternity I went on my merry way. \n\nTL;DR: Dumbass put down a fake name thinking he could be sneaky and steal some wings. Dumbass didn't realize we had his phone number. Dumbass gets caught, I get a $10 tip\n\n",
        "created_utc": 1492989821,
        "upvote_ratio": ""
    },
    {
        "title": "On the other side",
        "author": "Spacemarine658",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/674qrd/on_the_other_side/",
        "text": "It was finals week a few semesters ago and my fiance' at the time ordered pizza after our last finals to relax and I went outside to wait for the guy (we lived in dorms so it was easier) and I see my guy walking up but he has a different order so I wait and as he's giving it to this girl in the lobby the bitch throws a huge fit because \"I don't want it anymore\" (I understand changing your mind but how about being polite and asking if they can cancel your order?) anyways after throwing her tantrum she eventually takes the pizza and throws it away and storms off into the dorm (our dorms have locks so the guy couldn't follow her and ask for her to pay for the pizza she trashed) so he walked back outside and got my order and I waved to him and he tried apologizing for the scene \n&gt; $Me: Dude its not your fault shes crazy here -hands him a 100\n&gt; $PizzaMan: oh I don't carry more than a twenty sorry \n&gt; $Me: I know dude just take it man you need it more than I do have a good day\n\nSaw that dude later on turns out he was a semester behind me in computer science and quit working pizza after his boss gave him shit because the girl called and complained\n\nI know im no pizza delery guy but thought this fit better here than /r/talesfromtechsupport",
        "created_utc": 1492981756,
        "upvote_ratio": ""
    },
    {
        "title": "Signs you're about to get robbed",
        "author": "zeldadude",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/673ure/signs_youre_about_to_get_robbed/",
        "text": "So, I got robbed at gunpoint last night because I ignored all the signs. I don't want this to happen to anyone else here so I thought I'd share the warning signs I saw but ignored. Nobody had been robbed at my store in a while so I got comfortable and let my guard down for a bit. Big mistake. Here are the signs I look for (well, usually...)\n\n1. No light outside the house \n2. No light at all INSIDE the house. This is a big one. \n3. If the voicemail message on the number they gave is for one of those \"get a free phone number\" apps. I can't fucking believe this didn't tip me off. \n4. Basically if the house looks abandoned, at the least get back in your car and lock the doors. I'd just drive off if they don't answer the phone at that point.\n5. Anyone asking you to follow then anywhere.  \n6. Big cash order right before close to a really ghetto area? Yeah, you should be on high alert. I wasn't, and paid the price.\n7. Also, if anyone just walking past slowly does that loud ass whistle with their two fingers, you're probably about to get robbed.\n\nIf anyone has any more, post them up! I want to prevent anyone else from having this happen to them, because I DEFINITELY could have avoided it if I had looked for the signs, but I ignored them. ",
        "created_utc": 1492972473,
        "upvote_ratio": ""
    },
    {
        "title": "What do you say when a customer says \"Wow, that was fast\" after delivering their pizza?",
        "author": "CommunistPuppy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/673idw/what_do_you_say_when_a_customer_says_wow_that_was/",
        "text": "I always somehow end up making it awkward by chuckling and saying something like \"haha.. yeah..\"",
        "created_utc": 1492968908,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else had great customers when you've screwed up their order?",
        "author": "SoundHyp",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/671z9m/anyone_else_had_great_customers_when_youve/",
        "text": "Just found this reddit, no longer a driver but am curious on some of the recent experiences for current drivers.\n\nWhen I did deliver, one memorable situation I had was screwing up a customers order (though others include home-crafted beer and offering of pot). \n\nI delivered to them (about 20 minutes away) but had forgotten the salad for their order. When I noticed, about 12 minutes into the drive, I called my store and asked them if I can get a pre-approved comp on his account along with some other options. The owner approved it, so I called up the customer (Bluetooth, remember drive safe) and let them know I messed up and forgot the salad and that I can comp them, turn around and get the salad now (let him know where I was) or deliver the rest of the order and go back and get the salad for him. He said that the comp was acceptable and to just deliver the rest of the order. Was around a $25 order: large Combination, 2 liter, breadsticks and salad. Ended up giving me a $10 tip, was really floored by the guy. I am assuming he appreciated me calling and present solutions and not just a complication, but who knows.\n\nWhat sort of stories do you guys/gals have about favorable outcomes on less than desirable situations?",
        "created_utc": 1492950535,
        "upvote_ratio": ""
    },
    {
        "title": "Alright guys, let me tell you about Man Hands.",
        "author": "SpookyKid94",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/671gly/alright_guys_let_me_tell_you_about_man_hands/",
        "text": "3 years delivering pizzas, lotta stories, this one is one of the best.\n\nTaking a delivery on a busy night to a big apartment complex. Running up flights of stairs and shit because this lady's order is like 20 minutes past due. I get to her door, out of breath, she opens and I'm greeted with the wonderful aroma of weed and Jack Daniels. She's late 40s at least, I don't remember what she was wearing, but she was obviously ripped underneath, like steroids ripped. I hand her the receipt to sign and that's when I [notice](https://img.memesuper.com/1ffed0c762287e0048ef25ff2fd49736_she-had-man-hands-manhands-seinfeld-they-dont-make-em-like-seinfeld-man-hands-meme_564-564.jpeg). She had the manliest man hands of any woman I have ever seen, no one else comes close. She tears the receipt and my pen away from me, not in any sort of anger, but as a consequence of the sheer strength of this woman's Stallone-esque hands.\n\n\nAs I'm giving her her food, gives me a slurred \"How are you doing tonight?\", about an octave lower than my own voice. I look up and notice that she's giving me the eyes... *those eyes*. I'm already flustered from being in shit shape and running and it's taking all of my willpower not to stare at her at, what I imagine to resemble, the fists of Zeus himself. I realize that she's about to start flirting with me and I reach peak \"dear god why\".\n\n\nI take the receipt from her and pocket it, $10, thank you alcohol.\n\n\n\"You have a cute name, /u/spookykid94\"\n\n\"Well, thanks^pleasestop \"\n\n\nThis is where it gets weird, because she attempts to give my pen back by hanging it on my nametag. [I'm like](http://i0.kym-cdn.com/entries/icons/original/000/022/508/C7S0ouqVAAANACj.jpg) I'm so caught off guard by this entire delivery that I let her spend way too long trying to drunkenly accomplish this, molesting my chest in the process, before just grabbing my pen from her. It was like 10 solid seconds of something so awkward that I was frozen, unable to protest or do anything about it.\n\n\n\"Thank you so much for deliviering my pizza, sweetie\"\n\n\"YUP, HAVE A GOOD NIGHT\" as I briskly walk away.\n\n\nI get into my car and say out loud \"**what in the actual fuck**\". \n\nTo top it all off, **I shit you not**, she broke the spring on my pen with her hands of steel when she clicked it.\n\n\nWhole store knows her as Man Hands, she orders pretty often, but hasn't been drunk enough to molest anyone but me.\n\n\n\n**TL;DR** Not only did a drunk woman twice my age persistently flirt with me, but she happened to have ridiculous, cartoonishly large and muscular hands that she proceeded to feel me up with. It felt like a moment out of a sitcom.",
        "created_utc": 1492940733,
        "upvote_ratio": ""
    },
    {
        "title": "A girl invited me in while making a delivery for Goodneighbor Delivery....It was like those movies....",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66yqo6/a_girl_invited_me_in_while_making_a_delivery_for/",
        "text": "[deleted]",
        "created_utc": 1492899304,
        "upvote_ratio": ""
    },
    {
        "title": "\"Ma'am, I know you're lying right now. Enjoy your meal.\"",
        "author": "SirJonathonDoe",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66y8wp/maam_i_know_youre_lying_right_now_enjoy_your_meal/",
        "text": "Last week we were stupid slow all day and this woman calls for a delivery. She lives about a quarter mile around the corner and ordered a large pepperoni. \n\nWe had it delivered to her in 15-20 minutes.\n\nShe decides to call back to complain. \n\nCustomer - \"It got here way too quick. I know you guys just gave me an older, pre-made pizza so you can get it out to me quicker, I want a refund!\"\n\nManager - \"Miss, that's simply not true. You were our first order in 30 minutes, and you live right around the corner. I can assure you the pizza is fresh.\"\n\nCustomer - \"That's not right, this pizza is cold! Give me a fresh pizza, or a refund right now!\"\n\nManager - \"Ma'am, I know you're lying right now. Enjoy your meal.\"\n\n[Me](http://www.reactiongifs.com/r/2013/11/Andy-Dwyer-Shock.gif)",
        "created_utc": 1492893772,
        "upvote_ratio": ""
    },
    {
        "title": "I know these streets a lot better than you, dick head.",
        "author": "SirJonathonDoe",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66y3o2/i_know_these_streets_a_lot_better_than_you_dick/",
        "text": "Yesterday I went on a delivery run to a racquet club about a mile and a half straight shot down the road from our parlor. \n\nIt was rush hour, a Friday, and our pizza parlor is located on the busiest Main Street of our part of the city, so trying to actually make the straight shot there and back will get you bogged down in traffic for quite some time. \n\nOn my way back, I was waiting in line at a stop sign trying to make a right hand turn on to the main road, but as mentioned earlier, it was rush hour. So when I'm up next to make the turn, nobody is letting me in, you basically have to wait for a nice person or wait for the next red light for that road so you can go. It was taking a bit to find a clearance, and I'm not gonna jam my way into traffic and make people slam on their brakes when it's unnecessary. \n\nWell, an older gentleman in a souped up black BMW did not like how long it was taking me to find a gap. He's fuming, yelling at me, turning beet red as I'm watching him in my rear view. Finally he starts blaring his horn. (I've legit only been waiting for a minute at this point) And he cranks the wheel to go around me, cuts several people off and making traffic slam on their brakes. I flip him off as he goes by me and he stares at me yelling and shaking his head. I see him go straight into traffic on the Main Street and didn't think much else of it other than, \"wouldn't it be hilarious if he was headed to get some pizza.\"\n\nBecause of that stunt he pulled, traffic was stopped and someone motions for me to go, so I do. Only I take the long way around (technically a short cut during rush hour) and I get back to work. I pull in, and it's dead inside so I go to the slice counter and start cleaning up for a *solid* 5 minutes. \n\nThen who the fuck should walk in, but Mr. Impatient pants. I immediately start laughing my ass off, because it was too perfect. I'm laughing the whole time I'm ringing him up and he doesn't recognize me one bit, or ask me what I think is hilarious. Doesn't say a word. Probably thought he left everyone in the dust.\n\nWasn't much else I could do but be passive aggressive towards him so I just \"forgot\" to put his slices in the oven and made him wait a lot longer than he should've. Impatient asshole.\n\nMy other coworker who is a driver said the guy cut him off and did some shit like that to him too and he recognized his car. \n\nHome boy just *really* needed his pizza. Like yesterday. ",
        "created_utc": 1492892113,
        "upvote_ratio": ""
    },
    {
        "title": "Got tipped my own money",
        "author": "Palace905",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66xtiw/got_tipped_my_own_money/",
        "text": "I work at a family run pizza shop, and we cover a small area lots of locals and the owners almost know everyone. They get a call take the order and i head out to deliver it. i arrive at the house to a drunken man, i give him his pizza and tell him his total. 27.93 he pays me with a hundred dollar bill. As always i will ask what kind of change they want (because some people want smaller bills and some want bigger bills &amp; that gives them the option if they would like to tip me with a smaller bill i give back). He didn't seem to like that very much and figured that i implied that the rest was my tip.\n\n\"i wouldn't ever tip you that much are you kidding me don't be so rude\" he said\n\ni give him his exact change and then he goes on to say \"did u take your 15% tip out of there?\" i said \"nope i'm giving you your exact change\", as this happens i dropped a couple cents from my pocket on the ground and he says \"thats your tip\", then slams the door.\n\nWorst house i have ever delivered to. \n\nEDIT: Thank you all for the concerns about having that much money on me. When i get to the point that i feel uncomfortable with that much money i will lock most of it up in a separate compartment in my car and in the event of someone paying with large bills i will go back to my car to make change. \n\nAlso i work at a pizza place that closes at 9pm and i drive an unmarked car, no stickers/signs are on my car and i deliver in plain clothes. ",
        "created_utc": 1492889051,
        "upvote_ratio": ""
    },
    {
        "title": "...excuse me??",
        "author": "zeldadude",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66xlys/excuse_me/",
        "text": "http://i.imgur.com/pZW2lkN.jpg\n\nTook me a minute to realize what they meant haha!",
        "created_utc": 1492886739,
        "upvote_ratio": ""
    },
    {
        "title": "If I have four speeding tickets, including one going 25 over, can I still get a delivery job?",
        "author": "yevansky",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66w3zu/if_i_have_four_speeding_tickets_including_one/",
        "text": "",
        "created_utc": 1492869903,
        "upvote_ratio": ""
    },
    {
        "title": "\"I can't believe you ordered this late\"",
        "author": "Jaitzche",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66umgj/i_cant_believe_you_ordered_this_late/",
        "text": "This made me relatively annoyed tonight.\n\nI work as a pizza delivery driver. My boyfriend works at another pizza place and is also a driver when he's not in as a manager. I closed tonight, got home around about midnight. Yes, it's late, but I'm absolutely starving. Bf's pizza place is also closed, the 3rd pizza place in the area is closing in 15, so we decided to call the one that closes at 2 a.m.\n\nBf answered the door when he got there. Apparently the first thing he said was as is above, \"I can't believe you ordered this late.\" \n\nTonight, a lady ordered at 10:55. 5 minutes before close, and the reason I got out so late, especially since it was a good 15 mins to get there. I wouldn't even think of calling her out for ordering so late. Still, she apologized and I told her, it wasn't a problem.\n\nIt just felt very rude. I could understand a bit of annoyance if it was a difficult or big, last minute order. But it was a simple medium pizza and some bread sticks. They weren't going to close for another 2 hours. And I  was *hungry*.",
        "created_utc": 1492842882,
        "upvote_ratio": ""
    },
    {
        "title": "Ordering pizza while sick",
        "author": "Ajreil",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66tl51/ordering_pizza_while_sick/",
        "text": "I have a pretty nasty cold, and I'd like to take my frustration out on a pizza. Would you recommend against this?\n\nI'll tip well and wash my hands before the transaction of course.",
        "created_utc": 1492826993,
        "upvote_ratio": ""
    },
    {
        "title": "Strangest cancellation reason",
        "author": "thatpizzaguy1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66pvo5/strangest_cancellation_reason/",
        "text": "Out of my four years in pizza this one definitely beats them all. I work in a smaller chain of pizza restaurants in Dallas, TX that mostly caters to businesses in the mornings. \n\nI got a call as soon as I walked in the door at 8 by a woman freaking out that she needed to place a large order to be delivered at 11:30. I take her information, place the order, and all goes well. We start making the orders before hers and all's quiet. We finally get to prepping hers at 10:15 and she calls asking us to cancel the order. She tells us that she's just been fired and instead of buying pizza for the office would rather go and get a drink. My cooks didn't believe me at first, but they're still laughing their butts off.\n\nDo you guys have any crazy stories?",
        "created_utc": 1492788342,
        "upvote_ratio": ""
    },
    {
        "title": "\"Credit\" from a bad order doesn't apply to tax/delivery fee?",
        "author": "HilariousMax",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66onai/credit_from_a_bad_order_doesnt_apply_to/",
        "text": "About a week ago I had ordered from a local Pizza Hut and online said 30-40min. At 50min I called the store to get some kind of idea on time frame. I've delivered pizzas before; you get a rush, driver gets lost, shit happens. I know this. Guy on phone says driver just left. Sure fine whatever I live like 5min away, no problem.\n\n30min later the driver pulls up.\n\nPizza's cold. There is no warmth in this box. So I call back and speak to a manager. She says she can remake it and send it out \"sometime in the next two hours\" or 20$ credit. I'm not going to wait 3.5hrs for \"maybe hot, who knows\" pizza so I take the credit.\n\nI call up last night to use the 20$, total is 18.XX. Guy on phone asks me cash or card. I'm confused. He says my new total is 4$ and change because the credit only covers food.\n\nIs this national policy for Pizza Hut or any other chain? When I spent my years for Dominos, \"credit\" was good as cash. Was I an asshole for expecting the same? I'm still kind of confused.",
        "created_utc": 1492774787,
        "upvote_ratio": ""
    },
    {
        "title": "The most uncomfortable delivery I've ever been on.",
        "author": "Jaitzche",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66lqeu/the_most_uncomfortable_delivery_ive_ever_been_on/",
        "text": "I'm not sure what I should have done.\n\nLast night I took a delivery to a house two blocks from where I used to live. I get to the door and I can hear noise coming from the window to the right. This guy starts up, just screaming at someone. I hesitated a second before knocking. They didn't hear me. \n\nThe guy kept yelling about \"4:30\" (it was 7 by that time). After a minute there was a pause, then \"GET OUT OF MY HOUSE, JUST GET OUT OF MY FUCKING HOUSE\" and \"I'M GOING TO BURN YOUR STUFF\". And more about them getting out.\n\nI almost left, almost called my manager, had no idea what to do, so ended up knocking again. Heard a bit more yelling but it stopped and a woman opened the door. She looked like she had just bawled her eyes out. I could see a little kids legs in the living room (sitting in front of the tv or some such). She pays and I leave. \n\nI told my manager about it when I got back and he asked if she paid. I said she did and he flippantly says, it's not our problem.\n\nTalked to the other driver about it, said the guy who lived there was a meth head that had threatened to kill him when he went to collect his dog that the guy's gf had found.",
        "created_utc": 1492733221,
        "upvote_ratio": ""
    },
    {
        "title": "\"Don't you know what you're advertising?!\"",
        "author": "Tru-Queer",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66lmrn/dont_you_know_what_youre_advertising/",
        "text": "Had a guy yesterday come into my Domino's, says he's looking for our \"$9 BBQ pizza\" for his wife, so I ask him if he means our BBQ Chicken pizza for $9.99 carryout?\n\n\"Hold on, lemme call my wife just to make sure.\" So he calls her, and they're talking for a moment and then he's like, \"Here, you talk to her.\"\n\nSo I take this guy's cell phone and start talking to his wife.\n\n\"Hi, did you mean our BBQ chicken pizza?\"\n\n\"Nooo, you guys have a commercial for a new $9 smoked meat pizza, it's got brisket.\"\n\n\"I'm sorry ma'am, but we don't carry brisket.\"\n\n\"Well I normally don't order Domino's but I keep seeing your commercials for a $9 smoked meat pizza, don't you know what you guys are advertising?\"\n\n\"Sorry, I dunno what to tell you.\"\n\n\"Ugh, well, can I talk to your manager?\"\n\n\"Sorry, she's not in today, but she'd tell you the same thing, we don't carry brisket.\"\n\n\"Fine, I guess we'll just order from Papa Murphy's. Tell my husband to call me back.\"\n\nI don't have TV, so I didn't know she was thinking of the Little Ceasar's deal. ",
        "created_utc": 1492732081,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery time questions",
        "author": "AlphaPapa34",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66jth0/delivery_time_questions/",
        "text": "Long time lurker, never delivered. I just question how on earth it takes an hour to deliver wings from pizza hut when it's only like 2 miles away. Not trying to be a dick, I just have never worked in the industry. Especially when I'm ordering at like 1:30 pm on a thursday.",
        "created_utc": 1492714563,
        "upvote_ratio": ""
    },
    {
        "title": "Discord for Insiders, Customers and Drivers",
        "author": "Jasonrockman12",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/66bjcs/discord_for_insiders_customers_and_drivers/",
        "text": "I made a Discord for everyone to join if they would like! https://discord.gg/HBczD",
        "created_utc": 1492621500,
        "upvote_ratio": ""
    },
    {
        "title": "How come Black People don't tip?",
        "author": "KingEC",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/667psa/how_come_black_people_dont_tip/",
        "text": "[removed]",
        "created_utc": 1492571690,
        "upvote_ratio": ""
    },
    {
        "title": "How to get hired as a driver despite having an accident - or two.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/667f2d/how_to_get_hired_as_a_driver_despite_having_an/",
        "text": "[deleted]",
        "created_utc": 1492568089,
        "upvote_ratio": ""
    },
    {
        "title": "Can I give weed as a tip?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/667457/can_i_give_weed_as_a_tip/",
        "text": "[deleted]",
        "created_utc": 1492564633,
        "upvote_ratio": ""
    },
    {
        "title": "\"When I grow up\"",
        "author": "WhereIsMyPenisLava",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/666nll/when_i_grow_up/",
        "text": "So to get me through uni I deliver pizzas and this happened a few weeks ago now, rather often kids will answer the door and that always have the best reaction, well a tie with stoners, this kid was on another level though! While I gave his mum the pizzas and drinks he says \"when I grow up I want to make people happy and deliver pizzas\" some subtext he was dressed up as the green arrow with the bow and arrow and all, so I said to him \"would you like to try now?\" He ran out the door, I handed him my pizza bag and tied my bum bag around his waist and he knocked on the door, his mother answered and he goes \"I have your pizza ma'am, that will be $100 please\" so she played along and pretended to give him the money and closed the door, then he knocks on the door and goes \"ok mum can I come in? I'm hungry\" he gave me a quick hug and thanked me, seriously the coolest moment I have had in a long time! ",
        "created_utc": 1492559439,
        "upvote_ratio": ""
    },
    {
        "title": "Kicked out of Discord",
        "author": "Jasonrockman12",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/665tbu/kicked_out_of_discord/",
        "text": "[removed]",
        "created_utc": 1492550645,
        "upvote_ratio": ""
    },
    {
        "title": "You want your order remade? Here is the police.",
        "author": "PaulRingo64",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/665257/you_want_your_order_remade_here_is_the_police/",
        "text": "For about as long as I've worked at my pizza place there has always been a few 'dreadful deliveries'. Well, Matt was one of those deliveries. Been there about 50 times, never got a tip from him, answers the door in boxers, and takes 2-3 minutes to answer the knock. Matt also tends to call back to complain about the slightest issues, most of which pertain to the order time and the driver. He once called on a fellow driver who parked in the street and not in his driveway like 'everyone else'. I took Matt's order the other day, and it seemed everything went ok, but before I got back to the store my cell was ringing. Matt says he didn't receive an icing pack with his cinnamon sticks. Fine, I had another delivery in that area, NBD, i bring him his damn icings. On my way back to the store a second time, Matt had another problem. He claims I took too long bringing him back his icings, and that we should remake his whole order and redeliver it. My boss disagrees, and as I walk back in, I notice another driver in a heated argument on the phone that ended with my boss telling him to order Dominoes. Turns out once Matt was denied his whole order, blowing up the phones was his next logical choice. Trying to place phony orders, calling the phone girl names (racial slurs btw), over 30 missed calls, straight blowing up the store with useless calls. After about 10 mins of consistent calling, I'd had enough. I picked up and asked him what his deal was, to which he tells me there is no 'deal', and that he will be up to the store shortly with his brother and his 'shotty' lol. Now, I'm no snitch, but if I had to choose a person to call the cops on, it's this guy. I inform my local dispatch of this unruly customer and his threats (this happens more often than you think), and not only did they make him a visit, they also warned him if he orders or phones the store again, he will be charged with 8 counts of harassment. One for every employee on the clock.",
        "created_utc": 1492543455,
        "upvote_ratio": ""
    },
    {
        "title": "Contract with a kids entertainment place.",
        "author": "Mhn_Sinner",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6645ei/contract_with_a_kids_entertainment_place/",
        "text": "So I'm a delivery driver for Dominos and my store, or I guess the company, has a contract with an entertainment place close to us. \n\n\nMy first few deliveries there I was not aware of this. My very first delivery there was 12, 14\" pizzas. I get there and hand the lady the receipt. She sign's her name and crosses out the tip line.\n\n\nI'm like \"Wow okay.\" \n\n\nMy next delivery there is 8, 14\" pizza's. Same lady does the same thing. Sign's her name and crosses out the tip line.\n\n\nNow I'm thinking in my head \"Okay fuck you too then.\" \n\n\n\nI hate going there so does all the other drivers in my store. Everytime we see there address on screen we all take a big sigh. \n\n\nAnyways rant over.",
        "created_utc": 1492535127,
        "upvote_ratio": ""
    },
    {
        "title": "Spent two years delivering, here is my best tale..",
        "author": "Emrevv",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6639i9/spent_two_years_delivering_here_is_my_best_tale/",
        "text": "I arrive at a house off a dirt road that I had never delivered to before. I make my way to the door and give it a few knocks. No answer. I try again, no answer. This goes on for a couple minutes before I decide to head back to my car and give the guy a call. He answers the phone and apologizes for not answering the door and says he would be right down. As he answers the door, he is just finishing buttoning his shirt. Strange, I thought to myself. We do the exchange and as I'm about to leave, he starts asking me about the job and if I like it. I told him it's alright, you see some interesting things and make pretty decent money.\n\nThe next line out of this man's mouth caught me completely off guard. He asks, \"Do you want to see some titties?\" Now folks, I am not a man who turns down the sight of a free pair of knockers. I tell him yes, yes I would like to see some titties. He tells me to come inside and follow him up the stairs. He goes on to explain how they had been playing strip poker and that is what took him so long to answer the door. I understood.\n\nAs we reach the top of the stairs, he tells me to be quiet. I comply. He suddenly opens up a door to which I see two obese women completely naked. Their immediate reaction was to scream and cover themselves, but after about 10 seconds, the one girl goes, \"well since you're here, you might as well see the whole thing.\" In my head I thought please god no, spare me. She proceeds to stand up, bend over and flash her downstairs at me. I left. \n\nThat really threw me off for the rest of the day and I learned that I need to be more careful when I agree to see random titties.\n\nTl;dr - A man invites me inside of his home to see some titties, they were not the type of titties I was expecting. ",
        "created_utc": 1492526818,
        "upvote_ratio": ""
    },
    {
        "title": "HAPPY 51K!!",
        "author": "Galxctus",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/662kkt/happy_51k/",
        "text": "",
        "created_utc": 1492519244,
        "upvote_ratio": ""
    },
    {
        "title": "Forced Arbitration from a very popular pizza chain.",
        "author": "diagnosedADHD",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6609vd/forced_arbitration_from_a_very_popular_pizza_chain/",
        "text": "Friday I was asked to sign a document online at work. I couldn't login to the system, and I couldn't reset my password. I didn't get back into work until this last Sunday. They ask me to sign this document again. The store was slow, not much going on, so I decide to actually read over it before I go ahead and sign. It was an arbitration agreement It was an agreement that would be valid for life, even after termination. I decided I better not sign yet, later I read through even more, and it made me realize I didn't want to work for a company I couldn't take to court. I totally would be fine with handling claims through an arbitrator, but to make that the only option is super suspicious, and is pretty ridiculous to ask for. Everyone should be held accountable.\n\nThere are so many fucked up clauses in the document I can't even begin to go into detail. The claims that it covers? Every single claim except a very small list of acceptable claims to go through court, doesn't matter if they straight up committed a crime against you, you have to use an arbitrator. Did an employee steal from you? Well according to this document, to be reimbursed, you can't take this person to court, you now have to use an arbitrator that this company decides on. It doesn't matter if they are a former employee either if they signed this document.\n\nThe document states that not signing the agreement can result in being fired, and after a certain date of not signing, it's implied that you agree with the terms.\n\nSo basically, I finally got the courage to quit. I wasn't a dick about it, and everything is all good, gave my notice and everyone is on good terms and all.",
        "created_utc": 1492484017,
        "upvote_ratio": ""
    },
    {
        "title": "How I (inadvertently) guilted a guy into giving a bigger tip",
        "author": "jbh007",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65zcer/how_i_inadvertently_guilted_a_guy_into_giving_a/",
        "text": "I've actually done this more than once, but I've already posted another story on here.\n\nI was delivering to a nicer neighborhood, but one that was known to be full of assholes. Big houses, virtually no street lights, huge driveways, and holier-than-thou folks.\n\nSo I got to the door, and there was no answer from the initial doorbell. Not a problem, I just knock about thirty seconds later. Still no answer. After about a minute of trying to knock, I decided to call the person. If someone didn't answer the door, the phone usually worked to get their attention.\n\nIt rang a couple times before going to voicemail. Great. Not answering neither their phone, nor their door. I usually hated this because the people in the neighborhood tend to be snooty to begin with, but people who ignored the door and the phone tended to be worse. I try knocking a bit more since it hadn't been 5 minutes yet (my limit on busy nights), and I heard something rustling in the house.\n\nFinally! Someone is coming…\n\nA minute later, nothing. I try the doorbell again (I couldn't hear it outside, so idk at the time of our was functional), and I called again. I heard the noise, fully indicating that someone was home, but still nothing. After another minute I decided it was now out never, and started knocking heavily on the door while calling.\n\nI suddenly heard someone walking to the door, and overheard this little bit:\n\n\"I have to go, some fucking idiot from out of area keeps calling me and won't get the fucking message from me sending him to voice mail, and some other fucker is knoc-\"\n\nHe opened the door just then talking on the phone. He went silent as soon as he saw me.\n\n\"Oh. Was that you?\"\n\nI nodded yes, and he immediately told his friend on the phone that he needed to go.\n\n\"So… uh, I totally forgot the pizza… that was uh… really fast too.\"\n\nI just told him not to worry about it, while still giving him my sarcastic customer service smile. He immediately pulled the receipt and signed it, giving me a small tip.\n\nAs soon as he signed and handed it over, he told me to wait a second, and then pulled $5 out of his wallet.\n\n\"That's… uh… that's for… forget about it.\"\n\nI sincerely thanked for him it, and wished him a good night, and he sheepishly closed the door clearly feeling bad about the ordeal.\n\nOne of the very few times I had a customer realize their mistake, admit to it, and tip to compensate.",
        "created_utc": 1492473401,
        "upvote_ratio": ""
    },
    {
        "title": "I hate it when",
        "author": "HelloItsMeUrLookin4",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65yvtl/i_hate_it_when/",
        "text": "People let their dog jump on me and when I tell it to get off and push it off they say \"Oh no they're ok they don't bite!\" I don't give a fuck. As much as I love dogs I'm at work and your big ass dig almost made me drop your food and you would have blamed me. PlusI'm in my work clothes. ",
        "created_utc": 1492468400,
        "upvote_ratio": ""
    },
    {
        "title": "I love you guys",
        "author": "Fillertracks",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65xc2w/i_love_you_guys/",
        "text": "I didn't even know my pizza was late.  This made my day.  I appreciate bringing drunkies to me.  Thought I'd share my appreciation.  Thank you pizza delivery drivers!",
        "created_utc": 1492453383,
        "upvote_ratio": ""
    },
    {
        "title": "Called out a fellow driver who steals deliveries.",
        "author": "universetwisters1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65x7ws/called_out_a_fellow_driver_who_steals_deliveries/",
        "text": "I was in the middle of my sidework to get out last night and it was just me and one other driver working that night. I was still on the screen before him to take a double and I was sweeping while I was waiting for the next one to come out, when suddenly he took over on the cut table and told one of the CSR \"DONT WORRY I'LL CUT MY DELIVERY.\"\n\nI was livid. I've been putting up with this shit of him stealing everyone's deliveries for two years and now I've had enough. I got livid and the CSR and the cook and the manager all shared my anxiety because this fellow is terrible to work with. He refuses to sweep and mop because of his \"\"\"\"\"bad back\"\"\"\"\" and he'll try and be nice to everyone just to get them to do his stuff for him. So while he was out on my two deliveries I got clocked out and waited for him to get back because shit was gonna hit the fan. He finally gets back and when he gets back I ask him, as calm as I could:\n\nMe - \"Why did you take my deliveries?\"\n\nHim - \"They were your deliveries?\"\n\nMe - \"Yea, my name was up on the screen\"\n\nHim - \"Sorry bud I didn't see that\"\n\nMe - \"That don't cut it, why did you take my deliveries\"\n\nHim - \"No reason\"\n\nMe - \"So you had no reason to take my deliveries?\"\n\nHim - \"Yea, no reason\"\n\nMe - \"Then why did you take them?\"\n\nHim - \"I dunno, but if you want my next delivery you can have it-\"\n\nMe - \"No, since you don't have any problem taking my delivery you can take the rest of them\"\n\nAnd then I left. But I came back later to meet up with the rest of everyone to go to Steak N Shake to celebrate. They said after I left that he started throwing a fit and was angrilly banging pans and shit since he was the closing driver and closing drivers do dishes and shit. But yea, that was the highlight of my night last night. Either he's going to see this as a wakeup call and stop being too useless or he'll be even more passive aggressive with everyone. Time shall tell.",
        "created_utc": 1492452309,
        "upvote_ratio": ""
    },
    {
        "title": "How To Get Better Tips: Here's my advice, and add your own.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65uew5/how_to_get_better_tips_heres_my_advice_and_add/",
        "text": "[deleted]",
        "created_utc": 1492418350,
        "upvote_ratio": ""
    },
    {
        "title": "Dominos always forgets my side-condiments. Tonight I had enough and called the store...",
        "author": "DRosesStationaryBike",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65tbxi/dominos_always_forgets_my_sidecondiments_tonight/",
        "text": "...and had someone drive 10-15 minutes just to give me 1 side of icing for my cinnastix. \n\nI had already tipped the delivery guy $7 before I realized. Was it wrong of me?",
        "created_utc": 1492400448,
        "upvote_ratio": ""
    },
    {
        "title": "Full time at Domino's as a driver possible?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65qxjc/full_time_at_dominos_as_a_driver_possible/",
        "text": "[deleted]",
        "created_utc": 1492371243,
        "upvote_ratio": ""
    },
    {
        "title": "How come black people don't tip?",
        "author": "KingEC",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65qu8d/how_come_black_people_dont_tip/",
        "text": "[removed]",
        "created_utc": 1492370162,
        "upvote_ratio": ""
    },
    {
        "title": "As of next week, my store will have no managers.",
        "author": "TranSpyre",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65ppdy/as_of_next_week_my_store_will_have_no_managers/",
        "text": "I've been working as a delivery driver at Papa John's for 2.5 months, and I thought it was going well. This is my first pizza-related job. However, within the past 3 weeks, both of my store's managers/shift leads (the ones trusted to run the store without the GM present) have quit. 2/3 of the candidates for promotion to that rank have also quit. They're saying that they're only making $10.25 an hour as a manager, and are being bumped to basic wages when driving even while performing the tasks required of managers while in-store. They also were not getting benefits while working full-time hours. \n\nThroughout the time I've been here, the GM has been complaining that he can never keep a manager or drivers, and I'm starting to see why. I'm on the verge of switching to a local competitor to see if things are any better over there. ",
        "created_utc": 1492357189,
        "upvote_ratio": ""
    },
    {
        "title": "Fired from the D's.",
        "author": "Organicfoot",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65latt/fired_from_the_ds/",
        "text": "Hey all,\n\nFormer Domino's pizza guy here, got fired on April 13th. I wanted to post on here to get some outside opinions of what my next course of action should be.\n\nI started working at this Domino's on 1/1/15, so about 2 and a half years ago. In that time, I was never written up, never called in without a doctors note (2 shifts in that time, until my shift where I got fired) and was seen by the vast majority of my co-workers as a very helpful and hard-working employee. Not to mention that I'd picked up over 250 extra hours in that time just to help the store operate more smoothly.\n\nI got fired because of a no-call no-show. I worked a 5-8pm shift, and called them at 3 to let them know I'd definitely be late due to a very worn wheel bearing, had to get it fixed or risk my wheel falling off while driving. Long story short, my phone ended up dying and my charger was in my car at the mechanic's. Had to wait for my friend to come back to her place where I was waiting, and of course she got off work late. I contacted them as soon as I got my phone on at 7:45, sending them a receipt and explained what had happened.\n\nA couple hours later, the GM who is on vacation sent me a text saying \"you said youd be late and didn't show up which there is no excuse for. Dont worry about the rest of your shifts I am letting you go\". I checked the employee handbook, and it does state that you can be fired for a single no call no show, but I've seen this done many times with no excuse, and no consequences for the others who did it.\n\nThe employee handbook also states that theft is an offense which would lead to termination. One of the GM's buddies (assistant manager) was caught with over $1000 of the store's cash in his car, and he just got written up and had to take a couple days off. I've also seen that assistant manager sleeping in the office on multiple occasions while he's supposed to be doing inventory or helping out on the line.\n\nThat AM and the GM have also referred to me as a Jew, autistic, and always mispronounced my last name just to piss me off even when I told them not to do it anymore. It should be noted that I almost never talked to either one of them at work, and when I did, I never was disrespectful.\n\nThe fact that other employees can get away with what I would consider much worse than a \"no-call\" no-show on a 3 hour shift with an excuse is what really pisses me off, especially with my good record and solid work ethic.\n\nI'm tempted to flag them for an audit just to burn them since I guarantee they'd get dinged hard, but I'm worried it'll hurt the drivers, and that's definitely not my intent since I was cool with every single driver. I did keep track of my miles for the first year and a half, and I know they don't come anywhere near paying 55¢/mile, but I doubt the court costs would be worth the payout. \n\nObviously I'm not going to take the job back if they offer it, but I do want to get them back somehow since I feel like they really fucked me over. What would you guys do if you were me? \n\n",
        "created_utc": 1492288785,
        "upvote_ratio": ""
    },
    {
        "title": "Does background check equal a good chance of being hired by the big three?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65kzfy/does_background_check_equal_a_good_chance_of/",
        "text": "[deleted]",
        "created_utc": 1492285142,
        "upvote_ratio": ""
    },
    {
        "title": "What are you go to items to have in your car as a delivery driver?",
        "author": "Prius_For_Life",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65kr91/what_are_you_go_to_items_to_have_in_your_car_as_a/",
        "text": "I'm still somewhat new to the game of pizza delivery driving, but my \"go to\" items are pens...tons of pens....my phone for navigation purposes (although i'm strongly considering picking up a cheap Garmin GPS to save my phones battery), a clip board, and some extra Parm/Pepper packs....\n\nSo tell me seasoned drivers what is in your car??",
        "created_utc": 1492282559,
        "upvote_ratio": ""
    },
    {
        "title": "Ticketed the pizza guy",
        "author": "Finlanderboy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65ibwi/ticketed_the_pizza_guy/",
        "text": "So my friend was ordering us pizza at college.  While he was on the phone someone alert us they were giving out free pizza on campus.  So he told the guy he no longer wanted the pizza, and the guy taking the order said it was fine.  So we go get free pizza and think nothing of it.\n\nOver an hour later the owner of said pizza joint calls and starts swearing at my friend for canceling his pizza order.  My friend being a calm fellow usually is getting visibly upset.  I could hear the manager scream at him for him trying to explain his side of the story.  Another friend of mine takes the phone and takes charge of the call.  He tell him he will buy the pizzas only if they are perfect hot, fresh, and you personally deliver them.  My friend starts calmly but assertive starts telling him to call the police.  If he wants us to buy the pizza those are his requests.\n\nWell my friend has a part time job writing tickets.  Knew the guy would park poorly since there is never good parking next to the dorms.  So when the guy arrived my friend quickly snuck out and wrote him tickets for him his parking.\n\nThe guy was a complete tool when he dropped the pizza off telling us how lucky we are.  How we should be arrest and whatever garbage.  I am just stalling him for him to get his ticket.\n\nSo the guy returned to his car and ended up getting a 50 dollar handicapped parking ticket for selling us 25 dollars worth of pizza.",
        "created_utc": 1492249514,
        "upvote_ratio": ""
    },
    {
        "title": "Franchise and Non-Corporate Workers, How many corners are cut on the regular?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65hxfg/franchise_and_noncorporate_workers_how_many/",
        "text": "[deleted]",
        "created_utc": 1492240913,
        "upvote_ratio": ""
    },
    {
        "title": "Highest number of stiffs?",
        "author": "RU13R",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65gs0l/highest_number_of_stiffs/",
        "text": "After how bad I started today(75% stiffs) I was wondering how bad the rest rest of you guys have done. My record was 11 out of 23 on a closing shift.",
        "created_utc": 1492222633,
        "upvote_ratio": ""
    },
    {
        "title": "Pizzaguy who opens the door and walks in?",
        "author": "Diinah",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65emqa/pizzaguy_who_opens_the_door_and_walks_in/",
        "text": "I just had food delivered after a long day. Saw on FB there's been suspicious ppl roaming on my suburban street tonight, where we've had quite a few break-ins, including mine while I was home. So yep, my nerves are a bit on edge tonight. \n\nBut pizza dude comes, knocks once - then opens my front dude and goes \"Erm, hey...?\" after a few seconds. Is that not ... weird to do? A tad bit intrusive? Felt a bit strange, as a woman living alone, to have someone going in at 9.30 pm. Maybe I'm just more worried tonight. ",
        "created_utc": 1492197959,
        "upvote_ratio": ""
    },
    {
        "title": "Pleasant surprise last night",
        "author": "the_eluder",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65dslv/pleasant_surprise_last_night/",
        "text": "So I had a delivery last night, a medium pizza, a dessert and a 20oz drink.  I knock on the door, and they answer.  I immediately hand them the drink, and they exclaim, \"oh no.\"  I ask if they meant to order a 2 liter.  They said they did (this was an online order.)  I told them I'd check the slip to make sure I didn't screw it up.  I didn't, and said so.\n\nNow normally this is where the customer claims they ordered a 2L online, and they don't know how it got screwed up, and I'm going to have to go back and get them one, for free, even though we both know it was them who screwed up the order.  But not this time.  The customer merely stated, \"Don't worry about it man, we'll still live a good life.\"  Tipped 20%, too, so all was well.",
        "created_utc": 1492189924,
        "upvote_ratio": ""
    },
    {
        "title": "\"Ma'am technically we can't deliver to you anymore\"",
        "author": "portugalthelion",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65cqwt/maam_technically_we_cant_deliver_to_you_anymore/",
        "text": "I was working at a chain called Razorback Pizza which is in Northwest Arkansas. The Chain I worked at was in a city called Lowell, which isn't a very great city in the area. \n\nThere was this one lady who lived out in a trailer park and would always tip the change which was usually under ten cents. That's fine and all but she was also very rude to everyone who went out there. Like she was just waiting for something to piss her off (driving on her lawn, not handing her the pizza nicely, having a \"rude\" tone) \n\nOne day I was pissed off in general about my tips that day and sure enough she's my next delivery. So I go out there and she gives me the change like always, but that day it was three cents. I *insisted* she keep the change. This made her angry and she proceeded to tell me how ungrateful I was. I handed it to her anyway and was on my merry way. I wasn't upset at her or anything, just gave it to her said have a nice day and left.\n\nSure enough she calls the store very angrily and tells my manager that I am longer allowed to deliver to her house. That was fine with me. \n\nThe next time she calls in an order for delivery I just hear my manager on the phone say, \"Ma'am we would love to deliver this pizza but unfortunately none of our drivers are supposed to deliver to you.\" Now this of course made her very upset, but she was obviously a prideful woman and picks it up at the store (which was a good 20 minutes away) just to yell at all of us and to tell us she would no longer be ordering from us. \n\nWell she did. By that time we had hired another driver so she got her pizza. Good luck to anyone who has to deliver to her!",
        "created_utc": 1492179279,
        "upvote_ratio": ""
    },
    {
        "title": "I've worked at both, but.. Why does Domino's have codes for their ingredients when Papa John's doesn't?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/65b71z/ive_worked_at_both_but_why_does_dominos_have/",
        "text": "[deleted]",
        "created_utc": 1492154496,
        "upvote_ratio": ""
    },
    {
        "title": "\"No. Absolutely not. Get out now.\"",
        "author": "plo1357",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/659qu4/no_absolutely_not_get_out_now/",
        "text": "Hi there! I work as a delivery guy for a tiny, hole-in-the-wall New York style pizza joint in downtown Greenville, SC. Because the manager/owner doesn't ever work in the shop or know how to run a business, at any given time we only have 3 employees. Me, our chef, and a second delivery guy. The fact that I'm currently by a fair amount the longest working employee there, including our chef, should say a lot about the management. That said, it's damn good pizza. \n\nWe offer two sizes for our pies, 16\" and 20\". (Quick aside: \"How many slices on each of those?\" Is a dumbass question. It's a circle, lady, I can cut it into as many slices as you want. The 16\" feeds 2-3 and the 20\", 4-5. \"Yeah, but how many slices.\" Eye roll.) on a rare occasion, someone will order our Bronx Bomber, a 28\" monstrosity of a pizza. Usually folks will come and pick it up, and go on their way, but sometimes, once in a blue moon, it's a delivery. I've got no problem with delivery, I get paid cash, so driving is much better than being behind the counter. However, I drive a 2002 4-door Chevy pickup truck, which, aside from throwing the box in the truck bed, doesn't really fit a 28-inch box. Regardless, I set it on top of the headrests, driving through downtown traffic with one hand and holding the pizza upright and horizontal with the other. \n\nThen I get to the destination. It's a steakhouse right in the middle of the city. Fine, I've delivered to restaurant staff before, they're typically friendly and tip well, so I'm not bothered. The valet helps me find a spot, I walk inside, and bring the pie into the front of the steakhouse, making sure not to get in the way of anyone. I ask the hostess where I should go with the pizza, and she gives me a blank stare.\n\n\"I didn't know someone ordered a pizza.\"\n\nHuh. I guess the person who ordered it just *never told anyone else they ordered a pizza, in a huge steakhouse, in the middle of a busy Friday night.* Then the cherry on top. A woman approaches me who I assume is the manager, and I'm thinking she either ordered the pie, or knows who did and will help me out. Nope. She starts physically pushing me out the door, saying \"No. Absolutely not. Get out now.\" Et cetera, et cetera.\n\nThe upshot is that a very friendly waitress led me downstairs to the kitchen to find out who ordered the pie, figure out where to put it, and even went so far as to tip me generously with cash out of her own tips. \n\nMoral of the story: if you work at a fancy restaurant, let the other employees know if you order a giant pizza while on shift. Also, if you're that steakhouse manager, up yours, you could've asked nicely. ",
        "created_utc": 1492133579,
        "upvote_ratio": ""
    },
    {
        "title": "\"No. Absolutely not. Get out now.\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/659n2u/no_absolutely_not_get_out_now/",
        "text": "[deleted]",
        "created_utc": 1492132287,
        "upvote_ratio": ""
    },
    {
        "title": "just when you think customers cant get any more annoying.",
        "author": "Zander013",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/658has/just_when_you_think_customers_cant_get_any_more/",
        "text": "then they give you this on a huge order.\n\nhttp://imgur.com/ucCcdyY\n\n",
        "created_utc": 1492119296,
        "upvote_ratio": ""
    },
    {
        "title": "Closing Driver that's sick",
        "author": "AN3M0N3",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/650mpm/closing_driver_thats_sick/",
        "text": "Hey there everyone. Long time lurker, rarely posting or commenting in here.\n\nTonight I have to work 5:30-close, as is the usual for my work schedule. However, I have been suffering a massive migraine since two days ago. I've been able to work through it before, but the migraine isn't where the fun ends.\n\nMy body decided to say a good ol' screw you to me and my acid reflux started acting up earlier today as well.\n\nI doubt they'll be able to get a second driver in to cover my closing shift and the guilt of calling in and leaving everyone down a Driver is keeping me from calling in at the moment.\n\nOn the other hand I'm not sure if I can even drive with how the migraine has gotten. What do friendly neighborhood Pizza Guys?",
        "created_utc": 1492027563,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone Get Employed With Tickets/Accidents On Their Record?",
        "author": "Trubsy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/650j04/anyone_get_employed_with_ticketsaccidents_on/",
        "text": "About a year ago I got a speeding ticket for 10 over. I took traffic school and got the points removed. I don't know if it still shows on my record though. Then back in September I got a ticket for accidentally running a stop sign and causing an accident. (A tree was blocking the sign, cop didn't care).\n\nJust wondering if anyone has been in the same situation as me and still been employed. I had a delivery job in the past, but had never even been pulled over before that. I'm hoping my previous delivery experience and good recommendations help. I don't know if it's up to the employer or insurance agency though.",
        "created_utc": 1492026616,
        "upvote_ratio": ""
    },
    {
        "title": "My Biggest and Worst Delivery",
        "author": "qaera",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64uliw/my_biggest_and_worst_delivery/",
        "text": "So - IANAPG, but I did deliver food at my last job pretty frequently. Officially I was just a cashier for a big restaurant chain but after a couple Catering Coordinators quitting in quick succession and the backup drivers having car troubles, my managers would often beg me to drive orders out to our customers. These included anything from university offices chipping in on lunches together, pharmaceutical salesmen I guess showing off their new pill to doctors, even just small companies that didn't feel like sending someone out to bring back food. You quickly learn each places idiosyncrasies, what extra things they request, allergies and stuff. \n\nNow, I wasn't the Coordinator making calls and confirming orders, I just packed it up right, drove it there, and brought it inside. Occasionally places would ask me to set up the lunch (not part of my job, but usually people tipped extra for it) and as I'm sure every delivery driver has been through, occasionally people stiff you on tips. These were usually pretty big orders, hundreds of dollars worth of sandwiches, soups, salads, drinks and pastries I was running in on one trip. A really good tip would be the fifty the founder of a salon school slipped me for the first day of a new incoming class of stylists. A normal tip would be $10-20 from one of the few universities around our store. And then some places would just sign the receipt and forget about the tip.\n\nI want to tell you the story of my biggest and worst delivery. \n\nI come in to open the bakery at 5 AM, like any other day, when my manager asks me if I'll do a really big favor. The new (and eventually temporary) Catering Coordinator, who I'll call J, is freaking out about this noon delivery, which later I learn is just her normal state. I have an hour to take all the pastries and bagels and breads and stick them where they belong, in the display cases and shelves, and then my manager will cover the rest of the opening duties. I immediately have to start helping J cut pastries into fourths, slicing bread we need for the line for sandwiches, and in general putting this tornado of an order together ASAP. It was a very stressful morning for my manager doing his normal duties and covering the opening cashier duties as well while I was essentially doing all the cutting and packaging and counting and slicing.\n\nJ had this nasty habit of roping people in to do her work for her. She would frequently ask line guys to grab her a cookie for an order, or ask a cashier to brew 5 totes of coffee in the next, say, 2 minutes. Since she was new to our store, company, and the catering business in general, I gave her the benefit of the doubt and assumed she was asking for help because she needed it. Almost everyone else in the store agreed it was because she was a better at delegating than doing. An example would be ringing out a customer when she walks up to ask you to do something, you say \"I'm helping a customer, J,\" and she would say \"no, after that\" and then you point to the line to the door that you have no backup on. So I'm not saying she wasn't doing any work (and there was a lot on this order) but she wasn't wasting any breath getting the line opener and baker to help her make sandwiches and salads. She was a little oblivious on what was polite and what wasn't, I guess.  \n\nNormally it can take 30-60 min to put a \"big\" catering order together, for like 40-50 people. This one took 3 hours. The parts we had done had to be kept in the walk-in cooler, both the general one and the baker's one. This... did not help the flow you want to get into opening and running back and forth for ingredients for the line, drinks for customers, etc. But we manage to finish everything, I won't say ahead of schedule but on time-ish. Now we get a breather and I go back to doing my actual job duties while J sits down and fans herself off for all her hard work. \n\n11 am comes around and we have J's van loaded (this order would not even get close to fitting half in my car). The first layer is boxes of sandwiches, coffee totes, 64oz plastic bottles of tea and lemonade (which we had to make to order and fill individually), group orders of soup. The next layer is entree-amounts of salads and pastries, and on top are all the sides, napkins, plasticware, cold and hot cups, etc. \n\nWe set out on the road. It's a pretty nice, really warm day out. We're delivering to a graduation ceremony for a private elementary school, and it's 45min away. Kind of a thinker - there are at least 4 of our stores closer to this school who could have filled this order easily. There's no traffic on the major highways and roads, and we start winding through hilly, wooded side roads to this school. This entire ride we're upbeat, we're happy, we're awesome at this and just talking and getting to know each other better. Now, it's a pretty cute little school, but very much rich and private. Based on the amount of food we pegged it at about 60-70 kids, plus on average round up to 2 parents a kid, plus teachers. We park where they told us to (... not anywhere near where we were told to bring the food..) and a peppy teacher comes out to greet us and direct us to where to bring the food in. \n\nIf it's 3-4 bags of food, double bagged, I'll usually find my inner Hafþór and get it in one trip. This one.. we needed two trolleys, and several expeditions into a small music and performing arts room off to the side of the gymnasium and then back out to the van. The sun is beating on us and we're trying to beat the timer on the cold drinks. We get all the food and drinks inside finally, and the teacher points to three fold out tables leaning on a wall. \n\n\"So yeah, you can just set it up on these - I'll be back in a minute,\" and she's out the door. J looks at me (she hasn't set up an order before) and starts vibrating, getting ready to freak out. I tell her I'll punch out the tables and tablecloths if she figures out how much food can fit on each table. She tries to get someone who works there, I guess a groundskeeper, to come in and help but he just shakes his head and walks off. \n\nJ honestly did a wonderful job figuring it out: the first table we poured the teas and lemonades into separate ritzy beverage dispenser they set us up with. It had the hot and cold cups at the beginning, a line of coffee totes in various flavors, plates, napkins, silverware. The second table had the sandwiches. We fit four of the big boxes on there, in a zig zag pattern. Each box of sandwiches would have had like 25 sandwiches cut in halves and arranged easy to grab. In the space between the boxes we put the sides. The last table has these tiered arrangements of all the various pastries (there were a LOT) and it was beautiful.\n\nWe had nowhere to put the salads or soups.\n\nThe teacher came back in and cooed at how pretty we had done it and just said to set up the rest of it on the small elevated stage in the room since people were going to start coming in soon. We bust it out, take the trolleys, and all the bags we used to transport the stuff. The teacher signs the receipt. J and I are pretty much high from getting it perfect, on time, delicious, and all to celebrate something so awesome as graduating from a school! It was a good first half of the ride home. Then J asks me to reread the receipt to reiterate how much fucking -work- we got done. I list off all the sandwiches we made, the salads we put together, drinks prepped, pastries cut for the kids, everything bagged up. J asks how much everything came out to so I flip to the last page and go silent. She thinks I'm in shock because I've never seen a number that high or something. \n\n\"It was $1,600, J.\"\n\n\"So what was the tip, like $200? Even if it was just $100 that's still $50 apiece for us!\" \n\n\"She didn't write in a tip.\" \n\n\"Did she hand you the tip then? You've got to share that, you know.\"\n\n\"She didn't hand me anything, J. They didn't tip us.\" \n\nJ thinks maybe the tip was automatic and included somewhere in the large total so she says we'll check it out when we get back to the store. It wasn't. When we got back to the store the manager thinks we did something wrong to not get a tip so he calls the contact (who was the teacher we set up in front of) to ask if everything was fine and she said we were delightful and efficient and had to go for more graduation ceremony stuff, so sorry - and hung up. J starts swearing in the BOH until she goes home since it was her only catering order that day. Our manager gives me the rest of the day off since more people had come in and it was super slow that day and I wasn't in the mood to pretend to be happy for customers. He made a note in our system to refer them to the 6th furthest store from them and then call that store to tell them not to expect anything tip-wise. \n\nSo yeah, that was a big pill to swallow and taught me that you can't always trust a customer to do the right thing. Whenever the times were tough at that store and my manager needed me back on his side for anything or just to poke fun he would say \"sixteen hundred dollars, man\" and I'd say, \"and fuck you too.\" \n\n\n",
        "created_utc": 1491953766,
        "upvote_ratio": ""
    },
    {
        "title": "Good Pizza",
        "author": "Coexle",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64ug1l/good_pizza/",
        "text": "Honestly, I feel bad for cities and towns that order from Papa Johns, Dominos, and Pizza Hut and think they're getting good pizza. It tastes so unnatural and almost chemically created. Not to mention there's little to no human touch/error on the food. I feel the pizza looks the same every time. I'm fortunate enough to live in one of the better pizza cities in the country and no one, I mean no one orders from the big 3. They don't stand a chance with the competition of the delicious and REAL pizza created by the Mom and Pops throughout the city. It just blows my mind that people really order from those guys all the time. The only reason why I can think is name familiarity and how cheap the food is. \n\nI drive for a local place and we do about 30-35k in sales on the weekend. My questions are for other drivers and customers out there... what do you think of the big 3? do you order from local places? are the big 3 the popular options in your area because a lack of local places? I just can figure out how these places stay in business because they do horribly where I live.\n\nEDIT: I am not trying to sound like a douche, but those places just have awful pizza \n\n",
        "created_utc": 1491952076,
        "upvote_ratio": ""
    },
    {
        "title": "Having trouble with the Google Voice app since the update",
        "author": "Powerfuldot",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64u1x2/having_trouble_with_the_google_voice_app_since/",
        "text": "UPDATE: I used the new app, GV Connect, while working tonight and it functioned perfectly for me. It allowed me to re-call or to text a phone number I had entered once and I'm happy. Saved me so much time. I'll stick with it. Anybody have any other apps they use like this, please recommend! Thanks! \n\nI have been a bit evangelical about recommending we delivery drivers use Google Voice or something similar to keep our personal phone numbers (and full names!) private since we have to call customers so much. \n\nThe update to Google Voice's iPhone app from a monthish ago has pretty much made it completely unusable for me. It runs ridiculously slowly, and just in the last week it will not get into the \"send a text\" screen. One of the annoyances in the new version is that if you call a number and then want to text it right after that, you have to reenter the number! It also wouldn't call the same number a second time without reentering it. I need to do this a lot bc people don't answer their phones even when they specify that they need to be called on arrival. Often this means I call them, text them a pasted \"Pizza delivery here at your door! :)\" and then call them again. Entering the phone number each time with one hand while standing in their doorway holding several pizzas and a two liter with the other arm is fucking excruciatingly painful. \n\nIn searching for fixes in the Google forums, someone had suggested that the app is loading a lot of data now in your history (numbers you dialed, texts sent and received, that sort of thing) so the way to fix it is to go through your history and delete everything so it wouldn't bog down the app. \n\nI have been using it for 2.5 YEARS, calling and texting folks for work up to around 50x a day on the busiest days. It's taken me several days of sitting at the computer and deleting all on one page at a time which is only ten on each page. Last night I finished deleting everything in my history, then deleted the app and reinstalled it, and it is still not texting, still running slowly, still shitty new interface anyways. \n\nI did some searching and found a paid app that uses GV but has better functionality and more features, and rightfully makes it easy to call and text the same number without reentering numbers. It's called GV Connect. Gonna try working with it tonight. ",
        "created_utc": 1491948051,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Guy thanked me for the tip and said it was nice.",
        "author": "ciuppinho",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64s5ex/pizza_guy_thanked_me_for_the_tip_and_said_it_was/",
        "text": "I don't order pizza often. If my wife has me watch the kids and it crosses into dinner time, sometimes I'll order a pie. I order from Papa John's. I tip in the app and I always tip $8. It doesn't matter if I order $12 or $30. I always tip $8. When the pizza guy delivered the other day he thanked me for the nice tip. It made me feel like the tip that I leave matters. I had been wondering if anyone over there cared. Thank your customers for the tip. They may also be wondering if the tip matters to you.",
        "created_utc": 1491930436,
        "upvote_ratio": ""
    },
    {
        "title": "Shift Manager possibly stealing tips? Best way to avoid this?",
        "author": "Prius_For_Life",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64rs3m/shift_manager_possibly_stealing_tips_best_way_to/",
        "text": "I'm a new pizza delivery driver...this is my first job ever, despite being 22, and maybe this is where i'm too naive, or maybe I put too much trust in people, I don't know.\n\nAnyway story time. I started work like a week ago, first week things are going good, I enjoy my job, and still do, but yesterday I worked Open to Close. I wasn't supposed too but someone didn't come into work, so I was asked by head Store manager if I could close, I said sure. I was the only driver from Open until 6, and then we only had one other driver from 6 to 10. I was solo again from 10 until close.\n\nAnyway with that being said from my mental memory I racked up at least 100+ miles, which equates to 20 minimum in mileage at the end of the night. I know for a fact, I got 1 $5 tip, an $8 tip and a $7 tip. This isn't counting the countless other random 1's and loose change I got. So at a \"minimum\" I should have gotten $40 ish at the end of the night. \n\nMy shift manager was in a rush to close. Everything was normal, I was washing dishes, she asked for the money/cc reciepts which were in my \"lockbox\" in the store etc. I gave all of this to her and then went back to washing dishes. \n\nNow generally immediately after she, or any other manager is done counting the money, I get it back as my nightly pay. This time however I didn't get it until we were both walking out the door together at closing. I quickly glanced over it, in the bag, I saw a ton of 1's and figured there is a 20 or two hidden in there so I just went to the bank to deposit my tips. \n\nUpon getting to the bank. I discovered I had 28 1 dollar bills and 4.50 in change. This strikes me as odd...but I deposit it, go to mcdonalds and then go home, because well i'm tired and it's 2:30 AM at this point. \n\nNow this is automatically less than the amount I gave you earlier. So i call in this morning to talk to the store manager to see if idk maybe my mileage didn't get clocked in for the night or something and guess what my mileage amount was for the night? 32.50....the exact amount I was given....that means I was shorted ALL tips I made for the night. I tried bringing this up to the manager and they said  I probably \"dropped\" the money and that was it....rightttt I drop my EXACT tip money out of the car...I don't keep a 5 or 8 or whatever I drop all of it. \n\nSo I work tomorrow and I want to figure out how to prevent this....is the solution that every time someone tips me I pull it out and just keep it in my car and never turn it in nightly? What do you delivery drivers do ? Any tips/advice is appreciated. ",
        "created_utc": 1491926948,
        "upvote_ratio": ""
    },
    {
        "title": "Non-tipper AND bitcher...",
        "author": "Valkeezy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64pc80/nontipper_and_bitcher/",
        "text": "Took a delivery tonight that was a sixth floor apartment. Outside apartments, so stairs. Order is there ahead of schedule. Lady plays dumb with a *\"siiignature?\"* when handed the receipt to sign. Hands it back with a zero on the tip line. If this wasn't annoying enough, she then asks where her ranch is. I check the tags on the boxes and explain that none were ordered. She then proceeds to bitch at me for not bringing the ranch she \"most definitely\" ordered. Because, you know, I'm a mind reader. Online order, so it wasn't on the CSR, either. As an aside, the garlic sauce that *was* actually ordered was there.   \n\nMy manager said I should've told her I'd give her the order for free **AND** come back with her ranch if she could find 'ranch' anywhere on the labels. Hindsight is 20/20. Ugh.",
        "created_utc": 1491894435,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery Karma",
        "author": "Justin33710",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64live/delivery_karma/",
        "text": "Here's my very proud story of karma that i received a couple weeks ago. To start off one of the drivers for our store used to be the regional manager for our franchise, got fired, came back a few months later to drive for our store. So she had a delivery up in the middle of lunch rush with a weird address, but a very popular store name so it was obvious where it was going. She complains that the address is wrong, I tell her \"Look its going to 'Obvious store' at the corner of St and Blvd.\" Off she goes on a double with it, and I think nothing of it.\n\nI come back from taking a few deliveries and see the problem order has been up for 44 minutes, she brought it back and said she couldn't figure it out. Guy calls asking where his order is. I explain we had some confusion in the store and it would be sent out soon. She gets back throws a fit about the address again and slips out \"I just didn't want to take it.\" So I have it remade and take the order myself. Get there, guy is annoyed but still offers me a $5 tip. I tell him not to worry about it and give him full change back. \n\nHe's pretty happy and I just tell him honestly we had a dumb driver throw a fit over the address. Go to my next delivery which is usually a $2 tip or so, guy is on the phone and doesn't have time to count his money. Tells me to \"just take it all\" $8 tip. \n",
        "created_utc": 1491850242,
        "upvote_ratio": ""
    },
    {
        "title": "Moldy Pizza",
        "author": "Tr2v",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64i70j/moldy_pizza/",
        "text": "I pulled back into my spot after running an order and see a lady pulling pizzas out of her trunk. I go in my door, she goes in the customer door, and we meet at the counter. She sets the pizzas down, opens the top one, and asks about the mold. \"These are from Friday, should they be moldy already?!\"\n\nThe manager proceeded to grab a knife, scrape some off, and eat it. \n\nShe looked horrified. I burst out laughing. \n\nIt was #4, the garlic butter that goes on PH HT pizzas. \n\nShe looked SOOOO relieved. I told her how I love the congealed garlic butter and she joined in the laughter. \n\nRandom story from today that made me smile. Something fairly rare at the hut. It was a hoot!",
        "created_utc": 1491809097,
        "upvote_ratio": ""
    },
    {
        "title": "\"I want to speak with a manager\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64hvl0/i_want_to_speak_with_a_manager/",
        "text": "[deleted]",
        "created_utc": 1491803549,
        "upvote_ratio": ""
    },
    {
        "title": "To the group that ordered 50 pizzas for immediate pickup.",
        "author": "Battlingdragon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64gs3f/to_the_group_that_ordered_50_pizzas_for_immediate/",
        "text": "Fuck you. \n\nUp yours\n\nCatch fire and die\n\nKiss my ass.\n\nDrop dead.\n\nAssmunch.\n\nTickle a cactus.\n\nSuck 37 dicks in a row.\n\nHate you so much.\n\nI hope all your farts are liquid. \n\nTime to play \"hide and go fuck yourself\".",
        "created_utc": 1491788430,
        "upvote_ratio": ""
    },
    {
        "title": "Customer stole my phone....",
        "author": "nick91_",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64en3j/customer_stole_my_phone/",
        "text": "All this happened yesterday. I have a small delivery ($24) and it is in this poor neighbourhood that rarely tip and are usually assholes.Anyway, since its a reaaally slow day i take this order without hesitation knowing that i probably won't be tipped at all. I go to this place, new place never been there before, i knock on the door and the most rude, disgusting and smelly customer i've ever had opens the door.I give them the food and the drink and ask them to fill the tip and signature on my phone (in our store we dont do slips if you have an android or ios phone).She checks her food, takes the phone out of my hands ( of course doesn't add a tip) and slams the door in front of my face with such force that i felt the wind from it. I got pissed off and started knocking on the door demanding she return my damn phone. She yelled from the other side of the door that the salad usually comes with 2 dressings(this is an option, not standart with the salad) and she wont return my phone untill i give her the dressings. Not knowing what to do i run back to the store, told the manager, got her dressings and drove back to her house. After a lot of swearing and yelling she gave me my phone back. I don't know what its going to happen next, but the manager said they might press charges for theft. Before you say i shouldn't have gave my phone to her, you are right. I almost never give my phone to customers, but she took it out of my hand as if she couldn't see whats written on it.\nThis job never fails to amaze me...",
        "created_utc": 1491763577,
        "upvote_ratio": ""
    },
    {
        "title": "A clear explanation of credit tips, delivery fees, \"mileage\".",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/64ejmk/a_clear_explanation_of_credit_tips_delivery_fees/",
        "text": "[deleted]",
        "created_utc": 1491762517,
        "upvote_ratio": ""
    }
]