[
    {
        "title": "Name Nurk. Nurk happy Nurk found tale cave.",
        "author": "murmelchen",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/8jswo2/name_nurk_nurk_happy_nurk_found_tale_cave/",
        "text": "Name Nurk. Nurk only around evolved. Nurk not evolved. Nurk head hurt because of evolved.\n\nNurk in many many people carrier. evolved complain about Nurk feet on heat air. evolved complain about Nurk sit with evolved.\n\nEvolved leave many many people carrier. Nurk see evolved left nice flat touch machine evolved used. Nurk thinks giving touch thing to evolved. but evolved not nice. sure Nurk no touch flat thing.\n\nso Nurk just look. hope evolved miss flat touch thing.",
        "created_utc": 1526453733,
        "upvote_ratio": ""
    },
    {
        "title": "Wear correct loin cloth when do cave support.",
        "author": "LP970",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/8jgrs1/wear_correct_loin_cloth_when_do_cave_support/",
        "text": "Today Ogg do bad. Ogg think that today is day to go to see Chief in other tribe area. Ogg put on best loin cloth. Clean one, with no magic red berry juice stains. Ogg start journey to other tribe like Ogg do every fire rise for many many moons. \nThis fire rise, Ogg need go to help Ogg's chief clean fire pits, not go see other tribe chief. Now clean loin cloth look like cave floor furs after water fall from sky and make wet sticky dirt. How can clean loin cloth better? Giant moving snake of water no do good job.",
        "created_utc": 1526339359,
        "upvote_ratio": ""
    },
    {
        "title": "[Follow story] Krogg small wolf friend run to stars",
        "author": "MankeySeeMankeyDo",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/8hd1te/follow_story_krogg_small_wolf_friend_run_to_stars/",
        "text": "Me Krogg. Me had small wolf friend. Small wolf friend die. Me hungry, want eat small wolf, Grorgg say no eat. Me no eat, put small wolf bushes.\n\nMoontime me sleep, small wolf come, sad. Me see small wolf come sad me sad. Me no like small wolf sad.\n\nGrorgg say dig ground small wolf in. Suntime me do. Moontime small wolf come happy. Me see small wolf happy me happy. Small wolf run to the stars. Me say bye. Water out eyes.\n\nMe paint small wolf in stars on cave no forget. Next suntime me find new wolf friend. Thank Grorgg and others for say wolf in ground.\n\nCHANGE: me learn Grorgg name many R many G",
        "created_utc": 1525582639,
        "upvote_ratio": ""
    },
    {
        "title": "Krogg eat small wolf?",
        "author": "MankeySeeMankeyDo",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/8h5xgm/krogg_eat_small_wolf/",
        "text": "Me Krogg. Krogg have friend small wolf. Small wolf find me food, me cook food, give small wolf. Small wolf happy. \n\nSmall wolf die. Krogg hungry, no small wolf bring food, want eat small wolf. Small wolf safe eat? How taste?",
        "created_utc": 1525503851,
        "upvote_ratio": ""
    },
    {
        "title": "Buk eat wiggle wiggle fin",
        "author": "Titularktrey",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/8edwo5/buk_eat_wiggle_wiggle_fin/",
        "text": "I am buk, Buk eat wiggle wiggle fin from river and big water. Buk want to tell you new way to get wiggle wiggle fin. Buk throw spear before, spear miss lots. Buk hungry.\n\nBuk now take stick and make a wide stick wall in river with tiny hole in the middle. Behind hole is stick wall circle. Wiggle wiggle fin go in first stick wall and pushed to hole. Wiggle wiggle fin go in hole and then wiggle wiggle fin too dum-dum to jump wall or find hole.\n\nBuk can get in stick circle wall and grab wiggle wiggle fin. Buk also put floaty red berries in stick circle. Many more wiggle wiggle fin inside stick circle next bright sky.\nBuk wife get fat. How fix?",
        "created_utc": 1524509527,
        "upvote_ratio": ""
    },
    {
        "title": "More Magic Red Berries",
        "author": "LP970",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/87kfcz/more_magic_red_berries/",
        "text": "Ogg have new tale about Magic red berries. When gather berries, Ogg get many lots of berries. Too many eat by Ogg only. Put into bowl for keep later when Ogg feel sleep need. \nMagic red berries in bowl for many passes of great sky fire and grey sky rock. Red berry part get brown and soft, fall off small stone inside. Ogg clean out bowl and throw small stone in fire pit.\n\nStrange smell come from fire. Ogg like smell. Smell good. Check fire and see small stones smoking and making good smell.\nMaybe good to eat? Ogg not know, but decide to try. Dig small stones out of fire. Ogg once eat food just out of fire and burn face. Ogg learn wait and then no burn face. \n\nOgg eat small magic red berry stone. Stone like soft rock, make Ogg tooth hurt. Smash with rock and eat. Still make tooth hurt. Maybe Ogg need go see Tribe Shaman for tooth hurt. Throw small smashed stones in water bowl to make soft.\nWater turn brown, have same smell as magic red berry stones in fire. Ogg drink bowl of brown water.\n\nWater now magic water. Everything Ogg see move slow. Magic water much better than just eat magic red berry.\nMaybe other cave persons want trade for magic brown water. Ogg not know.",
        "created_utc": 1522172482,
        "upvote_ratio": ""
    },
    {
        "title": "Big boom boom from sky",
        "author": "GothNek0",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/85xkw8/big_boom_boom_from_sky/",
        "text": "Me Fonk, Me come from hunt with wet sky and big boom flash destroy home. Me no know what do? WHAT FONK DO ABOUT SKY BOOM BOOM",
        "created_utc": 1521589218,
        "upvote_ratio": ""
    },
    {
        "title": "Cave wolf follow outside",
        "author": "Mukor",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/85rg8v/cave_wolf_follow_outside/",
        "text": "Wet fall from sky. Me go cave stay dry. In cave is wolf but small wolf. Small wolf not attack, but when go outside small wolf follow. What do now?",
        "created_utc": 1521539088,
        "upvote_ratio": ""
    },
    {
        "title": "Fire no work when wet fall from sky?",
        "author": "Guy_With_A_Stick",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/85ottu/fire_no_work_when_wet_fall_from_sky/",
        "text": "Hello, am Goonk. Am new here. Anyway, me and family outside. When outside, wet starts fall from sky and me and family cold. Me try make fire, but fire no work. Me try many times to make fire but fire not come. All help good.",
        "created_utc": 1521508078,
        "upvote_ratio": ""
    },
    {
        "title": "Bam miss Hawk Man",
        "author": "Bramshevik",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/85oamf/bam_miss_hawk_man/",
        "text": "Me Bam. Me in tribe with shaman hawk man.\n\nHawk man legs no work, but chief say feed hawk man, bring hawk man many feathers. Hawk man kind, tell Bam tribe many stories.\n\nHawk man very smart, tell tribe about giant sky fire, and great night rock.\n\nHawk man even tell story about stars. Hawk man say they sky fires too but far away. Hawk man say exist sky fires that dark but tribe not know what hawk man mean.\n\nHawk man die few day ago, but Bam still sad.\n\nBam miss hawk man, hawk man most smart in tribe. Bam sacrifice many goat for hawk man.",
        "created_utc": 1521503506,
        "upvote_ratio": ""
    },
    {
        "title": "[Meat-a] Blaarg have question cave rules. Blaarg confused.",
        "author": "beast_in_black",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/81xj1h/meata_blaarg_have_question_cave_rules_blaarg/",
        "text": "Blaarg new in cave. Blaarg see rules. Blaarg good cave person not do bad speak or action. But Blaarg confused cave rules.\n\nMaybe Blaarg have rock in head, but seems cave allow bad action stories. Rule Two say *\"but we not evolve yet.\"*, Rule Many say *\"Breaking is for un-evolved.\"*\n\nSo cave allow bad action stories from un-evolved breakers, since we not evolve yet, hurr?\n\nBlaarg go drink old berry juice now.",
        "created_utc": 1520168408,
        "upvote_ratio": ""
    },
    {
        "title": "Try magic red berries",
        "author": "LP970",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/80ha96/try_magic_red_berries/",
        "text": "Ogg collect wood for fire. All wood close to cave gone. Make Ogg go far to get wood. Often take Ogg much time to get wood and Ogg need eat. Find some red berries on bush Ogg did. Eat many berries and put others into pouch for carry when Ogg need eat when get hungry again.\nWhen get wood for fire, Ogg get tired. Red berries magic! Ogg head feel funny and Ogg chest thumper make faster thumping. No sleep for two days, Ogg think berry have magic no sleep power. Give to some berry to wife best idea Ogg had in many days. When great fire in sky fall below ground, Ogg wife go make sleep but with magic red berry Ogg wife want make playtime under sleep skins and no make sleep. Few magic berries left in pouch, tomorrow Ogg look for more.  \n\nOther cave people find magic red berry in trees?  ",
        "created_utc": 1519685037,
        "upvote_ratio": ""
    },
    {
        "title": "Grorgg is worry",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7vav06/grorgg_is_worry/",
        "text": "[deleted]",
        "created_utc": 1517790042,
        "upvote_ratio": ""
    },
    {
        "title": "Can remove man fur?",
        "author": "SantgoZpt",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7pvyzz/can_remove_man_fur/",
        "text": "Some moon ago, Girk see neighbor normal. I see neighbor again but fur is less and neighbor wife fur less too. Girk try remove with hands but much pain.\nIs possible man fur remove?",
        "created_utc": 1515756125,
        "upvote_ratio": ""
    },
    {
        "title": "Ogg like many lots new cave where do cave support",
        "author": "LP970",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7nxagr/ogg_like_many_lots_new_cave_where_do_cave_support/",
        "text": "Ogg many-two ^1 moon ago end wilderness journey and tribe allow become cave support. Ogg search for new cave where Ogg not get skins by trade and talk to bad other cave people. Ogg find cave where chief want Ogg be cave support. Chief show Ogg how cave support do and Ogg do good as Ogg can. Chief and Ogg drink old berry juice many times after no longer have cave support when great fire in sky fall into ground.\nMany-2^1 moon later, Chief come to Ogg say \"Ogg do good cave support, Chief give Ogg more skins.\" Ogg feel good. Chief and Ogg get more old berry juice. Ogg like Chief and cave where Ogg do cave support lots!\n\n\n\n\n\n\n^1 Count go: One, Two, many, lots, many-one, many-two, many-lots... or so Ogg was learned in Ogg tribe. Other tribe have more good way count?",
        "created_utc": 1515010145,
        "upvote_ratio": ""
    },
    {
        "title": "Grunk update: not Con Track Tar anymore!",
        "author": "Nekkidbear",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7m56r6/grunk_update_not_con_track_tar_anymore/",
        "text": "Some moons ago Grunk tell story of how he no have home, and was stuck as con track tar for witch doctor tribe. Grunk hear good story to tell around fire during shortest night feast. Warrior for witch doctor tribe, one of Chief’s loot-en-ants, decide to move out of this cave and take family to start new cave nearby. When new Chief hear this, she tell Grunk to ask Big Chief for warrior’s place. Big Chief say yes! Shaman for tribe is preparing for make Grunk part of tribe ceremony after new moon.  Grunk also get warrior’s share of meat too! Grunk no have to move tents every night! Grunk many happy like have much old berry juice but no drink drop. \n\nGrunk still dealing with buttmud though. Small lion creature that shares cave left it by wash up stream, instead of in lion buttmud pit. Grunk no see in dark. Lucky Grunk going to wash anyway.  Grunk decide not to make lion stew that night, but then Grunk mate find more buttmud by river when he go wash. Why does lion creature hate Grunk?",
        "created_utc": 1514255795,
        "upvote_ratio": ""
    },
    {
        "title": "Easy you get fur if follow story and re-draw other cave wall!",
        "author": "BEETLEJUICEME",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7lnt48/easy_you_get_fur_if_follow_story_and_redraw_other/",
        "text": "Long story, much advice.  \nGreat sky power give much hunt-luck to you if you re-write story on new cave wall this moon.  Bad bad hunt-luck if ignore.   \n--- \n\nRecently reminded that \"[no step on fire stick again](http://reddit.com/r/talesfromcavesupport/comments/7ljko3/firestick_hurt/)\"  is good tip I learn before from step on fire stick first time and also second time but not third time except once.  \n\nMe tell everyone after second second time:  \n \"no step on stick with fire\" and Chief Mahhome call me \"smart wise speaker\" and \"very loud good at fire story\" after say this.  \n\nNow I trade make loud smart story to have good warm skin and sometimes yum food when other caves kill kill extra kill.   Sometimes smart story also become warm women, yum fur too, with no trade just she like story.   \n\nYou do too.  Easy 12 wise tip.  Easy time learn.  Give me fur or food I teach how story.  \n\nExample be:\nNo step on fire stick and \nno step on sharp rock and\nno step on snek.   \n\nThat is two example and also one more.   \n\nAll no-steps you can count total big.  All fingers, all thumb big number story but only now if you give fur. Big number no-step story for you if you give fur, and then I tell you other no-step not just \"sharp, fire, and snek.\"  \n\nNo worry in cave or out cave if you know  complete no-steps wise word advice.  \n\nCall this \"No worry, complete 12--no-step solution for all problem in all life walk.\"   \n\nFur-back promise if you step with pain-step after smart words.  \n\nYou only need give 3 skin or 2 deer or 1 woman with light light hair and soft feel and after I give all no-steps to you.  You can be wise smart word person in your cave with my easy story system.  \n\n----\n\nAlso me sad if /r/talesfromcavesupport wrong place for telling about  12-no-step story opportunity.  Sorry no mean post wrong place.  \n\n Is all true!   Will give 3 skins to cave mod if leave story up to read for dumb cave persons who think I smart give skins.   You can be wise smart word person in your cave with my easy story.  \n\n----\n\nAlso give 1 skin to all persons who re-tell 12-no-step story and send their cave-friend to me for smart-words.   \n\nCelebrate tree-sex-light holiday this year with easy smart word story gift just 1 fur and I give. You then give warm women story, be warm with her worth many many fur, everyone happy tree-day.   ",
        "created_utc": 1514021440,
        "upvote_ratio": ""
    },
    {
        "title": "Firestick hurt",
        "author": "inucune",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7ljko3/firestick_hurt/",
        "text": "Uung step on firestick. Foot hurt now. Uung still need to go hunting. Uung not happy.",
        "created_utc": 1513970139,
        "upvote_ratio": ""
    },
    {
        "title": "Dog make smell, how to fix?",
        "author": "Chipdogs",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7jz7de/dog_make_smell_how_to_fix/",
        "text": "Me Krug. Mork is dog, belong to Krug. Mork good hunter, protect Krug family, eat pest scavenger birds, play nice with tribe children. \n\nOne problem with Mork, make bad smell at night. Worst smell ever, wake Krug, make Krug wife angry. \n\nWife make Mork sleep outside cave. Mork sad. Krug not like see Mork sad, Krug feel bad. But also Krug not want to be woke. \n\nHow to fix dog so not make bad smell at night.",
        "created_utc": 1513338356,
        "upvote_ratio": ""
    },
    {
        "title": "Still Cave Hiding",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7jll4f/still_cave_hiding/",
        "text": "Orange-utang is screaming outside - as the tribe did not accept crocodile (who had eaten several children) as important leader of tribe. \n\nPlease think of children. find way to feed orange raging tang to crocodiles. ",
        "created_utc": 1513192719,
        "upvote_ratio": ""
    },
    {
        "title": "The Place of Lots Fire But No Fire",
        "author": "Gambatte",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7bkktv/the_place_of_lots_fire_but_no_fire/",
        "text": "Kurk tell Krod to eat ox dung and go find new tribe. New tribe better; promise less food than Krod but extra food for extra work, so Kurk work hard, already get many more food than would have still work for dung breath Krod.  \nKurk new boss Grak. Grak better Krod; him brain rock only sometimes.\n\nGrak tell Kurk, go clean fire pits for friend tribe, friend tribe big happy. Kurk go and start clean. Friend tribe have many fire pits, but Kurk okay, friend tribe good people.  \nBut then Grak send message! Other friend tribe have big problem, fire pits no work, need Kurk go fix right away! Kurk tell first friend tribe sorry, need go other tribe, come back later. First friend tribe good, they tell Kurk it okay, Kurk come back after black dragon vomit fire into sky.  \nKurk pretty sure that mean tomorrow.\n\nKurk arrive at second friend tribe and look for big problem. Kurk see Many-Many fire pits, all have fires burning good - Kurk not see problem.  \nKurk find Lady Chief of friend tribe, she say very important make fire again. Kurk ask where problem, because can see Many-Many fire pits good. Lady Chief show Kurk one fire pit have no fire.  \n\"No can make fire boar meat,\" she say. \"Need make now! Kurk hurry, fix!\"  \n\"If hurry, why no make fire boar meat on other fire? Many-Many other fire, can make fire boar meat any fire.\"  \n\"NO!\" say Lady Chief. \"Great Spirit tell, can only can use this fire for fire boar meat.\"\n\nKruk no argue with Lady Chief when invoke Great Spirit; Kurk better off try teach ox to count from One to Many-Many. But Kurk think it nice for Lady Chief that Great Spirit say she only make fire boar meat on fire pit right next her cave; Great Spirit be sad if she have to walk extra ten step to other fire pit.  \nWell, Kurk here now anyway, so Kurk check fire pit.  \nKurk find there wood in fire pit - but fire pit flint no work.  \nKurk get new flint, throw away no work flint. Is no work flint just rock? Kurk no have time for *fill-oh-soff-ee,* Kurk need check fire pit is work again.  \nMake fire, pretty soon Kurk have big fire. Kurk now sure fire pit is work again, so Kurk tell Lady Chief that she can make fire boar meat now.\n\nLady Chief big happy Kurk.  \nKurk think maybe him waste him time - but if Lady Chief happy, and Grak happy? Kurk guess not really waste after all.",
        "created_utc": 1510138098,
        "upvote_ratio": ""
    },
    {
        "title": "Grunk want join tribe. No want con- track. Tar get everywhere! So stinky.",
        "author": "Nekkidbear",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7baste/grunk_want_join_tribe_no_want_con_track_tar_get/",
        "text": "Grunk nomad right now. Stay many winters with old tribe as con track tar. Old tribe make tar, paint and dig shiny stones. Tribe give shiny stones, skins to Grunk first home tribe for fix cave walls and painting when break. Life seem good. When home tribe chief ask about way Grunk work, Old tribe chief say good, keep Grunk longer! After long time, Grunk think Old chief really like and may ask to be part of old tribe, but never did. Chief ask new tribe help fix walls, and ask Grunk join new tribe. Grunk join new home tribe and keep work hard for old chief but still con track tar with old tribe.  Many moons later Grunk get tired of tar smell. Grunk friends all leave and just Grunk and Old Chief. New home chief get pickier, Grunk take too long, not fix everything, blah blah blah. Grunk decide find another home tribe.\n\nGrunk look for new tribe, but no one wanted. Soon Grunk get hungry and decide become con track tar with another new help tribe. This group fix walls for tribe tell witch doctor how much meat and berry juice he get for different spells. Witch doctor tribe like Grunk, but after 2 and 2 and 2 moons, witch doctor tribe big chief decide new group want too big share of harvest for fix walls. Big Chief decide to ask more new tribe to fix because they want smallest share. Chief ask Grunk stay and work for more new tribe. Here Grunk go again. Grunk still con track tar. \n\nWitch doctor chief that ask Grunk stay leave tribe to join other tribe for bigger share of hunt. New Chief was chief assistant to chief that left. Still working for newest chief, still waiting to be ask to join tribe. When Grunk ask about joining tribe, newest chief say all harvest has been divided and no room for new bed in cave, just tents. Big Chief may decide to split tribe and move to even smaller cave next winter. New chief’s assistant say tribe like Grunk. Trust Grunk to watch babies too. But Big Chief has final say and little Chief still talk talk to convince big Chief. But not happening yet.\n \nGrunk afraid going to be con track tar until beard gray, eyes milky and joints hurt. Tired of getting butt-mud dumped on sleep skin because just con track tar not part of tribe. No want join new helper tribe again. How join tribe, settle down?",
        "created_utc": 1510028335,
        "upvote_ratio": ""
    },
    {
        "title": "Ogg take trip first time new village no Ogg boss man come.",
        "author": "LP970",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7b0pdg/ogg_take_trip_first_time_new_village_no_ogg_boss/",
        "text": "Ogg work cave support only many-two now. Ogg boss tell Ogg and Urg \"Move big shiny rock one cave to other cave just dug in village many suns far.\" Ogg and Urg never move shiny rock when no Ogg boss man come, boss man there times before. Ogg and Urg say \"We show boss man, we move big shiny rock no need boss man\".  \n\nOgg and Urg go village far away. Cave where pay-skins-for-use ask trade from Ogg boss man, not Ogg or Urg. Ogg and Urg not trade for eat, boss man trade for eat. Ogg never go to village before and boss man trade for Ogg's cave and eat. \n\nThe next sun Ogg and Urg go old cave and pull stick out of dirt that stuck in hole in shiny rock. Ogg say \"Cave paint where stick go so know how put stick back\". Urg say Ogg have good idea. Ogg and Urg then put big shiny rock in new cave down path not far. Urg look at cave paint to know where put back sticks. Ogg get *pour-ert nom-bur* (Ogg boss man say get this for know where put sticks so small cave can use big shiny rock). When sticks put in holes done for big shiny rock, Ogg and Urg plug sticks into hole small talk-sound rocks. Ogg pick up talk-sound rock, hear \"*dooooo*\" sound. Urg say stick in good hole. Ogg and Urg have no more big shiny rocks to move and no more talk-sound rocks to put stick in, so go back to cave where pay-skins-for-use. Next sun in sky, Ogg and Urg look make sure no bad cave user then go home to own cave.\n  \n\n\n  \n\n\n\n\n\n\n\nA little thanks to /u/Gambatte for the *Mod-urn wurd tran-slay-shun* idea.\n",
        "created_utc": 1509919510,
        "upvote_ratio": ""
    },
    {
        "title": "One Tiny Man not better Many Tiny Men",
        "author": "Gambatte",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/7a1jgl/one_tiny_man_not_better_many_tiny_men/",
        "text": "After [Kurk find Tiny Man slow at rocks](https://redd.it/79rok2), Krod still mad Kurk, so Kurk told to go find *REAL* reason stones slow. Kurk think when Krod say \"real reason\", he mean \"reason Krod like\" instead.  \nKurk go find Tiny Man, and Tiny Man still slow. But Kurk think two Tiny Man faster one Tiny Man; maybe Tiny Man boss can get second Tiny Man to also get stones for Krod.\n\nKurk find Tiny Man boss. Kurk call him Lrrgl. Not his name, but Kurk call him that anyway, because it the noise Kurk think he make if Kurk squeeze him soft fleshy neck bits.  \nLrrgl say no get two Tiny Men, because Tiny Man is *sin-crow-nest apple-kay-shun*, which mean if two Tiny Man, then fight all time, like Kurk and Kurk brother after old berry juice. Kurk think maybe Lrrgl bad idea to make Tiny Man *sin-crow-nest apple-kay-shun,* because Kurk think it pretty clear that two Tiny Man that work together, not fight, better than one Tiny Man. If can have two Tiny Man, then why no Many Tiny Man? Maybe even LOTS Tiny Man! Kurk think then stones coming to Krod as fast as stones can fall off Earth Mother mountain!  \nLrrgl give Kurk look like he Elder Kai, who so old that he many time forget loincloth when leave cave for walk. Lrrgl say Kurk not understand because Kurk caveman, not a *soft-wear dee-veal-ape-are,* what ever that am. Lrrgl say him explain anyway; Tiny Man is ~~sink~~ ~~sin-cron~~ they way he am because *sea-sharp-net* not have *ay-sin-crow-nest you-dee-pee ree-sea-var*. But Kurk know this one, because Kurk one time get lost after drinking old berry juice and wake up with fishing tribe! Kurk learn about sea and nets before come home to own tribe. So Kurk ask Lrrgl why Lrrgl not use *bee-gin-ree-seeve meff-odd* which has been around since *net-two-point-oh*? Maybe then there can be many Tiny Man working together, send Krod many stones very fast.\n\nLrrgl not talk to Kurk any more. Make Kurk think about making Lrrgl make Lrrgl sound. Lrrgl not talk to Kurk then either, but Kurk think maybe he okay with that.  \nKurk tell Krod about Lrrgl and why only one slow Tiny Man. Kurk think Krod no understand, because Krod still angry at Kurk, even though Lrrgl work for Krod, not Kurk! Make Kurk think about making Krod make Lrrgl sound too.",
        "created_utc": 1509512320,
        "upvote_ratio": ""
    },
    {
        "title": "big shiny rock sometime come cracked",
        "author": "Aarynia",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/79x0kt/big_shiny_rock_sometime_come_cracked/",
        "text": "Aarg have problem. Con-trak-tar help Aarg move biiiig shiny rock, new shiny rock, and all us were happy. But then big shiny rock suddenly have big crack in, and mess up shiny. Boss unnerstan, some big rock have cracks, but other, meaner not boss think she make crack go away by shout at Aarg. Aarg try fixing best and fast Aarg can, but not boss still mad and shouty and Aarg now have to make many wall painting copies of story of fix so notboss not feel left out. \n\nAarg can't drink old berry juice, was sick last time did. Other cave others have idea?",
        "created_utc": 1509468316,
        "upvote_ratio": ""
    },
    {
        "title": "Many bag worse one bag.",
        "author": "Gambatte",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/79rok2/many_bag_worse_one_bag/",
        "text": "Kurk boss Krod angry, stones from tiny man too slow. Send Kurk look make stones faster. Kurk look, tiny man find good stone, put in bag, put bag on ox, send to Krod. Kurk think this not bad.  \nThen tiny man find many handfuls of good stones! Many many handfuls! Tiny man sit down on pile and put one stone in bag, bag on ox, send to Krod. Then he get another bag, put one stone in, put bag on ox, send to Krod. New ox, new bag, one stone, send to Krod. Take loooooong time.  \nKurk say \"Tiny Man, ox strong! Bag big! Bag hold all these stones, only need make one trip!\"  \nTiny Man look at Kurk like he drink too  much old berry juice, then go back to same as before. Kurk tell Krod what problem is, Krod say Tiny Man know best because Tiny Man con-track-tar.  \nKurk only know tar slow down mammoth for easy hunt, but even slow tar mammoth faster than Tiny Man with big rock pile.  \nBut slow Tiny Man is Krod problem now.\n\n---\n\nKurk make joke! Of course Tiny Man not Krod problem, Krod still blame Kurk. ",
        "created_utc": 1509406323,
        "upvote_ratio": ""
    },
    {
        "title": "Grog lonely",
        "author": "mtjacksn11",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/793o8o/grog_lonely/",
        "text": "Grog happy find other Grogs.\n\nGrog share happy with female.\n\nFemale laugh. Female happy.\n\nThank Grogs.",
        "created_utc": 1509115378,
        "upvote_ratio": ""
    },
    {
        "title": "Ogg no go hunt",
        "author": "yismeicha",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/77eqy3/ogg_no_go_hunt/",
        "text": "Ogg no eat. Ogg angry. Ogg stupid. Ugg hunt. Ugg eat. Ugg says ogg no hunt ogg no eat. Next time ogg hunt. ",
        "created_utc": 1508423515,
        "upvote_ratio": ""
    },
    {
        "title": "When dark other me awake Grorgg confuse",
        "author": "grimess",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/76gx6a/when_dark_other_me_awake_grorgg_confuse/",
        "text": "When me Grorgg go dark when dark out\n\nGrorgg lie on mammoth wool and go dark with eyes dark. Now Grorgg awake outside or when something from before. I go dark but awake in other way Grorgg thinks. I run harder when awake in dark. Sometimes I sky creature or walk in sea. Grorgg even fight. Grorgg always win. But Grorgg just good like that.\n\nBut Grorgg confused dark me think of food and food there. When Grorgg do that no food. Grorgg need Hunt. Why that? Others too? ",
        "created_utc": 1508040654,
        "upvote_ratio": ""
    },
    {
        "title": "Cave now wet",
        "author": "inucune",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/76e9gw/cave_now_wet/",
        "text": "Orrg find cave near river for Orrg's mate.\n\nOrrg's mate not happy until cave near river.\n\nRiver now in Orrg's cave.\n\nOrrg's mate not happy.\n\nWhat do?",
        "created_utc": 1508010008,
        "upvote_ratio": ""
    },
    {
        "title": "AHHHHHH",
        "author": "adnam_",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/765y2t/ahhhhhh/",
        "text": "AAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH ",
        "created_utc": 1507912291,
        "upvote_ratio": ""
    },
    {
        "title": "Tug tribe proud of son.",
        "author": "mitchdude1",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/761u7z/tug_tribe_proud_of_son/",
        "text": "Tug son Jub catch runs fast no horns, but he no eat. Jub say sit on runs fast, make hunt fast. He get thrown from runs fast, tribe all laugh, but he sits on runs fast more. Now runs fast no throw Jub, carry many sharp rock stick. Jub best Hunter, Tug proud. ",
        "created_utc": 1507861233,
        "upvote_ratio": ""
    },
    {
        "title": "Wall need new words. Me help",
        "author": "Puterman",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/761p2y/wall_need_new_words_me_help/",
        "text": "Boss need travel over hills to Big Chief, take pretty shapes to Big Chief for year end talk.\n\nBoss no like bag for pretty shapes. Boss no learn shape bag, want smash bag on rocks.\n\nMe organize bag, stack shapes in big pile, write \"shapes\" on pile. Make pile only thing in bag.\n\nBoss yell, wave arms. Boss want kill bag. Boss want smaller bag, but want no trade furs for smaller bag. Me shrug, tell Boss this what we have, go over hills and ask for smaller bag after shape showing.\n\nWhen Boss gone over hills, me put up feet, watch cave wall until dark.",
        "created_utc": 1507859635,
        "upvote_ratio": ""
    },
    {
        "title": "Cave wall dead",
        "author": "katzohki",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/760yt4/cave_wall_dead/",
        "text": "Me used come look at scrawls on wall, but now no new scrawls. Me miss Grog. Maybe me smash wall off and on again with lizard and see if that fix.",
        "created_utc": 1507851658,
        "upvote_ratio": ""
    },
    {
        "title": "Me Krug. Me need halp.",
        "author": "Agent_Wolff",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6v5ash/me_krug_me_need_halp/",
        "text": "Me krug. Me need tool. Tool be used for cutting stuff. Stuff give me food. Me need halp. Tool for cloth for loins?",
        "created_utc": 1503343108,
        "upvote_ratio": ""
    },
    {
        "title": "Aarg unsure",
        "author": "Aarynia",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6tmczf/aarg_unsure/",
        "text": "Aarg told by cave-sharers that we go on long long trip, walk all night and some day. Aarg know Aarg get bored, need things to look at. Aarg also hear of new shiny wall painting, with colored rocks that make center shiny flash and pretty. Hear others have seen these. Aarg already see really famous one, with monsters and flying pointysticks and stone animals and giant angry male cow. Any cave peoples know other cave paintings for switchy color rock wall viewing?",
        "created_utc": 1502716989,
        "upvote_ratio": ""
    },
    {
        "title": "Loin cloht advice, female oppinions want",
        "author": "HunnicUnderwear",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6of1ws/loin_cloht_advice_female_oppinions_want/",
        "text": "Hi. Me Krr-kt. Am not muscle, no tall. But have many cloths for loins! But which one make all female tribe members go zug-zug-zug at spirit danse too morrow? Help!\n\nHave tigerskin, but old old. Maybe fleas, sure itchy. \n\nHave pine branch. Fashionabl, everyone look! Needle leaf itchy, worse thn tigger. \n\nHave badger. Nice color, very beauty. But secret! Really just rabbit skin and ash from fier pit. You notic?\n\nPleas help,\nKrr-kt",
        "created_utc": 1500541237,
        "upvote_ratio": ""
    },
    {
        "title": "Me Simu, Sabertooth in cave.",
        "author": "madayagsimu",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6mmoyq/me_simu_sabertooth_in_cave/",
        "text": "Me Simu. Am food taker of tribe Mugga. 3 sun before, Simu is collect lizard for food stick when Sabertooth attack. Simu run to cave and Sabertooth is follow.\n\nSimu hide behind big rock, am need help with big cat. What do?",
        "created_utc": 1499784735,
        "upvote_ratio": ""
    },
    {
        "title": "Ugh been on many hunt. Good to be back at Cave.",
        "author": "datChef",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6lqp0x/ugh_been_on_many_hunt_good_to_be_back_at_cave/",
        "text": "Ugh been on hunt long time. Many suns come and Ugh hunt every time. Now back at Cave. Ugh bring back much mammoth, get several suns rest. Feels good. Ugh happy to let others go hunt now. Ugh stay at Cave and have old berry juice and sleep. Ugh see family for first time in many suns, happy to share with Cavesupport.",
        "created_utc": 1499394128,
        "upvote_ratio": ""
    },
    {
        "title": "Help Babars Tribe",
        "author": "RAGU_LORD",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6jkzqv/help_babars_tribe/",
        "text": "Long time lurk. First time post\n\n Hi. Me Babar. Babar need help. Common mammoth hunt all gone. Babar need to survive. Babar needs moral support. With no food Babar is hungry. Babar wife leave him for Bungbung the great warrior. Anyone have advice to kill Bungbung and get mammoth back (as well as Babars wife?)\nThank you\n-Babar  ",
        "created_utc": 1498482793,
        "upvote_ratio": ""
    },
    {
        "title": "Help, hunt go bad.",
        "author": "RemmiDaMix",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6jhvqx/help_hunt_go_bad/",
        "text": "Hi. Me am Rim. Rim go hunt with tribe. Normal, us see mammoth. Very normal see. We go behind tree, then shock, a saber cat! We all do scream, then run back cave. Saber cat run behind us, but us smart. On way to cave, we push rock. Rock go down and go CRASH on saber cat head. We are at cave now, with none food. Me need help for easy way to get food. And fast. Elders be skinny and weak, kids getting impatient. Me little seven season cycle old cousin bit my arm, because so hunger. Please help.",
        "created_utc": 1498437722,
        "upvote_ratio": ""
    },
    {
        "title": "Me Rookak, cave crumbly",
        "author": "ToxyFlog",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6jggkm/me_rookak_cave_crumbly/",
        "text": "Mammoth herd stomp stomp, make boom over cave me sleep. Rock fall, hit head, ANGRY. Me take pointy rockstick, put in mammoth bunghole. Mammoth make tasty meal. family happy no make more boom.",
        "created_utc": 1498421583,
        "upvote_ratio": ""
    },
    {
        "title": "Why no talk talk here",
        "author": "tathlotsmanyepic",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6jg8ia/why_no_talk_talk_here/",
        "text": "Ugg like this talkplace, come talk now, or Ugg you kill will\n\nUgg always watch",
        "created_utc": 1498419147,
        "upvote_ratio": ""
    },
    {
        "title": "Dok know what do.",
        "author": "PolloMagnifico",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6cvu2g/dok_know_what_do/",
        "text": "Dok do cave fix for much moon. Tarunga (not real name. Dok anona... anony... anonmi... Dok make new name so not know who is) come to Dok. Say he see sharpfur. He use rock-stick, but sharpfur too fast. Tarunga not die but get bad hurt. Want better rock-stick.\n\nDok show him new rock-stick. Sharp rock, long stick. Tarunga happy, say Dok smart. Tarunga gone now, find new sharpfur to test rock-stick with.\n\nDok feel good.",
        "created_utc": 1495557693,
        "upvote_ratio": ""
    },
    {
        "title": "Aarg back, need speak",
        "author": "Aarynia",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/6aloe3/aarg_back_need_speak/",
        "text": "Aarg back from long hunt. Aarg have broken problem. \n\nAarg tired sharpening stick with white rock for tribe. Aarg tired of tribe. Aarg want find new tribe. How find new tribe when Aarg only know white rock? Aarg what learn black rock, or red rock, but no have black rock or red rock, only white. Aarg have no time find own black or red rock. \n\nAarg tired.",
        "created_utc": 1494524304,
        "upvote_ratio": ""
    },
    {
        "title": "Me is Grug",
        "author": "JayAtCampmixup",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/68ptxf/me_is_grug/",
        "text": "Me is just come here in caveplace after me chase mammoth. Me get hurt chasing mammoth. Helpful someone help me so me give them rockstick. They happy me happy. We kill mammoth. Have a feast.",
        "created_utc": 1493684301,
        "upvote_ratio": ""
    },
    {
        "title": "Is sky God sad?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/68prkc/is_sky_god_sad/",
        "text": "[deleted]",
        "created_utc": 1493683632,
        "upvote_ratio": ""
    },
    {
        "title": "Others no be in cave, Koo sad",
        "author": "VampyIceMan",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/68mmc4/others_no_be_in_cave_koo_sad/",
        "text": "Koo want to talk in cave with others. Others no in cave to talk to. Koo want talk about rock and stick, and Koo want make rock-stick, but others no be there. What do?",
        "created_utc": 1493652482,
        "upvote_ratio": ""
    },
    {
        "title": "Name Ook. Back now.",
        "author": "imahighhorse",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/60sa94/name_ook_back_now/",
        "text": "Cave painting fun. Grug stupid. Grug no find cave painting fun. Grug like to tug. Tug stick- between-leg. Me find tug fun too. Tug good? Tug myself. No tug Grug. Grug tug Grug. Me tug me. Me Ook. Ook tug Ook stick. Nuff stick talk. Now rock talk. Soft rock good? Soft rock taste bad. Squishy brown rock from after waterfall taste bad. Eat berry instead. Cave painting fun.",
        "created_utc": 1490152406,
        "upvote_ratio": ""
    },
    {
        "title": "Move Sun, Moon.",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5x67jv/move_sun_moon/",
        "text": "Many in village been drinking too much old berry juice. \n\nCavewoman yell at me that sun was setting too early. Moon rising too soon.\n\nShe apparently did not notice it was colder, and plants were resting.. for winter. \n\nI would have sent her to eldest woman, but the orangutan has been rutting a youngling. \n\nMe really need to go find new cave. New village.  ",
        "created_utc": 1488491142,
        "upvote_ratio": ""
    },
    {
        "title": "Not first time strange painting show in cave, Oog say",
        "author": "silvermistshadow",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5qwo4j/not_first_time_strange_painting_show_in_cave_oog/",
        "text": "Me not get shiny rock for cave support, but me help tribe still. \n\nOne time Oog tell part of tribe that Oog wake up one morning with strange painting in cave. Oog draw painting on rock. Me know painting shows what wrong with Oog cave. Me ask Oog make more clear draw on rock. Oog say not need, not first time Oog find strange painting in cave.\n\nMe not sure if should be happy Oog not complain more, or worried for Oog cave.",
        "created_utc": 1485729224,
        "upvote_ratio": ""
    },
    {
        "title": "Cave Hiding.",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5pxgrp/cave_hiding/",
        "text": "Still hiding in cave. \n\nWomen stomping all over village - but Orangutan still Chief.\n\nMadness. \n\nUpdate. Orangutan took a poop in cave of Lakot. many other tribe men took this as example. Who is going to clean that up?",
        "created_utc": 1485279395,
        "upvote_ratio": ""
    },
    {
        "title": "Crug say no rock person, crug say he only stick person.",
        "author": "Rath12",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5ovz7n/crug_say_no_rock_person_crug_say_he_only_stick/",
        "text": "Crug many dumb, crug too old.  I help crug make gooder rock point stick.  I show crug, crug say he no Rock person.  Me very mad, rock stick easy, crug no want to learn.  I wanna poke crug with rock stick.   But cannot, crug is relative.  Crug gonna get poke by mammoth he no know how to sharp stick.",
        "created_utc": 1484823795,
        "upvote_ratio": ""
    },
    {
        "title": "Dugga new to cave, no happy with elder. Elder make mess fire.",
        "author": "SunosUnix",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5mvhd7/dugga_new_to_cave_no_happy_with_elder_elder_make/",
        "text": "Dugga fire maker. Elder say need fire now. no have wood. Dugga say no wood no fire. Elder give Dugga wood for fire. Wood was poking sticks and club. Elder not know fire and get mad at Dugga because fire make stick go away. Club little there. Dugga hide in cave now. Dugga no want be shoved in tar.",
        "created_utc": 1483934253,
        "upvote_ratio": ""
    },
    {
        "title": "Rock, Rock, Rock.",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5m786u/rock_rock_rock/",
        "text": "Me teaching cub to knap rocks. \n\nShow cub to hit rock with hard rock to break it to sharp pieces. \nCub then trys to hit the hard rock with rock that can be sharp. rock in his hand breaks, and cuts him.  Then he trys to break hard rock with another hard rock.  and hits his own hand.\n\nI decided to let him fail trough this. eventually he will understand.  \n\nor have two broken hands. \n\n",
        "created_utc": 1483632638,
        "upvote_ratio": ""
    },
    {
        "title": "Rock no brake stick. What do?",
        "author": "lets_get_hyyerr",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5izfdl/rock_no_brake_stick_what_do/",
        "text": "*Ooog*\n\nRock no break stick. Other tribe give rock to me. Help me hunt. Make many spear to kill big hairy beast. Rock no work though!\n\nIt brake apart in tiny rock pieces. \n\nWhat do?",
        "created_utc": 1482051104,
        "upvote_ratio": ""
    },
    {
        "title": "How Marg start do Cave Support",
        "author": "RevolverMargay",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5ib8tz/how_marg_start_do_cave_support/",
        "text": "Old Cave Support man tell Chief him too stupid for have fire. Chief hit in head with club, now need new Cave Support. Marg standing near Chief cave when happen, so Chief pick Marg. \n\nMarg live in cave long time, know how cave work, think new job not so bad. Better than sit in cave and do woman work. Then Chief ask Marg make fire that stay fire even when put water in. Old Cave Support right! Chief stupid! Even stupids think him stupid. But Marg not want hit with club so Marg not say this. \n\nInstead Marg say this good idea, tell Chief how strong thinking him have. Marg lie through teeth and meantime cross fingers so evil spirits not come. Chief not notice. Then Marg say Marg stupid, ask how Chief want fire to turn off so not burn up all skins and meat in cave. Chief stop and do thinking, him only stupid about cave things. Him not stupid about things him want. Chief say him change mind now, want keep fire that turns off. Marg make fire again in Chief cave and go back to own cave, drink old berry juice now until forget Marg have to say stupid Chief strong thinker. \n\nNext wall, Marg paint about cavemen that call Marg fake fire girl. If Marg really fake fire girl that only support cave for impress strong hunter, Marg do better job, already get strong hunter mate and go make own tribe without stupids!",
        "created_utc": 1481730218,
        "upvote_ratio": ""
    },
    {
        "title": "Oog Aeg",
        "author": "DeeSpyBoxes",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5gkfgh/oog_aeg/",
        "text": "&gt;Aeg find oog and oog surprise.\n\n&gt;No have food prepare so Oog go find animal\n\n&gt;Dead animal make good food for aeg\n\n&gt;He compliment on good food\n\n&gt;I am happy and satsify with food\n\n&gt;Some other cavemen laugh at aeg, i get mad\n\n&gt;No yell at aeg! I say\n\n&gt;Aeg is happy with me\n\n&gt;Me is super happy with aeg\n\n&gt;Everyone still laughing\n\n&gt;I punch tribe and they all leave\n\n&gt;Sit with aeg\n\n&gt;Just cant be still, can you oog?\n\n&gt;Oh Aeg! I say\n\n&gt;Heavy sitcom laugh play\n\n&gt;Noon is approach\n\n&gt;Can't hold it in longer\n\n&gt;Evebtually I bend on one knee and look at aeg\n\n&gt;No! Say aeg\n\n&gt;As I bend on knee I look at aeg and say 'yes, see first letter of this shitty fucking joke. Why am I still on this subreddit? I've spent like an entire 3 hours dedicating my life to this joke just to have it be shitty. Fuck me. Honestly it's 1 in the morning. Fuck this. I'm going to sleep",
        "created_utc": 1480919059,
        "upvote_ratio": ""
    },
    {
        "title": "Stick not stick!",
        "author": "Poligrizolph",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5gjyx1/stick_not_stick/",
        "text": "Biggest hunter Prek is asking for new stick. Prek is say, Taku! Bring new stick, for hunt! Taku bring new stick. Taku give many meat for new stick. Prek go away with new stick. When Prek come back, Prek say, Taku! You are bringing shame onto clan! New stick all break! Taku not know what say. Taku ask, what you do when use stick? Prek laugh. Prek say, Taku, you are idiot! You hit animal with stick, like this! Prek swing stick, like club-stick.\n\nStick not club-stick. Stick poke-stick.\n\nPrek not big hunter, now.",
        "created_utc": 1480912452,
        "upvote_ratio": ""
    },
    {
        "title": "Ugh new to cave. Ugh make story.",
        "author": "datChef",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5g3m5m/ugh_new_to_cave_ugh_make_story/",
        "text": "Ugh local Fire maker. Help make fire. Help fix wood when no fire. Big Bunga come ask Ugh \"Bunga need fire now. Club mammoth. Ugh come fix fire now.\" Ugh walk long time. Find Big Bunga cave. Bunga big mad. Say no fire here. Ugh tell Bunga need wood. No wood no fire. Bunga tell Ugh find wood make fire. Ugh tell Bunga Ugh Fire Maker not Wood Maker. Ugh needs old berry juice. Big Bunga must been hit with club.",
        "created_utc": 1480690120,
        "upvote_ratio": ""
    },
    {
        "title": "Club work how? Dumb boss woman Zog!",
        "author": "surzirra",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5g14ua/club_work_how_dumb_boss_woman_zog/",
        "text": "Me club support. Me help cavedumbs make club hit good.\n\nBig woman name Zog. Mostly Zog make other caveman swing club. Sometime Zog want swing club. Bad time for Sur.\n\nZog say mad at Sur, \"Zog club swing not good, how club work, club broke, need best club. I boss cavewoman Zog!\"\n\nSur say Zog, \"Let Sur swing club, maybe figure out why club broke for Zog?\"\n\n\"Here is club, I go do fire yelling. Sur stay, fix club.\" say Zog to Sur like she fancy mammoth. Zog go.\n\nSur swing club, is good club! Sur wonder why Zog not like club. Zog come back from fire yelling.\n\nSur say Zog, \"club swing good for Sur. Zog show Sur how Zog swing club.\"\n\nZog take club by big end and try swing. Zog look like monkey with big poo stuck on hand.\n\n\"Zog, try swing club from small end.\" Say Sur, trying not laugh at dino-brain Zog.\n\nZog think. Zog now know Zog dumb. Zog no like know Zog dumb.\n\nZog look mad in big face, say \"I know how club works, this club made bad by dumb caveman! Zog will keep, Zog afraid dumber caveman make new club. Sur go now!\"\n\nSome day Sur want jump in tar pit.",
        "created_utc": 1480650198,
        "upvote_ratio": ""
    },
    {
        "title": "Grog come to pop, say \"me no want fire\"",
        "author": "Lololipop4308",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5fyk07/grog_come_to_pop_say_me_no_want_fire/",
        "text": "Me say \"okay put out fire\"\n\nGrog say he no want put out fire. He say he no make fire. I step outside cave and see lots fire. Fire everywhere.  Me go back in cave, rock over front hole. Me no start fire grog worry.",
        "created_utc": 1480620277,
        "upvote_ratio": ""
    },
    {
        "title": "Oog",
        "author": "DeeSpyBoxes",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5fwqzj/oog/",
        "text": "Only oog",
        "created_utc": 1480601581,
        "upvote_ratio": ""
    },
    {
        "title": "This me story all how Ug life make turnside down",
        "author": "Lololipop4308",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5egkb4/this_me_story_all_how_ug_life_make_turnside_down/",
        "text": "This is me story all about how Ug life make turn turnside down\nMe take time you sit over there\nUg tell you story how he find lair. \n\nIn wet rock cave Ug born and made\nMe run long time hunt most day\nStabbing,  slashing hunting for foo\nSpearing me rock in caribou \nUntil a couple of herd up on move,\nMade Ug run with caveman crew\nI caught one caribou and caveman woman get scared\nSaid \"Follow food over there!\"\nMe rustle in the bushes and when me near,\nMe rock caribou in head in ear\nMe think this meat rare\nMe say cavemanwoman \"bunga later.\"\nWe climb rocks and find lair",
        "created_utc": 1479895437,
        "upvote_ratio": ""
    },
    {
        "title": "Me go hide in cave.",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5c3cba/me_go_hide_in_cave/",
        "text": "Old Chief recently die. Savage battle with Elephant. \n\nTribe selected orangutan to lead tribe. Me go hide, time to go find new tribe to live with.  \n\nRest of tribe can sit around fire and throw poo.  ",
        "created_utc": 1478721727,
        "upvote_ratio": ""
    },
    {
        "title": "Elder still no use ears",
        "author": "Aarynia",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/54tzeb/elder_still_no_use_ears/",
        "text": "Aarg visiting. Much have anger because elder is elder elder and not listen.\n\nCavewoman in near cave make much anger and noise because her rocks brown, do not make right color for her cave. Elder come to Aarg's cave and shout at Aarg because Aarg talk to near cavewoman last, tell Aarg to bring cavewoman brownrock. Aarg try to tell Elder that cavewoman want greenrock, not brownrock. Elder tell Aarg to dig in Elder's cave and find brownrock for cavewoman because Aarg know what brownrock look like, and Elder is too elder to dig. Aarg already been in Elder's cave many time already since burning fire in sky, and not want to be in Elder's cave because Aarg too tired and has much anger with Elder for have Aarg stack Elder's rock pile in first place.\n\nAarg want to drink much sour berry juice when sky fire gone, will go back to favorite caveman's cave and stay there. ",
        "created_utc": 1475025805,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Support day.",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/546bsb/bad_support_day/",
        "text": "Me wake hangry. roasted beast not satisfying. \n\nMorg yell he need help with big rock. \n\nMorg try to roll big rock up steep face of cliff. \n\nI yell - he need to roll up easy path. \n\nMorg yell at me like I was his mother. \n\nI throw rock at Morg. Hit Morg head. large rock roll over Morg. \nMorg now mess on ground. \n\nBig rock roll down and split open when it hit other large rock. \n\nWhat do with rock? ",
        "created_utc": 1474656886,
        "upvote_ratio": ""
    },
    {
        "title": "Someone ask what most stupid thing am see. Here story.",
        "author": "user_82650",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/51wino/someone_ask_what_most_stupid_thing_am_see_here/",
        "text": "Ook: \"Cave Support, how can Ook help you?\"  \nGrog: \"Am not see Grog favorite cave painting!\"  \nOok: \"Is Grog in right cave? Maybe Grog go in wrong cave\"  \nGrog: \"SIR, Grog am NOT a painting person so Grog don't know.\"  \nOok: \"Is Grog facing wrong way? Maybe painting in other side of cave\"  \nGrog: \"Grog don't understand strange speak!\"  \nOok: \"Okay, can Grog turn around and say if Grog see any painting?\"  \nGrog: \"SIR, ME ALREADY SAID AM NOT PAINTING PERSON, YOU NOT HELP ME SEE PAINTINGS, GROG KILL YOU NOW!\"\n\nThen Grog hit me on head with stick and it hurt. Me kill Grog next. Cave paintings right behind him.",
        "created_utc": 1473412860,
        "upvote_ratio": ""
    },
    {
        "title": "Slave Woman Dead",
        "author": "garrypig",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/51e8fl/slave_woman_dead/",
        "text": "Slave mate woman die ho we to cook?",
        "created_utc": 1473150481,
        "upvote_ratio": ""
    },
    {
        "title": "Big sky fire not cave fire",
        "author": "I_throw_socks_at_cat",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/5071af/big_sky_fire_not_cave_fire/",
        "text": "Me Ook in cave making rock pile more better.  Grag call for Ook, say him got fire problem.  Ook go help Grag fire problem.  Ook say \"What problem, Grag?\"  Grag point at big sky fire.  \"Big sky fire sleep under hills soon, but Grag still have many work to do.  You fix.\"\n\nGrag very many old, think big sky fire same as cave fire.  Ook shake head.  \"Big sky fire not cave fire.  Ook no can stop big sky fire sleep.\"  Grag say \"No, is fire.  You fix.\"  Ook try again.  \"Big fire much far away fire.  Not in tribe territory.  Ook no can fix.\"  Grag get angry, stamp feet.  \"You fix!\"\n\nOok think hard.  Could hit Grag in head with rock, but then maybe tribe not give Ook meat.  Could make fire for Grag work, but then Ook have to feed fire all night and Ook want go home to woman.  Ook have good idea!  Hit Grag in head with stick.  Not die, only sleep same time big sky fire sleep.  Ook happy.  Woman happy.  Grag not happy, but Ook never see Grag happy so it no problem.",
        "created_utc": 1472501334,
        "upvote_ratio": ""
    },
    {
        "title": "Ook not happy with life outside of cave.",
        "author": "imahighhorse",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4zisgx/ook_not_happy_with_life_outside_of_cave/",
        "text": "Me no like going away from cave. Ook learn how to clean rocks. Had to clean rock after Ook made butt mud on one. Why Ook have to learn to clean rock? Ook has more funner time making cave drawings. But no one like Ook because Ook stupid. Ook ugly. Ook only useful for cleaning rock. Ook not want to clean rock. Ook meet many other Ooks and bubumba Ooks since first meeting the one who hit Ook hard. Ook no fit in. Ook never find anyone who like Ook. Too busy telling Ook to go away. Ook go back to rock clean now. Ook no like rock clean.",
        "created_utc": 1472135769,
        "upvote_ratio": ""
    },
    {
        "title": "Olag from other tribe come. Tell me weird thing",
        "author": "Dbolical",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4z3n61/olag_from_other_tribe_come_tell_me_weird_thing/",
        "text": "Me in cave, not being bad. Rock pile on ground. Want to clean up rock pile. I cleaning up rock pile and Olag come. Olag say, \n\"HEY, YOU KNOW NOTHING I DO KNOW\". \n\nMe want to know and ask. Olag say rock from sky coming down. Olag crazy. Back to rock cleaning and rock come from sky. Big noise, big bang. Me scared. I stay in cave. ",
        "created_utc": 1471911026,
        "upvote_ratio": ""
    },
    {
        "title": "Me also god of water (long)",
        "author": "grimess",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4y2i25/me_also_god_of_water_long/",
        "text": "Many kill ago, me got hit with flying rock when scalping last kill. \n\nI angry at rock for giving pain, me yell 'go away!' and throw in bush. \n\nMe hear 'oof' and go look. \nNow I see knocked out small cave man with rock in skull. \n\nMe got sick, me see small cave man with small cave woman all time around light in sky changing. \n\nI now see small stream of water coming from face. Me put on finger and in mouth. \nTaste salt like big water on sand. \n\nSo I know from this salty water now I am not only fire god, like I already carved on tablet here. But water god too. \n\nSo me think because killing of small cave man, I please light in sky, because only dark light in sky normal see small man. So bright light got anger, and want dead small man. So I kill and light make me god of water. \n\nUgh. ",
        "created_utc": 1471389558,
        "upvote_ratio": ""
    },
    {
        "title": "Big Light in Sky gone, what do?",
        "author": "Grumpy_Kong",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4y097x/big_light_in_sky_gone_what_do/",
        "text": "Long time lurker, first time carver.\n\nThis not happen today, but many many season ago.\n\nWe camp by Big Tree Rock that Hot Season, many fishes. \n\nThen during Bright Time, a New Thing Happen!\n\nSuddenly it not as bright anymore!\n\nI know you think 'Must be rain, or stupid Cro Mag not know when Big Light go Behind Mountains'.\n\nBut it not that! Me am Smart Cro Mag and Me know that Big Light only goes Behind Mountains around when me get sleepy, and me know how cloud in sky work. \n\nThis not cloud in sky or stupid Cro Mag!\n\nIt something new! And dangerous!\n\nSkull Crusher looked at the place where the Big Light, now he not see at all!\n\nAnd we all scared to look now.\n\nBut he say it look like some beast took bite out of Big Light! Him last memory of light before the Big Light's dying cursed him eyes.\n\nThe Big Light came back later, me know not how, me too afraid to open eyes after Skull Crusher. \n\nBut me am thinking: What keep this from happening again in future? What am we doing when the Big Light dies again?\n\nSorry for bad grammar, am sending as smoke signal with eyes tightly shut. \n\n**TL;DR: Big Light in Sky Go Away and Steal Friend's Sight, What Do?**",
        "created_utc": 1471363469,
        "upvote_ratio": ""
    },
    {
        "title": "i missing some of birds",
        "author": "Leifr-the-Lucky",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4xy6uz/i_missing_some_of_birds/",
        "text": "I get tired of catching birds for eat and I say, why catch birds, if instead I keep birds. So I make big cage make from stick and sinew and fill up with many birds. \n\nTwo day past I have 3 and 3 and 3 birds. One day past I have 3 and 3 and 2 birds, not so many as before. I watch and I see bird fly out of hole in cage now have 3 and 3 and 1 birds. \n\nI fix problem, club all mine birds. Now 3 and 3 and 1 dead birds stay in cage.",
        "created_utc": 1471330385,
        "upvote_ratio": ""
    },
    {
        "title": "Me Ook. Here second tablet of me life out of drawing cave.",
        "author": "imahighhorse",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4xgf8d/me_ook_here_second_tablet_of_me_life_out_of/",
        "text": "Me get angry at other Ook today and hit over head with large stick. Not undercloth stick, big wood stick I use to kill food. Anyway, other Ook wouldn't let me play with \"fire\". He said he in- \"indemted\" it, and didn't want stupid Ook to touch. Ook know Ook stupid. Doesn't need other Ook to tell he stupid. So now play with fire. Use burnt wood to make pretty picture with black stuff on end of \"fired\" wood. Me like picture. Me stay with fire for while.",
        "created_utc": 1471043542,
        "upvote_ratio": ""
    },
    {
        "title": "Me is fire god, or me is filled with fire",
        "author": "grimess",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4xbeii/me_is_fire_god_or_me_is_filled_with_fire/",
        "text": "Me just made fire out of my bottom. \n\nYou know when beans in stomach go rotten and make smelly sound. Well me did do over fire place it goes boom. So now me  question to be fire god or filled with fire. Made myself art in new cave about me being fire god so me fire god. Not fire filled. \nUgh",
        "created_utc": 1470969480,
        "upvote_ratio": ""
    },
    {
        "title": "Knife Flyer Tool",
        "author": "Psypo",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4x8cug/knife_flyer_tool/",
        "text": "Me soon make knife shoot in air. Mr use big stick from ground with hair on horse together.\nHair on horse go to stick ends and make stick bend.\n\nPut knife on bendy stick and pull. Let go of hair and make knife go quick to places.\n\nMe like use knife flyer for hunt deer for lot of food! ",
        "created_utc": 1470926920,
        "upvote_ratio": ""
    },
    {
        "title": "Found new cave",
        "author": "grimess",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4x7snl/found_new_cave/",
        "text": "Me went out to look for new cave\nOld cave has smell of dead mammoth carcas. \n\nWent out to tree village, spoke with bushman. Friendly man. \n\nI hit him with club because he no give me cave. \nSo I took his hair for pillow. \n\nHis woman comes out of \nNowhere yelling me out for clubbing man. Try to club her but she fasted me out. \n\nFound her hiding in cave behind big rock. Very nice cave. Lots of space and many art. \n\nKicked her out of cave and me now live here,not her and club man. \n\nShe can have stinky mammoth cave. \n",
        "created_utc": 1470919580,
        "upvote_ratio": ""
    },
    {
        "title": "Me gather with other Ooks today",
        "author": "imahighhorse",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4x6uj4/me_gather_with_other_ooks_today/",
        "text": "Me Ook. Me no see any other Ooks. Me raised through tellings of stories through dropped clay tablets. Me think am smart. \n\nToday, see other Ook and wonder how other Ook is. Me no know why. Me walk toward Ook to speak to Ook an realize that no Ook. Ook have stick thing between legs. This Ook have big bubumbas on chest. Seem painful to Ook, so Ook decides to rub bubumbas to no make hurt no more. Ook woke up with big lump on head and even bigger lump in undercloth. Ook no idea what happen. \n\nThat my story. Now leave tablet behind for other Ooks to find. Me no like bubumba Ooks. Me stay away from them.",
        "created_utc": 1470900157,
        "upvote_ratio": ""
    },
    {
        "title": "tablet rock = magic",
        "author": "eddyteddy200",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4x6jpt/tablet_rock_magic/",
        "text": "me OC goes out to city, oc finds crazy things. OC finds magic shiny shop, shopkeeper tell me to change to new tablet rock. new tablet rock = magic. shopkeeper tell me it can talk via web. shopkeeper must be spiderman ",
        "created_utc": 1470894330,
        "upvote_ratio": ""
    },
    {
        "title": "Shut up medicine man, you drink too much old berry juice",
        "author": "katzohki",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4wxulc/shut_up_medicine_man_you_drink_too_much_old_berry/",
        "text": "Medicine man say he need new medicine in bag. Grog try take medicine bag to fill up for him, but he no give. Me no fill bag if no give, medicine man.",
        "created_utc": 1470769068,
        "upvote_ratio": ""
    },
    {
        "title": "Me lizard no work",
        "author": "katzohki",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4vtiw9/me_lizard_no_work/",
        "text": "Long time cave lurker, first time story teller\n Me: me \nLG: lizard guy \nPlease excuse formatting because I am on clay tablet\n\n\nLG: me lizard no work\n\nMe: have you tried smashing it off and on again?\n\nLG: me smash it off but it no smash on again\n\nMe: you need new lizard\n\nLG: ugh\n\nMe: ugh",
        "created_utc": 1470157525,
        "upvote_ratio": ""
    },
    {
        "title": "Why tree fall that way?",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4rokbm/why_tree_fall_that_way/",
        "text": "Gaak yell to me to come over.  He was felling trees for village.  \n\nGaak : Why tree fall that way?\n\nme : you are chopping this side.\n\nGaak : me want tree to fall other way.\n\nme : chop on other side.\n\nGaak : no. me chop this side. want tree to fall other way.\n\nme : tree does not work that way.\n\nGaak : yes it does.\n\nme : No. tree does not work that way. chop other side. \n\nGaak : No. me do my way.\n\nme : why you call me then? \n\nGaak : you make tree do what I want. \n\nI hit Gaak with club and walk away. ",
        "created_utc": 1467898339,
        "upvote_ratio": ""
    },
    {
        "title": "Caveman woman tell me \"No onga until meat\". She have meat.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4pm1lq/caveman_woman_tell_me_no_onga_until_meat_she_have/",
        "text": "Me Sok, Caveman woman = Caveman woman.\n\n\nMoon up, Caveman woman tell Sok, \"Sok. Me want meat.\" \n\n&gt;Youhavemeat.facerock\n\n\n \"You have meat.\" \n\n\"Me want other meat.\" Caveman woman say. Ughhh. \n\n\"Me want onga. Me want make little Sok, little caveman woman.\"\n\n\"No onga until meat!\" Caveman woman say. Ughhh. \n\nMe know! Me know Nok still sleep, me say \"Okay, me go hunt meat. New meat, we onga?\" me say. \n\n\"New meat, we onga till bunga!!\" \n\nMe go to Nok cave, Nok still sleep for two moon... He not in same spot. He is good. Nok ok.\n \nMe go to Nok meat, near skull rock cave painting. Me admire skull rock cave painting. \"Me do good job. Me do another good job now.\"\n\nMe take Nok meat, he no know it gone when he wake up next sun. \n\nMe go back to me cave with meat for Caveman woman, see caveman woman and say \"Got meat!\" \n\nChief know me have trouble with Caveman woman, bring berry juice.\n\nCaveman woman and me drink berry juice.\n\nWe onga until it bonga. Drink berry juice, happy berry juice this time. No no anger berry juice.  ",
        "created_utc": 1466761080,
        "upvote_ratio": ""
    },
    {
        "title": "Why Green plant not fire?",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4p0w89/why_green_plant_not_fire/",
        "text": "This happen last night.\n\nMe stop by Big Chief to trade bearskin for berry juice. \n\nBig Chief was trying to light pile of green plants and trees with torch. Fire not like green plant. \n\nrest of clan afraid to tell Big Chief that plant not ready to burn. \n\nI could have hit Chief on head, but me no want to be chief. \n\nMe took bearskins and left area while chief blames gods for not fire. ",
        "created_utc": 1466455524,
        "upvote_ratio": ""
    },
    {
        "title": "You add rock to what?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4oxsz0/you_add_rock_to_what/",
        "text": "Me Sok, Nok is Nok.\n\nNok come to me, say \"Why come rock add to things things no like rock?\"\n\n&gt;*Youfuckingrockm8?.jpg*\n\n\"Nok, what you add rock to?\" then Sok go to Nok cave.\n\nTake one look, know problem. \"Nok you no add rock fire, fire no like rock.\"\n\n\"But meat like fire!\" \n\nShow Nok how to make fire, no rock.\n\nNow Nok say \"Add rock cave painting, no cave painting.\"\n\n\"ROCK DOES WHAT? SHOW SOK!\" Now me ready hit Nok with dumdum stick.\n\nNok take cave painting, throw rock. Nok cry, say \"cave painting no like rock!!\" \n\nI make cave painting with Nok skull rock, Nok no move. Nok have air in out of body. Nok must sleep. Sok still no know what Nok want do with cave painting. Me need old berry juice, go see chief. ",
        "created_utc": 1466412771,
        "upvote_ratio": ""
    },
    {
        "title": "Where my rock?",
        "author": "eddpastafarian",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4olwcj/where_my_rock/",
        "text": "Me edd. Me minding own business, looking at cave paintings, pointy-haired Ogg say, edd, where my rock?\n\nMe say, look at pile of rocks, rock probably on top.\n\nPointy-haired Ogg say, too many rocks in cave, edd need to help.\n\nMe turn off fire in cave and walk to Ogg. Me ask, what rock called?\n\nOgg say, me no name rock, just throw in pile but now no see rock.\n\nMe sigh in head. Me point to rock pile and say, Ogg sure rocks on top no look like rock Ogg want?\n\nOgg say, no, those no-eat rock. Ogg want rock Ogg can eat.\n\nMe say, Ogg mean meat? Or Ogg mean fruit?\n\nOgg say, yes, rock.\n\nMe point to newest berry on closest pile of berries. This rock Ogg want?\n\nOgg say, yes! Me knew edd find rock! Now me can finish make stick sharp with rock.\n\nMe hit cave wall with face.\n\nToo many cave paintings, no read: Ogg think everything rock, need help find rock.",
        "created_utc": 1466204292,
        "upvote_ratio": ""
    },
    {
        "title": "Me Gok, Sok no nice",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4o07ph/me_gok_sok_no_nice/",
        "text": "Me Gok, Sok is Sok.\n\nMe want meat. Meat good fire, over fire good meat. Me think 'What bad for fire?' Me think 'Water!'\n\nMe try to be fire, get good meat no fire. \nGok head hurt. \n\nGok head hurt, Gok see Sok. Me say 'Gok head hurt.' Sok tell me to drink water. 'Water bad for fire!' Gok say. Sok hit Gok with rock, said 'Gok meet rock'. Gok wake up next moon still no fire good meat. \n\n",
        "created_utc": 1465887400,
        "upvote_ratio": ""
    },
    {
        "title": "Why rock no fire?",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4nwiir/why_rock_no_fire/",
        "text": "Me head hurt. \n\nWas out by caves when Chief yell at me to come to him. \n\nI finish my job, then plod over. \n\nChief is trying to get brown rock to catch fire. \n\nI smack chief then bring him black fire rock.  Set fire rock in fire and watch it burn.  Rock from river not burn!  Rock from river still too wet to burn?  Other black rock does not burn.  Must have right rock!\n\nChief say ok.  I go. at sundown Chief call me back. He trying to burn river rock again. \n\nI take his berry juice and leave.",
        "created_utc": 1465836417,
        "upvote_ratio": ""
    },
    {
        "title": "Gok no want water? Gok no want rock?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4nv0m8/gok_no_want_water_gok_no_want_rock/",
        "text": "Me Sok, Gok is Gok.\n\n\nGok come to me, ask 'what do Gok?' \n\n\nGok say 'sok we brother, me happy, you happy?' \n\n'Yes Gok me happy.'\n\n'Me no happy! Me feel no like Gok. Me feel like chief look drink old berry juice!'\n\nOh no, Gok, DumDum. 'Gok you drink water? Dizzy head like chief drink berry juice when no drink water.'\n\n\n'But water bad for fire! you fix Gok Head!' \n\nI fix Gok head. I fix it with rock. Rock, meet Gok.\n",
        "created_utc": 1465813557,
        "upvote_ratio": ""
    },
    {
        "title": "Move rock, see other rock.",
        "author": "Szeraax",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4ney8g/move_rock_see_other_rock/",
        "text": "Special: useful food smashing rock is normally here, but I don't see it. Please find rock\n\nMe: Its behind the bigger rock. Move bigger rock out of your way. \n\nSpecial: Unclear. Don't see useful food smashing rock. Please find rock!\n\nMe: *moves bigger rock* \n\nSpecial: smashing rock! How you do that??? Amazing!",
        "created_utc": 1465537627,
        "upvote_ratio": ""
    },
    {
        "title": "Clay Tablet of the Fools: Alep for Ox Head",
        "author": "Poligrizolph",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/4jn8p1/clay_tablet_of_the_fools_alep_for_ox_head/",
        "text": "Before, Taku think, why is scribe assistant give so much food, when danger eat by lion is for the hunter and gather person?\n\nNow Taku know: the danger is your skull bust from how the scribe does.\n\nTaku sleep in the night and was woken by a runner.\n\nThe runner say, Taku, Scribe want you, Scribe can not work in the night, Scribe has anger at you for being lazy and being of no worth.\n\nTaku say, Runner, go tell Scribe that Taku is come soon, once Taku is done eating and dressing.\n\nRunner say, Taku, Scribe say to come now or His goodness will come to house and eviscerate you like sacrificial swine you are.\n\nSo Taku come as fast as Taku can, not even putting on the ceremonial waters, not even doing morning cleansing. Taku has many shame for what Taku done.\n\nTaku come to Scribe hut. Scribe say, Taku, you mindless piece of excrement, you kill entire tribe, you be traitor for being such terrible kind of lowly worm.\n\nTaku say, what is wrong, Great Master, Destroyer of One Thousand Men.\n\nScribe say, worst, lowliest piece of dirt, look at what the terrible thing Taku do to clay stylus. Cannot make the words on the clay any more. Only smash clay, not make good line like before. Taku was one who put the stylus into ceremonial box. Taku was one who broke stylus. \n\nTaku look down at hand of Scribe. Taku no say for many time. Taku reach down, Taku take stylus from Scribe, and Taku put it back in Scribe hand with sharp end towards clay tablet.\n\nScribe say, O, horrible example of a piece of dog's spit, I know this, you waste my time. Scribe say, Go from this place and do not return until Taku called once more.\n\nTaku return home, drink fermented berry juice.\n\nStonebanger, much big-headed man, say that if mother drink too much fermented berry juice, can make baby dumb like baby drinked berry juice always.\n\nSometimes, Taku wonder if Scribe mother really like berry juice.",
        "created_utc": 1463431825,
        "upvote_ratio": ""
    },
    {
        "title": "The site for quick s...x Da TkI9Gseg",
        "author": "g76ac83nm92",
        "url": "http://3dministry.com/stBYEBoz8WBn",
        "text": "",
        "created_utc": 1458486373,
        "upvote_ratio": ""
    },
    {
        "title": "FIND SOMEONE TO FUCK TODAY. NEED FREE AND SIMPLE REGISTRATION. SEARCH MY LOGIN _LOGIN_ &gt;&gt; _LINK_ 8rBGyxAt",
        "author": "m89yq52ok36",
        "url": "http://7491155.com/n1uCdJkwx",
        "text": "",
        "created_utc": 1458315935,
        "upvote_ratio": ""
    },
    {
        "title": "I would highly recommend this site to friends and found it easy to use since it was the first and only dating site I have been on. Q1hKvQAg7q",
        "author": "mevenvosu1971",
        "url": "http://1stproductions.com/1VGYxUm70xsEVit1",
        "text": "",
        "created_utc": 1456947653,
        "upvote_ratio": ""
    },
    {
        "title": "A young charming lady with positive and ironic attitude to life,.. 4QzR3K",
        "author": "coaskinun",
        "url": "http://dreamtheteam.com/49820160226.php#NamdWrpH9c",
        "text": "",
        "created_utc": 1456703620,
        "upvote_ratio": ""
    },
    {
        "title": "Im alone here all night. You can make my night, sweety. 8hxIXrLx",
        "author": "geoustanporb",
        "url": "http://fantasynylons.com/31120160226.php#UYbFf85",
        "text": "",
        "created_utc": 1456696594,
        "upvote_ratio": ""
    },
    {
        "title": "I like to play with myself. You can see it here UhUwY3l",
        "author": "cracunal",
        "url": "http://think-forex-usa.com/19620160226.php#14HCAr",
        "text": "",
        "created_utc": 1456695331,
        "upvote_ratio": ""
    }
]