[
    {
        "title": "Some deliveries seem almost fake",
        "author": "emilymae24",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55gufv/some_deliveries_seem_almost_fake/",
        "text": "I deliver for my local Papas Pizza To Go (not papa johns) and so since we are such a small store we have a really small delivery range compared to what I'm used to, but this delivery will stay with me for awhile.\n\n\nIt's getting around 730-8 and the sun is starting to go down. I clock our for a delivery and get it put together and find the address. Normal delivery stuff we all do. I figured it would be a regular delivery to a road I hadn't been to yet.\n\n\n\nUntil I get to the road. And realize the address is way wrong. The address I'm looking for is a three digit, but every house on that road had 4 digit house numbers.\n\n\nFuck. Well, it's a dead end into a gravel lot so I sit there to try and call the lady to see if the number got typed in wrong. To find out that the number on my ticket is not the number for the lady I needed to reach.\n\n\nDouble fuck. Okay. I call my store to ask what I should do next, maybe see if it was a regular and just maybe someone goofed her information. As I'm on the phone with my manager, I notice an older Lady walking down the road towards my car. Whatever, nothing unusual. She might walk her neighborhood after the sun goes down and it cools off. I don't judge.\n\n\nWell as I'm being told to come back to the store, the lady is yelling at me \"the orders for me!!!\" So I get off the phone and start driving towards her to verify if it is or not. \n\n\nNow as a side note, my town renamed some roads a few years back because of 911 calls not having clear enough addresses to give the emergency personnel. I'm talking roads with 6 houses would be part of the main road but they wouldn't number the houses and you wouldn't know if you were even near the right place so they added more roads to the maps. Most of these are now \"blue signs\" instead of the green signs other roads use.\n\n\n\nThis lady is telling me all the details about the order and it turns out they gave my cook the wrong address, but they were on a side road off the road I was on. So we go to her house where her daughter is sitting on a toilet they had sitting on their porch and we exchange pizza for cash and I'm just chatting trying to figure out their information so I can fix it at the store so no one else gets confused if they have to deliver out there.\n\n\nHer name was right. I wrote down the correct address and then I asked for her phone number.\n\nCustomer: \"oh I ain't got a phone\"\n\nWait, what? No phone? How the hell do you call in an order without a phone? \n\n\nBy this point I just smile and tell them to have a great night and I left to go back to the store. They smelled so badly like cat piss I had to try not to gag when I walked away, and I was trying not to ask all the questions I had based on what happened. \n\n\n\nTo then find out later that they went to their neighbors house to order food, but didn't want us to have their neighbors number, so my cook put in a fake number for the order.\n\n\n\nGotta love working out in the country. \n\n\nTl;dr pretty sure drugs made a woman hungry, paranoid, and maybe even lost.",
        "created_utc": 1475382358,
        "upvote_ratio": ""
    },
    {
        "title": "Informing manager that I only want to work days. For school reasons.",
        "author": "BadDrvrsofSac",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55go95/informing_manager_that_i_only_want_to_work_days/",
        "text": "I'm thinking of going back to college and with the money from tips I get, I should be able to at least afford a few classes. Obviously no one wants to be stuck with part time. \n\nHow did you tell management about a change in your schedule? I'm thinking of giving them two weeks notice that I can only do day driving since My classes will be at night. (I also freaking hate the city addresses where I live at night because the addresses are so hard to read) But at least I  have a legit reason for switching. \n\nOnly I'm worried that scheduling won't work out. There's another coworker who has experienced the same problem with scheduling. Honestly, it would be a win win for me. Taking classes and hopefully not having to deliver at nights. \n\nOh and for the addresses, there's one neighborhood that's impossible to see addresses. It's not a bad neighborhood, but the ivy covering up mailboxes and street signs and addresses could be trimmed. \n\nTomorrow is my first rain delivery night. Any tips on how to keep the pizza dry in addition to the main question? ",
        "created_utc": 1475379115,
        "upvote_ratio": ""
    },
    {
        "title": "It's your favorite customer!!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55gi5s/its_your_favorite_customer/",
        "text": "[deleted]",
        "created_utc": 1475376199,
        "upvote_ratio": ""
    },
    {
        "title": "Adventures in the Pizza World",
        "author": "IllogicalMind",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55ev7o/adventures_in_the_pizza_world/",
        "text": "This didn’t exactly happen to me, but to a friend of mine. Nonetheless, it’s still a story to show how annoying and persistent some people can be.\n\nSo the pizza restaurant my friend works at has a little showcase with pizza that people can buy in slices instead of the whole thing.\n\nMy friend was taking requests at the counter when a man comes up to him and asks if my friend could give him the last slice of the showcased pizza. Obviously, my friend denied, as he can’t give free food and it’s probably against the shop’s policy and all that stuff, so the following conversation happened:\n\n“You should give me that slice, or else it’s going to waste!” begged the man.\n\n“Not really, no, our food is never wasted” answered (impatiently, I assume) my friend.\n\n“Yeah? So who’s gonna eat that pizza? No one is going to come now, c’mon, give me the slice so it doesn’t go waste!”\n\nAssuming this happened in a late night shift, indeed no one would come to buy the last slice from the showcase, however, my friend still had something to say.\n\n“Our shop usually gives the leftover food to an organization that feeds the homeless, so it will never go to waste.”\n\nThe man then gave up and bought the damn slice.\n\n \n\nKnowing how the restaurant works, workers are ocasionally allowed to take some leftover pizza home, anyway. I just don’t understand how some people can try so hard to get free food when they have the money for it.\n\nThis story was taken from [here](https://amorbidmind.wordpress.com/2016/10/01/morbid-adventures-3-tales-from-the-pizza-boy/)",
        "created_utc": 1475351748,
        "upvote_ratio": ""
    },
    {
        "title": "Checking credit cards",
        "author": "iftreescouldspeak",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55cjbx/checking_credit_cards/",
        "text": "So, at my store, there is a policy that we have to check the last 4 on the credit card to match to the receipt. I can get fired if management figured out I wasn't checking cards. We do this so people don't try to steal other people's food, especially in a college town. I get so much shit from it! I understand people are reluctant to show strangers their credit card, but I spend literally a second looking at the last four digits. Also sorry for protecting you from someone stealing your food and spending your money?! It really drives me crazy, and it affects my tips when they get super bothered by it. Sorry, this is just a rant. \n\nI do get some people who are super grateful that I do it and are really nice about it. But more anger than thankfulness. \n\n",
        "created_utc": 1475313889,
        "upvote_ratio": ""
    },
    {
        "title": "Flipped the script on the pharmacist.",
        "author": "HydrateLevel4",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55c1rp/flipped_the_script_on_the_pharmacist/",
        "text": "I delivered a large pizza tonight to a local Walgreen's with the instructions to bring the pizza to the pharmacy.\n\nWhen I got to the pharmacy and realized that the pharmacist himself was the one that I was delivering the pizza to I knew I had the perfect opportunity.\n\nAfter having him sign his credit card receipt I asked him:\n\n\"Do you need any counseling with your pizza?\"\n\nHe chuckled, but declined the offer for counseling.",
        "created_utc": 1475301496,
        "upvote_ratio": ""
    },
    {
        "title": "Car is a cop magnet while out on deliveries?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55bose/car_is_a_cop_magnet_while_out_on_deliveries/",
        "text": "[deleted]",
        "created_utc": 1475294270,
        "upvote_ratio": ""
    },
    {
        "title": "Local driver was ambushed and tazed by group of teenage girls just for the pizza. What is wrong with people?",
        "author": "Ihatejellybeans1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55blug/local_driver_was_ambushed_and_tazed_by_group_of/",
        "text": "",
        "created_utc": 1475292793,
        "upvote_ratio": ""
    },
    {
        "title": "Brakes don't work = call in?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55bks1/brakes_dont_work_call_in/",
        "text": "[deleted]",
        "created_utc": 1475292235,
        "upvote_ratio": ""
    },
    {
        "title": "The contrast of two separate school orders today.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55aybc/the_contrast_of_two_separate_school_orders_today/",
        "text": "[deleted]",
        "created_utc": 1475281865,
        "upvote_ratio": ""
    },
    {
        "title": "Ipads?",
        "author": "the_eluder",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5599d2/ipads/",
        "text": "So, my old clipboard was finally on it's last legs, so I bought a new one.  It's black acrylic, really shiny! Actually, it's sucks, the clip is hard to use and too wide for a CC receipt when centered, and it slides off my hot bag continually.  The cheap pressboard one actually works a lot better.\n\nAnyway, I had a delivery last night to a clothing retailer at the mall.  I walk in and one employee in particular seems really excited that I'm there.  She screams, \"Yeaaaaaa, you're my favorite person in the whole world today!\" etc.  She's also the one signing for the pizza.  \n\nShe walks up to me, and I start to hand her the clipboiard.  I have it upside down on my bag (so it slides less easily.)  She squeals in delight, \"We have iPads, too.\"  I then turn it over and say, \"Sorry it's just a clipboard.\"  All of her co-workers bust out laughing. She was clearly embarrassed, but stayed in good humor, still tipped well, so I felt kinda bad.  I'm sure she won't live this down at work for quite some time.",
        "created_utc": 1475259451,
        "upvote_ratio": ""
    },
    {
        "title": "Took an empty hot cell...",
        "author": "HewloTherexP",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/558io4/took_an_empty_hot_cell/",
        "text": "Hi /r/TalesFromThePizzaGuy!  \n  \nSo I recently became a, sort of, \"driver\" at Domino's. On one of my first deliveries, I took an empty hot cell instead of the one with food because I had the receipt in hand to try and find where to go. I got to the house, realized it was empty AS I was at the door. I promptly went to the store, got the right food (it was in the hot box), then returned to their house, and also grabbed him a free drink and a voucher for free drink and garlic bread for his next order.  \n  \nI got to his house, and he still tipped me. Maybe he felt bad because I was doing push bike deliveries in the rain, at night. Just for reference, this is in Australia, where tipping is not commonly done.",
        "created_utc": 1475250396,
        "upvote_ratio": ""
    },
    {
        "title": "Just started a new job, it's fucking awful. Need advice/coping techniques",
        "author": "Dent18",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/556wri/just_started_a_new_job_its_fucking_awful_need/",
        "text": "So I delivered pizza two summers ago, it was an amazing time. It was chill as fuck, you show up, take one order to a nice house in the suburbs with a number on the mailbox, park on the curb, ring the bell, hand them the pizza, see a cute dog or cat or girl, get cash for basically doing fuck all. \n\nNow I got a job delivering on my college campus, and it's hell on earth. Parking is a gigantic fucking pain, half the people are either broke or foreign so they don't tip [which is fucking outrageous; I'm a broke student just like them but I always tip because I'm not a jackass], delivering to dorms is fucking annoying cause you have to call them and ask them to come outside to meet [which is annoying as shit as a customer too], it's always busy so you're taking 2-3 orders at a time all the time and everything just blends into a monotonous grind. \n\nNone of the apartment complexes are laid out in any way that makes sense. [One motherfucker in a complex gave me the wrong building number, then didn't give a fuck when I told him it was wrong. 'oh it's actually XXXX' how the fuck did you even figure out how to breath] \n\nThere's less driving time as well cause the delivery area is small and so many orders are to dorms. This means there's less time to chill and listen to music, which was one of the best things about the job. \n\n\nI'm making more money [just because it's so busy] but I'd gladly make less to not be so fucking exhausted and dead inside",
        "created_utc": 1475222418,
        "upvote_ratio": ""
    },
    {
        "title": "Which one of you did this??",
        "author": "360joules",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/55672k/which_one_of_you_did_this/",
        "text": "https://i.reddituploads.com/88236596b32745289978beb5187ce4f2?fit=max&amp;h=1536&amp;w=1536&amp;s=ddd8c5e6d104afcae026bf9a4a622ac7",
        "created_utc": 1475208000,
        "upvote_ratio": ""
    },
    {
        "title": "Can I transfer to different location if current store doesn't do well in sales?",
        "author": "NewGuy41410",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/555g47/can_i_transfer_to_different_location_if_current/",
        "text": "I work at the biggest pizza chain in america as a delievery driver. I open 3 days a week and have 3 night shifts a week. Nights are **significantly** better as far as tips go. I dont want to work daytime anymore. I am the hardest working driver but i have the least lucrative shifts. I want to change my availability to night time only but i highly doubt ill still get 30 hours a week if i go night shifts only (because they just hired about 2 or 3 night drivers recently). Basically this is what i want to tell my manager:\n\n* ive been here a year and a half and can say sales has definitely fallen off a cliff recently and my tips have been severely affected in the daytime\n* its not worth my time to drive in the daytime anymore. i just want to drive at night\n* if i cant get a schedule im happy with can i transfer to a location thats known for generating a lot more sales? (is this a rude/disrespectful request?)\n* i would love to stay and drive daytimes so i can have night time to study or relax.. but the tips just simply arent enough for me to make it worth my time. \n\nif i wanted to go to a different location how would that work? i have friends that work in other locations same franchise. Can my current manager prevent me from being \"pulled\" to another location? Is that an asshole move? I want to be loyal to my current store but the tips just arent enough for me. And i dont think they are going to cut others' hours to accomodate mine just because im a great driver. I couldn't even bring myself to make that kind of request i dont want to negatively affect others quality of life.. any suggestions?",
        "created_utc": 1475196621,
        "upvote_ratio": ""
    },
    {
        "title": "Any other GMs or other upper management folks here?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/555eds/any_other_gms_or_other_upper_management_folks_here/",
        "text": "[deleted]",
        "created_utc": 1475195904,
        "upvote_ratio": ""
    },
    {
        "title": "My Scariest Delivery",
        "author": "thesnaytheist",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/553hkz/my_scariest_delivery/",
        "text": "This was a few years ago when I was still a driver. It honestly seemed like a scene out of a thriller movie. \n\nSo I had been delivering for this company a few years now and knew my way around town pretty well. I got a delivery to a street I'd never heard of but had a similar name to a main street and saw it was a street off of it. \n\nI'm driving to the area where the street is and my GPS is telling me to take a 90° right into one of my friends driveways. Her house is 90° to the left once I'm in the driveway. (Just to give you a \"view\") I'm sitting there for a little while trying to figure out where this street is as my friend walks outside to say hi. \n\nShe comes out and I ask her if she knew where this street was and she points down this dirt path that's connected to her driveway. Looked NOTHING like something you could drive down or even wanted to go down. It looked like an unfinished road leading into the woods. \n\nI start heading down the path and to my left there's this old rundown house that looks like the old summer restaurant in the Goonies. Except it's covered in old laundry and sheets and old kids toys strewn about the \"yard?\" I get out of my car and grab my bag and out of nowhere this crazy witch-like looking druggie woman is standing in the middle of the driveway with nothing but a ragged long tshirt on. Just staring and shaking itching her arm. Scared the shit out of me. \n\nI gave a friendly hello and said sorry it took long because I couldn't find the house. The only response I get is this blood-curdling screech of incoherent string of swears and telling me to hurry up. I start walking a bit faster and she full on SPRINTS at me screaming. She proceded to rip the bag out of my hand, take her food out of the bag, throw the bag and a crumpled $20 at me. She sprinted back into her house screeching and swearing like she had earlier. \n\nTold my manager everything that happened and they blacklisted the address. \n\nTLDR: crazy druggie witch in an old run down house sprints at me while screeching swears and rips everything out of my hands then sprints back into her shack. \n\nI asked my friend what that person's problem was and she told me the whole family's messed up. The son used to stand outside her window at night whispering her name when she was a little kid, him being much older. He ended up going to jail for something. ",
        "created_utc": 1475171979,
        "upvote_ratio": ""
    },
    {
        "title": "I got to give a stiff something they deserved",
        "author": "redout9122",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5536j4/i_got_to_give_a_stiff_something_they_deserved/",
        "text": "And I didn't even have to violate company policy to do it! That's what was so gratifying.\n\nWe have this customer who always stiffs drivers in the most irritating ways imaginable—poorly-trained dog always running loose, demanding exact change and screaming for it while the driver digs around in the bank for the exact change, living a few miles away from the store to begin with…trust me, if there's a mark for being a piss-off kind of stiff, they check it.\n\nYesterday, I was on the clock and my manager was busy, so I took a phone order. I recognized the address immediately when I pulled up the line on the computer system. Great, I thought. I'll probably even have to take it.\n\nShe gives me the order and then says “ALL I GOT'S A HUNDRA DOLLAH BILL.”\n\nJust my luck. After months of failing to convince my GM of the importance of this security policy, a new manager who just started about ten days ago had sold him on it. We FINALLY don't take change for $100 bills anymore. The total for the order was $21.21.\n\n“I'm sorry, ma'am, but our drivers only carry up to $20 in change.”\n\nShe turned away from the phone, not that it made her any harder to hear:\n\n“HONEY, THEY CAN ONLY CARRY LIKE FIFTEEN TWENTY DOLLURS.”\n\n“TELL HIM WE CAN'T CHANGE OUT THE MONEY!”\n\n“HEY ARE YOU STILL THERE? WE CAN'T CHANGE OUT THE MONEY.”\n\n“Well, I'm sorry, but it's company policy. I can't do anything about it.”\n\n“OKAY WELL CANCEL THE ORDER THEN. BAH.”\n\nNo pizza for you yesterday, asshole.",
        "created_utc": 1475168425,
        "upvote_ratio": ""
    },
    {
        "title": "My weirdest delivery",
        "author": "bobbyp869",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/552md6/my_weirdest_delivery/",
        "text": "Just discovered this reddit. I worked as a driver for a few summers during hs/college. I have had quite a few weird encounters, but this one is definitely the weirdest of all. So I take an order to this trailer park and knock on the door. A voice asks who it is and then tells me to come in. I'm not supposed to go into a residence but I didn't really care so I opened the door. When I open the door I immediately see a man and a woman sitting on a couch across the room, with like 3 lights that look like they're from a photoshoot, and 2 very odd looking cameras. I'm thinking to myself that I really just walked into a porno and they're going to ask me to be a part of it. I was not going to say yes but I was still going to get my money for the pizza. So, I walked over towards them and the dude says \"You just walked through a ghost\". They were just some damn ghosthunters thankfully.",
        "created_utc": 1475161824,
        "upvote_ratio": ""
    },
    {
        "title": "So stupid/annoying that it seems fake",
        "author": "Princess_Psycoz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/550ojf/so_stupidannoying_that_it_seems_fake/",
        "text": "God do I wish I had proof of this!\n\nSo we get an online order for a small pizza. No big deal, ticket says cash so I grab my wallet/bank and head out to the delivery that's like 3 blocks away. This order costs $16.01\n\nHere's an important note: drivers at our store only Carry $30 in change. We also get a flat delivery fee.\n\nI get there, ring the doorbell. He takes a moment but comes out and tries to give me a $100 bill. I tell him drivers only carry $30 in cash. He also has no way to get to the store. I call my manager. My manager tells me to give him the pizza, come back to the store, then return with the change.\n\nSo I give him the pizza and leave. I go get the exact change -$16.01 for his total. Bring it back, give him all his change. He walks inside with a \"took you long enough.\"\n\nNo tip. It was the most annoying thing I've had to deal with. I'm a newbie (only worked a month in delivery so far) so to you guys, this probably doesn't seem that bad. But it ticked me off for the rest of my shift. ",
        "created_utc": 1475125921,
        "upvote_ratio": ""
    },
    {
        "title": "That one guy who never tips and you dread it when the address pops up on the delivery screen plus other interesting things.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54z46g/that_one_guy_who_never_tips_and_you_dread_it_when/",
        "text": "[deleted]",
        "created_utc": 1475102570,
        "upvote_ratio": ""
    },
    {
        "title": "(x-post /r/TIFU) TIFU my first delivery.",
        "author": "thebumblinfool",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54yiyc/xpost_rtifu_tifu_my_first_delivery/",
        "text": "TIFU my first pizza delivery.\n\nSo, as usual, this did not happen today. It happened about 2 years ago when I was still in college and I had just gotten a job at Papa John's delivering pizza. \n\nFor a 19 year old in school it was perfect because it was easy, fun, and everyone there smoked weed like me. On my first day I come in, I clock in, and start getting to know everyone. Everything seems cool and finally my boss let's me know that it's time for my first delivery. I was excited but also really nervous because hey, it was my first delivery. They had 3 pizzas and a pepsi. \n\nSo I punch in the address and get on my way. Half way there I realize I forgot the pepsi so I call the customer, let them know, and go back and get it. Finally I get the pepsi and drive all the way back to the customers house. Here is where the real fuck up begins. I ring the doorbell, stumble over my words a few times, and then take out their pizza. I struggled with the bag because it was my first time and to my horror the third pizza box hangs on the bag, causing me to try and force it from the bag, slip, and fling the third pizza onto their porch, upside down, now ruined. I apologize profusely and they tell me it's ok. Despite my obvious stupidity and slowness, they are very patient with me, even going so far as to tell me not to worry about the fucked up pizza (They would've gotten one for free.)\n\nThen, I ask them to sign the receipt and I realize I have no pen. At this point I'm already shitting a brick because of how mortified I am but they're nice so they get me a pen. I can tell the customer is slowly losing his shit though. \n\nWhile I struggle to put aside my bag and get the receipt out the customer steps out and offers to hold my bag. When he stepped out his cat ran out the door, an indoor cat! I say \"I'll get it!\" and take off after the cat. Now the customer is standing there with my bag, the receipt, a fucked up pizza and his wife and daughter start freaking out because the cat got out. I chased the cat around their house while the owner is just getting more and more annoyed at me after being so nice. Finally he just goes inside, gets a flashlight, and just comes outside and tells me to leave while shaking his head. My boss asked me why I was so sweaty and I just told him that my A/C in my car was broken, not the fact that I just recreated a scene from a Seth Rogen movie and sprinted after a random persons cat like a maniac.\n\nTL;DR: Forgot pepsi, forgot pen, ruined a pizza, let a cat out, sweated profusely.\n\nhttps://www.reddit.com/r/tifu/comments/54x3z9/tifu_my_first_pizza_delivery/",
        "created_utc": 1475095413,
        "upvote_ratio": ""
    },
    {
        "title": "A Lovely Start to my Monday Morning",
        "author": "rroxannee",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54v9kg/a_lovely_start_to_my_monday_morning/",
        "text": "Wanted to post this because I'm sure you can all relate in one way or another. This was truly the most frustrating experience I've had with a customer thus far. (Now that I'm typing this all out I realize how long it is, my apologies!)\n\nThis past Monday I worked an opening shift (as I normally do) with one of my managers. Our store doesn't open until 10:00 AM but we normally don't start getting orders around ~11:30, depending on the day. So I'm doing my thing, prepping sauces and all that shit, when the phone rings. At this point it is 10:30 AM and nothing has ruined my day yet. \n\nI answer the phone and begin my normal routine, \"Thank you for choosing Domino's, this is rroxannee, how are you doing today?\" the customer says she's doing good and asks me how I'm doing. I ask for her name and phone number (something that my GM is REALLY STRICT ABOUT... we MUST GET THIS INFORMATION BEFORE ANYTHING according to him) and she gives me her address and nothing else, but at this point her name and phone number have popped up because she orders from us about once a week. This is also when I recognize the name, address, and her voice and it all clicks that I'm already not too fond of this woman because she almost pocketed my pen (I have a special alien-shaped pen specifically for deliveries) and was just overall an unpleasant customer. \n\nGoing off of her only giving me her address, I assume that she is going to be ordering for delivery, and that is what I ask her. \"This is going to be for delivery then, yes?\" she replies \"Well I sure hope so because my ankle is too swollen for me to leave my house or go to the bank for money. Can I pay with check?\" O....okay lady. I tell her I'll go ask my manager because I'm not sure and I make sure to tell her, I am putting the phone down, please give me one second, thank you. Of course this woman starts talking right as I say that and I quickly pick the phone back up and she's on about debit cards and cash and the bank and her ankle. I respond to her the best that I can, telling her that we accept card and cash and that if she needs to we can split the payment. She asks, \"why can't I just pay it all with my card?\" to which I reply, \"I'm sorry ma'am, I put the phone down when I told you I needed to ask my manager a question and I didn't quite catch all of what you were saying\" and now at this point she is laughing at me (and not in the way that says \"It's okay\" or \"I understand\"). \n\nWe get all of this figured out and eventually she starts ordering. She wants a large pepperoni pizza, sweet BBQ specialty chicken (which did not register in my head- I thought she said specialty pizza, and she got even more annoyed with me because of this), a caesar salad, a 2-liter of soda and 12 blue cheese cups (which, by the way, came up to about $6 considering our dipping sauces are $0.50 each). Total comes out to about $45 and I ask her how she wants to pay. Again, she starts going on about how she doesn't have cash because of her ankle and the bank and she can't drive and she NEEDS TO PAY WITH CARD- now she sounds frustrated and I'm not really understanding why other than the fact that I made a few mistakes while helping her?? I tell her okay, we can process the card payment here, I just need the card number, security code, expiration date, and postal code (as any POS system would get when you, you know, swipe your fucking card). She then says, \"Oh well that's just a lot of information to give over the phone. That's just too much of my information to give out. I'll send someone to pick it up.\" I proceed to ask her, \"Okay so just making sure ma'am, you are switching this order to carry-out and somebody will be by to pick it up?\" and no joke I watched the phone screen go from having her information and showing there was an active call to absolutely nothing right after I asked the question. This bitch heard me ask her a question and still hung up on me!!\n\nSo I get my manager, who at this point has already started making some of the food because it's been well over 15 minutes on the phone. I tell her, \"look, this lady is being difficult and just hung up on me despite me still talking to her. I don't want to piss her off anymore.\" and my manager agreed to call her. She calls twice with no answer whatsoever. Now we just give up on the order altogether and go on doing whatever we were previously doing. About 5 minutes later, I'm the only one up front and the phone rings. I pick up, greet her, give her my name and ask how she's doing. She replies, \"Hi rroxannee, I'm just calling because I tried to order earlier this morning and there was some confusion on your end, and I just wanted to cancel the order. We're going to Pizza Hut.\" \n\nI've never felt my time being wasted harder than I felt it in that moment. Seriously, what the fuck. Thanks for calling and canceling your order, I didn't want to bring it to you anyways, and I hope you're happy paying for over-priced low-quality pizza (sorry to anyone here who works for PH, just my opinion lol trust me I ordered strictly from there before I started working at Domino's!!) \n\nThank you all for reading, and once again I apologize for the length of this story. :))",
        "created_utc": 1475048485,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't really have a complaint\"",
        "author": "tenaciousTyrant",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54v79k/i_dont_really_have_a_complaint/",
        "text": "It was 12:15am, forty five minutes before close, when I answered the phone.\n\n\"Thank you for choosing Domino's, how may I help you?\"\n\n\"Yeah, uh, my driver just left because he forgot part of my order.\" The man had called and added to the order but no one had fixed the tags, so the driver left without some wings. No big deal, we were slow and the delivery was nearby.\n\n\"Yeah I'm sorry about that sir, he left the store about five minutes ago with it so he should be—\"\n\n\"Yeah I don't have a compliant, he just sounded a little mentally retarded on the phone.\"\n\nI didn't know what to say. What can you say to this? \"I'm sorry? What did you say?\"\n\n\"Yeah he just sounded a little stupid like he wasn't all there in the head.\"\n\n\"So you're calling me just to insult my driver?\"\n\nThe man went on for a bit before I interrupted him, told him his food should be there any moment and hung up.\n\nSome people, man.",
        "created_utc": 1475046963,
        "upvote_ratio": ""
    },
    {
        "title": "Really, this was an easy problem to fix...",
        "author": "Alamoa20",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54u48x/really_this_was_an_easy_problem_to_fix/",
        "text": "Not a delivery story, but hey delivery guys do everything, right?\n\nOne day, one of the counter boys at our place takes an order. A very special order for a special sandwich. A whole cheese steak with ground provolone cheese, no vegetables, add mayo, pepperoni and fries. Okay. Our boss is the chef and owner, so he takes the orders and makes them. He takes the slip and and raises an eye brow and swings his arms up in the air. He starts making it and I'm filling up the fridge. Boss is taking the sandwich to give it a few seconds in the oven and I notice the cheese is not ground....Hmm...I talk to the guy who took the order and he says \"Nah, it's fine\". I say okay, hey, I'm just delivering it. If I tell the boss about it after it's in the oven, someone's getting yelled at and I wasn't having none of that that day. Love my boss to death, but I just wasn't prepared to be called a dumbass, even if it was jokingly. You get called something too many times and you start to believe it, so anyway.\n\nHe wraps the sandwich and boom boom, I deliver it, they fill the credit card slip and I'm back. Phone rings. I take it.\n\n\"Hi, this is (address here), you guys delivered our order a few seconds ago?\"\n\n\"Yes, how may I help you?\"\n\n\"The cheese steak was completely wrong like like it was made for someone else, that was not my order at all\"\n\n\"Oh, well, I'm very sorry about that, can you tell me how you got the sandwich and how you wanted it?\"\n\n\"No, it was a very simple order, guys this is just ugh, he already ate it\"\n\n\"Well, I can have another sandwich made however you want at no extra charge and I'll get it to you in no time, is that alright?\"\n\n\"No...no, that's not alright\"\n\n\"Umm okay...well, how would you like me to solve this problem?\"\n\n*hangs up*\n\nJust.....why? This was such a simple problem, the simplest problem. A mismatch in orders, a misunderstanding, those are the simplest problems to solve for cripes sake, just why? I mean, there was no penis drawn on the bread for example, was there? That would've been very offensive and I'd understand being upset. It was just an order that was made wrongly. She doesn't even live that far from our place, so another sandwich would AT MOST take 4 minutes to deliver (Overall 10-15 minutes)\n\nCome on, how important does she must think her sandwich is? This was maybe the third or fourth time she ordered from us and as far as I know, we never got a complaint from her. So why? You would've gotten a free sandwich, my boss would've gladly made it, nothing would've happened, no one would need to be upset or anything....Why make it such a big deal?\n\nShe never ordered again and I felt like a pansy...",
        "created_utc": 1475027727,
        "upvote_ratio": ""
    },
    {
        "title": "Why are delivery people so petty?",
        "author": "__BUILDTHEWALL__",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54sfk6/why_are_delivery_people_so_petty/",
        "text": "[removed]",
        "created_utc": 1475005675,
        "upvote_ratio": ""
    },
    {
        "title": "Last night = never again",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54r8om/last_night_never_again/",
        "text": "[deleted]",
        "created_utc": 1474991827,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else get a bad dough ball and roll it into a schlong and put in in my zipper on my pants and go around the store asking people if it's cold in here or is it just me?",
        "author": "Mustard_Icecream",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54p6s3/does_anyone_else_get_a_bad_dough_ball_and_roll_it/",
        "text": "",
        "created_utc": 1474954974,
        "upvote_ratio": ""
    },
    {
        "title": "Frustrated by coworker that gets away with being lazy.",
        "author": "butterfly1763",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54p5j4/frustrated_by_coworker_that_gets_away_with_being/",
        "text": "Hey everyone. I've been at this job for 6 months now, and I've become one of the hardest workers at the store. I'm lucky to have a great set of coworkers who are almost all helpful and work hard.\n\nUnfortunately, we have one coworker who is constantly cutting corners (to put it lightly) and obviously doesn't give a shit about her job, but she gets away with it.\n\nNow, I'm going to sound like an asshole, but this needs mentioning - she is hearing-impaired. This is relevant because I honestly feel like she is abusing this to get away with being lazy.\n\nShe gets away with things nobody else ever would. A couple of examples:\n\n\n\nOne night, her job was to stock the soda cooler. She stocked SOME of the 2-liters, none of the 20oz. She also did not even attempt to rotate them, just shoved the new ones in front. I was like \"okay maybe we're out of them, whatev\" and moved on. 5 minutes later, I happen to be in the back of the store and of course, we're fully stocked.  I mention this to my manager, who informs her that she needs to finish the cooler.\n\nSo she stocks half of the 20oz. Again, without rotating. At this point I'm frustrated and finish the job myself because it won't get done otherwise. \n\nMy manager sees this and goes to have her sweep instead, to at least do SOMETHING useful. So of course, she takes a broom, and lightly brushes it against about half of the front lobby floor. No dustpan. No trash. Just lightly brushes the broom and puts it away, then sits down and starts texting.\n\n\n\nAnother time, it got slow and everyone started working on their side jobs for the day. Mine was done earlier, since I opened, and I was folding boxes. Coworker was sitting in the office texting. She looks around briefly, notices everyone working, and gets up to look at her job. Clean the bathrooms (one front, one back).\n\nShe grabs a paper towel and sanitizer and goes into the back bathroom. Returns 30 seconds later and sits back down. In what universe does that count as cleaning the bathroom?\n\n\n\nOn top of this, she is constantly nearly hitting people with her car (not paying attention), parked RIGHT next to me in an empty parking lot while I was trying to open my doors, and even sat in her car texting for over 5 minutes while checked out on a run she hadn't yet taken. She blocks the driver dispatch to look at her run while others are trying to check out, then she pushes you out of the way if you're there when she needs to check out.\n\nAnd, to add to it, she never has her hair up (it's an official part of uniform and her hair is down to her waist) and rarely puts on a car topper and never lights it (in our store, everyone is required to do both and gets reprimanded if you don't).\n\nIf it was anyone else, we'd have been chewed out repeatedly or fired, but she gets away with it, because, frankly, nobody wants to try and explain to her what she's doing wrong and/or they feel bad for her. \n\n\n\nI recognize that her condition is awful and probably makes her life very difficult, but frankly I don't think it's an excuse to constantly be lazy. I've tried talking to managers, but they don't seem willing to step up and force things because of her impairment.\n\n\n\nHas anyone else here ever had an employee be this lazy and get special treatment? Is there anything I can do besides just ignoring it and not letting it get to me? ",
        "created_utc": 1474954344,
        "upvote_ratio": ""
    },
    {
        "title": "Describe your most uncomfortable delivery?",
        "author": "DoeHare",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54o5n3/describe_your_most_uncomfortable_delivery/",
        "text": "I'm a Papa John's driver\n\nMy most fucked up experience was when this lady and her 5 young kids came in\n\nAside from all the chaos, this woman had \"Property of Eric (not the real name)\" all over her body. Head, hands, neck, face\n\nDelivery was some guy was yelling, and I mean just tearing his son apart. From what I got the kid threatened to shoot another kid (kid was in 2nd grade at the oldest)\n\nThe entire time this kids screaming his head off and so is his dad. He stopped talking to me for a minute because of this kid.\n\nGave me 3 bucks and apologized",
        "created_utc": 1474939688,
        "upvote_ratio": ""
    },
    {
        "title": "The Good Customer",
        "author": "Alamoa20",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54m81o/the_good_customer/",
        "text": "It's a question you'll find an answer to in about 3 months time\n\nYou'll set up your criteria and remember the faces\n\nA Good Customer is one who doesn't put an extra burden\n\nThey're not heavy bags, they're light feathers on a nest\n\nA Good Customer will kindly open the door all the way so you can promptly give them their food\n\nNot leave a small opening big enough to barely fit a terrier \n\nA Good Customer doesn't have to leave a nice tip, or even tip at all\n\nThis Good Customer simply takes their food and bids you a good day\n\nKnow why that's a Good Customer? \n\nBecause they didn't spend 15 minutes to get to the door.\n\nBecause they didn't just stand there and slowly search their purse for a few cents as you held to their 5 bags of food or their stack of pizzas\n\nBecause they didn't ask for those 5 cents in change on a $12.95 order when they gave you $13.00\n\nYou appreciate those Good Customers, no matter their numbers. No matter their tips. \n\nBless the Good Customer in all their colors. \n\nEspecially bless those who display their house numbers close to the light at night. Bless you, good folk.\n\nThat is all.",
        "created_utc": 1474916087,
        "upvote_ratio": ""
    },
    {
        "title": "Presidential debates tonight?",
        "author": "katrinaevening",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54lw56/presidential_debates_tonight/",
        "text": "Hey all!  I just started delivering last week...so I was wondering what to expect for tonight.  Do you think it will be busier because of the presidential debates tonight?\n\nEDIT:  It was CRAZY busy...but that's probably because the other driver called off, so I was the only one driving.  In 4 hours, I made the same amount in tips I would usually make in 8 hours.  Good night...good night.",
        "created_utc": 1474912340,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting last few weeks.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54izb3/interesting_last_few_weeks/",
        "text": "[deleted]",
        "created_utc": 1474864170,
        "upvote_ratio": ""
    },
    {
        "title": "So does PapaPriority actually do anything for the customer?",
        "author": "The_Rick_Sanchez",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54hzag/so_does_papapriority_actually_do_anything_for_the/",
        "text": "There's a papajohns 8min away from me. Every time I've ordered this month which is 2x a week, it takes between 1hr-1hr:30min for the delivery to arrive. My longest delivery time was 2hrs. So tonight I ordered with PapaPriority and it's been an hour. \n\n\nThis seems kinda gimmicky. Think I'll just give the extra money to the driver next time.     ",
        "created_utc": 1474849093,
        "upvote_ratio": ""
    },
    {
        "title": "Question about insurance.",
        "author": "hjwoolwine",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54h753/question_about_insurance/",
        "text": "I've been working for dominos pizza since December as a driver and I just got and packet in the mail saying that I'm eligible for the bronze level health insurance. I was just wondering if a anyone from this sub has any experience with it. Sorry if this breaks any rules or if this isn't the right place to ask this. Thanks in advance for any help or any information.",
        "created_utc": 1474838378,
        "upvote_ratio": ""
    },
    {
        "title": "Half and Half [Super Short]",
        "author": "Ethan_Glover",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54dyih/half_and_half_super_short/",
        "text": "Guy orders towards the end of the night. Wants a pizza that's half ham/pineapple, half sausage/mushroom. One pizza isn't enough for the minimum at his far away place. So he just doubles the order.\n\nTwo pizzas. Each half ham/pineapple, half sausage/mushroom.",
        "created_utc": 1474782693,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people do this?",
        "author": "AvarethTaika",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54dwnn/why_do_people_do_this/",
        "text": "Tonight I delivered to a rather odd fellow. He was acting a bit strange, stumbling over his words and seeming almost embarrassed, while giving me $24 on a $23.24 order saying that's 'all he could tip.' Dude, if you don't wanna tip me, that's fine, but don't beat around the bush about it. Just say you don't wanna tip me. Or don't mention it. Everyone knows if you can't afford to tip you shouldn't order delivery, and considering you were in a probably multi-million-dollar house in Beverly Hills, I think you can manage more than 74 cents. People confuse me...",
        "created_utc": 1474781488,
        "upvote_ratio": ""
    },
    {
        "title": "Nice one yesterday!",
        "author": "the_eluder",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54dp9g/nice_one_yesterday/",
        "text": "Order was 14.95.  Customer hands me 15.95.  I start to turn away, she looks at me and doesn't shut the door.  So I ask if she needs any change.  She replies, 'Yeath, a dollar.\"  Knowing what was coming, I had kept the change in my hand.  I quickly dumped the 95 cents back in her outstretched hand, reached into my pocket and grabbed another nickel, and placed it into her hand as well.  She groaned as I quickly dashed off without further comment.",
        "created_utc": 1474777155,
        "upvote_ratio": ""
    },
    {
        "title": "Was this lady just trolling us or was she dead serious? My manager and I aren't sure.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54algs/was_this_lady_just_trolling_us_or_was_she_dead/",
        "text": "[deleted]",
        "created_utc": 1474731261,
        "upvote_ratio": ""
    },
    {
        "title": "Not really a story, more worried about my job.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5483kx/not_really_a_story_more_worried_about_my_job/",
        "text": "[deleted]",
        "created_utc": 1474680561,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not a pizza delivery guy, but I delivered a pizza to the middle of the park anyway",
        "author": "justpat",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/547qe8/im_not_a_pizza_delivery_guy_but_i_delivered_a/",
        "text": "I entered Prospect Park Brooklyn through the Lincoln/Ocean entrance, on the east side. I was just at the public restrooms, when a kid came up to me. He looked about 13 years old, dressed in a pizza delivery boy's uniform, and he was holding a large pizza box in a thermal cover. Tomato aroma seeped out.\n\"Excuse?\" he said. \"I have to deliver pizza? But I don't know?\"\n\nIf you have ever walked down the street with me, you know that I have a large sign over my head reading \"Ask This Man. He Will Help You.\" For someone who isn't in the least famous, I have a lot of people stopping me on the street.\n\nI'm game. \"Where do you have to deliver it?\"\n\nHe held up the delivery slip, on the outside of the box. Where \"TO:\" was printed, someone scribbled \"Prospect Park\".\n\"Geez, I don't know,\" I said. \"It's a big park. Do you have a phone number?\"\n\nUnderneath the delivery slip was another piece of paper, with a 718 number scribbled on it. \"But my English no good,\" the kid said. \"You?\" He held out the paper, imploring me to call.\n\nThe 1970s left an indelible mark on all New Yorkers who lived through them. The city is safer now than it ever has been, nearly every type of crime is at rock bottom levels, yet I'm still on the look out for scams and cons. The question boiled down to: would cell phone thieves go through all the trouble of dressing up a kid in a pizza delivery uniform, putting a real pizza in a pizza box with a thermal cover, and writing up a fake delivery slip JUST to steal my piece-of-shit Taiwanese Android phone?\n\nProbably not. \"Ok,\" I said. \"What the hell.\" I dialed the number.\n\n\"HEGGGGLLLOW,\" an old-timey Brooklyn accent answered.\n\n\"Hello ma'am,\" I said in my best radio announcer's voice. \"Did you recently order a pizza?\"\n\n\"YHEEAGGH,\" she replied. \"WHEREIZZIT??\"\n\n\"We're having a little trouble with the address.\" The delivery boy was beaming at me. \"All we have is 'Prospect Park'\"\n\n\"YHEEAGGH,\" she replied. \"THASS RIGHT! PROSPECK PAWK!!\"\n\n\"Well, ma'am, it's a pretty big park. Can you tell us where --\"\n\n\"ARE YOU NEAR THE BEAHT'ROOMS AT THE LINCOLN ROAD EXIT?\"\n\nWhat the hell? How did she know that? I spun around, looking for the hidden camera.\n\n\"ALLS YOU GOTTA DO IS JUST WALK UP DA HILL. RIGHT THERE.\"\n\n\"Well, ma'am, there are several hills...\"\n\n\"WINDY HILL!!! DA ONE WIT DA PICK-A-NICK TABLES!\"\n\n'Windy Hill.' She clearly meant Breeze Hill, a long neglected knoll which was recently fitted with picnic tables. This woman really had ordered a pizza to be delivered to the middle of Prospect Park.\n\n\"I understand ma'am. My colleague and I will be there in a few minutes.\"\n\nBreeze Hill was on my way home, so I told the kid to follow me. We got to the summit and there was an elderly couple sitting at a \"pic-a-nic\" table, underneath a tree.\n\n\"WHAT TOOK YOU??\" the woman said.\n\n\"You really should use the exact street address when ordering a pizza in the middle of the park,\" I said.\n\n\"HOW'D I KNOW THE ADDRESS IN THE PARK?\"\n\n\"The streetlights. Each lamppost has a unique identifier that corresponds to the equivalent street address. That's how cops identify crime scenes.\"\n\n\"CRIME SCENES???\"\n\nI had hopelessly confused her. I had only one more thing to do. I pointed at the delivery boy. \"Anyway, he's the one who found you. He's the one who deserves a big tip.\"\n\nThe woman looked at me, then looked at the kid, then looked the pizza box, then looked at her husband.\n\n\"DANNY,\" she said, 'TIP THE KID\"",
        "created_utc": 1474674803,
        "upvote_ratio": ""
    },
    {
        "title": "There was so much blood...",
        "author": "Man_E_No",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/546mif/there_was_so_much_blood/",
        "text": "So I deliver to this apartment and there's no answer when I knock, wait a second I knock again no answer, I ring the doorbelll still nothing, went to my car where I keep my phone and called and she picks up and I asked if she was home and she goes \"well yeah I ordered food why wouldn't I be?\" and I'm like alright bitch no way you didnt hear me in your 1000sqft flat so I go back to the door and knock and she answers.  It's this old lady with an O2 tank and when I see people like this I usually ask if they need any help (of course I meant putting the pizza on the kitchen table or something) and she took it as an offer to do her fucking chores and she goes \"yes would you mind making my bed for me my new heart medication makes me dizzy when I bend over\" and because I'm a pushover I say yes. I go in and start helping her she gets a little rude because I didn't know exactly how she likes her bed made. So anyway as I'm doing this I notice a lot of red on the sheets and thought it was some odd pattern because it was a faint light red. She noticed that I was looking and THEN mentions that she woke up in a giant pool of her blood that was a result of her heart medication she started taking from a heart attack she had earlier that week. I finish as fast as I can, she tips me a fucking dollar and I go back to the Hut to wash my hands with bleach.\n\nTl;dr Lady asked me to help change her sheets, there a fuck ton of blood on them,  it was too late to stop helping, I got tipped $1.",
        "created_utc": 1474660448,
        "upvote_ratio": ""
    },
    {
        "title": "Slow day",
        "author": "Princess_Psycoz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/546g6q/slow_day/",
        "text": "Two so far. 4 hours into my 8hr shift. How do you handle slow days?",
        "created_utc": 1474658337,
        "upvote_ratio": ""
    },
    {
        "title": "One for the good guys: New Haven police: Pizza delivery man grabbed gun, shot robber",
        "author": "irodetheshortbus",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/54695y/one_for_the_good_guys_new_haven_police_pizza/",
        "text": "Not my tale but one you guys will enjoy: http://www.nhregister.com/general-news/20160921/new-haven-police-pizza-delivery-man-grabbed-gun-shot-robber",
        "created_utc": 1474656024,
        "upvote_ratio": ""
    },
    {
        "title": "Dumbest thing you've done on shift that didn't get you fired or nobody found out it was you.",
        "author": "NormanRB",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/545ph2/dumbest_thing_youve_done_on_shift_that_didnt_get/",
        "text": "Opening up one morning I was looking at the telephone controller unit on the wall (small computer device with cartridge attached). The cartridge looked similar to a game cartridge for the older consoles in the 80's and early 90's so I pulled it out to look at it. Nothing special about it so I put it back and went about my day. Hours went by and no phone calls, slow day I figured as most Tues and Weds usually were. It wasn't until the owner stopped around 1pm that she told me she had tried calling multiple times that morning. She checked and the phones were offline. Turns out that cartridge was the program for the phones and their multiple lines. Ooops! She figured it was just a computer thing and never asked if it was something that I had done. After a call to the phone company, it was back up within 20 minutes (a reboot of the system including a test).\n\nLive and learn...\n\n\nAnybody else have a good story to share?",
        "created_utc": 1474649724,
        "upvote_ratio": ""
    },
    {
        "title": "Any good party stories??",
        "author": "NormanRB",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/545lyn/any_good_party_stories/",
        "text": "Former pizza guy here. I recall when I worked delivery one night filling in for an absent driver (day shift manager here), I was called on a Friday night to deliver three large pepperoni pizzas. I could barely hear the order over the background noise. Sure enough I show up to deliver and it's a house party with lots of drinking. I became the instant celebrity as I had the munchies on hand and had money thrown at me from everyone (I ended up with nearly $20 in tip for a total of $30 of pizza). I also was handed two beers which I later split with the store manager after closing before returning to the party when I got off with another pizza in hand. It was a good night to say the least and I'll leave out the details of my second arrival ;)",
        "created_utc": 1474648593,
        "upvote_ratio": ""
    },
    {
        "title": "Calling before we open?",
        "author": "Princess_Psycoz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/545edb/calling_before_we_open/",
        "text": "We don't open at my store before 11. We get calls all the time can I order {insert order} to be delivered at 10:30. It's like ???? Even as regular customers do this. We. Do. Not. Open. Til. 11. Do. Not. Ask.\n\nI as the only day delivery driver don't get there till 5 to 11 so no you can't.",
        "created_utc": 1474646203,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone here thought or tried to unionize?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/543ps6/has_anyone_here_thought_or_tried_to_unionize/",
        "text": "[deleted]",
        "created_utc": 1474618322,
        "upvote_ratio": ""
    },
    {
        "title": "Stupid customer, worse DO",
        "author": "Tr2v",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/543fbh/stupid_customer_worse_do/",
        "text": "So the other day I had a delivery to one of my regulars. He lives about 15 minutes from the store so it's annoying how often he orders, but he always tips $4 so I give him extras when I can. This time, I get to the door and hand him the CC slip. He says he was supposed to have a $15 credit and hands it back to me unsigned. Ok, dumbfuck, I obviously don't have a POS in my car to modify your CC payment and print a new slip so what do you want me to do? Also, you should have called the store immediately upon seeing the \"wrong\" total in your confirmation. Fucking stupid, but I digress. Since he's always been decent, I said I'd take care of it, handed over the food, and said bye. He told me to have a manager call him. Sure, no problem. I get back to the store, void his CC (thus giving him well over the $15 he was supposed to have), and call to give him an update. I get voicemail and I'm pretty sure it didn't say his name, but whatever, left a message saying I voided the card and the order was thusly free and then I went on with my day. \n\nFast forward a few days and there's an email from the DO in the store inbox. She forwarded a guest review from the guy in which he said that he didn't get his credit, he asked me to have a manager call him and I failed to do so, and his shit is always late. The icing? All she wrote is \"Why is it so hard to take care of guests?\" Good thing this cunt wasn't at the store or I don't know if I could have held back from slapping her. So not only is the customer an idiot for not calling when the total was wrong in the first place and then thinking I could magically fix it at the door, but also he's an idiot for giving us a bad phone number yet wanting a callback. How the fuck can we call you if the number is wrong?! And maybe look at your fucking bank online to see that you weren't charged a penny? How hard would that be? And then on top of it, the DO assuming we just fucked everything up rather than taking care of him. \n\nI just can't anymore. This company is such shit. These customers are fucking trash. I've only been in the gig for 18 months and I'm about to be on my 5th GM, at least 8 SAMs and I must be forgetting someone, and countless staffers. When will corporate realize that turnover is so high because they promote ineffective and stupid people rather than people that can handle and deserve promotions? When will they learn that the customer is not always right; the customer is usually wrong and always an idiot. I know they'll never learn and I can't wait to watch this company burn. 3 stores have closed in the last few months... more to come when this is the shit they created. \n\nIs it this bad in your franchises?",
        "created_utc": 1474611744,
        "upvote_ratio": ""
    },
    {
        "title": "Got stiffed",
        "author": "Princess_Psycoz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5413dr/got_stiffed/",
        "text": "I've gotten stiffed 3 times today. I have 2-3 hours left in my shift and I've never had this happen. 3/8 were stiffs. Fuck them. Edit. A word.\n\n\n\n\n\n\n\nEd",
        "created_utc": 1474576812,
        "upvote_ratio": ""
    },
    {
        "title": "Customer complained because I didn't take her tip.",
        "author": "buku43v3r",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53xnbo/customer_complained_because_i_didnt_take_her_tip/",
        "text": "Delivered to a house tonite and after 4 door bell rings and 4 loud knocks no answer.\nPull out phone and try to call and it goes straight to voicemail so I take it back to the store and magically their phone isn't turned off when my manager tries calling.\n\nHe sends me back and it's middle rush so I'm pissed I'm wasting time.  Total was 15.64 and she hands me a 20 and told me it's mine.  I pull out a 5 place it on her pizza box and say no thanks and go to my car and leave.\n\nShe called and complained saying I was rude.  Ended up getting sent home.  My manager still thinks I didn't do everything I could've done on my first trip.  Why can't managers ever put the responsibility on shitty customers?",
        "created_utc": 1474524488,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a pizza girl..... and staring at my tits isn't okay.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53xjft/im_a_pizza_girl_and_staring_at_my_tits_isnt_okay/",
        "text": "[deleted]",
        "created_utc": 1474522292,
        "upvote_ratio": ""
    },
    {
        "title": "Free Food",
        "author": "darkxrick",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53x1rk/free_food/",
        "text": "I've delivered thousands of dollars worth of free food in my days as a pizza slinger, and honestly I don't really care about our store losing money. What bugs me is when the blame gets placed on me for no reason! It doesn't matter if it's a mistake in the kitchen, or an influx of orders, or straight up lying customers, the blame always lands on the driver.\n\nA dude called and complained that I didn't give him his can of soda while I was still on the road. The part that pissed me off was I know, absolutely, without a doubt, that can was in the bag I handed to him. I was carrying his bag in my hand by literally holding the can of soda through the bag! I even bagged it myself!!! So then I had to double back, stop at a gas station, buy a soda with my own money, and bring it to him. And of course my manager was up in arms about it. But am I believed when I say I know he's scamming us? Of course not!",
        "created_utc": 1474513835,
        "upvote_ratio": ""
    },
    {
        "title": "When I think of delivering pizza I get nervous. A sort of anxiety that comes from going to a stranger's house. It's almost Halloween... Would you please share some spooky scary stories?",
        "author": "real-dreamer",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53wsbo/when_i_think_of_delivering_pizza_i_get_nervous_a/",
        "text": "",
        "created_utc": 1474510095,
        "upvote_ratio": ""
    },
    {
        "title": "How do you handle partial stiffs?",
        "author": "PolaroidsOfPenguins",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53txes/how_do_you_handle_partial_stiffs/",
        "text": "So we have a few houses that order every week and will let you \"keep the change\". Say their order comes to $18.84; they will ask for $1 back and I can keep the change. \n\nLast night one particular house had a free pizza, so they only had to pay the $2.79 delivery fee. I was fed up with it and grabbed 21¢ from my console to prepare myself for a stiff.  The customer answered and paid me $3 and told me to keep the change. I politely said no thank you and handed her two dimes and a penny and left. \n\nVery satisfying.",
        "created_utc": 1474474407,
        "upvote_ratio": ""
    },
    {
        "title": "\"Interesting\" customers",
        "author": "Jaitzche",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53rqwu/interesting_customers/",
        "text": "I've had some... interesting characters I've delivered to. To half naked guys (no girls though, though I do know others that have gotten them), to creeps, to people screaming at their children/animals as they pay for the order. One of the stranger ones though- Guy calls up, asks if we can swing by his to pick up money, then take the pizza to his girlfriends. He'll leave a good tip for the driver, too! Manager decides, why not. I get the delivery. I get to the guys house, he's waiting outside. Before I can even get out of the car, the guy is at my window. He's maybe 40 and hasn't aged well. He's balding and wearing a nasty tank top. Honestly looks like a stereotypical redneck. He's got a brown paper sack in his hands. He shoves it my face telling me to check it. There's a pack of cigarettes inside. He takes them out and opens it, I stand corrected, it's half a pack.\n\nI tell him, \"I don't know what to do with this. I can't take it.\"\n\nHe then pulls a wad of cash out from somewhere, about 7 dollars over the total amount and gives it to me. Then I'm on my merry way to the bad part of town. Got a bit nervous but arrive at a mildly run down house with three women sitting outside. The other two motion for me to give it to the lady sitting on the porch, an older, surprisingly very well put together woman. Like, complete opposite of the man before.\n\nLove is love, I guess?\n\nBut that guy, he just threw me off.\n\nBonus: I delivered to a house in a well-to-do part of town. Regular customer. Probably the 5th or 6th time I delivered there. Lady and her son (probably 10?) answer the door, and the son takes the food as the mom signs. The receipt has a 4 dollar pre-tip on it. I start walking away, halfway down the driveway, when I hear the kid speaking up behind me. Turn around and he hands me a bill, and goes on his way. I'm thinking, oh! another dollar. Five dollar tip, nice! Get in the car and it's a 10. I've no idea why the kid gave it to me, but I wasn't complaining.",
        "created_utc": 1474436583,
        "upvote_ratio": ""
    },
    {
        "title": "PSAs for the consumers on the sub: Get some fucking house numbers.",
        "author": "rednoise",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53qvyf/psas_for_the_consumers_on_the_sub_get_some/",
        "text": "The only houses I deliver to that have visible house numbers are the extremely rich ones with new lights that spotlight the house number. That's a little overboard, but, fuck man, everyone else I deliver to either has *no* house numbers or they seem to obscure the damn things.\n\nI can count up the street to the house, but that'll just make your food colder or just not come at all, especially if the street has a weird number configuration and Google Maps isn't getting it right. We're told to turn back to the store if you can't find the house in 5 minutes. It's in your best interest, and mine, to just spend 10 minutes hopping down to Home Depot or Lowe's and getting some sticky numbers and putting them on your goddamned mailbox. That would be okay.\n\nPlease and thank you.",
        "created_utc": 1474422517,
        "upvote_ratio": ""
    },
    {
        "title": "Security dash cam?",
        "author": "toastedfingies",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53o6lj/security_dash_cam/",
        "text": "I'm going to start doing deliveries for a very popular chain in my town, and I'm wondering if I should get a dash cam to record what goes on in case I get robbed/mugged/whathaveyou. My town is pretty popular for all sorts of drugs and nasty people who love pizza, and being a rather petite girl with a nice-ish car, I think it would be a good idea. I don't know the first thing about dashcams however so if any drivers do this let me know if it has helped you and what camera you use. ",
        "created_utc": 1474388653,
        "upvote_ratio": ""
    },
    {
        "title": "A Sandwich Savior in the Hot Night",
        "author": "RasterTragedy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53mbai/a_sandwich_savior_in_the_hot_night/",
        "text": "I had a bit of romaticization about my job, nobly delivering food to hungry people just trying to make it in this crazy world. Helped me bike a little faster, psyched me up to come in. Something to tell myself when I was feeling a little low. Come hell or high water, I will get you your sandwich.\n\nDespite this, I always hated answering the phone. I swear our phones were made of bees. But there's no use trying to not pick up the phone, so I grabbed the receiver before it reached that dreaded third ring.\n\n\"Hello! Speedy Sandwiches! What can I do ya for?\"\n\nThe voice on the other end trembled. \"Are you still delivering?\" She was hard to hear over the bees partying on the line.\n\n\"We sure are!\" I had already mastered the Customer Service Cheer, even in the face of the sweltering night.\n\n\"Oh thank God! You're a lifesaver!\" *Yes*. This was what being a delivery driver was all about! Saving the day with alacritous food! I am a *god*.\n\n\"To where am I delivering?\"\n\nI check her address. She's outside our delivery radius. Hella outside our delivery radius. The shop that would deliver to her is closed.\n\n\"Oh...\" I could hear the tears in her voice. \"That's ok...\" She hung up and tore a piece out of my heart.",
        "created_utc": 1474357469,
        "upvote_ratio": ""
    },
    {
        "title": "Short story from my first night shift",
        "author": "StrangeDise",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53mabx/short_story_from_my_first_night_shift/",
        "text": "There was this college kid who ordered online for pickup, but then changed it to delivery. For whatever reason the number on the ticket was his mom's number, so I called it when I got there around 230am just to find out it was his mom and she lives in Alaska.",
        "created_utc": 1474356859,
        "upvote_ratio": ""
    },
    {
        "title": "I Don't Answer Private Calls",
        "author": "Tr2v",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53m3o1/i_dont_answer_private_calls/",
        "text": "Today sucked. No cook and a manager that's too elderly for the pizza business. Luckily it was pretty slow so I was able to make all of my own orders, do some dishes while they cooked, cut them, and deliver them all within the allotted time. Until I get to this idiot. It's to a business pretty close to the store with a \"cafe\" in front and the manufacturing area in back. The girl that took the order is another driver (who was serving buffet instead of driving) so I know the info will be good: shipping. Ok - I know that means it's in back. I see a door on either side of the shipping docks - one that looks like a general entry for the warehouse staff and one that is next to a garage door. I try that one first and pound on it. Nothing. I pull around to the other door, which is near a break area so I ask the guy outside if that's the door for shipping or if he knows the customer. He's useless so I try the door anyway. I'm immediately confronted by 2 people, a white guy telling me to come in and someone will help me find the customer and a black lady basically telling me to fuck off and this isn't shipping. I follow the white guy and he leads me to another guy that doesn't know the customer, but he says to try the door I already tried. Black lady looks at me and says \"fucking told ya\". Bitch if I thought you had the answer, I would have accepted it. So I'm screwed. No one knows the customer and this place is not large by any means. I'd imagine everyone knows everyone. No one has heard of this dude. \n\nI've already wasted 8 or so minutes and I should be back making my next order already, but let me try calling. No answer. I call repeatedly a few more times since maybe they didn't hear the first time, but I don't have time to wait between calls so I'm going to annoy you until you pick up. 2 calls in, I leave a message. I wait a minute so he has time to listen to my short message, and start calling again. 3 more calls and he answers, says \"I don't answer private calls\", and hangs up. You just did, dumbass, and you fucking ordered food so... I call 2 more times before saying fuck it and leaving. \n\nI get back to the store and he's on the phone asking where his food is. At this point, I grabbed the phone from grandpa manager, and laid into the guy. He starts bitching about how I shouldn't block my number. I explain to him that it's MY phone and I will do what I want and don't need random people all over town having it, will not be coming back, but he's welcome to come pick his shit up at the store since I did more than enough to try to get the food to him. He hangs up on me. Whatever, I'm going start on my next order, which is nearly late since I had to waste so much time on this fucker. \n\nHe calls again and talks to the manager only. Manager says the same thing I did so he hangs up again. A few minutes later, phone rings and I answer. Now he wants manager's name. I'm not going to give that out, but I'll give the phone to manager so he can make that call on his own. He gleefully gives him his name and spells it for him, dude hangs up again.\n\nThis is just a rant, but if you've made it this far, you've either known this pain or are a customer that wouldn't be so stupid. \n\nOh, and don't tell me to get a separate number through Google Voice. I use that for my business line and can only have 1 associated to my cell number so that won't work.\n\nUgh just needed to complain. Fuck that guy. I'll never get that 45 minutes back, but he'll never get food from us. ",
        "created_utc": 1474352828,
        "upvote_ratio": ""
    },
    {
        "title": "Ha ha ha....",
        "author": "AcidBathVampire",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53m04p/ha_ha_ha/",
        "text": "So my MIT didn't show tonight and we had one driver on until close (9-12) and we get an order (online, of course!) at 11:50. My driver is out on a triple, which I was really hoping would be the last orders of the night. Nope, an order to a hotel at the very edge of our delivery radius (again, of course!) I call my driver and tell him I'm going on this run since we're closed anyway and he's cool as a fool with that. I get there, and normally, they call the person to come down. But not when the food is for three ladies of the night (two of whom I suspect were trannies!) Oh no, then you need an escort (no pun intended) to go up and see them. I'm walking back with my chaperone and I ask him, \"so, what's your cut to let these girls do business?\" His answer? \"You know your way out, right?\" I swear to Christmas, the amount of sleaze in my town is ridiculous. ",
        "created_utc": 1474350885,
        "upvote_ratio": ""
    },
    {
        "title": "Parents letting their children order",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53l4dv/parents_letting_their_children_order/",
        "text": "[deleted]",
        "created_utc": 1474336455,
        "upvote_ratio": ""
    },
    {
        "title": "That Deaf, Dumb, and Blind Kid.",
        "author": "FabulousFaceRape",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53kvvz/that_deaf_dumb_and_blind_kid/",
        "text": "It was a Saturday night, about 8:45 pm and we close at 9:00, and my boss tells me, \"Face Rape, you have one more delivery!\". Our radias is mostly large, gated communities scattered around four large streets in Florida. The town I work in has a lot of white trash, a lot of drug traffic, and a lot of gang violence, but certain parts of the town have these morbidly wealthy string of communities. Being in Florida, I know that pretty much narrows it down to...every town in Florida. I'm lucky enough to deliver exclusively in one of the nice parts of town though. I say lucky, but not really because there's no way I'd do it in the shit parts of town. Regardless, I still get a little sketched out from time to time on deliveries. This happened a couple weeks ago, and \"sketched out\" is an understatement. \nAnyway, there are two locations in our delivery radias that are basically large collections of businesses; the kind where there's like 10-15 suites in the building (and every time I go to these places either the suite number or the business name isn't visible, and the missing one is always the only piece of information I have. Just thought fellow drivers would understand that plight). So this delivery is in one of these buildings, and remember, it's ~8:45 pm, so it's kind of weird to me that there's a delivery going out to one of these office buildings, as most of these businesses' days end at 5:00. I just figured some guys were staying late working on see shit, and just wanted some pizza, so I thought nothing of it...Until I read the delivery instructions. \"There's no sign. Just find the orange traffic cone in front of an open door, go up the staircase and open the door on the right to find us.\" .....ooookay?\nI get there with the three extra large pizzas, and its' pitch fucking black outside. no street lights, no lit windows, no other cars, just a bright white light coming out of a door with an orange traffic cone next to it. \nOkay, cool. I go up to it, and the door leads to a stair case. Not just any stair case though: a narrow, paint-peeling-off-the-walls, concrete staircase with a wall full of bulletin boards on either side, covered in random, visibly very old, flyers for random events and stuff for sale.\nNow, maybe I have a filthy, gutter mind, but my first thought was \"Okay, this is definitely a fucking Craigslist orgy. I'm delivering to a fucking internet orgy.\" I could see the Craigslist Post in my mind. \"Find the address, look for the orange traffic cone, walk up the stairs, put on your mask, and open the door. $5 cover charge. We will supply pizza. Do what you will to the the delivery boy.\"\nIt was about that time someone came out of the door. The door was to the right, like I said, so I couldn't see inside. The guy that came out was tall, lanky as fuck, and had this 1000 yard stare in his eyes. His beard was untrimmed, and went down to his stomach, and his hair was just as messy and long. he had a dirty black t shirt on with holes in it, dirty blue jeans, and work boots on. He says \"hey how ya doin brotha\" and I nod and say \"Good, how are you.\" \"good!\" and he walks away as I start up the stairs. At this point, there was no doubt in my mind, this was a fucking orgy and I was going to get raped. I take a deep breath and open the door.\n\n\nI shit you not, there had to be 100 pinball machines and at least 120 weird, nerdy looking people. Fucking pinball machines. As far as the eye can see. This room was also waaaayyyyy too small for 100 pinball machines. More of a 60 pinball machine kind of room. I also couldn't hear myself say hi to the guy who ordered the pizzas over the constant, deafening DING DING DING DIDING DIING DING DIIING DING DING DIING DIIIING DIIDDIDIDNG from all the machines. He was super friendly, tipped me very well, and explained to me that this was a huge pinball tournament, and apparently people fly from all over the fucking world to compete. He hands me a flyer for a charity he is involved in. It raises funds to put pinball machines into children's hospitals, and also puts donators into a drawing to win one of their own. I say thanks, smile, and tell him to have a great night, and he says the same. I get back into my car and laugh harder than I have in years, and drive back to close up the shop.\n\nThat was the strangest delivery I have ever been on. Thanks for listening, and sorry I didn't get raped, I know that would have made for a better story.",
        "created_utc": 1474333155,
        "upvote_ratio": ""
    },
    {
        "title": "I don't know where to post this, but it can help.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53j3ce/i_dont_know_where_to_post_this_but_it_can_help/",
        "text": "[deleted]",
        "created_utc": 1474310639,
        "upvote_ratio": ""
    },
    {
        "title": "Put It In Park! (A visit from the police.)",
        "author": "Ethan_Glover",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53gft4/put_it_in_park_a_visit_from_the_police/",
        "text": "We get the order, and when it's almost done the cook realizes we're out of onion rings. (It's late at night at the end of a busy weekend, it happens.) So they try to call up the customer to figure out what they want to do, but get no answer. After a few tries, they finally get a call back and it's decided they don't want any replacements for the onion rings, and I'll be giving them $6 in cash when they sign the CC receipt.\n\nI pull up to the house, start to get out of my car, and it starts to roll forward. &gt;.&gt; I rush to hit the brakes, but not in time and hits the wall of the house right under the window where five people are sitting. ...Dammit, this is embarrassing, but it wasn't much distance so there's no chance for damage.\n\nMy goal is now to apologize, make the delivery, and move on. I go to the front door without realizing those five people had walked out a back/side door. I walk back and they're looking at the car, one guy is pissed. \"WHAT THE HELL ARE YOU DOING?\" \"I slipped on the gear, I'm sorry.\" (I stupidly flipped up my gear shift into neutral without going to park and was half-way out the car door by the time my hand had left it, I was moving too fast.)\n\nThis guy isn't hearing it, he's yelling at me in a fury. Someone else walks up to me and grabs the CC receipt. It seems he's trying to get this over with as much as I am. (He was actually smiling half the time.) In the meantime, the angry guy is yelling to everyone, \"What's the number to the restaurant?!\" His wife yells back at him, \"I can't believe you can't remember a simple phone number!\" (I'm beginning to realize what kind of people I'm dealing with.) I tell him the number but he refuses to get it from me, so the guy that's signing the receipt tells him. I hand off the food and head back.\n\nBack at the restaurant I find that they had told the server who answered the phone that my car was dented up (no damage at all), and they had a crack in the foundation of their house (I never saw any, and the restaurant owner went to take a close look and saw nothing). The guy claimed to be a contractor. (He trims trees.) To add on top of that, they are now demanding three large fries. ...I don't know why three large fries.\n\nI take six orders to the local college (four of them were a group on separate orders). While there I get a text that the police had shown up over the situation. So I head back, park next to the police cruiser and head inside.\n\nI tell an officer everything that happened and offer to send over dashcam footage. My dashcam records four video feeds in 360 degrees and records audio inside the car. My window was down so you can hear some audio outside.\n\nReviewing the video, the whole situation was really unexciting, eventless, and boring. It didn't warrant the response it got. Just me looking like a nimrod scrambling (and failing) to hit the brakes before I hit a wall.",
        "created_utc": 1474269144,
        "upvote_ratio": ""
    },
    {
        "title": "Coupons",
        "author": "Camalam12107",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53f3gn/coupons/",
        "text": "As one gets to the apartment the customer takes out the coupons and still thinks I can magically lower the price, no sir, no. Smart people tell places they have coupons when ordering ",
        "created_utc": 1474245809,
        "upvote_ratio": ""
    },
    {
        "title": "\"Don't call me easy!\"",
        "author": "darkxrick",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53c0vu/dont_call_me_easy/",
        "text": "It's 3:20 am on a Saturday shift (technically now Sunday)\nI'm tired as hell and on my last run of the night, pull up to a hotel, hop out of the car, and start walking towards the building.\n\nI noticed 3 middle aged (or at least older than me..) people smoking cigs and acting drunk as fuck. One of them shouts out \"EYY BIZZA GUY\"\n\nI walk up and ask \"oh did you order from us?\"\nOne guy recites their order, his name, and their total.\n\"Well awesome, you guys were easy to find, thanks for that.\"\n\nHe stares at me.\n\n\"DONT CALL ME EASY HUEHUEHUEHUE\"\n\nI giggle politely, trying to hurry the process, and a woman who I have yet to notice is sprawled, spread eagle on the ground shouts to me:\n\n\"IIIII'M EASYYY\" ;D\n\nI turned to the guy and whispered \"yeah, we know.\"\n\n$7 tip! Woo!",
        "created_utc": 1474203168,
        "upvote_ratio": ""
    },
    {
        "title": "\"You HAVE to give me free pizza\"",
        "author": "littlebirdadri",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53bmqh/you_have_to_give_me_free_pizza/",
        "text": "This got long, but i needed to vent. I know I could have handled this better, but this is literally week 3 of my promotion, and I felt like a deer in the headlights from how rude this lady was from the get go. \n\nRecently, I was promoted to shift leader. More recently, I had my first encounter with a difficult customer. We were very busy, and a customer placed their order right before I bumped the delivery time up. Phone rings, it's customer. Their order is about 20 minutes late, however the driver had been dispatched about 30 minutes prior. C=customer M=me\n\nC: I ordered my food at 8:15 and it was supposed to be here at 8:45, its 9:10, where's my pizza? \n\nM: I'm so sorry about that, we got very busy in the last hour! It looks like our driver was dispatched to you 30 minutes ago, he should be there any minute now! \n\nC: well we already spoke to him, he called us to tell us he was lost, our pizza is late, I want this comped.\n\nM: I'm sorry, ma'am, but you spoke to our driver already? He told you he is running late because he got lost, but I'm sure he will be arriving at any moment! \n\nC: Our pizza was supposed to be here in 30 minutes and it's not here. That means we get free pizza! \n\nAt this point, her entitlement and her attitude has sent me over the edge.\n\nM: I'm sorry, no, it doesn't. Our driver communicated to you that he was lost and therefore would be late. I cannot give you free pizza if you were kept informed of the time of delivery change.\n\nC: *scoffs, stutters* \"are you kidding me? My pizza is late, that means I get it free. You are going to give me free pizza! I want to speak to the manager!\n\nM: ma'am, I am the manager.\n\nC: then you know you have to give this to me free! I'm going to call the owner and get you....you're going to give me free pizza!\n\nM: *at this point, rather angry but wanting to see what I can do in the situation* ma'am, our driver called you and told you he would be late. He should be there any minute. But--\n\nAnd she hung up. I was going to tell her if she could wait a moment, I could call my RGM and see what I could do (because I'd never had someone flat out demand food and I'm new at this) but she hung up. I called my manager, explained it to him. He told me to discount it down entirely and give her a credit to shut down the situation. He sympathised with me though. So I went back, discounted it down, phone rings, a driver answered it and put it on hold for me. I answer. It's her. \n\nM: hello, this is the manager speaking, how can I help you?\n\nC: *snotty* so am I getting this for free? \n\nM: I'm sorry, I was just informed that I had a call waiting for me, I'm not sure who I am speaking to, or about what order.\n\nC: we JUST spoke. \n\nM: oh, yes, ma'am. I spoke to my manager. I discounted your food down. The meal is free. And I am adding a credit to your  account...\n\nC: so I can take my money back?\n\nM: yes...\n\nC: there were supposed to be breadsticks, and they aren't here.\n\nM: *liar, liar, I boxed that order myself* alright, well, the meal is on us tonight, but I'll add a $7 credit to your account for your trouble tonight and the missing breadsticks. \n\nC: Humph, fine. *click* \n\nYeah, okay lady. You can kiss my left butt cheek.",
        "created_utc": 1474194067,
        "upvote_ratio": ""
    },
    {
        "title": "Small victory, not really...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53bm3c/small_victory_not_really/",
        "text": "[deleted]",
        "created_utc": 1474193591,
        "upvote_ratio": ""
    },
    {
        "title": "Customer abuse, abuse and harassment of employees by customers has got to stop!",
        "author": "whydoipoopsomuch",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53baf6/customer_abuse_abuse_and_harassment_of_employees/",
        "text": "I was in the back, washing dishes before going home. The time came when employees were scheduled to go home, and the remaining shift was slowly getting fucked in the ass. I finished all collected dishes when I'm getting ready to leave, but I decide to get the cut table, before I leave, until the momentary rush subsides. I'm cutting and boxing away when this old guy walks in. I started cutting pizzas and putting together wing orders. I saw that a carry out order had many toppings and double toppings, plus added notes to put extra toppings on them, but they weren't actually paying for them. You know what I'm talking about,  people wanting free shit, but not wanting to pay for it. \n\nI see the food coming out doesn't match the order,so I point it out to the shift mgr. I tell them they are wanting more toppings in comments without putting it into the order field, so they probably want free shit. Customer is at counter. Mgr tells them about this situation. Cust tells them they ordered 6.99 as many toppings as you want internet carryout deal. They tell cust that requests for toppings in comments, or extra, will not be made. Inventory is held accountable and we cannot give extra just because they put it in the request field.\n\nCust starts becoming pissy. Cust starts attacking mgr verbally. Asking their name and saying they used to own 2 restaurants of our chain, and how they are going to reflect their review of us because of this. The mgr gave a fake name. The cust became verbally aggressive because the mgr didn't have a name tag on. This was also the supposed last week of the mgr. \n\nIn walks in a very hard working and respected driver. Cust starts verbally berating him because his name tag is worn out. Mgr is too busy to cash driver in and tries to walk him through it, but he can't do it. I walk up, from the back of the house, having rgm training, and cash him out and dispatch him. The cust focuses on me now. I am in full uniform. He has nothing to pick on me about from initial observation. I dispatch the driver and ask mgr if cust is paid. They say yes. I give food to cust and say here you go, have a nice day. Asshole leaves. \n\nCust has best western polo shirt. I could do homework on company, locations nearby, and cust name, so I can give him corporate karma payback, but I don't. This guy ordered 2 med pizzas, with like 6 double toppings, wanted more in comments, and wings. His promo disc was over $22. From my training, there comes a point where people want so much shit on their pizzas that is won't cook completely. These are people who think they can order every topping we have, and only pay $6.99 for it. \n\nI hope you can paint the picture, in your mind, of the kind of assholes we have to deal with on a daily basis. This is exactly why I got out of management over a decade ago!",
        "created_utc": 1474184593,
        "upvote_ratio": ""
    },
    {
        "title": "Asshole children",
        "author": "LastandLeast",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/53aur8/asshole_children/",
        "text": "So, I think we can all agree that when a child signs a card slip or pays for the food while an adult is not present, you're not going to get a tip. I have accepted this, it doesn't bother me. When I arrived at a slumber party a girl around 12 or 13 answered the door and her parents weren't home so she had to sign for it. I take the card slip and I go to leave, but then she says \"Wait, I've got to get your tip!\" and I think 'Sweet, some parents who've raised their kids right.' No, I was wrong. This girl comes back with a penny. She hands me a solitary penny with the most 'popular middle school bitch' face you could possibly give. She knew what she was doing. I threw it at the door once she'd closed it, I'm used to micro-aggressions from people who believe they're better than me because I deliver pizza but this was some all out shit for a kid to do. \n\nI would have preferred the kid not tip me at all than insult me like that. It's not because it was small, it's because she went out of her way to give me a penny, as if that's what my time was worth to her, as if that was all I deserved.\n\n",
        "created_utc": 1474174326,
        "upvote_ratio": ""
    },
    {
        "title": "Got the most awesome tip!",
        "author": "M0bius2",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/537ems/got_the_most_awesome_tip/",
        "text": "I sincerely hope someone has had something like this happen to them, because it was magical!!\n\nIt starts out with me ringing the doorbell and a dog's head pops up in the little window beside the door, it was a Great Dane.  Guy answers the door, and my mini conversation was, \"hey, beautiful Dane you have there, my cousin breeds them and she can't ever seem to get a grey to come out...\"  he chuckles a bit and says, \"yeah took us a bit to find this one,  HEY would you like to see something cool?\"  Me, \"I'm ALWAYS down to see something cool!\" He says, \"alright..... *grinning real big*\"  turns to the dog and goes, \"Gracie... Pizza man is here!\"  Dog looks at me, looks at him, looks back at me and trundles off into the house.  I can hear the dog get on the counter and a few seconds later here she come back, with money in her mouth!!!!  Gracie walks up to me and sits, then extends her neck out to give me the money!!!  Most awesome tip EVAR!!  \n\nI had to share... it was to awesome!",
        "created_utc": 1474122190,
        "upvote_ratio": ""
    },
    {
        "title": "Best/Worst Delivery Instructions",
        "author": "darkxrick",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/535o3z/bestworst_delivery_instructions/",
        "text": "We have an option for customers to input their own delivery instructions for their order. \n\nNormal, semi-intelligent people leave instructions like \"call phone\" \"knock\" or \"buzz apt\"\n\nAnother common (yet annoying) request is for a drawing on the pizza box\n\nBut every shift, some idiot leaves a laughable instruction that I often save on my phone.\n\nSome examples include: \n\n\"Bring beer.\"\n\"Thin crust please\" (do you think I cook the damn thing on the road?)\n\"2 friendly wieners\"\n\"Swag it out\"\n\"Ring doorbell, duck\"\n\nAnd my personal favorite: \"ring the ding\"\n",
        "created_utc": 1474083449,
        "upvote_ratio": ""
    },
    {
        "title": "Turn...your damn...porch light...ON.",
        "author": "NoinePiecesOfVinyl",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/535aqw/turnyour_damnporch_lighton/",
        "text": "Hi there, new to the sub, so sorry if this may be a topic that is beating a dead horse. I've been doing this for 5 years. It started out as my high school/college \"gas money\" job, and now that I have a good full time job elsewhere, I scratch my head and wonder why I'm still here, I'm realizing more and more how much I hate the general public. But that's a different post for a different day.\nIn my 5 years there are a few things that can send me from 0-60 in a matter of seconds, one of which is when the customer doesn't turn their porch light on. I've always worked evenings here, so I deal with it all the time. There is even this regular customer I've delivered to the entire time I've been here, and every single time he says \"hey sorry man, porch light is burned out.\" At this point it feels like I'm in the movie Groundhog Day every time I go there, and I wanna just buy him a damn light bulb. However, I'm speaking in general. \nIf you make me drive around the block trying to find your house (because most other houses have their lights off too, making it impossible to pick out a number) that's just 2-3 more minutes I have your dinner, and it just gets colder and colder. Now, if I can make out numbers, and I know you're a jerk off who won't tip me anyways, I'll park one house up or something, and play dumb and call you, just to make you get up off the couch, and realize \"Ohhhhh...should've turned the light on.\"\nI guess my point is, and this could kind of be a public service announcement for people reading this who aren't drivers, if it's at night, turn your porch light on, if you can't, give us a landmark, something. A White house, a blue Chevy parked out front, something to make me say \"yep that's it\" so that the food gets in your hands faster. Yes, I have a GPS, but 9 times out of 10 when it says \"your destination is on the (direction)\", it's never the right house, all it does is get me on the right block (and sometimes it won't even do that).",
        "created_utc": 1474077144,
        "upvote_ratio": ""
    },
    {
        "title": "The Woman With OCD and a Fiver",
        "author": "AvarethTaika",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5356tl/the_woman_with_ocd_and_a_fiver/",
        "text": "A short tale of kindness managed to slip its way into my night of no-shows, doubling up driving and making pizzas, and a lost street drag race. A regular ordered, and only put $1.29 for a tip on the credit card. Fair enough, she's pretty close and orders often enough she could practically pay my paycheck by herself. When I get there, she tells me to hang on, and a moment later gives me an extra $5 bill. She said she only put $1.29 to make the total an even $30. ",
        "created_utc": 1474075396,
        "upvote_ratio": ""
    },
    {
        "title": "Quitting your job...",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/533k2n/quitting_your_job/",
        "text": "This was [my fantasy of quitting my pizza delivery job](http://www.thewebcomicfactory.com/comic/tales-of-pizza-resume-builder/).  Most of the time I worked there, I really wanted to quit like this, but when the time came, I was just glad to be done.  Anyone leave their pizza driving gig in an interesting way?",
        "created_utc": 1474053026,
        "upvote_ratio": ""
    },
    {
        "title": "\"You were never here bro!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/532k5h/you_were_never_here_bro/",
        "text": "[deleted]",
        "created_utc": 1474041145,
        "upvote_ratio": ""
    },
    {
        "title": "I need to cross check against you guys: what's your opinion as delivery drivers about school teachers as customers ?",
        "author": "QcRoman",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52zaee/i_need_to_cross_check_against_you_guys_whats_your/",
        "text": "It's pretty unanimous where I work at they're incredibly demanding, hard to satisfy and cheap to boot.\n\nWhat about you guys ?",
        "created_utc": 1473985020,
        "upvote_ratio": ""
    },
    {
        "title": "Im stoked",
        "author": "tberre",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52x51w/im_stoked/",
        "text": "Got a job at a smaller locally owned pizza place, with smaller delivery areas, and the ghetto isn't part of that area. It's in a nice part of the cities.  And to top it off they close at 12am on weekends and 11pm on weeknights, which is so much better than the 2am bullshit.\n\nTwo drivers have been robbed at my current store in the last few weeks, one with a gun to his head, working at that store and that area is not worth it IMO.\n\nNeedless to say I am stoked about the transition, walked into their store on a whim the other day and everything clicked, they had a need that I was able to fill.\n\nHopefully the tips aren't shit",
        "created_utc": 1473958550,
        "upvote_ratio": ""
    },
    {
        "title": "This isn't the kind of change I wanted...",
        "author": "RasterTragedy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52visd/this_isnt_the_kind_of_change_i_wanted/",
        "text": "I was supposed to get off at ten. It's 10:20pm, and I'm still on delivery; next guy's late *again*. We're surrounded by apartment complexes, but I still haven't figured out how the room numbers in this one are laid out. And, of course, there are no elevators. Because why would you have elevators for a six-story apartment complex? After finally finding the apartment, having traipsed all over the place, I see something in this guy's eyes. Something bad is coming.\n\nWe make small talk as food is exchanged and receipts are signed. He hands me $13, a decent tip.\n\n$13 in *quarters*. His grandfather, as it turned out, kept quarters in his old pillbottles. By the time we count each and every quarter and I slog my way back to base, it's 10:30. By the time we count all these quarters and I get out of there, it's 10:45.\n\nI'd still take it over closing.",
        "created_utc": 1473935375,
        "upvote_ratio": ""
    },
    {
        "title": "Who do we consider the Big 3?",
        "author": "PolaroidsOfPenguins",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52p5dp/who_do_we_consider_the_big_3/",
        "text": "I am assuming Papa John's, Domino's, and Pizza Hut.\n\nLittle Caesar's and Imo's are big too tho. I think. I'm from Missouri.",
        "created_utc": 1473833077,
        "upvote_ratio": ""
    },
    {
        "title": "\"It's burnt!!!\"",
        "author": "Tru-Queer",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52ohed/its_burnt/",
        "text": "Few years ago, a customer ordered a large thin pizza with spinach and a few other vegetables and no cheese. After receiving her order, she calls the store and demands to speak to the manager. She's pissed that her pizza is burnt. The manager just calmly says, \"Ma'am, you basically put paper in a 500 degree oven, and you're upset it's burnt?\"",
        "created_utc": 1473821450,
        "upvote_ratio": ""
    },
    {
        "title": "Oh, the customer..",
        "author": "AcidBathVampire",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52m5ij/oh_the_customer/",
        "text": "Guy calls last night. \nHim: \"you got a deal with two pizzas for $19.99?\"\nMe: \"yes sir, that's correct.\"\nHim: \"ok, so that means one pizza should be like ten bucks. I'll have one large pepperoni and onions.\"\nMe: \"well, sir, it doesn't work that way. You have to get two and they're 20 bucks. But one with two toppings come out to $19.41 after tax and delivery charge.\"\nHim: \"duh, stupid, half of 20 is ten. So if I'm only getting one pizza, it's ten dollars. You're either new, a retard, or both. Let me speak to your manager.\"\nMe: \"I am the manager.\" \nHim: \"well, who else can I talk to that's not a fucking idiot like you?\" I told him we had two drivers, both on the road, and a guy in the back fixing our A/C. The customer says, \"never mind, I'm calling [another place] instead.\" I said, \"that's who you're talking to right now.\" He hung up and that was it, thank God. ",
        "created_utc": 1473792400,
        "upvote_ratio": ""
    },
    {
        "title": "In which the customer says she was home (but obviously wasn't)",
        "author": "kirokatashi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52j345/in_which_the_customer_says_she_was_home_but/",
        "text": "Yesterday I was in the back gathering sodas to take to the cooler when the phone rings. As I answer the phone, one of the other drivers (L) shouts out \"That's her!\" and runs over. The lady on the phone says she wants to check the status of an order. I have her confirm the address and phone number and tell her to hold on while I check on the order. L tells me that she took the food out, no one answered the door or phone and there were no lights on in the house, so she brought it back to the store. I relay this information to the customer and she says \"Well that doesn't make any sense, we've been home all evening.\" [I can just see her haircut through her tone.](https://cdn.meme.am/instances/54371317.jpg) I tell this to L, she pulls up the address on Google Maps and I describe the house to Customer. She confirms that it is her house, and says that all the lights were on and the garage door was open. I ask her if she would like to speak to a manager. She says \"No! I want to never do business with you again, and [I'll blast your ass on social media!]( http://pixel.nymag.com/imgs/daily/vulture/2015/10/15/15-south-park-yelp.w190.h190.2x.jpg)\" I just say [\"ok\" and hang up the phone.](http://i0.kym-cdn.com/photos/images/newsfeed/000/873/492/df8.gif)  \nEveryone was much amused when I told them what happened, so I thought I would share it here. ",
        "created_utc": 1473748112,
        "upvote_ratio": ""
    },
    {
        "title": "Bank Terminology",
        "author": "pizzaguythrowaway34",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52j2i0/bank_terminology/",
        "text": "I drive for one of the big pizza chains.\n\nYou know when you're at the end of your shift and you're being checked out. When turning in our banks (the cash and change we carry to make change), the majority of people at the store I work at have come to use the following terminology:\n\nVirginal: The bank was not touched during the shift and remains as it was when we received it at the beginning of our shift.\n\nUsed and Abused: The bank is not at the standard bank amount, but is not so far off that we would need a new bank.\n\nBorn Again: The bank was Used and Abused, but has been returned to its standard amount. It may seem Virginal at first glance, but it is always a good idea to double check.",
        "created_utc": 1473747731,
        "upvote_ratio": ""
    },
    {
        "title": "Dealing with poor management.",
        "author": "anonymous334581",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52iw04/dealing_with_poor_management/",
        "text": "Currently working at one of the big 3. This is maybe the third time I've tried to type this, since I've had a drink and can't seem to get the right point across.\n\nI work under a GM that is one of the mos incompetent I've had the displeasure of working with. I haven't been in this industry for long, but I imagine he's the sort that you don't run into to often. If you do, you gtfo asap. Plays favorites, lazy, relabels expired ingredients and dough, and lies to safe face. He's been under review for years now, but he has also avoided being fired for the same amount of time. He was given an ultimatum over the summer, but it's hard to tell if it will even be followed thru with.\n\nAny advice? Thinking about moving to another store within the same chain, but I still want to hold out hope with this current location for a bit longer.\n\ntldr; Shitty GM who's essentially a waste of space. Advice?",
        "created_utc": 1473744229,
        "upvote_ratio": ""
    },
    {
        "title": "Ever been asked for sex?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52igbg/ever_been_asked_for_sex/",
        "text": "[deleted]",
        "created_utc": 1473737055,
        "upvote_ratio": ""
    },
    {
        "title": "Bit of an interesting delivery yesterday",
        "author": "DracoAzuleAA",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52i6en/bit_of_an_interesting_delivery_yesterday/",
        "text": "I've been in the business for almost 8 years now.  And well, this is a first for me.\n\nYesterday some guy calls, and my manager answers the phone.  The guy is in an area about an hour away, but has a girlfriend who lives in our local area.  He wants to place a delivery to her house and pay for it over the phone.  No huge deal, we get these from time to time.\n\nWell, then it gets a bit interesting.\n\nHe then tells my manager to write in $50 as the total on the credit card slip.  He'd ordered a medium pizza, a desert, and a drink which came out to $18 and some change after tax and delivery.  So we're talking about a $30 tip here.  He then goes on to say that his girlfriend is sick.  She's stuck at home with her two kids, and has no car.  So he wants me to stop by the store on the way up and pick her up some benadryl and a half gallon of orange juice.\n\nWell as luck would have it, we're located right next to a Wallgreens.  So that wasn't very far at all out of my way.\n\nOf course I picked out the cheapest, most generic stuff I could find.  But the girlfriend had no idea I was even coming, and seemed relived to have some food for her kids and some medicine for herself, and I came out with a nice $22 tip. Of course I also had the GM of the store sign his initials next to the tip on the receipt, just in case.\n\nTold her that her boyfriend is a pretty good guy.",
        "created_utc": 1473733137,
        "upvote_ratio": ""
    },
    {
        "title": "Customer demands that I open every box for him then gives his reason for doing so",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52hgzj/customer_demands_that_i_open_every_box_for_him/",
        "text": "[deleted]",
        "created_utc": 1473723898,
        "upvote_ratio": ""
    },
    {
        "title": "Perhaps the stupidest customer ever.",
        "author": "the_eluder",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52fcjx/perhaps_the_stupidest_customer_ever/",
        "text": "So I had a delivery to a duplex around the corner from our store.  It is an unstairs/downstairs duplex, and the order didn't specify which unit.  So I called:\n\nMe - 'This is pizza place, did you make an order'\n\nSC - 'Yes'\n\nMe  'Are you upstairs or downstairs?'\n\nSC - 'This is a duplex'\n\nMe - 'I'm aware of that, are you in the upstairs unit or the downstairs unit?'\n\nSC - 'Uhhh, hang on a second'\n\nMe - Wait for more than a minute\n\nSC - Fumbles with phone, 'It's upstairs'\n\nMe - 'OK Be there in about 2 minutes.'\n\nOh God, how can you not remember you had to climb a set of stairs to get to your current location?",
        "created_utc": 1473699413,
        "upvote_ratio": ""
    },
    {
        "title": "My end to my pizza/delivery job",
        "author": "portuguesoulman",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52e7xj/my_end_to_my_pizzadelivery_job/",
        "text": "So I had a job where I worked inside making the pizza and some days I delivered. It was going good in a small family owned place. Well on Saturday we were making pizza in the front of the shop. Then the fire alarm goes off in the back where the kitchen is and the grease fire extinguisher went off. The fire department was called and they shut down the alarm. Well for some reason my manager and boss want to keep making dough in the back. Even though the health inspector didn't go through and say it's safe to make food. Well I voice my opinion against that and get ignored. So then I contacted osha and as soon as I did that I was immediately fired for contacting osha. That was the reason I was given. They did continue to make food back there while having the employees clean up all of the chemicals and fryer oil.\nUpdate:\nWas messaged by my general manager and was told to come in for a meeting. He also said I was just told to leave not that I was fired. Which is a complete lie.",
        "created_utc": 1473685462,
        "upvote_ratio": ""
    },
    {
        "title": "Control your animals.",
        "author": "EnglishInfix",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52cvxx/control_your_animals/",
        "text": "I don't have time to sit around for 10 minutes while your entire family searches the neighborhood for Floofie, your dumbshit dog that bolted the second you opened the door. Yes, this did happen today, and I had other late runs in the car, getting later by the second.\n\nIf your dog has such piss poor training that it tries to escape at every opportunity, put it in a back room and shut the door before you expect a visitor. \n\nI don't care about barking, sniffing, or even jumping, but please don't make me worry that your pet is going to suicide-sprint into the street and get killed, and then claim that \"the pizza guy got your dog killed\". It's gotten close sometimes.",
        "created_utc": 1473659321,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Hut coupon codes",
        "author": "rustlemahjimmies",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/528bpd/pizza_hut_coupon_codes/",
        "text": "Recently our store has implemented a policy where it takes a managers code to apply ANY coupon price, even for inquiries. Needless to say, shits pretty annoying and leaves you looking like a jackass while you 'find an adult' to figure out the price. They say it's a 'glitch' on the corporate level, but I occasionally work at two other stores in the district where this is unheard of. I suspect the new AC is, for now let's just say biased against this store and the demographics of both the clientele and staff. I dunno though, is this a thing I guess I'm asking?",
        "created_utc": 1473597473,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a police knock?",
        "author": "whydoipoopsomuch",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/526dek/is_there_a_police_knock/",
        "text": "As many times as I've heard this, I wonder if there is such a thing? I've also heard people tell me that is a good way to get shot. Seriously? They would shoot a cop knocking at their door?",
        "created_utc": 1473558613,
        "upvote_ratio": ""
    },
    {
        "title": "Can we talk about Grubhub drivers?",
        "author": "heshwillbiteANYTHING",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/526b4z/can_we_talk_about_grubhub_drivers/",
        "text": "I have been driving for a small family owned burger place for about three years now. So I know this business pretty well. Anyway on to my point.\n\nOn my day off I like to be lazy and not even think about driving. So I order food from grubhub about two times a week. Grubhub starting hiring there own drivers to pick up food from restaurants that normally wouldn't deliver. This is great  because I get sick of pizza and Chinese. \n\nThis would be great if the drivers gave even a little shit about customer service. But they don't. This is just a few that I can remember. \n\n1) This one women has delivered to me three times, and every time she has her shitty music blasting out of her phone. And basically shoves my food into my hands.\n\nJust to preface this next one. I live in the back of a two bedroom apartment with block walls. So I can't hear knocking. Everytime I order I put that in the notes along with the easiest way to get to my apartment. \n\n2) Gotten this guy twice. I answer my phone, can't even get \"Hello\" out before he cuts me off and says \"Dude, I'm at your door\" When I get to the door he starts going off on me saying he was knocking for five minutes. I told him about the note and he said \"I don't get paid to read that shit\" \n\n3) I had a couple of different drivers refuse to come to my door. I live in a two story non-gated complex. They made me walk to the front office or to the middle of the parking lot. \n\nAlso, my minimum tip is $5.\n\nHave you guys had any positive interactions with these guys?",
        "created_utc": 1473557657,
        "upvote_ratio": ""
    },
    {
        "title": "Blare your music to prevent being robbed",
        "author": "universetwisters1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/525kw8/blare_your_music_to_prevent_being_robbed/",
        "text": "One of the last deliveries last night before closing was placed online and it went to a house that I've never been to before in a part of town that's less than favorable. The instructions on the ticket said \"drive all the way down driveway\", and usually nobody posts that unless they live in the more affluent part of town where there's long, winding driveways (which this was not). I went to call the customer with the number on the ticket to ask them about it, but they weren't picking up the two times I called them. So what do I do?\n\nI make myself very visible. Put my brights on and my windows down to blare my music as loud as I can. Do I look like an ass? Sure. Would I have done a good job at spooking any potential robbers off? Of course, nobody would want to stick up a rolling disco, not unless they want all their neighbor's eyes on them while they're dragging a pizza guy out of his car while Joachim Witt's \"Goldener Reiter\" blares throughout the neighborhood. Which is even better because, if they do rob you, some angry neighbors could give a description.\n\nI was thankful to find out, though, that they only said to drive down the driveway because their house for whatever reason was down a long driveway between two other houses and the dude wasn't picking up his phone because he was baked out of his mind, but it really made me think; if I were to choose between making an ass of myself and a hospital bed, I'd gladly take the former.",
        "created_utc": 1473547094,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding tips...",
        "author": "Setra94",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/52458s/regarding_tips/",
        "text": "First time posting here and have had fun reading the stuff posted here, anyways I have a question for the delivery guys regarding tips. \n\nAre you guys cool with credit card tips? I usually don't have cash on me, and was wondering how much more trouble it compared to cash tips, or if you don't like CC tips at all. I order pizza at least twice a month and the store is about 9 minutes away. My orders usually come out to $15-$25 dollars and usually give $5-$8 as the CC tip on the reciept? Is that okay?",
        "created_utc": 1473528733,
        "upvote_ratio": ""
    },
    {
        "title": "Very annoying stories from my first day",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/522zdl/very_annoying_stories_from_my_first_day/",
        "text": "[deleted]",
        "created_utc": 1473512156,
        "upvote_ratio": ""
    },
    {
        "title": "Customers handing you bills you just can't make change for...",
        "author": "rroxannee",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/520n83/customers_handing_you_bills_you_just_cant_make/",
        "text": "Today I took an order over the phone for a medium pizza that came out to roughly $19 with tax and delivery. I go through the usual \"Expected delivery time is __, will this be with cash or card? Cash, okay, you do know our drivers carry less than $20 on them, see ya soon, bye\" and hang up. \n\nI've delivered to this guy before so I kind of knew what to expect (kinda rude and never tips lol) but today I got up to his door and this kid hands me a $100 bill. I said, \"ummm, yeah I can't make change for that\". He responds, \"well I don't have change either, can you wait five minutes?\" I said no dude I have like two more orders to take on this run I can't wait for you lol. We ended up throwing the pizza away because the guy didn't want it after we called him back and asked. \n\nI just don't understand. How can you sit there and listen to someone tell you they can't make change for bills larger than $20, and then hand the same person a $100 bill ??? ",
        "created_utc": 1473467696,
        "upvote_ratio": ""
    }
]