[
    {
        "title": "\"Will you just let me do it?\"",
        "author": "Pootisburd44",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7l5gfg/will_you_just_let_me_do_it/",
        "text": "Blah blah longtime lurker first time poster blah. \n\nWorked retail for 5 years at a chain focused in the southeast region of America, but recently turned in my two weeks for reasons I won't get into. Anyway, me and my mother were in one of the chain's numerous stores last night when I experienced, second hand, the rudest customer-service clerk I've ever seen.\n\n\nWe get up to the counter with our cart full of things, and being almost Christmas as it is, it's quite busy. One poor cashier had two full carts of items and no bagger around. So me and mom go through U-scan, where she hands me some money and asks if I'll go get her the coffee that was advertised in the lobby from the Starbucks inside.\n\nI joke and tell her only if she buys my hot chocolate, she hands me a couple bucks extra. The Starbucks workers were great, I was a couple of quarters short and they waved me off, so I put two dollars into their tip jar. Great workers, very nice people. Anyway.\n\nI turn around and see Mom cleaning up what looked like coffee off the floor while a clerk is helping with a raincheck. Yes you can use rainchecks at U-scan, but it's easier to go through a register. \n\nQuick backstory here. Mom has spent the 13 years or so with the chain that we were shopping from, the last 8 or so as a CSM, the best the company had and that is not from bias, let me tell you. She would have store managers and sometimes even district managers come to her for help for things they really should have known themselves.\n\n\nSo she tries to help out the clerk, who either didn't know what she was doing, or was making rookie mistakes. Bad idea. In a tone that would have landed me in hot water had I used it on a customer, she snaps at Mom, \"Would you just let me do it?\". I really thought about just dumping my hot chocolate on her, but that's a waste of a drink. The drink did nothing to deserve touching this woman.\n\nMom's just like, \"Ok.\", and steps back, as the clerk fumbles through the remaining items with the raincheck, making a few mistakes, and ignoring the customers behind her who needed help. Not even so much as a \"be right with you.\" Very rude. \n\nShe finally gets done, and goes to assist the other customers, when an error occurs, which requires more help. Another clerk, a big guy who came off as rather friendly, fixes it for us much faster than she would have, only to have her ask him what he was doing.\n\n\"I'm just helping them!\" From his tone, I got the feeling she did this kind of thing rather often. We finally get done with the transaction, and as we walk out, I recognize the picture of this store's manager. I'd worked with him before at the location I first started, and he was a huge influence, helping me through some rough stages, and giving me a chance to correct my poor work and attitude. I did, because I didn't want to let him down. If he's still the same kind of person, I imagine he's looking for excuses to fire this lady.",
        "created_utc": 1513813362,
        "upvote_ratio": ""
    },
    {
        "title": "My sister's stolen drink and the awesome barista",
        "author": "turtlessayrawr",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7l525g/my_sisters_stolen_drink_and_the_awesome_barista/",
        "text": "This took place maybe an hour ago. \n\nMy little sister and I had gotten done with a day of lunch and window shopping, and we decided to use a $10 \"popular coffee chain\" gift card she had gotten at her dance studio's Christmas party. \n\nWe go in, order, and attempt to pay using the card. Turns out, the card wasn't even activated and there wasn't any money on it. I pull out my cash and the barista discounts it down, I'm assuming using his employee discount. He lets us know that our order will be under his name. We thank him profusely and sit down to wait. \n\nA minute later, a drink comes out. We assume it's my sister's. She stands up to grab it when this old bat swoops in front of her, grabs it, studies the label for a minute, and takes off. I could barely see the label, being that my vision sucks. But given how she had to triple check the label, it would've been obvious to anyone that it wasn't hers.\n\nNeither my sister nor I wanted to make a scene, so I decided to let the barista know what happened.\n\nHe seemed floored that someone stole our drink like that. He said he'd get it taken care of.\n\nA moment later, he hands us a drink maybe 3 times the size of what we had ordered. We thanked him over and over again, and I dropped $5 in the tip jar. \n\nTL;DR awesome barista discounts drinks because we were given a bad gift card; old lady steals my sister's; we get a freaking massive drink instead.\n\nThank you, awesome barista.  ",
        "created_utc": 1513809675,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not sure if this could've been considered rude on my part",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7l4yhw/im_not_sure_if_this_couldve_been_considered_rude/",
        "text": "[deleted]",
        "created_utc": 1513808736,
        "upvote_ratio": ""
    },
    {
        "title": "\"It's working\"... No, it's really not",
        "author": "pawsamoment",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kzq4h/its_working_no_its_really_not/",
        "text": "I stopped at a gas station on the way to drop off a rental car, and pull up to pump number 9. I get out, undo the gas cap and pop in my card, then I notice the little screen on the pump is blank and not changing. I press random buttons, pick up and put back the nozzle, hit clear etc. Nothing. I figure pumps broken so I head on over to pump 12. Oh look, this display has text! Pop in my card 'there is a problem with authorization, please see cashier'. Ok, well maybe the other pump locked up the card, let's try another card and then I will got in and ask them to fix it. Another error message pops up after sliding a different card. *sighs* i give up and head inside. As I head into the station to see the cashier (C), I see a lady pull up to pump 9. \n\n\nAt the counter:\nMe: Hey I was on pump 9 but it's broken and only showing a blank screen. I tried pump 12 but now my credit card wont work, could you reset pump 9 so I can use pump 12? \n\nC: Well your card is up on pump 9, so you can just go use that one.\n\nMe: no it's broken, just a blank screen. Could you cancel it before the lady (at pump 9) does anything?\n\nC: Well that lady just left (gee maybe cause the pump ISN'T WORKING). So you can go use that one.\n\nMe: no it's broken, reset it, I will use pump 12\n\nC: (* sighs heavily *) but it's up on 9\n\nMe: (*getting irritated*) Reset 9, I will use 12\n\nC: ok (*does absolutely nothing while staring at me, both hands on the table*)\n\nMe: (*waits a few seconds*) so it's reset?\n\nC: yes (*again doing absolutely nothing*)\n\nRiiiight.\n\nSo I walk back out to pump 12 and yep, it does take my card. Pump gas and wander back over to 9 while it's pumping and sure enough. Still a big blank screen. \n\n\nI wonder how long it will take them to figure out pump 9 is broken.",
        "created_utc": 1513752654,
        "upvote_ratio": ""
    },
    {
        "title": "When your friend orders so much food the cashier assumes it's for both of you and doesn't take your order.",
        "author": "_frances",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kyt2l/when_your_friend_orders_so_much_food_the_cashier/",
        "text": "A little while ago, I met up with a friend to get some food at a sushi place. My friend does usually order quite a lot of food, definitely enough for two (depending on your appetite I guess), but the employees usually at least ask if there's anything else or they assume I'm going to order something too since I'm standing next in line. \n\nSo anyway this time my friend puts her order in, pays and goes to find a seat. I step forward to the counter ready to place my order, and the cashier just turns around and disappears into the kitchen in the back. I thought maybe she was just going to tell them the order and come back, but she didn't. I stood there for a while just awkwardly trying to get someone's attention. They could see me whenever they went past the doorway, but I guess they just thought I was waiting for the food and kept ignoring me while they chatted, tidied up and pottered around. \n\nMy friend (who is much more outgoing and less softly spoken than I am) finally came to the counter and said \"HEY! Could we order something else please?\" They apologised and I finally got to order my lunch.",
        "created_utc": 1513741785,
        "upvote_ratio": ""
    },
    {
        "title": "\"We'll contact you. Maybe. Probably not.\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ky5ty/well_contact_you_maybe_probably_not/",
        "text": "[deleted]",
        "created_utc": 1513735104,
        "upvote_ratio": ""
    },
    {
        "title": "CenturyStink ISP Customer Support chat. Good/Bad customer service? Decide for yourself.",
        "author": "barrypicker99x",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ky4zi/centurystink_isp_customer_support_chat_goodbad/",
        "text": "[removed]",
        "created_utc": 1513734869,
        "upvote_ratio": ""
    },
    {
        "title": "Outlet store confusion",
        "author": "paigenotcasey",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kxhzh/outlet_store_confusion/",
        "text": "So I was walking around an outlet mall, when I spot a store selling discount luxury makeup. I peak in, it's some good brands and looks pretty legit. Cool! I go in and start to look around\n\nFirst thing I notice is there are hardly any prices listed. There are testers everywhere, occasionally one will have a price, but not most, and on top of that half of the displays are just testers. What do I do if I want to buy it? Is it in a drawer? No, doesn't seem like it... Is it behind the tester? Nope, not there either. So I'm already confused and I finally make up my mind to go ask an associate what the thing I want costs and how to acquire it when I overhear this:\n\nRandom lady (to associate): \"excuse me, I can't find a price on this, can you tell me how much it costs?\"\n\nAssociate: *in French accent* \"No, I can't, do you expect me to just have all the prices memorized?\" \n\nUh, what? Do you not have a system or book or something? \n\nAssociate: \"if I had to guess, I'd have to say it's like $10\" \n\nAnd with that, I decided I wouldn't be buying anything at this store if it was going to be anything like that, and walked out. ",
        "created_utc": 1513728829,
        "upvote_ratio": ""
    },
    {
        "title": "You should know how this works!",
        "author": "amythemagiccow",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kxc7g/you_should_know_how_this_works/",
        "text": "LTL, FTP, mobile formatting etc etc\n\nThis happened Saturday. \n\nI was going across my city on a bus, as I do on the regular. I arrived 5 minutes before the bus was due to depart from the station, but the driver wouldn't open the doors, even though he'd clearly seen me standing waiting. \nHe opened the door one minute before it was scheduled to leave, then said something like \"You should have been here on time!\" which was confusing, since I was there in plenty of time. \nWhen I then tried to pay for my ticket, by handing him the money, he got unreasonably annoyed when I didn't know to put the change in a box rather than handing him it. (I'd never experienced something like this, I'd always just handed the driver cash)  \nI later watched him close the doors just as someone was about to step onto the Bus. \nSo, nothing outrageous, but grumpy bus driver took his feelings out on customers.\n\nTL;DR grumpy bus driver got annoyed cause he didn't tell me how his bus worked ",
        "created_utc": 1513727337,
        "upvote_ratio": ""
    },
    {
        "title": "The Day of the Jacket.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kxb97/the_day_of_the_jacket/",
        "text": "[deleted]",
        "created_utc": 1513727077,
        "upvote_ratio": ""
    },
    {
        "title": "[UPDATE] Company tech support doesn't understand mac vs windows",
        "author": "DoesTheOctopusCare",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kwvqt/update_company_tech_support_doesnt_understand_mac/",
        "text": "[Here is my previous post.](https://www.reddit.com/r/TalesFromTheCustomer/comments/7i1vn8/company_tech_support_doesnt_understand_mac_vs/)    \n\nI have an update! Right after I posted 12 days ago, I checked my \"ticket\" in the IT log system, and all it said was \"customer cannot locate her shared drive\". I thought this was a rather incomplete description of what had actually transpired over the phone call, so I complained to our Chief Technology Officer about the Unhelpful Dude (UD) I talked to. The CTO was able to locate the shared drive, but it wouldn't let him actually see any documents. So he went over to the IT department in person and sat down with them to figure out what was going on.     \n\nTurns out that you have to be manually added to a pool of users, and has nothing to do with the vpn. The CTO told me this, and said he would talk to them about the bad help I got. Today I got a call from a manager at the IT dept, and he apologized for taking 12 days to get back to me (but not for UD and the runaround I got) and said I'd been added to the pool, and he was going to email me directions on how to connect. I said thanks and hung up. Two minutes later, I got an email with WINDOWS PC directions. I immediately emailed back and said \"I have a Mac so unfortunately no Start Button, got any Mac directions?\" (Even though at this point I could google it myself). Took him several hours to reply but he did send them.     \n\nI can now connect to our shared drive, without using the vpn, and it didn't require an overhaul of my computer or log in, and I never did find my C: drive....  Also, they never did send a technician to me either. ",
        "created_utc": 1513723063,
        "upvote_ratio": ""
    },
    {
        "title": "NO CAP!!!",
        "author": "nbaxxk",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kwcl8/no_cap/",
        "text": "LTL, FTP.  Mobile blah blah bad formatting blah blah blah. This happened last Friday.\n\nSo to give some background I have an anxiety disorder and it can be especially bad when doing things such as ordering food since my parents used to always order stuff and never let me do anything on my own so every time I do this it's totally new territory. Also, people mistake me for a girl every time I even breathe so I hate interacting with anyone or anything with a passion. But I'd be damned if I didn't go get my frozen yogurt.\n\nAnyway, school let out and I went to a nice place in the corner of a small strip mall and was going to get my usual pineapple thing. The store was empty, so that was already good. No big deal, except today I was already having a bad day *and* I had decided that I would use the extra buck in my backpack for a topping. The actual order goes pretty okay, save for me practically shaking in my boots. The woman behind the counter asks me if it's to-go or to eat in, to which I reply that I'd like it to-go. \n\nUsually they ask me if I want a cap or not and I say no but this question for some reason *really* threw me off because, well, it wasn't what I usually got. I watch in slight horror as she puts my toppings on and then reaches for a cap and out of nowhere I blurt out, \"NO CAP!!!!\" really loud. I'm absolutely mortified and start apologizing profusely.\n\nThe woman looks confused and tells me I wanted it to-go and I confirmed that yes I did but I didn't want a cap. I think she must have caught on to how nervous I was because she had a really sweet smile on and seemed genuine. She said it was OK and just took the cap off and replaced the yogurt that got stuck onto it (quite a bit, actually; the caps really stick) and handed me my thing. I felt really bad for what happened so I just wordlessly dropped the rest of my money in the tip jar and pretty much ran out.\n\nIt doesn't seem like such a big deal from the outside maybe but it felt so nice to not get weird looks for being twitchy/nervous/jumpy and it felt absolutely amazing to even see a _smile_ after I yelled at her like that. So for the rest of the day I felt really good and happy and not like I had embarrassed myself completely in front of that worker.",
        "created_utc": 1513718328,
        "upvote_ratio": ""
    },
    {
        "title": "The pharmacy singer",
        "author": "IAte4CadburyEggs2Day",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kv5nm/the_pharmacy_singer/",
        "text": "I went to my local pharmacy to get some TP and tissues. As I’m walking through the isles, the pepto bismol song was playing over the speakers. \n\n“Heartburn, nausea, indigestion. Upset stomach, diarrhea”. \n\nOne of the ladies that worked there was humming the song. But every time they said diarrhea she would say it out loud. Not the other lyrics, just the word diarrhea. \n\nAs a customer, I’m still giggling about it. Lady was just saying diarrhea over and over. How often does that song play there? How many times does she say diarrhea a day? \n\nI’m a local, so I see this lady almost every time I go. She’s the ‘diarrhea lady’ now, and I wish I could laugh with her about it. That was the best day of my whole week. Thanks diarrhea lady. ",
        "created_utc": 1513708077,
        "upvote_ratio": ""
    },
    {
        "title": "These must by handled by hand!!!",
        "author": "lesyeuxouverts",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ktqdn/these_must_by_handled_by_hand/",
        "text": "Last Saturday I ventured to the post office to mail some Christmas gifts. Being that it was the weekend before Christmas, I fully expected a line so I wasn’t too bothered to see a line stretching almost at the door.\n\n\nThere are 2 postal workers serving the customers in line so it moves slowly but steadily. I finally make it to the front and am being helped with my transaction when a woman bursts through the doors, cuts the long line entirely and tries to edge me of the way...\n\n\nRude woman: EXCUSE ME! I have to drop these off! They need to be hand cancelled and handled with care! (she’s holding a large stack of those heavy duty flat mailers, and they already had postage affixed)\n\n\nPostal Worker: Ma’am, I’m in the middle of this transaction but we don’t hand cancel anymore so you can just drop them in the slot if they’ve already got postage...\n\n\nRude Woman:  NO! You don’t understand... these are PHOTOGRAPHS!!! They cannot go through the slot!! I don’t want them going through any machines!!\n\n\nPostal Worker: However you drop them off, they are going to go through the sorting machine...\n\n\nRude Woman can’t deal with this information and storms out in a huff. I don’t know what she was thinking but no one is going to hand walk her items through to their final destination. ",
        "created_utc": 1513695350,
        "upvote_ratio": ""
    },
    {
        "title": "Customer Experience and Service in a Business - HRCrux",
        "author": "vince181",
        "url": "http://blog.hrcrux.com/customer-experience-service-business/",
        "text": "",
        "created_utc": 1513675321,
        "upvote_ratio": ""
    },
    {
        "title": "Free Stay for drunks wandering around my daughter!??.... Well, ok.",
        "author": "SneezySmurfer",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ks4cw/free_stay_for_drunks_wandering_around_my_daughter/",
        "text": "Recently my wife and I took our (then 4 year old) daughter on her first trip to the Big Apple! Plenty of prep work went into scouting a location. Living 2.5 hours away, we frequent New York City often, but not since we had Hailey... until this trip. \n\nThe plan was simple. Take the Lincoln Tunnel, make a quick right when we saw daylight, pick a spot in the parking garage where our car had the smallest risk of getting banged up-CHECK!  Grab the luggage, check into the hotel a “short” 3 blocks away and get out to let Hailey see the sights, lights and smells of one of the greatest cities in the world-CHECK!\n\nWhile booking, I paid extra for a high floor with a view. Like I said, it was her first trip and even for the few minutes while resting in the room, I wanted her to stare out in amazement as I did when I was young. \n\nWe check in to the hotel, a brand we’ll know around the world. To my delight we’re placed on the 20th floor, the very top floor... for guest rooms. \n\nAnd so it begins. \n\nAs we walk to the elevator, we’re stopped and corrected by a pleasant gentleman who guides us to the elevator to the right. The left is sitting there, door open, with posts and rope guiding absolutely no one to it. Without thinking we head up, drop our luggage, freshen up and shoot back down to the streets below. \n\nHours later, exhausted, we make our way back to the hotel. This time, the lobby is PACKED. Packed in the sense that we’re waiting on the sidewalk with 15-20 people in front of us just waiting to get through the door. We wait, and when it’s our turn to enter, I realize we must’ve went to the wrong hotel. There’s a young lady, a bottle of tequila past intoxicated, spitting and cursing at the security guard escorting her out. I think I heard some serious name calling, but the music was so loud, I couldn’t be sure. It was vibrating my pants. My attention was torn between the fist fight with the four drunk college guys, two others trying to hold their friend up and yes,  there was also a group of 6-7 very beautiful, very well dressed ladies waiting. \n\nAnd then I snapped out of it. It wasn’t the music buzzing through me- it was my daughter, tired and terrified, clinging to my legs. I looked over at my wife and grabbed her hand, shaking her from a similar trance I just awoke from. I plowed through, with many low, inaudible “so sorry” mumbles. I catch a break in the sea of people and spot our elevator on the right, this time wide open. Now, the posts and rope were on duty, trying to corral the mob, ushering them to the security guard standing at the elevator to the left- the one that takes you straight to the rooftop bar. \n\nI quickly get the girls in, swipe the room key and BAM, the numbers for the floors light up and the elevator comes to life. I hit 20 as if it was the pull cord for the ejection seat in a fighter jet. The doors begin to close and BAM, a hand daringly pops in refusing to let the sliding doors meet. They pop open and whatever max capacity is, double crams in. The security guard glances over as it happens, but the look in his eyes clearly says “I don’t get paid enough for this.”\n\nCrammed in the back we watch a few make out, a few argue over who’s going home the the hottest one, and the rest frantically searching for the button for the 21st floor. Sorry, boys- that’d be the elevator on the left, with the line, and the drunks. \n\nSo we all spill out onto the 20 floor. I grab the girls and race to our room- on the top floor, with the nice view, on the corner of the building..... and right next to the stairs that go up....and right under the bar-that’s open until 4:00am. \n\nThe rest of the night was spend listening to boards of drunks sliding down the hallway and bouncing off each doorframe, screaming to one another when the stairs were spotted, followed by a brief moment of silence and then sounds of rage and anger as they came back down the stairs and through the hall, defeated that their almost masterful shortcut was nearly realized until the very last second, when a locked door at the top stood its ground, refusing to let anyone enter, and guaranteeing a return trip past our room. \n\nWhen we got home, I emailed the hotel immediately. I wrote about the wonderful, polite lady who checked us in, the gentleman who stood watch over the continental breakfast, assuring the pastries were fresh and the coffee was hot and I wrote about our narrow Escape from New York City. I took a few minutes to research the right person to send it to and I got lucky. Within a day, a reply was there, filled with apologies, a complete refund of our entire stay and 10,000 free bonus points for the hotel rewards program. \n\nWould I go there again, hell yes!- just not with the kids. They touted themselves as a family friendly spot in walking distance to all the attractions. I just didn’t know they meant the attractions would literally be walking by us. \n\nOverall, it was a fun trip. The place gave us memories and our money back. There still is great customer service out there, you just have to search for it with manners and respect. ",
        "created_utc": 1513674148,
        "upvote_ratio": ""
    },
    {
        "title": "Three strikes",
        "author": "eldergeekprime",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kraos/three_strikes/",
        "text": "Three times now I've been to a local restaurant belonging to a national burger chain (not one of the top 5) and ordered a bacon cheeseburger with ketchup only.  (If I want a salad I'll buy one, no need to put it on the bun for me.)\n\nThree times I've been given it without the cheese, and once without the cheese *and* the bacon.\n\nTwice I went back and had to talk to the manager to get the order remade.  The third time I simply gave up on the chain (these were are two different locations of the same chain).  I know go to a different chain.  I don't like their food as much as I liked the other chain's food, but at least they understand that if I order a bacon cheeseburger that means I *do* want the bacon and cheese, otherwise I'd just order a hamburger.",
        "created_utc": 1513662386,
        "upvote_ratio": ""
    },
    {
        "title": "Airline help",
        "author": "blakesmate",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kr0sd/airline_help/",
        "text": "I had to fly to California this week for a funeral and the airline has been great for me so far. First off, I called Telda airlines to check if they had a bereavement rate for tickets, and the lady I talked to told me they did, and looked up the rate for my flight, but then suggested I should check a specific website that she knew that often had lower rates first. I was surprised, but thankful and I did check. Nothing was cheaper than the bereavement rate, so I ended up calling Telda back and booking a flight for me and my baby.\n\nThen I had trouble getting the pick a seat feature to work, and online checkin wouldn’t work for some reason, so I had to call the night before I flew. They couldn’t get me a window seat on the way out, which I prefer when traveling with a baby so I am not intruding as much in people space, but he set me up on the way home.\n\nThe first leg of my flight out, my neighbor was nice and let me trade for the window seat. The second leg of my flight out, I got upgraded to comfort plus for free! When I went to gate check the car seat, I was told I was upgraded, and that she made sure I had an empty seat next to me. That was really nice, because I had to nurse my baby, both to help her with the ear pressure and because she was hungry, and her legs were getting in  the way of my neighbors on the first flight.\n\nBaby was wonderful both flights too, she slept much of the time, and anytime she got fussy, a bit of nursing quieted her down. Here’s hoping tomorrow goes as well.",
        "created_utc": 1513659108,
        "upvote_ratio": ""
    },
    {
        "title": "Dollar Store employee has nothing for their child for Christmas.",
        "author": "xProperlyBakedx",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kpkzk/dollar_store_employee_has_nothing_for_their_child/",
        "text": "So to preface this, I am not what one would call a compassionate person. I don't even like hearing my friends problems let alone total strangers, so when someone \"opens up to me\" about their struggles I generally ignore it and move on. This one though got under my skin. Maybe I was the asshole here, and I can accept the fact I likely was, but damn dude, how much do you have to suck at life to have literally *nothing* for your kids for Christmas?\n\nSo I go into my local everything's a dollar store to buy a few bits of ribbon and a couple last minute stocking stuffers for my daughter. When I get to the checkout, a woman reeking of cigarettes starts ringing me up. Normal chit chat ensues until she out of nowhere drops this bomb on me.\n\nC: Yeah, must be nice to have gifts under the tree, I don't have anything for my kids.\n\nMe: Oh are you planning some last-minute shopping this weekend or something?\n\nC: No, I don't have any money to get them *anything*.\n\nMe: That's too bad (annoyed already by this guilt bomb being dropped on me) did you just start this job or something?\n\nC: No I've been here a few months, I just don't have any money after bills and what not.\n\nMe: So I guess by *what not* you mean cigarettes?\n\nC: ummm..... Well..\n\nMe: You work at a Fucking Dollar Store! There is 2 isles worth of toys and books right over there you could buy for them. 2 days without a smoking would give you 10 items or more here!\n\nC:(looking at me in my suit) You just don't understand, look at you, how could you?\n\nMe: I've spent years earning my college degrees in order to better myself, and during that time I'd go days without having anything more than Ramen to eat, I've gone week's without running water in order to make sure I paid my rent(before I had kids), but I've never allowed my child to feel any financial pinch. Get better at life and buy your kids a damn present for Christmas.\n\nAnd with that I grabbed my bags and left.\n\nI understand that life is hard and money problems are real, but when you have money for cigarettes and other unnecessary bullshit and then try to guilt trip a customer about how you're so broke you can't afford presents for you kids, I lose all sympathy for you. \n\nI feel so horrible for those children, but don't put that shit on me, I didn't ask and I certainly am not going to give you an admitted awful Steward of money anything to buy for them. \n\nI know I was an asshole, but damnit don't put your problems out there for the world if you don't want to hear the brutal truth...",
        "created_utc": 1513644076,
        "upvote_ratio": ""
    },
    {
        "title": "A Tale of Two Greeters",
        "author": "SpastixFantastix",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kpdl8/a_tale_of_two_greeters/",
        "text": "I'm currently sitting on a bench just inside the doors at my local Blue W Retailer. I'm shopping with my friend and her daughter but, since they apparently have more stamina than I, I've been here for about an hour so far.\n\nWhen I first sat, the greeter, situated across from me, was a woman with a clipboard who stopped everyone to see their receipt. Then she'd thank them and they'd be off without a word. \n\nAt some point, a different greeter came on. I was playing on my phone so didn't notice right off. I did notice when no one was being stopped for receipt checks any more. Instead, the new greeter just says some variation of, \"Thank you, have a good night!\" And, I'm not kidding, out of the at least 100 people who must have walked past as I've been here, I've noticed only 2 say nothing. Most have offered a just as cheery, \"Thanks,\" or, \"You too.\" Some have quietly said, \"Thanks.\" And even a couple have offered happy variations of holiday greetings. \n\nIt's been an interesting people watch, to say the least. People seem much more amicable when they don't get stopped to have their receipts checked. Granted, it's a small sample and the cheery lady has now been here longer. Still interesting nonetheless. \n\nI'm actually enjoying watching customers greet her back and off good-byes in return. I genuinely like people being nice and polite. ",
        "created_utc": 1513642085,
        "upvote_ratio": ""
    },
    {
        "title": "To our server",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kogvr/to_our_server/",
        "text": "[deleted]",
        "created_utc": 1513633676,
        "upvote_ratio": ""
    },
    {
        "title": "Ordered a Chicken Panini and they forgot...",
        "author": "jwsys",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kntnl/ordered_a_chicken_panini_and_they_forgot/",
        "text": "The chicken. I got two slices of bread with grill marks, some delicious cheese, and that's all. I basically got a grilled cheese. I understand forgetting the cheese on a sandwich, or even the condiments, but the CHICKEN? Worst part was it was delivery, so I didn't even have the satisfaction of gaping in disbelief at someone in person.",
        "created_utc": 1513628036,
        "upvote_ratio": ""
    },
    {
        "title": "Perhaps a change of pace from the usual posts.",
        "author": "Shannonigans",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7knt4n/perhaps_a_change_of_pace_from_the_usual_posts/",
        "text": "[removed]",
        "created_utc": 1513627917,
        "upvote_ratio": ""
    },
    {
        "title": "Going above and beyond in mobile service",
        "author": "way2tall4u999",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7knlrw/going_above_and_beyond_in_mobile_service/",
        "text": "Just wanted to drop a nice story from a customer's perspective. \n\nWent to the mall with a friend last night since she had an upgrade credit to get a nice phone. We're in Ontario, and little did we know that the big mobile companies did a huge deal for 10GB plans for $60 (yes, that's a good deal up in Canada).\n\nNeedless to say, all the mobile kiosks and stores were swarmed. The first kiosk guy we talked to said he was currently on hold with K-Mobile for 2 hours and even showed us the call time on his phone. Sadly they also didn't have the phone she wanted in stock, but confirmed she could get an LG G6 for only $260. He thankfully recommended we check out the more generic kiosk around the corner.\n\nThis is where we meet the hero of our story 'Zack'. He quickly takes a moment from his current customer to triage our needs, says it'll be a quick transaction, but it'll be at least 45 mins until he can talk to us. That's fine, we have some friends working (Godspeed to them) and friend wants to get some coffee as she's been up since 6AM (it's now about 6PM). He takes her number so he can call us back when the line's shorter.\n\nWe do some errands show up about 45 mins later and sit nearby. The line has dwindled to only 3 people in front of us, but it's pretty much the worst groups for quick service in mobile: Non-tech savvy parents, with 4 distracting little parasites running into and out of every store in the nearby vicinity and 2 retired-age couples. \n\nHe comes over and assures us that if we can wait, he will make sure we are served even if it's after closing time, about 20 mins from that point). Being the *over-entitled* millennials we are, this is actually fine with us. Saving $650 on a phone is totally worth waiting an hour, and gives us a chance to catch up.\n\nSo the mall closes at 7 and Zack finally serves us at 7:15 being an awesome champ, runs through everything super quick, but without skipping any key details. Having been screwed over by another big telco (rhymes with Robbers), I'm amazed at his professional level service and that he would stay after closing to make sure we were served. \n\nMay the rest of his holiday retail season be peaceful no 2 hour holds while this new promo runs.",
        "created_utc": 1513626129,
        "upvote_ratio": ""
    },
    {
        "title": "Went for a Christmas party at our usual bar",
        "author": "whirlpoohl",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kmc38/went_for_a_christmas_party_at_our_usual_bar/",
        "text": "So, my boyfriend lives in a pretty rural town, and there's a dive bar we frequent because while their food is generally just bar food, they make an amazing chicken philly that I order every time.\n\nSo it's during this Christmas party, we finally find a table and wait forever for a server, (pretty normal, they have pretty crappy customer service) we waited so long we just had to hail the first one that passed us, and this guy takes care of us almost every time. At least the past 4 times.\n\nSo I order and he makes a comment of \"yea, the exact same thing as last time, I remember\". Since the place is packed, it takes longer than the usual long time to get our order; no worries, we knew it was going to be crowded. So I get my sandwich and I open it to put condiments on and its just like cubed chicken, and cold cubes of cheese, nothing melted. We waited forever for the guy to come back (my boyfriend ate his whole sandwich), and I'm like \"I'm so sorry, I never send stuff back at restaurants, I feel so bad, but this sandwich isn't really cooked...they don't have to make a whole one, if they could just warm it up, I'd be happy\" So he looks at me funny and says \"yea it's busy in here\" and almost walks away before my boyfriend says \"Just have them warm it up\" and he took the sandwich back.\n\nHe comes back like 20 minutes later telling me the cook was really sorry, and I was apologizing if I was seeming difficult, and everything was fine, we were just there forever at that point. The server comes back with my food, and there were only 2 onion rings left out of the 11 or 12, but they put 2 chicken strips on the plate? I was like, okay, that's annoying, but whatever. I open the sandwich again, and again there's cold cheese cubes.\n\nMy boyfriend is saying \"I'm not waiting on a 3rd sandwich, take it home, we'll heat it up, it'll be fine\", I was pretty annoyed and told him \"You just tell this guy what we need, I can't deal with this, I feel bad\" Like, I'm super annoyed at this point.\n\nThe waiter comes back and says \"you know, I feel like a real douche right now, but I just gave you back the same sandwich. Yours is coming out\" I laughed it off, and I was like \"it's fine, it happens!\".\n\n15-20 minutes later a new sandwich came out and we just boxed it up and took off.\n\nIt just astounded me that after waiting a long time, he brought me the same sandwich, with 2 onion rings left on the plate, and 2 chicken strips.",
        "created_utc": 1513615184,
        "upvote_ratio": ""
    },
    {
        "title": "Waffle House",
        "author": "JapaneseStudentHaru",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kka9q/waffle_house/",
        "text": "[removed]",
        "created_utc": 1513590882,
        "upvote_ratio": ""
    },
    {
        "title": "It's amazing what a little chocolate can do",
        "author": "w0nd3rk",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7kerlm/its_amazing_what_a_little_chocolate_can_do/",
        "text": "[removed]",
        "created_utc": 1513529118,
        "upvote_ratio": ""
    },
    {
        "title": "Nail Salon Nightmare",
        "author": "DonutHoles1",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7k7kx4/nail_salon_nightmare/",
        "text": "\nI go to a new nail salon with a friend that is in a very wealthy part of town.  We were walk-ins so we waited just a few minutes to get started— I immediately overheard my future nail artist, “Eddie”, tell the lady before me “it’s all about the buffing” as he buffed her nails for an awkwardly long period of time.  Fast forward— it’s my turn. \n\nEddie takes a quick smoke break and heads back in.  They are my natural nails covered in a hardening powder— I had slightly broken one which typically they add a tip so make them even with the rest.  Skipping to some key points during my experience:\n\n-while soaking all my nails together in a teensy container of acetone (the size of a small side condiment silver cup) he jammed the tops of the nail polish containers with the brushes into the same teensy cup.  My fingers were as closely jammed as you can imagine now with other polish polluting my soak. \n\n-After watching him do my nails I came to discover he had a very obvious crack nail and dirt under his others\n\n-To dispose of the acetone he made a swift exit and threw it in the bush outside\n\n-(my favorite) he didn’t place a tip on my thumb he just said “this one will just be short and square”.  The rest of my nails were long and semi pointed. \n\nA few other awkward happenings including redoing a few of my nails because he used the wrong powder, and my friend was done way before me.  The owner came out to chat as it was the end of the day, he arrogantly discussed all his business ventures along with specific dollar amounts to rent and what he made.  His hand kept ending up in his lap and he continued to wipe the corner of his mouth with his hand.  \n\nFinally a little two hours later (this usually takes about 45-60 min) we were done and they blocked the door to put ourselves on the phone texting list for coupons. Clearly fake numbers for the win.  \n\nI know I should have left after strike one but I think I was just shocked and hoping things would improve... lesson learned. \n\nTL;DR:  Very dirty employee does my nails and I endure it for a little over 2 hours. Tacky and creepy owner hammers it home with ending conversation and door block. ",
        "created_utc": 1513438346,
        "upvote_ratio": ""
    },
    {
        "title": "Someone will buy it... 🤔",
        "author": "kittykabooom",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7k6jzs/someone_will_buy_it/",
        "text": "CS - customer service person, NCS - not customer service person\n\nToday I bought a big bag of a fairly pricy baking ingredient at a supermarket that is not local to me.\n\n\nI got it home, opened it up to get my bake on and was hit by a weird smell. I thought maybe I was just unaccustomed to this ingredient, but I Googled, and apparently if the ingredient smelt this way, it was rancid. Also my olfactorily-challenged husband could smell that this product was not normal, so that was a good indication that it needed to go back to the store.\n\n\nSo back to the shops I went. \n\n\nI got there, explained what was happening, and CS said I could swap over the product for another one.\n\n\nI grabbed my new packet, and just in case, I asked if I could open the new packet to check if it was OK. It smelt worse than the first, so I asked for a third packet.\n\n\nI commented that it looked like I’d ripped through half their stock and apologised, because it was an expensive product - if it was cheaper, I would not have bothered driving back to swap it.\n\n\nNCS replied that they’d stick a Reduced To Clear sticker on it because someone would buy it.\n\n\nI hope she was joking, but I’m not sure she was 🤨\n\n\nTL;DR: Returned a rancid food item to the supermarket. Employee stated that they’d resell it because someone would want it.\n",
        "created_utc": 1513423598,
        "upvote_ratio": ""
    },
    {
        "title": "Cashier has never heard of sparkling cider",
        "author": "LokiOfSassgaard",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7k4zxr/cashier_has_never_heard_of_sparkling_cider/",
        "text": "Scene: Las Vegas, husband working nights at one of the casinos, and having no job of my own, am usually up all night as well.  Around 3am, I'm sitting around the apartment bored, and realise there's nothing to drink.  I put on my shoes and grab $5, electing to leave my wallet at home since there's a large 24 hour grocery store right across the street.  I have my keys, my phone, and enough cash to buy something to drink.\n\nOnce inside, I decide on a bottle of well-known apple cider.  For those not from the US, it's sparkling apple cider in a big, green glass bottle.  It's often used as a champaign substitute at all-ages events, but is also just generally tasty stuff.  It's just carbonated apple juice - not cider like you'd get in a pub.  It's extremely popular and well-known for being just fancy apple juice.  It's also within my budget, so I grab a bottle and take it up to the register.  Cashier rings it up, and I go to hand her my cash.\n\nCashier: I need to see your ID.\n\nMe (surprised): Why?\n\nC: I need to see your ID.  It's an alcoholic purchase.\n\nMe: No?  What?\n\nI have bought this stuff dozens of times with no requests for an ID.  I point at the bottle.\n\nMe: It says right there, \"contains no alcohol.\"\n\nThe bottle, in large gold letters, does indeed say CONTAINS NO ALCOHOL.  In all caps.  Quite plainly right on the front of the label.  Because it is literally just apple juice and carbonation.\n\nC: I need your ID.\n\nMe: I don't have it.  Never mind.\n\nAt this point, I'm ready to just leave, since this woman is clearly having a bad night and I've been caught in the crossfire.  Instead, she decides to call the manager over to determine whether or not to call the cops.  Manager gets there pretty quickly, at least, since there's nobody else in the store.\n\nManager asks what the problem is.\n\nC: This kid's trying to buy wine.\n\nManager looks at the bottle on the belt, and then looks around the counter.\n\nManager: Where'd you put it?\n\nC: Right there.  (Pointing at the cider)\n\nMe: I'm going home.\n\nThe manager quickly aplogised and finished ringing me up.  I left so angry, I didn't even really enjoy my drink after that.",
        "created_utc": 1513397773,
        "upvote_ratio": ""
    },
    {
        "title": "World of Wally Poor Online Customer Service (mostly just a vent)",
        "author": "SirPuffengruntz",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7k4k0s/world_of_wally_poor_online_customer_service/",
        "text": "[removed]",
        "created_utc": 1513392193,
        "upvote_ratio": ""
    },
    {
        "title": "Overdraft caused by bank's own fees",
        "author": "razzmatazz1828",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7k2mzb/overdraft_caused_by_banks_own_fees/",
        "text": "[removed]",
        "created_utc": 1513372123,
        "upvote_ratio": ""
    },
    {
        "title": "Fabory Group is looking for a Customer Service Representative in Wednesbury, UK",
        "author": "AgnesMagnusson",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jyxcn/fabory_group_is_looking_for_a_customer_service/",
        "text": "[removed]",
        "created_utc": 1513334006,
        "upvote_ratio": ""
    },
    {
        "title": "I was robbed right in front of the police.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jyvgf/i_was_robbed_right_in_front_of_the_police/",
        "text": "[deleted]",
        "created_utc": 1513333180,
        "upvote_ratio": ""
    },
    {
        "title": "Fabory Group is looking for a #CustomerService Representative in Wednesbury, UK",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jyuci/fabory_group_is_looking_for_a_customerservice/",
        "text": "[removed]",
        "created_utc": 1513332720,
        "upvote_ratio": ""
    },
    {
        "title": "Way to sell it to me",
        "author": "redimp89",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jwpz1/way_to_sell_it_to_me/",
        "text": "We get a lot of telemarketer calls and my bosses are so sick of it that we all have permission to tell them that we aren't interested. Usually no problem, they hang up and call back again the next day in a Sisyphean cycle that makes me glad I don't work phone service anymore.\n\nThen there's today, with a gentleman we'll call Rude Dude\n\n&gt;Redimp: Name of Business, how can I help you?\n\n&gt;RD: Hello, can I speak to the person in charge of the merchant services account?\n\n&gt;Redimp: Do you have the name of the account holder, and do we have an account with you?\n\n&gt;RD: No, I am a broker for merchant services. Could I speak to the person in charge of the account?\n\n&gt;Redimp: We are very happy with our merchant services, please take us off your list, thank you. *for at least the 5th time this week, it's ridiculous*\n\n&gt;RD: **No**, I am not a salesman I am a **broker** and if you understood English you'd get that! \n\n&gt;Redimp:...\n\n&gt;Redimp: *best chirpy voice* Could I speak to your manager, please?\n\n&gt;RD: That's not even... *click*\n\nI've rolled my eyes a bit or repeated myself somewhat snarkily when customers as the same question repeatedly without paying attention, but that was just... something else.\n\nedit for formatting",
        "created_utc": 1513304521,
        "upvote_ratio": ""
    },
    {
        "title": "Best Amazon customer service!",
        "author": "averyfollett",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jv9ib/best_amazon_customer_service/",
        "text": "[removed]",
        "created_utc": 1513290357,
        "upvote_ratio": ""
    },
    {
        "title": "Hotel scammed me",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7js4cx/hotel_scammed_me/",
        "text": "[deleted]",
        "created_utc": 1513263931,
        "upvote_ratio": ""
    },
    {
        "title": "More cupcakes. More frosting. More service.",
        "author": "RhinoBarbarian",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jrp15/more_cupcakes_more_frosting_more_service/",
        "text": "The other day, my wife got a new job. To celebrate, I went to her favorite bakery to pick up some cupcakes. I arrived about 45 minutes before close. There were only three or four staff members - most of whom were doing cleanup - plus a manager left.\n\nRude customer=RC. Employee=E. Manger=M.\n\n&gt;RC(As soon as the customer in front of her is finished without even waiting to be greeted or how she can be helped): I would like two of those chocolate cupcakes.\n\n&gt;E: Of course. *E grabs a small, plastic container designed to hold two cupcakes*\n\n&gt;RC: Umm...that isn't big enough. I want more than two.\n\n&gt;E: I'm sorry, ma'am. I didn't know that.\n\n&gt;RC: Well, you didn't ask. You should have asked.\n\n&gt;E(Obviously fake retail smile plastered on her face): Well, how many would you like?\n\n&gt;RC: Six. Now was that so hard?\n\nAfter choosing her other four cupcakes, RC drops this...\n\n&gt;RC: There isn't much frosting on these. Can I get more?\n\n&gt;E: Well, we do sell 'Frosting Shots'* for 50 cents each. Would you like a few of those?\n\n&gt;RC: No, I want it **ON THE CUPCAKES!**\n\nShe said the last part as if she were talking to a complete idiot, emphasizing each syllable and punctuating it with finger points.\n\n&gt;E: I'm sorry, ma'am. We only have the 'Frosting Shots' available so close to closing-\n\n&gt;RC: Get your manager!\n\nE stepped into the back and brought the manager out to talk to RC.\n\n&gt;M: May I help you, ma'am?\n\n&gt;RC: E refuses to help me! She was rude and didn't even greet me!\n\nAt this point, E waved me over to a different part of the store to find out what I wanted.\n\n&gt;RC(To E): What are you doing?! I was here first!\n\n&gt;M: I am helping you now, ma'am. E is helping that man now.\n\n&gt;RC: I was here first! You should both be helping me!\n\n&gt;M: I am helping you now, ma'am. E, please take that man's order.\n\nI gave my order, paid, and left. RC was still inside arguing. Some people...\n\n*Shot glass sized plastic containers filled with frosting.",
        "created_utc": 1513259646,
        "upvote_ratio": ""
    },
    {
        "title": "The Taco 500",
        "author": "darkzama",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jqry5/the_taco_500/",
        "text": "FTP to this or any reddit so please be patient with me. \n\nBackground:\nI work in a large building with many different people. We work round the clock and dont have much down time. It's to the point where we send one person to pick up food and eat at our desks.\n\n\nMe: me\n\nSL: Service lady\n\nStory:\nSo we decided on a food run (again) to a popular fast food taco place with a giant red bell logo! I was eager to do this run because I am a glutton for punishment (this is important partly because of the food type, but also for reasons that will be explained!) and quickly got a list together! Now I'd done this run many a times before with anywhere from 10-20 different orders and never had a problem until this day. I pull up to the drive through and this is the exchange that was had.\n\n\nSL: hello, welcome to (taco place) order when you're ready.\n\nM: Yes, hello! I've actually got 16 orders to place.\n\nSL: Oh... uhm... give me a second.\n\nM: No problem, take your time!\n\nA Few minutes passed by and she chimes back in.\n\nSL: So, Uhm we can't take all 16 orders. Policy allows only two at a time.\n\nM: Err.. wait.. but I come here quite often and I've never had less than 10, but average about 15... and they take them ever time.\n\nSL: I don't believe you. Policy states that we can't do that.\n\n\nNow, I'm the kind of person that's not going to let everyone down! Like I said I'm a glutton for punishment, so I do the only punishing thing I can think of.\n\n\nM: Okay, I'll do two orders then.\n\nI place my two orders, go up and pay... all is normal and do 3 left turns and am back in the drive through.\n\nSL: Welcome to (taco place) order when you're ready.\n\nM: I've got two orders.\n\nSL: Uhh aren't you the same guy that just ordered two orders?\n\nM: Yes ma'am and I'll place all 16 two at a time. People will eat tonight\n\nThe SL then gave me the most frustrated sounding \"go ahead\" I've ever heard and I DID proceed to go through the drive through the 8 times it took.\n\n\nThese people were working fast food at midnight.. there wasn't anyone coming through the drive through and they were likely working an 8 hour shift... yet can't be bothered to do their job without getting upset? This instance lead us to create an event we call the TB 500 where you can train to be a professional Racsan Driver.\n\nEdit: formatting",
        "created_utc": 1513247293,
        "upvote_ratio": ""
    },
    {
        "title": "\"I can see all the content in the ebook.\" €™What, all one sentence of it?€™",
        "author": "The_White_Crane",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jqmh0/i_can_see_all_the_content_in_the_ebook_what_all/",
        "text": "So I recently bought an ebook from \"Oboe\". And upon reading it, I discovered that the file was borked; the punctuation was mangled and most of the text was missing.\nI contact their customer service via the chat widget, and... well, here's a transcript.\n\n&gt;Oboe: Thank you for contacting Oboe Customer Care.\n\n&gt;Me: Good morning.\n\n&gt;Oboe: May I address you by your first name?\n\n&gt;Me: As you like.\n\n&gt;Oboe: Thank you $name, how are you?\n\n&gt;Me: Look, I know you've got a script but could we get to the point please?\n\n&gt;Me: I assume you have the information I entered into your webform.\n\n&gt;Oboe: Yes, sorry.  I can see in your submit there is a problem with both your desktop and th reader.\n\n&gt;Oboe: What is it exactly?\n\n&gt;Me: The book does not appear to actually be complete.\n\n&gt;Me: I attached the file in question.\n\n&gt;Me: But whatever you open it in, only a paragraph or so of any chapter will display,\n\n&gt;Oboe: I am not able to see the attachment.\n\n&gt;Oboe: Okay.\n\n&gt;Me: And when I tried to redownload it, it appears to have been removed from your store.\n\n&gt;Oboe: Which is the title?\n\n&gt;Me: \"Trout Waxing\" by Mike Hogg\n\n&gt;Oboe: Thank you.\n\n&gt;Oboe: Allow me a minute to review your purchase history.\n\n&gt;Oboe: Indeed the book is in your library, I have updated the information, can you try to re download it again?\n\n*I'm already suspicious at this point, because what information have they updated which will fix the fact that the book is actually incomplete? But I try, because lying to support is always a fool's move.*\n\n&gt;Me: One moment.\n\n&gt;Oboe: thank you\n\n&gt;Me: No, the file is identical, and suffers from the same problem.\n\n&gt;Oboe: Okay.\n\n&gt;Oboe: Can you let me know in which device are you trying to download the eBook?\n\n&gt;Me: This time I was using a PC, but that's not the issue. The problem is that the book file is literally incomplete.\n\n&gt;Me: It doesn't matter what reader I -- or anyone else for that matter -- uses, because the text is actually missing from the file.\n\n&gt;Oboe: I understand you.\n\n&gt;Oboe: Allow me just a minute please.\n\n&gt;Me: If you need a comparison point, Big River have the same title: [link]\n\n&gt;Oboe: Okay\n\n&gt;Me: and if you look inside the preview, you can see what should be contained in the prologue.\n\n*At this point, a brief look will very clearly show that the first chapter is... well, a chapter. Rather than a single sentence with all the quotation marks displayed as €™*\n\n&gt;Oboe: Yes.\n\n&gt;Me: Then look in the book file you are hosting, and you will see  it is missing the text.\n\n&gt;Oboe: I see.\n\n&gt;Oboe: Let me go ahead and check for the comparison\n\n&gt;Oboe: I have reviewed your eBook in the Oboe Desktop App for computers and I see all of the content. Some times when you download the eBooks they may appear incomplete because they had an issue during the download.\n\n&gt;Oboe: Can you let me know if you have the Oboe Destkop App\n\n&gt;Oboe: ?\n\n&gt;Me: I do not.\n\n&gt;Me: I have an Aura One, though.\n\n&gt;Oboe: Okay\n\n&gt;Me: And it appears incomplete on that.\n\n&gt;Oboe: I see.\n\n&gt;Me: And the file you just had me redownload is byte for byte identical to the first broken one.\n\n&gt;Oboe: I understand.\n\n&gt;Oboe: Can you erase the eBook from the Aura One and download it back again, please?\n\n*And now I'm convinced that they aren't actually listening to me and are just running through the steps they're given for helping idiots.*\n\n&gt;Me: Could you please send me a screenshot of what the book looks like in the desktop app for you?\n\n&gt;Me: I'm sorry, but I'm actually not convinced you can possibly be seeing all the content, unless you literally have a different file to the one that I get when I download.\n\n&gt;Oboe: I am not able to send it here in the chat but I can send it via email.\n\n&gt;Me: If you please.\n\n&gt;Oboe: Sure, no problem.\n\n&gt;Me: Just a picture of the first page of the prologue or chapter 1.\n\n&gt;Oboe: Okay, allow me a minute please.\n\n&gt;Me: Sure.\n\n&gt;Oboe: Thank you.\n\n&gt;Oboe: $name I have sent you the email.\n\n&gt;Me: Thank you.\n\n&gt;Oboe: Can you let me know if you see the exact thing in your book?\n\n&gt;Oboe: You're welcome.\n\n*I check their images. Chapter one is a single sentence where the quotation marks are displayed as €™.*\n\n&gt;Me: Yes, that is what I see.\n\n&gt;Me: That is not what should be there.\n\n&gt;Oboe: Ohh I see.\n\n&gt;Me: From Big River, the first chapter:\n\n&gt;Me: Is more than a single sentence long.\n\n&gt;Oboe: I understand you.\n\n*I attach a screenshot of the Big River preview.*\n\n&gt;File attachment upload has started.\n\n&gt;The file Ch1.PNG (161.37KB) was received.\n\n&gt;Me: See this.\n\n&gt;Oboe: Let me check it.\n\n&gt;Me: Your copy  contains only a single sentence.\n\n&gt;Oboe: Yes.\n\n&gt;Me: And broken punctuation.\n\n&gt;Oboe: Yes, I can see it.\n\n&gt;Me: So can you get a copy of the book which is actually complete?\n\n&gt;Oboe: Unfortunately I am not able to provide you a different format as the book has been removed from the Oboe store.\n\n*Yes, I know it's been removed from the store. I told you as much right at the beginning of this whole debacle.*\n\n&gt;Me: Then I would like a refund, if you please.\n\n&gt;Oboe: Allow me a minute to check a solution for you.\n\n&gt;Oboe: Thank you for your patience, $name. I will escalate this issue to our refunds department for you to get the best resolution, it may take a little while for them to process the incident.\n\n&gt;Oboe: Or I could get you the amount of the eBook as store credit for you to buy any other title you would like.\n\n&gt;Me: No, thank you. I will buy a copy of this book from Big River, who have one which is not broken.\n\n&gt;Oboe: I will also report this eBook as a bad format in our system\n\n&gt;Me: I would just like the money refunded so I can do that.\n\n&gt;Oboe: I totally understand you.\n\n&gt;Me: Thank you.\n\n&gt;Oboe: Okay, I have escalated this, you will receive an email notifying when this charge is reversed and in your PayPal account.\n\n&gt;Me: Much obliged.\n\n&gt;Oboe: Is there any other thing I can do for you?\n\n&gt;Me: No, thank you for your time.\n\n&gt;Oboe: Thank you for contacting Oboe, I hope you have a nice day\n\n\nI mean, it could have been a lot worse; they did give me a refund. But the whole thing would have wasted a lot less of my time if they'd actually fucking looked at the Big River preview for a comparison when I first told them to, rather than assuming that I was an idiot.",
        "created_utc": 1513244868,
        "upvote_ratio": ""
    },
    {
        "title": "Is the link safe to click on?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jptck/is_the_link_safe_to_click_on/",
        "text": "[deleted]",
        "created_utc": 1513232587,
        "upvote_ratio": ""
    },
    {
        "title": "Basking in the glow.",
        "author": "SammichDude",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jplk8/basking_in_the_glow/",
        "text": "10 PM. Haven’t had supper yet and I'm feeling like some of my favorite almost fast food Mexican food drive through. I'm in my jammies and house-shoes. It’s not far, so I go there and get in the drive through behind another car who seems like he cant make up his mind. No problem for me- I'm in no hurry and I already know what I want. Two soft chicken tacos and a big piece of their amazing chocolate cake. Yum!\n\nMy turn! As soon as I pull up the speaker guy says “Be right with you.” Immediately comes back and says “Just to let you know, sir- we don't have any beef fajitas and we’re out of shredded beef.” No sweat. So I order. “May I have two soft chicken tacos and a big piece of chocolate cake?” “Yes Sir but I'm not going to charge you for the cake ($4.00) because we’re out of ground beef.” OK with me! Free Cake!! \n\nSo I pull up and he greets me and I hand him my card and he hands me my bag. Look in the bag and I say “Hot sauce?” nicely. He grins, hands me my card back, hands me my two hot sauces and says “I'm not gonna charge you for this, You have a nice night, now.” Cool! “Thank you very much, Sir!!”\nI drive away- basking in the glow. Of free food for no reason except that he was a nice guy. And I guess I was too. Love that place! This really just happened an hour ago. ",
        "created_utc": 1513229781,
        "upvote_ratio": ""
    },
    {
        "title": "“I don’t want to be that lady in a nail salon...”",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7joo4p/i_dont_want_to_be_that_lady_in_a_nail_salon/",
        "text": "[deleted]",
        "created_utc": 1513219617,
        "upvote_ratio": ""
    },
    {
        "title": "Angry Woman Doesn't Understand Lines or Transactions",
        "author": "runningkraken",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jnuvp/angry_woman_doesnt_understand_lines_or/",
        "text": "So this just happened a few hours ago, and I'm still a bit mad about it. I stopped by a dollar store on my way home from work to pick up a few things to make a dessert for an office holiday party tomorrow. \n\nI used one of the store's hand baskets to carry my three items to the front and after I put them down, I quickly walked the five whole steps it takes to the basket holder to put it back as the cashier rang up my items.\n\nI walk back and am nearly run over by this old woman carrying a few things in her hands. She sets them down on the counter, and I don't care- my stuff is already mostly in the bags. But the lady looks at me and was like, \"I was here first!\"\n\nI pointed at the items in the bags and politely said, \"Those are my things. I just dropped the basket back off over there.\" During this time, I'm getting my card out to pay. The old woman doesn't seem to care. \"You got out of line, so it's my turn!\" \n\nThe cashier jumped in then and was like, \"Ma'am, I already have her items in the bags. She just has to pay...\" And I just go ahead and shove my card in the chip reader to hurry up and pay. The woman just keeps on going about how unfair it is that people who cut get to go first and whatnot.\n\nI hurried up with the transaction and apologized to the cashier as I grabbed my one bag of stuff and headed out. Not sure why this woman thought that it'd be faster/better to void out my transaction, remove my items, and then make me get behind her to check out.",
        "created_utc": 1513211396,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone could hear the sarcasm and condescension",
        "author": "empressfelicia",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jnhib/anyone_could_hear_the_sarcasm_and_condescension/",
        "text": "Hello r/TalesFromTheCustomer. Sorry for any formatting errors. \n\nThis is about a phone call to a used-book store.\n\nSo this was around the beginning of October, when classes started and I was urgently looking for the required textbooks. I didn't want to pay a huge fortune, renting would've been a small fortune, so I decided to see if any used book stores had them.\n\nI called a particular one, which I wall call uhhh... Quarter Price Books. So I couldn't just look up on their website what books they had, no matter how I navigated it, so I decided to call.\n\nI'm kind of still shocked about the person who answered because the sarcasm and condescension could be heard over the phone. Here's how the conversation went down. PG for Phone Guy\n\n&gt;PG: This is Quarter Price Books.\n\n&gt;Me: Hi, so I wanted to check if you had this specific textbook in stock.\n\n&gt;PG: Okay, do you have the title or ISBN (the serial number of the book)\n\n&gt;Me: I have the ISBN. Are you ready for the number?\n\n&gt;PG: (think of the most condescending way someone could say this) UHMMM YEAH\n\nNow I asked if he was ready for the number just in case he wasn't ready to type it ie if the computer wasn't on the right program or if he was occupied and had to finish that one first.\n\nAnyways, I tell him the number. He abruptly puts me on hold.\n\n&gt;PG: (still condescending and sarcastic) No, we DON'T have that book in stock and the closest one will be in ILLINOIS (FYI the State this took place in was in Washington)\n\n&gt;Me: Okay, thanks for checking. Have a good day.\n\n",
        "created_utc": 1513208260,
        "upvote_ratio": ""
    },
    {
        "title": "\"LOL we don't carry HEMP milk!! We're a *FAMILY* store!\"",
        "author": "lizzyb187",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jn6we/lol_we_dont_carry_hemp_milk_were_a_family_store/",
        "text": "I just discovered this subreddit and I immediately thought of this funny little story of utter stupidity.. This happened a few years ago at a large well known store in the USA. This store carries some groceries but mostly other things. I wanted to see if they had hemp milk because it's so much tastier than soy. I asked a guy working there and he makes this big loud fuss *laughing* at me and my boyfriend like \"LOL this is a *FAMILY* store lolol we don't carry anything like *that*!!!\" And he says some things about not promoting drug culture or something like that so my boyfriend points out \"But you sell Breaking Bad merchandise which promotes METH and you sell Cheech and Chong merchandise that promotes WEED.\" And the guy is just speechless and we walk away laughing at the guy...",
        "created_utc": 1513205854,
        "upvote_ratio": ""
    },
    {
        "title": "All over a toy mic stand",
        "author": "rock824",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jkqk3/all_over_a_toy_mic_stand/",
        "text": "[removed]",
        "created_utc": 1513185557,
        "upvote_ratio": ""
    },
    {
        "title": "20 Freaking Minutes",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jhl5q/20_freaking_minutes/",
        "text": "[deleted]",
        "created_utc": 1513148884,
        "upvote_ratio": ""
    },
    {
        "title": "When $0.52 in change became $0.06... somehow...",
        "author": "PlentifulMoonbeam",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jhgcq/when_052_in_change_became_006_somehow/",
        "text": "One day, my boyfriend and I went to a local version of namebrandnaturalfoodstore. For whatever reason, the customer service is either decent or just very mediocre, which really bugs us since we work in retail/customer service. But this store's deli department is delicious so we put up with it.\n\nAfter being treated like just another ~~sheep~~ customer at the deli, we go to the register. I noticed that the cashier has a \"I'm new!\" nametag, so I was extra patient and hoped that management finally hired a person who could be friendly and helpful. She was very nice, and I feel bad for how hard I laughed at this incident afterward. \n\nI don't remember the exact amount of our total, but it ended with 52 cents. For this story, we'll say it's $13.52.\n\nMy boyfriend hands the cashier a $20 bill. She pressed buttons and is about to hand us the change, $6.48. Then my boyfriend finds a couple pennies and hands them to her. She immediately freezes up and we could see the doubt and confusion in her face.\n\n...Then she breaks out the calculator. I'm thinking, \"okay, fine, not everyone can do quick math on the spot, she's new, she's probably nervous....\"\n\nSomehow, her calculations told her to give us *6 cents back.* I have pondered long and hard about how she got to 0.06. I still don't know. \n\nWe stood there for a second, wondering if we messed up *our* math. Then my boyfriend let her know quietly that he should be getting 50 cents back.\n\nShe said \"Oh! Yeah! You're right!! Uh, here you go!\" \n\nI don't think she really believed it in her heart but was just so nervous that she took our word, I guess. Again, we did laugh pretty hard after we left (mostly because of the 6 cents), but I do feel bad because she was new and nervous. I'm sure she's got the quick change thing down now. ",
        "created_utc": 1513147092,
        "upvote_ratio": ""
    },
    {
        "title": "We Didn’t Need Plates Anyway...",
        "author": "maebe_next_time",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7jgb59/we_didnt_need_plates_anyway/",
        "text": "The scene: a small country pub that is busy for dinner and caters to large functions.\n\nThe cast: my SO’s family of a dozen or so adults, who just want a steak and a beer.\n\nNothing especially bad happened, but my future sister in law (SL) and the manager (M) had an odd interaction about the serving of birthday cake.\n\nSL: I left a cake with you guys and we’d like to have it now, please.\n\nM: okay. \n\nSL:...\n\nM: would you like us to bring it out or would you like to serve it?\n\nSL: well... whatever’s easier I guess?\n\nM:...\n\nSL: just brings it out, please. \n\nA waiter brought the cake out and put it down amongst our dirty dishes and things. He eventually (after clearing other tables in the now empty dining area) cleared our table then vanished.\n\nHe didn’t re-emerge, so we ate the cake with our fingers. It was just very odd. No one was impolite and it wasn’t the end of the world, but it was like they didn’t know what to do with a birthday! ",
        "created_utc": 1513134573,
        "upvote_ratio": ""
    },
    {
        "title": "“But why not?”",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7j98yr/but_why_not/",
        "text": "[deleted]",
        "created_utc": 1513065601,
        "upvote_ratio": ""
    },
    {
        "title": "SPELL YOUR NAME!!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7j74a2/spell_your_name/",
        "text": "[deleted]",
        "created_utc": 1513042200,
        "upvote_ratio": ""
    },
    {
        "title": "The One where Holiday Butter Cookies Made Her Smile",
        "author": "BlackwoodBear79",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7j6ybs/the_one_where_holiday_butter_cookies_made_her/",
        "text": "My wife has had a hankering for those Danish butter cookies that only come out around the Holidays.\n\nI went into one of those furniture furnace and further stores to try to find some (because grocery stores, department stores, and big-box stores have been a bust).\n\nThey had dozens upon dozens so I grabbed two two-pound cans.\n\nI got in line.  The few folks in front of me were running the poor young woman ragged with all kinds of bizarre requests or \"no I don't want that, no, I changed my mind, give it back\" sorts of things.\n\nWhen I got to the register, the young lady on the other side of the counter looked rather surprised that was all I'd selected.\n\n**Cashier**:  Hi, will that be all for you today?\n\n**Me**:  Yes indeedy, I've had a lot of trouble finding these.\n\n**Cashier**:  Really?  I'm shocked, we've had them since before Thanksgiving\n\n**Me**:  I'll be honest, this is usually the last place I want to come, there are usually perfumy scents that give me migraines\n\n**Cashier**:  Well I'm glad you found them!  \n\n**Me**:  Me too!  I miss when they used to come in the double-sized four pound cans.\n\n**Cashier**:  Yeah, not anymore!  When I was a little girl, at my grandma's, I would always eat the sugar-coated pretzels before anyone else showed up.  I'd eat all of them from the can.  I'd always get yelled at, but she'd never take them away.\n\n**Me**:  I'd always eat the swirl ones first - with the holes - because I liked those least.  Save the better ones for later.\n\nShe laughed.\n\n**Me**:  Didn't always work out that way.  Sometimes people would save me those, thinking I liked them better, or would eat the ones I was going after - the square ones - \n\n**Cashier**:  So you got stuck with ones that you hated?\n\n**Me**:  Oh, no, I didn't hate them, I liked them well enough to eat them!  I just wouldn't have normally picked them...\n\n**Cashier**:  *still laughing*  I can see why!  Anyway, your total is 21.38, do you have any coupons?\n\n**Me**:  No, I don't, I hadn't fully planned to come in here\n\n**Cashier**:  Oh, don't worry about it, for a fellow butter cookie lover, I'll give you a five-off-twenty coupon we sent out this week.\n\n**Me**:  Thank you, so very much!\n\n**Cashier**:  You're welcome.  Happy Holidays!\n\n**Me**:  You too!  ",
        "created_utc": 1513040605,
        "upvote_ratio": ""
    },
    {
        "title": "Me, my wife, our prematurely born daughter, and a cashier who clearly couldn't take the hint.",
        "author": "xProperlyBakedx",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7j6lis/me_my_wife_our_prematurely_born_daughter_and_a/",
        "text": "TL;DR - Cashier tries to touch our premie daughter after being asked twice not to, tries a 3rd time, and has her hand slapped by my wife like she was a kid with her hand caught in the cookie jar. \n\nThis was almost 6 years ago when our daughter was only a few weeks out of the NICU after being born more than 10 weeks early. She is now fine and doing great in Kindergarten.\n\nWhen we first brought her home she still needed a lung and heart monitor to make sure she was breathing properly. She was born in February, so most of the time we would keep her home due to the extreme Midwestern weather. But occasionally we'd want to take her out and feel like a normal family with a newborn. But, obviously additional precautions needed to be taken. \n\nWe had a [baby carrier cover to protect from the weather](https://images-na.ssl-images-amazon.com/images/I/41ulJcxZlFL._SY355_.jpg) but that gets quite warm so we started to use a [mosquito net](https://images-na.ssl-images-amazon.com/images/I/61eK-TYLczL._SY355_.jpg) in order to keep random strangers from just reaching in and touching her. This worked amazingly. It was important because she had a severely low immune system and any kittle bug could send her right back to the NICU. So this was a very big deal for us. \n\nWe started using this net because it was an issue with complete strangers just walking up and touching our newborn. **Not cool to do BTW**. And it mostly worked great, people could still see her and get all mushy over her, but couldn't easily get to her without us noticing.\n\nWell, this one particular day, we went to the grocery store to get a few items. All is going fine, mosquito net is working great. We go to self checkout so we can get finished quickly and get her home. The woman attending the self check out apparently notices that we have a newborn and wants to see her. No problem, peek through the net like everyone else, right? Nope, this woman thinks it's OK to just lift the net and rub her cheeks. This woman works with $ all day. Her hands have to be absolutely riddled with germs. We say politely, not to lift the net, and not to touch her as she has an immune disorder. The woman actually says *oh no, that's OK, I'm sure she'll be fine* and keeps reaching into the carrier. \n\nMy wife puts the net back down rather forcefully, and says, no it's not *OK* and please don't reach in there again. I was grabbing a soda from the \"last minute coolers\" at the register, when I hear what is very clearly skin to skin contact from a slap. \n\nApparently, the woman, went back to our daughter, while my wife was loading cash into the machine.y wife spotted her at the last second, and reached over and slapped the shit out of the woman's hand.\n\nNow, this woman was easily in her late 60s. My wife and I were a very young looking 27 at the time. She was just beside herself that someone had the nerve slap her hand. And actually started scolding my wife about being disrespectful to her *elders*. So, my wife says, let me speak to a manager *NOW!*. \n\nSuddenly a look of \"Oh shit, what have I done\" comes over this woman's face. As the manager is approaching, the cashier is being very apologetic and trying to calm the situation down now. My wife tells the manager what happened, and then told her about how the cashier responded. We didn't stick around for what was said to the woman, but we never saw her again. \n\nThe manager is now the GM at another location that we shop at now that we've moved, and she still remembers us, our daughter is always so excited to see her and talk to her about how things are going in school.\n\n\nEdit: For anyone interested in what my baby girl looks like, [here's a picture of her](https://i.redd.it/av2txq1m7j301.jpg)",
        "created_utc": 1513037308,
        "upvote_ratio": ""
    },
    {
        "title": "“Did you find everything you were looking for?”",
        "author": "serioussiracha",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7izwuk/did_you_find_everything_you_were_looking_for/",
        "text": "I went to my local grocery store today and was unable to find a particular coffee brand. When I reached the checkout line, I was asked if I found everything I was looking for. Out of habit I responded with a “yes” and then caught myself because I didn’t find everything I was looking for and wanted to be forthright with it. I’m not sure what I was hoping for, but her response was not helpful. My question was “have you heard of X brand?” and her response was “no”. \n\nOne would think that when that kind of question is asked, and the customer replies that they hadn’t found everything they had hoped, there would be some kind of response that might be helpful. My question is, is this just a polite question, or are staff trained to provide some feedback to the customer about what they can do about it. Like, what is the point of that question if that’s the kind of reply they give??\n\nIt wasn’t a upsetting interaction, just left me wondering what is the point?? \n\nEdit: More completely, what I said was, “no I didn’t find what I was looking for. Have you heard of coffee brand X?”",
        "created_utc": 1512967951,
        "upvote_ratio": ""
    },
    {
        "title": "Shoving carts won’t make me move",
        "author": "alyisdead",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7izpqt/shoving_carts_wont_make_me_move/",
        "text": "Im on my phone, I apologize for the formatting in advance. I had to get this out because it’s still pissing me off.\n\n\nI don’t really go out shopping because I have a really bad knee, so it’s hard for me to put weight on it, so walking in a store is a big deal and I have to have a cart to put my weight on it.\n\n\nAnyway, after shopping for my things, the lines are long, everyone is shoving past and cutting and yanking their kids along and I’m just trying to find a place in a check out so I can hurry and get back to the car. I find a register with a cashier, because I didn’t have the energy to do self check out, and rest my body on the handle bar of the cart. \n\n\nThere’s one woman in front of me with an empty cart, her things are on the belt, but she hasn’t moved her cart. I don’t mind, there’s another woman in front of her taking her sweet time. Then, another woman with her kids in the basket of her cart pulls up behind me. No less than 30 seconds this adult woman pushed her cart into me, I kind of thought she did it by accident, so I don’t say anything, it didn’t really bother me. A few seconds later she does it 3 more times rapidly and even more forceful, I turn around and asked her, very annoyed, “Excuse me, what are you doing?”\n\n\nI am a very shy person, I hate confrontation, I hate bothering people, I hate talking to people, I don’t make waves, I don’t snap at anyone unless I have to or my brain or mouth runs without me truly thinking. Me saying anything to this woman surprised me, I don’t want a confrontation, the words just came out.\n\n\n“You need to scoot up, you know! There’s room and you’re being rude!” She snaps at me, her 2 kids in the basket are snickering and her teenage daughter next to her looks mortified.\n\n\n“There’s a cart in front of me, I can’t scoot up. Plus, I have a bad knee, you don’t have to hit me, use your words!” Again, my annoyance and pain were high and I just let my mouth go, screw it, I just wanted to leave.\n\n\nThe woman scoffs at me, because she doesn’t believe me, saying, “Bad knee? That’s the excuse you kids use now? Your knee dont look so bad to me!”\n\n\nI was already too angry to continue and argue with this air-headed c-word that the line wasn’t moving, the woman at the counter was still paying or doing whatever and the woman directly in front of me was looking back at me, looking interested in me and this air-headed c-word. So, I put my weight on the my right knee, my good one and shoved back into her cart.\n\n\nI said this exactly because this c-word repeated it to an employee; “Move the F*** out of my way, you F***ing B****!” I shoved my cart and myself, hobbling like a Igor to self checkout. My adrenaline from shouting obscenities in public, for the first time ever, made hobbling and awkwardly scanning my own items a little better. The woman kept shouting about how I should be kicked out and banned and that she couldn’t believe a employee, I guess who was nearby, let me talk and “assault” her. I managed to checkout and leave before that woman and her kids.\n\n\nI don’t feel bad, except maybe shoving the cart because of her kids, but screw that lady.",
        "created_utc": 1512966220,
        "upvote_ratio": ""
    },
    {
        "title": "I Ate Mold",
        "author": "unorthodoxrhetoric",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ixgb9/i_ate_mold/",
        "text": "I've never posted here before, so please forgive any mistakes I may make.\n\nYesterday my SO took the kids out for a 'Dad's Day' so I had the opportunity to Christmas shop and have some alone time. \n\nI stopped at a family owned restaurant I had not been to before to grab some lunch. It was an hour after opening and there was only one other table in the restaurant. I ordered the crab and artichoke dip with a Caprese salad, and when it came I noticed that the Caprese salad didn't have any mozerella. It was plated lengthwise on a long plate, about 7 slices of Roma tomatoes topped with basil, basalmic, red onion, and parmesan so it was pretty obvious. \n\nI very kindly pointed it out to the waiter when he walked by (\"Excuse me, I think my salad is missing mozzarella\" with a smile), and he apologized and said that was silly and he would be right back. From my table I could see the kitchen and the chefs, and there was a middle aged guy looking a bit flustered so I thought maybe he was a new cook who was still learning the groove of things. No biggie. \n\nWhen the server returned he was apologetic and I said it was no problem it happens and asked if maybe they have a new cook. He laughed and said no, actually it was the owner who was on duty today, and after laughing back I jokingly told him to make sure he gave him grief for it and he assured me he already had. \n\nNow, the salad hadn't been remade but the sliced cheese had been placed on each tomato slice. Great! I was happy. I put a piece of cheese into my mouth while I browsed reddit and noticed it tasted a little off and wasn't as soft as fresh mozzarella normally is. \n\nI looked down and noticed large, and I mean half of the piece kind of large, green mold on EVERY SINGLE SLICE OF CHEESE. Not only that, but half of the cheese appeared to be smoked gouda rather than mozzarella and it was clear the guy making it had deliberately placed each piece mold side down.  \n\nWhat the holy hell. \n\nSo I very politely made eye contact with the waiter and he came over. I showed him the salad, flipped each piece of cheese over and said \"I know this isn't your fault whatsoever, but I think I'm done, can I please be done?\" gesturing to the dip also. \n\nThe poor guy was mortified, said absolutely, and took the plates back to the kitchen. He returned a minute later, fumbling all over himself with a $20 gift card. I told him it wasn't his fault at all, I used to work at a poorly run family place where I used to play 'What's moldy on the line today' when I came in for my shift. I asked him to at least bring me a check for my club soda so I could tip him and after protesting, did. I left the gift card and tipped the server $10 because I always over tip and I felt awful for him. \n\nBest part? About an hour later so I could process, I called back and ripped the owner a new asshole. He apologized and said he uses a kind of cheese that's a type of smoked gouda fresh  mozzarella mix and he didn't deliberately place the mold face down, he is just colorblind and couldn't see it. I called bullshit on both, told him he's not equipped to cook in his own restaurant, and called him a coward for not coming out and apologizing to me himself and letting his staff deal with his mess. I look young, so maybe he thought I wasn't worth the customer service.\n\nI'm still reeling. I ate a huge piece of mold and I'm not pleased. And aslo, I was in such grossed out shock I didn't take pictures of it so I can call him on it with a bad review. Ugh. ",
        "created_utc": 1512945421,
        "upvote_ratio": ""
    },
    {
        "title": "Dear young guy.",
        "author": "BoredsohereIam",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7iwbbf/dear_young_guy/",
        "text": "Went into the grocery store a few days ago and I ended up behind you in line. As the lady in front of you dug through her purse you were bouncing a random golf ball so I didn't think you were listening to the conversation at the register. \n\nThe lady at the checkout had her young daughter there and was frantically trying to dig out enough change to cover a small gingerbread house set. The daughter was visibly upset but was trying hard not to cry, the mother was beet red and kept looking back at the line apologetically. They walked away without the gingerbread set and you stepped up to the counter and asked the cashier something. \n\nShe smiled and scanned the gingerbread house, and you ran after the mother and daughter while she scanned the rest of your items. I think only me and the cashier caught on what you were doing, I'm pretty sure you purposely gave it to them as far away from other people as you could.\n\nI saw the mother and daughters smile, I saw you put back a few of your items to buy the gingerbread kit, I saw and I'm sorry I didn't say this to you. That was the nicest thing I've seen for a while. When I saw you at first bouncing that golf ball I mentally judged you all wrong. I though you were some punk, I would have bet you'd yell at the lady for taking too long over what you did. \n\nSo I'm sorry golf ball guy, and thank you for being a good human. ",
        "created_utc": 1512935925,
        "upvote_ratio": ""
    },
    {
        "title": "Jc Penney",
        "author": "DistinguishableTroy",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7iton2/jc_penney/",
        "text": "[removed]",
        "created_utc": 1512909269,
        "upvote_ratio": ""
    },
    {
        "title": "Be nice to your servers",
        "author": "lak_27",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7isc9i/be_nice_to_your_servers/",
        "text": "I’ve worked in food &amp; beverage (though I’ve never been an actual server who waits on tables) so I know shit happens that’s beyond the employees’ control sometimes. Knowing this I’m usually a nice customer when I go out.\n\nI think it was the Saturday after Thanksgiving and my family and I decided to go out to eat a casual chain restaurant where you’re usually in and out within an hour. My family and I were seated and we instantly notice the lack of servers. A table next to us actually warned us (very rudely) that we should expect to wait forever for service. At that moment we were deciding on whether or not to stay or go somewhere else to eat. Finally, a server came to our table and we decided to just wait since we were already there. My parents were a bit annoyed, but I made a point to say please and thank you and smile at our server.\nService was definitely very slow, but I kept being nice and respectful to the server. She ended up telling us that they were slow earlier and their manager sent a lot of people home early, and then they got a rush of customers. Having worked at a restaurant before I understood and empathized with her. \nOnce we were about done with our food and we were about to ask for the check, the manager and the server came out and thanked us for being the only table that was nice and patient the whole time. They then proceeded to offer us a free dessert just for having some decency and not being rude. I was shocked that simply not being rude and impatient during a situation that was out of the servers hands would earn us a free dessert. \n\nThe moral of the story isn’t to be nice so you get free food, but to just always be understanding and be nice to your servers! They’re usually not trying to make you wait on purpose and they can’t change some situations. Being nice will get you everywhere in life. ",
        "created_utc": 1512886520,
        "upvote_ratio": ""
    },
    {
        "title": "My pizza ordering shame.",
        "author": "drinkinThatHaterade",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7iqwt2/my_pizza_ordering_shame/",
        "text": "Never thought I'd be \"that customer\" after working in so many retail/fast-food places. So the first snowfall of the year is happening currently and I heard the roads were a bit slick so I didn't feel like driving the 1 mile to my nearest pizza joint. \n\nI finally figured out my password for my rewards account with them so I logged into the app and ordered a pizza with a drink to be sent to my apartment address which I had pre-saved already. It told me there was like an hour wait time and I almost called to cancel/change it to carryout so I could get my pizza faster but my laziness prevailed and I decided to wait.\n\nI got a call from my delivery driver who said I needed to come outside. I was confused as to why I needed to (I've never had to leave my apartment building before to get a pizza) but I said okay and put on my coat and boots and head outside. No pizza driver anywhere. Panic sets in.\n\nI pulled my phone out and redialed the number. No answer. I called again like 5 times. The dread sinks in. I quickly look at my email confirmation which conveniently doesn't list the address I told them to deliver to.\n\nI looked up the business phone number and call them, dreading the conversation that would follow. After being on hold for like 10 minutes a dude answers. I asked him what address I listed for delivery and he read off my OLD apartment address. I then explain the situation (frantically) and tell him my actual address. I get off the phone with him and about 2 minutes later I get the second wave of dread. \n\nI told him the wrong address. Again. Jesus Christ I'm a moron. At this point I realize I don't deserve pizza and start mournfully thinking about the cereal I have in my kitchen. I called the pizza place back again and preface my explanation with an apology and a declaration of how much of a fucking idiot I am. I got put on hold for awhile and when the guy came back he told me that the people at my old apartment took my pizza. He then told me they would remake my pizza and have it delivered the next round. The beautiful soul even offered to upsize it to a large, which I refused because it was 100% my fault and 0% their fault. I thanked him excessively.\n\nSo now I wait. My embarrassment and shame have dulled my hunger. I already tipped the driver with my card when I ordered, but she's definitely getting an extra tip.\n\nBe kind to your pizza workers. They have to deal with people like me.\n\nEdit: Different delivery driver came. Forgot my drink. I didn't mention it because I didn't want to recreate that spongebob episode.\n\nEdit2: Dude came back and brought me my drink after finding it in his car. Good man.",
        "created_utc": 1512869119,
        "upvote_ratio": ""
    },
    {
        "title": "how to deal with horrible customers",
        "author": "olivier24445",
        "url": "https://youtu.be/MHbDNrJFtDM",
        "text": "",
        "created_utc": 1512863183,
        "upvote_ratio": ""
    },
    {
        "title": "Sold an extended warranty that the salesman claimed would cover everything. Everything is subjective.",
        "author": "Tubbafett",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7imogk/sold_an_extended_warranty_that_the_salesman/",
        "text": "Bought a laptop, told the salesman I wasn't interested in the extended warranty. My wife was concerned about our kids wrecking it. The salesman pounced and said that if anything happened to the computer with the warranty, bring it to the help desk and if it wasn't easily repaired, get a new one off the shelf.  \nFour weeks later, I turn the computer on the desk and the screen gets a hairline crack, rendering the screen unreadable. Return to the store with receipt in hand and am informed that the warranty I purchased doesn't cover physical damages, contrary to the sales pitch we were given. \nWhat is my best course of action to get satisfaction? They would replace the computer if the damage was internal to the hardware.",
        "created_utc": 1512825524,
        "upvote_ratio": ""
    },
    {
        "title": "Cashier made my girlfriend cry",
        "author": "overcomplicate",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ik17q/cashier_made_my_girlfriend_cry/",
        "text": "Long length story here, happened a few weeks ago but I was reading stories on this sub today and knew this was perfect. \n\nSo some necessary backstory, I work from home and I’m a real introvert, there’s a gas station right across the street from my house and I go there to buy cigars 3-5 tines a week. My house and this gas station are probably my two most frequented locations, and I know the employees very well, many I consider friends. They are all great except for one cashier who is just maybe the worst lady I’ve ever met, our first interaction was me asking if she worked there and her saying “you see the K on my shirt ain’t ya?!” and that’s exactly how she is every day, must be exhausting to be that hateful. I would complain about her but knowing all the employees and managers I know it’s not the type of place to hold anyone to high standards, they probably wouldn’t even say anything to her. \n\nSo my girlfriend turned 18 on November 4th and on the 5th I was going to the gas station and excitedly told her ‘hey you want to make your first tobacco purchase?’. She was excited to use her adult power for the first time and when we pulled up we saw what cashier was working and she immediately wanted to back out. \n\nMy girlfriend is also very shy and has a lot of anxiety especially with strangers and said she couldn’t handle the woman being rude to her, I told her that’s ridiculous and she shouldn’t let the woman stop her from having an experience she was excited about. So I give her the exact change because I’ve made this purchase many times and send her in.\n\nI see the only other guy in the store with a ton of stuff to buy let’s her go first for what should be a quick sale and I think that’s nice of him, soon I see my girlfriend getting her ID tossed back at her and she comes back to the car holding back tears saying how embarrassed she is and said the woman called her ID obviously fake. I understand why the woman might question it because she looks young but who would fake an ID with a birthday the day before??? \n\nSo I go into the store with my girlfriend in tow and the kind man sees her trying to hide her tears and me looking angry and steps aside to let us in front again. The cashier sees me with her and an ‘oh shit’ look takes over her face because she knows me as a regular and realizes she fucked up, but it only last a second before she turns angry again and decides to double down. \n\nI showed her the ID and asked her to show me why she thought it was fake, she just grabbed it and said she would scan it and I pulled it back and said “no, show my why it’s ‘an obvious fake’.” She then points to the red box next to the photograph that says “under 21”  (my state TN has this on ID’s for people under 21, I guess to make it clear for liquor store clerks). \n\nSo I inform her you do not need to be 21 to buy cigarettes and she basically shouts that she knows and I just stare at her, she then says that real ID’s do not have this red warning. I’m only 20 so I tell her that my ID that she has seen many times has this same red box and it is very real. I then asked if anyone else was working and she said “no it’s just me it’s fine I’ll ring it up.” And then said it’s fine several more times even though no one was talking to her anymore.\n\nI put the exact change on the counter, and told her  I was never coming back and if the other employees wondered about me she could tell them exactly why.  The other guy caught up with us in the parking lot to talk about how crazy it all was and I thanked him for being so nice. \n\n",
        "created_utc": 1512787041,
        "upvote_ratio": ""
    },
    {
        "title": "I just got thanked for not being an asshole.",
        "author": "MerryMisanthrope",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ih638/i_just_got_thanked_for_not_being_an_asshole/",
        "text": "Young girl asked for my ID, so I gave it to her. The state it's from looks kinda hokey, but she gave it back and reluctantly continued the sale. I told her that she could run the strip if it would make her more comfortable. She did and we were all set. \n\nAnother employee thanked me for not yelling at the person cashing me out. \n\nNOT BEING AN ASSHOLE SHOULD NOT BE THE STANDARD! It's the minimum.",
        "created_utc": 1512760060,
        "upvote_ratio": ""
    },
    {
        "title": "Stinky dentist",
        "author": "sparkleplentylikegma",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7if9jh/stinky_dentist/",
        "text": "There was a very small grocery store about ten minutes from my house that closed down and a couple years later a dental office moved in. I had been looking for a Dentist and was pleased that there was one so close so I made an appointment because I was having teeth issues. \n\nWhen I arrived I was overwhelmed with the smell of a “glade plug in”. It hit me like a ton of bricks and overwhelmed me. Which is odd because I have a terrible sense of smell. (I cannot stress this point enough) I can’t smell anything unless it’s really,really strong so this stuff must have been like a bath and body works factory! (Would have smelled better than the glade!!)\n\nI actually got nauseated sitting there smelling it. For hours afterward I could smell it in my hair and clothing. \n\nSo I had some dental work done that require 3 visits. Each time I wanted to barf smelling that smell.  I even commented how strong it was and nobody seemed to notice apparently. I’m like “really??” \n\nSo I had a free cleaning under the small insurance I needed to buy from them to cover my dental work. (I don’t have dental insurance.) So I went but braced myself for the smell. I swear it was worse. \n\nSo I said to the front desk: “hi, I’m sorry but the smell of your air freshener is overwhelming. Is there anything you can do about it?” \n\nFD: sorry, no. Why don’t you just sit on the other side of the room away from it. \n\nMe: umm that won’t work. It’s insanely powerful and is making me sick. \n\nFD: I’m sorry to hear that. \n\nMe: well I’m going to have to stand outside while I wait. I’m not certain I can come back here if the smell is going to be like this. I swear I’m having some sort of allergic reaction. (I should mention I had to wait at least 20 mins per visit for my appointment) \n\nFD: ok. \n\nMe: 😑😑😑\n\nFinally a  hygienist comes and gets me from outside and I get judgy stares from the FD.   \n\nI get my teeth cleaned and the hygienist apologized for my inconvenience. I say thanks and that if they can’t tone down the smell I can’t come back. \n\nFive minutes later the Dentist comes in to check out my teeth. She says “sorry to hear you won’t be coming back. Have a nice day”. \n\nI was dumbfounded. I walked out and saw them all staring at me like I caused this huge scene but I was polite and calm the whole time. \n\nSo I complained on social media to just my friends and several of my hygienist friends were flabbergasted. They would never let a patient go over a glade plug in. One said “we go out of our way to accommodate our patients even if that means adjusting the smell”. (I’d go to her but the office is almost an hour away from me. )\n\nI’m thinking they are trying to cover a smell up from when there used to be a grocery store in the building. I can’t imagine that they are insistent on having that strong smell for just winks and giggles. \n\nWith all the awesome products on the market I’m surprised they just use the fake floral scent like that as well. \n\nI’m just sorta shocked. What would you have done? ",
        "created_utc": 1512743083,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling robbed",
        "author": "Snozzberry123",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ic9lu/feeling_robbed/",
        "text": "My daughter received a Christmas gift in the mail from her grandparents. It was a hatchimal, which unfortunately, my daughter is terrified of (she’s 2. Be nice). I’m so thankful they purchased her such a nice toy but I knew beforehand that the toy scared her so I did not open the packaging or anything like that. The grandparent told me they bought it at a large, well known retailer and to take it back and exchange it for something she would like. \n\nSo anyways, I go to take it back and the lady working returns must have had a bad day because she was in a foul mood. I tell her that I have an item I would like to return for store credit. She rolls her eyes and asks for the receipt. I tell her I don’t have one because this was a gift. She sighs very loudly before processing the return. She doesn’t say anything else, just hands me a little merchandise card and receipt and motions for me to move along. \n\nI step aside to let the next customer come up and look at the receipt. It shows that I got a refund of $3.99 for the toy. If you’re not a parent you may have no idea what this is, but these toys are like $50 dollars. I had no clue why I only got four dollars for it. I asked and was told that they give you the lowest hidden cost in the last 90 days for returns that have no receipt. I asked if I could have my item back and I’ll give back the merchandise card and I was told no because my return is final but I’m welcome to go buy the item for the current advertised price of $64.99. \n\nI tried calling corporate who said the most they could do was send me a $5 gift card since I had a bad experience. Im so upset over this. I’m assuming there’s nothing else to be done over this. 😪",
        "created_utc": 1512705837,
        "upvote_ratio": ""
    },
    {
        "title": "A snide remark made by a loud gremlin at a professional hair supply store about my aunt and mom who doesn't speak English well because they asked about a sale",
        "author": "girlinschool",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7i9b7g/a_snide_remark_made_by_a_loud_gremlin_at_a/",
        "text": "We went to a hair supply store for licensed professionals. My aunt is using a relative's professional card to buy something there. Both my aunt and my mother do not speak English well. This, I think, contributed to what happened.\n\nThere were three people that worked there. It's a peculiar store. VERY casual with one extremely loud, and boisterous woman talking LOUDLY the entire time we were there and blocking the aisle with another customer. It was just uncomfortable. Like, how does someone, first of all, like to talk that much? Or that loudly?\n\nMy aunt got confused by the sales. Went to checkout, the price came out a lot more expensive than she had thought. I had to translate, and there were awkward moments because I'm a social nightmare.\n\nMy mother went and ask for clarification with another employee when she went back to see the prices again. I guess because my mom wasn't submissive enough for that loud thing that the worker got upset. The worker said loudly, \"the sales are for this color, this color, this color, etc.\" just went down the line of the colors slightly condescendingly from what I could hear. My mom is an assertive woman so if she had picked up on this person being upset with her, she'd get upset as well. Thank goodness she didn't notice. \n\nCash register malfunctioned. While the girl at the checkout was fixing the malfunctioned cash register and my aunt was fumbling around in her purse and talking to my mom, that loud gremlin asked as she passed by the checkout aisle: \n\n**Loud gremlin: \"What was the deal with the colors?\"**\n\n**Checkout girl: \"Oh, they wanted to switch colors.\"**\n\n**Loud gremlin: *something possibly insulting about us.* (didn't hear it, though)**\n\n**Checkout girl: \"Stop it!... You don't have to be like that.\"**\n\nIt was serious enough that the checkout girl looked at her angrily when she said that as if she jolted when she heard the remark. I wish I knew what was said but I didn't hear it.\n\n(Again, I want to reiterate that at this point, my aunt/mom was speaking to each other sort of loudly and definitely didn't pay attention and I was daydreaming hard because I just got finished with an exam and didn't sleep last night. We weren't paying attention, and when I sort of noticed that conversation was when I snapped out of my dozing.)\n\nThe snide remark was loud enough that if I wasn't daydreaming and if my aunt and mother wasn't speaking to each other, we'd hear it very clearly. The reason why I noticed she said something is because I was daydreaming WHILE looking at them. So even though I wasn't aware of what she said, I noticed the dynamics and I did hear what was said following that.\n\nShe was definitely purposely trying to have us hear her. But I missed it entirely and I was about to chime in to ask, \"What?\" but decided to let it go.\n\nWhen we left, she sang loudly \"Feliz Navidad\" (song was playing in the background) and looked at me as if she was excited we were leaving. I may be overthinking this part, though.\n\nThis trivial situation bummed me out. First, that I didn't speak up, although maybe my reaction was the best way to deal with it because I didn't really hear what she said and it's better that way I guess. I'm generally an easy going person who tends to take the route of pretending like I didn't hear someone if they're being rude to me. It's worked for me so far in my life, but a lot of times it's not completely satisfying because I'd like to also go wild on one of these mofos. There's only been a handful of times I've gone crazy on someone, and all of them were with family members who I'm not close to being rude to my mom (I have a dysfunctional family).\n\nMoving on, secondly, that my family has to go through crap like this and I think it has to do with them not speaking English well or being \"American enough\". Finally, it ruined my good day that gremlin.\n\nI didn't tell my mom or aunt about it because why bum them out? I rather carry their burden with me. It's better that they are blissfully unaware that a huge toe may have been insulting them.\n\nThe TL;DR is in the title.",
        "created_utc": 1512677793,
        "upvote_ratio": ""
    },
    {
        "title": "Meth Head Encounter?",
        "author": "robertr4836",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7i8wh3/meth_head_encounter/",
        "text": "IDK, I stopped to pick up a couple of things on my way home from work and the store is in the same building as a fast food place so I go to grab a burger to eat on the drive home.\n\nMid-20's white male is the only customer and as I approach it sounds like he was rung up for a value meal with a shake but he wanted a value meal with the coke and a shake in addition to.  Nope, he wants to know WHY he's paying full price for a shake when it should come with the meal.  Manager, cashier and another employee take a few minutes to convince him he is not paying full price for the shake but there is an up-charge because the shake costs more than the soda.\n\nOh, no...shake machine is down.  Not the guys fault but he states emphatically that he only came in for the shake and looks at the manager expectantly.\n\nI was just about to go around him, order my burger and tell him to take as much time as he needs with the shake conundrum when the manager realizes this guy is just going to stand there indefinitely and she starts telling him about blended fruit drinks.  He decides on a blended drink then we are back to why am I paying full price for the blended drink when I am getting the meal and it should come with a drink.  Back over that ground and he pays, YAY!\n\nBut no, he stays planted and immediately starts waving his receipt around saying he has been over charged.  Cashier and manager both go into round three of explaining that you have to pay more (manager rung it up both ways...eleven cents more to be exact) if you want to upgrade to a more expensive item.\n\nI'm done at this point so I step up next to the guy and tell the cashier, \"Can I please just have one hamburger to go and I swear I won't argue with you about how much it costs!\"  Guy mumbles an apology and slides down to order pick up to keep arguing with the manager over the price.\n\nHe gets his drink and food and I thought he must be waiting on something else since he is still standing there.  Just as I get my burger...nope, he wasn't waiting for anything (or on his phone or anything).  He has just spaced out and not realized he was done and could leave.  Finally grabs his things and walks away.\n\nFrom the time I set eyes on him to the time he left the guy was constantly twitching.  Not a nervous tick type of twitch, more like ants in the pants I need to keep my arms and legs moving even though I am not conscious of doing it kind of twitching.\n\nIDK, I'm not really familiar with people on drugs but between the twitching, the inability to understand simple concepts (he had a good vocabulary, didn't seem to be stupid or mentally retarded in any way) and being completely oblivious to social norms like stepping aside once you have paid to let the next person order and not needing to hang around for several minutes after you have been served and have all your items I was thinking maybe on meth?",
        "created_utc": 1512674455,
        "upvote_ratio": ""
    },
    {
        "title": "Showroom tries to scam us",
        "author": "showroomripoff",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7i7ufo/showroom_tries_to_scam_us/",
        "text": "[removed]",
        "created_utc": 1512666167,
        "upvote_ratio": ""
    },
    {
        "title": "I Ordered a $600 Coat From Wully. 32 Days Later, They are Lying to Me About Ever Shipping It.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7i75rq/i_ordered_a_600_coat_from_wully_32_days_later/",
        "text": "[removed]",
        "created_utc": 1512660424,
        "upvote_ratio": ""
    },
    {
        "title": "Don't accuse us of stealing because of faulty machines",
        "author": "TrillionNep",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7i6ha8/dont_accuse_us_of_stealing_because_of_faulty/",
        "text": "Some context: These are self-service machines which make a \"Beep\" sound whenever you scan them, then you need to put them on the side for it to weight.\n\nMe and my father (struggling with balance), went out sharp in the morning to avoid the busy queues and did some shopping. We went to the self checkouts and he put his bags on the weight side after pushing the respective button on the machine and then once that was done and he clicked done, he started scanning.\n\nI notice the machine wasn't making the normal beep sound when an item was scanned and I knew that might come back to be an issue and surprise surprise, it did. My father put one item in and then scanned the other one and because he didn't hear the beep, he thought it scanned but it didn't. \n\nWhen he put the item into the bag, the machine asked if he put in a bag (Despite doing so earlier? I don't get that) and he said yes to it only for the employee watching the self check outs come over and say that we shouldn't do that and took the item that we thought was scanned, wasn't scanned. During the rest of the transaction, he watched us like a hawk with a death glare.\n\nI probably should have said something to him since I could hear beeps from another machine but not from the one we were using. Needless to say, once me and my father were out with no issues, he lost his temper and said they had the audacity to call him a thief because their machines happened to be faulty.\n\nTLDR: Machine didn't make a beep sound and put up a bag prompt despite already putting bags on the side and that led to an issue with the employee basically accusing us of stealing due to their faulty machines.",
        "created_utc": 1512653604,
        "upvote_ratio": ""
    },
    {
        "title": "Hi Mr. Loss prevention.",
        "author": "Reset108",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7i6f80/hi_mr_loss_prevention/",
        "text": "Okay, so yesterday I'm getting my oil changed.  There's a dying big box store right next to the place, so I figure I'll walk around there for a few minutes and just browse.   \n\nWalk in and make a bee line for the movie section, figured I could kill time there easily.    As I'm browsing, I see a middle aged guy very obviously peer around a corner at me.  Okay, whatever, continue looking.   A few minutes later, he's there again.    \n\nAt this point I realize he's loss prevention and I've been profiled.  I've worked retail, I know how lose prevention works.   I decide to have a little fun with him and walk very fast to another section of the store.   A minute or two goes by and I round a corner to see him walking towards me.   He abruptly stops and pretends to look at something on the shelf there.   I walk past him, he looks at me, I stare him dead in the eye.   \n\nI decide to head over to the clothing section and sure enough, he's there within a minute, trying to pretend he's not watching me.    \n\nAfter about 20 minutes of this, I figure my car is done and I should leave.   As I'm walking back towards the front of the store, I pass him again and say \"have a nice day loss prevention dude\".  \n\nThe look on his face was great.   He must have thought he was so great at his job.   \n\n",
        "created_utc": 1512652970,
        "upvote_ratio": ""
    },
    {
        "title": "I love when workers stick up for themselves with shitty customers.",
        "author": "jenntasticxx",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7i3zv5/i_love_when_workers_stick_up_for_themselves_with/",
        "text": "I was eating at a local Chinese/Vietnamese restaurant with my parents one night when this table of people start complaining (after their meal was finished) about how the wife's meal was too spicy. The waitress offered to make her another, but noooo they had wanted to \"eat together\" and it wasn't acceptable that the wife would have to eat at home because everyone else was done with their food. \n\nSo first of all, if everyone had time to finish their food, why didn't you mention *at the beginning of your meal* that hers was too spicy? It does not take that long for them to make food and they could have brought out a new dish in 10 minutes or so. \n\nNext, the table seriously tried to leave without paying. For anything. One of the guy waiters yelled out \"hey, did you guys pay yet?!\" As they were trying to sneak out the door (while simultaneously causing a scene because they can't complain quietly of course). \n\nWhile they were paying the husband kept saying they were never coming back etc, etc and the waitress was like \"that is perfectly fine!\" in her cheeriest/sassy voice. \n\nThen they finally left and my parents and I paid and said everything was wonderful (because it was, yum!) and not too spicy (haha). \n\nBut seriously, why would you wait until the end of a meal to complain about it and then expect it to be refund or comped or whatever, without giving the restaurant the opportunity to correct it in the first place? They were severely lacking common sense. And on top of that, I actually ordered a spicy dish (and the wife did not) and it wasn't even that spicy. I doubt hers was at all...",
        "created_utc": 1512621222,
        "upvote_ratio": ""
    },
    {
        "title": "Am I an asshole?",
        "author": "redditnameforme",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7i3a9h/am_i_an_asshole/",
        "text": "Refrigerator is leaking so i call repair guy. He gets there and says that problem is what he thought it would be, and he had the part in his bag. He quotes me 250$. I said fine, but asked what the part was. He tells me and i look it up to find it all over, its a cheap 12$ part. I get angry and ask him why he told me a 12$ part was 250$ and he tells me thats for installation and everything. I ask him how long it would take and he said about 30 min. Im pretty angry at this point so i leave him to his work, but not for long. after a few minutes i ask him how much it would be for him to just stop all his work and leave. He said well i charge 70 $ just to show up, bla bla bla. ( His shop is 5min down the road tops). He eventually says something to the effect of what do you think i should charge you for this job, and that he would work with me on the price. I said 120$, he says that not fair at all, goes into some bullshit about what his overhead is. Finally he says he will do it for 190$ if i write him a good review. I think about it for about 2 seconds and say\" No, ill pay your asking price of 250$\" and i tell him to finish the job and i walk away. A few minutes later he asks why 250$ wasnt ok at the start and its fine now. I said because you asked me to write you a good review and i felt that was an attack on my integrity. Here is the KICKER. When he says he is done i go to pay him and he says \"no, i feel like you've put me in a no win situation here and im not going to charge you\". I look at him and say \" Im going to pay you\". He says \"no you're not\" and walks out the door. He fixed the refrigerator for free and left. I dont like getting scammed but just as much i dont like getting something im not owed, and i feel bad now because of that. I was never trying to get it free of charge, i just wanted a fair price and would of preferred to pay scam price instead of nothing. Thoughts?",
        "created_utc": 1512613851,
        "upvote_ratio": ""
    },
    {
        "title": "Cheated out of £300 by a certain popular auction site...",
        "author": "ReganMattel",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7i2byy/cheated_out_of_300_by_a_certain_popular_auction/",
        "text": "So, this happened earlier last month and I’ve been too irritated to do anything about it for weeks now. After hours of trying to get though to said popular site, hereforeafter referred to as PeeBay, I decided that my stress levels couldn’t handle it any more.\n\nSo, I had been asked by a family member who was less familiar with selling online than I was to sell off their old iPad. It was a 4th gen in it’s box, mint condition, never used. I decided to give PeeBay a shot, chucked it up for £300 O.N.O and expected to get offers around the £250 range. \n\nTo my surprise, it sold on a Saturday buy it now for the full asking price. So, I messaged the buyer thanking them and saying that I would be sending the item via courier with insured delivery on Monday, and they could expect the item on Tuesday. I withdrew the cash to my bank from Peebay’s well known payment affilliate, the one that says something about being your “pal” for paying things into my bank account. I then packed the iPad up, chucked a couple of bags of Haribo in there because I always like that when sellers make that little extra effort, and dutifully send it off. \n\nA few days later, I get a message from the buyer saying that the iPad won’t update and he wants a refund (I didn’t offer refunds in my listing, and the money had already gone to my family member anyway). Weird I thought, I checked it before I sent it off and it was all ok. Turns out the buyer was trying to update it to the iOS that iPad 5th generations run, which isn’t possible on the 4th gen iPad. \n\nI mail him back, telling him as such, and I then get a mail from him saying that it was faulty, not fit for purpose as he can’t update it to the newest iOS and install apps on it; and he would be escalating the case to eBay if I didn’t refund him in 24 hours. I message him back saying that the item is *not* faulty, that this is buyer error in not realising which iPad he needed, said it was understandable and then gave him several links to instructions on a simple workaround so he could still install apps on it, and also told him about apple’s exchange program where he could get generous credit towards a 5th gen if he brought the 4th gen into a store. \n\nThis is where he stops replying. The next day, I get a return request saying the item is faulty and my payfriend account is now -£300. I call PeeBay, and they look at the case, and reassure me on the phone that this is clearly the buyers error, not mine, and that I had acted in good faith, and not to worry. After 10 days the £300 will come off hold and the case will find in my favour, after all he’d provided no evidence of the item being faulty. The advisor told me to mail the buyer and advise them that I had spoken to customer service, give them a reference number, and warn them of the possibility of this negatively affecting their buyer rating. Of course, I comply. I also filed a detailed complaint about the buyer for abusing the payment protection programme.\n\nI wait 10 days and all of a sudden I get an email saying that the case has been escalated by the buyer. I quickly call PeeBay and said that they’d said it would find in my favour after the waiting period, so what’s going on? PeeBay again tell me not to worry, and even if it finds in his favour I will be able to file a complaint about the buyer and the item will be returned to me, and I’ll get the £300 recredited to my payfriend account as well as keep the item.\n\nThen I go away for two days, and annoyingly have no signal. When I get back, the case has found in the buyers favour and they’ve given him a return label with an ANCIENT address from my account on it (seriously it was from early PeeBay days, an embarrassingly long time ago, I didn’t even realise the address was on there any more as I’d been using my current address and other addresses in the many years I’d been a PeeBay customer).\n\nI phone PeeBay and they tell me to message the buyer my correct address. Naturally, it’s too late. The package is sent, and accepted at an ancient address. I start putting in my complaints and arguing my case. Each time it’s not found in my favour despite HUGE amounts of evidence IN my favour. One time, they even email me about the case quoting the wrong item number, and the wrong item (a footstool?!?? I’ve never sold a footstool). I go back and forth with PeeBay for DAYS and get the same stock responses until I get a stock response from a “manager” saying the same old bullshit. \n\nThis was when I gave up replying and where we get to now. I’m -£300 in my payfriend account, my PeeBay has been frozen because I’ve not reimbursed £300 cash into my payfriend account, and they’re threatening me with debt collectors. Oh, and I never got the iPad back. \nI am S T E A M E D. \n\n",
        "created_utc": 1512604527,
        "upvote_ratio": ""
    },
    {
        "title": "Company tech support doesn't understand mac vs windows",
        "author": "DoesTheOctopusCare",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7i1vn8/company_tech_support_doesnt_understand_mac_vs/",
        "text": "We have a new department shared network drive at work and today my director emailed directions out on how to connect to it. The directions were for a Windows PC. I asked her how to do it on a Mac and she said \"Just call the tech support guys, you have to be added to the vpn first anyways\" So I did.\n\nThe guy who answered had me explain what I was trying to do, agreed to add me to the vpn, and then said \"You have the path, right? Just use that to connect!\"   \n\nMe: but **how**? Where do I type the path in?   \n\nHim: Just click your Start Menu and...   \n\nMe [interrupting]: Wait, I have a Mac I don't have a start menu .  \n\nHim: You said the directions your director gave you were for a PC .  \n\nMe: yes that's the problem, I don't have a PC, I have a Mac .  \n\nHim: Okay but I just need you to click on your start menu first and then....   \n\nMe [interrupting again]: I don't HAVE a start menu. I just said I have a Mac, not a Windows PC.   \n\nHim: Okay, email me the directions you got.   \n\n---crickets while we wait for email to arrive---   \n\nHim: It says right here to navigate to your C Drive first, so do that.   \n\nMe: I can go to my \"Home\" folder but I don't have a C drive because ITS. A. MAC.   \n\nHim: You're logged into your computer right?   \n\nMe: Yes... why?   \n\nHim: If you're logged in properly, you should see the C Drive.   \n\nMe: Well I don't....    \n\nHim: I think we're going to have send a technician out, I think you're having errors logging into your computer. After that's fixed, I'll add you to the vpn.   \n\nMe: Can you add me to the vpn now?    \n\nHim: No, we need to find your C Drive first, and make sure your log in is working.    \n\nMe: Okay.............. when might that be?   \n\nHim: A few days, maybe next week.   \n\nMe: *sigh*\n----\nNo technician has arrived yet. ",
        "created_utc": 1512600513,
        "upvote_ratio": ""
    },
    {
        "title": "I just want to eat my food, man",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hyyau/i_just_want_to_eat_my_food_man/",
        "text": "[deleted]",
        "created_utc": 1512575946,
        "upvote_ratio": ""
    },
    {
        "title": "How I got a new (upgraded) drill under warranty surprisingly easily!",
        "author": "spongebue",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hwhqz/how_i_got_a_new_upgraded_drill_under_warranty/",
        "text": "About 4 years ago, my wife and I bought a house. A couple months later, my dad was nice enough to buy me a cordless drill to help get my tool collection started. It wasn't anything fancy, but worked pretty well for the most part. About what you'd expect for a $100 store brand drill from one of the major stores (the blue one, not the orange one).\n\nUnfortunately, a few weeks ago the chuck started to go out (for those who don't remember shop class, that's the part tray holds the bits).  I looked up the closest model currently available, and the first thing I saw was add-ons for an extended warranty of 1 or 2 years. Great, some cheap drill with an awful warranty. Oh well, orange store has a good deal on a nice looking, major brand set, and dad says it sounds like a decent one. I can run over there and get that.\n\nWhen I was enroute, my dad called me. The thing actually has a 5 year warranty. He said he'd call the store and see if they could look up the purchase from his credit card number (he lives a few states over, so the card itself wasn't readily available).  I went back home to get the old drill. He told me that he talked to the store manager. They couldn't pull up a transaction that old, but if I went to the store they'd take care of me.\n\nI showed up and asked for the manager by name. They called him, and he told the cashier to tell me to find an equivalent one.  Well, all I could find in the store brand was a higher voltage model which supposedly normally cost $180, labeled as on sale for $150, and actually rang up at $129.  And it had a few other accessories I didn't have. I brought it up anyway, figuring I could pay the difference.\n\nThis time, the manager was there, and noticed that it was a higher voltage model than I had. I told him that was the closest I could find, since mine was a generation or two old. He went back to check with me, and I promised him I wasn't trying to pull a fast one. He was super friendly about it, didn't seem worried about it at all. Just wanted to trust, but verify I guess.\n\nOnce he saw that really was the closest thing, he looked up the item number, and told the cashier to credit that price towards a new one. I figured I'd have to pay $30-50 to cover the difference, depending on price history, which wouldn't be so bad. The cashier did some fiddling with the register, and then I saw \"Change: $0.00\" in the display as a receipt popped out. No additional money owed!\n\nI brought home the drill, continued working on my basement, and that thing drives in screws like a hot knife through butter!\n\nNow I feel kind of bad that I usually go to orange store :(",
        "created_utc": 1512545049,
        "upvote_ratio": ""
    },
    {
        "title": "“Sure, let me pretend like I’m helping you until our hours are over, and then I’ll hang up.”",
        "author": "LJayEsq",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hvne3/sure_let_me_pretend_like_im_helping_you_until_our/",
        "text": "I was having major issues with my Big Tech Company computer, so I call the tech support line. I dutifully wait on hold for 10+ minutes (not too bad) and eventually a nice-sounding lady picks up. I give her my name and a call back number, “in case we get disconnected.”\n\nI spend some time explaining what’s going on, and the lady tells me, “sure, we can help you with that.” Me: “Great!” Her: “OK, let me loo-” \n\nSudden silence. \n\nI look at my phone and see that the call ended. No problem, she has my call back number, she’ll just call me back, right? If you said, “yeah, no way,” you win a cookie. \n\nI wait about a minute before deciding to just call the help line again. Except that when I call, I get an automated voice telling me that support hours are over, please call back tomorrow. So now I’m computerless until the morning. \n\nYou better believe I’ll be filing a complaint tomorrow. JERK. \n\nUPDATE: When I called back today the first thing I did was (politely) explain what had happened the last time I called. The service person informed me that (1) the lady I spoke with yesterday 100% hung up on me on purpose and (2) because the lady yesterday hadn’t taken any notes, there was no saved case file associated with my call to show a log of who I spoke with. Additionally, the tech support staff for this company are spread out all over the world, so there is no way to figure out who the person I spoke with was to make a formal complaint. Grrr. ",
        "created_utc": 1512534426,
        "upvote_ratio": ""
    },
    {
        "title": "Brand New Account, Already Have A NSF Charge",
        "author": "spiritjunkie12",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hsrkq/brand_new_account_already_have_a_nsf_charge/",
        "text": "Mostly I am writing this to vent and rage so I can move on with my day...\n\nLast week, I opened a brand new checking account at \"ABC\" Bank. I deposited the $25.00 required and went on my merry way. Since I want to use this account to receive PayPal transactions, I had it verified through PayPal. They put in two small amounts ($0.08 &amp; $0.14) and took out $0.22. Today I signed in and found that \"ABC\" Bank took out $37.00 for a NSF.\n\nI called the bank &amp; asked what this was for... Was passed around a bit until I reached Witchy Woman (WW). WW told me that my original $25.00 was on hold until they could verify it - which I completely understand, but somehow PayPal taking out the $0.22 triggered a negative  $24.78 which I do not understand. Taking the initial deposit out of the equation, PayPal simply put in $0.22 and removed $0.22 leaving a zero balance, not a negative. She told me that she could refund my account $15.00. Not having it. This account was truly never negative! $25.00 in (on hold) which means $0.00, added $0.14 &amp; $0.08 for $0.22 and removed $0.22 for $0.00. WW continued to fight with me and talk down to me like I was 10. I finally told her I wanted the entire $37.00 refunded. When she came back from talking to her \"boss\", she said they would refund it, but \"this time only\" and I need to make sure if I'm having anything come out of the bank that I have money in there. THANKS FOR THE INFO, WW, BUT NOTHING TRULY CAME OUT EXCEPT THE $0.22 PAYPAL PREVIOUSLY DEPOSITED.\n\nMoving on...",
        "created_utc": 1512507679,
        "upvote_ratio": ""
    },
    {
        "title": "Donating Plasma",
        "author": "dndnerd42",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hskac/donating_plasma/",
        "text": "For those of you who aren't familiar with donating blood plasma, or live somewhere where it works differently, here's a quick rundown on donating plasma. Blood plasma is more than water that the red blood cells sits in. It has other stuff in it that medical researchers and prescription drug companies and such need. The way it works is that the needle draws blood, send it through a centrifuge, bags the plasma and sends the concentrated blood back. Because of this it usually takes about an hour to donate and you can donate twice a week. Because of how valuable it is and how long it takes, you are compensated in the form a cash card, I think it was about $50/a week.\n\nWhen I was in college, a friend told me about this. We thought it was a great deal, as you're getting paid to replace and watch whatever movie they're paying or listen to headphones or something, and it's a lot of money for a college student. \n\nUnfortunately, the staff at the plasma center were horrible. Apparently my veins are pronounced, but they \"squirm\" so most of the time they would miss the vein and have to move the needle around inside my arm to try to get it, which is not only painful, but creepy as well. On occasion this would get overzealous and they would stab right through the vein and out the other side, making me unable to donate for a while, unless I let them use my dominant arm, which I did not trust them to do. \n\nThen one time they didn't bandage me up properly and failed to stop the bleeding. It was winter, so I put my coat back on and start to leave, and I notice that my arm is feeling odd. I looked down and noticed there was blood dripping off my fingers.\n\nIt took my almost ten years to work up the courage to participate in a regular red cross blood drive. Today was my second time. While I trust the red cross people and it is a lot better experience, I just can't get over the memories of how it felt to have the plasma center people jerking the needle around under my arm and the feeling of having blood running down my arm and dripping of my fingers. I want to do the right thing and donate blood, but it's hard to relax with those memories running through my head.\n\nTL;DR donated plasma, people screwed up, developed a fear of needles, am trying to get over it 10 years later. ",
        "created_utc": 1512505975,
        "upvote_ratio": ""
    },
    {
        "title": "\"You look like nice Christian guys, so it's OK.\"",
        "author": "Nivarak",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hrywl/you_look_like_nice_christian_guys_so_its_ok/",
        "text": "Alright, so this all happened almost a year ago. I know, a while, but I just never got around to posting it anywhere.\n\nSo, I work for a company's techsupport department, which realistically means we're responsible for setting up/fixing just about anything that has a circuit in it. In this scenario, we were setting up a new store in -insertBigAmericanRetailfranchise-'s hometown. Three of us were at -insertBigAmericanRetailfranchise- buying a new TV to go in the customer waiting area of the company's store. Honestly, there were only three of us there because it was 7:20am and the stop was in between the hotels we had been staying in for the entire weekend (this is Monday) and the location of the new store, it's easier to lift big TV's with more than one person, and two of us were riding together.\n\nWe made it to the checkout line, and in front of us was only one guy. Didn't have much, and the line moved quickly, we were up next... So we thought.\n\nHere comes a lady out of nowhere, pushing her way past us with a premade salad in one hand, and a bag of cat food in the other. Henceforth she's CL (Cat Lady). She starts speaking much louder than anyone needs to in order to have a conversation.\n\nCL: \"Let me just check out please? I've just got a few things. It won't take just a few more minutes.\"\n\nThe cashier looks on stunned, but goes ahead and starts checking her out with an almost embarrassed look on his face. One look at him and you know he's probably had a rough week already, but he's being quick and efficient as he can be.\n\nCL: \"Oh, you work for -insertcompanynamehere-? I bout a -thing- from them! Oh, but it's ok, this won't take but just a minute, and besides, you look like nice Christian guys. You're all so nice, surely you don't mind just letting me go here.\"\n\nYep, all of us had on company jackets. It was pretty cold outside. Remembering that, I hold my tongue. Yeah, I'm a generally nice Christian guy. One thing I recognize though, is that I'm just as capable of sin as anyone... And here comes Wrath wanting to work its way out. Only problem, I'm too tired at this point to think of any witty remarks, or really do anything more than glare and keep the rage checked. Had she just come up and asked politely and been done, I'd have no problem. But butting in and constantly trying to make justifications?\n\nHer two items are rung up now. The cashier interrupts her continuous talking long enough to tell her the total. She keeps talking while paying.\n\nCL: \"Besides, I've had a hard week you know? I work in a nursing home, in the kitchen. 50 hours this week. Just need to get something for myself and get back to it real quick.\"\n\nNone of us has said a single thing, but we're all glowering at her, silently. Each of us has put in ~80 hours counting the week and weekend, and we're looking at around another 10-12 today.\n\nCL: \"I really just need to get back quick now that I've got my lunch. Figured I'd pick something up nice. And you look like nice Christian guys, so it's ok. And I really needed to pick up some food and get back to the nursing home.\"\n\nShe finishes paying, and proceeds to quickly walk off. She never stopped trying to justify cutting in front of us the entire time. I keep watching her, staring daggers into her back. From the side, I hear \"Bitch\". Now, I know that wasn't one of the guys I was there with... \"More like Heffer\" (Yeah, not spelled right. That's how he said it though).. And that was definitely the other guy I was with. Looking over at the cashier, he's giving what looked like a knowing smile. I smiled back, and we're out of there two minutes later.\n\nThanks for keeping cool retail guy! I know she's probably not the first, or the last, rude customer you've had that week.\n\nI do feel sorry for those poor folks at the nursing home though... She never mentioned getting cat food for her cats. ",
        "created_utc": 1512501039,
        "upvote_ratio": ""
    },
    {
        "title": "Update: Manager tried to shame me in regard to her employee’s mistake, told me the employee would be docked pay",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hrncq/update_manager_tried_to_shame_me_in_regard_to_her/",
        "text": "[deleted]",
        "created_utc": 1512498427,
        "upvote_ratio": ""
    },
    {
        "title": "Saw a mother setting best example ever....(not really)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hr5vp/saw_a_mother_setting_best_example_evernot_really/",
        "text": "[deleted]",
        "created_utc": 1512494455,
        "upvote_ratio": ""
    },
    {
        "title": "I don't know if I was responsible for this or not",
        "author": "FnDork",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hmfw2/i_dont_know_if_i_was_responsible_for_this_or_not/",
        "text": "In July I bought a new car. Not for the first time, nor for the last, I'm sure. In November, I was approaching 6000 miles, and about to set out for a 1400 mile trek home and back, so I scheduled my 6000 mile service (oil change, tire rotation, inspection) at the dealership where I bought.\n\nAppointment was for Tuesday at 7:30 am, and I rolled up at 7:25. They opened up the garage door and I pulled in. A tech was assisting the guy in front of me. Knowing this dealer prides itself on customer service, I was happy to overhear the following: \"Yes, so this will take 45 minutes to an hour. You can wait in the waiting room. Do you know where that is - oh nevermind, I'll just walk you over. Yes, have a seat, we'll get this taken care of as fast as possible. If I don't help you when your car is ready, you have a wonderful day, sir!\" \n\nIt was almost sickening how nice they were.\n\nThen it was my turn. Another tech appears, looks at his board. \"Mr. Dork? I need your keys.\"\n\nMe: \"Sure thing, they're in the car\"\n\nTech: \"Just the oil change today?\"\n\nMe: \"The 6000 mile service. Doesn't that include a tire rotation and inspection?\"\n\nTech: \"...\"\n\nMe: \"?\"\n\nTech: \"Have a seat.\"\n\nThen he got in my car and started doing his paperwork.\n\nSo I went into the waiting area and sat down with some music and work. \n\nAfter 30 minutes or so, another tech entered the room and went up to the other customer and greeted him by name, shaking his hand, and walked him out to the service bay. \n\nI knew my car was ready, because my phone popped the \"Bluetooth connected\" notification. So I pulled my headphones and waited for a technician to call my name.\n\n\"Dork?... DORK?\"\n\nI turned my head, it was the previous tech.\n\n\"You're ready\" he announced through a fake fig tree, and then turned around and walked back out to the service bay. I gathered my stuff and joined him. \n\nHe reviewed my service and I paid and left. \n\nBut I couldn't get over why the previous customer got such great service and I was treated like that. I don't know why, but the disparity in the customer service stuck in my craw all day, to the point that during my son's sports practice that night, I looked up the GM of the dealer and emailed him my experience. Not to throw a guy under the bus, mind you, but so that maybe he could get some coaching or they could use my experience to learn from. And I said as much. We can all learn from our experiences, right? \n\nDidn't hear anything back, but I figured it was all I could do, so I forgot about it. \n\nThursday, I got a survey about my service experience. First question was \"Were you completely satisfied with your service experience on Tuesday morning?\" I responded \"No\" and the survey said I was done. \n\nI was crestfallen. I really wanted someone to understand *why* I was not 100% satisfied. But whatever, that's their prerogative. \n\nTwo minutes later, I get a phone call from the service manager at my dealer: \"Mr, Dork, I'd like to understand why you weren't completely satisfied... blah blah blah\" \n\nI explained my experience as I did here, and explained that I saw another customer get excellent customer service, and I got the guy who was short with me. I reiterated that I wasn't after any special treatment or to get anyone in trouble, but I wanted to give them honest feedback. \n\nThen he said this: \"I, uh, know who was working with you, and um, he's no longer employed here. The way you saw the other customer being treated is how every customer should be treated, and I just hope next time I can earn all 10s on the survey. I'm very sorry.\"\n\nI really hope my email didn't get someone fired, because that sucks. On the other hand, hopefully all their customers will be able to get the best service they can offer.",
        "created_utc": 1512439596,
        "upvote_ratio": ""
    },
    {
        "title": "Overcommitted Customer Support",
        "author": "philipamour",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hk4dn/overcommitted_customer_support/",
        "text": "This just happened...\n\n\n\nInitial Question: I'm contacting you regarding the order ---------. I have just received an email notifying me that you tried but \"...failed, to deliver your package today because we couldn't locate your delivery address.\" The address that I have provided is correct. It exists, matter of fact, another order that I made today --------- was successfully delivered.\n\n\nSupport(\"Company\"): Hello, my name is Support. I’ll be glad to help you today. \n\nSupport: Philip i am sorry to hear that you are facing such issue.I personally apologize you for the inconvience caused to you from the bottom of my heart.\n\nSupport: Philip i want to be very genuine with you thats why i am sharing this information with you.The reason for delay is \"Company\" has recently hired some new drivers so they were unable to reach you.\n\nSupport: Some of them were able to find the address while some of them were unable to locate it.\n\nPhilip: My house is next to the -----, I don't understand how the driver couldn't find it. :(\n\nSupport: Philip beleive me we were trying to improve our service as per feed back of our lovely and valuable customer.\nPhilip i promise we will not fail you.\nPhilip this is a new job for the drivers.\n\nSupport: I hope you understand and will give one chance to serve in future.\n\nPhilip: It's a promise for a better life. They can change the world - one delivery at a time.\n\nSupport: However for now i have reschedule delivery for tomorrow and i will make sure it is done with best drivers.\n\nPhilip: Thank you so much. May they be blessed with the knowledge of Google Maps.\n\nPhilip: It may be helpful for them to know that the house is next to the ---------.\n\nSupport: Also for now philip i will give you 5 GBP as a aplogy from my end.I know this amount is nothing for you but if you willaccept this amount i would be happy that you have accepted my apology.\nI will make sure this is not repeated and you will be given special preference from our side in future.\n\nPhilip: I feel blessed. Thank you for your help, Support. You're an amazing person.\n\nSupport: Thank you for letting us know Philip.we will take your feed back.\nThank you so much for being so polite with me Philip.\n\nSupport: Philip i am surprised how someone be so good even after facing such issues.Heartiest respect to you from \"Company\" family.\n\nPhilip: No, the thanks are on my side. You are an amazing listener. I'm so blessed. Thank you! I wish good riddance to your and the knights of \"Company\" Support!\n\nSupport: Also have added 5GBP successfully to your account.This shows that we cares for our such valuable customers.\nYou're welcome.\n:)\n\nPhilip: I can't believe this is happening. This is the best day of my life.\n\nSupport: Philip beleive me we will try to improve more as per your Feedback our main motive is your satisfaction and your happiness matters for us not money.\nIt was a pleasure assisting you Philip. \n\nPhilip: It was a pleasure talking to you. May the ol' mighty Jeff Bezos bless your heart.",
        "created_utc": 1512419260,
        "upvote_ratio": ""
    },
    {
        "title": "i accidentally insulted a customer support rep's english and it was the worst feeling ever",
        "author": "kittenpuke",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hjg7x/i_accidentally_insulted_a_customer_support_reps/",
        "text": "for context i was on a medical leave recently and even with my insurance the bills were astronomical bc yay murica etc etc. i had to call customer support re: one of the loans i had to take out to pay for my treatment and it was rly important that i got it sorted out ASAP.\n\nso i call and get greeted by a lady and she's polite and i explain why i'm calling and she's more than happy to help but she has a super thick accent that makes it hard for me to understand what shes saying. since the situation at hand was urgent and it was super important that i got all of my information right i was worried that there would end up being a communication issue (on my part for not understanding through the accent and being too awkward to keep asking her to repeat herself) so i apologized and explained pretty much exactly that and asked if i could be transferred to a different rep. i felt AWFUL even having to ask and i apologized and tried my best not to sound rude even though like......inherently its kind of rude\n\nthe lady went from cheerful to hostile in like .02 seconds. like she couldnt even hold onto that fake customer service persona anymore. she was like \"......oh. well sorry my english isn't good enough for you\" and i DIED inside. i felt terrible. i apologized and tried to explain again (which probably made it worse in retrospect) but she ended up saying \"let me get you to a representative who speaks english up to your standards\" while really enunciating each word and put me on hold immediately before i could say anything else\n\nwhen i got the next rep i tried to find out about the lady's name or anything so that i could either apologize or at least like give her a good survey rating to make up for it or something, but the rep said they couldnt tell who i got transferred from. i ended up getting all the information i originally called for and everything worked out but when i got off the phone i felt terrible and i cried lmao\n\nher english was perfect!! it was just the accent and even THAT was my fault bc i was groggy on a cocktail of meds and didnt trust myself to get all of the info i needed bc i'd have to ask her to repeat herself a million times and probably eventually just pretend i understood anyway bc i have no social skills\n\ni feel like a customer blowing up on you for something that isnt your fault is one thing bc its just displaced anger and whatever but having someone basically tell you \"your english isnt up to my standards to help me with my problem\" is a whole different thing :(\n\nanyway pls cheer me up with stories of your social mishaps leading you to be an asshole customer",
        "created_utc": 1512413842,
        "upvote_ratio": ""
    },
    {
        "title": "Please don't verbally harass your coworkers",
        "author": "misingnoglic",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hidwn/please_dont_verbally_harass_your_coworkers/",
        "text": "This was a few months ago, so I'm a bit fuzzy on the details, but I'm still a little proud. I've never called a store and asked to speak to the manager, but I think this warranted it.\n\nWhen I first moved into my apartment, it was a constant state of going to furniture and hardware stores to buy everything I needed to move in. In particular, we needed a lot of spray paint to make some furniture the color we wanted, and we went to this one hardware store quite a bit.\n\nThe store had this one employee that always rubbed me the wrong way. For example, when my girlfriend came with me, he refused to talk to her, just to me. He would also make it seem like the greatest chore we were asking him to do when we needed the cabinet for the spray paint unlocked. None of this was that bad though.\n\nThe last time I had to go in there was a whole other issue. As soon as I come in, this man is fighting with a younger woman cashier over something completely stupid (like the price of an eraser). As I ask him to help me with the spray paint, he just unloads on me. \n\n&gt; That girl is a retard! I don't care if you're not supposed to use that word or if I get in trouble, she is a goddamn retard.\n\nAt that point I just wanted to get out of there, as I'm not confrontational at all. But the lady at the register was so nice and respectful, that it literally broke my heart thinking she'd have to work with this asshole who's tearing into her for nothing. I definitely wouldn't be able to work like that, but she didn't even seem phased, like it happens all the time. The word choice also left an awful taste in my mouth, as disparaging people with mental disabilities is an awful thing to do.\n\nSo I did what I could do - I called the store, asked to speak with the manager, and told him the entire story that I just told you, and that there's no way I'd feel comfortable shopping there again. The manager was (reasonably) horrified, saying that that's definitely not appropriate and he would deal with the situation asap. I don't know what deal with it means, but I just hope that cashier can work in peace now.",
        "created_utc": 1512404783,
        "upvote_ratio": ""
    },
    {
        "title": "Fast food employee says \"Ice cream machine is broken.\" Yet again.",
        "author": "Kapalaka",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hhx36/fast_food_employee_says_ice_cream_machine_is/",
        "text": "[removed]",
        "created_utc": 1512400553,
        "upvote_ratio": ""
    },
    {
        "title": "Am I At the Romper Room or What?",
        "author": "Flickerfire",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hfyb4/am_i_at_the_romper_room_or_what/",
        "text": "Went into a local store to shop for Christmas cards. As I was looking over what they had in stock, this kid (maybe twelve or thirteen years old), comes flying through the front entrance on his scooter. He proceeds to zip around the store on the goddamn thing, knocking merchandise over as he goes. His two little buddies are milling around near the front, getting dangerously close to the register and the glass case full of knives while the only and I do mean ONLY salesperson on duty is chasing Scooter Boy.\n\nSince I'm ready to checkout, I went and stood up at the counter, eyeing the little bastards. I made my presence known, and that probably kept the store from being robbed by these heathens. The salesperson is arguing with the kid who is still running around on the scooter; she finally dials the back office for help, this finally causes them to tuck tail and leave. On the way out, Scooter Boy calls her a fucking bitch.\n\nPSA for the day:\nHey parents, people who work in retail are NOT your kids' fucking babysitter! If your kids act like this when you're not around, you're raising them wrong. If you're gonna breed 'em, please teach them manners and respect; don't be surprised if one day someone slaps your kid upside the head for all the trouble they've caused or worse, throws them in jail.",
        "created_utc": 1512374326,
        "upvote_ratio": ""
    },
    {
        "title": "One of the nicest cafes I've ever been to",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hfvhc/one_of_the_nicest_cafes_ive_ever_been_to/",
        "text": "[deleted]",
        "created_utc": 1512373085,
        "upvote_ratio": ""
    },
    {
        "title": "margherita flatbread",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hf0no/margherita_flatbread/",
        "text": "[deleted]",
        "created_utc": 1512361851,
        "upvote_ratio": ""
    },
    {
        "title": "You have to admit that when a Scammer admits he is a scammer and brags about it. Its funny",
        "author": "skinschamps2000",
        "url": "https://www.facebook.com/kara.dorseynadeau/videos/1832797943429534/",
        "text": "",
        "created_utc": 1512360862,
        "upvote_ratio": ""
    },
    {
        "title": "Frosty brew",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hevo6/frosty_brew/",
        "text": "[deleted]",
        "created_utc": 1512360326,
        "upvote_ratio": ""
    },
    {
        "title": "I was \"that customer\" today",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7heik2/i_was_that_customer_today/",
        "text": "[deleted]",
        "created_utc": 1512356366,
        "upvote_ratio": ""
    },
    {
        "title": "My Christmas Tree Experience",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7he7ou/my_christmas_tree_experience/",
        "text": "[deleted]",
        "created_utc": 1512353120,
        "upvote_ratio": ""
    },
    {
        "title": "It’s been over a month of the worst customer service I’ve ever witnessed and I finally got an apology email. It was addressed to “Dennis.” My name isn’t Dennis.",
        "author": "nixiegray",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hcs6e/its_been_over_a_month_of_the_worst_customer/",
        "text": "tl;dr-I bought a dishwasher. It was broken. All together, it took 21 days for my new new dishwasher to be delivered and installed. It was another 10 days before the broken new dishwasher was picked up (in order to get my refund, the broken dishwasher had to be returned to the store). I am still waiting on my refund and reimbursement and today I finally got an apology email, but it wasn’t addressed to me and was copy/pasted from someone else’s problem.\n\nI. AM. FURIOUS. \n\nEvery time I think this drama is over, they manage to mess something else up. Let’s start at the beginning. Settle in, it’s a pretty long story. \n\nMy previous dishwasher bit the dust during the Harvey disaster. I waited a bit to buy a new one, so it wasn’t until October 27th that I drove into town to do research and buy a new one. I found the dishwasher that fit my price range and needs, and left the store intending to buy it online. It was a $399 Frigidaire Gallery 52-decibel with hard food disposal, and a stainless steel smudge-proof front. \n\nWe made the purchase on Tuesday October 31st online and set up delivery for the 2nd of November. It was delivered in the late morning, without any warning. I was lucky I was home. I elected not to have the store install it because I knew someone who could do it cheaper, so that man was set to install it the next day, which was a Friday. The installation went smoothly, or so I thought, and I waved goodbye to the installer. That evening I loaded up the dishwasher with dishes and pressed start. Nothing happened. \n\nI closed the door harder, and pressed start again. Nothing. I pressed start and then closed the door. Nothing. I tried several other methods of getting it to work, but nothing did. Confused, I reasoned that I must be doing something wrong. On Saturday and Sunday I worked 15 hour and 10 hour days respectively so I had no time to deal with the problem, but first thing on Monday morning I called my installer and explained the problem to him. He stopped by and took a quick look at it and told me that, without opening it up he couldn’t be sure, but it looked like I had a faulty control board. \n\nMy heart sank. I’d been without a dishwasher for quite some time already and waiting even longer was an added stress. I’m disabled and washing dishes by hand is difficult and exhausting, so having a working dishwasher is a huge blessing to me. I was more than ready to have one working again. I immediately called my parents, who technically own the house and the dishwasher, and let them know of the problem. They called the store to arrange for a return. I thought that we would simply replace the dishwasher and things would be fine. I was wrong.\n\nMy mom called back, frustrated, and said that the woman she’d spoken to told her that while they could do a return, I would have to pay for it to be uninstalled/installed again. That seemed ridiculous as the price for an install was $150 plus tax (my guy had done it for $135). I wasn’t going to pay for another install when it had arrived broken in the first place. I wouldn’t have to reinstall a new dishwasher if the one they had originally delivered to me in the first place had worked. My mom agreed but apparently the person she talked to was not budging. The woman had told my mom to call the warranty people and get the part replaced that way. Parts and labor were included with the warranty. \n\nWe would have much preferred a new dishwasher, but since we didn’t want to pay for the install again, we decided to go with the warranty option. At this point we switched from dealing with the store to dealing with the warranty people, but I’m going to include this bit so you get the complete story. \n\nI called the warranty people and explained the problem to them. We did some troubleshooting over the phone, none of which worked. They then said they could send a repairman out, no problem, and told me that he’d be there on Wednesday between 12 and 5. They gave me a confirmation number and a phone number of the repairman. I cleared my calendar for Wednesday afternoon and waited for him to arrive.\n\nAt about 3:30 on Wednesday I called the number I had been given by the warranty people and asked them if they had an approximate time of arrival as I had a dog and I needed to get him crated before they arrived. The woman on the other side of the phone said they had no record of a service call to my house and no one was coming. She took my information and we hung up. About an hour later someone from that company called me back, it was a gentleman this time, and he explained that the warranty people had no right to schedule service calls on his behalf. He did his own scheduling. He apologized that I’d been waiting all day but he couldn’t come until the next Monday. I was frustrated, but said I’d be waiting on Monday when they came. \n\nThe next Monday, which was November 13th, the repairman came. The man who came to look at the dishwasher was quite old and the first thing he did was ask me why they hadn’t just replaced it. I explained about the install fee and he rolled his eyes and made a phone call. At that time I went to sit in the living room, not wanting to be in the way, but his phone volume was up so high that I heard both sides of the conversation. He proceeded to tell the person on the other side of the line what was wrong and they did all the troubleshooting that I’d already done with customer service. Then he had a tech on the other side of the phone walk him through, step-by-step, how to take my dishwasher apart and test it for what was wrong. It sounded like this guy had no idea what he was doing. I resolved that if they didn’t fix it I would call the store back and ask for a free install again. \n\nThe tech finished and came to me to report on how it went. He told me that he wasn’t sure what was wrong but that the guy on the other side of the phone was guessing it was the main control board that was broken. They were going to order a new one and get it replaced and hope that fixed it. I did not feel at all confident in his assessment but thanked him and he left.\n\nI immediately called the store and asked to speak to a manager. I don’t know who I talked to that Monday, but he was not helpful. I told him of my problem and he told me that while they could potentially help me, they couldn’t do anything while a repair was underway with a warranty issue. I said that’s fine, just assure me you’ll help me and I’ll call and cancel the repair, but I asked him to do it quickly because I didn’t want the repair guy to order the new part needlessly. He took my information and said he’d do what he could and call me back. I waited the rest of the day for him to call. He never did. \n\nSo, on Tuesday I called again. This time when I asked to speak to a manager, I talked to G. G initially sounded a little bit more helpful. He said they could waive the install fee for me (or comp me the fee if I wanted my guy to do it) and have it delivered either on Thursday or Friday, and everything would be fine. Hooray! Unfortunately, he didn’t have one of my dishwasher in stock anymore so he found one at another store, would get it delivered to them, and then would get it to me. He did say, however, that when they dropped off the new dishwasher, they’d need to take the old dishwasher back with them, so could I please uninstall it myself? I told him I’d do my best, but I didn’t have any idea how to uninstall a dishwasher. We hung up and I felt fairly confident that I’d have a working dishwasher by Thursday or Friday. I then called the warranty people and told them to cancel the part/repair, that I was getting a new dishwasher instead. They told me I had to contact the repairman myself, so I did. When I talked to him, he got upset with me because the part had already come in and he would have to pay a restocking fee. He wanted to know who was going to pay that. I didn’t have an answer for him, and by then I was so fed up I really didn’t care.\n\nThursday comes around and I haven’t heard from G about my dishwasher, but I’m hoping everything is going alright. I called a friend who is sort of handy and ask him to help me uninstall the dishwasher. He comes over and together we try to figure it out. We got the dishwasher halfway out, unhooking most of the cords and tubes, but there was one thing that we weren’t sure about so we left it hooked up and figured that this one thing wouldn’t be a big deal to have the store help us with. With the main dishwasher hose unhooked, I could not use my sink anymore because the tube was unhooked and any water I ran through my sink just came out under the sink. I am not handy at all, so I wasn’t sure how to fix that after we got it unplugged. So I plugged the sink and figured I’d be able to use it, by the very latest, on Friday, so this was no big deal. I paid the friend $20 for the help.\n\nThere was no delivery on Thursday the 16th, and on Friday I heard nothing either. On Friday afternoon I called the store and asked to speak to G. He was not around so I asked to speak to another manager. I talked to D this time and explained the whole situation. He assured me that he would figure out what was wrong with my order and call me back. He called me back that evening and left a message. The message said I should pick out a new dishwasher because G hadn’t been able to find the dishwasher that I had anywhere nearby. I had thought that G already found my dishwasher in another store, so this was a surprise to me. I really would have been happy with the dishwasher I originally purchased, but by this time I was so frustrated I took the upgrade with gladness. \n\nI looked online and found the dishwasher that I wanted, $100 more expensive than my original one. I called D back and told him which one I wanted and asked if it could be delivered on Monday, the 20th. He told me that I couldn’t just order this over the phone. I’d need to come in. I live 40 minutes away. I am disabled and driving at night is hard for me. I asked him again if I really needed to come in. He assured me it was necessary. He also told me that he wouldn’t be there anymore by the time I got there so he was going to tell his associate P everything and have him help me. I sighed and gave into the inevitable. I got in the car around 7:00 PM on Friday night and drove to town. \n\nI walked into the store and went straight back to the appliances section. I searched for a few minutes but couldn’t find anyone, so I went up to customer service and told them that I was looking for someone named P. They called him over the PA system and I walked quickly back to appliances to meet him. \n\nP was the worst person I dealt with at The store. With everyone else, communication was a problem and I didn’t feel I was getting very good customer service, but at least they were polite. P was straight-up rude. When I got back to appliances a small crowd had gathered around him and he was asking who had called for him over the PA. I told him it was me. He seemed irritated that I’d called for him over the system, and told me that he needed to deal with another guy first and would help me in a few minutes. I sat down and waited. When he was done he came over and asked what I needed. I told him my name and said D had told him what was going on with me and I was here to get a new dishwasher. He gave me a blank look and said D had never told him anything. And by the way, which D? Apparently there are 3 of them. He thought he was funny and laughed, even though I was clearly not amused. \n\nI gave him the quick version and told him which dishwasher I wanted. He looked it up and looked over at me blankly. He didn’t say anything. I said “well?” and he again didn’t say anything. I gestured at him with my hands, trying to get him to speak and he kinda smiled ironically. I looked at the computer myself and, not seeing anything obvious, asked again, “what, just tell me.” He said “it’s out of stock.” and laughed. At this point I was about ready to scream. I took a deep breath and asked him if he could help me pick out another dishwasher and he said sure. We looked on the floor for a while and I didn’t find one I liked. He called D asking for details and came back to me saying I could pick one out up to $200 more than the one I originally got. I asked if there were more online than were on the floor and he said yes. He set me up on the computer and then said he had to deal with something in the back and disappeared. That was the last I saw of him. \n\nAt this point B stepped in to help me. She was very nice and eager to please. I had a list of item numbers of dishwashers that looked good and I needed her to check and see if they were in stock. The first two she checked weren’t in stock, but finally, on the third one, they had it. She immediately tagged it with my name and told me that I was done for the day. That someone would call me tomorrow to set everything up. I didn’t trust that assessment due to the total lack of communication I’d witnessed, so instead of leaving at that time, I went up to Customer Service. \n\nAt Customer Service I asked for a manager and I got to speak to T. T was the first manager to actually act like he cared. He apologized profusely and I felt relieved and like something was going to happen for the first time. I gave him the item number of the dishwasher I wanted and explained that B had told me to just go home, but that I wasn’t comfortable with that and I’d rather deal with things now. He agreed and proceeded to take care of me. He declared that I’d get free delivery and free install, as well as getting the $599 dishwasher for $399, the price of the original dishwasher I’d gotten. I told him about the partially uninstalled dishwasher and he assured me it wouldn’t be a problem. He explained that they couldn’t give me a refund for the old dishwasher until they had it returned to the store, so I had to buy the second dishwasher in a separate transaction and wait for the refund after it was returned. He told me it’d be there and installed on Monday and I left the store feeling confident that T was going to make it happen. \n\nMy sink was still plugged and not working from the partially-uninstalled dishwasher, so over the weekend I just stacked dishes on the counter and waited for Monday. Monday came and I called to make sure that I was on the delivery schedule for the day. They assured me I was and that they’d arrive between 8 and 1. I waited and waited, and finally at 12:50 got the call that they’d be there within 30 minutes. They arrived just after 1. The gentlemen hauled in the new dishwasher and I pointed to the partially uninstalled dishwasher and quickly explained. They looked at each other and then at me and then both of them began explaining that they only delivered the dishwashers. They didn’t uninstall or install them. I was seriously confused by this because I thought that they knew they had to finish uninstalling this dishwasher and I also thought that they were going to install the new one. They called G and he told them to just leave both dishwashers there until an installer could take care of it. As they discussed this it dawned on me that I probably didn’t have an install scheduled, if these delivery guys weren’t going to do it. \n\nThey left, and I immediately called T. He couldn’t believe that that had happened and I asked him if I was on the schedule for an installation. He said no. They had forgotten that. Or overlooked it. Or something. But bottom line: it wasn’t happening. I did mention that my guy might be able to do it if they comp’d me on the price of install, but if that’s what they wanted, to please let me know. I asked him to please get on that and hung up.\n\nHe finally called back at 5:03 PM to let me know that they couldn’t arrange an installer and that it would be best if I just called my guy and asked him to do it. I immediately called my guy and left him a message. He texted me back later that night saying that with it being Thanksgiving week, he couldn’t get to it until the NEXT Monday. At that point I just kinda gave up. My sink was still plugged, I was out of dishes to eat on, and I was so tired and frustrated. I could have called that Monday night again to insist they schedule an install, but I was just so tired of talking to managers and begging someone to help me that I went to sleep instead.\n\nThe next day I called my parents again and told them about the most recent updates. My mom decided this was all ridiculous and called T herself. She told him that my guy couldn’t install it until the next Monday and that I needed it installed that day. Period. He said he’d call her back.\n\nThat afternoon, my installer guy texted me saying he had a cancellation and he could fit me in at 3 PM. I of course immediately texted him back and told him that would be great! He came and uninstalled the old dishwasher and installed the new dishwasher. He took the broken one out to my garage and double and triple checked that the new one was working. It was.\n\nSigh. Of. Relief. \n\nSo on Tuesday the 21st, twenty-one days after this whole thing started, I called the store and told them that I had gotten it installed and everything was ok. Now they just need to pick up the broken one so I could get my refund, as well as comp the price of the second $135 install that I had to pay for. \n\nI waited for over a week for someone to come pick that stupid dishwasher up, and no one did. So on Thursday the 30th (a full month after this all started!) I called and asked to speak to T. T wasn’t there, so they passed me off to D. D remembered me and was surprised I hadn’t gotten the broken one picked up because he thought G was dealing with that. Well, I thought so too but clearly I can’t count on G. So D says G is at lunch, when he gets back they will get together and get this taken care of so I can get my refund. He says he’ll call me back. \n\nHe doesn’t call me back. Big surprise. \n\nSo on December 1st I called again and this time I asked to speak to the store manager. The head of the place. They transferred me to J. I told him the abbreviated version of this story and he replied with emphatic apologies and the promise that the dishwasher would be picked up that day even if he had to come on his lunch break himself. Finally, someone who will do something!\n\nTrue to his word, the dishwasher was picked up within 2 hours. J called me back and confirmed it, and then another guy, D, called to confirm the amount that was going back on the credit card—the original purchase price plus the $135.31 for the 2nd install I’d had to pay for. I finally felt like everything was getting taken care of. \n\nBack before my broken dishwasher had been picked up but after the new one had been installed I sent an email to customer care on Friday Nov 23rd. I had several reasons for that. First, I wanted the broken dishwasher picked up. Second, I wanted my refund. Third, I wanted someone outside the local store to know about this situation so that they were accountable to someone in higher management for this disaster. And finally, I wanted an apology from corporate for the way I was treated. It didn’t seem like too much to ask. \n\nI didn’t get a reply to my message until Friday December 1st and when I did, it was clearly a copy/paste type form letter that was impersonal and uncaring, but it promised someone would be in touch with me within 24 hours. Nobody got in touch with me. So it felt like it was never passed on to someone who cared. However, I was happy with how J handled things so quickly once he found out about my situation. On Friday the 1st I replied to the email to update customer care on the situation and told them that the dishwasher had been picked up, that J had apologized profusely, and that my refund was in process. Once I’d said all that I added one more paragraph. \n\nI said: “I am relieved to have all this (mostly) behind me, but I do want to express one last concern. While I do believe that the store manager J took my story seriously and I am grateful that he took swift action to rectify things, I also believe that this whole situation has revealed some incredibly unflattering things about the way the store is being managed. The communication breakdowns were so severe and the operatings so dysfunctional that it took 32 days for my situation to be resolved (longer if you include the days in which I’m still currently awaiting my refund!). J has apologized to me for the whole situation, for which I am grateful, but I am reluctant to move on without knowing that someone higher than him has heard this story and will see to it that it never happens again. So I am requesting that you please make sure that whoever his boss is, and even whoever his boss’s boss is, would see this email so that things get better and no one has to deal with the ridiculous incompetence that I’ve been dealing with for the past month.”\n\nAs you can see, I was concerned and wanted someone in corporate to be informed of what happened so that there was some accountability and so that this did not happen again. I hoped for a personal response to this plea. I sent it on Friday and got a response this morning. It said this:\n\n“Good Morning Dennis,\nThank you for bringing this situation to my attention. I apologize for the experience you had with [store] and I will take the necessary steps to get your concerns addressed. To better assist you with this matter, I will need additional information. Please reply to this email with the following:\n* Product brand name: \n* Amount of rebate: \n* Form of rebate (e.g., check, gift card, etc.):\n* Whether rebate was entered online or submitted by mail:\n* Invoice number:\n* Department number:\n* Customer's full mailing address:\n* Date of Purchase:\n* Purchase Amount:\n* Location Purchased:\nOnce I receive this information I will be happy to further assist you. I look forward to hearing back from you again soon.”\n\n*deep breath*\n\nMY NAME IS NOT DENNIS AND I DID NOT ASK FOR A REBATE!\n\nIt’s the straw that broke the camel’s back. I’m seeing red.\n\nI really thought they couldn’t mess this up any more than they already had, but clearly I shouldn’t underestimate their incompetence. I’m not even sure there is a point in trying anymore.\n\n\n\nPS-this is my very first post after lurking a while. Hope I followed all written and unwritten rules. Thanks!",
        "created_utc": 1512338832,
        "upvote_ratio": ""
    },
    {
        "title": "Manager tried to shame me in regard to her employee’s mistake, told me the employee would be docked pay",
        "author": "skankenstein",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7hc1j0/manager_tried_to_shame_me_in_regard_to_her/",
        "text": "Yesterday I was at a corporate owned women’s clothing store and an associate helping me told me that the item she helped me choose was half off. When it wasn’t half off at the register, the manager told me that she would honor the discount but the girl would “have to pay for it”. I asked her not to punish an hourly employee for a $30 mistake at the same time I still thought I should have the discount honored as the item was selected for me by the employee AND was told it was marked down. This store is almost always half off so I don’t even know why this particular item wasn’t on sale. \n\nThe manager told the employee two times she “would talk to her later” and told me “the employee should know better” and that she’s “worked there a long time.”\n\nI left the store after telling the manager not to punish her and how I wouldn’t shop at a corporate store that makes billions but would dock an hourly employee for a simple mistake and the manager said that she (the manager) would pay for the mistake instead. \n\nI called customer service and said that I would cancel my store card and never shop there again if that was policy. The customer service associate indicated that that wasn’t policy and she was pretty outraged that that happened. \n\nI’m waiting for the district manager to email me back. In the meantime, I’ve read their employee handbook and will be using parts of that to explain why not only did the manager disrespect the employee but she attempted to manipulate me into being too ashamed to ask for the discount to be honored. \n\nIt was super embarrassing because there were other shoppers around and the employee and I were apologizing to each other. \n\nThat manager is either a liar (no docked pay) or a thief (illegally docking pay). Either way she is a monster for trying to manipulate me. \n\nI’ll update when I hear back from the corporate office. \n",
        "created_utc": 1512332171,
        "upvote_ratio": ""
    }
]