[
    {
        "title": "Non-driving closing driver",
        "author": "rnotyalc",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7e6rju/nondriving_closing_driver/",
        "text": "So I post stories from my job occasionally on here. Nothing too long today. Just venting really. \n\nMy GM has a buddy who comes and goes a lot here, he never has a reliable ride but is always scheduled as a driver. I don’t have a car myself right now, but I’m not a driver. But this guy is scheduled as one of my two closing drivers every night he works. \n\nTonight we got super stomped, after 10pm I was down to one actual closing driver. So the closer has been on the road for 45 minutes on a quadruple, we close in five minutes and there are five more orders waiting for him. \n\nI stopped taking orders almost an hour ago.  I’m in overtime at least, but going to be here forever tonight. ",
        "created_utc": 1511157538,
        "upvote_ratio": ""
    },
    {
        "title": "Anybody else here hate this fucking job?",
        "author": "kingdom_cum",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7e6h1d/anybody_else_here_hate_this_fucking_job/",
        "text": "I did an 11am to 8pm shift today to cover for some guy who's always been very friendly to me. The thing is that I usually do 4-5 hour shifts in the evening and I guess I never had enough time to really soak in how much I hate this fucking job.\n\nI absolutely don't get why it's acceptable for pizza places to pay you lower than minimum wage AND not pay for your vehicle maintenance. And top of that, my place charges 3 bucks per delivery which I get none of. I've had customers say that they won't order anymore after telling them that because it's dishonest, and I honestly agree. I think it's disgusting how the restaurant can make its drivers depend on people's generosity to make decent money. They're already paying for a delivery charge, why should they pay even more for the driver? \n\nThe worst part of it is how much money pizza makes. I made the restaurant more than 2500 dollars today. I got about 80 from that but made 120 in tips. Something makes no sense.\n\nThe owner and the manager (his son) drives BMWs and Mitsubishis. \n\nSorry for venting. I don't even know what the attitude towards the job in general here is, but it really had to come out.\n\n",
        "created_utc": 1511154237,
        "upvote_ratio": ""
    },
    {
        "title": "\"Your driver forgot my soda, change, and pizza\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7dxyba/your_driver_forgot_my_soda_change_and_pizza/",
        "text": "[deleted]",
        "created_utc": 1511061241,
        "upvote_ratio": ""
    },
    {
        "title": "I almost got robbed tonight",
        "author": "Owenlikestobrowse",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7digel/i_almost_got_robbed_tonight/",
        "text": "Hey guys, long term lurker, first time poster. I deliver for an independent pizza place and I technically work off the books. Tonight went as well as any Thursday night, pretty slow but not bad. It was about 20 minutes before close and we got an order from a pretty seedy area of Newark, and I almost told them we don't deliver there but I wasn't having a stellar night and I have car repairs to do, so I'll take it. I took a different order to a different part of Newark, and then started to head over to this place. I've been here before so I knew what the apartment building was like. I left my wallet in the car and locked it as I go to the front door of this slum. Two guys walk up the stairs past me as I call the number on the ticket to tell them to meet me outside. The front door to the building was left open and I can see inside. These two guys are standing outside of an apartment and they're just talking about whatever, and my sketchy meter is starting to tick. I keep calling but call keeps getting sent to voicemail. On the fourth call, a lady picks up right away, I tell her I'm out front and the lady says that her husband will be right down. My eyes stay on these two guys, they both have on winter jackets and I see them pull up their elastic wind guard, and their hoods. At this point I'm very nervous but I just assume I'm overreacting, they walk towards me and I step aside as they go down the stoop of the apartment building and keep talking. The man comes out of the apartment that these two guys were standing in front of and I give him the credit card slip and a pen to sign. He signs it and I give him the food. As he's signing he's talking with the two guys, it seems like they all know each other. Whatever. I walk down the stoop and start walking towards my car, these guys start walking behind me and talking to me, at this point I'm on adrenaline mode but it's not uncommon for people to just want to talk, especially in bad neighborhoods. They ask me things like, \"this is Domino's right?\" \"No sir this is Pizza Place X\" and I know at this point that I have a problem. Then one of the guys says \"hey man, step over here for me\" \"I'm not doing that man\" then he says \"I'm fucking shoot you man\" I see this man with his hands in his grey winter jacket and I guess he's bluffing. \"No you're not\" I say, I'm at my car door now and these guys are closing in on me, there's nowhere I could run, and I know that these guys would catch me because I'm not very fit so that's out of the question. \"Just give us your money man\" I don't have any, sorry\" \"yeah? How'd he just pay you then?\" So I show him the credit card receipt and they aren't buying it, so I empty my pockets and I had a couple pens and my phone, no money. \"give me your phone\"  I open the phone and open up the dialer, I say \"we're not doing this\" at this point I can't remember a lot of what happened but I kept firmly saying that it's not happening. There were more threats of \"messing me up\" but I reach in my pocket and unlock my car with my keys I try and open the door but they start to push it closed again, I jerk it open hard and slam it and I lock it immediately, one of the guys had run to the other side of the car and tried to open the door but it was locked. I turned my car on and gassed off. \n\nTL:DR, Went to sketchy neighborhood, got confronted but I got away.\n\nAnyone else have similar experiences?\n\nSorry for any typos, on mobile",
        "created_utc": 1510894410,
        "upvote_ratio": ""
    },
    {
        "title": "College town stories",
        "author": "howbluecanyoumakeme",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7dhofj/college_town_stories/",
        "text": "CSR: thanks for calling D's Pizza! How can I help you?\n\nGirl: yeah, I'd like a delivery to small town college\n\nCSR: ok, where to?\n\nGirl: uhhh...*insert pissy tone of voice* the college?!\n\nCSR: *beat head on counter* any particular dorm? \n\nWash, rinse, repeat next day",
        "created_utc": 1510886090,
        "upvote_ratio": ""
    },
    {
        "title": "The Time I Nearly got my head beaten in",
        "author": "DTheMonk",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7dh7x4/the_time_i_nearly_got_my_head_beaten_in/",
        "text": "So I live in a kind of small town, everyone knows pretty much everyone else, and as the delivery driver you learn really quickly which houses are trouble. This one place popped up on the delivery screen and they have been quite verbal in the past to our drives, so as the only male driver on, I was sent to the house which is fair enough. \n\nI get to the driveway and hop out of the car to hear a dude screaming \"GET OUTTTT!!!!\" as loud as he can from inside the house which was pretty strange, but it wasn't the first domestic I had delivered too so I kept going. (really should have left but you know, hindsight is 20/20... Oh and it wasn't a domestic, he was yelling at me but I didn't realise) I get to the door, the flyscreen is there but there the wooden door had been ripped of the hinges. I see the guy in the kitchen, which is connected to the front entrance and he has no-one around him which I thought was strange seeing that I thought he was just yelling at his girl. \n\nDude is clearly off his head, his eyes were glassed over and it felt like he was looking through me. I'm not a big guy, 5ft 10, 60kg and this beast of a human would of been like 6ft 4 and like 110kg of muscle. he was huge. \n\nStone faced, he turns to me, quietly but forcefully tells me to get lost and starts charging for the door screaming \"The cops set you up to this, I'm not going back\" I just bolt, his girl grabs him and he stops and I leg it to the car before flooring it. \n\nOn my next delivery I drive pass the house and see the police out the front, now that has nothing to do with me but clearly whatever the hell was going on there, he had some form of reason to think  the cops were coming. \n\nSeriously though, this was easily the scariest thing that I've ever experienced. Anyone able to top it?",
        "created_utc": 1510881389,
        "upvote_ratio": ""
    },
    {
        "title": "If there were a Podcast similar to the sub where people could be interviewed and tell their stories as a driver, would you guys listen to it?",
        "author": "abushart",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7dh3ta/if_there_were_a_podcast_similar_to_the_sub_where/",
        "text": "I've been wanting to start a podcast and am brainstorming ideas- curious to hear your honest thoughts on this \n",
        "created_utc": 1510880249,
        "upvote_ratio": ""
    },
    {
        "title": "Tonight I got to see awesome nakedness....",
        "author": "Prius_For_Life",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7damtw/tonight_i_got_to_see_awesome_nakedness/",
        "text": "This couple calls the store from a local hotel and they are drunk as fuck....they keep saying how the wife is naked how beautiful she is....how she will give me a nice \"tip\" etc. \n\nThey place their order...finally....after 10 minutes on the phone, and I'm the chosen one to deliver it. I go up to the room and guess who opens the door? The drunk chick....she was also totally naked...like totally butt ass naked. It was quite a nice sight I must add....I've seen chicks open the door in their bra or in bra/underwear but never naked.\n\nTell me friends, is this a rare sighting? have you every had anyone answer the door naked? How was it for you....\n\nI didn't even care that I didn't get a tip....the nakedness was enough of a tip for me.\n",
        "created_utc": 1510814295,
        "upvote_ratio": ""
    },
    {
        "title": "Lunch Taxi",
        "author": "TheRealLavar",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7d8id7/lunch_taxi/",
        "text": "I work for a certain freaky fast sandwich shop.\n\nToday, I delivered to a guy and his kid happens to be with him. The kid, no more than 4 years old, looks at me, then at my car, then back to me.\n\nKid: Hey, do you have a lunch taxi?\n\nMe: Uhh... Yea?\n\nKid: Yea! Lunch taxi!\n\nMe:  (At this point it clicked as to what he meant) Oh yea! Lunch taxi!\n\nI was cracking up as I left. Made my day. What a cool kid.",
        "created_utc": 1510791456,
        "upvote_ratio": ""
    },
    {
        "title": "\"Does the delivery fee count as a tip?\"",
        "author": "Eschaton_Amateur",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7d8fuq/does_the_delivery_fee_count_as_a_tip/",
        "text": "I get this question in one way or another from time to time, and I sometimes hesitate to respond. The other night though I finally landed on something like \"..... I feel a little morally grey about seeming like I'm asking you for a tip, but no within the community it is not considered a tip.\"\nThe lady I was delivering to seemed to appreciate the candor, I know some people like to use these questions to weasel their way out of tipping but she gave me a $5 tip after I explained",
        "created_utc": 1510790879,
        "upvote_ratio": ""
    },
    {
        "title": "So one of my coworkers got busted shaking a customers soda. (Video in comments)",
        "author": "very-un-dude",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7d8eus/so_one_of_my_coworkers_got_busted_shaking_a/",
        "text": "He was fired the very next day when said customer came in and pointed him out with video evidence. ",
        "created_utc": 1510790588,
        "upvote_ratio": ""
    },
    {
        "title": "Embarassing Stories",
        "author": "RicoVincent",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7d79ei/embarassing_stories/",
        "text": "I just had my first shift as a pizza delivery guy yesterday.  All went well, but even thinking about dropping a pizza while pulling it out of the hot bag makes me cringe. Has this or anything like it happened to anyone before? And if so what did you/the customer do? ",
        "created_utc": 1510780279,
        "upvote_ratio": ""
    },
    {
        "title": "Anybody have a scam attempt like this?",
        "author": "Justin33710",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7d6yu9/anybody_have_a_scam_attempt_like_this/",
        "text": "Happened a few times I'll describe one as an example because they always follow the exact same steps. \n\n$30 order I get to the door they take the pies to put down in a rush then ask how much it was and ask for $15 in change while they grab the money.\nHand me $40. Uh no man I can't give you $15 from that it was $30 and you gave me $40. Oh my bad just give me $5.\n\nNow this may seem like an honest mistake but I've had a couple people do it multiple times before they stopped ordering and they always rush to grab the food and ask for change before they hand me the money.\n\n I don't know if they are following a how to video or what but be aware if somebody pulls this ritual.",
        "created_utc": 1510777843,
        "upvote_ratio": ""
    },
    {
        "title": "Exposed a constant stiffer in front of her friends",
        "author": "Issued4Approval",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7d56rw/exposed_a_constant_stiffer_in_front_of_her_friends/",
        "text": "This notorious stiffer lives in a nice gated apartment complex. She either writes a line thru the credit card receipt tip line or on cash order will give us $28 on a $27.XX order. She always writes instructions on the receipt to call her when at the gate so she can buzz us in and meet us outside her door when we get to her unit. Sometimes she won't answer her phone and we wait at the gate entrance for 5-10 minutes before she buzzes us in.. Well, this last time she ordered $57.84 worth of food, cash. I get to the gate and was able to piggyback behind another car then drive to her apartment unit. I put $0.16 in my pocket cause I knew she was going to give me $58. I knock on her door and somebody else answers, one of her several guests. Nice guy told me to come inside and put the 5 pizzas on the table, then offered me a beer. This was during NFL game cause maybe 12 or 13 people were there, most of them wearing jerseys watching the Cowboys v Falcons game. I spot the stiffer girl at the table. She gets up and starts escorting me out the door, then gives me the money. I count it before stepping outside...and of course, it's just $58. So I get the coins from my pocket and give it to her saying \"Here's your 16 cents change.\" I say it loud enough so everyone inside can hear.. Then I step outside and leave.. Haha, cheapskate..\n\nI just finished reading a negative review that she wrote online. It was written same day as NFL game and I noticed it was her by the avatar Facebook picture. She says  we always get the toppings wrong and take forever to deliver her food.. Which is completely false. Why would she keep ordering from us for the past year.. \n\n I guess I pissed her off.. Mission Accomplished!",
        "created_utc": 1510763001,
        "upvote_ratio": ""
    },
    {
        "title": "A few interesting deliveries",
        "author": "Habzul",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7d3o6f/a_few_interesting_deliveries/",
        "text": "[removed]",
        "created_utc": 1510747689,
        "upvote_ratio": ""
    },
    {
        "title": "If you’re going to order online",
        "author": "mostlyhighthoughts",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7cttcy/if_youre_going_to_order_online/",
        "text": "For the love of pizza, make sure your order is correct, and if it’s not, call in and get it fixed as soon as possible. \n\nI️ had an older man yell in my face earlier because he was sure that he clicked thin crust but the app must have changed it to pan. Alright, Dick Bag, well the receipt clearly says pan, and I️ literally just pulled into the parking lot. ",
        "created_utc": 1510641409,
        "upvote_ratio": ""
    },
    {
        "title": "A Grim Reminder",
        "author": "IveGotElectrolytes",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ctckc/a_grim_reminder/",
        "text": "As we begin this holiday season i just want to remind you drivers to be smart on deliveries. Robberies are most common this time of year, and i got reminded early this evening. One of my drivers took a phone delivery just past dark. House was vacant, but he didnt realize it until he was at the door. He turned back for his car and before he got there someone pulled a gun him. he gave the guy the money, and just before he ran off, he shot my driver in the stomach. He just got out of surgery and no vital organs were damaged so he is gonna be alright. But its a grim reminder of what can happen.",
        "created_utc": 1510635838,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, fuck me for us being busy.",
        "author": "kirokatashi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7cm7ho/sure_fuck_me_for_us_being_busy/",
        "text": "This happened today. It had been a busy weekend night, we were down 2 drivers and all deliveries were late, so I took a triple. The last one was to a retirement home. I was walking to the front door and a lady who works there and had been sitting outside called me over by name (thanks pizza tracker). She asked what took so long, I told her that it was busy and I had to take a lot of deliveries. She said \"it's not my card, so I can't tip you.\" I told her I needed the cardholder to sign the receipt. She said he wasn't there, but she was getting it. She showed me her phone as proof, she had been texting with the guy whose name was on the order. All I had time to read was \"He aint gettin no tip\" and \"yeah fuck him my foods gonna be cold.\" I gave her the pizza and walked away without saying anything to her that could get me in trouble. ",
        "created_utc": 1510568100,
        "upvote_ratio": ""
    },
    {
        "title": "Good pants for working at Dominos?",
        "author": "sweetiejam",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ch83t/good_pants_for_working_at_dominos/",
        "text": "Recently started working at Dominos and had heard Pizza Hut was fine with wearing black jeans so I assumed Dominos was the same, only learned during orientation that wasn't ok. I got [these](https://www.amazon.com/gp/product/B0029NZYZC/ref=oh_aui_detailpage_o00_s01?ie=UTF8&amp;th=1&amp;psc=1) and another pair of women's black pants, but the fit for the Dickies is awkward and the other pair barely has pockets, which I really need more of. Anyone got any recommendations for good brands for women's pants? Or even mens, every pair of women's pants have shit pockets.",
        "created_utc": 1510512604,
        "upvote_ratio": ""
    },
    {
        "title": "FoodTec DeliveryIQ experiences",
        "author": "DarkMatterBurrito",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ch0v4/foodtec_deliveryiq_experiences/",
        "text": "While I really like what the app does, I really do not like how it goes about doing some things. In fact, I usually end up yelling at it and telling it that it's programmers should be fired.\n\nWhat are your experiences with the signature portion of the app? I find that it REALLY bogs down when it gets to that screen and I cannot for the life of me understand why. I have tried turning on performance mode, lowering the resolution, reinstalling the app, restarting the phone...nothing seems to affect it. Most of the time I can barely get a straight line to draw, much less an actual signature. Then there are times when the customer can get it done fine.\n\nThen there are other times that the app just locks up after hitting accept on the signature screen, requiring 2 app shutdown to get it to load again.\n\nI am using an S7 Edge and have even installed Autodesk's Sketch app to make sure that it's not the screen protector or something causing it. I have also come up with nothing while looking for the same problem elsewhere on the Internet.\n\nThanks.",
        "created_utc": 1510510715,
        "upvote_ratio": ""
    },
    {
        "title": "I hate college football, I hate life Maybe.",
        "author": "FaithlessHeartless",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7cdnzl/i_hate_college_football_i_hate_life_maybe/",
        "text": "https://imgur.com/RtDDHTS , this has been my entire night don't bother counting that's 9 bags of food.\n\nI wunna run away to Alaska and live off the land and build a giant bath tub to have a bubble bath in, I wuna also have a giant boat with a giant bath tub to have a bubble bath in.\n\nBy the time I got home at 11:30 my legs were shaking and I was Fucking hungry, I can't count how many flights of stairs I've climbed today; I wouldn't be surprised at all if I woke up tomorrow and had bomb ass calve muscles like I biked a marathon and a half.\n\nI wunna Go back to playing with Barbie's and pretending to make Barbie and Ken kiss oh my God I hate college towns and college football. Rant over stay safe out there guys.\n\n\nP.s I almost hit a deer today I freaked out not gonna lie I was speeding and if I wasn't paying attention I could ended it's life. Gonna slow down and watch myself now.",
        "created_utc": 1510464660,
        "upvote_ratio": ""
    },
    {
        "title": "This happened tonight. It happened to me and I still don't fully believe it.",
        "author": "HydrateLevel4",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7cdnpt/this_happened_tonight_it_happened_to_me_and_i/",
        "text": "I used to deliver full-time for a company whose name is kinda like Pizza House, but not exactly.\n\nA few months ago I got a different full time job and only deliver 2-3 Saturdays a month now.\n\nTonight was one of those nights. I was scheduled to work from 5:00 PM - 10:00 PM.\n\nI was on my fifth delivery of the night at about 7:00 PM. I was on a stretch of road where there was only one other car on the road and it was in front of me heading the same direction.\n\nWe were navigating a small bend in the road when I noticed the car in front of me react to something in the the roadway.\n\nToo soon I found out what it was: a tire.\n\nNot just a tire laying in the road.  No.  That would be too easy.\n\nThis was a tire rolling diagonally down the road.  Not just a tire, but a tire on a rim.\n\nSo it had some weight to it and had some good momentum.\n\nThere wasn't any other vehicle on the road where this tire could have come from.\n\nIt seemed to have appeared from nowhere.\n\nAs that isn't possible my best guess is that someone must have rolled the tire into the street from a nearby neighborhood.\n\nThe neighborhood that I was passing was a gated community that has an artificial hill with trees and vegetation that separates the neighborhood from the road to reduce the effects of the road noise.\n\nIt seems that someone must have/could have rolled the tire down this hill into the street.\n\nIt struck my driver's side front quarter panel wreaking havoc to the headlight and panel.\n\nI called my store and spoke with my store manager to inform him that I wouldn't be able to complete my delivery and would need another driver to come get the order to finish the delivery.\n\nI then called the non-emergency number for my local police to have a deputy come out so that I would have a police report for the crash.\n\nI didn't know if one would be needed by my insurance co., but I'd rather have it and not need it then need it and not have it.\n\nMy store manager showed up himself to finish the delivery and inspect the damage to my car.\n\nHe was as incredulous as I was that this even happened.\n\nWhen the deputy showed up we attempted to search the immediate area to see if we could locate the tire.\n\nWe walked around for about 15 minutes in the dark, with flashlights, and we're not able to find this tire.\n\nThe accident happened so quickly that all I could remember was seeing the tire, feeling the impact and then trying to pull off the road without hitting anything else.\n\nI wasn't able to tell which direction the tire would have ricocheted to down the road after it struck my car.\n\nThe deputy and I returned to my car and inspected the damage.\n\nWe were able to get the car to where I could drive it the two to three miles to my house to get it home.\n\nThe deputy completed a crash report that I could provide to my insurance co.\n\nI used my wife's car to drive back to the store with my delivery tickets so that I could be cashed out.\n\nThe shift manager cashed me out and I turn to clock out thinking of course I'm going home. It was now about 8:15 PM.  I was just in an accident.  I'm clearly shaken up by the experience and I don't have my vehicle to deliver with.\n\nMy shift manager asks me if I'm clocking out.  I said that I was and she told me to wait as she thought that I was supposed to stay and work inside for the rest of my shift.\n\nTaken aback I walk over to the store manager and ask him if I'm going home or not.\n\nHe asked if I would stay and help do some dough prep.  It didn't really sound like I was given the option to choose so I went and worked on some dough prep.\n\nAfter about 10 minutes I stop to call my wife as I realize that she's probably expecting me to have come straight back home (as I was) and I didn't want her to worry and think that I was in another accident.\n\nShe was beside herself and could not believe that they were making me stay after the accident that I had just had.\n\nWhile I agreed with her and was shocked as well I couldn't react the same way that she was with my store manager 10 feet away.\n\nAfter I completed as much dough prep as I could (ran out of clean pans and I wasn't going to stay longer to complete those) I went over to my store manager to check in with him.\n\nI gave him an update on where we were on the prep work and asked him if I needed to complete any kind of accident report before clocking out and going home.\n\nHe said that because my accident didn't involve any other cars I didn't need to complete an accident report.\n\nI was shocked by this.  About a year earlier I had slipped and fallen in the store.  I was okay, but my shift manager filled out an accident report then (begrudgingly apparently as she later told me that she had to do it because she saw it happen).\n\nI can't believe that a tire can smash into my car while on a delivery and Pizza House doesn't want to document the event.\n\nTL;DR Ghost tire performs a hit and run on my car while on a delivery and my employer didn't care.\n\nEdit: a word.\n\nEdit 2: Pictures of the damage from the aforementioned ghost tire:\n\nhttps://imgur.com/a/ukPZk\n",
        "created_utc": 1510464563,
        "upvote_ratio": ""
    },
    {
        "title": "I had a great day today and wanted to share with somebody.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7cdcvq/i_had_a_great_day_today_and_wanted_to_share_with/",
        "text": "[deleted]",
        "created_utc": 1510460601,
        "upvote_ratio": ""
    },
    {
        "title": "[Query] No tip option?",
        "author": "mechengr17",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7cawbx/query_no_tip_option/",
        "text": "So, I literally just ordered from the NotJustPizzaAnymore pizza place. \n\nI don't really keep cash on me, so I normally pay with card. As I was checking out, I noticed something absent that's always there whenever I order delivery: the option to add a tip.\n\n\nI just went back through the ordering process to double-check that it wasn't in a weird place, and nothing. I did not see it at all.\n\n\nI have no cash and only a few pennies and stuff. \n\n\nWhat should I do?",
        "created_utc": 1510433235,
        "upvote_ratio": ""
    },
    {
        "title": "Illegal tips are the best tips",
        "author": "OVOsimba716",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7cauaf/illegal_tips_are_the_best_tips/",
        "text": "I just discovered this sub. I was a delivery driver for about a year and a half for pizza hut. \n\nOne time these two kids ordered some pizza, I get to their house and the guy that answered is obviously high as fuck. Let’s say his order was $20, he hands me the 20 and says thank you have a nice night and goes to shut the door. I’m still holding the pizza though.\n\nSo I said “wait, do you want this?” and his high ass realized what he just did and burst out laughing. He opened the door and took the pizza and said “you smoke weed?” outright. I laughed and said yeah and he gave me a nug along with a $5 tip. I said thank you and left lol.\n\nSmoked it that night with my friend. Probably some of the best weed I’ve ever smoked in my life. One average sized nug had me ripped out of my mind. I probably would’ve done the same shit he did if I had ordered a pizza that high",
        "created_utc": 1510432651,
        "upvote_ratio": ""
    },
    {
        "title": "Been working at one of the Big 3 for a year now and was just told they take my tips out of my paycheck??",
        "author": "mostlyhighthoughts",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7c9rxw/been_working_at_one_of_the_big_3_for_a_year_now/",
        "text": "\n\nMy manager told me the other day that when you put your tips in at the end of the night, that is the amount that the company will take out of your check. \n\nI️ told her there was no way that that is what was going on.  And that the Hut o Pizzas couldnt take our tips out of our paycheck, but when I️ searched for it on their website I️ couldn’t find anything about their supplemental tip program or anything? \n\nBasically I️ just need to know if this pizza in a hut is fucking me without buying me traditional wing stop wings first, you know? \n\nPominos Dizza offered me a delivery job the other day so I️ have options open. ",
        "created_utc": 1510422255,
        "upvote_ratio": ""
    },
    {
        "title": "\"Go ahead and call my parents\" \"Okay then I will!\" (xpost from /r/maliciouscompliance)",
        "author": "Kushlord666",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7c8sjm/go_ahead_and_call_my_parents_okay_then_i_will/",
        "text": "Hey all, I posted this in /r/maliciouscompliance and thought you guys might like it. I'm not a driver but work cash and phones at a pizza place. Shitty formatting because I'm on mobile but I hope you enjoy!\n\nThe Background: This happened a few hours ago. I work at a large chain of pizza restaurants. Let's call it Pominos Dizza. Like most places, we get a few prank calls a week from pre teens. Usually it doesn't bother me and I'll go along with it because it gives me something to do when it's slow. But being a Friday night, we were busy and I wasn't having it. Me will be me, and K will be kid.\n\nThe events:\nMe: Hi thanks for calling Pominos Dizza, how can I help you tonight?\nK: trying but not succeeding in holding in his laughter Hey is Mr Wall there?\nMe: Um no sir there isn't one that work here.\nK: What about Mrs. Wall?\nMe: Nope none of those either\nK: Then how is your building standing up?!\nK: laughter from him and background\n\nThis went on a couple more times with classics such as \"can I place an order to your sisters house?\" And the CLASSIC \"is your refrigerator running? Then you better go get it!!!\"\nFinally I had had enough. I let the kids know I was done playing games.\n\nMe: alright look it says here that your dad's name is dads name (we keep names and addresses of past customers and their orders in the computer for future orders just to speed up the process) If you don't stop this I'll give him a call and let him know what's been going on.\n\nUsually this would stop the kids. I knew it did back in my earlier days of being a dumb kid. But some people just can't be bothered and have to push the envelope a bit too far.\n\nK: I know you won't. Go ahead and call him.\n\nOh boy he didn't have to ask me twice. I hang up the phone and get back to work for a little bit, knowing that the kid will be camped at the phone to answer it for the next 15 minutes or so.\n\nThe compliance: I get back to work, free of prank calls from the kid. I should of left it there, having solved the problem, but hey the customer is always right and at Pominos Dizza we always give the customer what they want.\nAfter the supper rush is done, around 45 minutes to an hour later I fulfill the request. I'm still me, D is dad.\n\nMe: Hello this is u/kushlord666 from pominos, how are you doing tonight.\nD: not too bad, what's the reason for the call?\nMe: unfortunately, we've been getting a number of calls from this number. We're really busy and its pushing customers away because of the wait times. Can you please have a talk with who I assume is your son and ask him to knock it off?\nD: Oh goodness I'm so sorry I'll have a chat with him and his buddies.\nMe: Thank you so much and thanks for choosing pominos!\n\nAt this point I think the story is done. Kid will get a talking to, won't do it again and that'll be the end of it. Boy was I mistaken.\n\nAround 30 minutes later a man and a chubby kid around 12 years old come into the store. I don't think much of it, thinking they're just getting a few slices for a snack. They come up to the counter and ask for u/kushlord666.\n\nMe: Yes I'm u/kushlord666\nD: I think my son has something to say to you.\nThe kid is visibly nervous. He keeps looking around the store, won't look me in the eye.\nK: I'm very sorry for calling you, I know you're busy and it won't happen again.\n\nThen to further the awkward suffering of the kid who I kind of feel bad for at this point, the dad places an order for carry out, and sits in our small eatery section where the kid has to try and avoid eye contact with me for the next 20 minutes. Left me a good tip too.\nAt pominos dizza, the customer always gets what they want.\n\nTl;Dr: Kid prank calls my store while I'm busy, dares me to call his parents. I give him what he wants. Gets forced by angry father to come in and apologize and brood in awkward suffering as I make them their pizza, while I got the last laugh and a 50% tip.",
        "created_utc": 1510412246,
        "upvote_ratio": ""
    },
    {
        "title": "It doesn't pay to speed but pizza delivery does",
        "author": "KNGRK9",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7c7uij/it_doesnt_pay_to_speed_but_pizza_delivery_does/",
        "text": "As I learned tonight finally got my first speeding ticket for a whopping 281$ (offered to pay him there for the fine, pulled out a wad of cash and waved it at him, he seemed pretty pissed at that.) Albeit completely bullshit and I'm very tempted to fight it. As I know the area well and where he says he clocked me at its right where the speed changes from a 35 to a 45 he got me at 46mph... Saying I was in the 35.\n\nWhich honestly I think could very easily be bested in court. Lots of people in my area of town tonight were getting pulled over. Must be end of the year quota needs.\n\nAfter all this I told my employer what happened  my employer looked at the ticket, laughed, and sent me on my way to continue working. Jokingly remarking \"at least you haven't ran anyone over like so and so yet\" \n\n",
        "created_utc": 1510398317,
        "upvote_ratio": ""
    },
    {
        "title": "\"So I just sign my name, right??\"",
        "author": "kneightwolf",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7c7p4d/so_i_just_sign_my_name_right/",
        "text": "*sighing internally* \"There's a spot for your name, a spot for the total, and a spot to tip if you'd like, I've already highlighted everything for you in advance..\"\n\nLiterally happens multiple times every shift lol. I've noticed that 9 times out of 10, if a customer asks where to sign (even after me highlighting the slip), they're gonna still stiff you. 'Tis the ways of delivery lol",
        "created_utc": 1510395417,
        "upvote_ratio": ""
    },
    {
        "title": "Sorry, Pizza Guy from down the road.",
        "author": "CGToste",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7c5g2z/sorry_pizza_guy_from_down_the_road/",
        "text": "My Dad (inebriated) asked me to order some Papa Johns from down the road, not even a mile.\n\nSo I got online, ordered a pizza and a brownie and after using Honey (really great extension, use it.) I saved 7 bucks and the total wasn't even high.\n\nI walk into my Dads room to get the money and he hands me a fucking 100 dollar bill and I told him that the Pizza Guy can't break 100 dollar bills. I asked for a smaller bill and he opens his wallet to show me that there isn't anything smaller.\n\nI go back into my room, sit down and pray the Pizza Guy has change for a 100. About 30 minutes later the Pizza Guy arrives and obviously he can't take my 100. I hear my Dad coming while the Pizza Guy is on the phone and I try to keep him from confronting the Pizza Guy.\n\nMy Dad is rude about it and acts like he didn't even know anything was ordered, Pizza Guy leaves.\n\ntfw I was thrown under the bus not only for having to answer with a 100, but my Dad acted like it was my fault.\n\ntfw I could have probably kept the 100 for myself\n\nedit : I deserve the downvote.",
        "created_utc": 1510362844,
        "upvote_ratio": ""
    },
    {
        "title": "No, I will NOT give you my PIN number!",
        "author": "Super_Zac",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7c4yk1/no_i_will_not_give_you_my_pin_number/",
        "text": "Took a delivery to this old dude, pretty routine shit. He gives me his card which has a chip, and I insert it into the portable card machine.                  \n\nNormally if it's a stripe it'll ask for a PIN (rare to see stripe only cards these days) and for a chip it validates automatically. However this time it asks for it, not sure why. This isn't a big deal, but the old dude FREAKS. First he misunderstands me and tries to grab the pen I'm holding, and then once I reiterate he starts ranting.                 \n\n\"I'VE NEVER HAD TO GIVE MY PIN NUMBER BEFORE AND I WON'T NOW. YOU DON'T NEED TO KNOW THAT.\"              \n\n\"Sir it just needs it to validate the transaction, I won't even see it you just need to type it in.\"              \n\n\"I WON'T DO IT, THAT'S NOT YOURS TO KNOW.\"                  \n\nBy the way I'm inside his dining room because he's old and just told me to come in, so I'm awkwardly standing there why he walks around looking for cash. Eventually he finds enough and I leave as fast as possible.                 \n\nLike dude, have you never used a card before? It'll ask for your PIN sometimes. I'm not trying to steal it or anything. Either way, it made me chuckle that he kept calling it a \"PIN number\".",
        "created_utc": 1510357719,
        "upvote_ratio": ""
    },
    {
        "title": "Guy buys wrecked Dominos DXP for only $525",
        "author": "DracoAzuleAA",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7c37ya/guy_buys_wrecked_dominos_dxp_for_only_525/",
        "text": "I thought this was pretty interesting.  He also buys a flooded Chevy Spark for $1,500 to get salvage parts from.\n\nhttps://www.youtube.com/watch?v=cTP5UtOYOds\n\nHe then posted an update video.\n\nhttps://www.youtube.com/watch?v=LbrVpIDS9XY\n\nApparently Dominos wants him to remove the original video, citing that he improperly obtained the pizza car.  Last I checked it's not illegal to own a car that's been modified with extra drink holders and a warming oven in the back.  They also cited the branding plastered on the car showing up in the video, which is BS\n\nFor the total cost of the car and repairs I'd definitely go for it.  I could repaint it and remove all the branding if I had to, but I'd keep everything else.",
        "created_utc": 1510340842,
        "upvote_ratio": ""
    },
    {
        "title": "I have no clue what you're offering me but I'm gonna pass.",
        "author": "jongargia",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7c115a/i_have_no_clue_what_youre_offering_me_but_im/",
        "text": "The other night I delivered to a trailer with two residents. They were a couple who were obviously a bit high, chilling out with the only source of lighting being blacklight and LED stuff. The exchange goes fine although I don't remember if the guy tipped me.\n\nWhen I'm almost to my car, though, the guy yells out at me \"Hey, you like balloons?\" I'm almost certain this is just a super stoned guy making conversation so I tell him sure. \"You know what balloons I'm talking about, right?\" I very much do not, but I don't want to stand around making conversation in the cold with my car running, so I told him thanks, but I'm driving right now.\n\nEven after Googling around and asking some more savvy friends, I have no clue what was proposed to me. I'm guessing it's drug slang, but the only \"balloons\" I can think of there are the methods of smuggling shit. Reddit, what did I just encounter?",
        "created_utc": 1510320000,
        "upvote_ratio": ""
    },
    {
        "title": "You're being a pizza snob? I will get free pizza at your expense.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/7bk4vl/youre_being_a_pizza_snob_i_will_get_free_pizza_at/",
        "text": "[deleted]",
        "created_utc": 1510314655,
        "upvote_ratio": ""
    },
    {
        "title": "\"False advertising!\" screamed the manbaby",
        "author": "Striker__Eureka",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7bxkxj/false_advertising_screamed_the_manbaby/",
        "text": "Around a year ago, I had to deal with an angry customer on the phone who was trying to tell me that it was \"false advertising\" because of our phone recording. He was trying to say our recording when you call the store said \"2 large pizzas for $9.99.\" This happens more commonly than it should, which is irritating because the recording clearly states \"$9.99 each.\" So either people don't hear it or try to play it off like it says that in order to cheat us out of money.\n\nAs the guy was yelling at me, I asked him if he could hold on second while I brought up the recording. I put him on hold and called up the store on my cell phone. Literally the first thing stated was \"2 large pizzas for only $9.99 each!\" I came back on the phone and said, \"Sir, I just listened to the recording and it states that the deal is $9.99 each.\"\n\nHe continued to scream at me, asking him if I was calling him a liar. I maintained that he was only mistaken and that was okay, and I tried my best to remain professional. As soon as he started cursing, I said \"Sir, you will not speak to me that way. Goodbye.\"\n\nHe left us a bad review online saying we had false advertising and we weren't honoring our specials.\n\nHe still orders from us.",
        "created_utc": 1510273714,
        "upvote_ratio": ""
    },
    {
        "title": "I work in healthcare full time and deliver two or 3 nights a week depending on my schedule",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7bx82a/i_work_in_healthcare_full_time_and_deliver_two_or/",
        "text": "[deleted]",
        "created_utc": 1510269762,
        "upvote_ratio": ""
    },
    {
        "title": "Reporting Milage on Taxes",
        "author": "invalidusernamelol",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7bvzgj/reporting_milage_on_taxes/",
        "text": "What's the best way to report you milage when doing your taxes? I was going to use the stores log, but a coworker said that wouldn't withstand an audit. Should I keep a personal log? I have location history turned on so I could retroactively see when I was driving.",
        "created_utc": 1510258492,
        "upvote_ratio": ""
    },
    {
        "title": "Making a car last doing this job.",
        "author": "TheDriver2431",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7bvt8r/making_a_car_last_doing_this_job/",
        "text": "I'm driving a 1996 Acura integra ls. It's small but it's a hatchback so it can fit anything. \n\nThe main problem with the delivery job is constantly turning you car off and on using your starter. So I modified my alarm system so I can lock my car with the remote while the car is still running. \n\nSecond is the engine itself. I'm using full synthetic oil and doing changes every 3000 miles. \n\nAlso changing the transmission fluid every 30k mikes. \n\nIf you have any other suggestions please comment. ",
        "created_utc": 1510257013,
        "upvote_ratio": ""
    },
    {
        "title": "The tip bro",
        "author": "daftpunk34",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7buusd/the_tip_bro/",
        "text": "First off, people in Nashville are assholes when it comes to tipping delivery drivers, I've had my manager not tip delivery drivers before (until I called them out). Panera also doesn't care about their drivers, no \"delivery fee doesn't go to the driver\" or \"please tip your driver\" on the delivery slip or the website. The scheduling manager also doesn't understand that we can't only have one person working nights, even though nights are sometimes slow, we usually get a really busy night, which is when this story occurs. \n\nI had about 5 deliveries on the dispatch screen that were on opposite sides of our radius with about 20 minutes of traffic in between each of them. This means that someone is going to get their food late which usually means no tip for me if they didn't pre tip. Two of the deliveries were to a concert venue. This usually doesn't bother me because Nashville is a town where we have lots of concerts and lots of people who work at them. Two people ordered from a venue, and both of them put \"We're in line for the concert\" and they wanted tea. At Panera we have like 8 different teas and people usually put their preference, but they did not. So, I just grab whatever tea I could get and put them in the cups hoping that they wouldn't spill in my car. I get to this venue which has horrible parking to begin with and I stand in an open area with my disgusting orange jacket trying to call these people. I finally get a hold of them and while one person tips, the other one doesn't. As I'm leaving, I hear a voice come from the \"staff only\" area of the entrance. I turn and look to see a very overweight man wearing all black, except for a silk scarf that was extremely colorful.\n\n**TB** = Tip Bro **M** = Me\n\n**TB**: Did they seriously just order coffee? (I wasn't going to correct someone making small talk like an asshole)\n\n**M**: Yeah, and they didn't even tip. Like most people in this city\n\n**TB**: That sucks man, but you know what? Here you go.\n\nHe reached into his shirt pocket, pulled out a $5 bill and handed it to me. Now me being very polite, I refuse it, because he wasn't my customer.\n\n**TB**: No, I insist. People should realize that they need to tip food service workers.\n\n**M**: If you really insist. (I take the money) You're the best dude, have an excellent night.\n\nWhen I turned around to actually finish that statement, he wasn't there. It was weird but I feel like the gods of delivery had smiled upon me that day and sent a tipping angel to make sure my night was a little better.",
        "created_utc": 1510248933,
        "upvote_ratio": ""
    },
    {
        "title": "Would you watch a pizza delivery video series?",
        "author": "aaronkellysbones",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7buaam/would_you_watch_a_pizza_delivery_video_series/",
        "text": "https://www.youtube.com/watch?v=LRxmrlAiiYQ\n\nJust wondering if people would watch a channel like this; my friend is trying to figure out if it is worth his time making videos like this. I told maybe he can get a better editing software, but as a concept I like it. I told him to be sure to be really careful not to disclose ANY customer information whatsoever. Also, don't disclose the shop he works for so he doesn't get in trouble.\n\nWhat do you all think?",
        "created_utc": 1510243959,
        "upvote_ratio": ""
    },
    {
        "title": "Alternatives to pizza delivery?",
        "author": "tostadatostada",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7brzhc/alternatives_to_pizza_delivery/",
        "text": "Hi everyone!\n\nI've been doing pizza delivery at two of the Big 3 on and off since 2013. It makes great money but is awful as far as basic human rights and hard labor go (closing specifically - I closed for 6 nights a week for a few months and that fucking killed me). \n\nWhat else can I do that gives me roughly the same income? I'm in California, working ~24 to 28 hours a week and making about $1600 a month before taxes, including tips. I am a college student (with no financial aid outside of student loans) whose schedule changes pretty often because of new classes.\n\nEvery time I've quit, I've found new employment but have ultimately gone broke and been forced to return back to slinging pizzas. I hate it.",
        "created_utc": 1510214579,
        "upvote_ratio": ""
    },
    {
        "title": "Best and worst place to deliver for?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7bqpnr/best_and_worst_place_to_deliver_for/",
        "text": "[deleted]",
        "created_utc": 1510197913,
        "upvote_ratio": ""
    },
    {
        "title": "What was your first time being yelled at on a delivery that wasn't related to pizza or being late?",
        "author": "SpicyDucks",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7bm0sz/what_was_your_first_time_being_yelled_at_on_a/",
        "text": "Mine happened to me last night\n\nSo I was on a routine delivery on a cloudy/rainy night. The house was down a long gravel road in the woods off of one of the highways near my store. I found the customers house at the end and saw his porchlight on. It was about 7pm (daylight savings so like 8pm darkness outside) I couldn't really see where the driveway was at first. I pulled down the road when I eventually saw it on the right. Pulled in, delivered the pizza, guy was cool tipped me okay, had to keep my voice down cause someone was asleep or something in the living room. Anyways, normal stuff. So I left and went back to my car. Alright this is where it goes off the rails. So I get into my car, and try to figure out how I'm gonna turn around and leave. I decide just to start backing up until I don't see trees to my left. After a few seconds I find a spot a place where I though I could back up and pull straight out. As soon as I start to pull out, I start to hear what sounds like yelling from the house. All I could think of at this point was \"Damn I probably forgot something, maybe ranch? maybe a drink? Ugh...\" So I got outta the car. Immediately it became clear that something else was wrong. He started YELLING at me, saying \"WHAT The FUCK ARE YOU DOING? YOU ARE FUCKING DESTROYING MY LAWN! YOU'VE DAMAGED MY FUCKING PROPERTY! WHAT THE FUCK! I HAVE A FUCKING CIRCLE DRIVEWAY YOU FUCKING IDIOT\" I immediately feel bad and go into apologize mode, I tried to explain how I didn't see the driveway and how I really could barely see anything at all. He just keeps at it. I eventually realized there's nothing I could do to appease him so I said sorry sir have a good night. So I hopped into may car. Next thing I know this guy SLAMS my door in my face as hard as he can. This pisses me off, I should've just drove off but when I'm mad like most people I don't think. I got outta my car and next thing I know this guy is in my face. \"JUST GET THE FUCK OUTTA HERE\" he says in combination with other things. I let him know how I don't like how he's basically threatening me over grass. I think he thinks I'm gonna hit him or something cause he's like \"YOU DONT WANNA DO THIS SON\". He eventually backs off and says \"LEAVE AND NEVER COME BACK\", So I tell him sorry again and get back in my car. Of course, he slams my door AGAIN! but this time he walks off immediately and I decide it's just not worth my time anymore. I make sure my doors alright (he yells something when I open it slightly). And drive off. I've never had anyone THAT mad at me before for anything. I later get back to Pizza hut and my managers working that night are kinda in a half laughing mode asking me WTF happened. Apparently the guy is a regular who normally tips very well and has our in-store number. He'll still order, but if I'm the only driver he'll cancel from now on.\n\nOverall, yeah I need to be more careful and make an extra effort to be observant so I don't accidentally drive into someone's lawn. But I feel as if this situation was unavoidable at the time and this guy has some severe anger issues he needs to work through. I'm just glad he didn't have a gun. Who knows what he would've done then...  ",
        "created_utc": 1510155034,
        "upvote_ratio": ""
    },
    {
        "title": "Do people really pay for everything in wadded up bills?",
        "author": "AcidBathVampire",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7blzab/do_people_really_pay_for_everything_in_wadded_up/",
        "text": "You get these people who look like respectable adults, and they hand you a wad of crumpled bills like a child would. I'm pretty sure they don't keep it balled up in their pockets all day, why do they give it to you that way? I count out all the money first (I give a fuck what corporate wants) and it is embarrassing for me to have to kneel and put the pizza on my knee to be able to sort through their gnarled mass of money. I feel like I'm dealing with retards when I do that. I hope they feel that way, too.",
        "created_utc": 1510154635,
        "upvote_ratio": ""
    },
    {
        "title": "Someone just asked us to deliver one of our NY strips without cooking it...",
        "author": "ihavespaceballs",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7bi4jr/someone_just_asked_us_to_deliver_one_of_our_ny/",
        "text": "And then was mad as hell that it would still cost the same.\n\n\"But I'm cooking it myself!\"\n\nBitch go to Kroger, this is a restaurant.",
        "created_utc": 1510106426,
        "upvote_ratio": ""
    },
    {
        "title": "I swear to fucking god, is there a single apartment complex thats designed in a way that makes any fucking sense?",
        "author": "usedbathagua",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7bh1hs/i_swear_to_fucking_god_is_there_a_single/",
        "text": "In my delivery range for panera, theres two main apartment complexes that people order from the most. Really big, nice ass apartments, the kind of apartments you'd expect people that order panera for delivery. Every fucking time i go to these two apartment complexes, the building numbers make sense for all of maybe the first two buildings and then whose to say where the building youre looking for there. I shit you not one day i was looking for building 18, and couldn't find it, so i parked next to building 19 assuming it would be close. Fuck no it wasnt. Five minutes of walking across literally the WHOLE ENTIRE FUCKING COMPLEX later, and i find the building. Fuck that shit.\nFuck apartments. Dont even get me started on the speed bumps in mobile home parks. Ugh.",
        "created_utc": 1510095794,
        "upvote_ratio": ""
    },
    {
        "title": "\" I dont have any cash man. But... \"",
        "author": "Nerdking256",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7bfqgk/i_dont_have_any_cash_man_but/",
        "text": "Dude orders for carry out and realizes 30 minutes later that he clicked the wrong button on his phone and needs it for delivery. I process his credit card again for the $2.18 delivery charge and head out with both of his payment slips, cheesy breads, and 4 20oz drinks.\n \nAfter the 20 minute drive out to the guard shack of the plant he is working at I pull up and this mother is waiting inside for me to walk up to it. It is staring to rain as i get out of my car and walk up the steps inside the guard shack. \" here you go man. i just need a signature on both of these slips \" i say with chipper delight. \" I don't have any cash on me man, I'm sorry \" He retorts. I point down at both tip lines and assure the oaf that i will get the tip if he wants to write it in on either of the slips i have provided for him. While he is signing is pull out his unnecessary amount of carbs and sugar water for him and place them on his guard counter. he hands me back the slips with a \" Here you go. I don't have any cash man but you can have this.\" \n\nI look down into my hands to find i have been given a warm, room temperature canned yoo-hoo. jackpot. i can pay my landlord now in chocolate drink and the tales i will sing of this gracious king and his bounty i have been bestowed. i pour it out in the parking lot right next to my car and crush the can right where he can see it and has to pick it up during his rounds. i take the long way back to the store just to cool off. \n\nWhat are some physical items you have been given as a tip?",
        "created_utc": 1510084381,
        "upvote_ratio": ""
    },
    {
        "title": "Crazy customer plan",
        "author": "the_eluder",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7bf7hn/crazy_customer_plan/",
        "text": "So last week we had a customer order and they smacked the pizza out of the driver's hands as they pulled it out of the bag, then refused to pay.   Driver picked up the pizza and left.  The customer did the same thing to a different driver the next night.\n\nThe third night they ordered to their neighbor's house then tried to flag down the driver as they passed their house.  Driver didn't stop.\n\nThe fourth night we just told them no delivery.\n\nLast night, they ordered again.  Our manager has been on vacation for a couple of weeks, and didn't know about the problems there (it was his first night back.)  Another driver told him as soon as he came back from a run, but the pizzas were already in the oven (they used a different phone number.)\n\nSo I get back to the store, and it's my run.  There's another delivery nearby, so I say I'll take them as a double, and give them one last chance.\n\nI show up at the house, and have a tight grip on the strap on the bottom of the bag.  I knock, and the guy I can see inside (the door is open) tells his buddy I there.  Guy comes out, no money in hand.  I tell him the price.  He says, \"Let me see the pizzas first.\"  I reply, \"Nope\" in my most dead pan voice.  He says, \"Well, I don't want them pizzas then.\"  I retort, \"Don't ever order again!.\"\n\nI then leave.  We enjoy eating his pizzas when I get back to the store.  WTF is wrong with some people?  I mean, what was his end goal with this little stunt?",
        "created_utc": 1510079939,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'm gonna fold these two $1 bills as many times as I can, that way the driver won't think that I'm barely tipping him!\"",
        "author": "zwinky588",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7b81yg/im_gonna_fold_these_two_1_bills_as_many_times_as/",
        "text": "-the people i deliver to probably",
        "created_utc": 1510001446,
        "upvote_ratio": ""
    },
    {
        "title": "The man who didn't get his way. Alternatively: Learn how to coupon.",
        "author": "NotSoGrownUp",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7b3i95/the_man_who_didnt_get_his_way_alternatively_learn/",
        "text": "So another story on here reminded me of this delivery I took when I first started out delivering pizzas. \n\n\nApologies for the formatting and poor story telling abilities. \n\n\nTL;DR: Customer couldn't afford order. Used coupon for two pizzas. Wanted one for half the price of the coupon. I wasn't going to do it his way. Recalculated his total with different coupon. \n\n\n\n---\n\n\nSo it's dinner rush... I get a pretty common order of two medium pizzas for about $6 each (used the $6 each two or more coupon that we have, obvious by the total) and a soda. The order was going to a not so well to do part of our delivery area and was to be paid with cash on delivery. \n\n\nI get to the house and ring the doorbell. It took a minute or so, but he answered the door and I give him the basic \"How are you doing tonight?\" pleasantries with a smile, because customer service, and read him his total (about $19). He admits to me he doesn't have enough money to pay for both pizzas, but instead wants one of the $6 pizzas and the soda for $13.00, and tries to hand me the money. \n\n\nNow I haven't done this before, or heard of any other drivers at our store doing this, but I wasn't about to give into this guy just because he was the customer. I've heard stories, I knew things, not a lot of things, but things. I knew, for instance, that he'd complain if I just went back to the store with his order and most likely get his order for free. I also knew that if I gave him the pizza and the soda for $13.00, my manager would probably be mad at me for not getting the whole total and I might've gotten written up for it. Being my first job and a newish driver, I was legitimately scared of those consequences. \n\n\nThen I had an idea. \n\n\nI immediately inform him that the coupon he used doesn't work for anything less than two pizzas and that if he wants to buy only one, I'll have to give him a new total with a different coupon, which I'm willing to do. (In all honesty, I don't remember our menu prices for pizzas and our coupons were easier to go with.) \n\n\nHe, of course, looks confused and asks why, if both pizzas are $6 each, can he not buy one for just $6. I explain again, \"Sir, both pizzas are $6 each if, and only IF you buy TWO OR More PIZZAS. The pizzas themselves are not $6, but it is the COUPON that makes them $6. We do, however, have a coupon for one medium pizza for $9.\" \n\n\nHim: \"But they're $6 each.\" \n\n\nMe (smiling): \"Your order no longer qualifies for that coupon as it's one pizza and one soda. The coupon is for two pizzas. Here, let me get your your new total.\" \n\n\nAt this point I put the soda on the ground, bust out my calculator (on my phone), and immediately do the calculations in front of him explaining every step like he was my seventh grade math teacher looking for my work on a homework assignment. \n\n\n\" With the new coupon your order qualifies for, it'll be $9 for your pizza, $3 for the 2 liter, $2.50 for the delivery and we'll add 8.25% of all of that for the sales tax. Your new total is $15.69.\"\n\n\nHe looked at me and back at my phone a couple of times and says he can't afford that either showing me the money he has in his hand, which was only $13.\n\n\n\" OK, no worries!! So we'll take the soda away. Your new, NEW total is $12.44!!\" Perfect! He can afford that!! \n\n\nI ask him for the money and which pizza he'll choose. I think I worked so fast that he just was confused by it all because there was no fighting. He handed me the money he had and I gave him his pizza. Closed the hot bag, handed him $0.50 in change, grabbed the soda, wished him a good night (don't forget that smile!) and got to my car. \n\n---\n\nEpilogue for the curious:\n\n\nI got back to the store and my manager looked confused with me bringing back half of the order. I explain to him what happened and he laughed and said he'll re-ring the guy's order to reflect the new total. Not too exciting, but it felt really good to have control over the whole ridiculous situation. \n\n\n\nI don't think that man has ordered for delivery since that day. I probably annoyed him.",
        "created_utc": 1509950825,
        "upvote_ratio": ""
    },
    {
        "title": "\"So I gave you the wrong address and phone number and you're not going to bring me my food after delivery hours?\"",
        "author": "CaptXawesome",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7b3h1h/so_i_gave_you_the_wrong_address_and_phone_number/",
        "text": "I'm just here to vent right now and hopefully you guys can help me with a rebuttal in case I get written up.\n\nSo it was a slow Sunday. Very slow. And we closed down just about everything exactly on time to cover our asses. And I had all the dishes and the dish pit cleaned and done. I was ready to come home and finish up my archaeology homework. \n\nThe phone rings at 9:50, right before deliveries end at 10:00. 'Okay, fuck you lady'. But I begrudgingly get the order ready and bring it to the address my Google maps directs me to. -now sidenote, sometimes Google maps gives us the wrong location, it happens but if you fuck with it a bit it will find the location, generally 10/10 times- low and behold, the house doesn't exist, as you may have inferred from the title of this self post. So I go ABOVE AND BEYOND, and I MapQuest this shit, I'm just trying to go home. \n\nThe mapuest directs me to a different location, close, but on the other side of a major road. 'okay, fine let's try that' I go there. -again- nothing no such address exists. Both Google and MapQuest led me to mile markers or some bullshit late April fool's prank. \n\ni call, no answer. I call again, no answer. I TEXT, (THIS LINE CANNOT ACCEPT TEXTS MESSAGES) I call for the third time, again surprise! No answer. I call the store, talk to the bartender who took the order and she says 'okay, bring it back and we will void it out'. \n\nI head back to the store, angry that I couldn't fulfill my primary directive as a pizza driver. But still just ready to go home. My dish pit is covered in shit, my freshly mopped floors are covered in dirty footprints, and lemons from this bartender's glasses. My anger raises a bit more. But I go check in with her 'I'm back and this needs to be voided out. '\n\nShe takes over and voids it out as my head chef tells me to GTFO. AGAIN, I GO FURTHER ABOVE AND BEYOND. And I take care of the kitchen dishes in my pit from the order, re-mop and close my shit out. And get ready to clock out. I talked to the head chef again and filled him in and told him I finished up the dish pit for him. Again, I'm told to leave. \n\nSweet victory, it's time to go home. I am in the process of clocking out and the bartender comes back and said the lady called, furious. Admitted she gave us the wrong phone number, and the wrong address!! Okay, sorry about your bad luck lady, I did my job. Not my fault. And this bartender tried telling me I have to take it now. \n\nSorry, Ma'am but my job here is done. Again, foolishly instead of clocking out and telling her to fuck off. I talk to the head chef. He agrees it's not my problem, and that as long as it gets delivered. He could care less. The waiter with no tables volunteers to take it. I go and clock out and go to to the back door to leave. And I hear this bartender talking about writing me up! \n\nSo that's the story. I left from there and typed this instead of my essay, but I'm not sure wtf to do. I'm gonna see my GM tomorrow, he works with me. And he knows I bust my ass. Am I going to catch shit for this? What would you have done?\n\nUPDATE: apparently he's furious about this. He told another one of the drivers how mad he was. I'm just going to be honest, I assume the bartender told him her side of the story.\n\nUPDATE AGAIN: my manager and I talked and basically he said that ilhe wasn't mad about it. He understood, although he said I probably should've just stayed and done it, even though it sucks. It would relieve a lot of conflict. I definitely get where he's coming from and I ended up not being written up. So mark this one in the win category, fellas.",
        "created_utc": 1509950448,
        "upvote_ratio": ""
    },
    {
        "title": "The lady thought she was making a point to me?",
        "author": "austinthesalt",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7b3agu/the_lady_thought_she_was_making_a_point_to_me/",
        "text": "Had a really simple deliver pop up today, two pizzas to a house about a mile down the road. When I got there the customer tried paying me with a 100 dollar bill on a 23 dollar tab, couldn't do that unless she only wanted my 15 dollar bank so that set the tone for this trip. She finally got the money together in smaller bills and I gave her the pizzas. She then started yelling that she ordered wings and when I showed her the receipt she gave the pizzas and the change back and I gave her her money back and she said she would just boil hot dogs before slamming the door in my face. After my shift I very much enjoyed eating the free pizza she could have had. Love this job ",
        "created_utc": 1509947941,
        "upvote_ratio": ""
    },
    {
        "title": "\"Bet you thought you were gonna get to go home on time huh??\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7b2vik/bet_you_thought_you_were_gonna_get_to_go_home_on/",
        "text": "[deleted]",
        "created_utc": 1509942538,
        "upvote_ratio": ""
    },
    {
        "title": "\"Thanks man, I really appreciate it\"",
        "author": "CDFReditum",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7b2p38/thanks_man_i_really_appreciate_it/",
        "text": "I've learned that this phrase is a guaranteed no tip\n\nI think it finally clicked like a few days ago, so I've been thinking about it every day since. And it's been pretty true, I'll give the customer their order (I know technically \"oh give them the receipt first\" but like whatever lmfao if they try to steal the pizza I can just call the police lmao), and they're like \"thanks dude I really appreciate it\"\n\n\"Yeah haha go ahead and fill this guy out for me\"\n\n\"yeah dude thanks so much\"\n\n\"yeah haha\"\n\nS T I F F E D.\n\nThe last time this happened the dude just kept on saying it over and over again and was like \"thanks so much man\" and his fucking receipt just underlined the total like boy lmao no amount of appreciation is going to make my wage become a minimum living wage",
        "created_utc": 1509940423,
        "upvote_ratio": ""
    },
    {
        "title": "Getting stiffed at a McMansion is a good lesson in trickle-down economics.",
        "author": "extremeperson123",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7b2n4m/getting_stiffed_at_a_mcmansion_is_a_good_lesson/",
        "text": "",
        "created_utc": 1509939808,
        "upvote_ratio": ""
    },
    {
        "title": "Coming out of retirement as a GM and am about to fire half of the employees at the shop I am being given.",
        "author": "HistoryIsAwesome__",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7az484/coming_out_of_retirement_as_a_gm_and_am_about_to/",
        "text": "I quit my GM job back in March. Had done an amazing job and we were the best store in my franchise group. \n\nI quit due to the owner sucking and running her business into the ground (her husband bought a bunch of stores and knew how to run them. He died and she was clueless about managing the business that fell into her lap).\n\nShe sold to a new owner who called me up and offered me my old job back with a generous pay raise. I accepted the job offer and holy shit. It's only been eight months but my once beautiful store is in a sorry state of affairs.\n\nAll but two of my old staff quit. The people they have in there now are all terrible. Never were trained correctly on how to make the food. Lack any semblance of customer service skills. Call off all the time. Smoke weed before/during work. There is mold and expired products everywhere. Place is fucking gross.\n\nGoing to be firing at least half these clowns over the next month or two and start building a functional store again.\n\nJust wanted to rant a bit and say I'm back! I love working at pizza shops. Fun and casual work environment - yes please.",
        "created_utc": 1509904953,
        "upvote_ratio": ""
    },
    {
        "title": "That's not how \"Buy one Get one\" works...",
        "author": "Just_a_hermit",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ayrv6/thats_not_how_buy_one_get_one_works/",
        "text": "Howdy. Long time lurker, Ftp, all that jazz. I don't post to reddit too often, so forgive me if formatting is off.\n\nThis happened several weeks back. I'm working mid shift on a Sunday, and get a delivery for some less than appealing apartments down the road. I work for one of the big 3, and we had a BOGO special going on. I get to the complex, and knock on her door. \n\nA man answers, and just as I'm pulling the pizza out and telling him the total he owes (cash delivery), he cuts me off and says \"we can't afford both pizzas, we'll just take the free one.\" \n\nI'm kind of stunned at this point, and unsure of how to proceed. I've met plenty of scammers and idiots in my time, and I wasn't sure which I was dealing with this time. I explain we can't do that, and a woman comes out of the apartment and starts chewing me out. Name drops my GM, says she (the gm) already cleared it and approved it. I explain I would have to call the store and confirm, as I wasn't told this before I left. She gets pissed off, and follows me to my car while I make the call. (I don't take my phone with me, as if I'm robbed and it's taken I could be fired). \n\nThe manager gets angry at hearing what was going on, but being new to the store just opted to give them the free one but they had to pay the delivery fee. I tell this lady this, and she tells me to hold on. She goes and gets the money, and also brings me a complimentary pizza card saying that should cover the other one. I inspect it and inform her it was only valid for one store, and she'd have to go to that store to use it. She cussed me out some more, gave me the delivery fee in change, and walked away cussing me some more. \n\nFast forward a few weeks later and she calls again asking about credits on her account. I answered the phone and recognized the address, and told her she didn't have any credits currently. \"I don't have any, or you just ain't gonna give em to me?!?\"\n\nAt this point I'm just done with this bitch. It's slow, so when I get off the call (she got nothing) I do a little research. Turns out this woman has been scamming us since July. Numerous names and numbers all going to the same apartment, all free (over ten orders, around $30 each). I point it out to my new GM, and she got blacklisted. \n\nThis job truly makes you lose faith in humanity....",
        "created_utc": 1509901729,
        "upvote_ratio": ""
    },
    {
        "title": "Who does that? Really?",
        "author": "woolsey1977",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ayra4/who_does_that_really/",
        "text": "Just subscribed, so I don't know how often this happens.\n\nIm on a double, and i get to my first stop, make the delivery, all is right with the world.\nThen the guy comes over and tells me i gave him the wrong pizza.( yes im a moron. This was established many decades ago.) i thank the guy for catching it and saving my ass. Its then that he informed that he already ate some of it \" by accident \". Cue professional happy face mask. I give him the correct pizza, and he asks what he should do with the other one.( you cant use it any more so i should keep it face.....ummm, fuck you, no). So i take it back and call the shop to tell the new guy who answers we need an expedited remake. I get back and go to check on the remake and salt on the wound, no one knows what im talking about.(I don't think new guy is long for this world- assistant store manager lady was already severely displeased with him.)\n\nSo anyway, i was severely butt hurt for the rest of the night.\n",
        "created_utc": 1509901571,
        "upvote_ratio": ""
    },
    {
        "title": "What's the longest delivery shift you've done?",
        "author": "austinthesalt",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7awmyp/whats_the_longest_delivery_shift_youve_done/",
        "text": "Just got off from a 13 hour shift at one of the big three pizza places. In that shift I had a guy insist multiple times I needed to deliver his pizza to his dinner table [i refused], had a guy call my manager because he didn't have the debit card he placed the order with, and watch a guy kick his dog. ",
        "created_utc": 1509873146,
        "upvote_ratio": ""
    },
    {
        "title": "Daylight Savings Time",
        "author": "KNGRK9",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7awjb9/daylight_savings_time/",
        "text": "Ohhh boy tonight was /fun/ \n\nWe had a few customers thinking it would be funny to call at 1AM (Technically 2AM since time went back an hour) trying to order. We obviously weren't going to stay open the extra hour.\n\nWe had quite a few customers call right at closing, we stop taking orders 15 minutes prior for reasons like this but one in particular stood out. He was very determined to try and order. When told \"Sorry we are closed\" he quipped back \"NO YOU'RE A FUCKING IDIOT AND YOU'RE WRONG AND YOU HAVE TO TAKE MY ORDER.\" \n\nManaged laughed and hung up on him.\n\nWe decided to check his number... turns out he was blacklisted back from when he sexually harassed one of our female drivers. Quote \"Hey, can you send your female driver out? Do you mind if I finger her?\" he tried calling the next day lol sorry im drunk. ",
        "created_utc": 1509871121,
        "upvote_ratio": ""
    },
    {
        "title": "The best stiff I've ever had.",
        "author": "soproductive",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7avf4y/the_best_stiff_ive_ever_had/",
        "text": "I'm about to share a great (and long, I apologize I'm not the best story teller) story we all  (somewhat) yearn for as servants in the food industry. To preface, I'm not asking for validation or some circle jerk, because to an extent, neither of us were in the right, but that doesn't take away the satisfaction I received from this confrontation.\n\nSo, we open at 11am, get a call for delivery to a business a little before noon for a couple pizzas and a bunch of sodas that comes out to 62 bucks and some change. Normal day so far.. I take it, the guy requested I call him when I get there, so I do just that and get no answer twice. I end up running into him near the front entrance.\n\nEverything is friendly, and he asks if I have change for $100. We all know that none of us carry a bank bag for that (safety issue), but I had $30 on me at the moment. I offer that and note the 7 dollars and some cents short, hoping he writes it off as a business expense and tips me that $7 (very common in the affluent area I work, especially on a $62 order). \n\nHe doesn't say anything about just leaving it as a tip, so I quickly offer to call the store and change it to a credit card order.. \"I don't have any cards on me, only cash\".. (what are you, 13? Who doesn't have a credit or debit card on them in 2017?).. Then he comes up with the idea of following me back to the store to pay for it there. Whatever, fine with me if you really want to stiff me that badly.\n\nOn the drive back I call the shift manager to let him know what's going on and how ridiculous this is. So we get back, he comes in and starts complaining to us about how I didn't have change and he had to \"leave his post\" at work because of it after I gave him the extra $7 I was originally short. Then he asks for the exact pennies. OK no problem, but he has quite the attitude now - my manager and i both deliver/manage (we've worked together here for years now), so we're more than familiar with and sick of assholes like this. It's one thing to stiff the driver, but another to be a dick while you do it and start complaining to *us*. \n\nSo, after he's done complaining to us about how I didn't have change, my manager(M) Says (very calmly) something along the lines of \"you're just gonna stiff him like that?\"\n\nCustomer- \"stiff who?\"\n\nM- \"*him*\" *motions over to me*\n\nAnd I'm standing right next to my manager behind the counter..\n\nThis guy just blows up and starts yelling at us.. \"ARE YOU *FUCKING* KIDDING ME?! YOU'RE GONNA BARK AT ME LIKE THAT?!? YOU'RE LUCKY I HAVE TO GO BACK TO MY PLACE OF WORK....YOU GUYS ARE THE ONES STIFFING ME, I HAD TO LEAVE WORK BECAUSE YOUR DRIVER DIDN'T HAVE CHANGE!\" \n\nMy manager straight up just calls him out in the calmest way.. \"You're a dickhead.\"\n\nThe guy is flabbergasted then keeps yelling at us..\n\nThen, he turns to me like I'm going to side with him and goes \"I'M THE CUSTOMER!!! AM I IN THE WRONG HERE?!??\"\n\nI immediately snapped back \"YEAH. YOU ARE. No Drivers carry change for 100.\" (I would've explained why, but he cut me off with more bitching and I wasn't about to get into a yelling match in the store) \n\nhe asks for our names, which I gladly gave (we're friends with our boss, we both know neither of us are going to get in any trouble for this), and he continues to bitch at us about how we handle our customers.\n\n Internally I'm thinking, \"no, this is how we handle the 1 millionth asshole, you're just the straw that broke the camel's back and you're getting a fucking wakeup call and put in your place.\" But, we all know this one incident will not change such a short sighted person's shitty inconsiderate and oblivious attitude.\n\nAnyways, my manager tells him \"just get out of here\" repeatedly. So dickhead leaves after letting us know he's going to call and complain about us. Good luck pal, our boss is hearing it from us first and nothing will come of this, I guarantee it. Actually we already spoke with him and that's exactly what's happening. \n\nWe got to finally speak our minds to a stiffing asshole, even though I'll admit our customer service was lacking there. Ideally we would've saved face and not mentioned the stiffing, but honestly, it was his blowup to that comment/question that really escalated everything. When he started yelling and cursing in the store, it got all of us riled up. \n\nIn retrospect, I almost wish I said more (mostly explaining *why* tipping is so important, it's **obvious** he's never worked in the food industry or in retail), but getting to yell back at him that he was wrong when he asked me was pretty damn satisfying in itself. \n\nFor his sake he better not order from us again. I don't *ever* mess with people's food, but for dickhead, I'll make an exception. \n\nI'm sure some people will see his side more than ours, and yeah, I'll be the first to admit what we did was far from professional and not the right thing, but goddamn it felt justified, and this guy needed to hear it from someone. Get a fucking clue, Don.\n\nI can't wait to hear what he says to our boss. ",
        "created_utc": 1509853415,
        "upvote_ratio": ""
    },
    {
        "title": "Everything was pretty chill at my job but one customer stood out",
        "author": "introvertsailors",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7auwmp/everything_was_pretty_chill_at_my_job_but_one/",
        "text": "This happened a while back when I delivered for a local Chinese food place. It was Halloween and I was taking phone orders and making deliveries. I took this lady's order and she requested that the driver call her when they get there cause she just put her kid to bed. I said sure it'll be me I will call you. \n\nI pull up in front of her house about 30 minutes after she placed the order. Nice middle class neighborhood in liberal California. I have an out-of-town area code btw, took out my phone and called her. Now, my phone was connected to the bluetooth on my car but I never used it cause it's shitty so I went to turn it off. It took me 2 seconds to turn it off and put the phone to my ear and say something. By the time I turned it off the lady had answered the phone already. I think she thought I was a telemarketing robot or something because as I put the phone to my ear I hear this:\n\nCustomer: Negroooo (casually as if no human was on the other end of the line)\n\nMe: Hey! This is the driver for CHINESE FOOD PLACE\n\nCustomer: (nervous laughter)Oh shit! Sorry \n\nMe: (just now registering in my mind what happened) uhh do you uhhh want to meet me outside?\n\nCustomer: umm yeah sure!\n\nI'm getting out of the car and thinking oh my fucking god I have to fucking give this bitch her food and not acknowledge that she just fucking called me a fucking negro, fuck dude what the fuck. \n\nI got to the door and it took about a minute before they opened it. Girl came out, asked how much it was no eye contact, 28 I said, she gave me 36 dollars no eye contact, I grabbed it and food hand-off, she immediately turns to go back in the house, I said have a good night, she closed the door and I left. So all in all it wasn't too bad... I still can't believe she said negro on the phone tho I'm not even black but really girl? \n\n",
        "created_utc": 1509846950,
        "upvote_ratio": ""
    },
    {
        "title": "Insiders - what do you do to get the smell off your hands after your shift?",
        "author": "tactics14",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7atuzc/insiders_what_do_you_do_to_get_the_smell_off_your/",
        "text": "",
        "created_utc": 1509835446,
        "upvote_ratio": ""
    },
    {
        "title": "Impressed a customer so much they went and got more cash for the tip",
        "author": "attlas93",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7at8zl/impressed_a_customer_so_much_they_went_and_got/",
        "text": "After a rocky start involving mixing up 2 very similar orders I got a single delivery to a house towards the fringes of our delivery zone. It's sort of a hills and valleys type of area with a lot of major roads that are the only way in and out of certain neighborhoods. I'm about three quarters of a mile away from the door according to google nav but as I'm about to make the second to the last turn according to the directions I'm stopped by a mulitple car wreck flanked by 3 Police SUVs and a pair of Flatbed tow trucks. I drive past thinking that I'll just be re-routed but nope, that intersection is literally the only way to get to the house I need to go to unless I want to drive over 5 miles out of the way to get to the far end of that street I need to turn on and work my way back. Dammit.\n\nI head back towards the wreck and keep driving looking for a street I can park on. I find a residential area about a quarter of a mile and park. 12 Minutes before this thing is late. I half-assuredly say \"I can do this\" to myself and set off. I go at a medium jog keeping the order close to my center of mass to try and not shake it too much and head past some confused looking cops around the corner. I now realize that I am a lazy fat fuck who really needs to start doing his cardio again. After what felt like forever I finally get to the last turn. It's a hill. I stop, pant for a few moments while lettings out a few \"fucking shit\"s and \"it just had to be on a hill\" I jog-hobble my way up to the end of the cul-de-sac. \n\nI get to the door with less than a minute to spare. I immediately ask him to check his stuff to make sure it's not shaken up. By some act of god everything is perfectly intact as if it hadn't been subjected to the fatass 500 run. The guy finally looks at me after handing off the pies and knots to an excited looking child who runs off to the kitchen and then he notices the shape I'm in.\n\n&gt;-\"why are you so sweaty dude?... Where's your car?\"\n\n&gt;-\"yeah there was a wreck at [INTERSECTION] and no vehicle traffic was being allowed through\"\n\n&gt;\"oh shit. gimmie a sec\"\n\nHe heads upstairs for a moment and comes back with another 2 dollars for me. I thank him and head off allowing the hill to do most of the work for me. As I pass the police putting the last touches on the accident report and the tow guys sweeping up all the plastic, glass, and bits of metal they wave and wish me a safe night. I make it to my car and drain my water jug before turning the ignition and maxing out the A/C. One I get back to the store I grab my emergency change of uniform I keep in the trunk and head to the bathroom to dry myself off and change into something that doesn't reek of sweat. I used to run marathons but now just under 2 miles kicked my ass, what happened?\n\nTL;DR Fatass runs it in for an extra 2 bucks.",
        "created_utc": 1509829016,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone ever got a deliver job where you work every other week?",
        "author": "Mandalorianfist",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ashjx/has_anyone_ever_got_a_deliver_job_where_you_work/",
        "text": "",
        "created_utc": 1509821370,
        "upvote_ratio": ""
    },
    {
        "title": "Some customers are habitual line-crossers - but is there a line? Does your store protect its employees from outright abuse by customers?",
        "author": "ZenRedditation",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7arm3t/some_customers_are_habitual_linecrossers_but_is/",
        "text": "I work for a successful independent pizza chain with 30+ years and a handful of locations in our county.  I've been in restaurants for (too) many years and put up with a lot of bullshit from customers, usually mustering a smile or at least biting my tongue.  But we had an incident with a customer recently that inspired me to write a long, eloquent letter to the owner.  This guy verbally abused our manager and defamed her in a Yelp manifesto (over a small caesar salad that had already been refunded), and the owner chose to appease him for a 3 star review rather than stick up for her employees.  Here's the meat of the letter:\n\n\"This incident has made it clear that we need to have a policy and protocols in place to protect our staff from customers who cross the line of basic human decency.  I will deliver whatever gross meal our customers concoct.  I will absorb their rants when we don't meet their expectations, and I'll charm them into giving us another chance.  I'll go back to return an extra bill if I find I was accidentally paid too much, or refund a gratuity if I fail to do my job up to my own high standards.  But I won't serve a customer who makes even vague allusions to Nazism to voice his displeasure with the amount of parmesan on his pasta.  I won't serve someone who tells an outstanding employee and young mother that a salad made him want to kill himself, and then publicly labels her a drug user.  As a survivor of depression and a friend of suicide victims, addiction survivors and those less fortunate, Jews, Poles, and good people from all backgrounds and walks of life, I won't tolerate it.  And I won't work for someone who does tolerate it.  We have to draw a line.\"\n\nUnfortunately I don't think her reading comprehension was up to the task.  We talked yesterday.  She seems to think this is the first time anything like this has happened, and sees no need to implement a policy or train management in how to handle this kind of situation.  I think this is insane.  Even if it were the first time this had happened - what harm could it possibly do to prepare for a future incident, even if it never happens?\n\nI'm a grown man in my 30s whose wife makes six figures.  I don't NEED this job, but we like to take nice vacations.  Give me two weeks and I'll be the best driver at any pizzeria.  I'm finally in a position to stick my neck out for my less fortunate colleagues and try to do the right thing - which seems so goddamn simple and obvious - but all I've accomplished is making myself feel like the only sane man in the asylum.\n\nSo I ask you, esteemed colleagues:  Does your store draw a line that customers are not allowed to cross?  Is there a policy in place to warn/ban customers? Are managers given any training, or empowered to protect the basic human dignity of their staff?  Or do you just keep serving every raging asshole in your radius as long as they don't rape or murder an employee?",
        "created_utc": 1509812775,
        "upvote_ratio": ""
    },
    {
        "title": "Was fired from pizza hut with no write ups",
        "author": "freyant",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ap5r7/was_fired_from_pizza_hut_with_no_write_ups/",
        "text": "Yo guys. I was just fired after i called in sick because i was vomiting my brains out. Ive been getting sick pretty often lately and idk why but i cant afford a doctor. The managers said i would be written up if i didnt show up on two different instances, but i was never made to sign anything. A couple days ago my general manager said it would be my third and final write up and i would no longer work for her if i didnt show up. Now, im not going to put damn pizza hut over my health and well-being so i said fuck it and said i quit, but she said i was fired for excessive absences. Now i was never made to sign any write ups, but i was still fired, so could i get unemployment benefits? \n\nI have a job lined up for the beginning of january so i only need it until then. I'll be doing uber and lyft as well.",
        "created_utc": 1509776898,
        "upvote_ratio": ""
    },
    {
        "title": "One Of Those Undeliverable Orders",
        "author": "wonderpodonline",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7aoeqq/one_of_those_undeliverable_orders/",
        "text": "I've been delivering since 2004.  I used to do this F/T for a decade, but now just a few short shifts in a week as my primary job takes priority.  This shouldn't be a difficult job, but... of course, I got one of \"those\" customers tonight.\n\nOff on a double, and head to the address on the bill.  I check it on Google Maps ahead of time.  Upon arrival, I see that the last occupied home is \"20\".  I need \"10\".  The next two units are unoccupied and unsold new townhouses (12 and 16).  \n\nWhatever... it's a wrong address.  Get these all the time.  Phone the customer.  He tells me that the address is not on Google Maps since it is too new.  I tell him exactly where I am.  He directs me to cross the street to the apartments in the next community over.  I ask him which entrance I can take, he says there is only one.  I already know this is incorrect, but it's been a long week... so, hey.. maybe I'm wrong?\n\nNope.  It's incorrect.  6 building complex with 6 entrances.  Back out, around the round-a-bout, and return to where I was at \"20\" Something St.  I look around... no other buildings that match his description.\n\nSighing, I phone him again explaining the buildings address specifically and that this is not correct.  I am told how to get there... but he gives me exact directions to get to the place I am calling his from.  :/  I opt to ask how to get from the position I am at to this building.\n\nNow it gets \"fun\".  He clearly has no idea and is frustrated.  He tells me this is for his girlfriend and he is IN ANOTHER TOWN.  Then tells me to go to the only four story apartments in the community.\n\nThis is wrong as there are at least 8 buildings matching this description.  He tells me to look up the building manufacturer online, which is also a problem since they have a contract for this whole community too.  Their signs are all over the place.\n\nFantastic.  I ask if I can get his girlfriend's number.  I figure she must know where she lives.\n\nAnd I get the following, \"I used to delivery pizzas, just make the fucking delivery!\".  And he hangs up.\n\nI'm pissed off, obviously.  It's one thing that it's the first heavy snow weather in the city and things have been moving slowly anyway, but I kept my cool the whole time.\n\nI open my phone and proceed to block his phone number.  Then I call my store and let them know what had transpired as I drive to the second customer's house and make the easy delivery to them.\n\nIt's nice when people know where they want a pizza delivered.  I get paid to take them their food.  What gain is it to me not to do so?  Wasting my time is not my job.  I've dealt with a few of these folks in the last 13 years.  Thankfully, it's pretty seldom.\n\nI cooled off by the time I got back to the store (albeit I was pretty close to just quitting for a minute or two there).  My manager was cool about it, and even offered me the order.  I let the rest of the crew have it.  I wasn't hungry.\n\nTL;DR - Customer orders pizza to address that doesn't exist in Google in a town he doesn't live in, plays the \"I used to do this card\".  No pizza is delivered.\n\n\n",
        "created_utc": 1509765702,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else deliver for a mostly north-eastern Midwest chain with a name identical to that of one eyes glasses?",
        "author": "Some_rage_my",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ah200/anyone_else_deliver_for_a_mostly_northeastern/",
        "text": "I've been working my first job here since February as delivery, and I gotta say compared to the stories I'm reading, this job is as cushy as it gets. \n\nFirst off, we don't drive our own cars. We drive newish/brand new company Ford Focuses with branding on them. Should the situation arise where you drive your own vehicle, you're payed 51 cents per mile. \n\nSecondly, since we drive the company car we don't pay for gas. If we need gas we keep the receipts and the money gets added back into our banks at the end of the night. \n\nThirdly, full wage, starting at 8.30, at least in IL, all the time, meaning no road wage BS, with opportunities for quarterly(i think?) raises that come with evaluations.\n\nKeep in mind this is at a corporate store, franchise stores may be different. Anyone else work for singe eyed eye glass?",
        "created_utc": 1509681955,
        "upvote_ratio": ""
    },
    {
        "title": "Delivered to my high school weed dealer today",
        "author": "tacobellrun182",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7agmj8/delivered_to_my_high_school_weed_dealer_today/",
        "text": "He said “you know the tables have turned, instead of me delivering you weed, you’re delivering me pizza, it’s like you’re a pizza dealer”. And then I realized that I need to stop delivering in my hometown",
        "created_utc": 1509676899,
        "upvote_ratio": ""
    },
    {
        "title": "Starting at Pizza Hut Tomorrow, Advice?",
        "author": "joserivas1998",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7agjqn/starting_at_pizza_hut_tomorrow_advice/",
        "text": "Tomorrow I am going to start my pizza delivery job at Pizza Hut and am quite nervous. What advice should I keep in mind when starting out?",
        "created_utc": 1509676016,
        "upvote_ratio": ""
    },
    {
        "title": "Delivered to a man dying of a heroin overdose",
        "author": "enigmazweb24",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7afn6a/delivered_to_a_man_dying_of_a_heroin_overdose/",
        "text": "I used to deliver pizza for a chain restaurant in college. The town in question was basically Hickville, USA and was mostly Amish farmland. \n\nAnyway, one night we were busy as hell and I had to take 9 deliveries at once, 5 to the school, 1 to this creepy isolated house, and 3 to the next town over, the furthest delivery distance allowed by store policy.\n\nSo I go to take these deliveries, and as I'm leaving they just keep pouring in. And it was just me, the manager, and only one other driver there, so I knew I had to deliver these and get back as fast as I could. So I deliver the first 5 to the school in like 20 minutes, then I decide to hit up the second one at the creepy house cause it was kind of en route to the next town over. So I get there and all the lights are off and it's pitch black. Now, it's pretty much a no-no to get out of your car on a delivery if it's dark and creepy, so I decide to call the guy first on the number provided with the order, but he doesn't pick up. It's getting later and I still have three other deliveries to make in the next town, so I decide \"Fuck it, I'll hunt this bitch down.\"\n\nSo i get outta the car and start walking up on the house using my phone as a flashlight. His yard is all fucked up like no one has taken care of it in 50 years, and I can hear his vicious dog barking like a rabid animal inside the house. So I get to the porch and I pound on his door furiously, partly because I'm pissed that he is fucking me over with delivery time and partly so he can hear over this fucking dog. No answer. So I proceed to the back door and repeat the ritual. Again, no answer. So I try calling him again and I hear a cell phone ringing behind me. It's coming from this rusty metal shed....I'm like oh shit that's terrifying cuz it's dead quiet aside from the phone, and I'm about to bolt when this guy comes walking out of the shed like a zombie, cash in hand...so I'm like \"Are you the one who ordered this?\" and he kind of just mumbles indistinguishably. So I take the food out of the hot bag and say it's so and so amount of money. He doesn't say anything but kind of extends his hand a little bit with the cash...at this point he is close enough that I can see, even in the dark, that he is all fucked up on something, swaying back and forth and shit...\n\nAt that point, he falls on the ground in front of me, smacks his head off his cement back porch, and starts having a full on fucking seizure. He has slime coming out of his mouth and everything. So I freak the fuck out and drop the pizza, run back to my car and call.....THE FUCKING SHOP MANAGER! Like, I was too fucking shocked to think to call an ambulance or anything other than my boss, so he picks up and I tell him what happened in a panic. And he's like, I'll call the ambulance and send it to that address but you have to make those last three deliveries cuz it's been 45 minutes since they ordered.......So I did.\n\nA few days later it was in the paper that the man died that night, and I heard from a few other people in town that it was indeed a heroin overdose. And that, my friends, is why service jobs suck, and also why I will never touch a hard drug for as long as I fucking live.",
        "created_utc": 1509666569,
        "upvote_ratio": ""
    },
    {
        "title": "Grosest pizzas ordered?",
        "author": "LordTrazaza",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ad9k6/grosest_pizzas_ordered/",
        "text": "What's the most disgusting vile shit you've made for a customer or heard that someone ordered? Either you tried it or put it into the oven like \"what the fuck is that.\" I was off the other night drinking with my friend and he wanted me to try his brother's favorite pizza. Hawaiian with bbq sauce. I was drunk so it seemed like a tasty idea.\n\nShit was nasty as fuck I threw up. Not from drinking, I mean the pizza hit my mouth and everything combined into something vile. I think it was the combination of bbq sauce and pineapple that made me puke, but I never really liked pineapple on pizza anyways. bbq + pineapple + canadian bacon = three really strong flavors that are disgusting together. Then I woke up hungover and the pizza was the only food in the house. Got a good colon cleanse as well.",
        "created_utc": 1509645342,
        "upvote_ratio": ""
    },
    {
        "title": "Nice surprise tonight!",
        "author": "the_eluder",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7a9z99/nice_surprise_tonight/",
        "text": "So another dorm delivery.  Today was pretty slow since apparently all the students blew out their cash on Halloweekend.  Note on the box said look for the Shark Head.  I pull up, and just then a guy came out wearing a shark head mask.  It was great.  I immediately told him I would expect him to wear that mask for every pizza delivery this year.  He was like, \"That's the plan!\"  To top things off, he tipped well.  Put a big smile on my face at the end of the night.",
        "created_utc": 1509607621,
        "upvote_ratio": ""
    },
    {
        "title": "What is with Papa John's terribad software?",
        "author": "saltyleave",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7a9y8x/what_is_with_papa_johns_terribad_software/",
        "text": "The POS and dispatch software at my Papa John's is infuriating. This is a corporate store, so I've been told franchise experience may vary. First off, this POS software requires a thumbprint to be dispatched on a run. Not a big deal, except that there are exactly two of 8 scanners in the store which will actually scan and accept my print properly. There seems to be no way around this. I'm pretty close to smashing the motherfuckers with a hammer to see if new ones will actually fucking work. Second off, the routing is a joke. Let's say there's three orders on the board. I highlight my name, and the software suggest I should take the first and third order as they were placed mere minutes apart and are within a few blocks of each other. Cool, a double! Cut the first order, box it up, check the board again to make sure we're still good to for a double. Yep! Take them both, the software tells me. So I cut and box two carryout orders, then my delivery order, put it in a bag, and go to dispatch myself. \"NOPE! HAHAHA, FUCK YOU! TAKE THE FIRST ONE THAT WAS READY TO LEAVE THE STORE SEVEN MINUTES AGO AND LEAVE THE OTHER ONE FOR SOME OTHER DOUCHEBAG WHO'S BEEN PICKING HIS NOSE IN THE CORNER FOR THE LAST TWENTY MINUTES! FUCK YOU! OH, YOU WANT TO HIGHLIGHT BOTH ORDERS AND DISPATCH THEM TO YOU?! BETTER YELL ACROSS THE STORE TO THE MANAGER WHO'S PICKING HIS NOSE WHILE HE'S POUNDING OUT DOUGH TO STOP WHAT HE'S DOING TO COME STICK HIS THUMB ON THE GOD DAMN THUMB READER THAT DOESN'T FUCKING WORK. HAHAHA FUCK YOU! GO TO A DIFFERENT COMPUTER AND REPEAT THE PROCESS AND HOPE IT FUCKING WORKS YOU PIECE OF SHIT! HAHAHAHAHA!\"  \nGo fucking fuck yourself you worthless god damn software. I could color code a board and have a god damn chimpanzee dispatch orders more efficiently than you, you worthless, worthless piece of shit. FUCK YOU.  ",
        "created_utc": 1509607115,
        "upvote_ratio": ""
    },
    {
        "title": "Got my first delivery job at Dominos!",
        "author": "sweetiejam",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7a8fwp/got_my_first_delivery_job_at_dominos/",
        "text": "This is just gonna be a 2nd part time time job for extra cash but I'm pretty excited, I've been reading a lot of stories here and made a few posts and seems it could be either scary or really entertaining. Luckily it's close and in a (mostly) decent area, and the manager seems pretty accommodating to my main job. \n\nI was wondering if it would be strange for me to bring some kind of weapon with me? My first day is tomorrow night. I'm a girl with weak baby arms and wanna be prepared, so I got one of those really bright flashlights that disorient people. ",
        "created_utc": 1509587876,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone notice local shops are struggling?",
        "author": "ZiggoCiP",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7a7dey/anyone_notice_local_shops_are_struggling/",
        "text": "in reference to the /r/nottheonion post concerning [Papa Johns and falling pizza sales](https://www.reddit.com/r/nottheonion/comments/7a4oyr/papa_johns_blames_nfl_anthem_protests_for_falling/), is anyone noticing any shops in their area closing?\n\nIn my town we've lost a couple small shops, but also a Pizza Hut which had been around for 30+ years.  They stopped delivering and we nabbed some of their drivers, then closed all together.  Also a part of my shop's franchise gave us a few drivers recently they didn't need. From what I've heard/read, uber eats and door dash are making a dent?  \n\nNow seeing that PJ's is apparently not doing so well, I'm wondering if this is affecting most shops.  We had really shitty numbers last year for the Super Bowl, I think pulling in half what we usually make that day.",
        "created_utc": 1509577567,
        "upvote_ratio": ""
    },
    {
        "title": "It’s too late to undo it now, but I’d like to ask a question",
        "author": "KiriStarr",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7a6kru/its_too_late_to_undo_it_now_but_id_like_to_ask_a/",
        "text": "Last night, my friends and I ordered a couple pizzas and some other stuff. I tipped over 20%, so I’m not so much worried about that. I just have anxiety sometimes and want to make sure I didn’t offend anyone. We only got a handful of trick-or-treaters, and we had a big sack of candy leftover. I offered it to the driver, asking if he or friends or family or co-workers would want it. He seemed happy and took it, but I am worried he was just being polite. I meant well and was not trying to burden him with unwanted goods. This post might sound stupid, but please let me know for next time if this was an acceptable thing to do. Thank you!\n\nEdit to add: Thank you all for your responses! I truly appreciate all of your feedback, and I’m relieved that it seems I did a decent. 😘😘😜",
        "created_utc": 1509570272,
        "upvote_ratio": ""
    },
    {
        "title": "Best pizza place to work for? Pizza Hut, Papa John's, or Dominos?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7a4z9g/best_pizza_place_to_work_for_pizza_hut_papa_johns/",
        "text": "[deleted]",
        "created_utc": 1509556209,
        "upvote_ratio": ""
    },
    {
        "title": "How does Dominos GPS track its drivers? Do any others do this?",
        "author": "rygy3",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7a1mld/how_does_dominos_gps_track_its_drivers_do_any/",
        "text": "I ordered from Dominos recently and I could see the drivers make wrong turns in real time, and I'm curious how the driver location is retrieved. Phone? Car topper with GPS built in? \n\nIt seems pretty invasive in my opinion. I just started working at Papa Johns, and I know they record delivery times, but they don't track my exact speed/location as far as I know. Just curious how the live GPS tracking is done on delivery drivers, and if I should be concerned about stopping at McDonalds on the way back from a delivery.",
        "created_utc": 1509513545,
        "upvote_ratio": ""
    },
    {
        "title": "You get what you pay for.",
        "author": "OverlordGoogle",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7a1k27/you_get_what_you_pay_for/",
        "text": "Sorry for formatting im on mobile. \n\nI work for e: very fast sub shop near a college campus, super easy job usually aren't too busy except weekend nights. I had a 12 to close (midnight) tuesday shift. \n\nThe customer will be **C:** \n\nMy manager (person in charge) will be **PIC:**\n\nI will be **M:** \n\nAt around 2:30 we get a call from a guy who ordered two hours ago. The driver who brought it to him at 12:30 had already left for the day.  That means the next driver up (me) has to take it and usually wont get tipped as the person already ordered and typically tipped the first driver. I also wont get much from the store because the total of the order is under the minimum price delivery (that will make more sence in a sec, typically they wont order more and you'll get nothing). \n\n&gt; C: Hi, I *just* ordered a sandwhich a little bit ago. \n\n&gt; PIC: Yeah I've got your order pulled up now, anything wrong? \n\n&gt; C: Yeah my sandwhich was supposed to have no sauce but there was sauce on it. (O+V sauce, typically not even noticable)\n\n&gt; PIC: Okay, we can bring you a new one but you'll... \n\n&gt; C: *cuts in* Can i just get chips and a drink instead. \n\n&gt; PIC: No, we cant do that\n\n&gt; C: Okay could I order chips and a drink and get the free sub \n\n&gt; PIC: Yeah, absolutely.  \n\n&gt; *Proceeds to take order for chips amd drink.* \n\n&gt; PIC: To get the free sub we do ask that you give us the old one. \n\n&gt; C: Wont be a problem. \n\nSo at this point i gather the sides, get handed the sub and hop in my car. About 3 minutes later i knock on his door. \n\n&gt; *Door opens* \n\n&gt; M: Hi, could you fill this out for the chips and drink?\n\n&gt; C: Sure\n\n&gt; *Signs quickly, no tip, hands back*\n\n&gt; M: Alright, can I have the old sub so I can give you the new one?\n\n&gt; C: What?\n\n&gt; M: If you want the replacement sub you'll need to give me the old sub. Its a conpany policy to prevent people from stealing. \n\n&gt; C: Oh, I already threw it away. (He made it obvious he was lying)\n\n&gt; *giving best/freindlist customer service smile* \n\n&gt; M: that's no problem, you can take it out of the trash and give it to me. I really dont mind, I just need the sub.\n\n&gt; C: I'll be right back \n\n&gt; *door closes* \n\nI stand there for maybe 5 minutes with his chips, replacement sub and drink. \n\n&gt; *door opens* \n\n&gt; C: Its too deep in the trash for me to reach.\n\n&gt; M: Thats perfectly okay! I can still give you the stuff you paid for. \n\n&gt; *procceds to rip open the bag and take the sub out, handing him the torn bag with a small bag of chips and his drink* \n\n&gt; M: Have a good day! \n\n&gt; *door slams*\n",
        "created_utc": 1509512550,
        "upvote_ratio": ""
    },
    {
        "title": "Had a hilarious moment delivering to a customer while in costume",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7a19b4/had_a_hilarious_moment_delivering_to_a_customer/",
        "text": "[deleted]",
        "created_utc": 1509508642,
        "upvote_ratio": ""
    },
    {
        "title": "Thinking about taking the job but don't know the area",
        "author": "yeahivelostit",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79yo2r/thinking_about_taking_the_job_but_dont_know_the/",
        "text": "I think being a delivery driver would be pretty easy and my kinda job but I just moved to a new area so I don't know the place that well yet. Will this be a problem? I feel like gps can take me literally anywhere without any problems. ",
        "created_utc": 1509482253,
        "upvote_ratio": ""
    },
    {
        "title": "Collage student called my store for no reason.",
        "author": "1CraftyDude",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79vme1/collage_student_called_my_store_for_no_reason/",
        "text": "Yesterday took a call for pizza to my local community collage and agreed to meet the customer in the front traffic circle. I made the pizza, boxes and cut it, and left the store. I made the 10ish minute drive to the collage drove around the circle and nobody waved me down so I pulled over and called; no answer. I drove around the circle several times then I found my customer and gave them the pizza, they paid me. (exact change $13.09 but that's not the point) \n\nAfter I leave my manager calls me and tells me to go back. I asked him why and it turned out while I was circling the circle they saw me driving away from them (while circling) and called my store to say that I had left. Since nothing went wrong I find it really funny but it could have been really annoying. That's my weird customer story. ",
        "created_utc": 1509455520,
        "upvote_ratio": ""
    },
    {
        "title": "Halloween Horrors",
        "author": "kirokatashi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79up7p/halloween_horrors/",
        "text": "I don't know how it is at your stores, but Halloween is our busiest day of the year, even when it's on a weekday. Previous years, we've had 4 hour delivery times, tables full of both boxes waiting to be filled and orders that won't fit on the heat racks, and ridiculous amounts of cancelled orders. This year we aren't doing timed orders because there is no way any of them will be anywhere near the desired times, and we are allowed to wear costumes this time, so basically getting paid to trick or treat, which is nice, but I have the closing shift, which is going to suck, but whatever.  \nSo tell us your terrible Halloween experiences, or fun things, whatever you've got. ",
        "created_utc": 1509443521,
        "upvote_ratio": ""
    },
    {
        "title": "Might be wrong sub. Im starting a job delivering!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79tukf/might_be_wrong_sub_im_starting_a_job_delivering/",
        "text": "[deleted]",
        "created_utc": 1509429066,
        "upvote_ratio": ""
    },
    {
        "title": "Please, post YOUR address.",
        "author": "Lorick",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79t0mx/please_post_your_address/",
        "text": "Came across [this](https://imgur.com/wW1CddS) the other day.\nmade me think of you guys. \n\nthough I drop off packages now.\n\nbut of course, the actual address was not posted anywhere, not even the rusted out mailbox, and google put the house at the intersection. but after about 15 minutes of searching nearby houses, and calling the number that went to voicemail five times. i decided this has to be the house.\n\nplease post YOUR address...",
        "created_utc": 1509419070,
        "upvote_ratio": ""
    },
    {
        "title": "Starting a job at pizza hut! Any advice",
        "author": "damnionbrain",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79ssq1/starting_a_job_at_pizza_hut_any_advice/",
        "text": "This is my first food service / pizza place job im working as a cook any advice thst will help me do well at my new job?",
        "created_utc": 1509416869,
        "upvote_ratio": ""
    },
    {
        "title": "\"Employee Discount\" increased the price of my online order... :(",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79rl3q/employee_discount_increased_the_price_of_my/",
        "text": "[deleted]",
        "created_utc": 1509405410,
        "upvote_ratio": ""
    },
    {
        "title": "How about delivering food with a 125 motorcycle?",
        "author": "i3nfoe",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79q7rg/how_about_delivering_food_with_a_125_motorcycle/",
        "text": "Seems like scooters are usually preferred... but\nsomething like a yamaha 125 would be ok for entering this business anyway?\nThank you for your answers",
        "created_utc": 1509392927,
        "upvote_ratio": ""
    },
    {
        "title": "I won't tip but I'll ask for something I didn't order",
        "author": "daftpunk34",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79ptef/i_wont_tip_but_ill_ask_for_something_i_didnt_order/",
        "text": "The customer is always right is something that the general manager for my store always likes to say. I like to add \"If they tip\" to the end of that little saying because of this little experience.\n\nOur deliveries in the morning are pretty slow so it's easy to fix a mistake that has been made on a order. The mistake is usually driver error because I misread a comment on an order or I forgot their coffee in my cupholder, so I can just run back to the store or my car and bring them what they wanted. But this morning I get an order with no comments, just a simple order: chili in a breadbowl. Since thats an easy order I just prep everything myself and walk out the door with a complete order and a smile on my face. I come to this lady's workplace and before I can even say \"Good morning\" she says \"finally\". Slightly taken aback because her order showed up 10 min early I give her her bag and the receipt asking her to sign it. She then asks me\n\"Uh, why did you forget my water?\" confused and annoyed at myself because I forgot something I check the receipt but to my surprise there is nowhere on it asking for water. I say, \"Did you want water because theres nothing in the comments about that.\" She looked at me like I'm the biggest idiot in the world saying \"Yeah. Water. I asked for it last time and *that* driver brought it to me.\"     \n\n\"Well I'm sorry but theres nothing on the receipt about a water.\"\n\n[\"How am I supposed to eat my food if I don't have a drink.\"] (https://www.youtube.com/watch?v=4U9pIU3Egu4)\n\n\"Well I could try to or get someone to take you one if we don't get too swamped, also can you sign the receipt in the highlighted area.\"\n\nShe then asks where she has to sign, looks at the paper again and hands it back to me saying \"Don't forget my water.\" When I get back to my car I check her paper and see that she hadn't tipped, so in my mind she wasn't too eager to get that water. I go back and tell the other driver about what happened and his response was \"So, she's not getting her water because it seems like she didn't want it that badly.\" and I nod and start taking the lunch rush that has started to come in. \n\nWhile on one of my trips I get a call from the store and on the other line is one of my coworkers who likes to do yell at everyone to do their job while not doing theirs. She tells me that the lady has called the store 4 times saying that I forgot something on her order and I need to take it right away. I say that I'm really busy and I don't know if I'll be able to take it mentioning that she should tell the customer that there are 3 restaurants in the same shopping mall where she could get water. I didn't hear anything about it afterwards but I wonder if that girl was able to build up the strength up to drink the tap water from the staff lounge. ",
        "created_utc": 1509389456,
        "upvote_ratio": ""
    },
    {
        "title": "Unrealistic delivery time demands",
        "author": "BaronThundergoose",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79p8ft/unrealistic_delivery_time_demands/",
        "text": "I work at the Pizza Hut and we \"failed \" our cff because of our delivery time percentage. They decided to respond by giving us 9 less minutes to get there and back. I can't wait for a pizza to cook drive 3 miles , deliver pizza , drive 3 miles back all in 30 minutes. (If were not cashing out within 30 minutes  its late even if we got to the house on time or even early.) I'm losing my mind with this, and I feel it puts us drivers in an unsafe mind set. With this demand of speed someone is bound to hit someone. I don't know what to do. I'm gonna call HR and explain the situation. It's not right . We're also extremely understaffed and they don't seem to care.\n\nEdit: to top it all off they just closed another Pizza Hut in the area and we have to abosrb there zone even though our zone is huge to begin with. Like I'm talking 8 more Miles in some directions . For like. 15-20 mile distance from end to end.",
        "created_utc": 1509384384,
        "upvote_ratio": ""
    },
    {
        "title": "Above and beyond",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79lrdt/above_and_beyond/",
        "text": "[deleted]",
        "created_utc": 1509341049,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't fuck with tips... y'all live on tips don't you?\"",
        "author": "adboio",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79lb2r/i_dont_fuck_with_tips_yall_live_on_tips_dont_you/",
        "text": "went for a delivery today and apparently someone had called in an order and then went to walmart and wasn't at home when i got there. luckily i was on a double so i ran the other one and came back - lady still wasn't home. they invited me inside, which i know is strongly discouraged, but i went in because i figured \"oh, maybe i misunderstood and the lady is in the back unloading her groceries or something\" (also it was an order of 6 pizzas and they were clearly having a party). i get to the back of the house, lady actually isn't there, so i set the bags down on the table and wait for ~10 minutes while 15-20 drunk people are having fun in the other room. finally the lady comes home and sends her son in with 3x $20s for a $41 order. as i'm counting change, i realize i only have $13 in my pocket, so the guy looks at me and says \"come on man, i don't fuck with tips... you better go see if you got any money in your car.\" that makes me pretty upset but i just finish taking out the pizza and say i'll go check my car. before i can do that another lady stops me on my way out and asks what's going on - i explain the situation and she pulls out her calculator to figure out what to do. while this is happening, the SAME guy who told me he \"didn't fuck with tips\" said, and i quote, \"man, i couldn't do your job... y'all live off tips don't you? damn, that's hard, i could never.\" in the nicest voice possible, i replied \"yeah, it's fun at times, but sucks when people don't tip.\" the lady had finished w/ her calculator at this point - she looked at the guy, said \"shut the hell up\" and then told me to keep the $7.\n\nended up with a nice tip but it just bewildered me that someone would say they don't tip and then not 5 seconds later say being a driver must be hard because we live on tips. anyone ever have anything similar happen?",
        "created_utc": 1509334870,
        "upvote_ratio": ""
    },
    {
        "title": "The night a drunk guy passed out at our driver door",
        "author": "bobcat009",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79l7fw/the_night_a_drunk_guy_passed_out_at_our_driver/",
        "text": "So, this was a little while ago, but I was working the closing shift and we close at 2 a.m. Sunday through Thursday. I went for my final delivery at approximately 1:50 ish and when I came back I found out that a drunk guy had stumbled in through our driver door and passed out on the floor.\n\nApparently, he'd wandered to our store from downtown, pissed and threw up on one of our drivers cars, then sort of stumbled into our drivers door, because the lock is broken, and passed out on the floor. At some point along the line, he lost his shoes, so we all just assumed he was dead.\n\nWe attempted to wake him up, we shook him, tried to call out to him, we've been dumped a bit of water on his face to see if that would wake him up. No luck. But, he was breathing and making some mumbling sounds.\n\nCops were called, and we all started doing our closing duties while leaving the drunk guy on the ground. We left the door open, and told the police dispatch the situation, and about five minutes after the call was made a female cop wanders in through our driver door with a smile on her face. She asks me how my night is going, and I'm honestly just so tired that at this point I just shrug and reply, \" just another normal night.\" And I go back to wiping down the counters and sweeping the floor.\n\nThe cop managed to wake the drunk guy up after some shaking and yelling at him and poking his side and face a little bit, afterwards she hauled him off.\n\n[Snap from the night](https://imgur.com/a/LcTMU)",
        "created_utc": 1509333618,
        "upvote_ratio": ""
    },
    {
        "title": "I never thought that I'd have to call CPS",
        "author": "Stinky_doggo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79jvec/i_never_thought_that_id_have_to_call_cps/",
        "text": "There is a first for everything though. I had a delivery going to a kinda crummy part of our zone. Small apartment building. Pretty standard order, a medium pizza and bottle of Pepsi. \n\nI get to the apartment and as I walk to the door a kid comes out (about 10 or 11 years old) in only his boxers. I do the usual thing with kids, ask if his parents are home to sign the receipt, except this kid says his parents aren't home. \n\nFrom the front door I can see into the apartment and it's a textbook meth house. Couple of bikes partially disassembled, trash everywhere, smells like somebody shit on the floor, mattress thrown on its side against a couch. There's no power on that I can see. \n\nI let the kid sign for the pizza cause I feel bad for him. He looks clean and showered, so I assume the mandatory reporters at his school don't see any red flags. \n\nI kept his receipt and I called and anonymously filed a report with CPS in my county after work. I really don't know what else I could have done for this kid but I didn't just want to stand by, so I hope I did the right thing. This delivery just raised a bunch of red flags for me. \n\nAnyone else ever had to do something like this? I've never had to deal with this kind of situation before. ",
        "created_utc": 1509318599,
        "upvote_ratio": ""
    },
    {
        "title": "Ever look at your timeline?",
        "author": "XL_Geek",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79hvt7/ever_look_at_your_timeline/",
        "text": "If you use google maps, and look at your timeline you can see all the places you went, it also tells you how long you spent driving. On days I don't need to go anywhere before or after work it shows only where I went while delivering. Kind of interesting.",
        "created_utc": 1509299028,
        "upvote_ratio": ""
    },
    {
        "title": "Delivered to a fake address",
        "author": "duhyangster247",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79fj1a/delivered_to_a_fake_address/",
        "text": "Busy night. I was assigned to deliver to \"1256 W 12th St\". No apartment number or buzzer code so I assumed it was a house. Arrived at 1200th block of W 12th St, start walking and searching for the house. Block was all apartments. Walking down the block, 1210, 1212, 1230, blah blah blah, 1250, 1266. There was no 1256. In between 1250 and 1266 was a garage door which connected to 1250. Customer must've put the wrong address so I call them. Lady tells me she'll come to the front. A few minutes later, she calls me again saying she doesn't she me (I was standing on the sidewalk). I ask if her address is correct and she assures its 1256 W 12th St. I say I don't see it and she tells me it's at the corner of W 12th St and another street which was 10 minutes away. However, the street numbers are already in the 2000s at the intersection she mentioned (I'm at 1200th block). The next thing I hear \"You know what, just cancel the order\". I was like \"okay then, bye\". Whatever, I was only 10 min late for my second delivery which wasn't far from where I was.",
        "created_utc": 1509267361,
        "upvote_ratio": ""
    },
    {
        "title": "A near 40 year old man got fired for shaking up a soda and got caught on a doorbell cam...",
        "author": "No_Meaning_Here",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79f9qw/a_near_40_year_old_man_got_fired_for_shaking_up_a/",
        "text": "So [this video](https://www.youtube.com/watch?v=fdxUJZhsx2g&amp;feature=youtu.be) has become somewhat of a meme within my store. What happened was one of our employees, who is a near 40 year old man mind you, was caught shaking up a soda and dropping a pizza on a doorbell cam. (Lots of doorbells in our area seem to have these.)\n\nSo basically what happened was a few hours after the delivery the customer came into the store clearly pissed and demanded to speak to a manager. The shift lead at the time was like a 19 year old guy and so he walks out and talks to the customer. The customer shows him the video and says that after doing this he got a 3 dollar cash tip, but he also demanded that he give him 3 more dollars on the card. \n\nAs they're talking the culprit walks out the door and tries to scurry to his car with his next delivery, but the shift lead stops him. He's like \"Dude, give the guy his 3 bucks back!\" So he pulls out his 3 bucks and gives it back to the customer. The customer claimed that he was ready to kick his ass, but won't do it since the shift lead was so nice.\n\nAnyway, the culprit comes back from his last delivery and the shift lead asks him \"So did anything happen at this address? You remember anything?\" The culprit goes \"Nope. I don't know what you're talking about.\" Shift lead double checks. \"You sure?\" Culprit double acknowledges. The shift lead pulls out his phone and asks \"then what the hell is this\" and shows him the video.\n\nAt this point the culprit just goes, \"Oh...\" and the shift lead is like \"YEAH, OH... YEAH, THIS.\" I feel like it's more funny in person just because the dynamic is so reversed. The shift lead is this 19 year old kid and the culprit is this near 40 year old man who is balding. \n\nSince the shift lead doesn't have the final say he's just like \"I'll have to tell the manager about this, man.\" The culprit just asks \"Do you have to tell the manager?\" At this point the shift lead is just like \"UH, YES, I DO!\" \n\n\"Is there are a chance you won't tell him?\"\n\n\"*Culprits name,* are you kidding me? There's not a chance I won't tell him!\"\n\nThat's all I personally heard. The next day rolls over where the culprit was supposed to speak to the manager in the morning and according to other guys in the store the first question the manager asked was \"well, did they open the soda?\" At the end of that day the manager texted the closing shift lead that one of his friends at the pub showed him the video and said he found it on Twitter. The customer did in fact threaten to make the video go viral, but judging from the fact that the shift lead at the time handled it so well he might have not followed up on that. Fortunately, the logo for our store isn't anywhere in the video as far as we can tell. He's not wearing the hat or shirt either, so for now everyone in the store seems to be freely laughing at it and sharing it without much worry. Plus, while we are a big chain, a lot of people don't even know we exist so, as everyone in the store has been saying, \"this is the most marketing I've seen come out of this company and at this point any publicity is good publicity.\" \n\n[I also remixed the video of him shaking the soda, which the people at the store enjoyed.](https://www.youtube.com/watch?v=GRlxCQyNbO8) I hope that's not too shameless of a plug. \n\n",
        "created_utc": 1509261981,
        "upvote_ratio": ""
    },
    {
        "title": "Just got robbed.",
        "author": "6evan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/79eofg/just_got_robbed/",
        "text": "I learned a lot through this, and excuse the format, on mobile.\n\n\nHad a delivery to a not so nice part of town, but by no means the worst. Order was for 28.90, 2 pizzas and bread sticks, routine stuff.\n\nI’ve been to this street a few times, both times really good. This time was a little different.\n\nHouse I delivered to was one I’ve been to once before, older white lady, super nice. I was thinking “ok this will be good, 4 or 5 bucks coming my way” \n\nKnock on the door, got nothing. Did that a few more times, still nothing. So I call the number from my truck, a man answers. Give him the usual sayings, did you place and order blah blah blah. I’m waiting around for 5 or so minutes, when I see a man walking towards my truck. He comes across the driver side, I get out (in retrospect, not the smartest idea)\n\nGuys carrying a stick, think a tree branch, maybe 4 feet long, 3 inches in diameter. I hand him the pizzas, he lays them on the porch, asks if I have change for a 20, I say yeah. \n\nAs I reach for my change he turns around, grabs the stick and hits me as hard as he can right in the middle of my head. I’m on the ground, he grabs the change in my hand, says gimme your wallet. I hand him my wallet, just 4 or 5 bucks in there. He asks where the rest is, I say it’s in my truck. He goes, opens the door and grabs the money. Now, this man is a class act criminal. Leaves my phone, just takes the money. Says “ get the fuck in the truck before I kill you” \n\n\nI peel out, hit the next block and dial 911 cops and EMS services were there in less than 5 minutes. 4 stitches later, everything is ok. \n\nHappened literally 3 hours ago, just got home from the hospital. \n\nNote: this man left my wallet AND the stick he beat me with not 10 ft away from where he robbed me. \n\nThe lady I delivered to before? Showed up 10 minutes after it all happened. \n\nI learned an important lesson: If something seems sketchy, get the fuck out of there. Learn from me, you WILL get robbed if you don’t keep your wits about you.\n\n\nEdit: wallet still had all cards and my drivers license\n\nEdit2: Thank you all for reading my story! Keep moving forward\n\nEdit3: Your reply’s and advice and story’s really mean a ton to me! Thank you :)\n\nEdit4: They have found the guy who did it, he’s currently sitting in jail with charges of armed robbery and aggravated assault",
        "created_utc": 1509251210,
        "upvote_ratio": ""
    }
]