[
    {
        "title": "Trust your instincts.",
        "author": "Greedeater",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/22uncl/trust_your_instincts/",
        "text": "Busy night last night. Comedy festival on over here, so I was requested to double up at the gaming room from my other adventures noted in this sub. A few kickouts here and there, a *lot* of refused entries for drunks. Business as usual. \n\nThe regular guard asked if we could swap end times. He's a good, hard working kid - if inexperienced - and was pretty keen to hit a club around the corner where his mates were having a night out. So I agree, it's only an extra hour anyway. 15 minutes before close, he started moving the chairs away from the machines so the staff can get at the hoppers, and I finished locking the place down. \n\nAbout 10 minutes to close, no one is left inside. I'm at front door, having a look around the area for suspect loiters. This dark older model sedan slowly cruises past and pulls in. Young fella winds the window down and asks if we are closed. His pupils are like 5 cent pieces, so it would have been a no entry regardless. I politely informed the Tweaker that we are closing in a few minutes, and that I cannot allow entry  anyone at the time. He nods, car leaves. \n\n0400 hits, and Steve takes off, thanking me on the way out. It's lucky he did leave early. You'll see why.\n\nAs I'm only needed on site for the cash up, I park on a chair facing the front door. I've got my phone held up towards the door, so I can browse Alien Blue and see if anyone approaches at the same time. \n\nThen all the Pokie (Slot) Machines turn off. \n\nHuh. *That's* not supposed to happen. \n\nThe staff are as confused as I was. We check the office switchboard, nothing tripped that we could see. Admittedly, I wasn't sure *what* to look for precisely, but everything said it was 'On' so wasn't that. \n\nI return to my post while the Staff Supervisor called the VM for advice on how to proceed. As I'm walking towards the door, who walks past? \n\nYep. The Tweaker. \n\nI race back to the office to check the cameras, instinct kicking in. That car is parked just outside my LOS, but easily visible on camera. I memorise the licence plate, and jot it down. I can dimly see two people in the car, which becomes three as the Tweaker returns, this time getting in the drivers seat. \n\nNo sooner had he got in the car, the lights flickered. A beeping I had never heard before was coming from the switchboard, so investigate. \n\nBackup Power Genrator. \n\nI look back up. Cameras are out. \n\n*Shit.*\n\nI calmly - albeit stiffly -  walk back out and usher the 2 staff members over to me. \n\n'Listen very carefully', I said quietly, 'we are about to get hit. Get in the Strong Room, **DO NOT** open the door until I say so. Hit the silent alarm button, and dial 000 as well. Go!' \n\nThey bolt inside the Strong Room. 30 seconds later, the lights go out, so out with my Maglite. I can hear a scratching at the back door, then a muffled revving of what I presume was a Power Drill, I think. Door was too thick to positively identify it, and a secondary one-way backup door subdued the remainder of the noise. I lean out to look at the front door to see the sedan has moved to the front. \n\nI was equal parts terrified, enraged and tranquil. And waiting. Agonisingly waiting.  \n\nThe noise stops. I grip my Maglite like a club. \n\nScreech of tires out the front makes me jump half a mile. I spin around to look and moaned with relief when I saw red and blue flashing lights. I hop the counter and bolt to the front door as a Polic Van skews to a halt in the road. I'm frantically motioning to the back alley through the glass door. One cop takes off around the corner, the other is still in the car on the rradio. \n\nAfter another painful wait, the policeman comes back around the corner and motions for me to open the door. I hit the button forgetting I couldn't, power was still out. Couldn't open it manually either, it latched shut when the power died. I opened the smoking area, as told the officer about the guy around the side. He informed me there was no one there, must of bolted when he saw the lights. I direct him to the back entry, which I race around to open for him. Other police cars were pulling up at this point.\n\nI return to the Strong Room and croaked out an all clear. The door creaks open, showing two pale and terrified faces in our torchlight. They both needed to pee. \n\nSo did I. \n\nWe all go out into the back alley entry, under the light of a hotel foyer behind us. Statements were made, details given. The VM arrives early from the phonecall earlier (it was about 0600 by now). We don't know how they were screwing with the power, but it's still out. And since it was my shift at the venue tonight, I have the night off now. \n\nI started a long, *long* drinking session. Still going actually. \n\nSorry if there are typos and stuff in here, I'm wasted right now, and rightly so I believe.\n\nEdit for a word.",
        "created_utc": 1397307259,
        "upvote_ratio": ""
    },
    {
        "title": "\"They were robbing us!\"",
        "author": "yugosaki",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/22qnxd/they_were_robbing_us/",
        "text": "So, one weekend I'm sitting at home doing nothing, and I get a call from the scheduling guy. He just had a guard quit on him at the first site I ever worked (an apartment complex with some street level retail space) and all the temps available on short notice are not trained for that site yet. Since I'm familiar with the site and live nearby, he practically begs me to take the shift, and offers overtime pay and a couple days off to sweeten the deal (I work full time already and he knows I dislike picking up shifts on short notice) so I accept.\n\nI arrive on site, survey the area. This is a graveyard shift ending at 0600. I notice a fast food joint on the main floor is open late. I pop in there, a pair of young brothers just bought the place, and were excited so they decided to stay open late and take advantage of the club crowd. Sweet deal, I can get some food during this shift.\n\nAt about 02:30 i hear some banging coming from behind me. My office shares a wall with their kitchen, so I assume someone dropped something or fell. I decide to pop in just to check up on them. At this point the clubs were kicking people out, so there's tons of drunk people out on the streets. as I round the corner of the building, there's a group of people standing just outside the door looking inside. They spot me and go \"oh good someone is here\" and wander away.\n\nI go inside, and there are two HUGE guys arguing with the cashier. I'm talking like 6'6\" 280lbs+, ALL muscle. The big guys calm down a bit when they see me, but I could hear the one guy being extremely aggressive and saw him leaning over the counter before I got in the door, so I straight up tell him to get out. He looks at me kind of confused, so i just point at the door and repeat that he's gotta go. he begrudgingly complies. I look to the cashiers, they say nothing. They are just sorta stunned. The second guy says \"i just want a coke, man\"\n\nI look to the cashiers again. They still say nothing and look at me and each other a little dumbfounded. So I say \"alright, buy your coke and then leave.\" He digs out some change, pays for a can of pop, and then takes off.\n\nWith them gone now, I lock the door and ask the cashiers what the hell happened. It takes them a minute to calm down enough to be coherent (english was not their first language) but then they explained that these guys came in with knives and tried to jump the counter. The cashiers managed to push them back, knocking a bunch of stuff over, which is what alerted me. As I came around the corner, the guys saw me and shoved the knives in their jackets before I got in the door, and the rest is just as I described it above.\n\nJust to paint a picture here, I'm 5'9\" 135lbs. So I'm a pretty tiny guy. I'm pretty adept at grappling and striking, but there's no doubt that if I got in a tussle, while I was struggling with one of those apes the other could easily have beat the shit out of me. I think the robbers were chased off by my sheer gall.",
        "created_utc": 1397176993,
        "upvote_ratio": ""
    },
    {
        "title": "It doesn't matter than he can't see me, he's racist!",
        "author": "VigilantInfidel",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/22pn5s/it_doesnt_matter_than_he_cant_see_me_hes_racist/",
        "text": "Of my two full-time jobs, one is as a security officer for a business research campus. On one of the evenings when I was working the traffic gatehouse, a rather nice looking brand-new Lexus sedan vehicle pulled into my visitor's lane. The thing I noticed first about it was that it had heavily darkened tinted windows, including the front windshield, which is illegal to do in my state.\n\nThe car stopped and the window rolled down to reveal a well-dressed black woman who was not wearing anything close to a smile. She started to complain about one of my fellow security guards (who happens to be white), saying that he no longer waves to her when she comes through his gate in the morning. I don't recognize her or her car so I ask her if she's a recent hire.\n\nWoman: \"No! I ain't no new hire! Don't you even know who I am?\"\n\n[Note: If there's one thing I've discovered, it's that long-time employees *hate* it when you ask if they're new.]\n\nMe: *sighs internally* \"No, ma'am, I don't. I have absolute no idea who you are. You haven't given me any ID or told me your name. I don't recognize you or your vehicle. You don't have your parking pass displayed anywhere in your windshield and even if you did have your hang tag displayed they way you're supposed to, I doubt anyone could see it through your tinted windows. Why would you think I would know who you are?\"\n\nWoman: *shocked and aghast* \"I'm [middle-level office administrator]! I've worked here for [a number that isn't impressive] years!\"\n\nMe: \"Thank you. Let me just verify that information, please.\"\n\nBefore she can say anything else, I step into my gatehouse and look her up in my employee database. Everything she told me was correct except I noticed that her assigned parking pass is registered to a different type of vehicle.\n\nMe: \"Ma'am, I think I might see the problem here. Did you recently buy this car?\"\n\nWoman: \"Yes. I got it two weeks ago.\"\n\nMe: \"And when did you start to notice that my co-worker stopped waving at you?\"\n\nWoman: \"Couple weeks ago...\"\n\nI wait for her to make the connection herself but she doesn't.\n\nMe: \"Do you suppose it's possible that he doesn't know you're driving a different car? And that even if he recognized you driving it, he couldn't see you behind the wheel due to your tint?\"\n\nWoman: \"It doesn't matter if he can see me or not! I bet he'd wave if I were white!\"\n\nMe: \"But you said he waved at you in your oth--\"\n\nWoman: \"Do they train y'all to be disrespectful?! This is ridiculous! Okay, Mr. [my last name, which she reads off of my security badge], I'm gonna tell your superiors how you and [co-worker] treat employees and we'll just see what they have to say about that!\"\n\nAnd she left.\n\nI called my boss to give him the backstory and a head's up and sure enough the woman complained later on that day. I'm told she was even more ridiculous on the phone call and made exaggerated claims about the gate officers being rude to her. At one point, it was claimed that I gave her the finger as she drove off but a check of the camera footage quickly destroyed any credibility she had and her complaint was ultimately ignored.\n\nNow none of the gate officers wave at her.",
        "created_utc": 1397153599,
        "upvote_ratio": ""
    },
    {
        "title": "Pope Francis about his time as a bouncer [X-Post from r/videos]",
        "author": "MuscleBrick",
        "url": "https://www.youtube.com/watch?v=Tmq4jCFfYCI&amp;feature=youtu.be&amp;t=11s",
        "text": "",
        "created_utc": 1397081197,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else get to work with family?",
        "author": "Predawncarpet",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/22hjsq/anyone_else_get_to_work_with_family/",
        "text": "I work security at a gated community (among other places). My dad is a sergeant with the local Sheriff's department. One night, at the community, I was doing my rounds and noticed a small light by the pool. I walk up to check it out, and there's this kid completely naked, messing around on his phone by the pool. I walk over to him, and be jumps up and bolts (there are 4 entrances to the pool). My dad was on duty, so I text him and ask if he wants something to do. Of course he's always down for some fun. I go back to the pool about 20 minutes later, and sure enough the kid is back. He runs off again. This time I call my dad, and he comes on over. We flushed out the kid a third time, and dad ran his lights for a couple minutes and we just walked around for a bit. We weren't looking for an arrest, just to kill some time and get the kid to stay out of the pool. My dad actually manages to find footprints leading away from where the kid ran out (he used to be a detective and the main CSI unit) but they didn't go far before drying out.\n\nAnyone else have stories of working with family?",
        "created_utc": 1396927537,
        "upvote_ratio": ""
    },
    {
        "title": "Easiest Removal Ever",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/2260o2/easiest_removal_ever/",
        "text": "It's about 22:00 and cafe staff in my building tell me a dude is 'tweaking' at a table. I approach the guy and he's like, twitch dancing, sweating, rocking out. Clearly this dude is on a lot of E.\n\nI open up with \"hey there, what's going on\" and  the guy introduces himself as trevor, and was like \"I'm just trying to get some breakfast man\"\n\nHe thought it was morning. He didn't even notice that I'm security. Anyone who's dealt with E before knows they tend to stay in emotional extremes, and it's easy to flip them to another emotion. He's happy, I wanna keep him there. So I put on my \"bro\" voice\n\nme: \"dude, it's like 10 o'clock\" \n\nhim: \"shit man no way\"\n\nme: \"yeah man, that means (rave club) is open\"\n\nhim: \"YEAH it does \"\n\nme: \"weren't you trying to get there\"\n\nhim \"...yeah.. shit yeah that musta been what i was doing\"\n\nThen he fist bumped me and danced down the street towards the club. All the while cafe staff are standing there in amazement.",
        "created_utc": 1396586061,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Guard Tour Verification solutions...",
        "author": "evildead4075",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/224e02/looking_for_guard_tour_verification_solutions/",
        "text": "I'm tasked with replacing our old Detex system. I've read some about the Detex Proxipen, Guard Tour Systems, and Deggy's system, as well as a couple smartphone QR code systems. Anyone using any of these have any opinions? Recommendations? I have a $5000 budget and need to cover 100-150 points...\n\nThanks",
        "created_utc": 1396548434,
        "upvote_ratio": ""
    },
    {
        "title": "You're on my turf now, buddy.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/21vr0l/youre_on_my_turf_now_buddy/",
        "text": "This story I'm off site, in my uniform at a transit station on my way to work. We are allowed to wear uniforms off duty as long as it's going to/from work as there is often nowhere to change at the site itself. Normally I wear a covering garment, but this particular day was quite cold so I was wearing a bulky company issued jacket.\n\nIm waiting for the train, and there's this idiot, gotta be in his 50's, making comments at literally every woman who walks by him. He isn't really doing anything other than being annoying, so Im trying to ignore him. After awhile the station gets quite empty, with me on one side and him about 50 feet away, and a couple other bystanders who are keeping their distance from him. When in walks this girl who couldn't be any older than 14, come in the entrance pretty close to him and stands there. He says something to her that I can't hear, but I assume has something to do with her being an angel or something due to what his next comment is.  She gives that sort of nervous, trying to be polite laugh, and then walks away from him about 10 feet.\n\nHe gets up, walks over to her, and says an incredibly lewd comment, I remember the gist of which was ripping off her 'angel wings' and spanking her with them.\n\nOf course she walks away quickly. He starts to follow. At this point I can't ignore him anymore, he's crossed the line and she's just a kid. Everyone else is doing what bystanders do best: be bystanders.\n\nSo I step in and tell the dude to fuck off. He takes his attention off her and on to me. He decides he's gonna intimidate me. Picture this: he's about two inches shorter than me, overweight, and in his 50's. I'm fit and in my 20's. He walks right up to me and goes \"you ever killed a man, security OFFICER (he says this really sarcastically)\" I tell him no, but I have arrested a few like him. He says \"i did 20 years\", i ask if he's looking to do 20 more. He takes a step back, towards the door, and goes \"don't fuck with me man, im crazy\" and proceeds to elbow the door frame nearest him as hard as he can.\n\nThe metal doorframe. Mounted into a concrete wall. He pauses for a minute, then gingerly brings his arm back to his body, and slinks away, out of the station.\n\nFast forward to the following day. I'm at work, there is a cafe in the building, the entrance to which I can see from my desk. I look up and see his coat and backpack go past, but don't see his face. I'm thinking \"no fucking way\". I start paying attention to the cafe more, but I can't see most of it without getting up, and I'm busy doing other things. Course no more than 5 minutes later, one of the staff members comes up and flags me down, says someone is catcalling at random women. Of fucking course.\n\nI walk up to him, ask him to stop harassing customers, he says \"fuck off, I'm eating\" without even looking up. I intentionally step into his field of view and say it again, he makes this hand wavey gesture, then looks me in the eye, and after about a second he finally recognizes me. I tell him again to leave everyone alone or i'll ban his ass. He nods, makes some sarcastic noises. I walk away, but stay in the cafe and make sure he can see me. He left after only a couple minutes.\n",
        "created_utc": 1396315108,
        "upvote_ratio": ""
    },
    {
        "title": "Is that going to be a problem?",
        "author": "skuzzydoctor",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/21r965/is_that_going_to_be_a_problem/",
        "text": "My first post ever. Wall of text.\n\n**Background:**I am a Security Officer for a very large call center building in the North West. This building holds 3 companies. The companies would remind you of *'just do it'* *'billy gates'* and *'tax software'.* I have a lot of employees to watch over, and almost all of them are shit heads. The building is fairly advanced in technology, and requires all employees to badge in and out of every single door in the place. I monitor 45 cameras, 2 large parking lots, and every single other type of access control you can think of.\n\n**The short story:**\nThis company has the required handicap accomodations you would expect from a large business. A bunch of handi-cap parking spots, button activated doors, dual elevator access, and even seperate dedicated bathrooms both downstairs and upstairs.\n\nI do NOT discriminate against anyone needing handi-cap assistance. I am a great guy and do my part for not only my job, but society. I help out as much as I can, as professionally as I can. This doesn't mean that I can't smell your bullshit a mile away.\n\nIn walks (I guess I should say limps, because she legitametly limps to me) Entitled Handicap Bitch (EHB) She made her way down from the second story, to then come into contact with the rear employee exit doors, and refuse to use the handicap button. So as I'm sitting there monitoring the cameras and badge logs, she is grunting extremely loud, **on purpose mind you,** and putting all of her body weight into the door to get it to open.\n\nNormally in this case I get up to help the employee open the door, but she already had it halfway open and was making her way into my office by the time I sat up. Here comes the ridiculous conversation.\n\n**EHB:** Those doors are absolutely useless! You guys don't have the common deceny to make them work properly?!\n\n*A bit taken back by the way she approached me, but I remain calm.*\n\n**Me:** This door has an automatic switch and it can be opened for you by pressing the button that is on either side of the door.\n\n**EHB:** I don't care! These doors should have censors and open for me! That's ridiculous! Speaking of which, I came down here to talk to you about the parking!\n\n(*Cringe inside*)\n\n**Me:** Sure, what do you need?\n\n**EHB:** I start work fairly early in the morning so my mind isn't always the clearest. I have a handicap placard for my vehicle, which is a big suburban. When I park in a handicap spot, I like to park halfway within the line so I have enough room to get out of my car. Is that going to be a problem?\n\nNow folks, let me prepare you for the rage I felt inside. I truly, honestly feel for those who are physically or mentally impaired. I am very happy that we have policies in place to allow people to work as comfortably as possible with their conditions. But nothing irks me more, when those very same people take full blown advantage of these policies, and decided to rub it in your face. I am the Security Officer here, and I do NOT work for this call center. I work for the private security company who hired me. So a lot of what I say or do will only be judged and evaluated by my company. Parking spaces have white lines for a reason, they are NOT just a GUIDELINE! You MUST park within these lines or I will TOW YOU!\n\n**Me:** Yes that will be a problem. As per the contract you signed when you began your employment here, you adhered to the rules and regulations passed down by this company. Part of those rules state you obide by the parking rules. Those rules state that you cannot obstruct any parking spaces or park outside of the lines. This can and will result in a tow.\n\n*EHB gives me this horrified look of anger and confusion. As if she found out that god himself was actually a giant dildo*\n\n**EHB:** Really?! You can't be serious! I've always parked like this and it has NEVER been a problem!\n\n**Me:** I'm sorry ma'am, but we simply ask all employees to park correctly and there will never be an issue.\n\n*EHB limped off into the sunset, and from then on constantly gave me dirty looks any time she saw me. She also continued her refusal of using the handi-cap button for doors, and made a scene everytime when she had to open them herself.*\n\nOh and bonus story.\nEHB decided she would take a step further and park in our handicap spot without a placard anymore. She thought she won the war until one day she limped out to an empty parking spot.\n\n**TLDR,** Sometimes humans are simply greedy and self righteous people no matter the circumstance.",
        "created_utc": 1396198997,
        "upvote_ratio": ""
    },
    {
        "title": "The Adventures of Florida Man, Part I: \"That's Entertainment!\"",
        "author": "6isNotANumber",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/21obxz/the_adventures_of_florida_man_part_i_thats/",
        "text": "Weekends are usually pretty quiet here at the courthouse.  Bond hearings aren't a big draw and the judges never work Saturday or Sunday (not when there's golf to be played!), even the panhandlers out from move on to greener pastures...usually.   \nToday, however was a different story.  \n  \nI arrived a little before 7 to relieve the overnight guys and order the morning coffee.  Nothing unusual to report, just another slow night.  They left and I settled in at the desk with my first cup of the day and my tablet to watch some Archer and await my supervisor.   \nJust before 7 I hear shouting out on the front steps and went to check it out.  \nI found my supervisor (mid 30's, fit, black, lesbian) blocking a skinny,*naked,* dancing black dude (imagine every bit of stereotypical crackhead behavior you've ever seen and then crank it up to 11...) who was trying to get in the building \"causes I *need* to know what *time it is* so I know if is time to make loooooooove to you, baaaaaaby!\"  (That's as close as I can phonetically get to the babble he was spouting).   My supervisor was having none, she had her baton in hand and kept shouting \"get on outta here! I don't even like dick, you nasty bastard!\"  \nThen CoM showed up and hauled him off...    \nFun morning! ",
        "created_utc": 1396107234,
        "upvote_ratio": ""
    },
    {
        "title": "I HAVE A CONSTITUTIONAL RIGHT... *always make me smile.*",
        "author": "belil569",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/21hgmh/i_have_a_constitutional_right_always_make_me_smile/",
        "text": "Nothing long just something like the title says.\n\nNothing makes my day for stupid quite like hearing. \"I have a constitutional right not to do what your saying.\"\n\nBest parts for me? Few things really.\n\n1) I work in Canada and get this from yanks all the time\n\n\n2) Those rights do not cross your boarder. Hell at the crossing they almost don't exist\n\n\n3) They are on Canadian soil and are granted only a few of those by traveling through.\n\n\n\nJust thought Id share. Sure a Canadian has done something as foolish. Just entertaining as I hear this a few times a day.",
        "created_utc": 1395899247,
        "upvote_ratio": ""
    },
    {
        "title": "Beach fun",
        "author": "SmilyRedhead",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/21biti/beach_fun/",
        "text": "Way back when I spent a summer working for a security firm as a parking attendant. We were a bunch of teenagers selling parking tickets for the loval beach area. There were three stationary posts, each of them right where the paid parking area begun. And then there were some of us riding around on bikes, hanging where necessary. A pretty sweet gig in my opinion. \n\nBut it was not all fun and games. We got hassled a lot for parking fines. Since most of us were underage and with no training, our job was just selling the parking tickets for people to stick on their dashboards. The person checking and fining cars, was an adult, but since she had the whole beach to randomly patrol, we never really knew where she was. \n\nMostly we got away quite easily, explaining that there were signs and stationary people on every entry to the beach and most adults saw the point in not bitching with children. Most adults. \n\nOne particularly busy day I was assigned with keeping an eye on a drive, that was only accesible to service cars. (For some reason people start thinking that when all the spots are filled, it is okay to park whereever. Well it's not)\nSuddenly a car stops next to me and thw driver starts yelling at me. Since he was yelling in foreign, I tried to communicate that I didn't understand his blight. He switches to my national language and keeps yelling at me that he got a fine for parking. I try my best to tell him that there are signs that outline the paid parking area and also signs everywhere else. But the guy does not listen and keeps yelling, whilst getting out of the car and stalking towards me in quite an agressive manner. \n\nI started to freak a little, because I was 15 and short slip of a girl. But never fear, supervisor to the rescue. \n\nOur supervisor was a huge guy in his late twenties, riding around in a ridiculously small company car. To this day, I wonder how he managed to get into that clown car without bending his knees backwards. \n\nHe pulls up and very politely drops a casual:\"What seems to be the problem here?\"\n\nThe angry guy inhales deeply for another tirade, but since the supervisor has started to fold hinself out of the clown mobile, he suddenly deflates. The conversation after becomes very civil and the angry guy is out of there in less than a minute. Supervisor pats me on the shoulder and tells me to call him if the guy or others like him harass me again. Great guy. \n\n\n\nAnother fun thing to do, was to stand in front of a full parking lot and waving drivers away, indicating that is was full. After an hour and at least ten cars driving past me into the lot and berating me that is was full and why didn't I say so, I finally snapped to one of the drivers: \"I am wearing a reflector vest, have bright red hair and you almost ran me over driving into the lot, how on earth did you miss my waving you away?\" Thankfully the guys girlfriend was a fellow readhead and a reasonable person, stating that I was quite right and told him to get a move on, before he could get huffy. \n\n\nAll in all, that summer was pretty fun. And even though the pay was kinda shitty, I got a nice tan and plenty of exercise out of it. ",
        "created_utc": 1395754304,
        "upvote_ratio": ""
    },
    {
        "title": "What's your everyday carry (off and on the job)?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/217xk2/whats_your_everyday_carry_off_and_on_the_job/",
        "text": "What do you have on your belt and in your pockets, both in and out of the job?",
        "created_utc": 1395656329,
        "upvote_ratio": ""
    },
    {
        "title": "Blond girl has a brainfart",
        "author": "SmilyRedhead",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/211rk1/blond_girl_has_a_brainfart/",
        "text": "I work for a world wide security company and my current post is screening cars for an embassy. \n\nThe building is downtown and side by side with residential apartment buildings, but they do have some exellent deterrants in place. Relevant to this story is the fact that most of the backside of these buildings are courtyards for parking and not actual streets for traffic.  Residents and important people have passes, but random cars don't get anywhere. \n\nThat goes for cars. At one point there is a raised barrier, but it has bollards on both sides, so foot traffic is not hindered. \n\nOne sunny day a blond 20 something young lady walks right up to the barrier. I don't really think anything of it, there are plenty of people moving all day and  since the building has no elevator and the doors are always locked, people waiting for someone won't bother going inside. \n\nThe blond just stands around and after a minute trys to catch my eye. I step out of my little booth to ask if I can be of help. \n\nBlond:\" Yeah, I'd like to go through here.\"\nMe:\" Go right ahead.\"\nBlond:\" Well this thing is in my way.\"\nMe:\"Umm... That thing is for cars, you can just step around it.\"\n\nConsidering she flushed a bright pink and didn't need elaborating what \"step around\" meant, she wasn't the stereotypical airhead,  but I was amused for the rest of the day. ",
        "created_utc": 1395455211,
        "upvote_ratio": ""
    },
    {
        "title": "Hotel Security - Pilot Episode",
        "author": "[deleted]",
        "url": "http://youtu.be/KSlqVXit6_M",
        "text": "",
        "created_utc": 1395307908,
        "upvote_ratio": ""
    },
    {
        "title": "Manhandling a pregnant lady.",
        "author": "JohnDoe92",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/20u4pe/manhandling_a_pregnant_lady/",
        "text": "Not a crazy story, but this sub seems pretty quiet and it needs something!\n\nI've recently started working as a bouncer and am currently assigned to a bar/club in an affluent little town in the north of England. No real trouble, usually, as everyone's quite well-to-do, but every single resident thinks they're above everyone else. I'm sure you get the picture.\n\nLast Saturday, I was stationed in the main room of this club, and it was as easy as always. A manager came over to me around 1:45 and asked me to \"quietly\" escort a larger lady (LL) out, as she'd thrown up in the toilets a few times. No problem, probably had a few too many.\n\nI walked up to her, leaned in and put my hand on her shoulder, as one would a friend, as I had to get quite close to hear her over the music. The following exchange occured:\n\nMe: \"Hello love, would you mind stepping outside with me so I can chat to you where we can hear each other properly?\"\n\nLL: \"What?! Why?! What have I done?!\"\n\nMe: \"There's no problem; I'd just like to talk to you, somewhere a little quieter.\"\n\nLL eventually complies, coming outside with me.\n\nMe: \"Sorry, but I've been informed that you've been throwing up inside, and that's usually an indication that you've had one or two too many, so I'm afraid you're going to have call it a night.\"\n\nLL: \"I'll have you know, the reason that I've been ill is that I'm pregnant!\"\n\nAt this point, I feel for her. However, the fact of the matter is that she's been sick in our venue, and that ain't cool. Her high-and-mighty tone didn't really help her cause, either.\n\nMe: \"I'm sorry that's the reason, but I'm afraid you've still been ill, and you can't come back in.\"\n\nMy colleague on the front door (C) told me to go back inside, not worry about it, and that he'd cop the flak. Phew.\n\nBack inside I went, and when the manager passed me again, I let her know what had happened. Her reply: \"well, that's funny, because she's been necking double vodka redbulls all night!\"\n\nSo yeah, she was just a fat, moaning bitch.\n\nBut that's not all! Got a call from C to come out at 2:15 for a chat, had the following conversation:\n\nC: \"Half an hour, she's *JUST* left. Accused you of manhandling her, wanted in writing the reason she was ejected, and wanted everyone's SIA badge numbers, for a formal complaint. Told her that if she'd been manhandled, she'd fucking know about it, and that she could file as many complaints as she wanted\"\n\nI can only assume that the \"manhandling\" was the friendly hand on the shoulder.\n\nPeople, eh?",
        "created_utc": 1395256842,
        "upvote_ratio": ""
    },
    {
        "title": "Mall Assault",
        "author": "Hobo_Massacre",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/20thxg/mall_assault/",
        "text": "So a while back I was posted to a special we had running at a mall jewelry store. It was for 5 days. The store had an issue with an employees ex making threats against people at the store and the ex so the store actually hired an armed guard for 12 hrs a day. It was brutal. Standing in a small jewelry store, next to the door for 12 hrs. \n\nOne day (I should mention this store is almost always empty) I'm standing there talking with one of the salesman when this fat woman bursts in. \"Quick, someones being kidnapped\", she wheezes. \n\nI just stand there at first because both me and the salesman were confused as we both just thought she was joking. But she doesn't leave or laugh. After about three seconds later I tell her I can't leave the store. So she calls me a piece of shit or something and leaves.\n\nBut thats when I hear the yelling and the sounds of a crowd. I start looking out the door to see where mall security is (who is also from my company) when I see a tall black male dragging a pregnant black female from a store by her feet. She was literally on her back being pulled by this guy. \n\nThat's when I said fuck it and ran over there (technically I abandoned post). A crowd of at least 20 people had begun crowding around and yelling at the guy. He at this point dropped the female and began walking away from her. So I start to approach him with my hand near my gun.\n\nMe; Hey chief, why don't you go ahead and wait here until we can get this settled by the cops.\n\nGuy: I am under arrest? (he actually puts his hands behind his back waiting to be cuffed. It was bizarre)\n\nMe: Like I said, we're going to wait for the police (I wasn't going to risk arresting him with no backup on a site I wasn't supposed to be at)\n\nSo the guy actually turns around and begins to head back to the woman and began taunting her and pushing her. So I walk between them and stare him dead in the eyes and he starts to walk away. That's when mall security finally showed. This guy immediately told this guy to \"Get the Fuck up against the wall! NOW!\". And he did. \n\nSo we triangled him against the wall, and the mall sec began to motion for his cuffs. It maybe worth noting that mall sec had cuffs, ASP, mace and radio, while I was only authorized to carry a Glock22 and cuffs. \n\nAll of a sudden the guy takes off down one of the large branches of stores that sprout from the central part of the mall (Sorry, I have no idea about mall terminology). So the MallSec rushes the guy and tries to pin the guy against the wall, but he just slips away. So I take off after him at full spring and attempt a clumsy tackle. The guy is knocked to the floor, but springs back up again somehow without stopping and continues. \n\nFinally, a very large (like football playing large, not obese large) man walks in through the entrance we are all heading to. Apparently he sees a black guy being chased by security and he proceeded to block him. He rushes the guy, colliding with the black guy lifting him in the air a few feet. The black guy lands on his feet though and keeps going. He  then makes it into the parking lot where he loses the mall cop. I broke off the second he left the mall knowing I couldn't catch him (jump boots suck for sprinting) and the fact that I wasn't supposed to be involved. \n\nWhen I get back to the store, I explain to the manager what happened. She was very understanding about it actually; and I was gone for less than 10 minutes. My boss also was very understanding as well so everything worked out great considering I violated a ton of company policies. ",
        "created_utc": 1395244142,
        "upvote_ratio": ""
    },
    {
        "title": "Teach Your Children To Lift Their Feet On Escalators",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/20sehi/teach_your_children_to_lift_their_feet_on/",
        "text": "We have this one escalator at the mall that eats shoes if you don't lift your feet in the slightest at the end. I have had to write 10+ reports for damage to property because people cant teach their children to lift their feet which turns into the shoe being shredded by the stairs. This is extremely common with flip-flops but it also happens with regular tennis shoes. I understand that this is a real fear for some people, but I am astonished that no one figures out that you should step off the moving staircase instead of it pushing you off.  This issue has gotten to a point where I just close down the escalator when I get to work. Yea, its an asshole move to do, but its going to save a pair of shoes, some angry parents, a report, and a trip with a medbag by me.\n\nMy favorite call about this topic: I get on scene to the call and get confronted by the child's inraged parent about their flip-flop being shredded by the machine.\nme: I'm officer ___ with ___ Security, what can I help you with\nFather: The escalator ate my kids damn shoe. (shows me the shoe)\nme: Indeed it did sir. Is the child injured at all?\nFather: No hes not injured. I want to know who's going to pay for the new shoes! \nme: There are plenty of stores in the mall that sell a variety of shoes at a variety of prices. I can help you find one after I get some information from you and the child.\nFather: The mall is going to pay for the new pair of shoes. \n\nThis goes on long enough for dispatch to ask my status. Me trying to get the information for my report, but the father injecting that the mall *must pay* for the new shoes. Every time this happens I want to just look at the parent(s) and go: \"If your child would learn to lift their feet when exiting the stairs, we wouldnt have this problem. We have elevators if you have a problem with not exiting properly\"\n\nIts weird how we handle these reports. I show up just to get yelled at by the child's parents about how the mall is responsible for this and we need to reimburse them for the shredded shoe. However, we dont. Its a mall. We dont have the authority to write a check on behalf of the mall nor are we paying out. Go buy a $10 shoe at one of the stores.",
        "created_utc": 1395206767,
        "upvote_ratio": ""
    },
    {
        "title": "Shopping Curfews",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/20rwbk/shopping_curfews/",
        "text": "Howdy, I'm new to Reddit, but am glad that I found this subreddit. I work as a \"mall cop\" which is completed underrated for the amount of bullshit we deal with. I'm sure a lot of you also have that feeling with your similar jobs.\n\nWhile working at this job, I have a new appreciation for private property. At my mall we have a curfew for people to shop thats in place 24/7: Must be 16 *with state or federally issued identification* to shop alone. We walk around the mall stopping those shopping alone who we suspect of being under 21 so we can check that they are in compliance with the rule which has been in place longer than those it applies to. I've been told that this is discrimination, that I'm racist, and that their parents are cops and know the laws and that I profile. Only the last part is even close to true: I profile people based on their looks to gauge their age. From their hair, face, walking style, and shoes I can guess a lot of ages within 2 years. \n\nFor the large part, people are understanding and are willing to work with us to solve their issue whether its getting their parents to pick them up, or return them to their parents, or others. But for a select few this rises a problem. Some people dont like being told that they cant be at the mall, which is open to the public, because they didnt have their identification with them nor are they willing to work with us to solve the issue. When this happens we first ask that they leave, then tell them to, and then, if needed, escort them off property. If it escalates beyond that we then arrest them and serve them a trespass which happens rarely. \n\nWe dont detain or arrest people (even though they say we do) when we stop them. They're always free to leave, just not free to continue. Of course we want as many people to come and shop so we can stay profitable, but those who are under 16 that get dropped off by their parents are at risk for those who also come to the mall to prey on them... which is why the rule got instituted. \n\nDoes anyone else deal with this?",
        "created_utc": 1395194256,
        "upvote_ratio": ""
    },
    {
        "title": "[Cross-post] I was told you'd enjoy this. \"I'm sorry, sir, but I'm not a valet.\"",
        "author": "keiblerclown",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/20rojn/crosspost_i_was_told_youd_enjoy_this_im_sorry_sir/",
        "text": "I'm the sole overnight security officer at an upscale coastal yacht club. This isn't exactly a retail job, but I think this particular tale is in the spirit of the subreddit.\n\nMy office sits just around the corner from the valets' post at the side entrance of the building, and every so often I get members in my office who simply wondered too far while all the valets are in the parking lot.\n\nTonight, a 50ish looking Gentleman (hereafter referred to as Gent) stormed into my office, shouting, \"I demand you bring me my car!\" I bit back my initial reaction, responding instead, \"I'm sorry, sir, but I'm not a valet. They should be back around the corner.\"\n\n\"They're not there! I've looked all over for those little bastards, and I can't find them! I'll have their jobs, bunch of damned high school dropouts the lot of them! WORTHLESS!!\"\n\n\nHoping to calm this man down, I, politely as I can, ask him to take a seat while I make a phone call to the business office. Barbara, the Event Manager and currently the highest ranking employee in the building, answers.\n\n\"Coastal Yacht Club, Barbara speaking, how may I help you this evening?\"\n\n\"Good evening, Barbara, this is keiblerclown, overnight security. I've got a gentleman in my office looking for the valets, they haven't all left have they,\" I ask.\n\n\"Oh dear, yes they have. Does he still have his ticket,\" she replies.\n\nI relay this question to Gent, who promptly responds, \"Valets didn't park my car! Useless little shits weren't even waiting for me when I pulled up, so I parked myself!\"\n\n\"Did you catch that, Barbara,\" I ask of my handheld telephonic device.\n\n\"Yes, I did. If the valets didn't park his car, there is nothing we can do,\" she tells me.\n\n\"That's what I was just thinking. Am I correct in believing the Club closed for the night? It is? I'll take care of Mr. Gent. Have a wonderful night, Barbara!\"\n\nI hang up, fold my hands on the desk, and in my best apologetic voice, tell Gent that there is nothing I, or the Club, can do for him at this point. At this point, Gent stands up, digs into his pants pocket, and whips his keyring across the desk at me, declaring, \n\n\"I didn't ASK you a damn thing! Doesn't matter if you aren't a valet, you're a Club employee, and I'm a Paying Member: I OWN YOU!! GO GET MY FUCKING CAR!!\"\n\nNow, I'm not actually employed by the Club. I'm employed by a Global Security Company, so the worst that could happen after what I did next is a reassignment.\n\nI calmly picked up Gent's keys, asking, \"Could you point out which car is yours?\" Gent flips his shit again, \"LOOK AT THE FUCKING KEYS, YOU FUCKTARD!! IT'S A JAGUAR!! ONLY ONE IN THE PARKING LOT!!\" \n\n\"Thank you, sir.\"\n\nI walk a few feet toward the parking lot, locate Gent's Jag, and chuck his keys as close as I could to it without actually hitting it. They landed a few feet short and skipped under the car. Couldn't have asked for a better landing. \n\nGent has now turned an alarming shade of beet purple, but I'm beyond done dealing with his shit. \n\n\"Sir, Coastal Yacht Club has closed for the night, so I'm going to have to ask you to return to your vehicle and leave the premises, immediately. Failure to do so will require I call the local police department and have you removed.\"\n\nHe almost took a swing at me, but I think he realized I was expecting it and pussed out. He informed me that under no uncertain terms he would have my job and would be there to spit in my face on my way out the door when the Club fired me. \n\nI relished the sight of him scrambling around under the Jag trying to find his keys. He eventually peeled out going way too fast, flipping me off the whole time. I smiled and waved good-bye until he was out of sight.\n\nTL;DR Asshole demands I perform duties not relating to my job. I kick him off the property for his belligerence.",
        "created_utc": 1395189639,
        "upvote_ratio": ""
    },
    {
        "title": "My job in real life",
        "author": "mountainviewer",
        "url": "http://www.youtube.com/watch?v=KSlqVXit6_M",
        "text": "",
        "created_utc": 1394553464,
        "upvote_ratio": ""
    },
    {
        "title": "I ran across one of the people I fired getting arrested on national television ! Another crazy story from a stripclub",
        "author": "reignofcrimson",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/201ud2/i_ran_across_one_of_the_people_i_fired_getting/",
        "text": "Heres a quick story i came across while on youtube. So I was searching for the episode from Dog the Bounty Hunter for some proof on the last post I made when I stumbled upon [this](https://www.youtube.com/watch?v=BuAuxzG-1XQ&amp;feature=youtube_gdata_player) lovely young lady from my past! \n\nShe came to work at our club *extremely*  briefly,  trouble from the get go, when she applied she wrote her stage name as shugar...... yes spelled s.h.u.g.a.r. when we chuckled and told her how to properly spell it she got pissed \"I know how to fucking spell!\" It all went downhill from there. She was lifting other girls stuff even *underwear* she tried picking up johns to  take home,  and before the shift was even an hour in we caught her in the restroom smoking meth. We fired her on the spot, grabbed all her shit and threw it in the street along with her. I thought that was the last I would ever see of that lovely pillar of humanity untill I saw this clip, the funny thing is was caught working at the *worst* stripclub in the state at the time. To put it simply this place is so bad the girls have to put quarters into a jukebox before they get on stage to have music. And lo and behold she still cant spell her friggin name.... suga, lol",
        "created_utc": 1394463590,
        "upvote_ratio": ""
    },
    {
        "title": "The time I told my supervisor to punch sand",
        "author": "FearOps",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/2013xr/the_time_i_told_my_supervisor_to_punch_sand/",
        "text": "So this is the back story. One day I got a call saying I needed to work a double shift because someone called off. I worked mornings at this time and I had to work my shift and a guys grave yard shift.  I was preparing for bed when I got this call and I had to work all night and morning.  About 2 days later our post commander quits.  That next day our security manager supervised the post. This manager was the same guy who interviewed and hired me. I was hired because I had lots of experience so this wasn't my first job. Previously I was told all about the post by the post commander because my trainer when home 7 hours early on my training day. Now for the story.  So I usually arrive on site 30 minutes early and I found that the previous officer was dealing with a police situation. My shift begins and the cop goes on an investigation. My supervisor then enters  the guard shack and does his business.  The cop then returns and asks me a question and I go and answer. Shortly after answering the question my supervisor starts talking with the cop. Then the client arrives off on the distance and asks me a question.  He doesn't ask the \nsupervisor he asked me and I gave him a very brief answer. Then my supervisor \npulls me into the guard shack and starts cussing at me for 2 straight hours. I can't \nremember exactly what he said because its my coping mechanism to block it out \nwhen in the moment. Now when this is going on im just being silent and waiting for \nhim to finish being an idiot. So when the 2 hours was almost up he says take off your \njacket so I can see your uniform. I take it off and he says why the f*** do you have a \nSam Browne belt on? Why are you trying to be this commando bull s***. Now \npreviously when I got hired by this guy as condition of my employment I told him im \nwearing my duty belt and he said it was ok. My previous \"world wide\" security company would not allow duty belts so this was a big thing for me. So my supervisor is ripping on me for having a duty belt and then he tells me im fired. I then lose it and i tell him  very loudly NOW WAIT JUST A MINUTE! NOT only did you say I could wear it the previous supervisor told me I could and everyone wears one here. Not only did I save your ass with that double shift I was trained by the previous supervisor. He then looks at me and says have a good rest of your shift. After that ive never had any problems with him since.",
        "created_utc": 1394434072,
        "upvote_ratio": ""
    },
    {
        "title": "Yet another crazy story from a stripclub",
        "author": "reignofcrimson",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1zzhoi/yet_another_crazy_story_from_a_stripclub/",
        "text": "I had such a positive response to a tale from my bouncing days I think ill try to run a pace of a story a day as to not put a glut on this subreddit.\n\nThis is of the strangest case of \"david vs goliath\" where david was the asshole *and* lost.\n\nIm not a big guy for a bouncer 6'2\" 220lbs im definately a runt in the club security scene, *but im fast*. We had a few doormen that were your typical 6'8\" 300lb powerhouses but for some weird Napoleon complex B.S. the little guys causing trouble always wanted to take on the biggest guy they could find. So I when I eventually became head doorman I was the defacto \"*cooler*\" the big guys tended to rile up the alphas into fighting and I was able to calm the hotheaded patrons because I didnt seem like a threat.\n      Well this was a night where David ignored reason and took on one of my Goliath's  on with disastrous results.\n\nIt was a *really* slow night, Tuesday's aren't a hot club night but you do still get your bored lonely guy or crazy couple looking to have some fun. Me and my Goliath for the night (ill use his nickname \"JR\" like J-R not \"Junior\") a big ol' cornfed Oklahoma boy but a great guy. Well a group of 3 guys comes in, day laborers with a so-so handle on english but im \"Halfxican\" with a good enough handle on spanish to warn them not to cause trouble, the group averaged about 5'7\" 145lbs so scrappy at best.\n   Well things are going fine for a bit but one of my dancers tells me the leader and smallest of the three amigos is trying to nip at the girls when they get close, I tell the girls to be cautious with them and tell the dummies to cool it. Another hour passes with no problems, but as im standing near the entrance looking over the floor I see the dancer taking a bill from him flinch violently and then jump off stage and start wailing on  this guy. I rush the floor and get her off the guy as JR starts throwing the fools out.\n  The dancer is pissed so I have another doorman take her to the dressing room to check her out and I bring up the rear of the three to get them out and this resolved. The dancer wants to press charges because the guy ripped her nipple piercing halfway out so we called the cops and took them outside to keep the club going, as we led the three out JR is leaning on the doorway watching the three walk out, the guy immediately in front of me does one of the stupidest/funniest things ever. Like some kid trying to see if he can touch a basketball rim this little guy hops into the air as he passes JR and *slaps him in the back of the head* now this is a fairly even keeled kinda guy but when hes pissed, you die. He grabs the guy by the neck and lifts him off the ground with so little effort it still amazes me and starts punching him in the face, after three or four hits he dropps the guy who immediately goes into a stiffened knockout. One of his buddies goes to him to pick him up and we tell them to sit on the curb. The DJ comes out to see whats going on and is standing next to me as we chuckle at the jackass who just *had* to test the mountain. Then I hear somthing hit the ground at my feet, a rock! The leader of the trio ran to the little motel next door and started huckin rocks from the landscaping at us! I told him if he threw one more I was going to kick his ass, so what did he do? Throw two more, \n*FUCKINSONOVABITCH!*\n I sprint after this idiot and he scrambles into the motel lot trying to duck between cars, well he trips on a parking block and falls down so he goes into a defensive position on his back like we're in the octagon and tries to kick my knees. It was a feeble attempt at best. I screamed,\n\n\"YOU WANNA THROW KICKS MOTHERFUCKER!?\"\n\n I sidestepped/jumped  into the most brutal fieldgoal kick ive ever laid on a human being, the kick lands on his ear with such force he *spun* like a turtle on its shell. It was only one revolution but when he stopped his body went limp and he promptly pissed himself. My boss had came running into the lot and saw the guy lying there unconcious as I walked away, I dont remember saying this, my mind cloudy with adrenaline but my boss said I was yelling as I walked away,\n\n*\"NOW LIE THERE AND BLEED MOTHERFUCKER!\"*\n\n A cab pulled up suddenly and the two other guys ran and collected their soggy friend and drove off, the police were pulling up just then so we had them grab them for the whole incident. Well they were charged and whatnot but drippy skipped out on bail and was on the run. \n\nTwo years later someone from the club calls me and says turn on the tv put it on channel blah blah, I put it on and its the show Dog the Bounty Hunter..... and look who he found..... drippy! Now with a *massive* cauliflower ear as a trophy.",
        "created_utc": 1394393176,
        "upvote_ratio": ""
    },
    {
        "title": "My first big incident when I was a Bouncer in a stripclub",
        "author": "reignofcrimson",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1zy4v3/my_first_big_incident_when_i_was_a_bouncer_in_a/",
        "text": "I used to bounce at a large gentlemen's club and have a *ton* of stories from my days there\n\nThis is going to be of the first large incident that I had ever dealt with as security.\n\nIt was a usual Saturday shift and the club had only been open for a little over a year so we were still real busy especially on summer weekends.  That night was especially crazy for the doormen because we were really short staffed\n  The head doorman was out with a back injury and my other big guy was just let go, so it was me, one other bouncer, the 105lb DJ, and My boss (who looks like a freindly Ving Rhames) we will call the other bouncer J.\n  It was another run of the mill night of walking the floor, watching private dances (we're in a no touch state, *this comes back later*) and running the door/register. Everything was fine besides running around to quash small issues here and there, I switched with J to run the door for a bit. A bachelor party comes in super psyched, no big deal we get at least one a week or so, its a group of six and they are perturbed to see we are a \"juice bar\" (state law says full nude dancers = no booze) so they come in for a bit but want to go to a bar for a bit and come back. I dont have a problem with this but I give them fair warning that if they are trashed or unruly when they come back they ain't coming in again, they agree and leave at around 9pm.\n      At 1:30am half come back the bachelor and two of his buddies they are jovial but not trashed or even tipsy so I let them back in. I had to use the restroom so I had the DJ cover the door for a second while I used the bathroom, mid stream I hear a loud POP. Not gunfire loud but distinct, like someone smacking a notebook on a marble floor. \n   I cut short and zip up and as im coming out of the restroom I see J pissed and leading the bachelor and two of his buddies out, the bachelor has a huge handprint on his face so I figure he did something to a dancer. We get the group to the door and  the bachelor spits in J's face I block the door to keep him from crossing the threshold. We had a golden rule to avoid litigation, if they get thrown out we dont follow if they come back in its fair game. I was trying to keep J from going out and getting charged with something.  While we were doing this my boss is cought up maintaining the floor and the DJ is trying to watch the register, little did me and J know the other three had came back as well when I was in the restroom and had gotten behind J. \n\nThey shoved him out and the guys outside grabbed me by my shirt and pulld me out as well. One guy jumped on my back and tried a poor attempt to choke me out while the other two had my arms. Well liquid courage does not make you sharp, the guys that were on my arms I shook off easy but the guy on my neck wrapped his legs around my waist so when I tried to hip toss him off he wouldent budge. So I took him for a ride and rolled with him, I flipped forward with the throw since he was determined to stick on me, when we landed our collective weight came down on his head knocking him out instantly. One of the guys that was on me freaked out at the sight and thought I killed him so he tended to his friend. \n     The other bright boy started fumbling with his pocket like he was trying to pull a knife as he approached me so I pulled a Yawara (short club) on him. He freaks out at it and puts his hands up then backs off, I look over to my other bouncer and the three others are on him, one guy was trying to grab him and the other was trting to land drunken kicks and punches that were missing at every throw, the bachelor sucker punches him in the face knocking a peice of tooth through his top lip.\n\n\"IS THAT ALL YOU GOT YOU FUCKING BITCH!?\" \n\nIs all I heard J say before he fucked all three up *badly* after making quick work out of the two immediately on him he grabbed the bachelor by the collar and introduced his knee to his face and then the pavement. In the last feeble attempt at something from this bunch was from the fellow who thought I killed his friend, he got his buddy on his feet and tried to rush me from the side. My boss who has now caught wind of the fight came flying out of the door and laid a brutal elbow across his face and held him up by his jacket as his legs statred to give out saying.\n\n\"You guys lost! Fuckin' stop already!\"\n\nThey pile into the SUV they came in and sped off right as the cops pulled up. The whole thing lasted about 5 minutes, We were detained for a second and an ambulance came to clean us up and check out J's face. This should have been the end of it but no.\n   J tells me the whole story of how this whole thing started, the bachelor came up to the stage and was being obnoxious with the dancer, after a minute trying to get her to come home with him and suddenly before J could get to him or say anything the asshole ran his hand up her leg and *into* her privates. She isnt a dainty girl either she is a fitness nut and is built like She-Hulk. She belted him across the face so hard she broke blood vessels in his skin, and as J was draggijg him out thats where I stepped in. \n\nAs he's finishing the story and the cops are taking statements a guy comes hobbling up the street towards us *it was the guy i \"killed\"*, I tell an officer that he was one of them and they detain him. He goes on this tirade of how we took them all outside and beat them up then stole their money. Lucky we had a few witnesses and cameras to back up our story,  in the end three of them were charged with a bunch of things including inciting a riot and assault but the bachelor got it the worst. The dancer decided to press charges so he had been charged with sexual assault and has to register as a sex offender besides that J hit him so hard he had to be put into a halo neckbrace for several months and when his fiancee found out she left him.\n\nTL; DR  Got jumped by six drunks after kicking them out for assaulting a dancer, me the other doorman and my boss fuck them up. \n   ",
        "created_utc": 1394343311,
        "upvote_ratio": ""
    },
    {
        "title": "Security Guard Woes: If you're gonna screw me, at least take me out to dinner first.",
        "author": "Escobeezy",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1zexn9/security_guard_woes_if_youre_gonna_screw_me_at/",
        "text": "Hi /r/TalesFromSecurity! I posted my first story in my in /r/TalesFromRetail, this is a crosspost. \n\nThis tale is still ongoing and it will basically describe why I'm leaving Security after a year and a half. Hopefully this also serves as a warning for younger people who are looking for their first jobs. If it looks shady, smells shady, then the whole operation is more then likely shady.\n\nSo my security company, especially the owner is a shady setup. Always undermanned, always finding a way to screw either the clients or the workers over. I can't tell you how many times my boss has called me and asked me to write up 2 reports to make it seem like there were 2 guards on site when it was only me so the boss can get paid for an extra worker which he pockets. Not only that but to get a tax break (I think), he pays many of us under the table. Oh his most senior workers are on payroll. But the others, myself included are not. To add further to the madness, he seems to have at least 3 or 4 different companies with the same employees. Yeah, not shady at all right?\n\nAnyways, shadiness aside, this is about money. And when it comes to money he's always short. He'll make excuse about how his clients haven't paid him, or something came up. \n\nWell it isn't my problem as an employee how much in the red the company is in. My job is to go work and get paid and I expect to get paid on times.\n\nHere in lies the problem.\n\nHe doesn't pay his employees sometimes. We'll have to wait a few days or something to finally get our cash.\n\nThis last week was the final straw. I had told him that I needed Friday off because of a wedding I was to attend. He says sure. Come Thursday night I text him to ask if I could get my pay early because I was going to go to the wedding and I didn't want to go with only 15 cents in my account. \n\nHe calls...\n\nHe starts saying that I asked for the **NEXT** Friday off. And that he still didn't get a check to deposit himself so he couldn't pay me early in the morning. I ask if I could just pick up the check and deposit it later.\n\nI never get a solid response and we hang up.\n\nFriday comes around and I call him around 11am. Straight to voice mail. I have to leave for the wedding with only 15 cents to my name.\n\nSaturday. \n\nI give him a call. Again straight to Voice mail. Call the security line. Rings til voice mail. Finally call off of my father's phone. \n\n*Ring*\n\n*Ring*\n\n\"Security\"\n\nOh I was ticked. I put on a cheerful voice and ask if I can go pick up my check. He says sure. So off I go to get my money.\n\nI get there, park my car on the side of the house cause his home is on a corner. I go to the door and wait for him. And wait. And wait. About 5 minutes later he finally comes out from the side of the house. He says my check is under the doormat. \n\nHe couldn't tell me that over the phone? I wasted 5 minutes just standing there and ringing the doorbell.\n\nSo I grab my check and am walking to my car. My boss blocks my way and wants me to shake his hand. And then after I halfheartedly shake it he asks me what's wrong.\n\nARE YOU FUCKING SERIOUS?! \n\nSo I tell him I'm upset about the whole situation.\n\nAs a TL; DR the argument lasts about 10 minutes and basically he said that the paycheck situation was a perfect example of our miscommunication (I.e. he used me not getting paid as punishment for taking Friday off even though it was his fault he forgot) and that I should put him and the job before my family. \n\nFuck that. I was pissed but I brushed everything off as I was about to leave. At least I had my $820. Right?\n\n**NOPE!**\n\nHe tells me before I head off that he only made the check out for $520 and that he'd pay the $300 on Monday.\n\nI take the check and go deposit it via ATM because the  banks are closed. They give me 200 dollars to cover me til Tuesday when the check clears.\n\nCall him on Monday about my money. Nope, out of town. Maybe tomorrow. \n\nTuesday comes and the check clears. Gonna go pay my car tags on Wednesday and just chill. Call him about my money. Nope. Out of town. He'll call me later (he never does).\n\nWednesday. \n\nMy account is -$193, the check bounced.\n\nI go see the branch manager of my bank. She tells me he needs to issue me a new check. \n\nI go to his house with my transaction history. He tells me the check bouncing is my fault.\n\nWhat.\n\nTHE.\n\n**FUCK.**\n\nHe tells me that I shouldn't have cashed the check and that he told me that he didn't have the money in the bank. That if he had known I would cash it that he would have paid me in cash to hold me over til he could give me a check. That the only reason he gave me a check was I kept bugging for one but that I shouldn't of cashed it. That I should have waited for him to let me know when I could cash it. Like I asked to do on Friday...\n\nSo we argue and when he tries to prove that he told me he told me via text. He fails to find anything in his inbox and he just leaves it at that. He gives me a check for $620 and says he hopes it doesn't bounce.\n\nI deposit it. After fees and covering my overdraft. I have $6.50 in my account. The check thankfully clears and I use half of it to pay for my tags. And about $100 in gas. I have $100 left in my account and he still owes me $200. My next payday is Friday. I have no clue how he's gonna pay me but I'm giving my 2 weeks tomorrow. \n\n**Lessons** **To** **Learn**\n\n- Get your ass on payroll\n\n- If it looks shady just leave.\n\nSorry if this is long winded you guys but I really needed to rant. I'll answer any questions you have if I can answer. ",
        "created_utc": 1393827898,
        "upvote_ratio": ""
    },
    {
        "title": "She still wondered why he said no.",
        "author": "Greedeater",
        "url": "http://videobam.com/CmqbN",
        "text": "",
        "created_utc": 1393647212,
        "upvote_ratio": ""
    },
    {
        "title": "But I wanted the stranger to give my kid candy!",
        "author": "VigilantInfidel",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1yssdy/but_i_wanted_the_stranger_to_give_my_kid_candy/",
        "text": "**Backstory:** Of my two-full time jobs, one is as a security officer for a business research campus. I know a couple who works here who I will affectionately call Jim and Pam (not their real names but if you get the [reference](http://theoffice.wikia.com/wiki/Jim-Pam_Relationship), they're the sweetest couple ever). They bring their kid to the daycare on campus when they come to work each morning and, when I stand guardhouse duty, they'll slow down and roll their windows down so I can wave and say hello to their toddler, Cecelia (also not her real name).\n\n**Story:** Jim drove his little suv up to my gate one morning with the windows rolled down so they could say hello. I happened to have some candy on me that I was going to bring it to my second job later but I offered a lollipop to Cece -- with Jim's permission -- and she loved it. I waved goodbye and the next car pulled up to my gate. The woman driving the car had her driver's window up but the rear window rolled down. I waved as they pulled up and waited for her roll her window down but she just sat there, staring at me through the glass. From inside the car, I saw motion and I could see a child in a carseat buckled in on the passenger-side of the backseat just sort of staring vacantly in my general direction. I was puzzled as to what was happening since the car was now parked in my one-lane road and blocking traffic without any context as to why.\n\nPuzzled, I leaned forward and asked, \"Can I help you?\"\n\nThe mother rolled her window down and angrily yelled out \"I guess not!\" And then accelerated a little too rapidly for someone with a kid in it and was gone. I had no clue what had just happened but I called in the car's description and license plate to our control center, just in case it was important later on.\n\nAn hour later my boss called me to let me know someone had complained about me. Apparently some mother had seen me hand out candy to the kid in the car in front of her and complained because I hadn't offered her kid any.\n\n*TL;DR: Magical dragon escapes from zoo and I have to enlist the help of a rag-tag team of misfits to persuade it to turn over the codes that will help break a mysterious loner with a knack for adventure out of a supervillain's lair before an alien plague causes the end of the world. Starring Don Cheadle.*",
        "created_utc": 1393255083,
        "upvote_ratio": ""
    },
    {
        "title": "I've not been in security for long, but I have a couple stories.",
        "author": "DystopianFreak",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1ylve4/ive_not_been_in_security_for_long_but_i_have_a/",
        "text": "So, I got hired in with this security agency roughly a year ago, and ours is one that contracts out to MANY different locations in town.  Most of everything I've done has been boring (just like tonight, as I sit here writing this) but here are [number] instances that stick out in my mind:\n\n**Story 1:** I was working third shift at a factory at the edge of the city, which is my usual position, and the night is going as it usually does: with nothing happening at all.  I'm usually tasked with patrolling the exterior once every hour/hour and a half and checking to make sure that the doors are locked, but then around 1am, back in December, I pull in my vehicle around one side of the factory and see a vehicle that wasn't there before.  \n\nAs I'm driving slowly up to it, I see a faint glimpse of movement inside and then notice that the windows are fogged up. I pull up behind the vehicle, get out of my car, and approach them. As I get close, I faintly see a thin, shirtless guy, probably in his late teens in the drivers seat, and the back of another shirtless person in the back seat.  They IMMEDIATELY take off and I knew exactly what I had just interrupted. \n\nNow, had this been any other situation, I would have noted more about the vehicle, but even from the side of the driver's face I could tell he was shitting himself and that they would NOT be back, now or ever.  So, I simply noted in my logs the description of the vehicle and that I saw them there for a brief time before they left (people often use that side of the building to park cars for walking their dogs, even late at night).  It wasn't until I got back inside to the office that it hit me exactly what the teenagers would have to do from that point, which was drive with a shirtless (at least) driver an indeterminate distance to find a spot to park the car again and get dressed.\n\n**Story 2:**  Other than for some special seasonal coverage and the factory, all other sites I've only worked at for a day or two at a time to cover for people who were sick or on vacation, and one of those times lead me to a subsidized housing apartment building which was immediately described to me as the most dangerous site within our company (lovely).  The rundown was the usual:\n\n\"These are your duties\"\n\n\"This is where the meth smokers like to hang out, you know what meth smells like, right?\"\n\nAlong with stories of what were essentially building-wide riots involving fire extinguishers to the cameras.\n\nBut, before we could get to all that, as soon as I walk in the door with the guy who will be giving me my one-hour crash course, there is an elderly man in a walker hooked up to an oxygen tank sitting in the entryway.  He begins to describe how two men stole his cell phone and wallet.  Apparently, this had been something the guy who was to be training me had already been dealing with and he seemed very fed up with the situation. He informed the man that he would be looking through the footage, that he had already notified the police, and that he should return to his room and not open the door unless it was security, the police, or the building manager.\n\nAs soon as the man leaves, I am given a rundown of this man, who apparently is robbed very often, and he often gave conflicting stories about it.  (It should be noted that this man, while elderly, seemed very lucid and non-senile) One day it would be that he was pushed down when they took his wallet, when telling it to one person it would be that it happened on this day, and to another it would be on that day, sometimes he'd report it to the police, other times he wouldn't.\n\nSo, right before the police officer arrives, we find the section of footage where the men \"Knocked on his door, and then immediately shoved their way in, took his things and then ran\".  What really happened was them knocking on the door, him answering it (even though these are supposedly the same people who had robbed him before), them exchanging words, walking slowly inside and then quickly running out, less than 10 seconds later.  This was shown to the police officer, who had apparently dealt with him before as well and confirmed that this and previous stories as well don't match up before taking some notes and leaving. The man was informed that police had the info they needed and they'd be in contact before being told again, as they had apparently told him multiple times before, not to open the door unless it was security, the police, or building management.\n\nSo, that's over, I get the aforementioned training and am told that the man will probably come down later and ask to use the phone and to not let him, and then I'm left to fend for myself with phone numbers and occasionally the guard from the neighboring building coming over for a chat as well as a few interesting people going in and out of the building.  Later that night, again around 1AM (what is it with that time and stuff happening to me?), I see the security camera pick up the same old man getting on the elevator and heading my way.  He arrives and, instead of opening the window to talk to him (as the key had broken off for me in the lock earlier that night) I have to step outside to talk to him.  He, as I was told, asks to use the phone, and I tell him in a calm, but stern tone that it's against policy, and inform him that there is a collect phone on the wall in the next room.  He begs and uses the \"Oh, who's going to know?\" line, to which I quickly respond that management and my bosses will know, as phone records will show (whether they will or not, I don't know, this was my first and only night at this place).  The man then goes on a rant about how he is going to get a gun to keep in his room, as he does not feel safe (which I should have mentioned, he gave the same speech to the guy before), and I gave the same response as the other guard, that management doesn't allow firearms on the property, and we would not recommend it.  Eventually, after more pestering, he gives up and returns to his room.  I still don't know if he was actually robbed, or how any of that turned out. I was asked one more time to work that building, but it was by the other guard who had come over to chat during the night and I was already at my regular shift.\n\nI know these are not NEARLY as interesting stories as some I've seen on here, but I just felt I'd share them.  I still get a chuckle thinking about the teenagers driving nude frantically trying to find somewhere to get dressed and avoiding all two-lane intersections where someone could potentially pull up next to them.",
        "created_utc": 1393051893,
        "upvote_ratio": ""
    },
    {
        "title": "\"There weren't that many when I drove here!\"",
        "author": "dolphinelrapo",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1ygrqv/there_werent_that_many_when_i_drove_here/",
        "text": "So I just came back from what I think is the dumbest customer I've ever caught for a long stretch. I'm back at the lumber store mentioned [here](http://www.reddit.com/r/talesfromsecurity/comments/1o8fdz/infected_chains_and_dumbstruck_guards/) taking some extra shifts.\n\n\n\nI've already explained the store in question before, but I'll repeat it here for the sake of the story.\n\n*The particular site in this story is a large lumber store, also providing tools, paint and other necessities. The site is split into two, one lumber section and one section for everything else. They're both in the same building, but through some corporate-level decisionmaking that leaves me dumbstruck, two entirely different sec. companies oversee each their section (Plenty of stories on this part).\nWe oversee the lumber section and mainly guard the drive-through gates, making sure that customers only leave with what they paid for and no less/more. In addition, we oversee rental trailers.*\n\nI forgot to mention this last, but it's painfully obvious that we control each and every vehicle as the entire booth is marked with **\"STOP-CONTROL\"**.\n\n\n\n\n\nIt's the late swing, 1500-2100, weather as merciful as my dad when the Vikings loose and the majority of potential customers are home watching the Olympics. This means lots of downtime as I sit in the booth and try to make time pass with Facebook, Reddit and cigarettes.\n\nAll was alright, until **he** came. Presumably lost his razor a few years ago, broken down van, out of state plates (or I presumed so, all our state plates are the same, but the two first letters gives a good indication of location. f.ex. RJ is New Vegas and BR is Buckingham Palace). *Ding-ding-ding*, my radar is just blowing **up**.\n\n\n\n\n\nHe parks up and strolls around for a fifteen or so minutes in which I completely drift away back to Netflix. That episode of Supernatural must have been pretty damn good because it felt like seconds later when he stopped in front of the gate honking.\n\n**Fine-as-fuck uniform-on-point Dolphin El Rapo strolls out ready to rumble**\n\n**Me:** So, what have we been filling the van up with today then?\n\n\n**Cust.:** Oh, just some wood and bricks, ya'know, gotta keep warm!\n\n\n**Me:** Well, if you don't mind I'll take a wee look in the back and you're good to go, alright?\n\n\n**I looked at the receipt and no big deal, 5xWood + 5xBricks, this'll be easy to count up.**\n**The customer nods and I stroll to the back, door squeaking louder than your moms bed as I open it.**\n**Oh fuck.**\n\n\n\nThe trunk was fucking loaded. Five sacks of wood in one corner, a fuckton of bricks just thrown in the other and more sacks of wood in front of it like a makeshift wall. Total amount: 10 sacks of wood and 20 bricks. Lol, **no**, this won't fly. We've all had those poor sods who had 56 instead of 55, but this?\n\n\n\n**Definitely ready to rumble I stroll back to him, presenting my findings as polite as possible.**\n\n\n**Me:** So, I'm sure you've just had a little brain fart here. But no problem, you can either head back in and pay up or leave the leftover goods here.\n\n\n**Cust.:** No. I mean, this isn't possible, this ain't me.\n\n\n**Me:** What? (..)\n\n\n**Cust.:** I only loaded up five of each, the rest wasn't in there when I drove off!\n\n\n**Me:** Well, how is that possible?\n\n\n**Cust.:** Someone must have thrown them in there. \n\n\n**Me:** You can't be serious, why would anyone do that?\n\n\n**Cust.:** Maybe they did it so they didn't have to pay! They'll probably follow me home and rob me!\n\n\n**Me:** No offense, sir, but that's the worst excuse I've ever heard. Now you can go pay up or we can strike a \ndeal and leave the leftovers here.\n\n\n**Sighing he reversed back and in the meantime I did a check on CCTV and sure enough, there he is going back and forth filling up his entire van, a lot more than five of each.**\n\n\n\n\n\nThe second time around it all matched up and as I greeted him goodbye he gave me the ten mile stare and went off on his merry ways. \n\nI'll admit I had a smug look on my face as I put a 100 dollar find in the logbook.\n\n**TL;DR:** If your receipt says ten and you have thirty, don't drive through an obligatory control-point.",
        "created_utc": 1392924494,
        "upvote_ratio": ""
    },
    {
        "title": "A question for those of you in loss prevention.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1xufc4/a_question_for_those_of_you_in_loss_prevention/",
        "text": "Hey TFS,\n\nI'm going to be interviewing for a position in loss prevention for a pretty major retailer next week.  I've been with the company for almost six months now, and they've recently opened up a full time LP position at my store.  I'm nearly done with a criminal justice degree, and the general consensus around the store is I've got a really good shot at getting this position.  \n\nSo my question is...  what kind of pay did you start out at?  I've heard a lot of places starting their LPs in the area of $35k, but I wanted to get a little more input before I ask for that when we get to the salary discussions.  I do have a couple of summers working with the local PD as a cadet, and I'm a month away from having my associate's in criminal justice.  I've been handling most of the loss prevention duties in the store for the past couple months already (spiderwrapping products that need it, inspecting potentially fraudulent returns, shadowing shoplifters, etc).  I guess what I'm saying is that this will be my first LP job, but I'm not a kid coming off the street with no idea what he's doing, either.  What do you guys think is fair to ask for salary wise?",
        "created_utc": 1392331996,
        "upvote_ratio": ""
    },
    {
        "title": "Finnish security guards",
        "author": "sienihemmo",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1xsnnp/finnish_security_guards/",
        "text": "I've been lurking around here for a while reading these stories, and I've been seeing this trend of carrying concealed firearms and other dramatic stuff, and I decided I'd write up a little article about how differently Finland handles the private security sector. Just if anyone feels like reading up on pretty much useless, inconsequential facts from another country. Sorry if you feel this doesn't belong here, this is the only reddit I've come across that is about physical security.\n\n**Training**\n\nSo from what I've read, security guards in the USA have pretty much no training, or a short training period where they're just shown the ropes instead of any actual moves or procedures? In Finland, every single guard is required by law to go trough a standardized training. One is a 40h long training which gives you the right to work 4 months per year as a guard, and after that you have to go trough another one, 60h long this time in order to get a permit that lasts 5 years. So 100 hours in all to get the permit. In addition to this, there are 1-3 year long schools that train you in pretty much everything. The people who graduate the school are by law required to have an \"A\" next to their rank insignia to signify a longer education. I'm in one of these schools, I graduate next fall.\n\n**Equipment**\n\nLike I mentioned in the beginning, a lot of the stories here say stuff about security guards carrying firearms. Personally, I don't understand why you would carry a concealed firearm when the biggest effect a gun has is to strike fear, and that effect isn't there if it's concealed. The only places security is allowed to carry in Finland are \"societally significant locations\", meaning nuclear plants and the parliament, places where you really cannot allow some nutcase with a gun to wander into. Anywhere else, no guns. Not even on armored transports. Because the thinking is here that if you give a bank or an armored transport guard a gun, the bad guys are just going to bring even bigger guns and then it just escalates and needlessly endangers civilians. In fact, armored transport guards don't carry anything but a radio from what I've seen. All guards are trained to immediately switch to a submissive pose and surrender if threatened with a gun, unless a civilian is in the line of fire.\n\nBut apart from guns, possible self defense equipment are pepper spray, vinyl baton and an expanding baton. No tazers, no mace (did you know that stuff sticks to your freaking DNA?). And all those require a training separate from the general guard training (OC 8h, vinyl 4h, expanding 8h) and require you to apply for a permit from the police.\n\nVests (bulletproof or stab) are also quite common from what I can tell, at school all of the 'use of force' training (I don't know how to translate it properly, I mean practical self defense training) is done with everyone wearing training vests to get us used to wearing vests on the job.\n\n**Miscellaneous**\n\nPrivate security in Finland is divided into two groups: Normal security guards, and peacekeepers for the lack of a better word (google translate just translates it to vigilante when the direct translation is 'supervisor of order' lol). Security guards are only allowed to guard property and civilians security, peacekeepers are allowed to maintain the peace in public locations. Practically this means that security guards in malls (for example) are only allowed to step in if someone threatens the protected property or the security of the people, not just because they're drunk. Peacekeepers then again are allowed to maintain public order, and they're the ones employed as bouncers and concert security. Also, the peacekeepers have an entirely separate training, and a shorter one at that, only 32 hours.\n\nThe background checks are quite strict, even being accused of something (meaning you have a police investigation or a court case on you) is enough to have you suspended from work until the accusation is dealt with. When I applied to the 40h training there was a background check for any criminal history, gang ties and court cases. When I got in to the school the same was repeated. When I applied for my permit the police did it a third time.\n\nAlso I can sort of understand the whole \"rent-a-cop\" mentality in the USA, a lot of stories in this reddit mention private security as just a step towards law enforcement. In Finland that doesn't exist, people who go for private security are doing it because they want to be private security. That's because there's a law in place that states that law enforcement can't in any shape or form work or be related to the private security sector. This is to avoid corruption and private security turning into private cops. Also it's because the police budgets are constantly shrinking, and many cops graduate only to be unemployed.\n\nThe uniforms are very strictly standardized as well. The only jobs that don't require a uniform are bodyguards and I guess loss prevention (there aren't loss prevention agents per say but normal security guards act to that effect as well). The uniforms are strictly defined so that people can easily recognize a security guard and the company they work for. [Here's an example image](http://kuvat.kaleva.fi/default/c4ce9a76-2a1c-11e1-89c7-12314303c108/large-20100813-100813Vartijoiden_maara_kasvaa_koko_ajan.jpg) (\"Vartija\" means \"security guard\").\n\nAnd, if you break any of the laws about private security, like for example wearing a hat that doesn't comply with the uniform standardization (you can only wear black hats that are either just solid black or at most have the 'security guard' text on it) or carrying equipment without a permit or against your employers wishes, you can lose your job, your whole permit or land in jail, depending on the severity.\n\n\n**Wow, that ended up waaaayy longer than I planned.** Sorry about that. But anyways, I'd like to hear your thoughts on the finnish mentality on private security if you managed to read trough all that.",
        "created_utc": 1392291748,
        "upvote_ratio": ""
    },
    {
        "title": "Free Course- How to Succeed in your Security Career-- for those seeking a foothold in a diverse and dynamic field",
        "author": "Security1",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1xaxdc/free_course_how_to_succeed_in_your_security/",
        "text": "I recently retired as the director of security for a major health network. This is after a career in the military and about 20 years experience in a wide range of civilian security environments ranging from emergency management, retail (LP), high-tech, Fortune 500, healthcare, etc.\n\nDuring a lull in employment, I even spent time as a TSA screener..(now, there's a story...)\n\nOver the years people have asked me for advice on carving out a successful career in private security. This includes co-workers, subordinates, students, and just people on the street.\n\nI have always tried my best to share my experience, insight and \"lessons learned\" to help in any way possible. \n\nThis free course is an attempt to consolidate some of this information and package it (hopefully) for a larger audience. Note: this material focuses primarily on traditional, physical security. However, the growing importance of IT security is not ignored.\n\nMy hope is that we can get some dialogue going and work together to improve the status/image of the private protection professional. Watch the promo video for the course before you commit.\n\nThe course is currently offered by Udmey.\n\nStart here: https://www.udemy.com/courses/\n\nAnd thanks for your interest....Cole",
        "created_utc": 1391807446,
        "upvote_ratio": ""
    },
    {
        "title": "Security Excellence, Please Help Us With Our Survey of Security Professionals Across The World",
        "author": "PerpetuityResearch",
        "url": "https://www.surveymonkey.com/s/LH2DZ8J",
        "text": "",
        "created_utc": 1391774825,
        "upvote_ratio": ""
    },
    {
        "title": "Yes, I have a case of the mondays",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1x9ga4/yes_i_have_a_case_of_the_mondays/",
        "text": "Little background, I work nameless uniformed security overnight at a smallish hospital. Have been working security for over 3 years. Today is my monday.\n\nGet here, and theres already shit going wrong. My coworkers eyes are glazed on the camera feed watching this little skinny looking 5 foot girl throw furniture in the lobby. Seeing how useful they are, I walk over and talk to her, and ask her if she knocked this stuff over. Literally got the look of death from her, and I told her she might want to pick it up, the hospital staff doesn't like it when you throw their stuff like that. Looks at me, continues to play with cell phone. So I walk on over to the door and greet the cop that was called. She starts walking with him following close behind her, then she slams one of the doors open and trys to flee. Didn't get 2 steps before she was cuffed. Turns out she stole her grandmas car, and was arrested on the spot.\n\nFast foward another 10 minutes, get a call about natural gas stankin up the basement. MMMkay, other guard checks it out, seems like the pilot lights on all the buners are on, but it still stanks of gas so we call facilities which takes them a hour to get back to tell us its normal and just leave it alone. SO it still smells like gas but if it blows up at least its not our fault, how comforting.\n\nFast forward another 5 minutes, while he is down there. I get a call about a patient that is acting up. Ok, we get this regularly, this is probably a pissed off 50 something that wants to leave or is pissy because they didnt get their way, and all they need to see is a badge to scare them back into a room. NOPE. Get there and the nurses are having a hard time holding a 30 something year old female down. She decided to rip the ivs out of her, and rip the bags off of the stand and spray them all over the room. Tries to leave, and says that they are experimenting on her, she has to ask to go to the bathroom and to get up and to do anything, says she knows everything now and that her eyes are opened. She tries getting something semi dangerous out of a cart and starts playing with her catheter, and thats when I turned from friendly to not so friendly. She started punching not very hard and kicked a nurse, they ask me if they can get another security guard up here. Obviously there is a fine line with using necessary force in cases like these, and the company I work for will throw you under the bus in a heartbeat, So I asked them if they wanted me to detain her and they said yes. So she ended up face down on the bed until the cops got there. They cuffed her and we ended up putting medical restraints on her (which none of the staff knew how to do, wow)\n\nGet back from all that, and we had guy come in the ER that tried to off himself (Air force). So he's in the room with his 1st SGT and Chaplain and he tries to kill himself again and that doesn't go to well for him. Luckily I didn't have to step in for that one, i just heard the crash and thud of him hitting the ground in the room.\n\nI really wish we could carry something to defend ourselves with here. no mace tazer baton plastic cuffs or anything is allowed here. And I have a CCW and am military -_-\n\nThe cops must really hate this place, they were called here 3 times within a hour or two.",
        "created_utc": 1391766964,
        "upvote_ratio": ""
    },
    {
        "title": "Prank Goes Wrong",
        "author": "comrade_brony",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1x8xwg/prank_goes_wrong/",
        "text": "The university I work at owns one of the oldest buildings in the entire county.  It is a civil war era mansion built to house the commanding officer of the nearby naval base.  When land contracts came up, we ended up taking it off the hands of the DoD, as upkeep of a historical landmark is costly to them.  The place is pretty remarkable, though in kind of poor condition in some areas.  It was so swank back in the day, it had a parking garage for your horse in the basement (stables) and they are still there.  The building is only used twice a year.  One is a three month long review class in the winter/spring, and the other is a haunted house fundraiser put on by a student organization.  They store their props there and we have had fun with them in the past trying to scare other guards.\n\nThe setup:  I am training a new third shift officer on the security tour of the building.  It is a pretty short tour, but I wanted to troll this guy bad after he had said some pretty negative comments about gays and liberals (Groups I am both a part of).  Well, I found out through our conversations that he is pretty damn superstitious.  For example, he told me that \"the gay\" is caused by a demon possessing the victim.  \"Sweet, this guy believes in demons.\"  I think.\n\nWhile I am showing him the building and the guard tour station locations I begin making up stories about a civil war era hospital being in the building and claimed that this is the reason there is a VA hospital next door nowadays.  I told him hundreds of people had died here.  I took him down to the stables, and told him that the doctor hung himself here and pointed to a beam with some scuff marks on it.  Really, all the beams were pretty beat up.  \"Housekeeping tells me they here a baby cry down here all the time.  They told me never to go near it, it's a demon that lures you to it with the irresistible cry of a baby.\"  I thought he wouldn't buy it because I was laying it on thick.  But, it seemed like he was eating it right up.\n\nI took him to the last location in the basement, one of the most creepy areas in the place and showed him the guard tour station there.  I made sure to emphasize that this was the most important station (truly it is) as it is near the fire panel, and we are to always check the fire panel.  \n\nSo, I give him about a week after his training is done.  I look at the tour rotations, and sure enough.  When his shift comes up, he is the next to be touring this building after me.  While there, I grab one of the halloween props, a ghastly looking one that pops up and makes a scream when it's motion sensor is triggered.  I prop it up on a chair to make it even taller and intimidating and place it right inside of the door to the fire panel so that when you open it, the motion sensor is activated.  Later I pass down the shift to him, and head home.\n\nThe next day, I go into the building and find the the prop completely destroyed.  It looked like it was curb-stomped.  I blanched.  \n\nLater that night, I come to find out that the new guy had certainly been frightened by it, but he was not the type to flee.  No, instead he went on the offensive and kicked the shit out of it.  \n\nAfter he told me, i never laughed so hard in my life.  But, now I wonder how I am going to get out of having to pay for the damages...  Oh well, it may have been worth it.",
        "created_utc": 1391748547,
        "upvote_ratio": ""
    },
    {
        "title": "My boss decides safety is less of a concern than getting complaints",
        "author": "VigilantInfidel",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1x4ji6/my_boss_decides_safety_is_less_of_a_concern_than/",
        "text": "**Backstory**\n\nOf my two full-time jobs, one is as a security officer for a business research campus. The campus is spacious but there are only three ways in, the two primary ones are 4-lane roads and the third is a 2-lane road that only employees know about.\n\nWe have trouble with speeders due to the fact that most of the employees are *very* talented and the company is afraid to do anything that would make them leave. Entitlement and privilege are rampant and unfortunately that means that nothing will be done about safety issues until someone gets injured.\n\n**Part 1**\n\nI was at the third gate when a woman in a white Suburban came speeding down the road toward my gatehouse doing 45, maybe 50 mph on a road that has low-visibility at intersections with numerous pedestrian crossings. During normal hours of operation, the gates are raised up and I let vehicles with official company hangtags drive through unimpeded. This time I stepped out to stop her and I asked her to slow down. I politely reminded her of the 23 mph speed limit and was as courteous as possible, then let her go. She was quiet and cooperative and departed without incident. I didn't think anything of it.\n\nLater that day my boss phoned me and asked me if I had had an argument or an altercation with an employee. Shocked, I said no and asked him to explain. He explained that a woman had come in to her building today and complained about me, claiming that I was rude and that she was afraid of me because of how aggressive I was.\n\nI was threatened with termination until I had him review the security tapes (I don't know why that wasn't the first thing he did) where he finally concluded that I didn't do a single aggressive thing except for *maybe* holding my hand out to get the woman to stop her car.\n*(But wait, there's more!)*\n\n**Part 2**\n\nMy boss, deciding that the safety of pedestrians and other motorists was a low priority, had a conference call wherein he told everyone that gate officers are no longer allowed to ask people to slow down because it might \"upset the employees.\" I told him he needed to give me that order in writing before I had any intention of carrying it out. It really wasn't a decision that would have been made at his level anyway and I tried my hardest to get our chain of command to over-rule it. They supported it.\n\nAbout a week and a half later, the local police department started setting up speed traps and radar trailers because so many residents who lived near the campus were complaining about commuters speeding. Then there was a fender-bender and fingers started pointing.\n\nMy boss is no longer employed at this company.",
        "created_utc": 1391640703,
        "upvote_ratio": ""
    },
    {
        "title": "So it seems most of you are better people than me.",
        "author": "svcucaptain",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1wxh7b/so_it_seems_most_of_you_are_better_people_than_me/",
        "text": "So after reading this subreddit while at my post I have come to understand many of you are far better guards than I am. I show up early, take the over time but thats about as far as im willing to go for the pay. My experience with the security industry is longer than I have been employed by it. That usualy involved going to parking garages late at night that were guardef by freinds and getting smashed and in one case three of us(two guys one girl) pissing on a supervisors car while he drove up the ramps but thats not the point of this post. While employed as a night watchman I have taken all the bribes that most posters seem to avoid . My first post was a parking lot of a telemarketing company, easy gig. Untill I watched a guy checking for unlocked cars. I followed about 3 feet behind him while he did this. Never noticed me in my vwry cop like uniform with shiny badge. I confonted him when he grabbed a flower print purse that seemed to be full of panties. He said the panties were his and took off running. I was bored and gave chase and introduced him to the flying end of a maglite. He was still dazed when the police arived to find him coverd in dirty panties on the ground. At that same site I ran into a girl who was masterbating on a wooden recycling bin next to the buildings dumpster. Amazing looking girl, nice perky tits double d's skirt hiked up fingers going to town on her very nice private area. At the time I gotbpaid 8.00 an hour. Which in my humble opinion is not enough to stop a gorgeous woman from reaching climax. So I just stood and watched, she asked if I could help so I did. My log for the night was helped sick woman to her car, felt it was apropriate. She would come back and repeat this once or twice a week on my shift and I would enjoy her company as weird as it was. On another site I was guarding an apartment complex that was under construction. Another easy gig, keep the homless people from stealing copper and make sure no one makes a run at the plywood stocks during the night. It was all fine and dandy minus the great horned owl that followed me around the property. Well a few weeks into that I ran into this red head that was scouting out my fence line. I was bored so I watched her from the 3rd story of one of the buildings. It was mostly bare frame. I will admit I felt a little like batman or some other cool character just chilling up there. Well the red head finaly decides that no security guards on properity so she walks through the shitty fence.  I climb down and follow after her. 16 hour shift I was almost to the point of discusing the finer points of plato with a cricket. Well she climbs one of the mostly finisged buildings and I follow her up. She has found a pretty nice view of the area. Real pretty site, I anounce my presence and she bout shits her self. I ask her what shes doing and she responds with. Having a look around, anyway she offers to let me have some of her rum kn exchange for not kicking her off or calling the cops. As I wanted to have some one to talk to other than mr. Davis the cricket I let her. Well half a bottle of centenial and shes taking off her pants and were screwing at the top of the building. I ended up dating her for 3 years, and she all ways came by work to make my nights intresting. So stopping people from skinny dipping I do not do, drinking on the job I worked new years had to do it some where. Sex om the job with strange women yeah if shes cute not turning it down. Must have most of their teeth, fighting with hobos preventing ass hole boy freinds from beating their girls by ahutting off cameras and having fun yes. This job generaly sucks and I do what I can to make it worth while. Granted I did sleep with several customers while being a shopkeep at a copy and binding joint so its not new to me to take fringe benifits. ",
        "created_utc": 1391465353,
        "upvote_ratio": ""
    },
    {
        "title": "I work a lot of Film sets and TV filming. This is me whenever they have craft services.",
        "author": "[deleted]",
        "url": "http://youtu.be/xlzWpl255DA",
        "text": "",
        "created_utc": 1391327958,
        "upvote_ratio": ""
    },
    {
        "title": "Stupidity at its finest....",
        "author": "ga129",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1w8t45/stupidity_at_its_finest/",
        "text": "The backstory. We are assigned to deal with vending machine refunds and filling out  small slips to give to our vending machine company so we can get the money to give refunds to employees. Now the story.  A woman came to my desk and asked to fill out a refund slip and then I asked what happened. She then proceeded to tell me that the vending machine \"would not take quarters and it only took dollar bills\". So I asked her \"did it give you change\" and she said \"yes\" but then she said it only gave her \"dimes and nickels\" and it \"wouldn't take quarters\". I've then said \"but it gave you your snack right?\" and she said \"yes\" and then I said \"and it gave you the change back right?\" and she said \"yes\" but then still went on to complain that it wasn't taking quarters and wasn't giving quarters after I asked her if she got her change back multiple times. I finally just let her fill out the slip and told her I would take care of it (then didn't actually do anything about it). I've had so many stupid people come in and much worse happen.",
        "created_utc": 1390789318,
        "upvote_ratio": ""
    },
    {
        "title": "My tires were slashed, im missing hours, this is my first month.",
        "author": "gbeto60",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1vcufx/my_tires_were_slashed_im_missing_hours_this_is_my/",
        "text": "I just started working as a guard, im about a month in, im (was) assigned to an apartment complex, they have a parking problem so we are basically just giving warnings to non residents and after 2? They get towed, well, I towed a grand cherokee, 3 warnings and parked half assed at 1150pm, at 130 the owner catches up with me and rudely asked why I towed his car,  my explanation wasnt sufficient so he left me at mid sentence,  at 230 I went back to my car annnd, my tires where cut, on the side walls, all 4, there's no camaras, no witness.\nI filled out the Incident report, my supervisor showed up, towing company towed my car to the security office for free, now I dont have a car to go to work, and today, Thursday I checked on my bank account and I only have 10hrs of work, im missing 4 hrs last week and 2 hrs this week, im pissed!!! I guess there's no story here, im just frustrated because I took the bus for another assignment im in right now, and I cant even afford to buy 1 fu*** tire let alone the other 3, whos responsible for it? The client? The company I work for? Or myself?",
        "created_utc": 1389874135,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Flyers..",
        "author": "BaredFang",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1vbwt9/pizza_flyers/",
        "text": "For a while, I was doing unarmed security as a part-time gig. One of my posts was a large resort on the beach. Large for here, anyway, at over 2,000 rooms. As part of the resort's robust security team of four, one of the headaches we had to deal with was solicitation from the local pizza shops.\n\nOne in particular was owned by a Greek guy, and his pizza place was right across the street from this resort. He was also the biggest offender, as he'd have his drivers try to sneak in a few times a week. They'd walk the floors and place the shop flyer in every door. This was a no-no because, other than leaving a goddamn mess all over the halls that we had to pick up (I worked nights, they couldn't get away with it during the day), it was a security risk for theft. Two of this Greek guy's drivers had just been arrested a few days ago from this tale for burglary. They would use the flyers to try to jimmy doors open, then play it off if they got caught. Didn't work that time I guess. To make matters worse, their pizza would be considered garbage if it were a little less greasy. Anyway..\n\nOne slow night, I am on duty patrolling around the lobby area when a call comes into my earpiece from the Sgt on duty. He went to patrol one of the wings and once he hit the top floor to work his way down, he immediately found that the floor had been hit. Pizza flyers everywhere. To make it worse, it was from the assholes across the street. Those douche-bags knew they were all banned from the property, all had trespasses against them, and yet they were usually 50% of the bullshit we had to deal with. We went into action.\n\nSince I was in the lobby, I jumped into the elevator and hit the first floor, while the other two guys on duty went to the stair wells to block the street exits. That was our usual tactic, block the two stair exits and have one come from above, one from below. It didn't always work, because at night, while you could only enter via the pool door or the front door, you could still leave out any number of other doors. They'd wait until a guest left out a side entrance then sneak in that way, we assumed. Me and Sgt met on a middle floor, no pizza guy. Pissed, me and him hit all the floors again to gather up the flyers while the other two held down the fort.\n\nThey had hit a good 75% of the rooms before we had made whomever it was bail tonight, but what was so infuriating was they had hit us last night, and two nights previous to that, and we had those still in garbage bags in the office, so yeah.. we had a lot of flyers right about then. Hotel management or overly entitled time share owners would always bitch about it. My response was always to question their intelligence on deciding four personnel was enough for that size of a resort. I didn't much appreciate being a janitor.\n\nIt was about 12 a.m. when we got down to the office, dragging our new payload in.\n\nSarge: \"Man, I am tired of getting bitched at because of those assholes.\"\n\nSarge dropped into one of the office chairs as he threw his huge trash bag into one corner. He then picked up one of the flyers and looked it over with a scowl on his face.\n\nSarge: \"How much do you think he spends on this crap?\"\n\nMe: \"Too much.\"\n\nThis dude must has spent his entire ad budget on the things, because they were roughly half-page, double-sided, color print, thick cardboard flyers. Fancy shit. And he passed them out like candy.\n\nSarge: \"God, I wish we could do something.\"\n\nMe: \"Yeah. I'd shred every single one of them, then take em right back across the street to him.\"\n\nSarge: \"Ooooh that'd be sweet, but eh, I don't want to get fired.\"\n\nMe: \"Luckily, I don't give a shit about being fired. You think hotel cares about this asshole? They want us to have anyone from there arrested or trespassed.\"\n\nWe were just bullshitting, letting off steam at having missed our target, until I said that. There was a moment silence, then he turned to look at me and grinned.\n\nSarge: \"Go ahead and get back to the lobby.\"\n\nI did, and we finished the remaining few hours without incident. So, come quittin' time I head up to the office, and Sarge is sitting there with what used to be several huge garbage bags of flyers. Now, they are just filled with cardboard confetti. Apparently, he had found a nice industrial paper shredder, and had found a way to pass the time while monitoring the security cameras. A lump came to my throat and my heart swelled with pride. We both got off the same time, so on the way out, we grabbed up the bags.\n\nNewSarge: \"What is all that shit?\"\n\nSarge: \"Just some pizza flyers from last night we are going to go dump.\"\n\nWe grinned mischievous grins at the replacing Sgt's wtf expression. He \nknew something was up, but we left without explanation. We walked out the side entrance and across the street to the shop. It was about 2 a.m., but this place was open until 4, being the hot spot of town. People from the bars would stagger in and get pizza by the slice, deliveries obviously still going out, ect. There weren't any customers inside when we walked in, still uniformed and all, which was probably for the best. One the guys behind the counter looked up, puzzled, as we walked in and began to imitate flowers girls. It wasn't a huge shop, but it had about ten small tables inside separated into two sections. Sarge took one side, I took the other, as we scattered the contents of the bags all over goddamn everything on our way up to the counter.\n\nThe guy on the register was out of his mind. He couldn't comprehend what was going on. He just kept repeating \"What the hell are you doing?\" Sarge just looked over and smiled, said \"Hi! Remember us?\". We had only brought two bags each, as they were really big bags and unwieldy, stuffed as they were. I had one bag empty by the time I hit the counter, and just dumped my second bag into the hallway of their restrooms. Sarge finished his first bag in his section of the dining area and we met up at the counter roughly the same time.\n\nBy this time, a few other employee drones from the back had come up front, wide eyed, to see what was going on.Then the owner came running up, yelling \"What the hell is going on here?\". I planted both palms on the counter as I leaned forward towards him, smiled, and said in a sarcastically friendly tone,\n\nMe: \"Stay the fuck out of our resort, and keep your fucking flyers to yourself.\"\n\nRight when I finished, Sarge upturned his second bag and covered the counter, registers, and the floor behind and in front of it.\n\nSarge: \"Have a nice night!\"\n\nWith that, we turned around and sauntered out to the sound of shocked silence. It looked like a cluster fuck-bomb had went off in there.\n\nWas it petty revenge? Sure, but this dude was a scumbag. The burglaries weren't an isolated incident, it was some sort of on going thing over there that he was in charge of. He just never got caught because he would always throw the drivers under the bus and they'd get arrested while his hands stayed clean.\n\nThat is where the tale ends, as nothing came of it. The next night, the owner sent over a couple large pizzas to us security folk for free as a peace offering. I didn't eat any of it, but Sarge did. He is a braver man than I am, I suppose.\n\nTL:DR: Is it New Years? Cuz that sure as hell is a lot of confetti.",
        "created_utc": 1389840406,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Fliers..",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1vbs19/pizza_fliers/",
        "text": "For a while, I was doing unarmed security as a part-time gig. One of my posts was a large resort on the beach. Large for here, anyway, at over 2,000 rooms. As part of the resort's robust security team of four, one of the headaches we had to deal with was solicitation from the local pizza shops.\n\nOne in particular was owned by a Greek guy, and his pizza place was right across the street from this resort. He was also the biggest offender, as he'd have his drivers try to sneak in a few times a week. They'd walk the floors and place the shop flyer in every door. This was a no-no because, other than leaving a goddamn mess all over the halls that we had to pick up (I worked nights, they couldn't get away with it during the day), it was a security risk for theft. Two of this Greek guy's drivers had just been arrested a few days ago from this tale for burglary. They would use the flyers to try to jimmy doors open, then play it off if they got caught. Didn't work that time I guess. To make matters worse, their pizza would be considered garbage if it were a little less greasy. Anyway..\n\nOne slow night, I am on duty patrolling around the lobby area when a call comes into my earpiece from the Sgt on duty. He went to patrol one of the wings and once he hit the top floor to work his way down, he immediately found that the floor had been hit. Pizza flyers everywhere. To make it worse, it was from the assholes across the street. Those douche-bags knew they were all banned from the property, all had trespasses against them, and yet they were usually 50% of the bullshit we had to deal with. We went into action.\n\nSince I was in the lobby, I jumped into the elevator and hit the first floor, while the other two guys on duty went to the stair wells to block the street exits. That was our usual tactic, block the two stair exits and have one come from above, one from below. It didn't always work, because at night, while you could only enter via the pool door or the front door, you could still leave out any number of other doors. They'd wait until a guest left out a side entrance then sneak in that way, we assumed.  Me and Sgt met on a middle floor, no pizza guy. Pissed, me and him hit all the floors again to gather up the flyers while the other two held down the fort. \n\nThey had hit a good 75% of the rooms before we had made whomever it was bail tonight, but what was so infuriating was they had hit us last night, and two nights previous to that, and we had those still in garbage bags in the office, so yeah.. we had a lot of flyers right about then. \n\nHotel management or overly entitled time share owners would always bitch about it. My response was always to question their intelligence on deciding four personnel was enough for that size of a resort. Then they'd get pissy about that, blah blah. The job was just pocket change for me, so whatever. I didn't, however, much appreciate being a janitor. \n\nIt was about 12 a.m. when we got down to the office, dragging our new payload in. \n\nSarge: \"Man, I am tired of getting bitched at because of those assholes.\" \n\nSarge dropped into one of the office chairs as he threw his huge trash bag into one corner. He then picked up one of the flyers and looked it over with a scowl on his face.\n\nSarge: \"How much do you think he spends on this crap?\"\n\nMe: \"Too much.\"\n\nThis dude must has spent his entire ad budget on the things, because they were roughly half-page, double-sided, color print, thick cardboard flyers. Fancy shit. And he passed them out like candy.\n\nSarge: \"God, I wish we could do something.\"\n\nMe: \"Yeah. I'd shred every single one of them, then take em right back across the street to him.\"\n\nSarge: \"Ooooh that'd be sweet, but eh, I don't want to get fired.\"\n\nMe: \"Luckily, I don't give a shit about being fired. You think hotel cares about this asshole? They want us to have anyone from there arrested or trespassed.\"\n\nWe were just bullshitting, letting off steam at having missed our target, until I said that. There was a moment silence, then he turned to look at me and grinned. \n\nSarge: \"Go ahead and get back to the lobby.\" \n\nI did, and we finished the remaining few hours without incident. So, come quittin' time I head up to the office, and Sarge is sitting there with what used to be several huge garbage bags of flyers. Now, they are just filled with cardboard confetti. Apparently, he had found a nice industrial paper shredder, and had found a way to pass the time while monitoring the security cameras. A lump came to my throat and my heart swelled with pride. We both got off the same time, so on the way out, we grabbed up the bags.\n\nNewSarge: \"What is all that shit?\"\n\nSarge: \"Just some pizza flyers from last night we are going to go dump.\"\n\nWe grinned mischievous grins at the replacing Sgt's wtf expression. He knew something was up, but we left without explanation. We walked out the side entrance and across the street to the shop. It was about 2 a.m., but this place was open until 4, being the hot spot of town. People from the bars would stagger in and get pizza by the slice, deliveries obviously still going out, ect. There weren't any customers inside when we walked in, still uniformed and all, which was probably for the best. One the guys behind the counter looked up, puzzled, as we walked in and began to imitate flowers girls. It wasn't a huge shop, but it had about ten small tables inside separated into two sections. Sarge took one side, I took the other, as we scattered the contents of the bags all over goddamn everything on our way up to the counter.\n\nThe guy on the register was out of his mind. He couldn't comprehend what was going on. He just kept repeating \"What the hell are you doing?\" Sarge just looked over and smiled, said \"Hi! Remember us?\". I We had only brought two bags each, as they were really big bags and unwieldy, stuffed as they were. I had one bag empty by the time I hit the counter, and just dumped my second bag into the hallway of their restrooms. Sarge finished his first bag in his section of the dining area and we met up at the counter roughly the same time.\n\nBy this time, a few other employee drones from the back had come up front, wide eyed, to see what was going on. Then the owner came running up, yelling \"What the hell is going on here?\".\n\nI planted both palms on the counter as I leaned forward towards him, smiled, and said in a sarcastically friendly tone, \"Stay the fuck out of our resort, and keep your fucking flyers to yourself.\" Right when I finished, Sarge upturned his second bag and covered the counter, registers, and the floor behind and in front of it. \n\nSarge: \"Have a nice night!\"\n\nWith that, we turned around and sauntered out to the sound of shocked silence. It looked like a cluster fuck-bomb had went off in there.\n\nWas it petty revenge? Sure, but this dude was a scumbag. The burglaries weren't an isolated incident, it was some sort of on going thing over there that he was in charge of. He just never got caught because he would always throw the drivers under the bus and they'd get arrested while his hands stayed clean.\n\nThat is where the tale ends, as nothing came of it. The next night, the owner sent over a couple large pizzas to us security folk for free as a peace offering. I didn't eat any of it, but Sarge did. He is a braver man than I am, I suppose.\n\nTL:DR: Is it New Years? Cuz that sure as hell is a lot of confetti.\n\nEdit: Damn flu-riddled brain can't spell.\n",
        "created_utc": 1389837399,
        "upvote_ratio": ""
    },
    {
        "title": "Rant about my now former employer",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1v3bsn/rant_about_my_now_former_employer/",
        "text": "If you wanted big intimidating weightlifters to work security at your club, then you shouldn't have paid minimum wage and meager tips.  The professionals all laughed at your pay and took jobs in the big downtown bars and clubs. If you don't want average-sized men who, more-often-than-not, don't phase drunk guests until there is a major tipping point or meltdown, learn from the fact that you had to lay off three guys for merely taking the job they were offered by you.  ",
        "created_utc": 1389595672,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Surveillance Operators",
        "author": "cpurvis",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1ujia0/looking_for_surveillance_operators/",
        "text": "Hi there, I'm looking to interview surveillance operators or guards who monitor surveillance in unique areas or sites as part of an interview series on a surveillance news and research website. The interview can be anonymous, and we won't disclose your site. For example past interviews have been with operators at a big box store, a nuclear facility and a large criminal justice complex. Some other places we are looking for are libraries, corrections facilities, warehouses, mom and pop stores, sports venues and anywhere you might have interesting stories from an operators perspective. ",
        "created_utc": 1389021308,
        "upvote_ratio": ""
    },
    {
        "title": "Piss benches, and best behavior when security's around. (Very quick post, sorry!)",
        "author": "terminator_rex",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1udnqm/piss_benches_and_best_behavior_when_securitys/",
        "text": "On shift number 3 and it's First Friday. So everyone's drunk.  \nI'm working command, two officers on the floor.  \nOn camera there's some dude party boy/rodeo pissing on a bench next to some porta potties while another couple argues.  \nArgument got physical (woman punches man in face). I dispatch larger tougher officer out to mitigate.  \nOfficer sits couple on piss bench to mediate. Couple sit on bench, hug and kiss in front of officer, who calls in 10-22 (disregard) and walks away.  \n  \nCouple almost immediately resumed fighting on the piss bench. I called in a EDO (off duty officer helping us out) to shuffle them away.  \n  \n*Tl;Dr don't tell the all-seeing to disregard*",
        "created_utc": 1388822029,
        "upvote_ratio": ""
    },
    {
        "title": "Abandoned highschool no problem, something about this hospital is getting to me.",
        "author": "larsonol",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1uag43/abandoned_highschool_no_problem_something_about/",
        "text": "So I got a 16 hr shift at an abandoned hospital and each patrol is fucking with me. Im hearing shit and most of the lights flicker. I love to be scared though. So fellow secura guards tell me about the creepiest places youve secured. Get me in the right mindset that my next patrol is terrible.\n\nUpdate: [pics of my adventures](http://imgur.com/ycYfrl1,tPLakxc,pDSEAoR,R6Ojv1L,gILb5ol,uPWfWG3,Zi1mPVX)",
        "created_utc": 1388725430,
        "upvote_ratio": ""
    },
    {
        "title": "Happy New Years Security Brothers and Sisters!",
        "author": "IndieHamster",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1u59hz/happy_new_years_security_brothers_and_sisters/",
        "text": "In a really good mood even though I'm working 2230-0630 tonight, because after 8 months straight of 3rd shift full time, I finally got a transfer to swing!\n\nSo HAPPY NEW YEARS SECURITY PEOPLES!",
        "created_utc": 1388558456,
        "upvote_ratio": ""
    },
    {
        "title": "Just a quick note.",
        "author": "JackTheCaptain",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1u2s4y/just_a_quick_note/",
        "text": "For everyone working tonight at bars, restaurants, static duty and patrol, or anything else in between, good luck people.  Stay safe.",
        "created_utc": 1388472020,
        "upvote_ratio": ""
    },
    {
        "title": "An interesting interaction on parking lot duty",
        "author": "Hobo_Massacre",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1tvy2p/an_interesting_interaction_on_parking_lot_duty/",
        "text": "Its been a while since my last post, and in that time I've started a new job as an armed guard with the US's 3rd largest security company. I work as a flex officer so I currently have worked a LOT of posts.\n   \n\n   this day I was detailed to a parking lot built on top of a shopping center; not a garage, literally a parking lot on the roof. its a very run down area in the downtown of my city, only about a block away from the fast food post I worked for my old company.\n  \n\n   I've been standing next to an elevator and stairway for at least an hour. I was stiller than a freaking state too. all of a sudden this guy approaches me from the right; he's probably around my age (early 20s) and obviously military. he quickly tells me \"hey man, I'm a marine so I've spent a lot of time pulling guard duty\" he\n hands me a bottle of coke and wishes me a happy new year. I told him thanks an he took off.\n     \n\nI felt like I should share this; this guy really lifted my spirits halfway through a really shitty shift. so what sort of unexpected nice people have you guys run accross ?",
        "created_utc": 1388253979,
        "upvote_ratio": ""
    },
    {
        "title": "Python Kills Security Guard (x-post from r/worldnews)",
        "author": "mkim92fs",
        "url": "http://abcnews.go.com/International/wireStory/python-kills-security-guard-bali-luxury-hotel-21345297",
        "text": "",
        "created_utc": 1388177142,
        "upvote_ratio": ""
    },
    {
        "title": "For those of you who are also working today, be assured you are not alone. Have a good shift, be safe, and Merry Christmas!",
        "author": "mkim92fs",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1tocr9/for_those_of_you_who_are_also_working_today_be/",
        "text": "",
        "created_utc": 1387985913,
        "upvote_ratio": ""
    },
    {
        "title": "I am doing security for a Walmart that has been closed since 8 for Christmas, and...",
        "author": "terminator_rex",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1tnc0n/i_am_doing_security_for_a_walmart_that_has_been/",
        "text": "* if the parking lot is empty.  \n* if the sign says closed.  \n* if the lights inside the store are (mostly) off.  \n* if the door doesn't automatically open.  \n* if there's no employees or customers inside or outside,     \n  \nYou should definitely try wedging your fingers in the door to pull it open *before* asking me if it's closed, why, and for how long.  \n  \n  \nThis has happened about six times already, and it's 9:30pm. I'm driving my own vehicle so I think I'm gonna hide now.  \n  \n*tl;dr I hope ~~you~~ they get frostbite*  \n  \nUPDATE: it is night number two (heh) and I think I recognize quite a few of the same vehicles from last night. Bless their hearts.",
        "created_utc": 1387938554,
        "upvote_ratio": ""
    },
    {
        "title": "[Rant] Why I'm quite leery of ever working contract, uniformed security ever again.",
        "author": "InquisitorNero",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1tb7mg/rant_why_im_quite_leery_of_ever_working_contract/",
        "text": "I spent all of last week in a class on dignitary protection I paid for with my own money. The class was sponsored by a certain nationwide contractor that uses white uniforms and lots of yellow in their logo, hence why I can afford a class on being a bodyguard.\n\nNow, yeah, dignitary protection, sounds all high-speed and shit, right? Yes and no. It's a foot in the door to a higher level of security work, but there's still a lot of work to do, especially for someone who's not a retired cop. 99% of this was classroom lecture, because it was either below freezing or snowing outside every day, we would've actually rehearsed with airsoft and vehicles if the weather wasn't shit.\n\nBut that's not really why I'm writing this. The building the class was held in is the state training facility for this contractor, and all the recruiters work there, so they wanted an hour of our time on Friday to try and get some new blood. This contractor is notorious for low-balling the pay for their uniformed goons, just like another contractor we all know that uses 3 red dots on their company patch. \n\nI knew this was gonna go nowhere, but seeing as I'm barely doing 15 hours a week at my current job, I play along and go do an interview. \n\nFirst bad vibe: the fucking asshole recruiter can't stay in his fucking seat for more than 5 seconds. I've never seen someone so distracted AND I HAVE ADHD. He's gotta go talk to the rotund sheneequa in the waiting area, he's gotta go photocopy all my shit RIGHT NOW, the head recruiter NEEDS my email. Holy Fuck, no wonder everyone hates these guys. An interview is supposed to be exactly that, A FUCKING INTERVIEW, not \"HOLY FUCK DISTRACT MYSELF WITH ALL THE THINGS!\".\n\nSecond Bad Vibe, and what made me swear never to work for a contractor again: We eventually have an interview that goes exactly like I imagined it would. They try to see if I buy their proprietary line of horseshit and I summarily disappoint them. We exchange lots of pleasantries and he figures out I'm done being a uniform guy, when he could've figured that out on Monday when the fucking class started. \n\nBefore I leave and go drink with the rest of the class at the nearby tavern, the head recruiter wants my time. Now let me set up what happens next by giving you a list of shit I have on my resume:\n\n-Military training (Infantry, US Army)\n\n-IFPO certified\n\n-MA License to Carry Firearms\n\n-Inactive Secret Security Clearance \n\n-And the fucking class I'm about to graduate tomorrow\n\nIn a just and loving world, in the Northeast US at least, I should be getting paid 16-18 an hour for my qualifications. I'm well aware no one pays that unless I'm prepared to eat a LOT of ass (I'm not). So if anyone asks, I refuse to work for less than 15.\n\nShe (the head recruiter) asks me this, and I respond, politely, 15 an hour. The look on her face made it seem as if I had just bayonetted her family in front of her and set fire to her village in 1968. I've never seen such a look of horror on someone's face like that over so little. \n\nShe, sheepishly, tells me to apply for a job when I get home, but warns me that \"I'm afraid we won't have anything for you.\"\n\nI don't get it, I really don't. I'm not some shithead off the street who just got fired from McDonald's, a lot of important people in the industry have said I know what the fuck I'm doing. You're really going to attempt to get me to put that horseshit uniform on for barely over minimum wage? How much lead paint did you eat today, lady?\n\nI leave, angry and ready to accept alcohol. I meet two of my classmates in the tavern, one's a retired state cop, the other a private investigator. They both got the same line of bullshit, only over supervisor positions. Everyone was wearing their best \"fuck that\" face as we drank.  \n\nTurns out, I pulled up Indeed.com the next day and this company had a job opening starting at 15.25. So not only was this lady incompetent, but also a liar.\n\nI think the best thing to take away from my misery is to never trust a suit.",
        "created_utc": 1387523672,
        "upvote_ratio": ""
    },
    {
        "title": "Karma!",
        "author": "esskay1711",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1t8et3/karma/",
        "text": "I do access control: Checking ID, Creating Passes for people who forgot their work ID and concierge work. \n\n\nEarlier this week there was an important seminar or presentation where I work, so all the employees and their husbands and wives were arriving in fancy dresses and suits to attend.\n\nWell happened was theyd arrive and be checked off the list of approved visitors, so theyd come to my desk with ID and id see if theyre on the list and check them off then give them a visitors pass.\n\nThen a snobby bloke and his wife came up to me. The Guy worked at the building, but his wife was the guest. So i asked for his ID he provided it and I checked his name off the list and gave him a pass. Then when I ased his wife for photo ID, she says \n\n\"Oh I didnt bring it, i thought it would be more convenient to leave my handbag at home\"\n\nI then asked if she had a business card or anything with her name on it, but she said no she doesnt because she left her purse at home. \nSo I said I was sorry,  but if she cant show me ID that she cant come in. (She was actually ok with it and said yeah thats fair enough)\n\nBut then her husband started arking up and saying \n\n\"She Cant come in? What do you mean she cant come in, Thats unacceptable, she has to go to this meeting!!!\"\n\nSo I told him the same thing I told his wife, If she hasnt got ID she cant get in. After having to repeat that to him a few times, he accepted the fact that his wife couldnt attend the presentation. \n\nSo he gave me a bitter stare and then walked over to his wife, kissed her on the cheek and she went home and got her licence. \nWhen she arrived back at my desk, I checked her ID and crossed her name off the list. At the last minute she says:\n\n\"Oh I parked my car in the reserved for diplomats car park, can I leave you the keys so you can move the car incase a VIP has to park there?\"\n\nI replied that I couldnt actually stop her from parking there, but Id advise against it because parking inspectors regularly patrol the carparks. \n\nShe said shed take her chances and then walked off to the meeting. \n\nLiterally two minutes after she walked off A parking inspector started doing his rounds and low and behold , the lady got a ticket. \n\nI also found out that the Husband tried to complain that I wouldnt let his wife in, that i was really rude because I refused her entry to the premises. (Although I was doing my job and my boss congratulated me and said that the people he complained to thought it was idiotic)\n\nAnd Finally, the Husband had to pay the fine, because the car was registered in his name!\n\n",
        "created_utc": 1387438001,
        "upvote_ratio": ""
    },
    {
        "title": "Helping a cadet out (or, \"social anxiety meets sheriff's deputies\")",
        "author": "terminator_rex",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1t7lcr/helping_a_cadet_out_or_social_anxiety_meets/",
        "text": "As a rover, I always get posted in some pretty interesting places with no notice and no training.  Today, I find myself at the local community college's police academy for a 0630-2330 shift (getting paid with the tuition I pay, yay!). But, today isn't any other 17 hour shift behind a desk, no today is *graduation day,* which means that the entire building right now is full of cadets, their families, deputies, police officers, police sergeants, and all kinds of school officials.  \n  \nThe policy of cadets is to \"make way\" for anyone of higher rank than them, until dismissed--faculty, teachers, sworn officers, security personnel, custodial staff. I still can't get used to having an entire stairwell of folks who are much more accomplished than a lowly CO wannabe like myself stand attention as I shuffle past--it's kind of creepy in a way.  \n  \n**Lunch Rush**  \nMost of the upper echelons of the Sheriff's Corrections department have arrived, and are either milling about or have lined up down the hall to inspect the graduates as they pass.  \n  \nSuddenly, a cadet appears at my desk, in plain clothes (his class graduates later on).  \n  \n\"Have the people for the graduation ceremony arrived yet?\"  \n\"Yes, why do you ask?\"  \n\"Because I forgot my lunchbox in the student lounge.\"  \n  \nWell, fuck.  \n  \nI asked him why it's a big deal, and he explained to me what I've been wondering the whole time I've been here: cadets are to make way for anyone, and cannot move until dismissed--even if in plain clothes. God, I wish tenants did that for me at another site I frequent.  \n  \n**cue Mission Impossible theme**  \nFor fear of being sighted by one of his commanding officers, he cautiously checks the hallways:\n    \"Hallway closest to Student Lounge?\"  \n        \"Nope.\"  \n    \"Back hallway?\"  \n        Inspection gauntlet.  \"HELL NOPE.\"  \n  \nFinally, I offer to get it for him. After a couple of years of telling attorneys and their high-profile lawyers what they can and can't do in their own office, I figured walking through a crowd of uniformed officers can't be too bad. I mean, it's not interfering with police business (which I graciously avoid), and I'm not being outwardly disrespectful for pushing through their formations with a chorus of \"excuse me's,\" \"how are you's?,\" and \"sorry's. After all, *I am on official security business.*  \n  \n**The Heist**  \nI peek around the hallway and see about 15 decorated officers from the local sheriff's department between my position and the hallway for the student lounge.  \n*deep breath*  \n*trademark sigh*  \n*back popping a few times into posture*  \ncommit.  \n  \nA Sargent emerges from the room just in front of me, and walks with my direction just a few paces in front.  \n*great*  \nBefore I know it, my path is blocked by greetings and handshakes from the Sargent in front--all reminiscent of a professional camaraderie I hope to someday enj--*a path has cleared!*  \nI ~~made~~ pushed my way through, silently cursing the fact that this group of sworn law enforcement officers are *not* required to yield to a highly experienced, poorly trained security officer like myself.  Also, I've been working since 6am and I had another five hours to go.  \nI manage to push through, brushing past nearly everyone in the formation, praying to god nobody acknowledges my existence.  Nobody did, and I managed to get the frozen polyester pail of a forgotten lunch.  \n  \n**Hungry, buddy?**  \nI emerge into the hallway to see that the crowd of green and white have grown to twenty, with three more smiling faces coming up the hallway I came from.  \n*sigh*  \ncommit.  \n  \nI heaved the lunchbox over my shoulder, and grimaced when the cold, heavy condensing fabric mass balanced atop my duty belt and rested upon my back.  \n\"Excuse me\"  \n\"Good evening, sir\"  \n\"Sorry\"  \n*is this thing leaking?*  \nI managed to somewhat literally push past the noisy crowd of my county's finest, but decided to duck into a doorway to yield to the three approaching deputies--as courtesy, because I don't want to look like an ass.  \nBefore I knew it, the crowd somehow managed to shift in front of the very doorway I am dumbly standing in with a lunchbox larger than my head.  \nFinally annoyed, I pushed through the crowd once more, maintaining the self-important posture I keep when I know I'm being an ass.  \n  \nIgnoring the perceived eyes upon my back caused by a tactic I learned while dealing with large \"dumb\"* crowds, I managed to return the large lunch box to a grateful cadet.  \n  \n*tl;dr \"Thanks man, I owe you one.\"* \n  \n  \n* \"Dumb\" crowds are jargon for any group that generally does nothing to get out of your way, in spite of how much in a hurry you are/appear to be.  \n  \n*I know I've made a few proofreading mistakes, but critique of my writing style is definitely appreciated, along with your comments.  I am a terrible writer and, dammit, I want to get better.*\n \n",
        "created_utc": 1387414021,
        "upvote_ratio": ""
    },
    {
        "title": "\"It's cool dude, I'm friends with the barback. I don't need to show you my ID!\"",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1t1jn4/its_cool_dude_im_friends_with_the_barback_i_dont/",
        "text": "Yes, yes you do. &amp;#3232;_&amp;#3232;",
        "created_utc": 1387234405,
        "upvote_ratio": ""
    },
    {
        "title": "[Rant] If you're going to ask security to take your picture...",
        "author": "terminator_rex",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1sudly/rant_if_youre_going_to_ask_security_to_take_your/",
        "text": "...don't get mad if it's not good enough. I'm a rent-a-cop, not your date night photographer.",
        "created_utc": 1386990717,
        "upvote_ratio": ""
    },
    {
        "title": "Just found this song again and thought you guys might like it. I listened to it 10 times before my shift",
        "author": "MuscleBrick",
        "url": "http://www.youtube.com/watch?v=Lo-EmtXbFRg",
        "text": "",
        "created_utc": 1386708653,
        "upvote_ratio": ""
    },
    {
        "title": "\"...With the skin-tone of the Annoying Orange and a pantsuit straight out of a talkshow wardrobe.....\"",
        "author": "InquisitorNero",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1sfaf5/with_the_skintone_of_the_annoying_orange_and_a/",
        "text": "So I tried typing this up a while back and because I got distracted, I failed. \n\nThe gig in Boston's Theatre District has been going well. It could certainly pay a bit more, but I'm employed and right now that's all that matters. I've met quite a few strange characters and been witness to some of the dark-side of show business. As such, recently my boss has me doing more of the rodeo-clown work that comes with that dark side. I get the enviable task of making sure the crazy doesn't get in contact with the talent, and since that's what I see myself doing in the future, I fucking love it.\n\nFew weeks ago, we had a rather popular R&amp;B singer play a Sunday show. These type of gigs are a step above babysitting. No one's drinking too much, because everyone's gotta be up early for their thankless cubicle job on Monday, and everyone's too old to risk a record over not getting their way at the bar. The show was pretty, and I'm sure if I was a middle-aged woman I'd enjoy it too. In fact, because this detail comes into play later on, I should mention this is the type of artist with a fan base quite heavily involved in all that new-agey, pseudo-christian, semi-psychic, self-help esoterica. \n\nNothing happens until the end, I get a call on the radio from my boss to come down to the backstage door and replace another guard who is assigned to the load-out (we all moonlight as stagehands here). I'm stuck down there for about an hour, just making sure no-one rushes the stage. It's around this time that I notice a very enthusiastic individual sitting down in front at a cocktail table. Spiky blonde hair, black suit, no tie, keeps standing up during songs. At &gt;25 meters without optics I can't tell much more. I do know from her placement that she was part of the group that had personally met the artist before the show, so when she handed an item up to the artist near the end it wasn't cause for alarm either from us or the talent's personal security. I didn't think much else of it, I need not unless she tried to climb, and even then it was someone else's problem since the door was my assignment.\n\nShow ends, and again, beyond the usual \"he said, she said, I'm with this person, don't you know who I am?\" drama that always happens, nothing special. Until I get the chance to look at the stage again...\n\n...That person is still there, and with the houselights on, I notice that this is a female. Her skin is bright orange, and the pantsuit is gaudy and pinstriped. She's very drunk (as most problem people will be), and has somehow convinced an associate of mine on the stage that she can come backstage. \n\nSaid person is also one of the guys during the punk show on Halloween who beat the shit out of kids who started moshpits, so I'm quite justified in second-guessing him. \n\nSure enough, My boss leans into my ear as he walks by to supervise the cleanup to say \"Hell no\". \n\nSo she walks up, gets uncomfortably close, and, to her credit, doesn't go immediately into the \"do you know who I am?\" horseshit that makes most bouncers hate humanity. \n\nInstead she was unique and tells me she had to see her because she's a famous author and needs to talk to the artist because she emailed her and she comes bearing gifts and she's a cancer survivor blah blah blah. \n\nI do the textbook thing, refer to my boss, and my boss of course says no.\n\nSo now she's trying the flattery thing, commenting on our toughness and how great we are, still not budging. She never attempts physical contact or to rush past me, thankfully, because I was not in the mood for that shit, and I've never felt comfortable restraining women. After about 30 minutes of this shit, one of the talent's personal security come outside, and they talk for a bit. This guy is brilliant in how he bullshits her, I am in awe of how he explains why she can't see the artist. But she doesn't go.\n\nWhat finally put the proverbial nail in the coffin was the artist's personal spiritual advisor/shaman/whatever coming out with that same bodyguard with a signed poster and just used every single trick she knew as a sort of spiritual \"consolation prize\" to not being able to see this artist. She gave up this jewelry and shark teeth to the advisor to give to the talent, demanding that it must be delivered. \n\nAnd, finally, she walked off after shaking my hand.\n\nAfter having a female staff member flush her out of the latrine and out the side exit, it was over, and I couldn't stop giggling over how stupid it all was.\n\nI googled her name later on, since it was writ large in sharpie on a blank paper she kept waving around. Turns out she wasn't lying, but allegedly she's also a Scientologist. Explained a ton of shit.\n\nTl;dr, Crazy and alcohol don't mix",
        "created_utc": 1386550138,
        "upvote_ratio": ""
    },
    {
        "title": "GHOSTS",
        "author": "yugosaki",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1s8gpc/ghosts/",
        "text": "Couple of weird and light hearted stories for a change. Same with my other stories, these was at my high-end apartment site where I worked night shift.\n\nLate into the night, I can't remember the time exactly but it was probably between 0200 and 0400, three young (early 20's) male residents come down. One looks like he was just dragged out of bed and doesn't know what's going on, one looks a little shaken, and the last is practically in tears. The one in tears looked fairly sheltered and sensitive, he was quite effeminate (that's not an insult, I used to be pretty effeminate myself. Just trying to paint a picture of him)\n\nAfter getting them calmed down and getting the two distraught ones to stop talking over each other, they manage to tell me that they think their apartment is haunted, and that they keep hearing threatening but hard to discern whispered messages when they try to sleep. They described it like how when you're keeping your voice at a whisper but you try to sound like you're yelling. At first I think I have to be mistaken in what I heard, but they explain it again. No joke, they think their place is haunted. Third friend apparently lived down the hall, searched the place, found nothing. But as soon as he went to leave the other two heard it again so they came down.\n\nObviously my first thought is either someone is fucking with them, or they are mistaken. But I decide to oblige them and go check it out anyway. They had just moved into the apartment, switching from another one in the same building. I poke through their apartment, with them right there with me and getting permission to look in drawers, under beds, etc. Im hoping to find a radio or something that could have been used to prank them.\n\nI'm just about ready to give up and chalk it up to sound being bounced off adjacent buildings or around ventilation shafts, etc. However, suddenly we all heard it. Unintelligable, aggressive whispering.\n\nI search fast, shoving their boxes around and flipping things out of the way, until I find lodged just behind the door in their closet, a cell phone. None of them had seen it before, but as they just moved in I surmised it must have been left by a previous resident. It was one of those 'music phones'  that were popular just before smart phones, with a giant speaker on the flip top. Had some damage to it, which was probably why it sounded so odd, and there was an alarm set on the phone for around that time. The residents were very relieved and we had a bit of a chuckle about it.\n\nThe second ethereal encounter I had while working there. A new resident, kinda spacey looking and in his 40's, came down late one night and asked if a little girl had ever died in his suite. I told him I had only worked there for 4 years, so I didn't know for sure, but as far as I knew no one had ever died in that unit, and for the entirety of my employment there it had been an adults only building, so it was fairly unlikely that a child died here. He said t hat he had seen the ghost of a little girl wandering his apartment and the halls. Now, a lot of the residents in the building have friends or family with children, so even though it is an adult building we often have children visitors in the daytime, so I suggested that might have something to do with it. But he insisted that it had been a ghost, and that he was going to move. Not knowing what exactly to do about that, I just said \"Ok\" and bid him a good night. For the record, I have not had any ghostly complaints from any resident aside from these two stories.",
        "created_utc": 1386325835,
        "upvote_ratio": ""
    },
    {
        "title": "Found this goodie from an old Facebook I had",
        "author": "terminator_rex",
        "url": "http://i.imgur.com/Zruc5vr.jpg",
        "text": "",
        "created_utc": 1386298728,
        "upvote_ratio": ""
    },
    {
        "title": "The power of the baton",
        "author": "rainman0341",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1s2mj8/the_power_of_the_baton/",
        "text": "I guess you could say this is mildly interesting. Like most of you know, grave shifts can be boring so any call you get, it can make the shift go by quicker and I learned something tonight; people(some people) will calm down fast when a baton is in play. \nI am at an apartment complex next to a college campus with shit for parking. Our main call is someone parked in someone else's spot. Got a call as soon as I clocked in about a non resident car in a residents spot. I put our standard one hour notice sticker on the window, knocked on a few doors to see if I could find the owner to no avail. The hour passes and the car is still there. Called the cpl on duty and get the ok to tow it. Tow company shows up hooks it up and starts to pull away. Now the fun part. \nKid comes hauling down the street, screaming \"That's my fucking car!\" The driver gets out and the kid starts screaming and the guy. Then he notices me standing there and comes at me saying he's going to kick my ass. He was maybe 5'10\", 150 pounds soaking wet. I'm not big but bigger than this guy, 6' 180. On instinct I drew my Asp with a loud \"shiiiinnnnk\" and the kid stops dead in his tracks and his eyes become 2x the normal size. He back peddles and starts apologizing. The driver of the truck agreed to drop it for $180 and the kid again apologizes to both of us and takes off. \nI've only been working security for 6 months and this was the first time I went for a tool. I was cleared after my Cpl got on deck and had me write and IR. ",
        "created_utc": 1386157774,
        "upvote_ratio": ""
    },
    {
        "title": "Scariest night of my life",
        "author": "yugosaki",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1s2l7a/scariest_night_of_my_life/",
        "text": "I posted this awhile ago in a domestic abuse thread on another subreddit, but I figured you guys would be interested.\n\n I was working in an apartment building. pretty nice one, generally quiet residents. If you've read my other stories, same site (that site had a lot of shit go down) Part of the job is to investigate domestic disturbances. Generally it's just some shouting, and a knock on the door is enough to put an end to it, or often it's just a loud tv or something.\n\nI get a call at around 1 AM about a loud screaming domestic. I go upstairs to check it out, find a young woman trying to get one of her neighbours to open their door. her arm is bloody and cut up. It doesn't look bad, but i couldn't tell the severity due to her covering it and her sleeve. She's hysterical obviously. I don't remember a lot of the details of what happened, but I found out that she broke up with her boyfriend, and he attacked her.\n\nWe get one of the neighbours to open up and go inside for safety. I get her calmed down a bit and she explains that when she broke up with him, he tried to convince her to kill herself with him. And when she refused he pulled a knife. She got past him but he got her good with the knife. Several short, shallow, quick cuts. I manage to get her sleeve off and find two big, deep gashes.\n\nShe's still in panic mode though, and doesn't stay in the apartment. She's convinced herself that if she can just talk to him, it'll be ok. The neighbour calls police, while I'm scrambling to try to keep her from going back in there, and get her patched up. The boyfriend is still in the apartment.\n\nIn the chaos of me running around for first aid stuff, her not staying put, and me chasing after her, we end up in the hallway. The boyfriend comes out. he's between us and the nearest exit. He has the knife.\n\nI want to back up here and portray something. I've been at some fairly risky sites. I've been in many confrontations, and I've even been stabbed before. I had never really felt fear while on the job. Apprehension, yes. But not fear. I'm usually too caught up in just dealing with the shit going down in front of me to really process a fear response.\n\nThat moment I was terrified. Terrified in a way I had never been before or since. I don't know how, but I could tell. If I had not been standing there, he WOULD have killed her. And I could see him standing there, sizing me up, talking to her. He was trying to decide if he could get through me, and he had NO regard for his own life. I knew that if he decided to act that this would be a true life or death fight. I'm sure she realized it too and I think this is the first time it sank in for her that he absolutely was going to kill her. With how terrified I was, I can't even begin to comprehend what she must have felt. \n\nThe scariest thing is I think he did decide to try. I'm not a very big guy. I couldn't understand all the words he was saying (they were chinese and switched languages back and forth a lot in those moments) but the tone... the only way i can describe it was final. Whatever he was thinking of doing, he decided to do it.\n\nIn a minor miracle, the police popped out of the elevator before he tried it. he retreated into the apartment, and I got the woman back to the neighbours apartment. The first cops guarded the door to ensure he couldn't leave until their backup arrived. He put up a fight, but thankfully no one was injured. The woman was patched up by me and taken to hospital by paramedics.\n",
        "created_utc": 1386155995,
        "upvote_ratio": ""
    },
    {
        "title": "Never, ever, fight an off duty bouncer.",
        "author": "JackTheCaptain",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1rqvgj/never_ever_fight_an_off_duty_bouncer/",
        "text": "Posted a couple other stories but if you haven't seen them, I work as a doorman at a bar in my city, been doing it for about 4 years and the levels of stupidity never cease to amaze me.\n\nSo we had a good night last night, busy as hell for a friday even though there was a massive music event in a city a couple hours away that A LOT of our regulars made the trip to.  As it was we weren't expecting a big night, so the only other senior doorman at the bar got the night off and got on the piss with a couple other staff.\n\nEverything is sweet as until we get to ten minutes from close, and I get one of the bar staff running to me.\n\n\"JackTheCaptain, someone's trying to fight Bear.\"\n\nOh shit.  Not the best idea when my mate has been drinking.  He doesn't have anger issues per se, but neither of us will tolerate people putting their hands on us due to past events.  So immediately I sprinted up to the area that shit was going down, and grabbed the guy who was borderline throwing a punch, removed him and told him that the worst thing he could possibly do was try fight an off duty bouncer.\n\nNow before anyone says \"Oh he wouldn't have known\", yes, he would, this guy and his mate were regulars.  No sooner have I removed the guy, than the bar staff are back yelling that now punches are flying.  Sprint back to the deck again and its just chaos, three guys trying to fight the doorman while he holds one back and our mate holds another.\n\nThe third guy just happened to turn as I made it up the steps, and literally got the clothesline from hell, I mean I didn't even stop I just went straight through him.  Ended up with him in a deadmans choke hold, one of his mates thrown over the wall into the alleyway next to the bar and the other one calmed down by bystanders (don't think he was in it anyway he was trying to pull the other two off.)\n\nAfter all that we decided to let them go, at 3am the last thing we want to do is wait for the cops, then give statements, and then delay our cleanup and staff drinks.  They did all get two year trespass notices form the entire hospitality group though, and we have photos for future doorteams.\n\nTL/DR  Fighting off duty staff will never end well for you.",
        "created_utc": 1385774790,
        "upvote_ratio": ""
    },
    {
        "title": "What do you do at the slow shifts?",
        "author": "dolphinelrapo",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1rpo2f/what_do_you_do_at_the_slow_shifts/",
        "text": "So I want to hear, what do you guys who work solo-shifts do when things slow down?\n\nThe site I'm at right now has me manning a control point at a store and gives no other duties than to check vehicles and watch CCTV, I have to be in the booth at 90% of my time. \n\nOfcourse this gets boring, I usually watch Netflix, listen to music or browse facebook/reddit/tumblr.\n\nNow what do you do when it's slow and boring, give us ideas!",
        "created_utc": 1385738415,
        "upvote_ratio": ""
    },
    {
        "title": "First shift",
        "author": "turrican2",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1roknm/first_shift/",
        "text": "Hello,\ntonight is my first time doing security work. I'll be doing foot patrols around some apartments. I will be dispersing vagrant types and patrons from the nearby pub if they decide to loiter. I was wondering if anyone had any tips, essential things to do, things to NOT do, etc? \n\nSome things I've already gathered : \n- Safety is first, run away if there's an imminent threat of physical violence.\n- When asking people to move on, bluff them if they get resistant (mention calling the police, or hidden cameras.) Do you know any other helpful phrases I can use?\n- Keep a notepad, keep notes on every incident throughout the whole shift\n\nI have a good LED Lenser flashlight. I have the scanned the map of my patrol area and copied it to my phone.\n\nThanks",
        "created_utc": 1385690162,
        "upvote_ratio": ""
    },
    {
        "title": "Bloody kids.",
        "author": "Greedeater",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1rkcvr/bloody_kids/",
        "text": "So today I made the way in to the Gaming Room contract. Stopped off at the Tobacconists to pick up my new eGo, loaded it up with Coffee flavour, and vaped as I walked. Lots of tourists around this time of year, lots of idiots too; warm weather and Christmas Breakup parties = drunken idiots, therefore more work for me and mine tonight I reckoned. \n\nI enter in the back way to the venue, say hello to the staff and unload my kit. Noticing a guy I had kicked out last night was in the venue, I mentioned to the VM about it. He was cool, as long as the patron behaved and was on a one strike removal. \n\nSuddenly one of the staff barrels past me and tells me to watch machine number 37, and the woman playing it, and disappeared into the office. I hadn't signed on yet, but I went over to have a look. There was this young woman there, shapely figure, skimpy clothing (it's about 30 degrees centigrade outside, feels like it anyway) with indie tattoos covering her upper arms and ample cleavage. Then she opened her mouth; Yep, looks a million bucks, sounds Tree Fiddy. \n\nOne of the other patrons came over and told me she had stolen money off his machine, situated next to her. It clicks; the staff member has gone to check the office to confirm this on the camera. \n\nThis woman's companion, a very camp and also very young weed of a guy had noticed that I was watching them and was begging her to stop playing the pokie machine and come with him outside. That pretty much confirmed it with me; one of them nicked this guys cash. \n\nI made my way over there and made my intentions clear. I asked them flat out if they had taken the money, he said no meekly, she said no quite belligerently. Great, she's munted too. For non-Aussies, Munted is a slang word used for excessive substance influence, whether it be alcohol or other. I also noticed two other things about her;\n\n* there is no way her tattoos were real\n\n* she was lucky to be a day over 16 years old.\n\nI informed them to remain where they are while the camera is checked, and asked her for her ID in the meantime. All I got was a 'fuck you'. Politely informing her that she will be leaving then regardless of what the camera shows, I turn slightly to see if the patron stolen from is going to be a problem, which he wasn't. I could see from the corner of my eye the guy grab the girl by the arm and try to sneak her around the other side of the machines away from me towards the front door. \n\nI quickly zipped around to cut them off, and told them to remain where they are or I will make them stay put. The guy is looking like a trapped rat, but the chick is pure balls; chin out, calling me a pussy for not dragging her out. I told her, with a smile this time, that I will happily drag her out once the camera is cleared if that's what she wants. \n\n30 seconds later, the manager calls out to me. \n\n*'Greedeater, the Chick!'*\n\nI look her dead in the eye and say;\n\n'That will be 33 dollars from you, miss. *Then* you can leave. Or would you prefer I call the police down?'\n\nThe bloke pipes up and frantically repeats 'no police' a couple if times, while **HE** digs through his bag and gives me a fifty. I turn to pass it to the staff member, and turn back into the chicks first punch. Didn't even blink. \n\n'So I take it you *do* want the police here then?'\n\nThe guy rabbits, the chick charges. Christ she must have been so far gone it wasn't funny, considering my thigh was the size of her waist. I just grabbed her by the upper arm and started walking while she was trying to hit and kick me. Didn't have much nails on her though, because my forearm would be ripped to shreds if she did.\n\nWe get to the front door, and I just hold her at arms length until the staff member gives me a handful of coins as the change. I throw the coins on the street, tell her that's her change and to piss off, I shove her away, lock the door and return inside. Still don't know where the guy went.\n\nThe patron that she had nicked the money from was gone. Left the second he got his money back. I lost my shit momentarily with the VM as to how an obviously drug and alcohol affected girl under the legal age could be inside the venue without anyone noticing, but apologised pretty much immediately afterwards. Blood was up really, and it's been a real busy day here. Grabbed some deodorant from my briefcase to get rid of the Black marker smeared all over the palm of my hand from her 'Tattoos'. \n\nAnd just before I posted this, the manager informs me of an iPhone handed in. Guess whom has a selfie on the lock screen?\n\nNow, what do I do with this now....",
        "created_utc": 1385549850,
        "upvote_ratio": ""
    },
    {
        "title": "Evicted before they even unpacked",
        "author": "yugosaki",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1rkb25/evicted_before_they_even_unpacked/",
        "text": "I'm at a fairly boring site now, so here's a story from my previous post. A high-end apartment complex right downtown. Normally the residents are quiet. Retired couples, businesspeople, rich students. Only had a handful of problems from the residents themselves.\n\nI worked graveyard shift. 2000-0600. Couple hours before my shift started a new, young, professional couple began moving in to the 14th floor. They just finished unloading their stuff into their apartment when I arrived. \n\nNot even a full 2 hours later, I get a call from one of their neighbours concerned about a domestic situation. Normally when we get these kind of calls, we go up and check it ourselves first before informing police. Very often it's a loud tv, or something fairly minor. I go up there, and sure enough, I can hear them arguing. Then I hear a loud smash. Almost immediately I got a call from a fast food joint retailing space on the ground floor that a chair just came down and hit the sidewalk. \n\nI knock on the door of the apartment, and they open up., all smiles and hellos, acting as if absolutely nothing is wrong. I don't even have to step inside and I can see that the place is just torn apart, clothes and household items thrown everywhere, and a big gaping hole where the window used to be. I question them about it, and they insist that nothing is wrong, they were just unpacking and they \"slipped\". So I leave, check the sidewalk outside and sure enough there's a kitchen chair and broken glass. Thankfully the sidewalk was empty at the time, it's usually quite busy.\n\nAlmost immediately I get another call about them arguing. So I go straight to the manager. He writes up a 24 hour eviction notice and we call police. Surprisingly they pack up and leave without incident, besides continuing to argue all night. Apartment (which had JUST been repainted) had to be renovated. Cupboard door broken, closet door taken off it's hinge, stains in carpet from thrown food, holes in the walls from stuff hitting them, and of course the window.\n\nAnd I don't think it was a case of one throwing an abusive tantrum either, it really seemed like they were both going completely nutso at it.",
        "created_utc": 1385546920,
        "upvote_ratio": ""
    },
    {
        "title": "Tale of Rent-A-Cop: the bloody shoed MMA fighter",
        "author": "BlackisKindaBlue",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1rk9iq/tale_of_rentacop_the_bloody_shoed_mma_fighter/",
        "text": "If you read my previous Rent-A-Cop revenge story, this incident occurred at the same property. \n\nFor those not familiar: This was a snobby high class apartment community in the Southern California Orange Curtain filled with residents and managers who think every problem is balanced by money and anyone else (contractor, service employee, or other) was below them and expendable. As the Security contractor we were expendable, and they made it clear because we were hired to replace the previous contractor that we found out were set up to fail by the same managers that hired us. We weren't hired to provide security so much as for the company to have someone to blame as their liability shield if something went wrong.\n\nPrior to accepting the part time job as a security I became a 2nd degree black belt in tae-kwon doe and was currently practicing Muy-Thai and jiu-jitsu at a local mma gym. One of the members of this gym (who will be referred to as IMC or #2223) was a rising and already sponsored fighter aiming to get noticed in the feather weight division at 114 lbs. IMC coincidentally happened to be a resident of apartment #2223 at the complex I worked and recently began to catch the attention of security and the management for recent antics. A week earlier, some of the security guards caught both residents of #2223 (IMC and his roomate) with 2 girls all naked at one of the pools at 2AM. There were rumors, both at the gym and the complex, that IMC had began to abuse drugs and was contributing to his violent temperament.\n\nSome reason when shit happens on a graveyard shift, it always happened during the last hour of shift causing us to stay overtime (which we fucking hated because the management would refuse to pay us overtime or even regular time for the extra hours. the cheap bastards also refused to pay for more than 2 guards to work past 2AM). So at 4AM while me and my partner were underground in the parking lot finishing up our reports we start to hear sirens and rush to the surface to find out whats going on and our company cellphone to get reception. 5 minutes prior, both residents of #2223 (IMC and roomate) just arrived at the complex via taxi-cab and refused to pay their taxi driver the fair. In response the taxi driver says he'll call the cops, and thats when residents #2223 take fit to pull the driver out of the cab and perform acts of violence upon the innocent taxi driver. \n\nNSFL Though I did not witness this, what I know from reports and evidence that I have personally seen, the cab driver had a broken nose, broken jaw, facial hemorrhaging, broken collar bone, and 2 broken ribs. The sneakers photographed and collected as evidence had blood soaked into the toe and heel.\n\nLuckily there was a witness, a teenager that saw the whole thing, called the cops and saw into which apartment area the 2 men had ran into. This city police has an average response time of 4 minutes for emergencies occurring between 2AM-5AM and by the time me and my partner made it to the scene the first 2 squad cars had already arrived on scene. Before we can get to the first 2 squad cars that are currently parked near the taxi and I presume the taxi driver was a 3rd squad car arrives and makes contact with us. Upon realizing the magnitude of the situation I figured we were going to need the rent roll (our paper copy of the list of resident names and apartment numbers) and I leave my partner with the police officer while I make a mad dash across one of the buildings to our office where we keep the rent roll.\n\n1 minute later I grabbed the rent roll, My partner got a name through the police which I looked up while running back and recognize the soon to be infamous name of, IMC in apartment #2223 and radio in \"its IMC in apartment #2223, the MMA fighter\". My partner upon hearing this and now knowing which room to go to, leads some of the officers to the apartment. a minute after that I'm at the site of the taxi cab and there are 6 squad cars on property, red and blue flashers all on and some officers are pulling out the heavy artillery from their cars. An officer grabs me and asks if I can escort them to IMC's apartment, I say yes, he promptly reaches into his trunk to pull out the battering ram while his partner is already has an AR-15 up and ready. We make the mad rush up a flight of stairs down the halls to the door of #2223 where 2 other officers already waiting and saw the door was already kicked by the residents of #2223 who were panicking as they were cornered. While the cops were handling the situation at the front door, me and my partner ran around to the back to where the balcony of #2223 was close enough to a hallway bridge that the residents could possibly jump to in the event of a last ditch escape. Just as we got there we found thats exactly what #2223 tried to do.\n\nAs a security guard, were not allowed to deliver physical blows unless someone physically assaults us first. This is why we have to result to grappling first. I weighed 220 at the time and from my experience grappling with people half my weight, I knew I was at a disadvantage against IMC (my opponent only has half the surface area as I do) even If I was twice his size. This was also the first and only time I resorted to using my blast knuckles, a device which I was not supposed to have on me at the time but I did not hesitate when the time came. Even with my 1.95 Million volt advantage I barely was able to make contact but I managed to pin him into the corner between the floor and the wall long enough for the police to rush around detain IMC and his roommate who my partner managed to pin to the floor.\n\nThe rest of the night was a series of phone calls to the management and maintenance about the incident, property damages, and how #2223 just became part of a crime scene. While hovering at the crime scene as the police collected evidence we learned that IMC had not only beaten up the taxi driver but had stolen his wallet and phone (which were hidden but found when the PD called in an attempt to contact the taxi driver). Among the evidence that was taken out and photographed, on pair of items will never leave my memory, the bloody shoes that IMC had been wearing when he apparently curb stomped and kicked in the face of his taxi driver.\n\nBoth residents of #2223 were instantly evicted for bringing violence to the apartments.  At work I received a lot of credit for taking down an MMA fighter on the job and for handling the situation the way we did, thankfully only my partner knew I resorted to a device for help. I knew the managers at the mma gym and was the first to tell them a first hand account about the night their rising star ended up in jail. A month later when IMC got clean they accepted him back at the gym and I had left to prevent possible complications (I didnt know if IMC recognized my face but the managers and I decided it was best not to deal with that kind of drama). IMC still fights but from from what I last heard (and subsequent google searches has shown) he still has a habit of drug abuse and getting arrested",
        "created_utc": 1385544561,
        "upvote_ratio": ""
    },
    {
        "title": "Tale of Rent-A-Cop Revenge. Sir complains about nothing vs engineering student",
        "author": "BlackisKindaBlue",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1rem86/tale_of_rentacop_revenge_sir_complains_about/",
        "text": "I originally posted this in r/prorevenge until an awesome officer told me about this subreddit\n\nBackground: This was a snobby high class apartment community in the Southern California Orange Curtain filled with residents and managers who think every problem is balanced by money and anyone else (contractor, service employee, or other) was below them and expendable. As the Security contractor we were expendable, and they made it clear because we were hired to replace the previous contractor that we found out were set up to fail by the same managers that hired us. We weren't hired to provide security so much as for the company to have someone to blame as their liability shield if something went wrong. We did the job as best we could given the hypocritical ethics and practices of our property managers, but we knew the real reason they wanted us.\nThe Conflict: Among the many residents thinking that their high rent entitled them to the right to complain about anything they wanted was one that we will refer to as 4323. He would call in and complain at any hour he wanted, most commonly 15+/- minutes from 10 pm when the pools closed to complain about people in the pool or to tell us how to do our job (the pools close at 10 pm and most of the time he called before that just to say we needed to close them). He would complain we weren't doing out job, didn't do out job, he couldn't sleep because a neighbor was screwing too loudly, all sorts of ridiculous things. He also left his window open which was probably why he supposedly could hear everything and later became his Achilles heel. The property managers offered to move him to a different apartment but he refused because of his view of the pools on the top floor and the managers would always settle because he paid a really high rent anyways. After over a year of this we retaliated.\nConflict resolution/Revenge: The previous month 4323 had called in 3 times a day every day so I told the other security guards to pee in a bucket or contribute something virile and liquefied to the \"gag bag\" every time he called and it would be put to good use after 3 days we had enough. I was still in college as an engineering major at the time and after enough fluid mechanics and hydraulic lab work, I had designed a prototype revenge machine: basically a giant super-soaker with a .5\" nozzle powered by compressed gas (I used a propane tank because it was convenient). As security guards we had access to the roof and I already had a vantage point in mind for. I had a previously calculated set of tables to make the perfect shot, a little bit of trigonometry and a partner to help set up the shot and with the pull of the trigger we sent over a gallon of piss, fish guts, yellow dye, and left over Indian food through the window and onto their rug without even grazing the window edges all while under the cover of night. 4323 apparently didn't have any idea what had happened the following morning, complaining got them nowhere but they got pegged with the cleaning fine because 4323 couldn't prove they didn't make the mess themselves and they were at home at the time (which was even more surprising they did not hear a splash after all the noise complaints they made that year).\n\nIn case I didn't make it clear enough earlier, #4323 didn't complain based of reason, he did it for entertainment probably while going through insomnia. Security weren't the only ones having problems with #4323 but the property managers and other residents as well.\n\nTL;DR: \n-Guy #4323 complains too much too long to security guard \n-security guard uses 'engineering': makes giant putrid filled super-soaker \n-guy #4323 gets fined for cleaning mysterious stinky yellowish stain on rug\n",
        "created_utc": 1385366006,
        "upvote_ratio": ""
    },
    {
        "title": "Just lost my favourite contract; a Rant.",
        "author": "Greedeater",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1r73nn/just_lost_my_favourite_contract_a_rant/",
        "text": "Ok, I am aware that this is technically a rant, but this would be the place to do so among peers, as I'm quite upset about it. \n\nI've had the contract for a very high profile cocktail lounge for the past year. As I run a security company, most people would expect me to not be 'hands on', per se; but I'm not a desk jockey, and never will be. \n\nThis place is fantastic: great crowd, all high roller corporate types, and as such the highest priority for my team and I is presentation and performance. Now when the venue in question, which I was requested to secure, I was explicitly told by the directors to adhere to a strict code of conduct and entry parameters. And I mean *strict*. No deviation whatsoever without prior approval from the Venue Manager or a director themselves. \n\nSo when I wake up today to 4 missed calls from my Business Partner, my stomach dropped. He *never* calls unless it's urgent. Thinking that one of my guards has fucked up colossally, I call him back straight away. He informs me that we had lost the contract, and I'm *stunned*. We have a quick chat about it, and he suggests I check the company email address. \n\nLo and behold, there's an email from the holding company for the bar. Their excuse for dropping the contract?\n\n**I am too strict on the door.**\n\nThat's what you wanted!!! You *specifically* told me so! Why didn't they just request for me to relax? Why not even just request that I leave the contract and replace myself with another guard? I wouldn't have taken offence to either of those. But dropping the *whole fucking contract on a Friday night, the busiest night there*? \n\nThey are out 3 guards now, and if I don't receive a more satisfactory response then 'I'm too strict', I'm yanking the 4 other contracts from their other venues, to which I've already lined up other jobs for the boys. Back room politicking is the one thing I cannot stand in this job. \n\nFinally a question for all here; has this happened to you? Not just losing a contract, but *well loved* contract that you built from the ground up. How did you react?\n\nBah, I'm too pissed off to type anymore, I'm going to at CoD and wail on some campers. Will update with edits later if I find out more.\n\n**edit:** Its morning over here now, went past the venue last night with one of my guards. The new guys there are a joke. The company is well known over here as bottom feeders that undercut contracts with a lower than normal rate, and pay their guards an even worse one. However the doorman they have now wont last long there, as I fired him for repeated excessive force nearly a year ago.\n\nHad a quick chat with the VM who was out the front having a smoke. From previous texts he had shown to be on my side of things and wasn't happy with the directors decision. He knew as much as I did unfortunately, and I asked for him to keep me in the loop. I have begun to transfer my quality guards out of their other venues and reassigning them. My personal team has shifted back to Area Management with a weeks bonus pay, until I work out where to put them. \n\n**2nd Edit;** 3 days after this, I got an email today from the minor Director (the one who doesn't like me for banning his Dealer mate) enquiring about where the regular guards have gone from their other contracts and a few off colour comments and veiled threats towards same contracts if they weren't out back on roster. My verbatim reply is as follows, copied and pasted directly from my outbox with italics for omitted details; \n\nHi *director*, you paid *my company* to perform a service at *lost contract* and we did so to the letter of the instructions given by *head director* upon our first meeting. I worked the contract personally as requested, and had my best employees as the team, also as requested. *head director* was impressed enough to give *my company* the contracts for *other venues* stemming from the merit and results of our performance at *lost contract*.    \nI have always been transparent with you in my work, as you have been somewhat transparent with me in your instructions in how you want us to perform, so I shall be blunt with you; \n\nI am removing my experienced guards as I believe that *holding company* are only concerned with the bottom line, and not for the safety and security of your staff and patrons. As such, I also believe it will only be a matter of time before you hire *bottom feeder company* to handle the other contracts in question to save money. So I am making sure my employees have the job security they expect and deserve from me. \n\nThe replacement guards are all competent, and will serve *holding company* well until such a time arrives. \n\nAnd on a personal note, I feel obligated to let you know that not only is *new doorman* a former employee that I fired almost a year ago as he is an extremely violent person and consistently uses disproportionate force in every altercation, verbal or otherwise (maybe you should check if he even still has his licence? Because as far as I know he was charged with GBH and as such had his licence revoked with a DQ for 7 years, I actually thought he was imprisoned to be honest) but *boss of bottom feeder company* is a known Enforcer in *Bikie Gang* with drug ties around the country, so it won't be long before the dealers - that I cleaned out of there and kept out, remember - come sneaking back in. \n\nAs for the early termination of the other contracts you also implied, feel free to show this to *head director* before doing so, so he knows *exactly* what he is getting into. If he even knows that you have rescinded the contract for *lost contract* in the first place. \n\nRegards, \n\n*business template etc*\n\nSeriously, fuck that guy. And the more I think about it, the more I believe that this is all his doing, the smarmy little shit. \n",
        "created_utc": 1385095776,
        "upvote_ratio": ""
    },
    {
        "title": "Idiotic Movie Fanatic Co-Worker",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1qyph3/idiotic_movie_fanatic_coworker/",
        "text": "Im not really sure if this is the right subreddit for this, but Im a security guard and a co-worker (also a security guard) told me this, so i guess it might be the right place. \n\nI was working on a boomgate with another security guard named John, who is also a complete idiot. John use to work at Parliment house in the 1980s as (apparently) a shift supivisor. \n\nSo I asked him if he saw anything cool or interesting there while he was at Parliment House. He basically told me the general plot line for The Hunt for Red October. \n\nMe: \nSo was there anything interesting that you saw?\n\nJohn: \nYes, actually there was. I was working at Parliment House in the foyer, and a russian man who was probably in his mid late 50s or early 60s who came in and demaded to see the Prime Minister, I asked him why he had to see the PM and he said that he had schematics for a Russian Submarine with an secret experimental propolsion system\n\n(At this point I was thinking hes talking about THfRO and just pulling my leg, so I humoured him and went along with it, I was hoping to catch him out and humiliate him by saying that didnt really happen but its actually off a movie. But he was apparently serious about it) \n\nMe: \nReally John, what sort of propolsion system was it?\n\nJohn:\nIt was an experimental one, which basically sucked water in the front of the submarine and expelled it out the back of it, creating a jet of water powerful enough to propel the submarine , but since it was a water jet it couldnt be picked up on sonar. \n\n(ive got a smirk on my face at this point and I try to catch him out)\nMe: \nHmmm, John that sounds familiar from somewhere, did the guy have a scottish accent or was he named Ramius by any chace?\n\nJohn:\nIm not sure, I dont remember his name, but it started with R, so it might have been Ramius, Im not too sure, it happened 30 years ago.\n\nMe:\nI think the guy youre talking about name was Marko Ramius.\n\nJohn:\nYeah i think it was, how did you know that?\n\nMe:\nCall it a hunch John, Tell me more about the submarine\n\nJohn:\nWell it was an experimental one, and the Man thought it was too dangerous for the Russians to have it, and since it was an undetectabe one, he decided to give the schematics to Australian Military to see if they could work out a way to look at the schematics and work out a way to detect the submarine incase theyre ever put into mass production. \n\nMe:\nTell me more about the Propolsion system, that sounds pretty cool.\n\nJohn:\nIt was callled something like a centipede drive, I think it was a centipede drive, it started with C, basically it used a jet of water to propel the submarine and it was undectable by sonar. \n\n(I was amused at this point, but going along with his story)\n\nMe:\nWhat was the submarines name John?\n\nJohn:\nI think it was the Red something.\n\nMe:\nThe Red October?\n\nJohn:\nYes! Thats it, how did you know that?\n\n(I finally had my chance to humiliate him now)\n\nMe:\nBecause John, youre talking about a movie! Its The Hunt for Red October it was a block buster in 1990, and you just word for word described the plot line, and its not a centipede drive, its a catapillar drive! You really are an idiot John, jeezus youre stupid!\n\nJohn just went Red in the face and didnt say anything else for about 2 hours. \n\n\nEdit: Spelling ",
        "created_utc": 1384847348,
        "upvote_ratio": ""
    },
    {
        "title": "[Rant] Hastily Written Post Orders",
        "author": "terminator_rex",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1qsscd/rant_hastily_written_post_orders/",
        "text": "Sorry if this doesn't belong here, but I'm sure most of you can sympathize-  \n  \nThe site I am working tonight was pretty awesome until a few minutes ago when the new post orders were released. All on one page, in bold and underline, including the dashes:  \n- Rounds of the parking lots, interior, halls, doors, and perimeter to be conducted every 5 (five) minutes.  \n- breaks are only to be when needed and only if relief is available.  \n- guard must remain on site until all staff and patrons leave.\n  \nBig news, folks, I'm the only one out here and it's a 5-8 hour shift.  This isn't a bank, has not had problems in the past, and is in a very nice area of town.  \n  \nWho writes these things?!",
        "created_utc": 1384654791,
        "upvote_ratio": ""
    },
    {
        "title": "Losing faith in humanity",
        "author": "sharkbaitzero",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1qqoag/losing_faith_in_humanity/",
        "text": "I have to say that a post /u/FenrisJager made prompted me to tell about my own dealings with the vagrants of my city. Sadly I have to say that my dealings have made me move from indifference to outright bitterness towards them. I hope that my storytelling isn't too horrible but I fear this is going to come off as more of a rant.\n\nMy post is at the main library in the heart of downtown. As such there is a significant homeless population that comes in daily to try and sleep, eat, look at porn on the computers, drink, or do drugs. All of which are either illegal or against policy and the homeless who try to do so are not happy about me telling them they aren't allowed to do these things any more. A little setting is in order, I think.\n\nBefore my company took the contract the library had their own security guards on the library payroll and they were less than effective. The local vagrants pretty much did as they pleased because the librarians were all too timid and non-confrontational (nothing against them or anything, their line of work is radically different) and the 'guards' they had were two old ladies who sat around, did nothing, and could barely climb stairs. My company has taken over and we are all more effective and have a more imposing presence since we are younger and in better shape. \n\nThe first month of establishing ourselves has been an annoying hell. They have challenged us by intentionally breaking rules to see how we react. It was more or less expected since we're the new enforcers. But they have taken it to a new level when they are woken up from sleeping, then denying that they were sleeping, then yelling and making threats. Or when they leave their bags unattended, claiming a specific table all to themselves for a few hours while they leave the building to go and do whatever. Then yell at me for moving their smelly bags behind the security desk and letting someone else use the table. Or when they are corrected for making unwanted sexual advances to one of the female guards repeatedly even though she tells them no and that it will never happen. Or when they ask for handouts from the guards and library staff and get angry when we tell them no and that they can't panhandle on the premises.\n\nI do feel bad for the guy Fenris wrote about and I think those guards who put the boots to him should lose their jobs and be prosecuted. But I have no shred of sympathy for the entitled, undermedicated assholes at my site. None whatsoever.\n\nEdit: Went to an interview today and got a job for a company that will both pay me more (just over double my current take home pay) and move me over to armed! I'm going to be done with that library. ",
        "created_utc": 1384574518,
        "upvote_ratio": ""
    },
    {
        "title": "What did you think would happen?!",
        "author": "emotigerfights",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1qqe4k/what_did_you_think_would_happen/",
        "text": "Hi fellow security!!\n\nI work at a large music venue in a major city. Capacity is around 600, two levels with two bars; so if you can imagine, sold out nights get nuts. \n\nMost of my job is a lot of kicking out drunks and underage drinkers as well as breaking up fights, cleaning puke, and everything in between. \n\nOkay: the story!! \nThis couple comes in, male over 21, female is under. We radio it in, as we do every over-under couple, and of course we explained not to share alcohol. What do they do? Literally inside less than an hour and we pull them out. Now, we didn't see who gave her the alcohol so we kick her only out. \n\n(Usual: I'm sorry you can't come back in)\nCrying teen: I didn't take a drink!! Your employee is lying!! \nTurns into\nI'm sorry, I won't do it again, I've waited months to see this band\n\nWe stand fast as usual, you could see the light bulb flash on when she realized she was not coming back in. \nCT: Well fuck you! You're employees are lying, every curse you could think and runs off on her phone. Mind you, her boyfriend has already gone back inside.\n\nOkay, so she gets on the phone to her mom who calls my house manager demanding to know why her daughter was outside in a dangerous neighborhood. She's just outside crying (I'm working the door at this point)  she keeps approaching me, asking to see a manager, crying, screaming, etc. We weren't fucking around with a teenager.\n\nAnywho, we shoved her into a cab upon her mothers request.\n\nTLDR; caught two men blowing each other in the back of the venue, broke it up, they have me e.",
        "created_utc": 1384565115,
        "upvote_ratio": ""
    },
    {
        "title": "\"We just didn't want to walk...\"",
        "author": "txrook",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1qpnr9/we_just_didnt_want_to_walk/",
        "text": "Another tale from the ever-so interesting campus security files. \n\nThis event happened last night, around 9:30 or so. I was assigned to a post located directly within the entertainment district of our campus. On a normal day, we do our rounds in the parking garages and a foot patrol of the residential/dormitory areas. You'll get the occasional visitor/student come up to the door to ask some questions or the ones that try to dispute a parking citation (what a joy!). Normally, the restaurants start losing traffic around 7pm and most students are already in their dorms. It's usually smooth sailing for the rest of the night. Unfortunately last night was not a typical night. The bar next door to our substation was having a live music night, also the Men's basketball team was playing a home game, and finally we had contractors up and down the main street setting up a stage for the upcoming homecoming parade. It was a mess, to say the least. \n\nOn top of our normal assignments, we have added responsibilities of monitoring the bar, setting up barricades on the main street, security escorts for students, increased patrol of the parking lots (twice every hour) and any other little tasks our supervisors thought of. I'm scheduled with two other employees, we'll call them Louie and Jay. We decide to split up since there's so much to do. I got stuck with camera duty, meaning I can't leave the substation at all unless requested by my Lieutenant. There I was enjoying the inactivity of 36 cameras, and listening to the constant radio traffic that I was not allowed to respond too, until I hear a knock on the door. Unexpected but nonetheless, finally I get some kind of contact. \n\n\"Excuse me sir, my girlfriend had a few too many to drink at the bar. She's in the bathroom throwing up and she won't listen to me, is there anyway I can get someone to help me take her to my car?\"\nThis would fall under a security escort, so it was no big deal but I wasn't allowed to leave so I paged Jay over since he's riding around in golf cart. For some reason I guess everyone only heard the words \"drunk girl\" on the radio and in less than a minute I had 4 guards and 2 officers respond. The officers used a breathalyzer on the boyfriend to make sure he was ok to drive, Jay prepped the golf cart and everyone else stood around waiting to see the drunk girl. \nTwo waitresses from the bar accompanied the girl to the cart and she was visibly in bad shape. She couldn't stand up alone, slurred speech, a few dry heaves that were too close for comfort. I accompany Jay, just in case she randomly flips out, while Louie replaces me on the cameras. As we're riding up the garages, the boyfriend is incredibly grateful and apologetic. He kept saying \"You have no idea how much we appreciate this.\" We pull up right behind the car and immediately the girl jumps out the cart on her own, runs perfectly towards the passenger door and waves at us while saying \"Thank you so much guys!\". Dumbfounded, I didn't even notice the boyfriend extending his hand out for a handshake and saying \"Thanks a lot guys, we just didn't want to walk up here\"\n\nJay and I didn't even know how to respond after that, we just sat there for a few moments sharing a laugh about the whole thing. None of the officers or other guards believed us, apparently she was \"way too drunk\" to be faking...? I just want to know why in the world they thought it would be better to fake public intoxication as opposed to a little white lie such as \"I don't remember where I parked my car, could you help us find it?\" Gotta love college student logic. ",
        "created_utc": 1384545357,
        "upvote_ratio": ""
    },
    {
        "title": "The sticky fingered coworker got away with one",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1qmlul/the_sticky_fingered_coworker_got_away_with_one/",
        "text": "I was in security for various firms before going to tech school some time ago. Another guard and I were making hourly rounds in an office building on the graveyard shift. At 0800, we were ready to leave. It was summer and it promised to be a warm day, as the temp was already about 70. The other guard said he was taking off and had his jacket zipped up. \n\nWTH, was he hiding something? In a flash, I caught on. Early in the shift I had noted a cubicle that had a calendar featuring girls posing with classic and hot cars. Then I saw it was missing on my round in the last hour. \n\nI couldn't think on my feet fast enough, so the moment passed and he was gone. After more thought, I didn't see any obvious way to handle it. I had no authority to detain him, and it was a he said/he said scenario. If I had told him to return the damn thing, I no doubt would have gotten the FU response. Maybe someone else who knew martial arts or judo could have \"persuaded\" him?            \n\n",
        "created_utc": 1384451358,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit. What are the coolest sites? impress me!",
        "author": "RankinDonut",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1qmihr/reddit_what_are_the_coolest_sites_impress_me/",
        "text": "",
        "created_utc": 1384449078,
        "upvote_ratio": ""
    },
    {
        "title": "A reminder of my humanity.",
        "author": "FenrisJager",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1qi4ku/a_reminder_of_my_humanity/",
        "text": "\nHey guys, me again. This story is a quick one. It takes place in the same time-frame as the prior one (The Pisser) but later on during the winter.\n\nI was working the afternoon - evening shift and had just come back inside from my last exterior patrol of the night. It was bloody freezing out, and the fact that the city layout more or less creates a wind tunnel down every street in the downtown core wasn't helping (it was around -40C). I removed my jacket and huddled down behind the desk to attempt to regain function of my limbs. My shift was to be over soon - but 2400 couldn't come quick enough.\n\nI decided to pass the time by doing one last Main interior patrol. The difference between this and a Tower patrol was that I wandered through the main concierge area, the second floor, the food court and the outlying maintenance corridors that went throughout the building. At most, it was about a 30 min walkabout. For the most part, the patrol went just fine. All doors were locked, blah blah blah operations. It wasn't until I was finishing my patrol up on the second floor that anything happened.\n\nI found him curled up in a corner well out of the way of regular foot traffic. It wasn't unusual to find a homeless fellow up here or anywhere else in the building - we had numerous access corridors from numerous pedways and the train station beneath the building. It was cold out and it was a big, empty building; of course we were going to get people sleeping in here. \n\nI'll put in a brief preface here by stating that the city's homeless community and I have not always seen eye to eye. Most of the people I've found to be downright scum or otherwise completely undesirable in any way, shape or form. Be it shitting on my floors or picking fights, or generally being a nuisance - my experiences with them all had left me jaded and biased towards them.\n\nBut this one was different.\n\nHe wasn't asleep, or maybe he was just on the verge of it. Maybe I had woken him up with the jingle of my keys, but he was well aware of my presence by the time I was standing over him.\n\nAnd he cowered. And he cried. His hands went up and he curled tighter into a ball, and crossed his arms as if to protect himself from some imaginary blows. He was a middle-aged man, possibly around his fifties by the grey in his ragged beard. He wore the remains of what was once a light winter jacket, far from suitable for the current conditions. A toque kept his tangled mess of a mane together on his head. His boots and pants were falling apart, and the gloves that you could buy for a dollar adorned his hands, fingerless and rotten.\n\nHe was whimpering, shaking in his little corner. I didn't say a word, I just watched. When I realized his whimpering were actually words beneath sobbing, I knelt down and listened.\n\n\"Please don't. Don't hurt me anymore. Please.\"\n\nI explained to him that I wasn't there to hurt him, and to take his time to calm down before speaking. I wasn't going anywhere, I didn't have anything important to do. I waited. When this poor, broken mess of a man managed to pull himself together, he managed to explain to me that he was deathly afraid of anyone wearing a uniform, as his last encounter with any security officials came from the downtown mall a few blocks over. There, they had apparently beaten the poor man into submission with Maglights, fists and boots; all for being found sleeping on their property. All of this, of course, was perfectly in the realm of the possible. I had heard the stories coming from that mall - the security officers there were Super Cops; petty men who's heads are too big for their uniforms. They are the kings of their domain and off with the heads any who dare question it. You all know the types, I'm sure.\n\nWatching this man was sad, and while everything in me told me to let him sleep in this lonely hallway for the night, I was too young and fresh in my time to dare risk breaking protocol. At his own pace, I helped him up to his feet and walked with him to the pedway to the next building over. I told him that there was a 24/7 coffee shop in the first floor of that building, and to meet me there in 20 minutes.\n\nWhen I changed out of uniform and went down to the coffee shop, I found him in the corner of the shop being spoken to by who I only assume was the supervisor on duty in the shop. I didn't bother to listen to whatever he was berating my new found friend about, I just sat down at the table while saying firmly \"He's with me.\" We weren't bothered again.\n\nI bought him a large black coffee, soup, a sandwich and a doughnut. Probably more food than he'd had in a month, by the look of him. His name was Sam, he had lost his job to depression after his wife passed away from cancer. He had no family in the city, no savings, no real friends to speak of, so he ended up on the street. We talked back and forth well into the morning before I decided it was time to head off. I shook his hand, and told him that, while the pedways and Train Stations were all patrolled by city-employed Peace Officers, that it was too cold for them to really be out in any force that night; and even if he was discovered, all of them were pretty upstanding people that wouldn't hurt him.\n\nI've treated the homeless community different ever since, often going out of my way to give them a hand (food, never money) when I can. We're all humans here, despite the current circumstance we find ourselves in. In this industry it's hard to remember that, but I encourage everyone to try. \n\nTil' next time, folks.",
        "created_utc": 1384307160,
        "upvote_ratio": ""
    },
    {
        "title": "Providence projects and my one and only legitimate fight.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1qf41s/providence_projects_and_my_one_and_only/",
        "text": "About three years ago I was a 20-year-old security guard for the section 8 housing projects in Providence, RI. I was mainly doing access control and patrolling but there were also a lot of residential disputes that needed to be regulated. As with most drug dealers, gang bangers and pimps, there was plenty of fights that I had to break up over money. Some I didn't want to get involved in because of weapons. \n\nThere was a guy who I will call Elio who came in everynight with his anchor wife (Fat Courtney Love) and would play dominoes with his friends. He did not live in the projects and rightfully belonged solely as a visitor. He refused to sign in on multiple occasions leading the weekend guards to just let him pass. He thought he was good with all the guards and tried this on me multiple times.\n\nI informed Elio and FCL that he is to use the callbox (direct line to apartments) to call the person he is visiting to give me the green light to let him in the building then come in and sign in. He didn't like doing this at all and it as mainly because residents wouldn't answer his calls since nobody really liked and him but were too afraid of him to say anything to me.\n\nHe kept sneaking in behind people with access cards or prying the doors open when I was patrolling on the floors.\n\nThere was a leak in the rec room one night and I had to shut it down. Most of the residents were cool with it and said they would play dominoes outside. Elio didn't like it and told me he wasn't moving from his spot. I went up to him and told him that if he didn't leave now that he was trespassing on government property and I wouldn't hesitate to call the cops. He left, swearing at me in English and Spanish.\n\nThe next night he came in, the room was still shut down and nobody answered the callbox. I wouldn't let him in until he began banging on the glass door. FCL told him to let it go and leave. I opened the door and he puffed his chest out and walked up to me. \n\n\"Why wouldn't you let me in cabron?\"\n\"Because nobody would buzz you inside and I'm not a doorman.\"\nHe mocked me like a child.\n\"That's mature. Stop hitting the door and as I said yesterday, if you don't leave then I'm calling the cops.\"\n\"Come on man, I need to see Cuba. I gotta tell him a secret.\"\n\"...no...call him all you want. You aren't getting upstairs without his authorization and your signature.\"\nI realized that I had forgotten to grab my radio to call for help if needed so I walked back to my desk. Elio followed me as I thought he would. FCL was still in the doorway. \n\"Why don't you like me? What's your problem?\"\n\"Why I don't like you is a totally different reason than why I'm not letting you enter.\"\n\nElio shoved my desk at me and with his fists clenched backed me against a wall. \"The fuck is your problem with me faggot?!\"\n\nI kept my cool. \"Elio, back off now before you get hurt or arrested. Save me the paperwork, come on. Be smart.\"\n\nHe got in my face and shoved me. \"Bitch ass cop caller gonna tell on me? Come out back and take it like a man.\" \n\nMy dispatcher was sending the police as we speak but time was of the essence at this point. I needed to act quickly or I was gonna get punched in the face. \"You're not gonna back off? I've given you one warning and this one is the last you'll get. Don't push me again.\"\n\nYes, he pushed me again, this time harder and I hit my head on the wall. Now, you know when you hit your head and just go primal? That's what happened. I locked his left leg into my right, swept around him and mashed his face into the wall. As he was stunned I backed into a corner so I could see him and FCL (who was now sobbing) he looked around and found me, with a head of steam he ran towards me. I stepped out of the way and like a dumbass he ended up head first into a wall.\n\nI couldn't believe he wasn't down yet. I got in the middle of the room and FCL started coming at me, the cops JUST arrived, I pushed FCL back and knocked her on her ass and the door shut and locked her out. Elio was enraged and ran at me, got a good shot on my cheek. I remembered what I was taught about the human skull being much harder than knuckes. \n\nHe punched me square in the skull and hurt his knuckles pretty badly. So I swept his legs and got on top of him and beat him in the face till the cops (slowly) got me off of him and handed me a water. As he was being arrested he yelled something in Spanish at me. he didn't know one of the cops was fluent in Spanish. They kicked his ass Hardee and arrested him. They came back later to check on me and told me that he said he was going to find me and shoot me which is what prompted them to give him an ass kicking.\n\nThen they asked if I wanted to press charges. Blah blah legal shit. FCL was also arrested because of possession of a controlled substance. \n\nTL;DR: guy didn't obey the rules, attacked me and then got two ass whoopings and maybe deportation.",
        "created_utc": 1384217450,
        "upvote_ratio": ""
    },
    {
        "title": "Kids and their shenanigans",
        "author": "chavelin",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1qdc91/kids_and_their_shenanigans/",
        "text": "Ok so first I'll introduce myself and background. I have worked for a couple of contract security companies in the past few years, mostly at our local colliseum. Well the summer of 2012 I attended the Full-time police academy, and afterwards stated working as an armed officer for the company I was with while applying for my local PD. \n\nRecently I have taken a job as a Patrol Officer for a local University's Dept. Of Public Safety (Uni calls us campus security so as not to \"intimidate students\".... whatever). When I first began I was working weekends alone in the afternoon. Well one day I was sitting in my patrol vehicle at the edge of campus just passing time on Reddit and watching passing vehicles through campus.\n\nNow I should mention that it had been raining pretty heavy this day, and the roads were quite slick. Out the corner of my eye I noticed a hint of black zoom around a corner out of sight and heading toward the center of campus, so I begin driving that way just on a feeling, and boy was it a good one.\n\nI come to a four way stop and look down each way thinking the car had just passed through campus like the rest since our campus is closed on weekends. As I look left I see a black, sooped-up Ford Mustang sitting sideways in the middle of the road, and a nearby decorative streetlight's bulb laying in pieces in the road.... great.\n\nI flip on the red and blues and pull in behind the car to block any traffic from heading that way and step out to a 19 year old kid freaking out, shoe-less, in the middle of the road. I chuckle and step out of the car and make my way toward the scene. I make contact with the boy and try in vain to calm him down while getting his info. The only thing he cares about is messing up his \"baby,\" not the fact he is in some trouble for destroying property (quite an expensive light btw), and just the fact he was just involved in a vehicle crash. \n\nThe kids gives me his info which at the time I thought his last name sounded familiar but I contact out local PD and my supervisor to request an officer and to update boss-man on the situation. At this point I have the guy call someone because the car was sitting on two flats and he wasn't going anywhere. His dad showes up shortly before the officer did and I find out I had worked with him when I was working as security for a neighboring city's courthouse and he's a LEO for the same city. \n\nTo shorten this up, the officer shows up and begins his report, I take pics and chat with the officer and father in the rain as we watch the boy changing his tires. Now the shocking thing to me was the Police father did not care a bit about the fact his son had been trying to drag race our streets and hit a light pole and kept comforting his sin that he could fix the car.\n\nAs the family left with both vehicles, I turned to the officer next to me and said, \"I wish my dad was that cool when I did stupid sh!t like that!\" The officer looks at me and laughs and says, \"yea I would've gotten my ass handed to me in front of the police and all! Freaking spoiled kids and their fast cars these days.\"\n\nI hope you guys enjoyed this, and I have a few more if this one goes well! Good day and stay safe out there!",
        "created_utc": 1384168753,
        "upvote_ratio": ""
    },
    {
        "title": "Two stories from being a bouncer in Boston's Theatre District",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1q0iyr/two_stories_from_being_a_bouncer_in_bostons/",
        "text": "So, after a long time searching for a new full time gig, I got yet another job as a bouncer, this time in the Theater District, AKA the infamous \"combat zone\" of the 80's, early 90's. \n\nI'm not a stranger to this type of work, I did it before I was in the Army (and sucked at it), I've done a couple of one-time gigs at raves in NYC that I should've never taken, every volunteer security gig I take at anime/sci-fi cons is pro-bono work, and I always get mistaken for one at every concert/rave/party/big to-do I go to. However, the new job is the first time I've done the work at a high-profile site on a regular basis, not just weekends. \n\nTwo things happened last week, I thought might be worth posting here. If this does well, I've got at least a handful of older stories:\n\n\n\n**Drunk guy bounces himself**\n\nTuesday last week we had a certain celebrity/internet meme come by and play music with his band. I got assigned to the 2nd floor, make sure people get in the right seats, drag them out if they get rowdy/creepy/hammered (never happens). Everything goes as predicted and the show starts without incident. 30 minutes in, I get a call from my partner (we work in teams of 2 minimum if you're on the mezzanine or balcony, one guy will usually stay outside the show in the bar area while the rest keep an eye on the crowd/kill time on reddit) over the radio to come outside. \n\nI'm met by my partner and this bespectacled, middle-aged man who can't stand still, so he's obviously intoxicated. Our team's a very liberal bunch, we'll give you plenty of chances to fuck up, so we let it go. Unfortunately, the bartenders will not, and the poor guy was cut off right from the start. I've been called outside because this guy wants me to personally seat him, and tips me $7 in advance to do so. So far, this is all completely above board, BUT, once we walk into the seating area, he hands me an extra 20, and in a slurred, weakly eastern-european accent asks me if he can be seated in front. Initially I refuse, but this guy will not put the 20 away, so I bury the issue by saying I'll \"see what comes up\" in the hopes he blacks out in his chair and I'll be able to reverse-pickpocket him in the darkness in 20-40 minutes when we're fireman-carrying him down a fire escape when he inevitably annoys the hell out of his neighbors. \n\nI know, yes, I've been bribed, but any of you who've been bouncers know that this is tradition. You know what you can get away with, and what you can't. \n\nTurns out, the front row was being held empty for photographers and comped VIP's that never showed up, and if this guy is alone he'll be easier to track, so just as he's about to become a nuisance in his spot in the back, I gently guide him away. \n\nIn his new spot, he manages to last a whole 45 minutes before he starts standing up against the railing and making a fool of himself. Just as a middle aged babbling yenta starts talking to my partner about how much of a nuisance this guy is, he walks out of the show and says this:\n\n&gt; \"I've had too much to drink, can you please call me a cab?\"\n\nI'm fucking dumbfounded, but I end up being the one to guide him down the stairs, and thanks to the fact that we had a decent radio set-up, there's a cab waiting outside for him. Rest of the night is a damn cakewalk, and thanks to him, I didn't go home hungry.\n\nI hope you all appreciate how rare this is. Usually if an extraction is required it comes with lots of drama. At least once during the process a \"Do you know who I am?\" or a \"This is bullshit!\" will be heard, and I'm sugarcoating it. Drunk people being thrown out is the cause for most scars a bouncer gets.\n\nAnd this guy got rid of himself. Classy guy!\n\n\n**Why you don't do crowd control without a clue in your damn head**\n\nThis is more of an observation than a story. Later that week we had a really famous punk band play a huge show and we had extra guys on from an outside firm (surprisingly not Wizard Security, a really famous gang of thugs from the area). These guys were all straight-up thugs and wore windbreakers with yellow \"security\" graphics. I got stuck at the latrine at the beginning of the night, making sure no one was smoking ANYTHING in there. I was having fun axe-bombing the stalls when someone lit up, since it was much more diplomatic than being a dick and getting in a fight over a pat-down. \n\nI get called up to the stage area after that ended, working the moshpit. Moshpits are a million times easier to police up than they look. All you ever need to do to stop a moshpit from getting stupid is be big, intimidating, and remove problems. \n\nThat latter piece is important. When I say 'problems', I mean the jackasses throwing elbows, punching, starting fights, throwing shit, crowdsurfing, etc. YOU DON'T REMOVE ANYONE AND EVERYONE, and this is exactly what happened. As soon as a sizable pit opened up, dude in a raid jacket would pick the guy he could intimidate and just start punching the shit out of him, and one of his boys would come from behind, scoop the kid up and eject him. Everyone was pissed. This is how you start riots, not control a crowd. I ended up getting pulled out soon after and I think my boss got fed up too because by the last hour of the show the entire general admission area was a giant moshpit and no one stopped it.\n\n\n**THE END**",
        "created_utc": 1383724923,
        "upvote_ratio": ""
    },
    {
        "title": "The time I let a skunk into the building",
        "author": "fishyfishkins",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1ppuvj/the_time_i_let_a_skunk_into_the_building/",
        "text": "Hi all, first time posting. Been in the biz in varying capacities for 6 years now across 2 client sites. I've worked a bunch of posts from front desk up to managementy positions. \n\nThis story comes from my time working 1600-2400 in the control center for a top Fortune 500. I got a call at 2300 or so from a mobile patrol reporting a door at building [400] would not allow egress unless opened from the outside with a sub-master key. Not really a big deal, it wasn't a 24 hour building but the client wanted a guard posted until it was fixed so we didn't run afoul of fire codes or leave a building unsecure and unstaffed. Well, it's probably 2320 at this point so there's not much of a chance of calling someone in on time and no one else on shift wanted it so I decided I'd get some easy OT. \n\nI get there at a little past midnight, relieve the mobile officer and settle in for an epic Nintendo DS session. The door was propped open about 6 inches with a rock and I was seated just inside, past the door, to its right (it's at my 11 o'clock). At about half past midnight, I see motion to the left of my Planet Puzzle League and look over to see a skunk with its two front paws on my door-rock. Oh shit. \n\nI figured I could probably just scare it away because it wasn't moving and was staring at me, presumably petrified, through the glass of the door. I get up, walk to the door and stomp my foot in front of the skunk. What does the little fucker do? He scurries over the rock, ACROSS my foot, and runs ten feet down the corridor and into an office. Ohhhh shit. I shut the door to the office to, at the very least, contain the furry situation. \n\nI escalate to control and tell [Lenny], the guy who relieved me at midnight, what just happened. We have a friendly back and forth that started with me being a liar and ended with me being a terrible security guard. Lenny notifies [Carl], the shift supervisor, of the incident. Why at this point neither Lenny nor Carl escalated the incident further, I'll never know.\n\nCarl comes to 400 and I bring him up to speed. The office was one of many rung around a cubicle area, directly across from the office door were the cube walls which extended almost all the way to the problematic door. We decided to block off any potential escape routes with things like foldable tables and large trash bins to to make a path to the exit. We then opened the door and hid, waiting for the skunk to meander out of the building. It should noted that during our construction efforts, Lenny was performing skunk research and calling us over Nextel asking questions like \"is it stomping its feet or hissing?\" or providing random facts like \"they stand on their front legs and spray over the top so they don't turn their back to you\". Thanks, Lenny. \n\nAnyway, the skunk doesn't come out of the office. So we get some crackers from a vending machine, tie some string around one and try to lure the skunk out. The little asshole would see the cracker, start following it but totally bug out and retreat when it got to the doorway. This goes on for a while until the skunk POUNCES on the cracker and begins a tug-of-war game with Carl. It was pretty epic actually, the skunk had the Ritz peanut butter cracker sandwich in its mouth and all four feet dug in like it was trying to withstand hurricane-force wind. Carl won the tug of war! The skunk was out of the office and into our path-to-the-exit! I pulled the door shut (from a distance with string) behind him and breathed a sigh of relief. Too soon. The skunk SQUEEZED itself under the &lt;1 inch clearance of the cube wall and vanished. The skunk was loose in the cube farm. No idea where it went. OH SHITFUCK. \n\nCarl throws in the towel (its past 0400 at this point, and it's a business day) and escalates to the Account Manager. Fast forward an hour or so and now it's Carl and I, our AM, the Assistant AM, the client and assistant client, the god damned VP of facilities and a few of his guys, plus the on call maintenance guy. Ever see a guy with a six figure salary jump off a desk and trap a skunk with an upside-down trash can? Yeah, me either. They slide a piece of sturdy plastic under the bin and carry the thing outside and toss it in the woods. Finally. The client and I share a laugh and a cigarette and all's well. \n\nWhat's sad is that both Lenny and Carl got written up (not so bad considering...) for not escalating sooner. I didn't get in any trouble. It's kind of messed up considering I was playing Nintendo when I let the skunk in. \n\nThat's my skunk story. I transferred out of the site a year or so later. A friend started working there maybe 3 years later and told me they still bring it up as the most ridiculous, left-field issue they've had to deal with. oops. \n\nTL;DR: I had a nice high score going but a cracker-loving skunk ruined it. \n\nPS, the skunk took two poops during his stay. What an asshole. ",
        "created_utc": 1383345789,
        "upvote_ratio": ""
    },
    {
        "title": "Here are my observations, so far.",
        "author": "SirSquirrel",
        "url": "http://bouncervations.wordpress.com/",
        "text": "",
        "created_utc": 1383118118,
        "upvote_ratio": ""
    },
    {
        "title": "Obeying orders, unecessary protocols and contradictions.",
        "author": "dolphinelrapo",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1pi718/obeying_orders_unecessary_protocols_and/",
        "text": "**Pre-face:** I worked for one of the largest security companies in my country, it's also a huge worldwide competitor and it's well-known for it's operating policies which consist of *a body on site is a site less to care about* and *have a drivers license, not killed anyone? Here's your uniform*. I mainly worked stationary at sites, but I moved around a damn lot and never went to a site excactly the same.    \n\nThis particular site was a a gov. building suffering from a major power outtage. More particularily; Department of Transportation. DoT resided in two five story blocks from the 50s,  situated on the main street with a bridge on the third floor connecting them.  I had already been to the site once that week when they put in a generator to grant uptime to the high pri. services (highway cctv, warning services for tunnels etc.).  As it usually goes with the goverment, this first generator was too small and the work too half-assed to actually maintain uptime, so they had to schedule a bigger generator. That's when I appear once again, scheduled for the night swing.  \n\n\n\nThe client had requested us to monitor the main entrance to the main block, as they expected the outtage to down the security system, which for some reason stayed up and ensured all doors were locked. Already from this point on I wasn't really required onsite, but I had demanded a mandatory 12h shift so I could get paid.    \n\n\n\nIn addition, an hourly perimeter patrol was requested, with the additon of a bi-hourly drop-by on every floor in the main block.  \nThe first three hours went fine, the WiFi was running by UPS for a while, so I had enjoyment of about 3-4 Workaholics episodes before it went down. The patrols required no additonal comment, doors were locked and all. gov employees (presumably) safe asleep at home.    \n\n\n\nAs I approached the fifth hour through my shift, a call came from our mobile unit supervisor. Apparently a passing-by employee (5am dude..) had commented on the lack of our presence in the main entrance and he had specified that all perimeter patrols were too be seized immediately, the o-holy main entrance had to be within our guarding eyes at all times. Ofcourse, this meant that I had no awareness of what was going on in about nine other floors, but the customer's always right, eh?    \n\n\n\nCue one hour later, I was making my hourly \"I'm not dead\"-update to hq when I immediately came to regret ever making that update. There were *sounds*. Not the regular old building sounds, no, these were the distinct sounds of someone trying their best to stay quiet, but doing one hell of a bad job at said task.  \n\nI immediately jumped up, instinctively grabbing for my flashlight with one hand and my chest with the other, because that damn near gave me a heart attack. I started rushing up towards the 3rd floor from which the sounds originated, when I remembered our new \"stay put\"-protocol. I was NOT to leave the main entrance. *Fuck*.   \n\n\n    \nAfter five minutes of voice mail and struggling to find good reception, I finally reached my supervisor. Upon hearing about the suspicious sounds, he revved his engine so hard it left my hand vibrating, while announcing that he damn sure was on his way and that god-damn, I'd leave the main entrance to it's own fate.   \n\n\n     \nRelieved by the green light from my overlord, I (Usain) Bolt'd up the stairs, guided by the mighty lightbeam only a LED can provide you with. My initial survey of the floor gave nothing, every single door down the empty white hall were presumingly locked and closed, nor were there any hints of any zombies or hoodlums. I carefully began moving down the hall, feeling every door and peering through every window. About halfway down the hall, I heard it again, the muffled sounds of what I first believed to be a drunk ninja.      \nMy heart was racing and my steps intensified, when suddenly I could hear the door down at the main entrance slamming shut. **Shit**, one more?  Fortunately I recognized the familiar steps of our M77 field boots and multiple keychains rustling in my direction. Backup.    \n  \nKnowing support was within seconds, I put on my grown man pants and stormed towards the sound, tearing the door open and aimed the LED-light straight at..    \n  \nAn obviously piss-drunk five foot nothing hobo. Seemingly startled by my mighty lightbeam he charged past me, throughout the door and straight for the stairs. My body manned with the superpowers of a regular joe on an andrenaline kick I pursued him in a mighty speed, screaming the polite and required \"Stop!\" and \"Lay downs!\" with a sprinkle of \"Fucking! and \"For Christ's sake!\".  \n  \nI almost had him when suddenly two pairs of my best in blues (our uniforms are blue, alright?) appeared, acting as a wall in which the hobo impacted with. Effectively knocking the breath out of him, they aprehended him with the likes of which I never before have seen, leaving me to breathe at ease and take a look through the remaining half of the hall.  \n  \nApparently this idiot had been up here a good half hour, scavenging through the remaining half for whatever valuables you can find in an office building. Every single missing item was recovered and it was discovered that he had gotten in through a fire exit which I would have checked on the hourly perimeter patrol. The client tried pinning it on us in the start, but came to their senses and realized their mistake. Never again have we heard them cancel or change protocol.\n\n**Tl;Dr:** Doubt your customer, obey your supervisor.\n",
        "created_utc": 1383093409,
        "upvote_ratio": ""
    },
    {
        "title": "Well you convinced me to do it",
        "author": "Feltern",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1pg6pv/well_you_convinced_me_to_do_it/",
        "text": "Well here goes, the first of many if you enjoy.  I will start by saying that I found this sub a couple hours ago, and have been doing security for a few years. The first story comes from when I was bouncing at one of our local night clubs for what is best described as a rave night. I am walking through the dance floor looking for any of the usual \"exciting\" behaviours we were used to dealing with at this club, when I see Mary (not her real name) a very drunk regular who also happens to be quite small (this will help later on). I go up to Mary, and as usual I ask her how she is doing, I quickly and politely cut to the chase and tell her that I can see that she should really go get a glass of water (at no cost of course), when suddenly the attitude switches from \"having a great night, rather drunk and on several different drugs\" to \"I run this place and nobody is going to tell me what to do\". I continue trying to get her to get some water when she starts yelling (louder and louder) and making vague threats. I tell her it's time to go and I get a f*** you! This goes on for a few moments (this is usually a very relaxing night, and had my backup a few feet away watching the situation) Mary is getting angrier and angrier, so I look at my coworker and give him the look, he smiles knowing full well what is about to happen. I pick Mary up with my arms out front like someone would do with a toddler and carry her out front where she drops one of my favorite lines: \"I know the owner of this place, he told me I am like a daughter to him!\" I giggle and reply \"what's his name?\" She goes silent for a moment and starts yelling more about how she's going to get me fired. I reply with one word \"Banned\" followed by \"forever\". She ran off into the night, we closed up lime normal and I told the owner. He just laughed and told me good work. This was not the last time I saw Mary, my club closed down for some renovations, and because of the popularity of this night it moved somewhere else for a while. I had a night off so I stopped in for a bit, and you can only imagine who I saw... Mary of course! Recognizing me right away (but obviously not remembering that incident) ran up to me, jumped on me (one of those hugging jumps that only smaller people can get away with) and kisses me right on the cheek. I really miss that place.\nTl;dr a girl convinces me to ban her and hugs me a few months later.\nSorry for the errors, I am just getting used to this phone.",
        "created_utc": 1383028359,
        "upvote_ratio": ""
    },
    {
        "title": "Fishing on the job.",
        "author": "Lightfairy",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1pal3u/fishing_on_the_job/",
        "text": "Hi all. Been lurking here for a while and thought I would contribute a story from my very brief time as a security guard here in Oz. I am a mature woman who decided on a change of pace about three years ago so I went and did a security course. Got my P plates. Nothing came of it until I moved to a small town on the mid north coast a few months later.\n\nGot a job. Got a uniform. Of course still a P plater. My first assignment with this company was night work guarding a hole in the ground. An electricity company was changing some cabling underground and I had to mind this large hole that was fenced and the accompanying large and very expensive roll of copper cabling that was going into said hole in the ground. My shifts were 6 pm to 7 am. Long time but no biggie as I was a night person who suffered from insomnia anyway. I did 13 nights straight. Bit of a break and then on and off over another few weeks. On the other side of the river from where I was stationed was another security guard. I should add that the copper cabling was also being run under the bridge across the river and exited from another hole in the ground on the other side where another guard from my company was stationed. Quite a long distance (probably close to 600 metres or more) but good fun practicing morse code with my torch at 1 or 2 in the morning with the guard across the river! \n\nEach afternoon I would park my car at the designated location which happened to be right next to a popular boardwalk and fishing spot on the very scenic river. The boot of my car when reversed into the parking spot was literally only 5 or so metres from the river! The hole in the ground was right next to my car and had taken out several parking spaces. I also happen to love fishing and own a lot of fishing rods! When the tourists had all left the area and it was dead quiet by about 11 pm I would walk along the river and spotlight fish in the water. \n\nOver several nights I saw leatherjacket, whiting, garfish, puffer fish, bream, flathead and even a couple of times the ghostly shapes of very large stingrays cruising up the river. Back to those flathead though. They were large, plate sized specimens and they were sitting just off the dock in water only about 70 cm to just over a metre in depth. Roughly the length of a fishing rod away from me! There was all that yummy fish goodness and I was working! I finally couldn't stand it any more. I had to bring a rod to work with me so one night I packed up a rod, some jig heads and some plastics in the car with me. I figured with jigs and plastics I could pack up quick if need be and I wouldn't have the stink of bait on me. \n\nIt was easier than I had even thought. I waited till all was quiet each night which was usually around 11 pm or so and out came the rod. It wasn't even really fishing! I would drop a plastic prawn on a jig in front of the mouth of a spotlighted flathead and just watch it take the bait. Reel it in and throw it in the esky I had brought with me. I caught about 5 or so flatties a night for the entire time I worked there which was about 6 or so weeks. My direct boss ended up knowing what I was up to but he figured at least I stayed awake (they actually remarked on this several times as they never found me asleep and always found others asleep) and was within metres of my assigned duty. The guy on the other side of the river had to be woken up by the mobile unit several times a night! My one and only interesting story from my very brief and very fishy time as a security guard!",
        "created_utc": 1382843639,
        "upvote_ratio": ""
    },
    {
        "title": "My introduction, plus a quick story.",
        "author": "FenrisJager",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1p8bm3/my_introduction_plus_a_quick_story/",
        "text": "Hey all. I found this subreddit through a friend a few days ago, and decided that you all might enjoy a few of my stories every so often. As a little bit of background, I'm currently living in Alberta, Canada, and have been in the security industry since I was 18 (I'm currently 25). I've done a wide array of security-related jobs, including: Static security, mobile patrol, retail loss prevention, casino security and armored truck. I'm currently working towards employment with a municipal police force.\n\nIn my 7 years in the industry, I've had a number of experiences that have changed, jaded, enlightened, taught, broken and made me who I am today. I look forward to sharing some of these experiences with you all in the time to come.\n\nLet me start off with a fun story I like to call \"The Crazy Pisser\".\n\nIt all began at my first security gig ever. I was 18, and placed by a local security company in a large office building in the downtown core. My equipment consisted of a cell phone, black clip-on tie and a poorly designed dress blazer and pants combo as a uniform to imitate \"professionalism\".\n\nI'm working weekends at this point because I'm in college and need the money. The job was decent, because I was mostly sitting behind a concierge desk monitoring cameras, pushing access buttons, checking ID's and the like. Being the weekend and that most office-goers are at home with their families, I got very little in the way of traffic through the building. Plenty of time for studies.\n\nSo here I am trying to navigate my way through a rather tricky term paper when I hear a loud bang, followed by unintelligible screaming. The hell? I peek up from over the counter-style desk and see a man down the lobby, banging on one of the doors and yelling obscenities. I finally make sense of what he's saying \"I WANT TO GO TO JAIL, CALL THE POLICE.\"\n\nWell, there goes my quiet afternoon. I call down my partner from his tower patrol and wait until I hear him get off the elevator, then proceed forward toward the peculiar, screaming man. I manage to get nothing out of him aside from \"ARREST ME, FAGGOT!\" and similar pleasant banter. Well, time for him to go.\n\nI tell him plainly to get out, and that I'm not wasting the police's time with this. I manage to get him into the area between the two sets of doors leading outside, and lock the inner doors behind him. I then turn and walk away when my cellphone/walkie-talkie chirps, and my partner's voice rings through: \"Uh, you might wanna turn around, man.\" Fearing the worst, I turn. And there he is, pissing against the glass window in my general direction.\n\nOh for f*ck sake.\n\nAs I head back toward him, his yellow stream stops and I unlock the inner door, shouldering it open and bouncing him back a bit without even so much time as to put his dick away. I manage to spin him around, grab him by the collar and rear belt, and haul him outside to the street (yay for well-placed PUSH doors).\n\nI assertively push him along down the sidewalk while he keeps yelling his obscenities, and move myself back onto my assigned property. At this point, I decide it's a good idea to call the police and watch from a distance. The operator informs me that the police are not, in fact, too busy this afternoon - and a cruiser in the area will be by as soon as one's available. \"Great,\" I reply, \"I'll keep you on the line while I keep my eye on this guy, then.\"\n\nI follow the man for about half a block from about 30 meters, giving the operator the direction he's heading and what he's doing. No police yet, but they couldn't be long, right? Luckily the streets are fairly bare for foot traffic, so no one is getting directly harassed by him yet - can't cause too much trouble. Or so I thought.\n\n\"Uh, buddy?\" I say, speaking into the cellphone. \"Yes, sir?\" the friendly operator replies. \"He just tossed a metal sign through a sandwhich shop window.\"\n\nThis event made the Pisser jump to No. 1 on the Police Response List, according to the operator. When he was clear of the store, I ran inside quickly to make sure everyone in the shop was alright - which, aside from the poor girls behind the counter being scared shitless, everyone was fine. I poked back outside to find that the Pisser was making himself comfortable in the middle of the intersection, sitting down with his legs crossed as cars tried to maneuver their ways around him.\n\nThankfully, a short few moments later the cruiser pulled up beside me. As the police exited the vehicle, the man stood and started yelling his obscenities again as he was walking towards the officers. He received a few warnings to get on his knees and put his hands behind his head, but ignored them persistently through his screaming. One officer had his baton out while the other drew his taser, and when the Pisser ignored his last warning, ended up with a jolt straight to the sternum and dropped to the ground. Had he not already evacuated his bladder on my window, I imagine he would have pissed himself as he convulsed.\n\nAfter he was safely stowed away in the back seat of the cop car with his pretty new bracelets, the officer explained to me that the Pisser was a recently released patient from the local hospital who suffered from an acute bipolar and schizophrenic disorder - and had obviously been missing his medication.\n\nMy duty done, I made the journey back to my building and settled in with a coffee. I still had a lot of work to do. A student never rested.\n\n",
        "created_utc": 1382748576,
        "upvote_ratio": ""
    },
    {
        "title": "Got scared?",
        "author": "Silvfer",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1p5ac4/got_scared/",
        "text": "I'm just standing in a store uniformed to make it plain to anyone who enters that security is tight today. \n\nWhen suddenly a grown man of 45 years or more enters with his wife. \nUpon passing me by he suddenly turns back to me and simply shout BOOO! right into my face.\n-Now you got scared huh?\n\nMe standing there unflinching and unblinking.\n-I think your wife want to leave now sir.\n\nShe was red faced and quickly dragged him out again.\n\nSome people....",
        "created_utc": 1382646454,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting start to the day...",
        "author": "Greedeater",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1p3yuj/interesting_start_to_the_day/",
        "text": "Technically happened when i wasn't working, but y'all seem to enjoy my tales. \n\nSo, I'd knocked off work around 530 this morning, came home and passed out as usual. Hard night last night, one of my guards is down for a few weeks from a chunk taken out of his arm from a slipped headlock. \n\nAround 1pm or so, I fly out of bed because of someone screaming incoherently outside. Wondering what the fuck is going on, I chuck on a pair of shorts and bolt downstairs. I live in a gated community with zero trouble, so I'm pretty confused.\n\nThis guy is naked, screaming at the top of his lungs, standing in the middle of my driveway, absolutely *blitzed* on gear (I'm guessing G by the sounds of it): I am completely stunned. Neighbour across the road is on his phone, behind the screen door, so I figured he is on the blower to the police. As I'm about to back into my apartment he notices me. \n\nFast forward about 2 minutes, he's waking up from the safety position on my lawn, me standing over him. Fuck he was strong. Mister Plod arrived within a few minutes, and two burly Constables race over to dogpile. I step back, make sure they had him under control, and went inside to clean myself up (he was bleeding a bit.) One of the officers recognised me from working a high profile contract in the City, and asked for a synopsis. Call the neighbour over for the initial spot, filled in my end after he finished.\n\nThe police have to hold him for at least [*30 fucking minutes,*](http://i.imgur.com/Y1itvtI.png) before their backup finally arrives, along with another, and then finally an Ambo. The whole time the only thing he says coherently is, and I quote;\n\n'I am Saaaaaam, and I'm on the prograaaaaaAAAAAA**AAAAAAAAAAMMMMMYARAGHARGLEBARGLERMMRMMRMMRMMRMM**'(trail off into oscillating sob/V8-like revving sounds)\n\nOne of the officers wants my details, then realises she doesn't need to as my details were known from *another* job I do with VicPol. Literally still in her notebook from the weekend. I stand back and watch, having a coffee and a smoke. Once he finally relaxes after a few shots from the Ambo to calm him down, I head inside, come back out 5 minutes later with a few cups of coffee for the original attending officers.\n\nGood start to the day.\n\nTL,DR; tackled naked man half naked, Coffee with law enforcement on my lawn.\n\nEdit for a word.\n",
        "created_utc": 1382598215,
        "upvote_ratio": ""
    },
    {
        "title": "(uplifting old story) Tyler the Cat",
        "author": "MightyGamera",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1p13um/uplifting_old_story_tyler_the_cat/",
        "text": "EDIT: I just saw the 'No Cats' rule. Mods, if this story doesn't fly feel free to knock it off.\n\nI'm just writing this one in because I just found this sub, and having worked my share of security jobs I've got a huge stockpile of funny, depressing and odd stories. For the past 6-7 years I've done uniformed security, bar security, and am now a serving member of the Canadian Army. Basically I've got a knack for jobs where men are hired by the pound.\n\nThis one is the only completely positive experience I took away from this one place. It's actually kind of a christmas story, so the wrong time of year for that. But I may not think to write it later, so here it is now.\n\nIt was December 2009. I was working security for a shady, shitty little company, contracted out to be the on-site detail for quite possibly the most infamous apartment complex in the city. Within a two-block radius was a halfway house, methadone clinic, a couple payday loan stores, a pawn shop and an abandoned, dilapidated storefront that had since been repurposed by the local hookers as a place to bring their johns and shoot up and smoke rocks. Basically, great neighborhood.\n\nI was alone, and the only guy who would work that location. I'm a big enough man with good situational awareness and a talent for talking myself out of situations. So whatever risks were present, I could minimize.\n\nAnyway, second week of December '09. I'm doing my usual stroll around the building. Partly to look for vagrants on the property, partly to maintain a visible presence in the area, and partly because it was a pleasant evening and I wanted a smoke. I'm approached by two people: one is a man with hard lines and scars on his face, tattoos on his neck, and eyes like a shark. In tow is a girl with a little too much eye shadow, in a hoodie that's a little too big, who's a little too loose in her movements. Ex-con and his girlfriend with a habit. Not uncommon in these parts. Treat them like they're human beings, everything should be okay. Ditch the smoke, prepare to tell him that was my last one. I actually carried an empty pack around for this purpose.\n\n\"Hey man, got a minute?\" The man's expression denotes something's very wrong.\n\nI hear him out, writing details down. Basically, they'd lost their cat. Opened the door to their house, the cat slipped out and disappeared when they tried to chase it. Black and white shorthair, named Tyler. Just as the temperatures were dropping and the snow was getting bad too.\n\nThe two of them are more than distraught over Tyler's disappearance. They're wracked. They really loved that cat.\n\nI take his number down and promise to keep an eye out for his cat. He nods, tells me if I want a picture to look on craigslist as they have an ad there too. I wish them well and continue my walk. Rest of the evening goes normally. Next couple days as well. Minor incidents, nothing worth talking about.\n\nThird night, I'm walking around again as I'm always doing. I'm not walking outside so much tonight. The wind's picked up and cuts clean through my jacket. It's gotten really cold. If I can't stand it outside, I don't think too many others can either. Nothing's happening out here, everybody sane is indoors huddled under blankets with coffee.\n\nI hear a meow. Must be a trick of the wind.\n\nNo. No, it wasn't the wind. I look around, and in front of a dryer vent is a shivering little black and white cat. Ears are down, he's huddled in a little ball in front of the only heat source around.\n\n\"Tyler!\" I call to him. I'm a cat person. I get as close as I think I can to him and stoop down and offer a hand. The cat seems leery and first circles to run away. He's gonna die, I think to myself.\n\n\"Tyler,\" I call to him again, a little more soft and sweet. He pauses, then runs into my hands. Rubs himself along my legs, let me pick him up and carry him into the office. I lock him in the bathroom, swaddled in my coat. Stop by 7-11, pick up a couple cans of wet food. He annihilates the one I open. \n\nI try to call the number. It's busy. I try again ten minutes later. Still busy. This goes on all night. End of my shift comes, still can't get through to him.\n\nIt just so happens I have a rapport with a nice elderly lesbian couple who live in the building who themselves have several cats. They've brought me coffees a number of times. The residents generally liked me. \n\nI borrow a cat carrier off them, explaining the situation, and bring Tyler to my own home. My own cat immediately loves him. The day ends.\n\nNext day, I'm having lunch. I call again. No answer, but no busy signal.\n\nNot a minute later, I get a call from a payphone.\n\n\"Who the fuck is this?! Why'd you call my house like fifty times last night?! *What the fuck do you want?!*\"\n\n\"I'm that security guard you talked to down the street. I have your cat.\"\n\nHe pauses. His tone immediately changes. \"Y-y-you have Tyler? Where are you? I can come get him!\"\n\nI tell him I'll be bringing Tyler to work that night and that I'll call him when I get in. I do just this.\n\nHe's over not five minutes later, girlfriend in tow again. I'm treated to the image of a hard-luck man who's known nothing but bad decisions his whole life, unsuccessfully blinking back tears as he and his girlfriend cradle Tyler between them. Tyler's giving them both nuzzles. I step back and let them have their moment.\n\nHe turns back to me, wipes his eyes and sniffles a bit. I pretend not to notice. \"I dunno what to say man. I've got no money or anything to give you for this.\"\n\nAll I can think to say is \"Hey. Merry Christmas.\" and shake their hands.",
        "created_utc": 1382503327,
        "upvote_ratio": ""
    },
    {
        "title": "Vengeance",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1p0fej/vengeance/",
        "text": "(All the names used here are not real)\n\nThis happened before the summer. I've been loathe to talk about it because I'm well aware that the people involved will raise a rash of shit if I talk about it. But know what? Zero fucks given.\n\nBit of back story: starting in 2008, I've had an on-again, off-again relationship with Anonymous. It's always been apolitical and mostly focused on fringe/religious targets, like Scientology. Am I a committed, hardcore moralfag? Fucks no. Did I/do I enjoy hurting greedy asshats who deserve it? Yes. \n\nMost of my activity centered around the Boston cell. The masks and anonymity were gone by May '08 and a very 'lord of the flies' type of social structure ended up taking over. Head of the biggest cult of personality was a guy named Sam. Because of his influence, and other various drama that I may or may not have had a hand in, the cell fractured and within a year or so the cell was nonexistent. \n\nDue to me enlisting in the Army in 2010, and having a nasty breakup with a girl in the cell I should've fucked once and left in the dust, I cut most contact and buried my involvement as best I could. \n\nFast forward to my graduation: all these people from Sam's crew are congratulating me and acting like we're best friends, even though I'm well aware they probably had a hand in ruining my relationship with said girl that drove me to the military. \n\nThe night before I leave for Ft. Bliss and what I thought was the beginning of my career, I fucked another girl in their circle. Like an infantryman should. I'm flying over the Midwest and I get anonymous messages bitching at me for doing it. \n\nThroughout my time there (2010-2012) I have nothing but horseshit drama flying at me from grown men and women doing it simply because they know I'm too far away to call them out. Chief in doing this is a WONDERFUL basement troll named Barry who consistently wears proto-dreads due to lack of hygiene and smells of chicken soup.\n\nAs you can imagine, it gets to me, especially since my unit isn't the most caring and supportive group of soldiers either, but that's irrelevant. \n\nEarly 2012 comes and I'm on my way out due to the drawdown, and now I know these fuckers aren't my friends. So I hatch a plan: they love trolling conventions on the east coast, and I'm now ex military. I wait for 2013 (cuz I needed a real job first) and whore myself out to every anime and sci-fi convention I can as volunteer security. \n\nFirst one I got picked for was in may this year at the hynes in Boston. Head of security picks me because compared to the usual volunteers, I'm a ringer. It's a 3 day convention I get paid for in a hotel room and free food. \n\n\nMind you, the hynes was in the blast radius of the marathon bombing, that was the end of the military cordon during that wonderful week. Not only was there a MASSIVE amount of uniformed security and everyone getting searched before entering the building, but the convention's parent agency went so far as to mark every badge with a UV stamp to fix a known counterfeiting issue.\n\nFriday comes around....nothing happens, I make friends and get drunk when I can.\n\nSaturday.....nothing, UNTIL....nightfall! I'm walking out of the building with another 'hired goon' and who walks right in the front door with an obnoxious boombox (boomboxes were a no-go) but....SAM AND BARRY! \n\nReflexes from training kick in and I'm in kill-mode. Fenix tac-light comes out and I'm chasing them up an escalator \"Turn the boom box off motherfucker or you hit the floor!\" (Context: We had direct lines of communication to the real cops inside the Hynes via our supervisors. And none of the cops on duty were in the mood to play nice.)\n\nThey're high as shit, I can see it in their pupils, they're like fucking pins inside pools of ivory. \"Okay, friend, calm down, brah!\" \n\nThe boombox turns off, I disengage the targets, but of course, I'm still in kill-mode. 10 minutes go by and the radio chatter lights up, they're causing trouble, harassing patrons, time to do what I came to do.\n\nMyself and my friend intercept them outside the security desk. My boss comes out \"ID's, now!\".\n\nThey're so high they pull out state ID's. Eventually, my boss gets their con badges and hits them with the blacklight: no stamp, technically this is identity fraud and considered in MA felony trespassing. \n\n\"Oh, so you're stealing from me while trying to argue with me? Rick, go get the cops\"\n\nTheir state ID's are photocopied and they are put on notice they are hereby banned from all MA owned convention center property.\n\nIt was a fucking glorious night. And I will do it until they're banned from any convention that'll have me. The bonus is that the more conventions I work, the more volunteer listings I have on LinkedIn, my blood-feud turns me into a saint.\n\nTl;Dr: I pulled an Alfred from Dark Knight and burned down the forest full of jewel thieves that used to be my friends.",
        "created_utc": 1382483944,
        "upvote_ratio": ""
    },
    {
        "title": "Helping to catch a drugger",
        "author": "ZeamiEnnosuke",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1owd3t/helping_to_catch_a_drugger/",
        "text": "Firstly: I do not work in security but I thought you guys and gals might be interested in this story since it involves security.\n\nBackground: It all happened in a medium sized rock/metal/goth club. The guards where not always on the different floors but would patrol the area. Besides this occasion I've never seen the guards in action and I went there pretty often.\n\nThe club was pretty full and everybody was having fun. I was standing on the side of the moshpit, when a girl caught my eye. She was standing with her back to, what I assumed was her drink. She didn't caught my eye because she was such a beauty but more because there was this guy looming behind her, trying to be all sneaky and stuff. It was weird but I had seen weirder people in this club so first I didn't really think about it, but then he made a movement with his arm above her glass. First I really didn't think about what I had just witnessed but when she grabbed for her drink it dawned to me, that the guy, who was still near but backed up a bit, had put somekind of drug into the drink.\nAs fast as the press of the bodies lets me I get to her and say into her ear, that I saw a guy dropping something in her drink. Together we get to the bar with the drink and tell the bartender what I've seen. Not much later three guards approaches us and take us to a less crowded and load area, where I tell them what I've seen and try to describe the guy. Sadly he wasn't really outstanding by any means, but I was sure that I could recognize him.\nSo the guards take me with them to find the guy, as we scan through the different floors I spot him and again he was trying to put something in someones glass. He was like 20m away. I tell the guards and one of them charges him and takes him down from behind. Both land on the ground and the drugger lands face first on the concrete getting a bloody nose and maybe loosing a few teeth. They are really rough with him and escort him to the office. In the meantime the management had called the cops so they were waiting there also.\nI have to tell my story again and get a \"today you drink for free\"-card from the management, get a nice pad on the back from security and even the first girl thanks me with her number.\nMoral of the story: Alway report strange things I may pay for you.\n\nP.S. I did not see what or if he dropped something, but he made an odd movement above the glass so I wanted to play it safe. Later they found roofies and other drugs on him.",
        "created_utc": 1382360538,
        "upvote_ratio": ""
    },
    {
        "title": "Getting trolled by Alice Cooper's bass guitarist",
        "author": "Wide_white",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1ocn4g/getting_trolled_by_alice_coopers_bass_guitarist/",
        "text": "So as promised, I'd like to share more stories from my first year or so of security. Since my last [post](http://www.reddit.com/r/talesfromsecurity/comments/1nt5ei/everybody_down_now_another_story_from_my_first/) I've since joined a second security company as a means for extra income (since the winter festival ended, steady work was hard to come by with the first company) One of the nice things about this other company, is that they had all the major concert jobs; so whenever someone big came into town I got put onto barricade duty, which essentially, I got a free front row access to any concert that came into the city.\n\nOne of the concerts I had done was Alice Cooper when he came to town, which was a pretty big deal. So I go, and I get sent to the barricade once again (They liked to send me there becuase I was big and fat, so I looked intimidating, but as many of you know from my last story, I'm fairly timid and not one to get physical. But whatever, its a nice spot to enjoy the show from) \nThe doors open and people start to flow in, and there was some pretty strange people in the crowd. For one, there was a middle aged lady dressed as a slutty nurse with a 5 FOOT LONG SYRINGE, with majority of it being needle, which WAS metal and very sharp looking. Somehow one of the door crews thought \"oh, this should cause a problem.\" and let them in. Thankfully she setup somehwere in the middle so I never had to worry about her.\n\nFlashforward to midway through the show. Everyone was having fun, music was loud, and that was the way everyone wanted it. What I didnt expect (but should have) was that they liked to use a lot of props in the show. For one, Alice Cooper had a fencing sword that had fake \"cooper bucks\" on it, to which whenever he flaied the sowrd around would fly off into the front row, causing people to scramble for them (becuase free shit is awesome, no matter how simple it is). Shortly after, they then sent out giant weather ballons filled with confetti into the crowd. They went around the stadium for about 5 minutes, but then some how would work themselves back to the stage, where Mr. Cooper was ready and would pop the ballons if they got too close. Sadly 'too close' was directly above me and the rest of the barricade crew. By the time the last ballon was popped, I looks like I just walked out of a snow storm. \n\nEven later on in the show, the energy was up to 11 and the band was all over the place, doing classic rock moves and over-exaggerating all their movements. At this point the bass-guitarist, who was behind me for the majority of the show,either a had a solo or was just really into the song and started to slowly work his way into a kneeling rock pose. Well he took this as an opportunity to mess with me, becuase when he got low enough he began to rub the top of my head with the end of his guitar (maybe his way of trying to get all that confetti off my head :D). Of course the fans in front of me noticed; but what am I to do about it? its not like I can tell him to buzz off, so I just let it happen.\n\n\n\nFinally they begin their last song and everyone is going nuts. The band is still at full energy and the bass-guitarist was not done with me yet. \n\nQuick set up to this next part: the way they had the stage set up, they had the main stage, then about 3 or 4 giant amps directly infront spread out every 8 feet, and then there was a 5 foot gap from the crowd in which us gaurds would be stationed. I had worked myself inbetween 2 of these amps that were either at the middle of the stage (to might right), or right off stage in which no one on the stage could get to (to my left). Ok back to the story.\n\nSo the last song is blasting away and Alice Cooper leaps onto one of the amps (the middle one) and starts high fiving the audience. then the lead guitar on his right jumps onto the amp infront of him and does the same. Now, the bass-guitarist wants to do the same, but he doesnt have an amp in front of him to step onto. What does he do?  He steps out, onto my shoulder, and leans in to do more epic rock poses and look awesome for the audience. He stays there for nearly the remainder of the song and I have no choice but to live with it. \n\nThe song ends, and the crowd goes wild. The show was a huge success and I had a fun night being the source of some laughs for one of the band members. Its a shame that I never got to see him after the show.\n\n\nAnyways, maybe next week I'll share some more concert stoires, or I might share some from my current company. We'll see.\n\n\nTL;DR: Worked an Alice Cooper concert, bass guitarist used as a place to stand and to rest his guitar.",
        "created_utc": 1381666896,
        "upvote_ratio": ""
    },
    {
        "title": "Infected chains and dumbstruck guards.",
        "author": "dolphinelrapo",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1o8fdz/infected_chains_and_dumbstruck_guards/",
        "text": "**Pre-face:** I worked for one of the largest security companies in my country, it's also a huge worldwide competitor and it's well-known for it's operating policies which consist of *a body on site is a site less to care about* and *have a drivers license, not killed anyone? Here's your uniform*. I mainly worked stationary at sites, but I moved around a damn lot and never went to a site excactly the same.\n\nThe particular site in this story is a large lumber store, also providing tools, paint and other necessities. The site is split into two, one lumber section and one section for everything else. They're both in the same building, but through some corporate-level decisionmaking that leaves me dumbstruck, two entirely different sec. companies oversee each their section (Plenty of stories on this part). \n\nWe oversee the lumber section and mainly guard the drive-through gates, making sure that customers only leave with what they paid for and no less/more. In addition, we oversee rental trailers.\n\nAll our rental trailers are kept outside with chains locking them together in pairs, this to avoid the famous retail \"If it's not bolted down, it must be free for grabs!\".  \n\n\n\nI came into work on a Friday morning, uniform soaked in rain and a lingering hangover beating it's war drums. Immediately upon entering the gates, my 60yr/o supervisor storms over in the hilarious quick/slow pace only an elderly gent can achieve, grabbing me by my coat and pulling me straight over to the trailers.\n  \nSup.: Why the **fuck** is there piss on all our chains?  \nMe: Piss? Chains? In the name of the devil, what the **fuck** are you talking about?\n  \nSure enough, every single chain stank of dehydrated drunken piss and below a nice trail of the earlier mentioned liquid mingling with the puddles of rain. Did I piss on the chains? Well, of course not, I stick to toilets and people I don't like.\n  \nExplaining this to my supervisor and repeating ten times over that I was too busy downing jagers in town yesterday to bother with some chain piss, he eventually settled down and officially opened what he named, seriously, \"Urinkjeltringsskandalen\", this roughly translates to \"The scandal of the rascal's urine\". And he made it painstakingly clear that I was in no matter off the hook as of yet! Great.  \n\n\n\n  \nThe first matter of great investigative work done was for him to (seriously) sit in his own car the whole following night watching the site, because surely this rascal would return to \"finish the deed\" (what?). This he did even after I reminded him that our CCTV has a clear overview of the trailers through our main exit camera, but to no avail, this was probably to confusing for this to-be retiree. \nOf course this gave no results much to his dismay and he decided to step up his game by, no, not simply checking the CCTV, but rather doing a round of questioning. A round of questioning which somehow encompassed the entire staff of the store..\n\n  \nYou can already see where this leads, of course no illoyal begruntled worker with an impatient bladder would ever admit to such an an atrociousity. And rather it had made us the laughing stock of the entire staff, even some customere had heard of this old lunatic speeding around interrogating the innocent workers.    \n\n\n\n  \nFinally, he came to his mind, and went straight over to check.. No, not the CCTV.. but to check with the boss if he could request a urine sample of every single worker and to have the chains \"swabbed with those long white CSI-thingies\". Wow. Surprisingly, the request was swiftly denied and thankfully so. Because I probably destroyed every single piece of hopeful evidence when I litteraly drowned that poor chain in a solution strong enough to kill off an entire species of ants.\n\nWhile he proceeded with a daily ramble and harassed every cat, hobo, alcoholic or toilet who'd utter a look at the chains, I decided to make an end to this. He more-or-less abandoned his tasks to play Sherlock Holmes and even I did more work then him, hungover and playing 4hrs worth of Halo every evening.\n\n\n\n  \nI checked the CCTV and to my surprise; it was a gang of drunk teens.\nThat's it. That's who he spent about a week chasing.\n\nToo tired to confront him with my findings, I simply printed the pictures and left them on our board. The next evening, they were gone and no words were mentioned. His defeated and disappointed look told me all there was to be told, and it was never mentioned again.\n\nTl;dr: If in doubt; Check CCTV.",
        "created_utc": 1381512801,
        "upvote_ratio": ""
    },
    {
        "title": "When something bad happens, people just want someone to blame. In our line of work, that someone is usually us.",
        "author": "mkim92fs",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1o0gmt/when_something_bad_happens_people_just_want/",
        "text": "I work alone in a fairly big building. I rove the mechanical rooms, parking garage, bike cage, perimeter, and have to deal with access rights for vendors a good chunk of the time. Unfortunately, I can't be everywhere at once. Someone broke into the bike cage the other day and took a bike along with some lights, tools, etc. One of the tenants in the building was upset (rightfully so, even though his bike didn't get stolen) but sends an e-mail to most of the employees in the building and the property manager, who forwarded the e-mail to my account manager. The e-mail implies I am an oblivious moron (not denying the moron part) and states that employees should dial 911 rather than security for assistance in the future. This tall, skinny nerd is a real *prick*. Rant over...",
        "created_utc": 1381266429,
        "upvote_ratio": ""
    },
    {
        "title": "\"EVERYBODY DOWN, NOW.\" Another story from my first shifts as a Security Guard",
        "author": "Wide_white",
        "url": "http://www.reddit.com/r/talesfromsecurity/comments/1nt5ei/everybody_down_now_another_story_from_my_first/",
        "text": "Since I'm sharing stories from when I first started working security I thought I'd share another.\n\nJust a tad bit more background, I'm a fairly large guy. at the time I was just under 300lbs, not too tall but taller than average, and even though I have weight behind me, I'm actually a really nice guy, I try my best to avoid confrontation and any sort of physical altercation, as I'm usually worried what will happen if I ever do get into one. \nI'm a Canadian, what can I say? OK, onto the story\n\nIt was maybe a week or two since my last [story](http://www.reddit.com/r/talesfromsecurity/comments/1nacaj/hey_dude_you_left_your_phone_a_story_from_my/) and the winter festival was in full swing. All the ice sculptures were finished (and thankfully, none of them ruined by drunken teens), the park was packed with families and people coming off the canal, and I had been brought over to the evening shift to help out for that evenings activites. \n\nThe organizers for the event had set up a stage in one section of the park, that during the nights on the weekend, would host a DJ and dancers. This essentially turned the park into an outdoor club minus any booze, but in reality everyone was bringing their own. Seeing as most of us working there were practically new, and didnt have much experience with events like this, we were all quite nervous.\n\nFriday night rolls around and they have set up a rope that goes around the stage, to keep the stage seperated from the crowd. The night was going very smoothly: the park was packed, people were having a great time, and other than a few homless people sauntering by all was well. Seeing everyone was having fun at the stage, I thought I'd chill around there, and watch the fun. \n\n10:00 pm comes and goes and the DJ and dancers are still going strong, when the show was supposed to end 30 minutes ago. No worries though, as no one was causing problems and everyone was still having fun. Well shortly after 10:15, the dancers leave the stage but the DJ is still going to town, leaving me and my fellow guards to believe that the dancers will be back shortly.\n\nAs I'm watching, one of the voulenteers for the event tapped me on the shoulder. I turn my back from the stage and she says to me (More like yelled, as the music was ridiculously loud) \"From this point on, the dancers are done; There should be NO ONE on the stage other than the DJ.\" \n\nI nod ok and turn back to the stage, to see a single man I did not see on the stage seconds ago, dancing like no one was watching. I mean, he was going ALL OUT, leg kicks and everything. I turn back to her and say \"Is he one of the dancers?\" with panic in her eyes, she shakes her head \"NO.\" Its go time.\n\nI make a bee line to the stage. I dont even bother reaching for my radio as I know no one would be able to hear me over the music; I was on my own (with less that a month of standing around in a frozen park as my \"experience\"). I'm past the crowed and right at the rope, but before I can grab the guys attention, another 14 people rush over and under the rope and onto the stage to join the crazy dancer; completely ingoring me who they had to get past to get to the stage. Fuck. At this point, I got angry, and I was ready to start hauling people off the stage with my bare hands. But instead, with my most intimidating voice I yelled \"EVERYBODY, DOWN. NOW!\"\n\nEvery single person on that stage immediately stopped, looked at me, jumped off the stage and scattered into the sea of people. All for one kid who couldn't have been older than 14. He freezes, looks at me and sheepishly says \"Me too?\" and I point to him and say \"Yes, you too, now.\" to which he quickly runs off. I turn around to the crowd and start shouting for them to take a few steps back which everyone complies to, now giving about 2-3 feet of space from the rope and the stage. People started to realize that we were in charge and we werent going to let them fuck around. Sadly I couldn't say the same thing about the voulenteers, as they lost control of the DJ and had no idea what time he would call it quits (He finally dispersed the crowd around 11:30). Afterwards, I went into the back, wrote up my shift report, got some praise from the voulenteers and fellow gaurds for stepping up, and headed home for the night. \n\nThe supervisors must have heard what happened, as I quickly got moved from the overnight shift to the evening shift during the weekends to make sure that I was there during the DJ events, which went fairly better the following weeks as the event got its footing and figured out to control any variables (like finding a DJ who will shut it down on time).\n\nAfter the festival was over I ended up joining another company that worked concerts and special events, which I ended up working the barricade at shows like Alice Cooper, The Pixies, Lady Gaga and some others that I have some pretty interesting stories from as well (like being trolled by Alice Cooper's bass guitatist), but that will be for another time.\n\nTL;DR Stage got overwhelmed with crazy dancers, decided to grow a pair and took charge.",
        "created_utc": 1381012077,
        "upvote_ratio": ""
    }
]