[
    {
        "title": "Call Center Moral Boosts",
        "author": "BaFiCi",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4kb3ow/call_center_moral_boosts/",
        "text": "I am a Unit Manager at a financial institution call center. Looking for fun games or activities to do! ",
        "created_utc": 1463787868,
        "upvote_ratio": ""
    },
    {
        "title": "Business calls have been.. interesting",
        "author": "Believeinthis",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4kb10y/business_calls_have_been_interesting/",
        "text": "I work for a credit card company and just got trained on taking Business calls instead of just consumer. Business cards have different laws that apply to them because the Card Act was just for consumers.\n\nOne thing in particular is that if you have a promotional 0% on your account, like a balance transfer, and you go past due, you can not only just lose your promotion but get applied a penalty rate.\n\nGuy calls in and they had done a balance transfer when they applied for the card, back in JANUARY. They never made a payment, obviously lost their promotion and got charged a shit ton in fees and interest. When I explain this to the guy he comes back with, \n\n\"Do you have a 4 year degree?\"\n\n\"No, sir I don't.\"\n\n\"I didn't think so. Well, my wife does and she is a really smart person and she handles all of our bills. She has a really sophisticated computer system that tells her when to pay the bills. There's no way that she messed this up.\"\n\n\nYeah, she's so fucking smart that she didn't realize she needed to PAY the bills we've been sending??\n\n\nAnother lady called in, SCREAMING at me because she has a bunch of late fees and interest fees on her account. I looked in the notes and saw that the payment that she made back in December got returned from the bank due to the account number being incorrect. I told her that, and she's like, \"Then why did you give me a confirmation number?\" I started to explain that a confirmation number just means that we submitted the payment, but it always takes a least a day to process it, but she interrupted me with \"Yeah, I know. I've worked in the financial field for years. I'm not an idiot.\" Uhh.. then why is any of this confusing for you? She then demanded to know why we didn't tell her. Well, we sent you a letter saying the payment was returned, we've sent you several bills and notices. We wanted to call, but you declined the consent for us to call your phone.\n\nI went out of my way and proactively reversed $130 in fees for her. I told her that I was going to place her on a brief hold (to get permission from my supervisor). That pissed her off because she didn't want to hold, but I said it wouldn't be more than 2 minutes. It was exactly 1 min 30 secs when I came back and she had 3-way-dialed in the phone number for customer service again so we were in the IVR with the friggen prompts. I was trying to talk over it until another person picked up. \"YOU SAID IT WOULD ONLY BE 2 MINUTES\" \"Ma'm, it's been a minute a half. But it's fine, I'll just have the next CSR hang up.\" Impatient bitch.\n\nShe then wanted to close the account, and I informed her that we had already closed it because it went so far past due.\n\n\"Other than getting those fees taken care of and submitting your payment, Is there anything else I can assist you with today?\"\n\n\"No! Obviously not!! IT'S IMPOSSIBLE TO RUN A SMALL BUSINESS IN AMERICA, AND YOU GUYS ARE JUST PRIME EXAMPLES OF THAT!\n\nI DON'T NEED YOU AND YOU DON'T NEED ME!!\"\n\n\"Okay then, thanks for calling today.\" *click* \n\n\n\n\nPlease don't take my survey.\n\n*edited for clarity*",
        "created_utc": 1463786758,
        "upvote_ratio": ""
    },
    {
        "title": "Yes but then the go the error",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4k9qzz/yes_but_then_the_go_the_error/",
        "text": "[deleted]",
        "created_utc": 1463770132,
        "upvote_ratio": ""
    },
    {
        "title": "Aberrant behavior in the airport check in line!",
        "author": "tzaralek",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4k83q2/aberrant_behavior_in_the_airport_check_in_line/",
        "text": "Backstory, I work for the call center of a medium sized south american airline, we handle mostly central and south american locations and fly to very few USA locations. \n\nSo I got this call from some female passenger in the check in line for one of our california flights with one of those extremely californian accents\n\n\nTzarAlek: Thank you for calling X Airlines, how may I help you?\n\n\nFemPax: Oh hi, Id like to know, is your airline part of a conglomerate? or a subsidiary? I mean who operates the american flights? Who rules over the american employees?\n\n\nTzarAlek: Im not quite understanding your question, maam.\n\n\nFemPax: What Im trying to say is that I was on the check in line for my flight and Id like to report some of the most aberrant and DISGUSTING behavior I have ever seen by one of your employees.\n\n\n*The people at this airport counter is tad bit of a bunch of assholes and we get complaints from them a lot, mostly because they are in a hurry to get the flights going and go home*\n\n\nTzarAlek: Well maam if you would like to file a complaint regarding the behavior of one of our employees you need to go onto our website... under the contact us section you will find a form to file you complaint.\n\n\nFemPax: No no no, I really need to get somebody on the phone about this, I mean I was on the check in line at *California Airport* with my husband and my son, and one of your, I dont know, flight attendants or staff or whatever, KISSED, a security guard, it was DISGUSTING.\n\n\n*Now, maybe since she didn't specify genders, maybe it was some girl on girl or guy on guy kiss, I didn't really care...*\n\n\nTzarAlek: Maam you should feel free to file a complaint regarding any airport personal thru the web...\n\n\nFemPax: Is there an AMERICAN I can speak to? Maybe they will understand!\n\n\nTzarAlek: No maam.\n\n\nFemPax: Why is that?\n\n\nTzarAlek: Because we are a *Country South of the USA*-based Airline, so we dont really employ Americans outside very few airport employees\n\n\nFemPax: But! *Silence* *hangs up*\n\n\n\n\nShe called a couple more times... redirected to the website as per company procedures... but these passengers...",
        "created_utc": 1463748934,
        "upvote_ratio": ""
    },
    {
        "title": "Can I still use my account if I close it?",
        "author": "ermergerdberbles",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4k6223/can_i_still_use_my_account_if_i_close_it/",
        "text": "I just had a kid ask if she can still log in to online banking and pay her bills if she closed her account.",
        "created_utc": 1463710399,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'm gonna play my trump card!\" \"Ma'am, that's a late payment notice.\"",
        "author": "FlyingGuineaPig",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4k4ycl/im_gonna_play_my_trump_card_maam_thats_a_late/",
        "text": "Customer: \"I'd like to change the card that I have on file.\"\n\nMe: \"Oh, we actually don't keep cards on file.\"\n\nCustomer: \"Yes, you do. I'd like to change mine.\"\n\nMe: \"I'm sorry, but there's nothing to change. We don't keep cards on file.\"\n\nCustomer: \"Transfer me to someone who can change it, then.\"\n\nMe: \"No, I'm sorry, but there's no one here who can change it because we don't keep cards on file.\"\n\nCustomer: (smugly, and like she thinks she's won) \"Well, then how have you been getting my payment?\"\n\nMe: \"We haven't; your policy lapsed two years ago.\"",
        "created_utc": 1463694847,
        "upvote_ratio": ""
    },
    {
        "title": "I am so fucking angry right now.",
        "author": "FlyingGuineaPig",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4k4w4x/i_am_so_fucking_angry_right_now/",
        "text": "So, I'm an insurance agent. I'm a second-tier agent, so I can do anything that's pre-approved, but anything that's a gray area coverage-wise has to go to someone above me. \n\nI get a call. It's one of those repeat callers where the notes are a mess and the customer is about ready to strangle you through the phone, and I look over everything and tell her that we still need to get approval, and I know she's been transferred a lot, but I really need to get her over to someone else.\n\nShe says that she wants me to handle her policy, even if she has to wait on hold indefinitely. So I say sure, place her on hold, and try and consult with tier 3.\n\nIt takes fifteen minutes and forty seconds for me to get someone on the line. I explain the situation, and the agent takes an incredibly snotty and condescending tone with me and asks if I'd bothered to read the notes, because they clearly state that approval has been given and that we can go ahead with the coverage. And I'm honestly surprised, because I'd thought I'd been pretty thorough in reading through all of them, but I tell the agent that that's good to know and I'm gonna transfer the customer now.\n\nSo I do, and I end the call, and then I open the notes because I'm curious what I missed.\n\nAnd discover that a new note has been added, and is time stamped nine minutes ago.\n\n*I'd read all the notes twenty minutes ago, before putting the customer on hold, and it was added nine minutes ago.* It wasn't there when I put the customer on hold. I had no reason to check the notes again while waiting for someone to pick up. I did my fucking job, it only looks like I didn't because the timing was so terrible, but there's absolutely nothing I can do about it now. There's no way for me to get back in touch with that agent and slam her face against the screen and ask her to read the time stamp. There's nothing I can do about the fact that she clearly thinks I'm a waste of space in a headset. \n\nI've worked here for three years and most calls honestly didn't used to bother me. I had the thickest skin this side of the Rio Grande. But I'm pregnant, and there have been two calls now where I teared up because the customer just could not follow directions, and I cannot fucking handle this bitch being rude to me about something that wasn't even there when I looked. \n\nGod, I'm angry. ",
        "created_utc": 1463694085,
        "upvote_ratio": ""
    },
    {
        "title": "so i just brightened a scammers day, and were both the better of for it",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4k44zr/so_i_just_brightened_a_scammers_day_and_were_both/",
        "text": "[deleted]",
        "created_utc": 1463685122,
        "upvote_ratio": ""
    },
    {
        "title": "KARMA IS A BITCH - Facepalm / long post",
        "author": "vkbhuji",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4k0d4r/karma_is_a_bitch_facepalm_long_post/",
        "text": "Just got out of high school in 09, I'm 18 looking for a job etc etc\n\nGot an interview with a call centre in the city &amp; got the job a day later. Cold calling Sales role obviously. Turned up for the first day which was training and went through most of the day pretty happy. Until I got to the live episode training where you get to hear current employees taking calls and stuff. \n\nThe guy I was listening too didn't really get that I as trainee was listening and proceeded to discriminate me and racially vilify who I was, how I looked and how I spoke, jokingly to his colleague that sat next to him in between calls. I told the manager what happened and said thanks but no thanks to that job after the first day. Took it on the chin and went back to job hunting. \n\nA couple of years later I was working as a contractor and I was happy with where I was. At a department store and working a casual job which was awesome.  My manager at the time asked me to do some interviews. \n\nI said fine, third day guy who talked shit walked in and sat down. To be fair I gave him every chance to get that job. But denied after a conversation with my manager and disclosing my conflict of interest. It was the manager who told him via phone why he had not got the job. \n\nEven though I realised that I jeopardised his job search I did it legally. Don't be that guy! ",
        "created_utc": 1463625198,
        "upvote_ratio": ""
    },
    {
        "title": "\"That's Stephen with an EN\"",
        "author": "PreventFalls",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jzqzy/thats_stephen_with_an_en/",
        "text": "So here's a quick blurb of me just trying to confirm the spelling of someone's name.  As call center employees we know we have to verify if Christina is spelled with a CH or  K, if Sara has an H on the end or not and so on.  This was apparently too difficult for this caller today; here's what happened.  \n\nMe: \"Is that Stephen with a PH or V?\"  \nCaller \"It's Stephen with an EN\"  \nShe had simply just said the name again but made sure I knew it had an \"En\"  \nMe \"Ma'am. I still need to know if that's with a PH or a V\"    \n\nIt was only then that I got the spelling out of her and just shook my head at why this was seemed to be such a difficult question.  I suppose I could pass it off as her not paying attention.  ",
        "created_utc": 1463616057,
        "upvote_ratio": ""
    },
    {
        "title": "Family drama leaked over onto the call - not funny",
        "author": "use_more_lube",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jxjx7/family_drama_leaked_over_onto_the_call_not_funny/",
        "text": "I work for big cable, not 911\n\nHad a no good very very bad call last week. Woman was locking down her account (like, my age woman) because the sister who was living with her was getting thrown out due to issues. Didn't want her sister to vengefully mess up the account. \n\nWhile on the phone, sister was yelling. Started with her throwing rocks at the house, then she broke back into the house (she was on the porch waiting for a ride) and started screaming\n\nthen I heard the caller yell \"Put that knife DOWN\" \n\nDid NOT want me to call the police for her - repeated asks, but she was sure. After a tense 8 minutes, which included the sister wandering back out and being locked out again, caller wanted to terminate call to get reinforcements.\n\nWhen I called back 15 min later as she'd asked) things were okay, and the sister was still outside of the home waiting on a ride. Caller thanked me for keeping her calm.\n\ncompletely rattled me \n\nAnyone else have a similar experience? What happened, and how did you handle it?\n",
        "created_utc": 1463589315,
        "upvote_ratio": ""
    },
    {
        "title": "\"They put me on hold for too long so I hung up and I called again\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jx6ss/they_put_me_on_hold_for_too_long_so_i_hung_up_and/",
        "text": "**Me**: \"Thanks for calling XXXXX, my name is sprocket, How can I help today?\"\n\n**Customer**: \"Someone was chasing up my order but they put me on hold for too long so I hung up.\"\n\n**Me**: \"...Ok...sorry to hear that. Can I grab your order number please?\"\n\n**Customer**: \"Its 27374785409212\".\n\nThe previous operator would have had to be calling one of the stores and warehouse and no doubt told the customer it may take a few minutes.\n\n**Me**: \"I am going to have to put you on hold for a few minutes while I call the warehouse and store for you.\"\n\n**Customer**: \"Ok.\"\n\nAnd back on hold they went if they had of stayed on the previous call it would they would have had their answer sooner...",
        "created_utc": 1463585010,
        "upvote_ratio": ""
    },
    {
        "title": "just got my first 0 on a call",
        "author": "furutanimura",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jwyn7/just_got_my_first_0_on_a_call/",
        "text": "i have been working at call centers for almost 3 years now. never have i received a 0 on a call so i am stunned.\n\nand also pissed off at the reason. the reason i got a zero? i didn't hang up on a customer. \n\nnow i haven't listened to the call but at my center we're not allowed to hang up on customers. so now i'm guessing what they mean in that i didn't hang up the phone was that i thought the customer's connection disconnected and so i went about my business waiting for another call to come through. that was until i checked that i was still connected to the customer, gave the dead air spiel,  then hung up. that is the only thing i can think it could be and if that's why i was scored a 0 then that is honestly some bullshit to me. \n\ncan someone please explain giving me a 0 over that makes any sense? am i missing something? ",
        "created_utc": 1463582277,
        "upvote_ratio": ""
    },
    {
        "title": "Every damn day",
        "author": "FlyingGuineaPig",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4juwr5/every_damn_day/",
        "text": "Customer: \"I received a letter telling me to call if something has changed, and absolutely nothing has changed. What do you need?\"\n\nMe: \"Well, if nothing has changed then you should be good to go.\"\n\nCustomer: \"But why did I have to call you?\"\n\nMe: \"You only needed to call if something had changed. Since nothing has changed we don't have anything to worry about.\"\n\nCustomer: \"Now you listen here, you little shit...you come into *my* house...you expect *me* to read instructions...\"",
        "created_utc": 1463544766,
        "upvote_ratio": ""
    },
    {
        "title": "What to do when customers demand questions to answers that don't make any sense?",
        "author": "sumdude10",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jtjm1/what_to_do_when_customers_demand_questions_to/",
        "text": "Customer is asking a question based on a false premise and demands an answer repeatedly. Then tells me I don't know how to do my job. Lol. I almost pulled the ole, \"OK, WELL CAN YOU OPEN YOUR REFRIGERATOR AND REMOVE THE ICE TRAY.\" NOW DROP THE ICE ON THE FLOOR AND MAKE SURE THE FRONT DOORS LOCKED. NOW TURN ON THE RADIO AND TUNE TO 107.4 FOR THE ANSWER. HAVE A GREAT DAY BYE\"",
        "created_utc": 1463524517,
        "upvote_ratio": ""
    },
    {
        "title": "The guy that told me go to f myself",
        "author": "Wizard4877",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jt01j/the_guy_that_told_me_go_to_f_myself/",
        "text": "So I worked in a call center for an online retail company, great company, loved my job, but there are always angry people to deal with, this guy takes the cake though as one of the funniest. It was like a month before Christmas and this guy placed an order and got an auto sent e-mail saying that it had shipped and provided the tracking number. Well the tracking number showed it had delivered a few months ago to Cali and this dude lived in like Tennessee, his confusion is clearly obvious. He had called in once before and our previous rep had spoken to the warehouse and they said that they sometimes recycled tracking numbers and it only takes a day or two to update with the correct info, I knew this to be true. Here's how this went (AC for angry customer, me for me)\n\nME: Thanks for calling COMPANY my name is Wizard4877, how may I help you?\n\nAC: Yea I got a tracking number and it says it was delivered to California a few months ago.\n\nMe: I am SO sorry! I can definitely help you out here, I do see you called before and I'm pretty sure I know what's going on and can have an answer for your, you're NAME right?\n\nAC: Yes I am\n\nAt this point it was going smooth, I call the warehouse, they said they recycle tracking numbers in their system (this I already knew) and it should update by morning, cool, no problem.....right? *SIGH*\n\nMe: Thank you so much for holding, just called the warehouse and they let me know they sometimes re-use tracking numbers, it will update first thing in the morning\n\nAC: I called SHIPPING COMPANY after the last guy said that and they said they don't do that shit, and I believe them so YOUR COMPANY is fucken lying to me\n\nMe: Sir I am very sorry, I understand your frustration but I must ask you to please not use such harsh lang......\n\nAC: And why the fuck are you lying to me too, this is complete bullshit and I am sick and fucken tired of being lied to\n\nMe: Sir, I am very sorry for the misunderstanding but I'm asking that you please refrain from using such lang..\n\nAC: And I'm asking you to GO FUCK YOURSELF\n\nMe: *click*\n\nMy team lead pulled the call and saved it and we would share many laughs about it. You also have to understand he had a thick southern accent and sounded like a salty old man. My TL wanted to hug me after such a rough call and I just laughed and was like \"Meh, no biggie dude, guy was just pissed, bound to happen\"\n\nMoral of the story, swearing at people in call centers can very easily work against you, especially when that person is doing their best to help you and explain a very simple misunderstanding.",
        "created_utc": 1463517492,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling Stuck in Life",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jpgkl/feeling_stuck_in_life/",
        "text": "[deleted]",
        "created_utc": 1463464171,
        "upvote_ratio": ""
    },
    {
        "title": "I just got a coaching position in my call center!",
        "author": "neovo9224",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4joqwi/i_just_got_a_coaching_position_in_my_call_center/",
        "text": "...and I want to make the best use of my time and motivate my team in the best way possible. \n\nI still have to take calls which use up half of my day, the other half I am in the classroom or on the floor mentoring or coaching/training the newer associates. \n\nI thought about offering a reward (candy bar?) each week for the highest ranking metrics on my new-hire team. That way it would be a fun competition between classmates as well as keep their metrics up. \n\nAny other ideas?\n",
        "created_utc": 1463452201,
        "upvote_ratio": ""
    },
    {
        "title": "Let me talk to your supervisor",
        "author": "High_Guardian",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jgavq/let_me_talk_to_your_supervisor/",
        "text": "I'll start off by saying I haven't worked call centers in 8 months. This particular story happened a few days after I was promoted to a \"mentor\" position. As a mentor we walk up and down the aisle answering questions or taking escalations. Generally there are 2-3 mentors at any time. The rule is if an agent gets escalated on a mentor takes it, if a mentor gets double escalated you have a second mentor take it, if it gets tripled one of two things will happen 1. We get to hang up on you, or 2. You get sent to some magical dept where they don't have to adhere to policy.\n\nMy story begins with me walking down the aisles, one of the agents put their hand up so I walk over. \nCX = Customer\n\n&gt;Me: whats up?\n&gt;Agent: he wants to talk to a sup\n&gt;Me: Why?\n&gt;Agent: i dont know he won't tell me anything, he just says he wants a supervisor\n&gt;(by this time I'm jacked into my agents headset)\n&gt;Me: ok tell him you are waiting a on a supervisor and try to get more information\n&gt;Agent: Yes sir, I am waiting on a supervisor while we are waiting can I get your name and email address so we can find your account.\n&gt;Cx: NO! I WANT A FUCKING SUPERVISOR YOU CAN'T FUCKING HELP ME\n&gt;(agent places him back on hold, I take over)\nMe: Thank you so much for holding sir, me name is X. What's going on?\nCx: X!!?!?! Whats your last name!\nMe: I can't give you my last name for security reasons\nCx: Bull shit you want my first and last name but won't give me yours.\nMe: Yes sir, I need your information to find your account to address your concerns\nCx: Yeah but you still won't give me your last name!? You probably aren't even a supervisor! Where are you located\nMe: I can't give you my last name.\nCx: Whats your badge number?\nMe: I don't have one, when we access your account it logs our credentials there, that's how we ensure accountability.\nCx: Bull shit, I want to talk to YOUR supervisor.\n\nBasically put him on hold, got another mentor and continued walking around. When I passed by I could hear the other mentor \"sir I can't give you my last name..\" and the end of it all the other mentor ended up dropping the call, legend says he still calls back to this day.\n\nBest part of the story is, in my company the \"supervisors\" had almost no real permissions over the agents. So whomever picked up that phone first would have been able to help that man.\n\n\nSorry bad at formatting.",
        "created_utc": 1463322500,
        "upvote_ratio": ""
    },
    {
        "title": "\"They don't have last names at call centers?\"",
        "author": "74074",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jduul/they_dont_have_last_names_at_call_centers/",
        "text": "I work for a university helpdesk. I used to think most users were alright people. This woman changed that. Here is how the call went:\n\n**Me**: Hello, thank you for calling **HELPDESK**, this is 74074, how may I help you today?  \n\n**Fuckingbitch**: I'm locked out of my email. I NEED TO CHECK MY EMAIL  \n\n**Me**: *looking at her account, I can see it was disabled by security, probably due to a phishing scam sent out recently that has been affecting a lot of users. It's easy to get it re-enabled, but due to protocol I need the user to watch a 2min video about IT security before I can have the account re-enabled.*\n\n**Me**: Alright, I can see here that it looks like you were locked out by our IT security team. I apologize, this has been happening to a lot of people today. What happens is that security preemptively disables some accounts it has determined to be susceptible to phishing attempts.\n\n**Fuckingbitch**: But it couldn't have been me. I haven't been on the internet this morning.\n\n**Me**: I understand. Like I said security takes precautionary measures and disables accounts it detects as susceptible to phishing. What I can do is re-enable your account for you, I'll just need you to watch a quick video for me and then I'll be able to re-enable it.\n\n**Fuckingbitch**: No, I understand *you*, I'm just troubled by the fact that you don't understand that I COULDN'T HAVE CAUSED THIS!\n\n**Me**: *whatever bitch. Are you you even listening to me?*. Alright ma'am, the website to watch the video is **site**, I'll put you on hold for a few minutes while you watch it.\n\n3 minutes later:\n**Me**: Alright ma'am the last thing I'll need before I re-enable your account is your ID number. \n\n**Fuckingbitch**: You mean I need to give you my ID number!?!\n\n**Me**: *bitch isn't that what I just said?* Yes ma'am it should be right on you ID card.\n\n**Fuckingbitch**: YEAH I KNOW THAT, MOST PEOPLE DON'T JUST WALK AROUND WITH THEIR ID CARD ON THEM\n*That's not true, most users know that we need to verify their credentials, especially when dealing with a security/account issue. She's called before, so she just has a bad memory or is just fucking stupid. I'm going with the latter.*\n\n**Me**:*At this point I'm pissed, so I stay silent* \n\n**Fuckingbitch**: My ID is XXXXXX!\n\n**Me**: Alright great, give me one moment while I re-enable your account for you. *I re-enable it and get back with her within 2 minutes. As is our protocol, her password has been reset to a temporary one that she will be able to login with and later change*\n\n**Me**: Alright ma'am, you account is re-enabled and your temporary password is XXXXXX. \n\n**Fuckingbitch**: OK. I know you said in the beginning but what is your name?\n\n**Me**: Sure, my name is *first name*\n\n**Fuckingbitch**: *10 second pause* Oh, they don't have last names at the help desk?\n\n**Me**: *Panicking slightly, this has never happened to me and I don't want to be reported, even though I was nothing but polite to her throughout the whole call.* No, we do not give out last names for security reasons. (We don't)\n\n**Fuckingbitch**: *In a loud sarcastic tone* WHAT A GREAT WAY OF ENSURING ACCOUNTABILITY. \n\nShe hangs up on me before I get a chance to respond. I'm pissed. I was never disrespectful to her, yet she was determined to treat me like shit the whole time. Bitch do you think I'm in charge or whatever the fuck protocol we follow? And what kind of idiot honestly expects me to give out my last name, especially to someone who has been angry with me for the last 20 minutes? Do you want me to make it easier for you to report me or something? \nFucking bitch. Get over yourself.\n\n",
        "created_utc": 1463271842,
        "upvote_ratio": ""
    },
    {
        "title": "I want to make it through the end of the year. Tips on getting through another six months at this job?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jcsbo/i_want_to_make_it_through_the_end_of_the_year/",
        "text": "[deleted]",
        "created_utc": 1463254436,
        "upvote_ratio": ""
    },
    {
        "title": "When a potential guest tries purchasing a room in the LUXURY section of our hotel and their credit card declines for $2",
        "author": "OvernightSiren",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jclvg/when_a_potential_guest_tries_purchasing_a_room_in/",
        "text": "[and you're just like...](https://31.media.tumblr.com/787d2e21a20c4009410d0ae1286c286d/tumblr_inline_nmgcllPl4y1r8k3ix_500.gif)",
        "created_utc": 1463251689,
        "upvote_ratio": ""
    },
    {
        "title": "'Can you pass me on to someone who can understand me'",
        "author": "zomyns",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4jbtk5/can_you_pass_me_on_to_someone_who_can_understand/",
        "text": "So, quick background; I work for an insurance company mainly focusing on car insurance. I was already having a bit of a rough day (call-wise) however this one completely took me off guard.\n\n    ~ CAPS = SHRIEKING \n\nMe: Good afternoon thank you for call-\n\nC: CAN I GIVE YOU MY VEHICLE REGISTRATION NUMBER\n\n(after 3 solid seconds of silence)\n\nMe: ... Uh of course, what is your registration?\n\nC: *gives the reg in a surprisingly tame fashion*\n\nMe: Thanks for that, so is that 'P' for Papa and 'T' for Tango?\n\nC: What?.. I said *gives registration again - more aggressively*\n\nMe: Okay sir, can I just ask whether you mean a 'D' for delta or a 'B' for brav-\n\nC: WHAT ARE YOU SAYING TO ME??!!\n\nMe: I'm.. I'm just using phonetics as it's easier to interpret which letter you mea-\n\nC: WELL CAN YOU JUST PUT ME ON TO SOMEONE WHO CAN UNDERSTAND ME THEN?!?!? \n\nMe: Yep, sure. \n\n...\n\nPlaced the dude on hold and got him through to our complaints team despite the fact I had literally NOTHING to identify the customer with.\n\nSome people, man.",
        "created_utc": 1463239678,
        "upvote_ratio": ""
    },
    {
        "title": "My coworker set me up to fail today",
        "author": "FlyingGuineaPig",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4j8pfo/my_coworker_set_me_up_to_fail_today/",
        "text": "I'm an insurance agent and I take transferred calls from non-licensed representatives. We recently hired some new people in one of our offices, which is actually in another state, so I've been leaning some new names recently. I will probably never see any of these people face-to-face, I just talk to them once or twice a day for the thirty or so seconds it takes for them to tell me why they're transferring. \n\nI'm gonna call this guy Dumbass.\n\nMy phone rings, the agent's name pops up, and I answer it.\n\nMe: \"Hey, Dumbass- am I saying that right? This is FlyingGuineaPig, how can I help you?\"\n\nDumbass: \"Yeah, you got it. I've got policy number 666-420 here and this guy wants to know why his premium went up.\"\n\nMe: \"Okay, put him through.\"\n\nDumbass then conferences the customer into the call.\n\nDumbass: \"All right sir, thank you so much for holding. I've got FlyingGuineaPig here and she's gonna be assisting you further.\"\n\nCustomer: \"Hopefully she'll be assisting me with a 100% refund.\"\n\nDumbass: \"I would hope so, sir. I'll go ahead and put you through, you have a great day.\"\n\nWHAT??!?! NO!!! DID DUMBASS SERIOUSLY JUST IMPLY I'LL GIVE THIS GUY A HUGE FUCKING REFUND?!?!? WE DON'T *DO* HUGE FUCKING REFUNDS!!!!\n\nIt turned out the man's policy was actually listed incorrectly, so he ended up with a lower premium once I'd fixed it, but FUCK. If the price had been accurate, I'd have been SIGNIFICANTLY MORE SCREWED THAN NECESSARY.\n\nWHAT THE HELL, DUMBASS!?!?! NOT COOL.",
        "created_utc": 1463177769,
        "upvote_ratio": ""
    },
    {
        "title": "Lets Do This!!!",
        "author": "DMVman",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4j64cy/lets_do_this/",
        "text": "Its Friday the 13th, its raining, we were just advised of new fines we have to tell people about and its the kind that people will definitely argue about( ohh joy) and I work at the DMV.\n\nLETS DO THIS!!!",
        "created_utc": 1463143142,
        "upvote_ratio": ""
    },
    {
        "title": "How many calls per hour are you required to take? (Web hosting / tech support only)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4j5viq/how_many_calls_per_hour_are_you_required_to_take/",
        "text": "[deleted]",
        "created_utc": 1463138729,
        "upvote_ratio": ""
    },
    {
        "title": "\"OH, NOT AGAIN!\"",
        "author": "FlyingGuineaPig",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4j3xnc/oh_not_again/",
        "text": "I'm an insurance agent. For some reason, that means tech support for our website falls to me. Non-licensed people are legitimately not allowed to provide tech support. No idea why.\n\nSo I get a transfer, this woman who was getting an error about her date of graduation being incorrect. Really fucking common mistake; the question isn't \"Are you a graduate?\" it's \"Are you a RECENT graduate?\" A surprising number of people miss the \"RECENT\" part.\n\nMe: \"Okay; so, that question doesn't want to know your graduation *date* it wants to know if you qualify as a *recent* graduate. You can just say \"No, I'm not a recent graduate,\" and it'll stop asking you.\"\n\nCustomer: \"But it wants my graduation date!\"\n\nMe: \"Yes, but only because you told it that you were a RECENT graduate. Since you're not a RECENT graduate, just tell it no and it'll let you continue.\"\n\nCustomer: \"But it says my graduation date is wrong!\"\n\nMe: \"Yes, because it's not a *RECENT* date. The question was, \"Are you a *RECENT* graduate?\" Since you're not a *RECENT* graduate, you can just tell it no and it'll stop asking.\"\n\nCustomer: \"But it won't take my graduation date!\"\n\nThis went on for far longer than was necessary until she eventually hung up on me. Then I got another transfer.\n\nNon-licensed agent: \"Hey FlyingGuineaPig, I have this woman here who says the website won't take her graduation date. Her name is FuckListeningSkills, and-\"\n\nMe: \"OH, NOT AGAIN! SHE CAN'T FOLLOW- SHE DOESN'T- CHRIST- JUST PUT HER THROUGH. PUT HER THROUGH.\"\n\nNon-licensed agent: \"...Okay. Sorry.\"\n\nIt didn't get any better the second time around.\n\nMe: \"Just hit \"no.\" Change you answer to \"no.\" Scroll up one question and say \"no.\"\n\nCustomer: \"But it keeps flagging my graduation date.\"\n\nMe: \"JUST SAY \"NO.\" LIKE D.A.R.E. TAUGHT YOU. SAY \"NO.\"\"\n\nCustomer: \"It just doesn't like the date. Am I formatting it wrong?\"",
        "created_utc": 1463101713,
        "upvote_ratio": ""
    },
    {
        "title": "That's just your opinion",
        "author": "Jabber_Tracking",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4j2us8/thats_just_your_opinion/",
        "text": "CALLER: Can I pay my credit card bill with gift cards?\n\nME: I'm sorry, sir, but we cannot accept gift cards as payment towards your balance. We accept payments made online and with a live rep using your checking account, we accept debit cards, and we accept both mailed checks and mailed money orders.\n\nCALLER: But I really want to pay with my gift card.\n\nME: I'm really sorry, sir, but we cannot accept a giftcard. There is literally nowhere in the computer system to even enter a giftcard code, let alone have the system run it as payment.\n\nCALLER: I understand your *opinion* on this, but I want to talk to a manager.\n\nME: Absolutely, sir. One moment while I transfer you to a manager.\n\nOpinion. He understood my *opinion* on the matter. It's sometimes such a struggle to not share my actual *opinions* on matters like these.",
        "created_utc": 1463086958,
        "upvote_ratio": ""
    },
    {
        "title": "\"You don't need that information to help me\"",
        "author": "SinceIWasYoung",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4j2rdy/you_dont_need_that_information_to_help_me/",
        "text": "I work for a large TV and Broadband provider, who shall henceforth be known as **company**.\n\nCustomer (who shall from this day onwards be known as *Cap'n Cunt*) calls in looking to cancel his account. Now, usually, an automated concierge asks customers to enter their account number or home telephone number, so we can find their account. Sometimes customers, for whatever reason, don't do that, so we have to find them manually. This is one such instance;\n\nSIWY: Good evening, thank you for calling **company**, how may I help you?\n\nCap'n Cunt: Yes, I would like to cancel my account.\n\nSIWY: Certainly I can help you with that, do you mind if I ask why you're cancelling?\n\nCap'n Cunt: I do not feel I need to provide that information to you, nor do I wish too.\n\nSIWY: Okay sir, I respect that, if you don't wish to discuss your reasons that is absolutely fine, but I will need to ask you a few questions to get access to your account, as I don't have any account information in front of me... Can I take your account number?\n\nCap'n Cunt: No. You don't need that.\n\n(At this point I think he just means I don't need it to find him, \nwhich is true, it's just much easier). \n\nSIWY: Okay, I can see you are dialing from an anonymous number, so can I take your phone number instead please?\n\nCap'n Cunt: I do not feel comfortable disclosing that to you at this time and I do not feel you need this information.\n\nSIWY: Okay, how about your postcode and address?\n\nCap'n Cunt: You do not need that information. Is all this really necessary, I simply wish to cancel my account.\n\n(now, at this point, our search function can only find people using these three methods, there is literally no other way. Not even by name... So if he won't give me at least one of these I can't even *find* him, never mind help him.)\n\nSIWY: I'm afraid it is, unfortunately without this information, I cannot find you on our system, so cannot access your account to assist you further, additionally some of those details will be required, among a few others, to verify security and that I am speaking to the account holder.\n\nCap'n Cunt: You're speaking to me! I want to cancel! You are stopping me doing that, therefore, you are a problem! I am an ARMY VETERAN! I was a CAPTAIN!. You know how we deal with problems in the army? You don't want to know! NOW CANCEL MY FUCKING ACCOUNT.\n\nSIWY: Okay sir, thank you for your service, but I will ask that you do not swear down the phone to me, I am trying to help you, but I can't if you won't provide any information.\n\nCap'n Cunt: I am giving you notice to cancel! I expect to find my account cancelled by TONIGHT! If it isn't, me and your superiors will be having words, boy! \n\n(obviously I cannot cancel him as I can't find his damn account, but it is also a minimum 31 day cancellation period. The only way it is **not** a minimum 31 day period is if the account holder is dead. Even then it's still 3 days, so even if I could find his account, I wouldn't be able to have it cancelled by tonight)\n\nSIWY: Okay, I will need to get access to your account, I will need some information to do that, can I take your postcode please?\n\nCap'n Cunt: By the end of tonight. You have been warned.\n\n*click*\n\n",
        "created_utc": 1463085757,
        "upvote_ratio": ""
    },
    {
        "title": "ID card Insanity",
        "author": "TheDrachen42",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4j2a3p/id_card_insanity/",
        "text": "Some background, insurance ID cards have an NAIC code on them that identities the insurance company that issued it. I work in customer service for an insurance company.\n\nI had a guy call in today saying \"My son just called in and requested something be sent, I want it sent now.\" I asked to put him on hold so I could look I to the request, since I wasn't on the prior call. I had to ask 3 times because he was too busy insisting I do whatever he needed NOW. \n\nI reviewed the request submitted by the prior rep. His son had requested ID cards be manually typed up and sent including the NAIC code. I thought it an odd request, since the ID cards we automatically send have the NAIC, so I looked at the ID cards we issued yesterday. They had the NAIC, right where it should be. \n\nSo I got back on the phone with the caller and told him that all the ID cards we sent have the NAIC on them. He insisted some of them did not, and then asked me which ones didn't. I insisted they did, and round and round we went. Seeing no other way out of the spiral, I agreed to send, right now, ID cards including the NAIC, and sending what he already had. I at no point stated the NAIC was not on the cards he had.\n\nHe was happy with my promise to fulfill his request, so I ended the call with \"anything else I can help you with?\" To which he replied \"Next time obey the law and put the NAIC on the cards!\"\n\n*face palm*",
        "created_utc": 1463079831,
        "upvote_ratio": ""
    },
    {
        "title": "I turned my ringer off",
        "author": "Ihavesomethingtosay9",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ixg0f/i_turned_my_ringer_off/",
        "text": "I just can't handle that stupid ringing. My phone flashed when I get a call, so I can still see my calls.\n\nBut I swear that ringer just raises my blood pressure. I tried changing it which helped for one day. The next day, it was irritating. \n\n",
        "created_utc": 1463004529,
        "upvote_ratio": ""
    },
    {
        "title": "We don't sell food sir.",
        "author": "burst_bagpipe",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ivs09/we_dont_sell_food_sir/",
        "text": "My first job in a callcentre and i had been been there a few months and was gettin used to how everything worked etc.\n\nI was training new starts for a company that has the same name as our favourite dish. \nWe were used to people prank calling up looking for home deliveries. For Tikka Marsala, Lamb Bhoona, Biryani etc.\n\nOne day I finish a call and the list is empty, Woo Hoo.  I start tuning into what's goin on round about me when I hear a colleague say:\n\n'We don't sell food sir'\n\nI immediately tuned in thinking it was a prank caller. \n\nI guess the customer said something as she said and I quote\n\n'Are you shitting me or what, a raspberry pie! Piss off! \n\nI almost fell off my chair trying to get to her while laughing my ass off. I took over the call and got it sorted. The new start still didn't believe what a raspberry pi was when she left 2 weeks later.\n\n\n\n",
        "created_utc": 1462984515,
        "upvote_ratio": ""
    },
    {
        "title": "Advice, please: Advancing or Moving to an Offline Role in my CC.",
        "author": "ralphwiggumsdiorama",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ivr4l/advice_please_advancing_or_moving_to_an_offline/",
        "text": "I have been working in call centers for 13 years - telemarketing, inbound customer service, sales, collections, quality control. I am in a great CC now, but I'm starting to hit burnout dealing with customers all day on the phone again.\n\nOne of my major goals is to get into an offline role or advance into leadership. I speak well, I have no disciplinary action, performance is good, I'm making a couple of good connections here, a good attendance record, and I've been in my CC for about three months. I've made my desire to move offline or advance to our management here, I volunteer with company events, and I participate in our ladies' leadership group and have even done webinars for our customers.\n\nDo you guys have any advice for me to help break this barrier, please?\n\nThank you!!",
        "created_utc": 1462984228,
        "upvote_ratio": ""
    },
    {
        "title": "Cubicle neighbor is a weirdo",
        "author": "Quongfu",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ivl8m/cubicle_neighbor_is_a_weirdo/",
        "text": "So I've been working at this company about a year. Longer than most the other reps around me (high turnaround at this place). About a month ago they moved this girl next to me. I was friendly and professional and introduced myself. Since then I have not spoken with this person hardly at all and I see her every day. The training for reps at this place is not all that great so there is a lot of reps asking each other questions. A lot of the other reps come to me with questions and I have no problem helping them. No complaints at all. But this girl refuses to ask me for help. She will ask every one around me for help and if she can't get an answer will call a manager. This kind of bothers me for some strange reason. I feel like it lowers my value at this place when she asks another person, that I basically trained, for help and will not even ask me as a last resort and instead call a manager? She knows I am willing to help because at times I will just blurt out the answer to her question when nobody else is able to help and she will not even say thank you. I hate to say it but I think it is because I am Asian she does not like me or is scared of me or something but there really is no reason for that at all. \n\nEdit: I don't know why anyone would down vote. Down vote for wanting to help some space case from bizzaro world. Oh well. ",
        "created_utc": 1462982234,
        "upvote_ratio": ""
    },
    {
        "title": "NO SIGNAL!!!!!!",
        "author": "Stinkycat1",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4iuuss/no_signal/",
        "text": "Rant.\n\nMy internets not working.   Ok.    Everythigns up and running - no issues reported on my end and looks 100% perfect.     Did the usual reboot.. NO ITS NOT WORKING!!!!\n\nOpen up a webpage.. I cant!  My internet is not working!!\n\nDo you have windows?  I dont know.    Do you see any icons on the bottom right?  No.     It just says NO SIGNAL.\n\nIs it a completely black screen with no signal? YES!! MY INTERNET IS NOT WORKING!\n\nMam - your internet IS working - your monitor however is not.  WHAT!! I JUST PAID $3k FOR THIS ITS NOT MY COMPUTER!   IT CLEARLY SAYS NO SIGNAL.\n\nSo she goes in a rant of how inept I am and hangs up -  I feel bad for the next agent.   Tried to get her to check her cords to her computer make sure the computer is turned on, etc.    No avail.    NO SIGNAL!!",
        "created_utc": 1462972734,
        "upvote_ratio": ""
    },
    {
        "title": "Those that lasted less than a year. What and when was your breaking point?",
        "author": "pangsiu",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4itqmt/those_that_lasted_less_than_a_year_what_and_when/",
        "text": "Working for a major bank in Canada. 5 months in and I dread going to work everyday.  I hate the micro management,  AHT ands ACW makes me feel like I'm constantly being watched,  shitty hours (4-12) etc . I can't sleep. \n\nI've been ranting to my friends and wife but they all said I should at least ride it out to a year before consider quitting since it'll look bad on my resume..  I don't think I can last that long. No current luck with job hunting either so I'm stuck in this soul sucking environment. .\n\nI'm currently writing this at 3 in the morning because I just can't sleep...",
        "created_utc": 1462950115,
        "upvote_ratio": ""
    },
    {
        "title": "\"You keep saying that word. I do not think it means what you think it means.\"",
        "author": "Jabber_Tracking",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4it4j4/you_keep_saying_that_word_i_do_not_think_it_means/",
        "text": "1) To the man who insisted that, as we had been sending him notices of an unpaid bill, he would sue us for *\"defamation of character and loss of sleep!\"*:\n\nThat's an average Tuesday night to me, dude. Put your money where your balls are. Also, have fun convincing a lawyer that mailed notices, in sealed envelopes, are somehow \"*defaming\"* you. \n\n2) To the lady who said \"WHY ARE YOU TAKING SO LONG, I DON'T WANT YOU TO READ THE SCRIPT - OH GOD, FINE, READ THE GODDAMN SCRIPT HURRY UP-\" \n\nI hope you enjoyed my impression of the Matchbox Cars commercial dude. I also hope you enjoyed the waste of five minutes it was for me to have to repeat that script TWICE, because I began speaking so fast you couldn't understand me. \n\nBut hey, you wanted me to hurry.\n\nSomeone this morning mentioned it was a bad day for call days. Hats off to you - you were right. ",
        "created_utc": 1462938380,
        "upvote_ratio": ""
    },
    {
        "title": "Crying at work.",
        "author": "fulanitadetal",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4it0b5/crying_at_work/",
        "text": "I've cried a lot at work. I have been in some sort of customer service related job but this is my first call center. The first time I cried, I had to hide in the bathroom until I could calm down. I took a call where the guy was escalated to the point of cursing at me and calling everyone at the company retarded. A supervisor wouldn't take the call from me until I had tears rolling down my face. The second time was later that day when I couldn't figure out why the call kept getting kicked back to me after transferring to another department. I thought I grew a thick skin since then until today. I had back to back calls where I had to let clients know the work wasn't processed because of a missing document or their notes weren't clear. On both occasions I was cut off while trying to figure out a solution or they said how stupid my company is and asking how can it remain in business. It was all I could take. I genuinely like helping people. I think my job is important and I do my best at handling tough situations. I just don't know how much more I can put up with. Any advice on how to get a grip? Am I just not cut out for this type of work? I hate crying over pettiness but it's really wearing me down. ",
        "created_utc": 1462936495,
        "upvote_ratio": ""
    },
    {
        "title": "Quit my Job",
        "author": "charlesrahl",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4iqe30/quit_my_job/",
        "text": "I was having one of those days. I had already decided that I was going to switch jobs in about a month after this school semester is over and my company had reimbursed me the money I had paid to take classes. \n\nI have been doing this for over a year, taking eighty calls a day, sometimes as many as a hundred and thirty. It has been a never ending stream of back to back phone calls caused by some shoddy business practices and poor communication between the company and its customers.\n\nToday, however, was not a period where we had a company wide issue. I don't know if it was something in the water, I checked the moon chart and it wasn't a full moon, maybe a ton of people had someone piss in their cornflakes that morning. My day started with a woman who refused to verify her account because I wasn't the one who was going to be helping her, continued with people just generally talking to me in the most rude and condescending way possible, and culminated in my last call.\\\n\nThe gentleman started out the call by immediately saying that he had already called the BBB and was going to contact the attorney general next if these phone calls from us didn't stop, with foul language and curses galore. Ignoring, his dirty mouth and invective I decided I would at least check out the account. After acquiring his verification info I accessed his account and the notes say that his account his thirty days past due. I attempted to inform him of this but he cut me off yelling about how he isn't past due and will sue all of us because someone told him he just needed to make one more payment to cancel out his account. \n\nTo be fair I did notice that he was in the process of cancelling, but our business requires a contract (home security) and we also require thirty days notice if you are going to cancel, crappy policy but it is outlined in the contract that the customer signs. So I inform him that once he has made the payment for the balance of the contract his account will no longer show past due and he will stop receiving phone calls. This isn't good enough. He explodes saying he isn't past due and hasn't missed a payment and he already switched companies and blah blah blah. Won't let me get a word in edgewise. \n\nOh I forgot the best part, throughout the whole call he has been asking to speak with a supervisor, no demanding to speak with a supervisor, interrupting me as I'm trying to help him. So eventually I just flat out asked him why he was refusing to let me help him, and surprisingly he let me explain after that.\n\nHonestly, I have a way to make the collections phone calls stop, but I wasn't going to do it for that jackass. After that call, I threw my headset on my desk, cleaned out my desk, and walked out. It's okay though, this gives me the time to study for my Network+ certification, and I have also decided that I am going to move from Dallas to Houston to be closer to my girlfriend. ",
        "created_utc": 1462901855,
        "upvote_ratio": ""
    },
    {
        "title": "I don't even want to work here. Lay me off.",
        "author": "Daddykong11",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ipucj/i_dont_even_want_to_work_here_lay_me_off/",
        "text": "I called out sick 5 days in a row last week. It is obvious I wasn't sick. Honestly I hate this job and want to get laid off. They won't do it though and it just shows how crappy this job really is. They can't find someone else that actually wants to do it. Fuck this place and it's shitty benefits. 5 fucking vacation days a year give me a break. No 401k. I gonna go in the bathroom and piss all over the floor.",
        "created_utc": 1462895313,
        "upvote_ratio": ""
    },
    {
        "title": "Conferences: yes, they suck to deal with, so lets make things easier for each other.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4im7pp/conferences_yes_they_suck_to_deal_with_so_lets/",
        "text": "[deleted]",
        "created_utc": 1462834121,
        "upvote_ratio": ""
    },
    {
        "title": "I broke down at work today.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4il4es/i_broke_down_at_work_today/",
        "text": "[deleted]",
        "created_utc": 1462820645,
        "upvote_ratio": ""
    },
    {
        "title": "He went from being ridiculous to feeling ridiculous.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ik1js/he_went_from_being_ridiculous_to_feeling/",
        "text": "[deleted]",
        "created_utc": 1462807496,
        "upvote_ratio": ""
    },
    {
        "title": "He went from being ridiculous to feeling ridiculous.",
        "author": "kitjen",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ijzbl/he_went_from_being_ridiculous_to_feeling/",
        "text": "When I worked at an online banking help desk this guy called up and introduced himself as Mr Christopher Stokes (not his real name in case there are rules against naming, but similar enough to get the idea of the story.)\n\nIn a very serious tone he answers my \"how can I help?\" with \"I have logged into my online banking and I can see someone else's account.\" Now that's a huge problem so I take him very seriously and start gathering more information. He tells me he can access the balance of this account and view the transactions; it even appears he could transfer funds out of it into one of his other accounts. So I ask what name appears on the account. \n\n\"The name on the account is Mr Christopher Stoke.\"\n\nCue a slight pause. \"Mr Stokes, I think that might be your account.\" And that's when I realise he knew it was his account but wanted to exaggerate the severity of the situation for his own amusement. He starts telling me \"it can't be my account, my name is Mr Christopher Stokes, this says Mr Christopher Stoke. I don't know a Christopher Stoke, I'm Christopher Stokes.\"\n\nI explain that there's clearly been a slight error and the 's' has been accidentally omitted from the end of his surname. Then he got unnecessarily nasty but I'm glad he did because I hadn't quite finished explaining. He's calling me stupid, the bank stupid, my colleagues stupid all because we couldn't get his name right. So I finish what I was about to explain to him. \"Mr Stokes, I can see from our records that we hold your name correctly, it's Stokes on all our systems. As this is your online banking, you've amended the account name yourself using the option called I Name This Account (the account name he described was actually Mr Christopher Stokes bills account, the bank don't name accounts like that). But when you've changed your name online, you've spelt your name wrong. But what you can do is change it again online but this time, don't forget to include that last 's' on your surname.\"",
        "created_utc": 1462806730,
        "upvote_ratio": ""
    },
    {
        "title": "I can deal with elderly people. I cannot deal with assholes. (Alt. title: Tiny victories can be the sweetest)",
        "author": "crunchym8",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ijusq/i_can_deal_with_elderly_people_i_cannot_deal_with/",
        "text": "I work as a Call Center agent. We are a multi-account call center, and I work on one of our most popular accounts in the building. It's one of those TV networks that shows jewelry and stuff and markets to old people to swindle them out of their retirement money. It's not glamorous, but it pays the bills. Anyway, I had a particularly bad call today. First, some setup.\n\nToday I was in the break room with a few co-workers of mine. We were chatting it up and having a good time, delaying the inevitable dread we all had of getting back on the phones. We were talking about some rather nasty calls we had the past few days, what with Mother's Day coming up. One of my co-workers offhandedly remarks how hell the next few days are going to be, seeing as how we sold a LOT of Gift Cards over Mother's Day Weekend.\n\nI sweat a little as I head to the phones. My shift is about to start. According to the screens in the front of the building, we're in queue by about 60 calls- so we were gonna be busy. I sit down, pull on my headset, and get prepared for the day, and put myself in \"Ready\". A call immediately pops. I check the phone to see what intro scripting I'll be using, and I barely get to mutter anything before I'm cut off.\n\n**Me:** \"Thank you for calling (blank) My name is-\n\n**C:** *shushes me* \"Don't interrupt your elders! Show some damn respect! I want dat wing dats on the scween now.\"\n\n**Me:** *Stunned silence for 1.5 seconds*\n\n**C:** Are you dere??? HELLO\n\n**Me:**  \"Yes, I apologize. I was just pulling the item up. So what size-\"\n\n**C:** \"You SHOULD be sowwy making an old girl wait!!\" *laughs loudly*\n\n**Me:** \"Er, right yes. So what size would you-\"\n\n**C:** \"Is dat WEAL emewold? Or was it made in a lab?\"\n\n**Me:** \"It's real Emerald, ma'am. We make sure to mention whenever we use synthetic jewlery.\"\n\n**C:** \"I thought so. You can always tell WEAL emewold from fake by lookin' at it!! SIZE ELEVEN PLEASE\" *this last part was basically screamed*\n\n**Me:** *Looking at the screen, the size eleven had been out of stock since before the call initiated.* \"I'm sorry ma'am, but this size is out-\" \n\n**C:** \"DONT TELL ME ITS OUT OF STOCK\"\n\n**Me:** \"I'm sorry ma'am, but this item is currently unavailable in that size. We do have it in size Ten, however.\"\n\n**C:** \"YOU SHOULD WESPECT YOUR ELDERS OH MY GAWD when i called that wing was IN STOCK YOU just took too long to get it!!!\"\n\n**Me:** \"I do apologize ma'am, but-\"\n\n**C:** \"Take it off of someone else's order I NEED DAT WING\"\n\n**Me:** \"I'm sorry ma'am, I cannot do that. That would be unfair to them.\" *She starts speaking, but I speak over her here* \"You can always try calling back in thirty to forty-five minutes to inquire about this item being restocked, as we'll have an answer for you then.\"\n\n**C:** \"DONT TALK OVER ME\"\n\n**Me:** \"Is there anything else I can assist you with today?\"\n\n**C:** \"I'M NEVER FUCKING SHOPPING HERE AGAIN BECAUSE OF YOU YOU ARE AN AWFUL EMPLOYEE-\"\n\n**Me:** *Cutting her off* \"Alright, well thank you so much for calling (Blank) and you have a wonderful day!\"\n\n**C:** \"YOU DID IT AGAIN YOU FUCKING CUT ME OFF I WANT TO SPEAK TO-\"\n\n**Me:** \"Ma'am, we have a low tolerance rule for swearing- Due to the nature of this call, agent is disconnecting.\" *Hangs up*\n\nNormally that rule is only in effect if they're swearing *at* the agent, but I decided that I'd rather risk getting pinged than have to put my supervisor through that screechy bitch. I just wanted to share this tiny victory that I had of hanging up on an elderly psychopath who surely should not be allowed within 15 ft of a phone.  \n\nGood luck out there to the rest of you!",
        "created_utc": 1462805122,
        "upvote_ratio": ""
    },
    {
        "title": "When customers try to circumvent logic and it backfires...",
        "author": "ToneOfARCADIA",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ihwcl/when_customers_try_to_circumvent_logic_and_it/",
        "text": "Day 2. Im back.\n\nI had a customer in San Francisco who wanted to get to New York. Well, the only problem is the tickets the guy was finding were too expensive for the date and time he wanted to travel. Sidenote: for those of you who dont know, the price of a seat on a flight depends on the inventory available, so based on how many seats are left on a particular flight it may be more or less expensive at a different time. More seats = less expensive. Closer to the day of departure = less seats = higher price. Whatever.\n\nSo this extremely intelligent chap decided to circumvent the logic and find a less expensive trip from San Francisco to Toronto Canada, that connected through New York. He will just get off the flight, and never get on the connecting flight, giving up the rest of the trip. People do this all the time, but theres an art to it...\n\nHe also checked bags.\n\n\nSo imagine the verbal abuse my dumb ass I had to endure when he brings to my attention that not only did he already check his bags, which are in route to Toronto(they'll send them back, but he'll have to pick them up at the airport), but they wont let him board his flight...because he doesnt have a passport.\n\n\nSo now I have to explain to him, why its my fault that he wasnt notified that Canada constituted as \"international travel\" and why he couldnt just \"get off\" halfway through the flight. Where this information was on our website (ie: common sense isnt common) and why even if it was on the website... why he was allowed to check baggage. So completely shifting the responsibility to justify the many mistakes he made in this entire ordeal.\n\nEven if this was possible, dude, your bags go from origin to destination on a connection.\n\nTheres literally nothing I can do to help people who dig a hole so deep that nothing you can possible say to them makes up for the inconvenience thats already been caused, and yet, I'm still shamed by the passenger for not coming up with a viable solution for their issue.\n",
        "created_utc": 1462765654,
        "upvote_ratio": ""
    },
    {
        "title": "An open letter to the embodiment of First World Problems.",
        "author": "use_more_lube",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4id982/an_open_letter_to_the_embodiment_of_first_world/",
        "text": "Dear angry, wealthy, nasty lady- \n\nWe don't have 4k cable boxes, because there are not any broadcasters who have 4k programming. No, [competitor's company that rhymes with fish] won't have 4k either, because there aren't any broadcasters who have 4K programming. Basically, if someone shits in the village well, it doesn't matter what bucket you use, you're still drinking shit. \n\nPerhaps a poor analogy, but after a day of talking to many people who are just wonderful to help and to speak with,  you're kind of like a warm mouthful of soupy manure. The chunky kind. \n\nBut I digress... back to the broadcasters; some don't even have HD. \n\nSo, go ahead and get that 4k TV but understand that the best you'll get from cable in the next (guesstimate) 3 years is HD. \n\nHappy shopping.",
        "created_utc": 1462681621,
        "upvote_ratio": ""
    },
    {
        "title": "My credit card didnt go through did it? Who knows, let me just try 3 more times.",
        "author": "ToneOfARCADIA",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4id5k9/my_credit_card_didnt_go_through_did_it_who_knows/",
        "text": "So I work for an airline call center and our ticketing isnt instant for \"non urgent\" travel ie: something not within the next 2 hours. It can take generally between an hour to a few hours for the reservation transaction to \"pull\" from the customers CC. I commonly tell passengers that they should receive the ticketing confirmation \"within the hour\" so they dont start bombarding me with unnecessary questions.\n\nIts not uncommon for a passenger to do the reservation themselves on our website and for whatever reason click submit multiple times, or go through the process so fast they dont realize that they completed it and make yet ANOTHER reservation. I dont know WHY people dont just check their bank app to double check or call us back to verify theres a reservation on queue for ticketing but whatever. We will refund a \"double booking\" 100% of the time so its no big deal...unless...you not only make the same reservation multiple times, but you do them on multiple airline websites...\n\nSo..that sets up this beautiful story. Let me give you the bullet points:\n\n-Lady makes reservation online. She isnt sure if it went through.\n-She makes another reservation\n-She makes ANOTHER reservation\n-She gives up and books another reservation, WITH A DIFFERENT AIRLINE\n-They all come through simultaneously \n\n\nSo one reservation timed out. The first one. But the other two go right through, and the third one from the different airline goes through as well.\n\nAs you can imagine, she calls, furious that our website \"is misleading and makes things difficult\" and \"she was scammed into purchasing multiple tickets\"\n\nSo I instantly offer to refund one ticket out of the two tickets and she goes, \"no. I already booked with another airline. I want a refund for both.\"\n\n\"I'm so sorry ma'am but that isnt an option since we dont offer refunds on non-refundable tickets.\"\n\nShes PISSED.\n\n\"If a reservation is accidentally double booked then thats a special circumstance where we can go ahead and override the policy. But this definitely doesnt extend to other airlines.\"\n\nShe goes, \"are you fucking kidding me? My rent is due, and this is NOT going to work. This isnt acceptable so you need to get someone else on the phone\"\n\nThe thing I really love about my particular job function is that as long as I stick to the policy I have verbiage freedom to tell customers \"no\" no matter how much they scream and shout. And when they ask to speak to management, I warm transfer the call and let them know what went down so they back me up. So sure I'll let you speak to my supervisor, but I'm about to trash your ass so the supervisor taking over the call is already ready for the bullshit youre about to pull. And I always mute my line and stay on the call to listen to them get fucked.\n\n\n\nSo my morning was glorious as I listen to some entitled bitch, cry about how she wasnt going to be able to pay her rent because she was screwed out of her money by a terrible company and she was going to call the bank and dispute the transaction.\n\nI'm sure she doesnt know that the credit card companies call us to verify these instances where customers dispute charges, and once we tell them they want a refund on a non-refundable ticket. Its all over.\n\n\nEnjoy your day, idiot.",
        "created_utc": 1462679509,
        "upvote_ratio": ""
    },
    {
        "title": "Mother's day venting/advice",
        "author": "Wookie-dog",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ich10/mothers_day_ventingadvice/",
        "text": "I have to work tomorrow and am dreading it. My mom passed away when I was in high school and mothers days have always been rough, but last year was my first one working at a call center, and people are just so horribly oblivious. \n\nI remember a woman lecturing me on how I needed to treat my mother nicely and do something extra special for her that day last year. I'm fine with the \"happy mothers day!\" greeting and such, but what makes people decide they need to tell someone else what to do on certain days. They mean well, whatever, it still doesn't stop me from going in offline because I'm trying not to cry from Ms. Oblivious Customer's \"treat your mother right this year because you don't know how many more there might be\" or something else along those lines.\n\nI'm so tempted to respond, \"Thanks, I put some flowers on her grave this morning,\" but just say \"ok have a good day, bye.\"\n\nDoes anyone else have serious triggers on holidays that customers tend to set off? How do you deal with them? I'm already taking antidepressants, mood stabilizers and anti-anxiety pills, so medicine won't help this time, and I feel like I'd be in trouble if I poured vodka into my water bottle, haha. \n\nSeriously though, any advice on how to get through tomorrow would be amazing. I have fmla for emergencies but I need the money so would rather not use time.\n\nSorry for the longish rant, and solidarity to all my fellow phone jockeys!",
        "created_utc": 1462667121,
        "upvote_ratio": ""
    },
    {
        "title": "Here is what you should have done (Long)",
        "author": "SinceIWasYoung",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ibrcv/here_is_what_you_should_have_done_long/",
        "text": "Work for Large ISP who, from here on out, shall be called **large ISP** (imaginative, I know). Customer calls in, henceforth she shall be called **Lady**.\n\nRight from the bat, she is obtuse, obstructive and rude. She does everything in her power to make the call difficult and makes persistent demands. This is only *part* of the call. This went on for over an hour, with her insulting me and swearing at me constantly, and rejecting any offer of help or reasonable resolution...\n\nSIWY: 'Good evening, thank you for calling **large ISP**, you're through to SinceIWasYoung, how may I help you?\n\nLady: Cancel my account. I don't want any help. I don't want you to do anything. Just cancel it, understand?\n\nSIWY: Okay, I'm happy to help you with that, but we need to go through some security questions first.\n\nLady: I don't want to do that. Cancel my account.\n\nSIWY: I appreciate that but it is a legally required piece of compliance, I cannot progress the call without verifying who I am speaking too.\n\nLady: No. I work as a legal assistant. It isn't a law anywhere that I know of. Cancel my account.\n\n(Need to assist a bit more often then, because there definitely 100% is).\n\nSIWY: Be that as it may, I have compliance guidelines to follow. Can I take your name please?\n\nLady: (very, very loud and deliberate extended sigh). Whatever... (proceeds to give details).\n\nSIWY: Thank you for that, now do you mind if I ask why you are cancelling?\n\nLady: I do mind, yes.\n\nSIWY: Very well, however I have to state to you that you are in a contract until late November 2016, and there are only certain circumstances that allow you to pull out of this contract early. I need to verify your reason, otherwise I cannot adequately assess whether this is such an instance.\n\nLady: I am cancelling because you are shit. Everything about you is shit. Your product is shit. Your service is shit. Your advisors are shit. Does that help you assess? Good (she didn't wait for an answer), now cancel. \n\nSIWY: Okay, I'm going to ask you not to swear on the call to me, thank you, I am only trying to help. However, the reason you have given does not qualify. I see your service is up and running and shows as fully functional with the minimum required download speed, therefore we cannot cancel your account early in these circumstances.\n\nLady: I will swear if I wish, thank you very fucking much.\n\nSIWY: And I will disconnect the call, if you persist, thank you very much. (I was getting annoyed now).\n\nLADY: I don't care. I want to cancel, I have given my notice. Now cancel me. Today.\n\nSIWY: I cannot do that, as I explained. You signed and agreed to a legally binding contract. I can put in a pending cancellation for November, I am happy to do that for you, but I cannot cancel before then. However, I would be happy to try assist you to improve your services.\n\nLady: No. I work as a legal assistant, I know more about this than some idiot who went through 15 minutes training. I can cancel. I will cancel. Cancel me.\n\nSIWY: I will ask you not to insult me, this idiot doesn't get paid that much, thank you. Now (she tries to protest but I barge right through), I have explained our cancellation procedure too you, if you do not wish me to help you, I am not sure what else I can do.\n\nLady: I never got my voucher either. (no explanation or previous mentioning of this).\n\nSIWY: Excuse me, what voucher? \n\nLADY: You owe me 20 from 4 months ago. You never gave it too me. I want it.\n\n*check system, see it was emailed to her as a print off voucher and that the email was opened that day, explain this, have a back and forth with her, she relents and says she must have not realised it was from us.*\n\nThen she moves onto her TV subscription, she has the middle package, and has for 9 years. She insists she never asked for this, because it includes kids channels and she doesn't have kids (I am shocked that no one decided to procreate with this lady). \n\nSIWY: I understand that, but we cannot know whether you have children, and this package isn't just about kids channels, you get over 100 channels in music entertainment &amp; documentaries. Do you watch them?\n\nLady: No. Cancel my account, and refund me the difference (10 a month), for the last 9 years. Do it now.\n\nSIWY: Unfortunately I cannot refund you for the last 9 years, that alone would be over 1000 and no one in this building has authorization to do that. I can cancel that aspect of your subscription without affecting your contract, put you on the right package, and refund the last 6 months. Would that be okay?\n\nLady: No. Cancel the whole thing and give me the 1000... I will be fair (lol), and call it 800. How is that? I haven't got kids and I never knew I had this service, I don't want it and you have been illegally charging me. No one has ever called me to check if this is still what I want.\n\nSIWY: Miss Lady, we make it possible for all our customers to check their subscription, you have had that open to you through your online account, which you have accessed several times, your television interactive service, your monthly itemized bill, which you receive every month, and by our information service. You agreed to these services when you first joined us, it is not our responsibility to check in with you to see if you still want that service, and we make it easy for you to change your subscription. \n\nLady: I don't have kids.\n\nSIWY: We would have no way of knowing that, and it is not just a kids subscription. Would you like to accept our resolution of a six months refund?\n\nLady: No. Cancel it. You are fucking useless. You haven't even tried to help me. Here is what you should have done; you should have asked me problem (I did that), you should have then tried to resolve my problem (I did that), you then should have offered me a good will refund (I did that), and then you should have cancelled me (didn't do that).\n\nSIWY: I think you are being really unfair, I did all those things Miss Lady, except cancel you, which I have already explained why I cannot do. I have tried to be patient with you and tried to help you to the best of my ability. You have insulted me, swore at me and made it exceptionally difficult to help you by throwing up barriers at every opportunity. I cannot cancel you, is there anything else I can do for you?\n\nLady: Yes. Cancel me and give me 1000. \n\nSIWY: Not happening. Good evening and thank you for calling **LARGE ISP**.\n\n*click*.\n\n\nI got in a bit of trouble for it with my manager, but a slap on the wrist because he agreed she was a cunt and had it coming.",
        "created_utc": 1462655551,
        "upvote_ratio": ""
    },
    {
        "title": "Idiots I work with",
        "author": "Jamason17",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ibqdo/idiots_i_work_with/",
        "text": "I'm a QA for a vendor company. My department works with insurance and the section I grade mainly is a help desk for insurance agents when they need certain things processed/help with policies. One thing about it is when an agent becomes irate and starts acting like a dick (putting you down, cussing you out etc.) you're able to have your supervisor contact their district manager and file a complain about that agent. This needs to be done through your supervisor, you absolutely cannot contact them yourself. It's just the hierarchy and going outside of that can get you and the campaign in trouble.\n\nI'm a little new to the QA scene (been doing it for only 3 months or so) and every day I have people telling me about disconnecting agents because they don't wanna deal with it, breaking the rules. No idea what makes these people think they can tell me this... Anyways, one of our people let it slip to me that she personally had been calling DM's and complaining to them. This is a sever no no. So I told her this needs to be done via your supervisor and if you get caught you're going to get in deep trouble as its grounds for termination. So one, I was pissed she would even think she can tell me this and get away with it. This could cause our client to potentially withdraw the contract. \n\nSo I told her supervisor and we began monitoring her outgoing calls... Nothing yet. But I would like to know from other QA's/agents, what is your worst horror story from a co-worker? Do any of you have that one (or several) person that you seriously wonder how the hell they still have a job? ",
        "created_utc": 1462655157,
        "upvote_ratio": ""
    },
    {
        "title": "What's The Phrase That Can Make You Hate A Customer Instantly?",
        "author": "Nilmandir",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4i9w8e/whats_the_phrase_that_can_make_you_hate_a/",
        "text": "So my fellow phone jockeys were discussing this yesterday after an awful day of back to back WTF calls. A few choice ones were bandied about: \n\n\"I'm going to shop at x store from now on.\" \n\n\"I'm calling the Better Business Bureau on you.\" \n\n\"I'm contacting a lawyer about this.\"\n\nMine is the \"I spend a lot of money in your store...\" and all its variations. Everytime I hear it, it makes me roll my eyes, look at their about account totals, and think \"really?\" I want to stop the conversation mid sentence and say \"You do realize I can see your whole account right? You haven't spent more than 1,000 a year with us ever. In 20 years.\" And then hang up on them for being money grubbing assholes.\n\nHow about it? What are the phrases that make you reach for the mute button and scream or laugh at the idiot on the other end of the head set?",
        "created_utc": 1462626008,
        "upvote_ratio": ""
    },
    {
        "title": "Fort McMurray, Alberta, Canada evacs calling in asking for suspensions/cancels/guidance with their accounts. Anyone else been helping these people today?",
        "author": "c74",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4i3i57/fort_mcmurray_alberta_canada_evacs_calling_in/",
        "text": "Damn, this afternoon/evening I must have talked to a dozen or more people who evacuated from Fort McMurray, Alberta, Canada [due to the fires](http://www.cbc.ca/news/canada/edmonton/fort-mcmurray-residents-face-long-wait-as-fire-crews-still-have-a-long-way-to-go-1.3568035) looking to know if they should cancel, suspend or were just asking advice on what they should be doing with their account(s). \n\nI work for an energy supplier, so people basically don't want to be charged for having electricity or gas available at their homes being the entire city is evacuated and don't know if their home is burnt down and don't know when/if they are going back even if their house isn't burnt down... not to mention that many people up there were under-employed or unemployed due to the oil prices crashing.\n\nI can only imagine the amount of people calling to cancel their internet, phone, whatever contracts.\n\nI'm in awe of these people holding their shit together and being practical about what the heck in happening.  Not one of them was in any way rude, abrupt or 'unpleasant'.  Like seriously, some have literally lost their businesses, homes and are in evac centers and they are incredibly logical and polite.  Blew my mind.\n\nAnyways, as per the norm, until the calls started coming in there was no foresight or guidance by management beyond not charging late fees for overdue bills.  But, hey, had a total **WIN MOMENT** being I had a string of calls from Fortmac customers where honestly... I didn't have the answers and sent an email to all the management group in frustration.  \n\nLol, the only manager left in the office tonight when I sent the email for guidance set a policy (for this evening) to give very generous credits to anyone calling and to add them to a call back list once corporate figured out how to handle this.  Fucking win!  Love this guy, someone with a 'pair' and obviously a heart/head to make a good decision.  Much respect.\n\nDo the companies you work at deal with accounts in Fort McMurray?  What is the 'policy' for handling what is going on?",
        "created_utc": 1462506610,
        "upvote_ratio": ""
    },
    {
        "title": "\"Someone who knows what they're doing\"",
        "author": "FlyingGuineaPig",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4i2pcg/someone_who_knows_what_theyre_doing/",
        "text": "I take calls for an insurance company. I am an insurance agent. I know what I'm doing.\n\nCaller: \"I need coverage for this one thing.\"\n\nMe: \"I'm sorry, but we don't cover that one thing.\"\n\nCaller: \"Can I speak to someone who knows what they're doing? I just need coverage for this one thing.\"\n\nMe: \"I'm *very sorry,* but we *don't cover* that one thing.\"\n\nCaller: \"Well, how are you going to cover me then?!\"\n\nMe: \"I'm sorry for any inconvenience, but we *won't* be able to cover you because we *don't* cover that one thing.\"\n\nCaller: \"Well, what*ever!*\"",
        "created_utc": 1462493356,
        "upvote_ratio": ""
    },
    {
        "title": "If I were a machine, I'd be the Terminator and this call would go much differently",
        "author": "Jabber_Tracking",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4i0p31/if_i_were_a_machine_id_be_the_terminator_and_this/",
        "text": "ME: Thank you for calling Card Servi-\n\nCUSTOMER: *button mashing* BEEP. BEEP. BEEEEP!\n\nME: Thank you for calling Card Services, this is -\n\nCUSTOMER: *angrier button mashing* BEEP! BEEP! BEEPBEEPBEEP!\n\nME: *close my eyes, take a deep breath* You are speaking to an actual, live human being. My name is Jabber. What can I help you with?\n\nCUSTOMER: Oh hi! Man, these computer systems these days are so convincing, I couldn't tell at first!\n\nI even once had one guy ask me to say something silly (I went with \"Mary Had a Little Lamb\") to prove I wasn't a machine. I can only imagine how much worse it is for chat agents, who don't even get the benefit of voice modulation to \"prove\" they aren't machines.",
        "created_utc": 1462466025,
        "upvote_ratio": ""
    },
    {
        "title": "I'm bored at work",
        "author": "LamaLaw",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4i08gk/im_bored_at_work/",
        "text": "I'm working 2nd Level Support at a Call Center for PayTV provider. Work has been really slow these last couple of weeks because we usually only get 2-3 calls per hour.\n\nToday hit it out of the ball park though. After starting my shift I've waited over 2 hours for my first call. So effectively I've already made 34 euros today for watching YouTube and reading reddit. But I'm still bored. \n\nAnyone have any tips on what to do at a call center when work is slow? I've already watched most of my subs on youtube, read all of my subscribed subreddits",
        "created_utc": 1462459976,
        "upvote_ratio": ""
    },
    {
        "title": "The family with no emails",
        "author": "_Neps_",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4hz6xr/the_family_with_no_emails/",
        "text": "So I work for a rather well known digital entertainment company (which I will call Woobly) that has an online network. Like with most things these days, people can purchase gift cards for the network and redeem the code to add funds or receive content. Most of the time this goes without a hitch - people puchase their gift cards, redeem their codes successfully and the world keeps on spinning. But sometimes people receive invalid voucher codes that we then have to escalate to a different department. This means they'll need to email us pictures of the code and proof of purchase, since otherwise we only have their word to go on.\n\nYesterday I get some kid on the phone, who's bought a voucher code for 30 from Asda (Walmart). I ask him to tell me the code so that I can check it on our system and see if it's valid or not. He reads out the code. It's all numbers, which is odd because usually our codes are a mixture of numbers and letters. Unsurprsingly, the code yields no results on our system and therefore it's not valid.\n\nI explain that we'll need him to take a photograph of the voucher code and proof of purchase and email it over to us so that we can escalate it to the right department for investigation. This usually results in the customer receiving a valid code after a couple of days, so it's a good thing. I ask him for his email address so that I can send him a quick email first requesting the photos. He gives me his email address. So far so good. Simple call.\n\nCue the angry motherbeast, who I had been hearing in the background throughout the call and who I was silently praying would not decide to take the phone from her son. Alas, she did. \n\nMe: \"Hi there, you're speaking to Woobly support, my name is Neps. I was just letting your son know that we're going to need to see a photo of the voucher code and proof of purchase so that we can investigate it and send you a proper code.\"\n\nMother (sounding impatient): \"How long is this gonna take?\"\n\nMe: \"This usually takes about 3-4 days, but you'll receive a working voucher code at the-\"\n\nMother: \"Is there any other way we can sort this out?\"\n\nMe: \"I'm afraid this is the only way. We're not able to help you without those pictures.\"\n\nMother: \"Because my son has given you his dad's email address and his dad's going away for work tomorrow. We're not going to have *access* to an email for a week and we need to get this sorted now.\"\n\nMe: \"Do you have a different email address that you can give me instead?\"\n\nMother: \"No, we don't. That's the only one we have and we're not going to be able to use it when his dad's gone.\"\n\nMe (silently screaming): \"Is it possible for you to create a new email address? Do you have access to a computer such as a tablet, smartphone or PC?\"\n\nMother: \"You want me to create a new email address? Is there not some other way I can get this sorted? Can I come to your office in person and hand you the code?\"\n\nMe (oh *hell* no): \"I'm afraid that's not possible. We're a call centre, we don't deal with customers face to face.\" \n\n(We're actually a third party call centre that deals with multiple clients, but I didn't feel the need to mention that).\n\nMother: \"This is absolutely *disgusting* customer service - you're telling me that I have to make a new email address just to receive help from Woobly? I'm sorry but that is not on - I'm going to trading standards!\"\n\nMe (giving up at this point): \"Well, if you really want this sorted now then your only other option would be to go back to Asda and see if they'll give you a refund. I can't guarantee that they *will*, but they're usually pretty good about this sort of thing and they might help you out.\"\n\nMother (breathing heavily): \"Yes, fine, I'll have to do that then.\"\n\nAsda, I'm sorry for unleashing this monster upon you, but she simply refused to be helped by us. I felt sorry for the kid. I'm sure he would've been able to make a new email address in 2 minutes, but his mother seemed to think that was the most unreasonable demand in the universe. It stands to reason that if you have one of our products and the ability to spend money on gift cards for it that you're not living below the breadline. You almost certainly have some sort of computer in your household that you can send and receive emails from. \n\nDefinitely one of the weirder calls I've dealt with.",
        "created_utc": 1462441206,
        "upvote_ratio": ""
    },
    {
        "title": "What do you do at your job that is \"illegal?\"",
        "author": "Believeinthis",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4hy3u8/what_do_you_do_at_your_job_that_is_illegal/",
        "text": "My favorite comments from customers are the ones that tell us that what we're doing is illegal. They're going to go to the police or sue us! (LOL) The list so far includes:\n\n-Asking for their SSN when they don't have their card to look up the account\n\n-Asking to verify the last four of their SSN\n\n-Asking for the SSN of a person they're trying to add on as an authorized user or POA\n\n-Raising their APR due to changes in their credit or poor payment history\n\n-Raising their APR due to the prime rate increasing, which we literally have no control over\n\n-Asking for the dates of their travel\n\n-Declining their card due to suspicion of fraud\n\n-Decline their card due to late/non-payment \n-Asking for consent to contact their phone with automated messages\n\n-Not speaking with someone who isn't on the account simply because they usually pay that account's bills\n\n\nSo, what do you do at your job that you're told is illegal? These people always crack me up. Like we wouldn't know what the laws are and would set ourselves up for that kind of liability. Yeah, okay.",
        "created_utc": 1462417277,
        "upvote_ratio": ""
    },
    {
        "title": "The most offensive profanity",
        "author": "Ihavesomethingtosay9",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4hvvud/the_most_offensive_profanity/",
        "text": "I work in a call center for an insurance company. This guy calls in mad as a hornet and wants to speak to \"higher than a supervisor\". \n\nSo I just got a supervisor.\n\nSo this supervisor is very sassy to begin with. He's black and gay and loves fruit snacks. His race was the only relevant feature to this story. \n\nThis guy from Kentucky is screaming at my supervisor and my supervisor talks back. \n\nAll you hear is \"you're not going to tell me to shut up if you want me to help you.... No, I'm telling you how to talk to me, because I'm trying to help you.... So that's how you do business?... You want me to suck your cock?... Yes I am a N*****..... When you call you back you'll get another N*****.... You're surprised that I'm talking back to you this way? It's 2016, get over yourself! Now I'm hanging up\"\n\n\nThat's the short version. I work in the commercial department, this guy owns a business. \n\nThis almost made me cry and I didn't even handle the call, that's how brutal it was. What the hell kind of person speaks this way?? \n\nThe supervisor just calmly walked away. He wasn't bothered by it at all. He messaged me and said \"that wasn't even the worst phone call I've ever had lol\" \n\nI want to find out this guys business and see if I can't have him non-renewed. I wish I could just terminate him.\n\nWhat a scumbag  ",
        "created_utc": 1462386446,
        "upvote_ratio": ""
    },
    {
        "title": "Most frustrating call I've had in awhile.",
        "author": "Believeinthis",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4hs2ye/most_frustrating_call_ive_had_in_awhile/",
        "text": "I won't try to type it up verbatim, because it would take the entire page. I work in the credit card services of a major bank. The call starts off with, \"WHAT IS THE PHONE NUMBER FOR YOUR HEADQUARTERS?!\" I let her know that I can definitely give her that number but that I can also get a supervisor on the line if she has a complaint. She tells me that, no, she's already spoken with a supervisor and 2 (sometimes 3, sometimes 4??) other representatives. She said that she's going to be traveling to Mexico and that she called to activate her card, \"THAT TOOK 6 MONTHS TO RECIEVE!!\" and told them that she would be traveling and they asked for the dates of her trip. Apparently, this was a MAJOR violation of her privacy and that even immigration would not ask for the return date of her trip and how ridiculous that we would even ask. She said we \"threatened\" her by telling her that card would be declined without those dates and she felt like we were trying to trap her.\n\nShe kept going on and on about how her identity had been stolen and that if anything happens to her house while she's on her trip she was going to sue us and that if she went to the police or called her lawyer they would DEFINITELY tell her not to give us that information.\n\nWe are obviously only trying to protect ourselves and we have no interest in protecting the customer.\n\nI tried to explain, several times, that the dates of the trip are not shared with anyone, that it's just for our fraud department so they don't think someone has stolen her card. She would NOT hear what I was saying and just kept screaming at me. I offered again to get a different supervisor for her, but she refused. She went on and on about how she's had this card for 15 years (NOT true, I could see where she opened it 3 years ago, but whatever) and how she never tells us when she travels and it's never been a problem.\n\nAfter 25 minutes of this, she finally said that I had explained it better than the other advisors and that she felt more comfortable but was still pissed that we asked for it in the first place and should change the protocol just for her.\n\nI was so emotionally and mentally exhausted by the end of the call that I just wanted to go home. How do you recover from a call like that quickly? Our calls were back to back all day, literally no time between calls. I think I took about 125 calls or more during my shift. 5 o'clock could not come fast enough.",
        "created_utc": 1462323704,
        "upvote_ratio": ""
    },
    {
        "title": "Idk why your rate increased",
        "author": "Ihavesomethingtosay9",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4hqkov/idk_why_your_rate_increased/",
        "text": "I work in insurance so people call up all the time asking why their rate increased. I work in the commercial department, so it's all business. \n\nYou want to know the truth? If your insurance company raises your rate above 20%, they don't want you any more and they're trying to nudge you out because you're too risky or there have been a lot of losses associated with your type of business. But I can't say that. \n\nI literally have to make up stuff or just insist that it is a rate increase. Obviously no body likes that answer. I'm frustrated with my company for not growing a pair and saying \"you are no longer preferred due to: blah blah blah. Please find insurance else where\" aka non-renew.\n\nI'm frustrated with the customers because there's literally nothing I can do about it unless you want terrible coverage. \n\nPlus, I don't call up insurance companies asking why the raised the rates because I know why. They're a company that wants more money, simple as that. I would simply shop around and switch. It's not a big deal. \n\nYeah, it takes time out of your day, but so does everything else in the world. \n\nThis job just doesn't pay enough and it's depressing me. \n\nEdit: this is in regards to policies that have a rate increase for \"no reason\". Like the customer has had no claims, they always pay on time, best customers ever, blah blah blah. I get why it sucks for them, it just sucks to not have a great explanation. ",
        "created_utc": 1462311421,
        "upvote_ratio": ""
    },
    {
        "title": "Do call centres monitor emails sent to external emails?",
        "author": "Kaycat19",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4hpz7e/do_call_centres_monitor_emails_sent_to_external/",
        "text": "Made a boo boo at work, a pretty bad one and want to know if they monitor my work email and look at emails sent to external email addresses :/\n",
        "created_utc": 1462306870,
        "upvote_ratio": ""
    },
    {
        "title": "call centers and postpartum",
        "author": "Mrsfleshstorm06",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4hjbw6/call_centers_and_postpartum/",
        "text": "recently my call center relocated leaving all of us to look for other jobs. I found out that we were all getting laid off while I was on maternity leave. so I finished out my maternity leave and started to look for another job while my call center was preparing to pack up and leave. so I did find another call center job doing auto claims. and let me tell you, it is easy work. but for some reason I cannot get it down. ive been here for about 3 months and im just as unsure about things as when I was released onto the floor. and I know it stems from mild postpartum. but I do have an interview in 2 days to get out of call center work. fingers crossed",
        "created_utc": 1462217439,
        "upvote_ratio": ""
    },
    {
        "title": "What is one word or phrase a customer says and you know it is about to be a crapshoot call?",
        "author": "ThrowItawaynow12366",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4henww/what_is_one_word_or_phrase_a_customer_says_and/",
        "text": "Mine isn't necessarily a word but when the caller A) doesn't say hello and immediately jumps into their problem or B) starts with 'Yeah, ...hi.' (you know the tone this is said in)\n\nAlso, if before they jump into the problem they say 'Hi I am so and so and I have been a customer for X(X) amount of years...' even if the problem is super tiny and they say it in the nicest way possible. It's just like....why...was it necessary...to say that...I will solve the problem with equal ease and customer service no matter how long you have been with us (probably not what my company wants me to do...but anyway)\n\nJust thought it'd be a good vent. We've been swamped lately i need to make light of something",
        "created_utc": 1462167271,
        "upvote_ratio": ""
    },
    {
        "title": "Harry Potter and the cable box that will happily show another cable providers channels like magic.",
        "author": "ibangonkeytars",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4hb1ae/harry_potter_and_the_cable_box_that_will_happily/",
        "text": "I work for Derptv, in the new sales department. I recieved this gem of a call yesterday or the day before from a man who shall be henceforth called Delusional, who is bragging rather annoyingly that he just purchased a 4K tv and his current provider doesn't have the equipment to keep up and he wants to switch over. Okay, fine, whatever. The conversation is going okay until I mention something about Derptv's television services. Then I hear:\n\n'I don't want services, I'm perfectly happy with (other provider), what I'm gonna do is get the Derptv box and use it with my (other provider) channels in 4K.' \n\nThis caught me completely offguard, mostly because he's acting like it's the simplest thing in the world and it just doesn't work that way. 'You want...what?' (Bad ibangonkeytars, bad. QA won't like that) like it's fucking magic and they're all cross compatible. \n\n'Caught you stuttering, you're not very bright, are you?' (Fucking really?!) 'I'm gona hook up the derptv box and get 4K. How much?'\n\n'Well sir, it's 448.00 to buy the equipment outright but-' \n\n'448.00?! That's ridiculous I thought I'd be looking at 20.00 a box! Never mind.' *SLAM*",
        "created_utc": 1462131849,
        "upvote_ratio": ""
    },
    {
        "title": "That's how they get you",
        "author": "Jabber_Tracking",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4h9h9j/thats_how_they_get_you/",
        "text": "A lady calls in, concerned because she received a bill from us, even as she says she does not have a credit card with us. After ten minutes of fighting just to get her information so I can even *check* to see if she's in our system, lo and behold, there is an account under her name.\n\nThinking that what we had here was someone who fraudulently  opened a card in her name, here is how the conversation went: \n\nME: I'm so sorry, ma'm, but it does look like there's an account open with us. Let me go back and read you the purchases.\n\n*I go back and find out there were only two purchases, made on the same day six months ago, for two college textbooks*\n\nThe good news is, ma'm, that it looks like only two things were ordered on this card. This will be no problem to get taken care of.\n\nLADY: That's strange, those are the same two books I ordered six months ago. The same two books I ordered on the same DAY I ordered them. I even received the books on the day when (PARENT COMPANY SHIPPING DEPT) said the order on this card did. I thought I'd paid for them using my regular Visa card, but when I checked my Visa statement, those books had never been charged. \n\nME: Oh! In that case, it's possible that you opened the card that day in order to purchase these books for the 10$ coupon at checkout. Lots of people fill out the application and then forget, especially if they don't use the card after that. Let me take care of these fees that have piled up -\n\nLADY: That's not possible. See, I never opened the card. I don't owe you any money. Here's what must have happened: Someone hacked into my Visa account, stole the book charges and put them on this credit card account.\n\nME: You believe someone stole your banking information, removed charges from it, placed it on another card to order the SAME BOOKS the SAME DAY you did, had those books shipped TO YOUR HOUSE, and then never charged another item on either your Visa or this credit card?\n\nLADY: Yes. Exactly.\n\nME: Well, ma'm, I would have to say then that is the nicest, most responsible card thief ever. I've never heard of one that only charges the exact the items you need and then sends them to your house and then never touches your information again.\n\nLADY: Well, y'know, that's how they get you.\n\nME: *giving up the conversation entirely at this point* Yep. That's how they get you, ma'm.\n\nWhoever came up with Occam's Razor must be rolling in his grave.",
        "created_utc": 1462115951,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'll just call corporate ...\" And Other Fairy Tales",
        "author": "Nilmandir",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4h9f9o/ill_just_call_corporate_and_other_fairy_tales/",
        "text": "I work at a call center that services a reward program for cardholders. It can be a pleasure to deal with 99% of my clients. Generally, by the end of our conversation, most people are having a better day with one less thing to deal with.\n\nOnce a day though, I get a \"time waster\". Not the people who call in and want to talk your ear off about the new grandchild or the price of gas in Topeka. No, these people call in to hear themselves talk, because that's all they do. You can help them, and you would, they just won't shut up long enough for you to actually do anything. They are angry because some process they think they have a minimal grasp on went wrong and they want to tell at me about it, how to fix it, and what they are going to do if I don't fix it.\n\nI had one yesterday who had an issue that could have been dealt with in 5 minutes or less, but she would not stop talking about what pissed her off long enough for me to help. She finally gets so pissed in her echo chamber that she demands that one of the division heads contact her.\n\nI tell her that, while I can take her contact info, I cannot promise a callback.\n\nCue another 5 minutes of disbelief that she, special snowflake that she is, doesn't warrant a callback. I attempted to apologize, but she demanded a supervisor. I got one on the line, explained the situation, we laughed, and he took the call.\n\nI do love feeling useless.",
        "created_utc": 1462115300,
        "upvote_ratio": ""
    },
    {
        "title": "I'm sorry we did what you asked us to do?",
        "author": "Believeinthis",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4h7vst/im_sorry_we_did_what_you_asked_us_to_do/",
        "text": "One more post from me tonight, sorry if I'm over-sharing. It's nice to be surrounded by people who get it. And these posts always end up way longer than I intend. My bad!\n\nI work for a bank in the credit card services. Our average handle time goal is around 230 secs per call. Mine is usually around 200. This call lasted a solid 15+ minutes.\n\nCall started as usual with greeting and verification and I asked how I could help.\n\n\"I want you to look at a charge on my bill and tell me what the hell is going on.\"\n\n\"Okay, I can definitely assist you with that. What is the name of the merchant or the date of the transaction that we're looking at?\"\n\n\"Yeah, it says on April 23rd there was a charge for Payment Reversal for $2000. Why in the fuck are you guys charging me $2000? This is why I hate this stupid bank. You are always charging me one thing or another.\"\n\nI reviewed the account and saw that the customer had previously made 2 payments of $2000 and had asked for one to be sent back to their checking account.\n\n\"Okay, I'm sorry to hear that you're so frustrated but I can definitely see what's going on here. It looks like on April 19th, you made 2 payments of the same amount, $2000. When you realized that, you called us on the 20th and asked us to stop one of those payments. It had already posted as a credit to the account, so we reversed the payment and had the funds put back in your checking account as you asked. Did the receive the funds in your checking?\"\n\n\"Yeah, I got my payment back, but that doesn't explain why you're charging me $2000.\"\n\n\"We're not charging you $2000, you made $4000 in payments and we're taking off the $2000 that you didn't intend to pay.\"\n\n\"But why does it look like a charge?\"\n\n\"Because you credited the account, lowering your balance, by $4000 when you only intended to lower the balance by $2000. So we had to add the $2000 back.\"\n\nWe literally did this, around and around in circles for far, far too long. She finally just said she's going to take her statement into a bank branch. Friggen go for it, lady.\n\nAnother similar call was where a Cardholder called to do a dispute on a charge from a company for a product that he never received. When we do a dispute, the customer will automatically receive a provisional credit while we investigate the claim. They're told it's temporary, and will be notified upon completion of the dispute.\n\nCardholder called in because he saw \"reversal of provisional credit\" listed as a charge on the account. I explained that we reversed his provisional credit from us because the original company gave him a refund. We gave him a credit, they gave him a credit, so we took ours back. He could NOT understand this concept.\n\nI feel like for the most part, I have a pretty good rapport with my customers and can usually re-word things to help someone who is having a difficult time understanding something. But some people.. honestly. I wish there was a test they had to pass before they could get approved for a credit card. ",
        "created_utc": 1462079761,
        "upvote_ratio": ""
    },
    {
        "title": "It's the little things that get me through the day..",
        "author": "Believeinthis",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4h7hez/its_the_little_things_that_get_me_through_the_day/",
        "text": "First call of the day, feeling happy coming off of a couple of days off, ready to be pleasant and kind and helpful:\n\n*beep beep* \n\"Thank you for calling Cardmember Service, my name is [me], may I start with your name please?\"\n\n\"Yeah! It's [asshole].\"\n\n\"Thank you, and may I please have your card or account number?\"\n\nAt this point he rattles off a 16 digit card number as fast as he can possibly talk. I'm pretty quick with typing the numbers, but it didn't pull up and I was fairly certain that I knew where I had messed up so I just asked him to repeat a portion of it. He did, but he was obviously pissed off/annoyed.\n\n\"Thank you, sorry about that! Can you please verify-\"\n\n-interrupts me \"Can you just hurry up already? Ask me what you have to fucking ask me quick.\"\n\nAt this point, I'm just trying to control my voice and not have an attitude.\n\n\"What is your zip-\"\n\n-interrupts me \"12345\"\n\n\"And the last 4 of your -\"\n\n-interrupts me \"1234\"\n\n\"And how can I help-\"\n\n\"I've been on the phone with YOU PEOPLE for the last 4 hours trying to get this shit fixed. You need to get a supervisor on the line for me NOW who knows what the fuck they're doing. This is fucking ridiculous.\"\n\n(Unlike some call centers, we can NEVER hang up on a customer, no matter how much they curse at us)\n\n\"Okay, I can certainly get a supervisor on the line for you. Do you mind holding for just a moment?\"\n\n(I'm *required* to ask their permission before I put them on hold.)\n\n\"If I minded, I would be asking, would I? You people are idiots.\"\n\nSo, at this point I jump in the solutions/escalations queue and I start reading the notes on the account. This guy has called in about 5 times in the last couple of hours about a problem that we don't even handle on our end. He has a card that our bank services, but the benefit that he was calling in about was through the company that opened the card/runs that benefit program. He was given their phone number every time and connected with a rep from that line twice. Apparently he wanted some points for an offer that he never opted himself in for, which had to happen through the other company. We have a way of putting points on the account, but not for the quantity that this offer would have given him.\n\nOne of my favorite supervisors picked up and when I gave him the card number, he audibly sighed. Apparently HE was the supervisor that this guy had been speaking with previously. It's a big call center with multiple locations, so the likely-hood of ending up with the same supervisor is slim. He straight up told me that there was no way that this guy was going to get what he wanted from him, but to go ahead and patch him on through.\n\nI checked the account notes later in the day because I was curious and it said that the account was being closed. 1 less a-hole to have to deal with. Hooray!\n",
        "created_utc": 1462071569,
        "upvote_ratio": ""
    },
    {
        "title": "Telemarketers/sales people calling in",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4h4pii/telemarketerssales_people_calling_in/",
        "text": "[deleted]",
        "created_utc": 1462027695,
        "upvote_ratio": ""
    },
    {
        "title": "Where are my faster speeds!",
        "author": "Capricola",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4h4n3m/where_are_my_faster_speeds/",
        "text": "Had a customer call in today yelling because their internet isn't any faster.  Asking in a confused voice what they mean by that, they said they bought all new Monster Ethernet cables and coax cables for a better connection for the internet and was expecting to cheat the system and get faster speeds by just buying these cables.  They started screaming after I told them the speeds are set on our end and only way for internet speeds to increase is for us to send a signal to the modem to increase speeds. Cue swears not at me but at the son for saying this would work and wasted money ect and customer ended call with me laughing on mute.",
        "created_utc": 1462026546,
        "upvote_ratio": ""
    },
    {
        "title": "\"Ma'me, you do know you're calling your bank, right?\"",
        "author": "Believeinthis",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4h3de5/mame_you_do_know_youre_calling_your_bank_right/",
        "text": "I can't remember verbatim how the conversation went but it was something along these lines:\n\n\"Thank you for calling cardmember service, my name is [me], may I start with your name, please?\"\n\n\"My name is [cardholder] and I need you to help me today.\"\n\n\"Okay, absolutely. I see you've already been verified through our phone system. How can I help you with your [product name]?\"\n\n\"Well, I'm in the hospital, you see? And I don't have any shoes. They're going to do therapy for me so that I can get out of here, but I don't have any shoes to do the therapy and I need you to get someone to go to my house and bring me my shoes.\"\n\n\"Ma'me, I'm sorry, but you do know you're calling [bank's name], correct?\"\n\n\"Well, yes, I know that. I just don't know who else to call and I was hoping I could hire someone through you guys. I don't have anything, I don't even have my clothes. The police brought me here. Don't even ask me how that happened. I thought maybe I could hire a taxi cab to bring me my shoes.\"\n\n\"Ma'me, I'm not sure if there is a company that provides that kind of service. You can certainly use your visa to pay for that if they accept this sort of payment, but it's not a service that I can provide for you.\"\n\n\"Okay, I just need some shoes. I guess I'll try to do the therapy barefoot. Thanks anyway, I guess.\"\n\nAnd then she disconnected.\n\nI get a lot of seniors who are kind of confused, or people who think they're calling their insurance company or a retailer before they realize who they're talking to. (Despite the fact I always brand the call \"How can I help you with your [bank] visa/mastercard?\" but this one took the cake. I actually just ended the call feeling bad for her!",
        "created_utc": 1461995303,
        "upvote_ratio": ""
    },
    {
        "title": "Just got a job at a call center! Tips please!",
        "author": "nacobjewsome",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4gvvtx/just_got_a_job_at_a_call_center_tips_please/",
        "text": "I got a job doing tech support for frontier. I help people fix their fiber optic Internet, phone, or TV services. Anything I should know? How frequently will people say they want to kill me? I'm anxious to hear about this lol\n\nEdit: also, if this isn't the right sub for this, could someone please direct me to the proper subreddit? Thank you!",
        "created_utc": 1461874620,
        "upvote_ratio": ""
    },
    {
        "title": "I quit customer support and got a new job at helpdesk. I am in literal heaven.",
        "author": "fortnerd",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4gv5qs/i_quit_customer_support_and_got_a_new_job_at/",
        "text": "1) no queues unless something crashes for a lot of people at once.\n\n2) Employees are so much nicer and downright sweeter than customers. Maybe it's a British thing, or maybe it's because I'm the reason they can take an extra unplanned break, but still. I just want to hug them all. &lt;3\n\n3) The new corp clearly respects the employees more than the old corp. And the pay's better. &lt;3\n\n4) I know jack shit about IT, but every time I restart something or apply a batchfix and it starts working, I feel like a goddamn wizard :D\n\n5) DID I MENTION NO QUEUES\n\n*hugs everyone*",
        "created_utc": 1461865632,
        "upvote_ratio": ""
    },
    {
        "title": "Account info required",
        "author": "graze81",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4guaqk/account_info_required/",
        "text": "If you want us to help do the following, like updating your account info or cancelling, I kind of, need, TO HAVE YOUR ACCOUNT INFO! \n\nYou'd figured this would be basic knowledge, nope.",
        "created_utc": 1461854815,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever taken revenge (no matter how petty) on awkward/rude/asshole customers?",
        "author": "TheDroolinFool",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4gtqr4/have_you_ever_taken_revenge_no_matter_how_petty/",
        "text": "My last job at a fruit company as a tier 2 agent revolved around surveys sent to customers after each call and this is part of the bullshit that made me leave, I was fed up of having one to one meetings and losing bonus because some jackass is too stupid to follow basic instructions or wanted their shit fixing the same day when that was impossible (but hardly my fault) or called for help only to refute/question the solutions given to them - then leaving negative feedback, despite them calling for advice in the first place!\n\nThe last straw for me was when a fucktard send in a negative survey because I failed to setup his shitty weird 3rd party email account with some completely rare/unheard of ISP. I tried a few basic things to get it setup... No dice, at one point he even said he wasn't sure what the password was. I told him he would need to speak to them and find out the settings/login details etc... Even gave him my email address and told him to email me when he had the details and I'd then help him set it up. He turned into a complete asshole and hung up on me for \"being unhelpful\" and \"fobbing him off\"!\n\nNext day I get a negative survey because his son got the email account working in \"a few hours\"! well fuck me, sorry for not spending hours on the phone with you trying random settings with fingers crossed that it'll work, and not even being able to be sure it would work at all, because you said you didn't even know if you had the right password! - that wouldn't be very professional would it? Hence I told you to contact the company and get the official details. But no you threw a fucking hissy fit instead like the bitch you are and became a rude asshole (which you conveniently didn't mention in your bad survey feedback did you?) \n\nGlad your son got it working and all but fuck you, thank you for the negative survey, one to one spent with my manager who was equally as flabbergasted as to what your problem was and threatening my bonus you cunt! (negative surveys can't be removed, even if it clearly wasn't the agents fault) All because you are a self entitled prick who wanted your hand holding and ass wiping for you. Fuck you.\n\nI was so overjoyed when you emailed me about an unrelated problem 3 weeks later and asked for my help becouse you'd spoken to someone else and they had been \"unhelpful\" (funny that!) - you'll never know the satisfaction I took in laughing out loud at your email before swiftly pressing the delete button and adding you to my junk filter - not my fucking problem anymore! Why risk another bad survey?\n\nSo, Call Center workers of Reddit, have you ever taken \"revenge\" on a customer?",
        "created_utc": 1461846475,
        "upvote_ratio": ""
    },
    {
        "title": "92.5% Occupancy, &lt;20% Service Levels. Still Not Working Hard Enough.",
        "author": "JohnBigBootey",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4grxrv/925_occupancy_20_service_levels_still_not_working/",
        "text": "Recently, I've been reading up on call center management, more out of a \"know your enemy\" thing than any real interest (not like we have any room for advancement here). The primary metric most head managers will look at is Occupancy, the percentage of time agents are on the phones during the day. Every second you wait between taking phone calls counts against occupancy. Reportedly, the industry average is 85%. According the my calculations, we've been running at roughly 92.5% for the last year and a half. This isn't an agent-accessible metric, but considering we never have a spare second between a call, it's not hard to measure.\n\nBetter yet, our service levels are abysmal. Most days, we do good to break 20/120, meaning we only answer 20% of our calls within two minutes. Towards the end of my shift, average queue time can climb as high as 15 minutes, easy.\n\nThe best part is how they're cracking the whip on us regularly. ACW is supposed to be sub-one minute, even though we deal with business quotes and emails which take far longer than that. It just makes me laugh when we're obviously working at a breakneck pace, while understaffed, but somehow it's our fault. The more I look at how we're run, the more I question how our new manager got the position at all: or how she'll stay there.",
        "created_utc": 1461809972,
        "upvote_ratio": ""
    },
    {
        "title": "Do you hate the company now that you work for them ?",
        "author": "JaydenPope",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4gri9f/do_you_hate_the_company_now_that_you_work_for_them/",
        "text": "The company i work for i never heard before but i just hate the company in all the shit it is. It pays the bills but i wouldn't shed a tear if it ever implodes.\n\nHow about you guys ?",
        "created_utc": 1461803566,
        "upvote_ratio": ""
    },
    {
        "title": "Horrible failed authentication",
        "author": "ermergerdberbles",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4gngbq/horrible_failed_authentication/",
        "text": "Me: May I have your bank card number please\n\nCx: (with no accent at all) 1234567....\n\nMe: and your name\n\nCx: (phone heard being passed) apu  nahasapeemapetilon (with thick accent)\n\nMe: do you have a security code\n\nCx: (phone heard being passed) I think it's 1234 (no accent)\n\n\nAnd of course he hangs up when asked further questions",
        "created_utc": 1461742867,
        "upvote_ratio": ""
    },
    {
        "title": "Highlight of the Day",
        "author": "King_0f_Mirkwood",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4glfmg/highlight_of_the_day/",
        "text": "\"When can I call long distance? After 5?\"\n\n\"Where are you calling to Sir?\"\n\n\"Africa.\"\n\n\"Unfortunately your plan is only Canada wide. International long distance calls would be charged extra, regardless when you call.\"\n\n\"Then how much is it for me to call Africa?\"\n\n\"Which country?\"\n\n\"Africa.\"\n\n\"Sir. Africa is a continent.\"\n\n\"Oh.\"\n\nEdit: what happened afterwards...\n\n\"So which country are you calling? I can look up the rate for you.\"\n\n\"I don't know.\"",
        "created_utc": 1461710494,
        "upvote_ratio": ""
    },
    {
        "title": "Shoulder Surfing",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4gjb44/shoulder_surfing/",
        "text": "[deleted]",
        "created_utc": 1461684288,
        "upvote_ratio": ""
    },
    {
        "title": "Help a girl out?",
        "author": "FoolFrontal",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4ggn0g/help_a_girl_out/",
        "text": "I've been researching about your field and about to take a test in a few days! I've been taking up mock tests from various sites but some don't have the correct answer provided. Now I'm curious! \n\nHow would you answer the following?\n\n1. If a client chooses an expensive product/service for a need that I know could be satisfied by a cheaper one, I would let him or her know. (Agree or disagree)\n\n2. Periodically ask my listener if he or she is following me. answer customer service call center. (Agree or disagree)\n\n3. I wouldn't feel good about myself if I pressured a client to keep a service/product that he or she really doesn't need. (Agree or disagree)\n\nI really don't know what mind set I should have when dealing with clients. Should I just agree all the time? Any tips? ",
        "created_utc": 1461635302,
        "upvote_ratio": ""
    },
    {
        "title": "Got any eyeroll worthy calls?",
        "author": "evosthunder",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4gemz9/got_any_eyeroll_worthy_calls/",
        "text": "Had a call today concerning donations and mail. This woman complained for about ninety seconds on how she all but felt victimized by the mail requesting donations and how it was a lot of money to her and blah blah. All the while, I'm thinking \"You didn't HAVE to donate.\" Finally sent her over to the right department so she could be taken off the mailing list. \n\nGot any calls where you can't help but roll your eyes?",
        "created_utc": 1461608399,
        "upvote_ratio": ""
    },
    {
        "title": "Guy who didn't pay attention to one word I said.",
        "author": "koalaplum",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4gdl5b/guy_who_didnt_pay_attention_to_one_word_i_said/",
        "text": "This customer needed a password reset to login to our company's website which is no big deal I do them all the time and those types of calls usually take 3-4 minutes. Well after I verify his identity the conversation goes like this:\n\nMe: I just emailed you your temporary password so please let me know whenever you receive the email. Also your username will be \"Guy\".\n\nGuy: ok\n\nAbout 40 seconds go by\n\nMe: Are you still waiting for the email?\n\nGuy: What email?\n\nMe: the one I just sent with your password.\n\nGuy: what's in the email?\n\nMe: your password\n\nGuy: but I don't know my user name!!\n\nMe: I told you it was Guy.\n\nGuy: what about the password?\n\nMe: it's in your email.\n\nGuy: oh I see it now, how do I log in?\n\nMe: where it says login and has 2 separate boxes that tell you to enter in your username and password. Once you enter in your login information it will allow you to change your password and then give you access to your account.\n\nGuy: do I have to keep this password? Because I really want to change it. \n\nMe: no as I said, once you enter in your username and password it will let you change your user name.\n\nGuy: oh great.\n\nMe: yep, is there anything else I can help with?\n\nGuy: Before you go, can you tell me what my login information is?\n\nI explained it one last time and finally he got off the damn phone.",
        "created_utc": 1461595102,
        "upvote_ratio": ""
    },
    {
        "title": "Question About Your Call Center Benefits",
        "author": "jacobn43",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4gbt46/question_about_your_call_center_benefits/",
        "text": "Hey fellow TFCC members!\n\nQuick background: I'm a supervisor on the night shift in a smallish call center.  There's about 100 of us including the management staff.  Our company employs around 1,000 people total.\n\nI was wondering if any of you have some kind of \"Wellness Plan\" type of benefits.  And what I mean by that is, you're compensated in some way if you maintain a certain level of healthiness; typically it's reduced rates on your insurance.\n\nThe people in my office are extremely unhealthy.  The company does nothing to promote a healthy lifestyle.  When someone starts working here they typically put on 20 pounds in the first couple months, and then upward to another 50 by the end of the first year.  The average weight in my call center easily exceeds 200 pounds.  And that's men and women combined, and we're 75% women.\n\nWe do nothing to promote healthiness.  We allow people to eat at their desks.  We don't encourage people getting up to move around (quite the opposite actually).  I want to propose to HR some kind of \"Wellness Plan\" and I wanted to see my what my brethren in the field get to enjoy in this area.\n\n\n\nUpdate:\n\n\nSo I polled about half the call center (the people I see at some point during my shift); which equates to about 50 people.  I asked them that if we offered some kind of benefit/kickback/incentive of some sort for healthy living if they would be on board for the program.  I was thinking if I could get enough support from my employees and coworkers that HR would have to seriously consider something.  Here's how it broke down.\n\n5 people were all for any kind of program (these 5 people are like me, only slightly out of shape due to having a desk job, typically been in shape most of their lives)\n\n10 people if there was only immediate financial gain\n\nThe remaining 35?  Flat out refused anything and acted insulted that I even asked.  And these were honestly the people that needed it the most.\n\nI also suggested that we eliminate food being allowed at desks.  13 people said they would flat out quit if that happened.",
        "created_utc": 1461559594,
        "upvote_ratio": ""
    },
    {
        "title": "The Legend of Cuba Guy",
        "author": "Kebble",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4gbfbz/the_legend_of_cuba_guy/",
        "text": "I work for a little known call center that works for a fairly known Telecom company here, and basically my job is directory assistance slash phone operator.\n\nWhen I started working, there warned me about \"Cuba Guy\", he's some kind of phone hacker and basically he always tries to get us to connect him to a phone number in Cuba, but the thing is the phone number he calls us from is not his number, so if we do connect him, the charges go to some random number so we're all instructed to ignore him.\n\nThe funny part is how he's got this thick spanish accent, we always instantly recognize him. Most people in my dept just hang up on him, but not me. I like to have fun and waste his time.\n\nIt started off simple, stuff like\n\nCG: Connect me to cuba pls the number is +53etc\n\nMe: Ok for security reasons, what is the number you're calling me from?\n\nCG: .........read it off kom-poo-ter\n\nMe: I need you to tell me\n\nCG: *click*\n\nand then of course, 5 minutes later, he calls back, same thing\n\nCG: Just read number off kom-poo-ter\n\nMe: Ok no problem, just hang up, and I will call you back at the same number you're calling me from\n\nCG: *click*\n\nSo after a few weeks of not getting any news of him, he finally pops up again. I decide to have even more fun.\n\nCG: Connect me to +53etc in cuba pls\n\nMe: Ok for security reason, are you calling us from [area code]-420-1337?\n\nCG: ............Yes!! That is my number!\n\nMe: very well, I will put you through just hold the line.\n\nI mute my mic for 30 seconds and then just hang up on him. But during that time I hear him laugh and speak spanish to some other guy, I hear \"quatro\" and some other spanish numbers so I figure he's writing down the number. At this point I'm just laughing, Cuba Guy is just *so* proud to have landed on me, this dumb idiot, who gave him the number he calls from. 420-1337, yes, like that's a legit number.\n\nAfter a few minutes, obviously, he pops back up.\n\nCG: cuba pls\n\nMe: Ok what's the number you're calling from?\n\nCG: [area code] four too ziro one tree tree seven\n\nMy work here is done, I got Cuba Guy to confidently give me back that stupid, childish fake number I gave him. \n\nMy only regret is not working a \"69\" somewhere in the area code, but that would have been risky\n\nI truly hope to hear from him again within the following weeks try his luck again with that number.",
        "created_utc": 1461552919,
        "upvote_ratio": ""
    },
    {
        "title": "Should we compile a list of resources to help reps cope or succeed at their jobs?",
        "author": "wemakeritualnoise",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4g4t7q/should_we_compile_a_list_of_resources_to_help/",
        "text": "I look around here sometimes and thought it would be interesting if we were able to create a resource list for people that could assist them with either succeeding at or coping with their job (if they aren't happy in a call center). Or maybe free resources to learn new skills that can help you advance out of your current role into one that's not on the phone as much?",
        "created_utc": 1461438619,
        "upvote_ratio": ""
    },
    {
        "title": "What are your coping methods for your job?",
        "author": "PM_Yo_Pussy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4g4nyu/what_are_your_coping_methods_for_your_job/",
        "text": "I work for a \"Better\" wireless carrier in the tech support department and it's rather hellish. I don't think it's my company that's the problem I just think that it's the role. If I worked for another carrier in a similar position I'd probably hate it just as much. \n\nI often am stuck in situations where I can either screw over the customer to keep my metrics looking good or help out the customer and screw up my metrics. A major problem with smartphones is battery drain and signal issues. Often times a customer will have identical new phones but one isn't performing correctly. Using the phone is obvious that it isn't working correctly but if it's sent to a testing center it's going to pass and I'm going to take a hit. This puts me in a shitty predicament, do I help the customer or do I help myself? More recently I've started helping myself. \n\nAfter being fussed at by supervisors for poor metrics I've turned into one of those evil reps. I try to avoid mailing warranty phones and I don't give out account credits unless absolutely necessary. My stats have gone from being poor to average or slightly above average. I hate myself for it but I need my job too. \n\nOver the past couple of months I've noticed that I drink more and that my lottery addiction has gotten worse. Neither of those habits is healthy but I need some kind of distraction to make me forget about my shitty job. ",
        "created_utc": 1461436473,
        "upvote_ratio": ""
    },
    {
        "title": "It's Full Moon Today",
        "author": "King_0f_Mirkwood",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4g1xwm/its_full_moon_today/",
        "text": "Today we had an awful day at DerpWireless customer service. Everyone was feeling that. People were crazy, weird, stupid, rude, or any combination of the four.\n\nI'll give you some examples:\n\n**CX #1**\n\nMr. Dumbass had some questions about his bills, and didn't understand why it was so high. Upon review, other than some data overage charge, there was also some partial charge for his midcycle 2nd line activation.\n\n&gt;DA: They didn't tell me that at the store! I wasn't expecting this partial charge! You guys are over-charging me!\n\n&gt;Me: Your confusion is completely understandable, Mr. Dumbass. However, you're only billed according to the number of days you use the service, and since we always bill your price plan one month in advance, that's why there's partial charge for the partial cycle that you used plus the monthly price plan fee for the upcoming cycle.\n\n&gt;DA: But when I went to the store with my March bill, there was no partial charge there! Why wasn't the charge there?\n\n&gt;Me: *head desk* Because your bill cycle finished on March 13, which was also the day your bill was produced, and your activation was on March 24?\n\n&gt;DA: Well why didn't anyone explain this to me before?!\n\n&gt;Me: Why - okay Mr. Dumbass, what would you like me to do now.\n\n&gt;DA: I want you to waive the partial charge for me or I'll cancel my account!\n\n&gt;Me: Unfortunately, the charge was valid since you did use the service. In this case, your best option is to speak with retention.\n\n**CX #2**\n\nMr. Clueless, a man in his late 30's, wanted to lower his monthly service fee and asked me to go over what he had with him.\n\n&gt;Me: ...And you have the $30 data option for 6GB.\n\n&gt;C: What does data do anyway?\n\n&gt;Me: Uh, it gives you access to the internet on your phone when you're not on wifi?\n\n&gt;C: Are there people without data on their phones?\n\n&gt;Me: Yes, if they can keep their usage strictly on wifi.\n\n&gt;C: So the data only gives you access to the internet?\n\n&gt;Me: Uh...yes...?\n\n**CX #3**\n\nMrs. Smartypants called to remove the long distance option on her husband's account as an authorized contact.\n\n&gt;Me: For security purposes, Mrs. Smartypants, may I have your husband's date of birth and postal code please?\n\n&gt;SP: *DOB and postal code.* You're only asking the questions right? You guys don't really have that information on records do you?\n\n&gt;Me: Uh...we do have the information on record because we need to make sure you're someone authorized in the account.\n\n&gt;SP: Oh. Okay.\n\n**CX #4**\n\nMs. Bitchface was having some trouble using the personal hotspot on her iPhone to tether to her laptop at work. Why she couldn't just use the wifi at work (her colleagues were talking about it next to her while she was on the phone) was beyond me. She was able to use her data so it wasn't really a network issue, therefore not really our job to further troubleshoot for her. But I figured, what the hell, she got me on the phone already, let's fix this.\n\nShe said every time she tried to connect to her computer, she kept getting the error message \"Network is taking a little longer to connect\" but she didn't/couldn't tell me where the error message came from, her phone or her computer. 20 minutes into the call, she finally told me she was able to turn on her personal hotspot, and her computer wasn't connecting. So her phone was fine. It was the Windows (she didn't know what version) she was using.\n\nAfter several minutes of Google-fu, I advised her to try to create/modify her phone's network profile. And it didn't work.\n\n&gt;Me: Well Ms. Bitchface, unfortunately at this point the situation is a bit out of my area of expertise here. Do you think you can contact your IT department and ask them to assist you?\n\n&gt;BF: Well I guess I'll have to now. Okay bye. *click*\n\n&gt;Me: *threw headset*\n\nFull moon, people. Full moon.",
        "created_utc": 1461382744,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling stuck and need to get out",
        "author": "GreatDay4Hockey",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4fyfci/feeling_stuck_and_need_to_get_out/",
        "text": "First, I don't mean to write this post as a way of saying I'm better than anyone else. If it comes off that way, I apologize. \n\nI lost my last full-time job a year ago, which was a non-customer service role. I have had countless interviews and no offers for anything full-time. I don't think I'm a terrible candidate because I make it to the top three/top five/top 10 with pretty good frequency, but someone else always has more experience that wins out. I've even had hiring managers say to me \"Well you're great but I have candidates who have more experience in X and we just don't have time to train.\" I finally applied for a job with a desirable company in my area and was very very close to getting the offer, only to be told oh an internal candidate came along last minute and we're hiring him instead. But we have a part-time opening in the call center and you can get your foot in the door! Since this company is pretty selective about who they take, I was pretty happy even if it was only part-time. My alternative was retail where I was getting less than 10 hours a week, so I jumped at the opportunity to make more money and work over 20 hours a week.\n\nMy call center, mind you, is not really the typical sweatshop call center. We have three reps (me and two others) and our boss is hands-off and has higher priorities so she doesn't track metrics or how much time you spend away from your desk. But, eight months in and I'm really sick of this! There's nothing wrong with my boss or colleagues, but I feel unchallenged and bored. How much can you really learn about answering the phone and handling the same questions and transferring the same types of calls? Plus since there's really not enough workload for me to go full-time, I am pretty damn poor even though I attempt to watch my spending and cut expenses. I also have no health benefits through my company and have to pay for Healthcare Marketplace at nearly $30 a month. \n\nI tried applying for a full-time role at my company since regardless of me feeling bored, they are a great place to work. Once again, I was told oh we just don't have time to train you and we're hiring these outside candidates with more experience. While they did, to be fair, reject the other internal candidate, it really hurt. I still hadn't lost interest in this job since it was the position I was going to get had the internal person not come around when I was the outside candidate. Ever since then, I've found it hard to give a shit about my work, the annoying customers (though most are reasonable) and the fact that I have to smile and pretend that I'm thrilled the new hires are here. I'm nice to them because it's not their fault I got rejected! But the other job is in sales and I know our company's sales department is pretty busy and they get commission and bonuses. The reps say how busy they are and how stressful it can get, but I get envious when I think of the nice checks they take home every week and the fact that they have full-time jobs they actually want to stay in.\n\nNow I have a second part-time job with a local sports team and I actually like it so far. I've always wanted to work for a team, and if not for the fact that the job was seasonal/game days, I'd love to quit the call center and focus on building my sports career. But since I have to rebuild my savings, I'm stuck in this miserable job. The fact that I don't seem to be qualified for anything full-time makes me feel darned near suicidal at times. And I've worked full time before so I don't understand why I'm so damn near unhireable. I wonder if I'll ever have a decent job again or if I'll doom myself to this life of low-level menial jobs with no benefits and crap pay. I just feel like I could be doing so much more.\n\nThe thing about the sports team is that while sports is a small industry, building a good reputation and doing great work can get you far. Even if the team I'm working for doesn't bring me on full time, I know I can put this on my resume for possible interviews with other teams. I feel like I now care more about doing a good job for them than I do about going to the call center. \n\nTL;DR: Call center life is do mind-numbingly boring and I no longer care about it, but I also have no good way out. ",
        "created_utc": 1461331483,
        "upvote_ratio": ""
    },
    {
        "title": "Question to the parents working in CC's",
        "author": "graze81",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4fukje/question_to_the_parents_working_in_ccs/",
        "text": "Does it feel like you spend the whole day dealing with kids? I know these people are full grown adults, it does feel like I'm dealing my toddler for 8 hours.",
        "created_utc": 1461265741,
        "upvote_ratio": ""
    },
    {
        "title": "Newbie working in insurance - what to expect?",
        "author": "Stepanda1",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4fs1u9/newbie_working_in_insurance_what_to_expect/",
        "text": "Hey guys, \n\nI've recently been offered a full time gig at a call centre for an insurance company. \n\nThis will be my first time working in a call centres and dealing with insurance, my questions is for those that have worked in insurance \n\nWhat should I expect? \n\nHow many calls do you get an hour? Do you do a lot of math? Are calls typically long? Is there a lot to study (on insurance) \n\nI'm a bit stressed out any feedback at all will help ",
        "created_utc": 1461226872,
        "upvote_ratio": ""
    },
    {
        "title": "Can empathy be forced?",
        "author": "nntndo",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4frr7b/can_empathy_be_forced/",
        "text": "So, I had a very fun conversation with my TL today. My TL stated that, \"You sound very polite and professional, but that's it. You sound polite and professional. You have no connection with the customer.\" \n\nThen, my manager attempted a Socratic discussion with me. \n\n- \"Why did I hire you?\"\n- \"Because service levels were not being met.\" \n- \"Yes, but what are you here to do?\" \n- \"To ensure service levels are met.\" \n\nBaffled, my TL had no idea what to say. I guess he wanted something to leave my mouth about customer satisfaction or some crap. I think management knows, because I have about 100 emails in my \"Other\" folder about how nobody is meeting goals, and how behind we are, but this is not about customer satisfaction. \n\nThe thing about me, is that I was constantly being fed \"You are over servicing, and that is why you aren't meeting your goals.\" So, to counter this, I began doing bare minimum to get the customer off of my line, and I am now well exceeding goals and have the gold stars to prove it. I'm not joking. I have gold stars.  \n\nI think something dawned on my manager. This conversation about being empathetic and personalizing interactions just quit when I mentioned this. I mentioned that, \"I used to be empathetic, but you told me to quit over servicing.\" A few seconds of stutters and trying to think up a lie, a response that followed was, \"Not everyone struggles with this. You will figure it out.\"  \n\nI wanted to write a short novel to the bastard about how the companies idea of empathy is flawed. Their idea of empathy is a god damned statement that says, \"I'm sorry that you're upset.\" when it genuinely means that you feel the customer's frustration and want to help them. This leads to what is called, \"over servicing.\" which means that you actually helped them solve a problem as opposed to fixing a small part and hoping they don't call you back calling you a wanker for not realizing the problem was bigger than they realized. \n\nAll in all, my logic is flawed to my manager's eye. I can either be genuinely empathetic an lose my job, or not give a damn and do the bare minimum to meet metrics and lose my job. \n\nIs there a middle ground? How can I sound genuinely empathetic without actually giving a damn about the customer? Customer's know when you fake it. If I say, \"I'm sorry you feel that way.\" while in the back of my mind thinking about how I need to take about 6 short calls to meet my AHT for the day, I get \"Yeah, I'm sure you are.\" \n\n",
        "created_utc": 1461220402,
        "upvote_ratio": ""
    },
    {
        "title": "Call Center Torment",
        "author": "ptpop1965",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4fnrd0/call_center_torment/",
        "text": "I have worked in call centers off and on for far too many years. I just quit a call center job while still in training. OMG ! I keep going back because it's a job but mentally I just can't take it. Every call center is exactly the same across the U.S. regardless of the industry, regardless which state it's located in. I have worked in call centers in Arizona and Ohio. ",
        "created_utc": 1461164689,
        "upvote_ratio": ""
    },
    {
        "title": "Question for the call center warriors.",
        "author": "ghsgentry",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4fnij7/question_for_the_call_center_warriors/",
        "text": "For you warriors that do outbound appointment setting...can you share your appointment setting process for your client(s)? \n \nHow do you view the clients calendar?  \nIs it real-time?  \nHow is the client notified when you book the appointment on their behalf?\n\nReason for the questions is because we \"accidentally\" (not originally in our target market) partnered with an insurance company to manage their agents calendars/appointments through our scheduling system.\n\nThey are going to be using an outbound call center service (YTBD) and these are the questions/challenges we are researching.\n\nAny and all help is greatly appreciated!!",
        "created_utc": 1461161662,
        "upvote_ratio": ""
    },
    {
        "title": "Which call center software system you guys use?",
        "author": "hkhan194",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4fmte6/which_call_center_software_system_you_guys_use/",
        "text": "Hi, which call center software you guys use in your company I am very interested to know about your experience with it. :)\n\nMany thanks ",
        "created_utc": 1461150523,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a credit card brat",
        "author": "Jabber_Tracking",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4fidyp/im_a_credit_card_brat/",
        "text": "CALLER: I made my payment on Saturday. It's Monday. Why hasn't it cleared yet?\n\nME: It can take up to two business days for payments to clear. I'm so sorry, I know that's a hassle. \n\nCALLER: Can you push the payment through?\n\nME: I'm sorry, sir, but the account is too young (opened less than a month ago) to release the payment. It usually takes about two business days for both our bank and our customer's banks to finish talking to each other. Your payment should be open tomorrow morning.\n\nCALLER: This is RIDICULOUS! I have never heard of this before. No other financial institution makes a customer wait days for a payment to clear! You're not helpful at all! You're just acting like a credit card brat! I want you to call me back later to discuss this!\n\nME: Again, I'm so sorry for the inconvenience, but this is actual general policy for most banks. You must have a wonderful bank to immediately clear all transactions. Unfortunately, it does take a little time for us. It will be clear tomorrow morning. \n\nAlso, my system isn't set up for outbound calls. I can get you to an account manager who can arrange for someone to call you back if you'd like.\n\nCALLER: NO. I WANT YOU TO CALL ME BACK.\n\nME: I'm terribly sorry, sir, but I won't be able to do that. It's only a few minutes wait for me to get in touch with someone who could call you back -\n\nCALLER: NO! I want to close my account.\n\nME: We can certainly do that. *opens closing account script and reads it to the caller*\n\nCALLER:*softly, as if utterly shocked by what he is hearing* What?\n\nME: (repeats closing account script)\n\nCALLER: Tell you what. Why don't YOU decide to close or keep my account open?! *click*\n\nAs per manager's request, as the caller did not respond to the closing script, the account was kept open. With, of course, an ungodly long string of notes I typed into the account. Also, credit card brat? REALLY? WHAT THE HELL IS THAT I DON'T EVEN.\n\n------------------------------------------------------------------------------------\n\nCaller 2: Had another lady calling in for an application result and the call went something like this:\n\nME: We just need a few more pieces of information to process your application.\n\nLADY: Whatever. I don't care, just get me approved.\n\nME: It looks like we need your annual inco-\n\nLADY: I already wrote it down! Four times! God, what is wrong with you people?\n\nME: I'm so sorry, the application shows that a monthly, not yearly, income was given. How much do you make a year?\n\nLADY: 100!\n\nME: One hundred thousand a year, correct?\n\nLADY: OF COURSE. What, do you think I mean a month?!\n\nME: Of course not. I just need to make sure my information is correc-\n\nLADY: DO YOU THINK I'M STUPID?! JUST HURRY UP!\n\nME: *I probably shouldn't have said the first part of this, but it came out anyways.* Did I say you were stupid, ma'm? I did not say you were stupid. Your application is important to us and we want to make sure all of the information is correct. *types in annual income. Lady is approved. Lady hands the phone back to the cashier, yelling about our incompetence the entire while*\n\n-------------------------------------------------------------------------------------------\n\nHad ANOTHER lady on the phone who argued with me for almost an hour about how we had no right to use her credit report or other debt collection reports as a reason to lower her credit. She thought it an invasion of her god given, American right to privacy. No other credit card company does this, she claimed, and she was going to make sure that corporate knew that we were \"sneaking around, looking in places we shouldn't have!\"\n\n---------------------------------------------------------------------------------------\n\nThe fourth aggravating call:\n\nCALLER: I see these deals being offered with *COMPANY* with these company cards. Can you tell me more about them?\n\nME: *runs spiel about benefits of card, etc* These are credit cards, sir, just so you are aware before you apply. Federal laws and fees of credit cards will apply.\n\nCALLER: Oh, I don't need another credit card. So where would I sign up for these cards?\n\nME: *directs him to the website application*\n\nCALLER: These are credit cards?\n\nME: Yes sir, they are. They are credit cards. What you'll be applying for, if you fill out the form right now with me, is a credit card.\n\nCALLER: I said I didn't want a credit card! Slow down and listen to what I am saying! *he pauses* Okay, I'm at the application. How do I fill this out?\n\nME: *mimes shooting myself in the head*\n\nI'm finding Days With Jerks tend to bunch together. I've had rather mild and marvelous calls over the last week. Yesterday? Ass deep in entitlement, ignorance, and confusion.\n\nI'm getting better at wading through all of it. Hard to not smell the shit, though, when you're in the middle of the muck.\n\n",
        "created_utc": 1461082982,
        "upvote_ratio": ""
    },
    {
        "title": "Finally quitting my call center job, here's a short send-off story.",
        "author": "Gatoraay",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4fe50i/finally_quitting_my_call_center_job_heres_a_short/",
        "text": "Well, I had a good run I guess, but the stress was really getting to me and starting to affect my quality of life due to the hours I worked and just the overall pressure of talking to people and dealing with their problems. I switched to part time only doing live chat while working on a small side endeavour, but I knew that couldn't last forever because I was spending a lot on parking and transportation just trying to get to my work, since I lost my free parking benefits. I ended up finding another job that is sustainable, with very high potential to grow in the company, and I can walk there, so I gave my notice. I start the new job in about a half-hour from now, so glad to be out!\n______________________\n\nBut anyway, here is a funny IM that one of my coworkers typed to the whole customer service team one day:\n\n    i apologize for he mass email/message bu m keboard isn' fucnioning properl.\n    i waned o know if anone knows where i could replace mine/ / ben is on lunch i believe,\n    bu i can' answer calls if i'm unable o have a funcioning keboard.",
        "created_utc": 1461014539,
        "upvote_ratio": ""
    },
    {
        "title": "What are your talk offs?",
        "author": "Jabber_Tracking",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4fcxkc/what_are_your_talk_offs/",
        "text": "While I'm getting better at developing responses for certain, mostly unanswerable questions, there are still things customers say that leave me stammering for a moment. \n\n\nOur call center has several call centers in foreign countries and so there's a lot of \"Oh, thank god, someone who speaks English!\" \n\n\n(1) ALL of our reps speak English, even in foreign countries and (2) this is almost always a prelude to a short \"I'm not racist BUT-\" speech from the customer.\n\n\n I don't want to sound like I'm joining them in their cozy little blanketfort of mild racism (we get points counted off for that) but I also don't want to simply ignore it (we also get points counted off for that, as we are to 'connect and empathize' with the customer.)\n\n\nWhat I've been saying in response is \"Well, I'm glad you have me on the line. What can I help you with?\" But that sometimes kicks off yet another racist rant in the guise of \"thanking me\" for being an American.\n\n\nHas anyone figured out the magic words that is both work appropriate and also human-decency appropriate? Our foreign reps are actually pretty damn good at their jobs AND we also have QA scorers in some of those foreign countries, too. (They don't do original scoring in house, or at least in our building, lest they score someone they know more or less favorably.)\n\n\nOr is this just one of the beasts of modern call center work, where the answer will never be fair and just for all parties involved, because the customer is often not fair and just?\n\n(Thank god I found this place. There are SO MANY things that I want to post about!)\n\n",
        "created_utc": 1460999952,
        "upvote_ratio": ""
    },
    {
        "title": "How has working at a call center changed how you interact with people?",
        "author": "ash-left",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/4f919h/how_has_working_at_a_call_center_changed_how_you/",
        "text": "Do you bite your tongue more, or do you let out too much pent-up aggression? Do you ever find yourself using your calling voice? Do you find yourself dreading or excited for normal conversation?\n\nAs for me, I have to catch myself from agreeing through the whole conversation. I also tend to focus so much on the other person that I hardly take time to share my ideas/talk about my day/give my opinion. On the bright side, I sure do appreciate when people tell me to have a nice day or anything like that. I'd love to hear your thoughts and experiences!",
        "created_utc": 1460935121,
        "upvote_ratio": ""
    }
]