[
    {
        "title": "A happy story",
        "author": "KrazyKhajiitLady",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9g685k/a_happy_story/",
        "text": "I am so happy to share a good story for once. While I've most definitely had more neutral/pleasant calls than negative, the negative ones usually stand out in my mind much more.  I don't think I'll forget this call though.\n\n&amp;#x200B;\n\nSo I work for a local ISP. We actually do Tier 1 support for a few other ISPs nearby, but in our own city, we were only providing DSL internet service off of \\*famously terrible phone company's\\* (FTPC) phone lines, not our own infrastructure. \\*FTPC\\* recently decided they were no longer allowing ISPs to utilize their lines to provide internet and so all customers with us were either going to have to go directly to this company for internet or find an alternate provider.\n\n&amp;#x200B;\n\nNow, for the most part, I'm happy that we'll no longer have to support these connections because they generally were very low-speed plans with bad service and troubleshooting them usually meant trying to get \\*FTPC\\* to admit there's a problem and schedule a tech. However, we've had a lot of customers who have been with us for 15-20 years who now have to leave us and many are sad to be leaving, because our call center gives great 24/7 support and \\*FTPC\\* does not.\n\n&amp;#x200B;\n\nAnyway, onto my call. I call this lovely older lady who has already called \\*FTPC\\* to get her service switched to them. Although her service is now active with them, they won't walk her through configuring the modem she has there (which she bought from us only a few months ago) to work on their network.\n\n&amp;#x200B;\n\nI gamely assist her logging into the modem, but the modem won't respond properly to let us change the settings. Since she is already on their network, I cannot login remotely to her modem to make these changes. She also lives too far away to just bring the modem to our office to configure it for her.\n\n&amp;#x200B;\n\nSo, we're basically stuck and cannot get this almost brand new modem to work.\n\n&amp;#x200B;\n\n\\*FTPC\\* is scheduled to come out on Tuesday to fix her connection but this means she'll need to buy a new modem from them as they told her they refuse to touch the 3rd party modem. As a senior citizen on fixed income, having to buy two new modems in a year is a lot. I feel absolutely terrible that I cannot help her get our modem to work, but she is so sweet and thankful to my company for good support for all those years. She is staying as an email-only customer with us, so that's something.\n\n&amp;#x200B;\n\nI decide to ask Customer Service if we can do at least a partial refund for this lady, since the modem is only a few months old and this is such a tough situation.\n\n&amp;#x200B;\n\nHappily, the CSR lead approves the refund (a \\*\\*full\\*\\* refund at that), so I got to call her back to give her the good news.\n\n&amp;#x200B;\n\nI gotta tell you all, I have never felt so good in this job before. This job is not easy and often, I feel like I'm not really doing any good in the world, doing basic tech support. But I will never forget hearing the pure relief and happiness in this kind woman's voice when she said thanks for getting her the refund. Made my entire day.",
        "created_utc": 1537056154,
        "upvote_ratio": ""
    },
    {
        "title": "“There’s no way my security could be blocking your program, it’s your company’s fault!”",
        "author": "weneedthebitter",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9g1svv/theres_no_way_my_security_could_be_blocking_your/",
        "text": "Hello again all, I’m an occasional poster in this sub. I work in a small call center department for a software company, and my calls range from some installations to assisting with payments to “how do I use your program” (also known as “how do I internet?” because usually I end up having to explain what a browser and address bar and system tray are.)\n\nYesterday’s call was not with a caller who didn’t know how to use the internet or our software, but rather, someone who through they knew *too much* about the internet and our software. \n\nMe = obviously me. IT = well, the IT. (I still never got the confirmation of if they were the IT or just someone more versed in software, servers, security, etc. at their shop.)\n\nMe: “Customer Support, this is weneedthebitter.”\n\nIT: “Hi, we are trying to download the update to your program but it’s giving an error saying it can’t connect to the server.”\n\n(Our only really installed program had a small security update that we’ve been trying to push shops to download, as they finally turned on that new security yesterday, therefore rendering the program unusable until you update it. I’ve been doing this for 2 years and have never had a server error message with this program, so I was immediately wary of the situation.)\n\nMe: “Sure, let me remote in and take a look! I haven’t had anyone have any trouble downloading this update, but we’ll get this figured out for you right away.”\n\nI get remoted in and see that even though our program was installed, the shop had been trying to do a fresh installation on top of it, instead of just running the update. I cancel out of the fresh install and try running the update, get a message of “cannot connect to server” or something of that nature. \n\nMe: “I’m going to do a quick little uninstall and reinstall of the program and start fresh, just to make sure nothing strange is going on.”\n\nSo, next I take care of the removal and go into their downloads folder, they have 24 copies of the setup file downloaded, most from that day. I delete them all, download a fresh file, it’s tiny, only a couple of MBs, and try reinstalling. It downloads the file without issue but when it try to install it, the unable to connect to server message happens again. \n\nI quickly install the program on my actual PC (thank you, dual monitors) and it completes within 30 seconds with no issue whatsoever. So, here comes the fun part. \n\nMe: “So, I’m going to check with my tier two on this, but I believe you may have some security settings blocking the installation of the program. Is there any chance we could turn off your antivirus or maybe make sure nothing in your firewall is blocking this update, or is this a laptop and you could take it off your private network and try installing the program off of it?”\n\nIT: “All of my firewalls and antivirus software are turned off, so it absolutely has to be your program blocking it. You need to resolve the issue and allow it to install.”\n\nMe: “Sir, I just installed it on my pc without any issue, and I didn’t get any kind of error messages. I want to take a quick look at your settings and possibly reboot.”\n\nAt this point, he takes control of the mouse and goes through this whole big show of showing the firewall is turned off and the antivirus is disabled, until I notice one thing. Not only does he have a firewall, he has your standard CCcleaner, which is something I’m used to seeing, but he has two anti viruses installed on top of that. One is a program I haven’t heard of, but I’m not super well versed in those since the job usually doesn’t call for it, and that one is disabled. However, the second antivirus is listed as a beta of a different program, and is still on and running, and I can’t find a way to turn it off.\n\nMe: “Alright sir, lets do a quick reboot of this guy since you showed some security was disabled and turned some other parts off, and we’ll see if it works after the reboot.”\n\nIT: “Sure thing, I’ll restart it right now. (A few minutes go past) Oh, it has some windows updates and I’m not sure how long they will take, can you just hold on until it’s done? I already walked away from the PC and I told the guys to call me when they’re installed and it turns back on.”\n\nMe: (dying a little on the inside because who knows the last time he updated windows on this.) Sure thing, I’ll be here and I’ll get with our tier two while we wait to take a look at this message and see if they have advice.” (I normally work remotely and had to get ahold of them via messaging.)\n\nMe: “Hey Tier Two, can I pick your brain for a second? Here’s the situation, troubleshooting I’ve done, and the screenshots. I think something either on the PC or network is blocking us because I could install, and I’ve also never seen this message before.”\n\nTier Two: “Those screenshots are absolutely some kind of network or firewall settings, what they have set up sounds kind of like a mess, so it could be something buried, or could be related to that one beta version antivirus. See if they have another PC they can access off of the network and if it works, that’ll tell whether or not it’s something they need to resolve on their side.” (Our company tries to be hands off with security stuff, to a certain point, since so many places have such varied security setups, and my team is very basic support, not in-depth network or firewall setup and troubleshooting. I’ve learned enough to diagnose when something is our software’s issue or the customer’s issue, and my tier two can get more hands on, so I verify with them whenever possible.)\n\nAfter 10 minutes of leaving me on mute, old IT boy comes back \n\nIT: “Alright, it’s back on and I just tried it and we’re still getting that issue. Have you figured out how to fix this yet so the guys can use the program on this PC?”\n\nMe: “I followed up with our tier two, and they advised it absolutely is a security setting somewhere, could be the antivirus that is still running, could be on your network, at the router level or deeper, depending on the size of it.”\n\nIT: “This is ridiculous, I have all of our security settings turned off and I just verified they were all still off once the PC restarted! What do you recommend we do to fix this?”\n\nMe: “Do you have another PC, possibly off of this network or security settings, that you could get onto or remote into and try this install on? If it works on another PC that would mean it’s something with your security settings still.”\n\nIT: (grudgingly agrees and remotes us in to his personal PC and tries to install the program, it works.) “Okay, well I guess this is something on our end though. I may have to run the install in a certain mode or with different permissions, but we will figure this out.”\n\nMe: “If you need us to send you our whitelisting IPs and addresses, please let me know, because I can get them out to you right now if you’d like.”\n\nIT: “No thanks, we’ll figure this out, bye.”\n\nI don’t know a huge amount about networks and security settings, but I know enough to go “something is fishy here.” I also really don’t want to spend 20+ minutes on a call and mess with my wonderful average handle time, but here we are. \n\nAll in all, happy to see it wasn’t “on us”, but annoyed that they had to fight back the whole way through the call. \n\n",
        "created_utc": 1537021153,
        "upvote_ratio": ""
    },
    {
        "title": "Can I be directed to the SCAM department?",
        "author": "DifferentMacaroon",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fzyv1/can_i_be_directed_to_the_scam_department/",
        "text": "Now, I thought he said \"scan\" at first, so I said, rightly, our directory is just by name, not title or department.  He repeats again he wants the SCAM department, S-C-A-M.  I sigh deeply, anticipating a long call. \n\nMe: Can I get your first and last name to try to pull up any information?\n\nCALLER: Can I get YOUR first and last name?\n\nme: Yes, my name is [first name].  \n\nCALLER: Okay, my name is [first name].\n\nme: and how do you spell your last name sir?\n\nCALLER: what is your last name?\n\nme: I'm sorry, I can't give that out.  I need your last name to direct you to the correct place.\n\nHim: It's [quick garble of letters].\n\nMe: Thank you [still no idea what he said, but whatever], can I get your birthdate please?\n\nHim: What is your birthday?\n\nMe: Mine is October 11th.\n\nCALLER: Okay. Mine is January 8th.\"(no year given). They are good for the lottery.\n\nMe (trying to be congenial): Oh I've never tried the lottery, maybe someday!\n\nHim: you're telling me you can't afford a $1 lottery ticket?\n(me: seething internally, I don't get paid enough to deal with people like you)\nme: nope! I'd rather buy groceries!\n\nWe go back and forth for another few minutes.\n\nI finally drag the year out of him and which state he's in.  \"Oh I see you have a policy here with [disability/short term/individual/etc].\"\n\n\"Oh, yeah, huh, that does sound familiar.  Okay, transfer me over to them.\"",
        "created_utc": 1537000270,
        "upvote_ratio": ""
    },
    {
        "title": "\"i hope you (bleep)ing DIE\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fylmj/i_hope_you_bleeping_die/",
        "text": "[deleted]",
        "created_utc": 1536983829,
        "upvote_ratio": ""
    },
    {
        "title": "\"I HOPE YOU FUCKING DIE\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fyjht/i_hope_you_fucking_die/",
        "text": "[removed]",
        "created_utc": 1536983221,
        "upvote_ratio": ""
    },
    {
        "title": "But you could be faking all of that!! (“That” being an entire company I guess)",
        "author": "marigoldsnthesun",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fyi6m/but_you_could_be_faking_all_of_that_that_being_an/",
        "text": "So I used to work for a call center that handled essentially pleasantry calls for car dealerships. We made survey calls for people who are already visited the dealership, called people who have put their number in online to find out what they wanted, and called people who had already bought from the dealership to see if they wanted to trade in their car. It’s a nice little racket, right? \n\nWell, one of the surveys that we do for dealerships is after a customer’s car is serviced, we call just to get a “1-5” rating for things like speed, friendliness, all that BS. normally, people are more than happy to comply for thirty seconds and just get it out of the way so that we can get off the phone. No one really wants to be on the phone with the call center, least of all the people in the call center. \n\nBut this lady.\n\nWe’ll call her Crazy Eyes, on account a her paranoid tendencies. \n\nCrazy Eyes: who is this?\n\nMe: This is Mari, calling on behalf of such and such dealership, how are you today?\n\nCrazy Eyes: what do you mean “””ON BEHALF OF”””??? Where did you get my number????\n\nNow, I get this kind of called fairly frequently. People who don’t understand why some Rando’s calling them out of the blue to ask about their service. The “on behalf of” Sometimes freaks people out, but for the most part they ignored it. This lady however, was already very very close to shouting on her second sentence. Not to brag, but for the most part, when people got off the phone with me, they were substantially happier than they were before they got on the phone. So I try to explain:\n\nMe: oh, well, I’m calling on behalf of such and such dealership just to find out how your service was. I’m not trying to ask you anything invasive, I just have a few simple questions. Is that OK?\n\nCrazy Eyes: NO that is NOT OKAY. I HAVENT LIVED THERE IN TWO YEARS HOW DID YOU KNOW WE USED TO GET SERVICE THERE?? WHERE DID YOU GET MY NUMBER?? \n\nNow I thought, foolishly, that she was right to be a little bit worried that someone had gotten a hold of her phone number, I mean, I hate when that happens. But she was already shouting, and I haven’t even asked her how her service was yet. I go on. \n\nMe: well, I’m sorry for the confusion, but my records indicated that you had recently received service with this dealership. If that’s not the case, I would be more than happy to update our records to reflect-\n\nCrazy Eyes, now at top volume: NO!! I WANT TO KNOW WHO YOU ARE AND WHY YOURE CALLING MEEEEE! THIS IS A SCAM! WHY ARE YOU SCAMMING ME?\n\nMe, still trying to de escalate the situation: I work in a call center located in such and such USA, our call center is called FakeName McCall Center, I mean, if you really want to look us up, we have a website and a rating with the Better Business Bureau. We are legitimate business who has been hired by the dealership just to survey customers on their overall experience. We are not a scam.\n\nCrazy Eyes, now surprisingly calm (and maybe a bit smug?): You could fake all that, couldn’t you? You could make all of that fake. \n\nMe, more confused and emotionally whiplashed than I have been all day: I mean?? I guess?? We could? But to what end? Why would we do that?\n\nAll of which I said out loud, very sincerely confused, and she promptly hung up on me. \n\nI didn’t even get coached on it, ",
        "created_utc": 1536982863,
        "upvote_ratio": ""
    },
    {
        "title": "So I work in what you would call Call Center IT",
        "author": "floznstn",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fy3yq/so_i_work_in_what_you_would_call_call_center_it/",
        "text": "Those workstations and phones, or if you're remote... The cloud solution your employer chose... That's my bread and butter.\n\nJust a tip y'all... It's 2018, you really should be comfortable with basic computer tasks.  Chances are your local admin has better things to do than demonstrate single-sign-on for the nth time.\n\nAlso if you are remote and have 20 different search bars embedded into an outdated version of chrome running on xp... Fuck you.",
        "created_utc": 1536979065,
        "upvote_ratio": ""
    },
    {
        "title": "I just realized I think I’ve been working at a call center for a year without knowing it.",
        "author": "Theoriginalyosh",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fxlin/i_just_realized_i_think_ive_been_working_at_a/",
        "text": "I just realized I think I’ve been working at a call center for a year without knowing it. \n\nSo you tell me. \n\nOn mobile yada yada format \n\nHere’s what my day consists of\n\nI answer calls for both our mainline &amp; our paratransit service\n\nMost mainline calls are asking where &amp; when &amp; what bus they need. I also take complaints get yelled at because the bus is not at their stop the second the schedule says it’s supposed to be. \n\nI also handle all the reservations &amp; dispatching for our paratransit door to door service for the elderly &amp; handicapped. I also process applications for the service as well. \n\nI work nights &amp; with us being short a person am here for about 1/2 my shift by myself. \n\nI average about a 100 calls a day on a regular day most lasting less than a minute.  My paratransit calls can last considerably longer as we are setting appointment times for transportation. \nI think the most calls I’ve had in a day was around 300. \n\nI really haven’t considered this a call center job till just recently because of dispatching duties and the fact I’m responsible for making sure drivers get their paratransit passengers to their destinations on time. \n\nAnyway way that’s me. \n\nDo I work in a call center?? 🤓\n\n\n\n\n",
        "created_utc": 1536974226,
        "upvote_ratio": ""
    },
    {
        "title": "Yea he definitely cant come to the phone right now",
        "author": "Waffles4cats",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fxdik/yea_he_definitely_cant_come_to_the_phone_right_now/",
        "text": "So this started as a pretty routine call, account cancellation as they no longer had the car (onstar like service). \n\nMe: Hello, thank you for calling SERVICE my name is Waffles4cats, How can I help you?\n\nLady: I want to cancel my sons account, he not going to be driving the car anymore\n\nMe: Certainly  i can assist with closing the account.... {finding account}....Oh i see that you son is the only one listed here but if we can quickly verify his information with him then we will be all set. Is he available to speak with us real quick?\n\nLady: No, He was murdered 6 months ago....\n\nlet just say I was shocked enough I momentary lost all call face\n\nMe: Oh my god I'm sorry! That's horrible!\n\nLady: Oh thanks I appreciate it...\n\nSo we had procedure for deceased account owners and we do that for her but the rest of the call was awkward and gut wrenching i opted for a different end than \"have a nice day\". I was curious so I looked up the name and state and it was apparently a high profile state wide case and was apparently a pretty graphic murder.",
        "created_utc": 1536972116,
        "upvote_ratio": ""
    },
    {
        "title": "he was worried, and so he did....nothing... but i should change the situation (when i am not able to do anything, because he is responsible)",
        "author": "Catriona_Niamh",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fsyh3/he_was_worried_and_so_he_didnothing_but_i_should/",
        "text": "the second one for today (i hope it is okay?)\n\n&amp;#x200B;\n\na guy in his late 20s.\n\n&amp;#x200B;\n\nThe situation: we got feedback about this client - and what we knew, could have meant he would not getting money from my part of the social service for some time (a penalty for not playing by the rules).\n\nso, from the rules and law, we had to stop the money, get him an appointment and talk about it. And then the decision will be made, if the penalty has to take place or if he gets the money for the whole period.\n\nthis appointment was delivered personaly with the postal service (a special kind of letter he has to sign for getting it).\n\nin the letter it was also clearly stated, that because of some part of the law, this appointment is mandatory for him. and if he does not partake, he will be no longer our client (till the day he is personally in our office at the social service).\n\nhe was also noticed about the situation, that we had to clear this situation with him and therefore his money stopped with date x.\n\n&amp;#x200B;\n\nhis appointment was two days ago - he did not come - he is no longer our client (and can no longer get any money, till he is in our office in person.)\n\n&amp;#x200B;\n\ni will be me - he will be wd (worried dude)\n\n&amp;#x200B;\n\nme: standard greeting procedure...\n\nwd: hello, i want to talk about the last payment i got from you. it was not enough.\n\nme: sure, (identification process so i would be able to talk with him about his money).\n\nme: so i see, we have to clear a situation with you and you got an appointment to clear it up - and it was two days ago.\n\nwd: yes, but i got too less money from you guys and how should i live without the whole money?\n\nme: before we can decide about the money from day x on, we have to talk with you in person - you got your appointment because of this and it was mandatory. but you were not there.\n\nwd: yeah..because i knew ahead, that i got too less money and i was worried\n\nme: okay but we cannot to anything on the phone, we need you in person. and also, because you did not show for your mandatory appointement, you are no longer our client - till the day you are in our office in person. (looking at the clock) the office closes in 40 minutes - if you are near, you can make it today! and i would recommend it strongly!\n\nwd: today is too difficult for me, maybe i will come on monday.\n\nme: if you come on monday, you will only be our client from monday on - and you will not be able to get money for the days you were not our client.\n\nwd: but i what should i do?\n\nme: come to us, when we are open, as soon as possible!\n\nwd: but i want now a decision about the money, i need to know it now.\n\nme: i am sorry, but i cannot do anything for you. No phone calls will change anything about the situation. Onle when you are in person in our office, we will be able to clear the situation with you and decide about the money from day x.\n\nAnd you will get no money from two days ago till the day you come to us and talk to us.\n\nwd: it is unfair, i need it know and somebody had to talk with me about it sooner\n\nme: yes we know, that is the reason you got your mandatory appointment for two days ago.\n\nwd: i knew but i was worried!\n\n&amp;#x200B;\n\n..... and so on.. a  few more circles.\n\nhe was a bit too slow in his responses for a comfortable call (you know - nothing wrong with taking your time - but the silence before he answers..everytime.. and i knew his data, as far as we know he had no limitations or illness.\n\nif i had to guess, i would guess some drugs/meds.\n\n&amp;#x200B;\n\ni also got no answer, why he decided to not show up for his appointment (only, he was worried!) but did not want to do something about it as it seems.\n\n&amp;#x200B;\n\ni hope in the end it was really clear for him, that no future phone calls will help and he has to come to us.\n\nbut... i fear.. he  will call a few times..maybe a few days between.. till he comes to us...\n\nand everyday he does not show up..he loses the money :((\n\n&amp;#x200B;\n\nfor somebody needing this money urgent.. it would be better for him, to do something to clear all up and then be again our client and getting money.",
        "created_utc": 1536938937,
        "upvote_ratio": ""
    },
    {
        "title": "sad one - uncle tells us, our client is dead - and to not be able to really help",
        "author": "Catriona_Niamh",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fqljz/sad_one_uncle_tells_us_our_client_is_dead_and_to/",
        "text": "a few minutes ago i got a call - me will be me, caller will be u (uncle).\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nme: normal greetings procedure\n\n&amp;#x200B;\n\nu: hello, i am the uncle of Name Lastname, do you need his social security number?\n\n&amp;#x200B;\n\nme: yes please (thinking about data protection and what the uncle would want and how i maybe have a bad call because often family members do not understand, that we cannot talk with them about our clients data)\n\n&amp;#x200B;\n\nhe gives me the number\n\n&amp;#x200B;\n\nme: thank you, how can i help you?\n\n&amp;#x200B;\n\nu: there is no help possible\n\n&amp;#x200B;\n\nme: ? (he was not unfriendly, was a little slow in talking, but as i knew why he called it was understandable because he was grieving and it was a hard situation)\n\n&amp;#x200B;\n\nu: my nephew died this night\n\n&amp;#x200B;\n\nme: i am very sorry.... my condolences (feels empty.. i cannot say something to really help or make it better. in my experience: keep the call short and let people grieve without me to hear it is better).\n\n&amp;#x200B;\n\nme: i will notice the responsible coworkers and if we need something to close the case, we will write a letter. (because, sometimes there are further steps needed when money is in the game and it has to be decided, who gets the last money till the death :(( )\n\n&amp;#x200B;\n\nu: When something it needed, write at Mrs Name Lastname..she is his mother, but she is not able to call in the moment.\n\n&amp;#x200B;\n\nme: that is very understandable. i am verry sorry for your loss. Thank you for the Information. i wish you and your family strenght in this hard time. \n\n&amp;#x200B;\n\nU: good bye\n\n&amp;#x200B;\n\nme: good bye\n\n&amp;#x200B;\n\nsuch calls are never nice (how could they - somebody died :( and we are talking with grieving relatives) but it always feels, my words are lacking.. the callers do not want really to talk to us and are \"happy\" when the call is short (they only want to give us the information). \n\n&amp;#x200B;\n\nhow is it for you? do your customers/clients want to talk more with you or is it the same? \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created_utc": 1536917852,
        "upvote_ratio": ""
    },
    {
        "title": "Free Talk Friday - Sep 14",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fpl47/free_talk_friday_sep_14/",
        "text": "Welcome to Free Talk Friday! We are suspending the usual 'tales only' rule within this thread (other rules still apply) meaning you guys can talk about whatever you like and let your hair down.\n\nP.S. If you want to have a rant about something, head over to /r/callcentres as you'll find the Weekly Rant &amp; Rage Thread has just been posted.\n",
        "created_utc": 1536905194,
        "upvote_ratio": ""
    },
    {
        "title": "No, I will NOT give you the information you need to help me!",
        "author": "SpikeVonLipwig",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fomdl/no_i_will_not_give_you_the_information_you_need/",
        "text": "Preface: I don't work at a call centre per se, but I do work at a company which does a lot of incoming and outgoing calls and a central database of customers where the data is provided by them.\n\n\nMe: Good afternoon, *company name*, how can I help?\n\nLady: Do you have someone called Dave in your office?\n\nMe: We do, but he's gone home for the day, is there anything I can help with?\n\nLady: He keeps calling my number, the call is for someone else though. He has the wrong number.\n\nMe: Oh, I am sorry about that. I'll pop him a message now and let him know that the number is wrong. Your number hasn't come up on our phone system though, it's just showing as 'Anonymous', so would you mind...\n\nLady: Oh no. I don't give my number out. That's private. I don't want people calling me.\n\nMe: I understand that, but if someone has accidentally input your number in to our database I'll need to know what the number is so I can delete it and you won't be call...\n\nLady: I. DO. NOT. GIVE. OUT. MY. NUMBER.\n\nMe: If I don't take your number, I can't put any notes on the system or delete the number from the wrong account.\n\nLady: Well I'm not giving out my number. That's private.\n\nMe: Well then unfortunately there is nothing I can do, if I don't know what number to tell Dave not to call, I can't guarantee he won't call you. \n\nLady: Well that's FINE, I'll just keep ignoring his calls then!\n\nMe: Ok, have a day.",
        "created_utc": 1536895146,
        "upvote_ratio": ""
    },
    {
        "title": "Customer Threatening Suicide &amp; rant",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fmno0/customer_threatening_suicide_rant/",
        "text": "[deleted]",
        "created_utc": 1536878784,
        "upvote_ratio": ""
    },
    {
        "title": "Screw saftey, why is my data slow?!",
        "author": "D0nkeyTamer",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fkafl/screw_saftey_why_is_my_data_slow/",
        "text": "As you all are well aware, there is kind of a storm on the East coast severe enough to warrant evacuation.\n\nSo I get this call 10 minutes left of shift the other day from a guy in that area. Before I could finish my greeting, he starts getting aggro with his Cletus accent.\n\nApparently, he was talking to tech when the call dropped and instead of waiting for a call back, he calls immediately as if that's going to somehow do something productive. You see, there are 3 centers closed because of those storms and I'm sure cell towers don't like being backhanded by mother nature either.\n\nHis problem that justified dropping an F bomb every other word? Towers were struggling to deliver consistent high speed data. I'm thinking the whole time \"Seriously dude? You're on the coast with this nationally known hurricane and all you can think about is Netflix buffering?\"\n\nHe babbles on for awhile while I pretend I wasn't speaking to a complete and utter donkey of a man until he says he's getting a call back from the agent he was talking to earlier. Since my shift was coming to a close, I drop out of the call with a sigh of relief.\n\nI've given customers lots of breaks when they call in during emergencies, but this guy was a moron. Yes, the cell company I work for sucks because our towers aren't sprayed down with hurricane repellent.",
        "created_utc": 1536861680,
        "upvote_ratio": ""
    },
    {
        "title": "“I haven’t been able to access my online account!!”",
        "author": "Melly520",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fdptt/i_havent_been_able_to_access_my_online_account/",
        "text": "So I work as a customer service rep for a catalog company. I’ll be M for Me and DL for Dumb Lady\n\nM: Customer Service Department, this is M, how may I help you?\n\nDL: Yes I’ve been having trouble logging into my online account for forever now! It gives me an error message so I’ve had to place my orders by phone!!! \n\nM: Okay so what does the error message say?\n\nDL: It says “Username or password combination is incorrect” \n\nM:... So did you try resetting your password??\n\nDL: No because I want my password to stay the same!\n \nM: ...If you want to be able to access your account you have to reset your password so you can actually log in and place an order..\n\nDL: *huffing and puffing* Is that the only way?!\n\nMe: Yes\n\nDL: *hangs up*\n\nShe did not even try to reset her password even after the messages she kept getting when she tried to log on. I just... ughhh.",
        "created_utc": 1536802103,
        "upvote_ratio": ""
    },
    {
        "title": "Customer gets a taste of his own medicine.",
        "author": "MinervaJB",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fcz8r/customer_gets_a_taste_of_his_own_medicine/",
        "text": "I work for a credit card company on a European country where cards work with chip and pin. It was like my third week at the company, though I've been working in call centers for a few years. The calls from people that are not aware how compound interest works are its own kind of fun, but this one was not about that.\n\n&amp;#x200B;\n\nI'll be Me, asshole customer will be AC.\n\n&amp;#x200B;\n\nME: I'm Minerva from *Company*, how can I help you today?\n\nAC: We'll see if you can help me with anything because this card is shit and my pin it's not working.\n\nThe customer goes on a rant about how much we suck and I pretend to listen while I look him up in the system. Like I said, it's my third week so everything is new for me and the customer is talking with that kind of polite derision that makes you feel awful but doesn't justify you hanging up. I make the usual checks and everything seems okay, the card is activated, the system shows there's a pin configured for it, and surprisingly, there's a big fat 0 in the \"incorrect pin attempts\" field. There's no denied transactions either.\n\nME: Everything looks fine on our end, sir. Can you tell me the last numbers of the card to make sure we're talking about the same card? Are you using the last one we sent you?\n\nAC: Of course I am using the last one, do you think I'm an idiot?\n\n*Yes, I do, but the satisfaction I would get from telling you is not going to feed me, so...*\n\nME: Of course not, Sir, but I needed to make sure. If you like we could send you a text with the PIN number in case you've forgotten or you're inputing the wrong one, sir.\n\nAC: I know the number, the problem is your fucking card not recognising it. Are you going to fix it or what?\n\nI suspect the customer is using the wrong card, because otherwise the system would be showing denied transactions and the reason why they're being denied, but I don't want to make him angry enough he ends up insulting me and having to hang up.\n\nME: I'm going to check a few more things, please hold.\n\nI flag down a supervisor, who is puzzled about the card not recognising the pin number and suggests sending the customer a new plastic. I go back to the call.\n\nME: Thank you for waiting, sir. I can suggest that we...\n\nThe customer interrupts me.\n\nAC: Wait a moment, your card says \"*company completely unrelated to the one he's calling t*o\"?\n\nI remove the microphone to snort.\n\nME: Well, sir, like I said when I answered your call, you're calling \"*Company*\", obviously the card says \"*Company, catchy trademarked slogan everyone in the country is familiar with*\". Maybe we should check the card's last numbers after all?\n\nOf course, they don't match. I hear him rummage in his wallet to fish another card. He sounds a lot more humble when he speaks again.\n\nAC: The last numbers are such, such and such, maybe?\n\nME: That is the card I see, yes.\n\nAC: Well, they look alike, same color and everything, it's not so big a mistake...\n\n&amp;#x200B;\n\nOf course, he was using a credit card from another company that incidentally, is the same color. The logo and the company name is pretty big and easy to see, however. He didn't apologise and had me look up the transactions for some reason, while I treated him with the same polite derision he had been using before, being subtle enough that I couldn't get penalised for mistreating a client while it was obvious that I thought he was an utter moron.",
        "created_utc": 1536795983,
        "upvote_ratio": ""
    },
    {
        "title": "YOU NEED TO FIX THIS NOW!!",
        "author": "burntoutCC",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9fbbfm/you_need_to_fix_this_now/",
        "text": "**Not the Bank Fix it, Not our Card division fix it, but ME PERSONALLY, burntoutcc better fix this!**\n\nCustomer calls in being denied by the fraud team at the vets office. The amount of the charge was over $300... the vets office was in her town, she had plenty of money, so I totally get she was upset.\n\n&amp;#x200B;\n\nBut CHILL. You gotta stay CALM!\n\nAs SOON as I answer the phone you hit me with \" You better fix this shit right now\"... oh honey... you dont do that to an anxiety ridden 24 year old female who is on her 60th call of the day.\n\n&amp;#x200B;\n\nHow about give me a damn chance?\n\nShe then goes on to say (im sure everyone in the vet is listening) That she will come right to the bank and close all 3 accounts and withdrawl her 29 thousand dollars la da dee da. Lady!! YES COMPARED TO ME U ARE RICH, HOWEVER you and I both know damn well that deposit for the $29 grand just came in today.\n\n&amp;#x200B;\n\nYes the fraud team is super frustrating, I know your stressed out because your pup is at th vet and a declined card on top of it is bull crap; but watch yourself.\n\n***WATCH YOSELF!!***\n\n&amp;#x200B;\n\ntruly yours,\n\n**BurntoutCC**\n\nSouth Carolina",
        "created_utc": 1536783551,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'm not sure that's legal.\"",
        "author": "jrs1980",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9f8nmi/im_not_sure_thats_legal/",
        "text": "I took a call yesterday from a 70+ year old man (seemed to have all his faculties) who is halfway through his 4 year loan with us. He wanted to get a hold of the manufacturer to have them come pick up his bed. Seems he bought a new car and can't afford the bed payments anymore. I advised he is not able to cancel the contract, and is still responsible for the loan.\n\nMe: There was a period in which you could cancel the sale, but that's long passed. They won't be picking up the bed.\n\nGentleman: Hmmm, may I ask why?\n\nMe: Sir, you've been using the bed for two years. They are not able to resell the bed at this point, it has no value to the manufacturer.\n\nG: I wasn't told about any of this.\n\nMe (that's totally not true): It's stated on the contract right below where you sign. I'm happy to send you a copy if you like.\n\nG: No, that's okay. I think I'll just consult with my lawyer, this *can't* be legal.\n\nMe: That's fine, sir, could you tell me the name and phone number of your lawyer so I can note it on your account?\n\n--click--\n\n\nNobody else wants your bed, dude.\n\nHow do you live more than 7 decades on this planet and be shocked that you can't just \"j/k never mind lolol\" a legal document after TWO YEARS? And we have like $70 million outstanding bruh, but I'm so sure you and Clarence Darrow reincarnated over there are going to find a loophole and take us down.\n\nAs an aside, I *love* the response we have when the customer invokes the ALMIGHTY LAWYER ZOMG. \"Mmmkay, I'll write that down right where I note that you prefer 'Bob' to 'Robert', cuz it's just as important.\"",
        "created_utc": 1536765460,
        "upvote_ratio": ""
    },
    {
        "title": "But you are the one who forgot",
        "author": "JFizDaWiz",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9f83rv/but_you_are_the_one_who_forgot/",
        "text": "Background: I recently left a call center supervisor position to start working at another call center from home starting at the bottom of the chain but making more money (why was I making less money as a supervisor than the agents who don’t even have to leave their house?!? and why didn’t I do this sooner)\n\nWell the company I work for now is pretty laid back, the customers are overall much nicer. No longer working for a telecom where every customer is an asshole I work for a phone manufacturer (NO MORE BILLING!)\n\nNow I said most people are nicer but you still get an asshole (only had about 5 in a month vs 5 outta 6 calls)\n\nOk on with the story. \n\nCustomer calls in because he had an issue with his device and had to reset it, now when you reset the device not through the settings but a restore via PC software it locks it until you can input your username and password. The customer forgot his password. Ok no big deal let’s walk through resetting the password first. \n\nNow when I’m having him reset the password we find out he has 2FA enabled so he has to get a text message with a verification code. Alright no big deal, the website gives a hint on the phone number and you have to type the full number in. Customer also doesn’t remember what number he set it up with. Awesome. \n\nOk, if you don’t know the number you CANNOT continue with a password reset. Now he’s really mad and cursing me out. \n\nFINE, we have ANOTHER method. If you have proof of purchase for the device to prove ownership we can submit a request to turn this lock off. Oh......you no longer have that. \n\nMore cursing. Just let’s be clear, YOU forgot your password, YOU forgot the phone number set up, YOU didn’t keep a copy of the receipt of your $800 purchase. But I’M the asshole. \n\nI think at one point he said he was going to sue us.\nNow at this new job if you are unable to confirm resolution you have to transfer to Tier 2. I felt so bad for the lady I had to transfer to :(\n",
        "created_utc": 1536761486,
        "upvote_ratio": ""
    },
    {
        "title": "Is this real life?",
        "author": "startingover815",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9f5loe/is_this_real_life/",
        "text": "Me: thank you for calling (insurance company) claims support how can I help you?\n\nC: I had an accident on my motorcycle I need to make a claim\n\nMe: I'm sorry to hear that are you ok?\n\nC: yeah I wasn't hurt just the bike\n\nMe: ok that's good well let me go ahead and get this started here\n\nI look up is info get him verified and a claim was already submitted\n\nMe: alright so it looks like a claim was already filed here let me just-\n\nC: what do you mean a claim was already filed? Who filed it? I was alone\n\nC begins ranting about how he rolled his bike in an off-roading incident and that a couple friends were there but they shouldn't have been able to call\nAs he is ranting I look through the claim, it's new so not a lot of notes but it lists him as the original caller... As I am not a licensed adjuster I have a little wiggle room with what I can or don't have to divulge... \n\nMe: I'm sorry sir I would not have access to that information to see who filed the claim but I can certainly note your concerns but your claims rep can look into that for you, but a claim is filed and we have your contact info (gave expectations for the claims reps call yada yada)\n\nDefinitely put in my note that it listed him specifically as the caller and that he was upset the claim was already filed when he called in...\nIt could have been a mistake on the previous claims processor's end but we are supposed to list who the caller is and then if the insured is a different person list their relationship to the claim or why they are filing. I did not want to go down that rabbit hole in case this poor guy had amnesia or something because I do not have the qualifications to discuss anything like that. \nDefinitely a doozy",
        "created_utc": 1536737098,
        "upvote_ratio": ""
    },
    {
        "title": "Well that was uncalled for.",
        "author": "startingover815",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9f5dpf/well_that_was_uncalled_for/",
        "text": "Me: thank you for calling (insurance company) claims how can I help you\n\nCustomer: I need to make a claim\n\nMe: ok I can help you in filing a claim today are you ok?\n\nC: what yeah I have a leak in my roof\n\nMe: oh ok this is actually the auto claims department but let me see if I can get you over to someone to help with your home owners claim. Do you by chance know who your home owners policy is underwritten by? \n(It's not common people understand that our company supplies homeowners policies but they are underwritten by home insurance companies we work with so they can bundle things like home and auto to get better rates, so usually the answer is no)\n\nC: what do you mean I have insurance with you that's why I'm calling you...\n\nMe: (basically explains underwriters and how it works) ... Do you know your policy number?\n\nC: uh no can you look it up? *Said in a mocking tone*\n\n*Finally find what looks like her policy but two separate home owners policies come up for two different houses with the same address listed for mailing*\n\nMe: *I explain what I found and advise that I wouldn't have access to which physical address is listed as the insured home* but if you'd like I can get you to policy services or give you the phone numbers to both-\n\nC: WTF do you mean two policies??\n\nMe: according to my system there are two active home owners policies under your information, if this is incorrect I can-\n\nC: dumb bitch *click*\n\nCool. Yeah. Sure. Whatever makes you feel better about yourself...",
        "created_utc": 1536734671,
        "upvote_ratio": ""
    },
    {
        "title": "A day of Mr. Squeaky, the Bullying Dissenting Constituent",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9f5aol/a_day_of_mr_squeaky_the_bullying_dissenting/",
        "text": "[deleted]",
        "created_utc": 1536733681,
        "upvote_ratio": ""
    },
    {
        "title": "The tale of the \"Unauthorized\" accounts",
        "author": "cliffthecorrupt",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9f4sve/the_tale_of_the_unauthorized_accounts/",
        "text": "So this happened this morning. I work for a subscription service. \n\nI'm: cliff\nThey are: Confused Customer (cc) \n\nMe: Thanks for calling, my name is Cliff, can I get your first and last name and your email to start a ticket? \n\nCC: I don't want a ticket, I want to know why you charged me three times in one month and I don't even have [your service]. \n\nMe: I can definitely understand the importance of verifying the charges you received, can I get your name and email address? \n\n[insert verification process here] \n\nMe: Thank you CC, have you ever had service with us before, including trial service? \n\nCC: I had service once but I canceled that a long time ago. \n\nMe: Okay, is your email address the one used when the account had been created? \n\nCC: Yes but I'm telling you I don't have service. I'd like a refund for the charges I received. \n\nAfter some review, I find that the customers email was submitted with different typos 3 times one day after the next. Which is bizarre because that would mean the customer would have to have gone in and went through the entire activation procedure 3 times before contacting us just to tell us they didn't have any service at all. \n\nMe: Thank you for your patience, I searched the first part of your email I was able to locate some accounts that appear to be made with typos. \n\nCC: This is ridiculous, how could this happen? Do I need to call my bank? \n\nMe: Because some of these subscriptions, I can have my support team look further into the accounts for a possible refund. \n\nCC: How long is this going to take? This is fraud and I don't appreciate my money being taken. I got over drafted 3 times! \n\nMe: Well our support team works Monday through Friday, they give us a maximum timeframe of 48 hours to answer any number o-\n\nCC: This is ridiculous, I'm calling to have you cancel these fraudulent charges. Are you trying to scam me? \n\nIt was at this point that I just robot-mode the call. The caller is either completely full of shit or the dumbest person ever. Occams razor says that nobody is fraudulently signing up for a subscription service with the same email and credit card information 3 times. There would be no value in it. \n\nI swear to you that sometimes these calls make me curious how some people even continue to live every day lol. I'm abundantly aware that callers who are calling in for billing or technical support are usually at their wits end and need assistance, but holy moly.",
        "created_utc": 1536728192,
        "upvote_ratio": ""
    },
    {
        "title": "He's paying less? Not on my watch",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9f4pfk/hes_paying_less_not_on_my_watch/",
        "text": "[deleted]",
        "created_utc": 1536727216,
        "upvote_ratio": ""
    },
    {
        "title": "“Sorry, I can’t talk right now”",
        "author": "Enderdidnothingwrong",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9f12j4/sorry_i_cant_talk_right_now/",
        "text": "[removed]",
        "created_utc": 1536697674,
        "upvote_ratio": ""
    },
    {
        "title": "How do you get out of call center jobs and into a better role?",
        "author": "Morgan512",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9f0goe/how_do_you_get_out_of_call_center_jobs_and_into_a/",
        "text": "As someone who got caught in this hot mess of a job, I find it difficult to escape this black hole I hopped in one day when I just needed something to hold me over. Now, I've done this similar role for 5 years. I hate it. I need some advice to escape this deep dark hell I call a job. hahaha \n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created_utc": 1536693329,
        "upvote_ratio": ""
    },
    {
        "title": "Cx says our card doesn’t work, forgets she used it and it’s our fault.",
        "author": "talensoti",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9f0ab4/cx_says_our_card_doesnt_work_forgets_she_used_it/",
        "text": "Just happened. I work at a reward card center and this little peach calls in\n\nCx: Your F^*^%# card don’t work! I can’t pay my bill or nothin with it!\n\nMe: *Opening Spiel* then “I’m sorry ma’am may I have the card ID on the back of the card?\n\nCx: Mrs entitled bitch at bitch lane, bitchlandia, 60666\n\nMe: okay I see that the balance of your\nCard is 87.xx left\n\nCx: why? (Our cards come in $100 incriments. \n\nMe: it shows that there was a purchase at knockoff seafood on xx/xx\n\nCx: well I don’t know how that’s possible, the cards never left my purse. \n(To someone else) f$&amp;@&amp;s tellin me that I used my f-ing card when I didn’t. \n\nMe: well miss all I can recommend is that you go to the location at xxxx and dispute the charge as we cannot dispute it here for you. \n\nCx: Listen to the words from my mouth.  I. Did. Not. Go. To. No. Restaurant.  Get me your supervisor. (To other person) all of them are scammers. \n\nMe: (gleefully) please hold!(muted) have you ever thought that your husband of kids got the card, moron or you just don’t remember?\n\nI know our supervisor que is a 10-15\nMinute wait time. After 10 minutes she hangs up.   \n\nI note in the system that Cx is abusive and to immediately xfer call to supervisor if she calls back. \n\nBe a bitch to me will you?\n\n",
        "created_utc": 1536692054,
        "upvote_ratio": ""
    },
    {
        "title": "He forgot where he parked a rented car",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9ezg1v/he_forgot_where_he_parked_a_rented_car/",
        "text": "I used to work taking inbound calls for the credit card department of a bank.\n\nMe: Yours truly\n\nC: Customer\n\n&amp;#x200B;\n\n\\*After giving my standard greeting and asking for his name\\*\n\nMe: How may I help you today Mr Customer?\n\nC: I lost the car.\n\n\\*Since this is a bank I assumed I misheard him and he actually say \"card\".\\*\n\nMe: I understand this is a distressing situation Mr Customer, but don't worry we are here to help you. We can file a missing card report, review the last transactions to make sure there are no fraudulent transactions and then we'll send you a new card.\n\nC: What? No! I said CAR not CARD. C-A-R. Are you deaf?\n\nMe: So you lost your car?\n\n\\*I was super confused what does that had to do with us\\*\n\nC: Ugh! Are you being difficult on purpose? Yes I lost a car but is not mine. Is rented. I forgot where I parked it. Don't you have insurance for that?\n\n\\*So, I'm not liking this dude attitude but whatever. I understood now what he needed and I was going to have to transfer the call to another department anyway.\\*\n\nMe: I see. So you are calling  about our Auto Rental Insurance. We'll be happy to help you sir.\n\nC: Well, I'm not happy. I forgot where I parked a rented car. You have to fix this.\n\n\\*I asked for the information I needed and checked the account. I just needed to find the transaction in the Rent-A-Car place and then I'll transfer the call to the department that could help him. The thing is, I was not able to find the transaction\\*\n\nMe: Excuse me sir, when did you rented the car?\n\nC: Yesterday afternoon, why does it matter anyway?\n\nMe: Is just sir, that I can't find the transaction.\n\nC: Well, you wouldn't, I didn't use my card with \\*Bank's name\\* to rent it. I used \\*Another bank's name\\*\n\n\\*So, this guy didn't even used our card to rent the car, why on the earth he called us instead of calling the other bank was beyond me.\\*\n\nMe: I'm sorry sir, but if that's the case you need to contact \\*Another bank's name\\* There is nothing we can do for you.\n\nC: But your ad say you offer insurance for rented cars! It is fake advertisement then! You know you can be sued for that!\n\nMe: Sir we offer Auto Rental Insurance when you rent the car using our credit card. If you rent the car using a \\*Another's bank name\\* card, then you need to contact \\*Another's bank name\\*\n\nC: But they don't offer Auto Rental Insurance, you do! You have to help me! I have a card with you, I'm your customer too, not only theirs.\n\nMe: Yes sir. But in order to be convered by our Auto Rental Insurance you need to rent the car with out card. If that is not the case then...\n\nC: That's just stupid. This policy is stupid, this bank is stupid. You are stupid too!\n\nMe: And yet I have never forgotten where I parked a rented car.\n\nHe was silent for a couple of seconds, that was enough for me to regret saying that out loud. But there is no point of crying over spilled milk and all that.\n\nC: HOW DARE YOU...\n\nMe: Thank you for calling \\*Bank's name\\* Have a nice day Mr Customer. Bye!\n\n\\*Call disconnected\\*",
        "created_utc": 1536685916,
        "upvote_ratio": ""
    },
    {
        "title": "Calling prepared isn't hard!",
        "author": "br4tty",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9eytfi/calling_prepared_isnt_hard/",
        "text": "I work in local government (think Parks and Rec)\n\n**Resident:** Hi! Do you have the number for hazardous waste pickup?\n\n**Me:** I sure do! It's 123-\n\n**Resident:** Oh! Hold on, let me get a pen!\n\n**Me:** *eye twitching furiously*\n\nThis is incredibly common and one of my biggest pet peeves. It drives me nuts on a normal day but I just started back on my brain fixing meds (yay short staff and extra bitchy calls!!) so my emotions are way out of proportion and I want to scream.\n\nThanks for letting me vent. I hope all your calls are smooth and unremarkable today.",
        "created_utc": 1536681617,
        "upvote_ratio": ""
    },
    {
        "title": "If you scream at your Rep, you GET NOTHING",
        "author": "Betteroffdeaderer",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9exuaj/if_you_scream_at_your_rep_you_get_nothing/",
        "text": "Set scene: I work in customer service for a large shopping network. My whole job is fixing problems. I like fixing problems. Little old lady calls in with a problem. Great!\n\nOld Lady had let her granddaughter buy a laptop for school on flexpay three months ago. She has three months left before the laptop is completely paid off.\n\nIssue? Old Lady doesn't want to pay for the laptop anymore. She can't afford it. She didn't realize six months of flex pays meant... well. Six months.\n\nI can't just wave the fees. The purchase was legit and this was not a case of fraud. Still, I try and help her. Maybe her granddaughter can take over the payments? Or maybe they can return the laptop? Those would be the only two options.\n\nBut before I could finish a sentence, Old Lady's friend snatched the phone and started screaming bloody murder at me.\n\n\"TAKE THESE CHARGES OFF RIGGGGGHHHHHT NOOOOOOWWW\"\n\nI try and explain that unless we return the laptop or change form of payment, I can't do that.\n\n\"NO! YOU'RE STEALING FROM HER! SHE CAN'T RETURN A LAPTOP THAT ISN'T HEEEEEEERS! STOP CHARGING HER NOOOOOOOOOOOOOOOOOOOOOOOW!\"\n\nI slide my headphones down to my neck. I can still hear her perfectly. Sorry ma'm. I cannot do that.\n\n\"I WANT A SUPERVISOR NOW!\"\n\nStrictly against policy to transfer to a Sup. It's not even an option anymore. I have to fill out a form for a Sup to call her back.\n\n**\"I DON'T WANT A CALL BACK I WANT A SUPERVISOR!\"**\n\nSorry ma'm it has to be a call back.\n\n**\"NO GET UP AND GET A SUP ON THE LINE NOOOOOOOOOOOOOOOOOOOOW\"**\n\nI'll arrange for a call back ma'm.\n\n**\"NOOOOOOOOOOOOOOOOOOOOOOOOOOOOW\"**\n\nHe'll call you at his earliest convenience. \n\n**\"BITCH YOU BITCH FINE PUT ON THE REPORT I WANT A CALL BACK IN TEEEEEEEEEEEEEEEEEEEEEN MINUTES THAT ALL YOU PEOPLE GOT\"**\n\nOk.\n\n\"MMMHRMMM THAT'S RIGHT.\"\n\nYes ma'm. Mmhm. I got that call back form set up. Have a lovely day.\n\nLady swore some more and hung up. I feel really bad for the Old Lady honestly but her friend can go suck an egg.",
        "created_utc": 1536674688,
        "upvote_ratio": ""
    },
    {
        "title": "This is why you are in this situation.",
        "author": "DarkseidHS",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9expuz/this_is_why_you_are_in_this_situation/",
        "text": "Hey reddit!\n\nI've been an insurance agent for a large company for 10 years now. We operate as a call center so I shouldn't really be surprised by things customers say or do. Recently I just started helping our Flood team and am selling flood insurance. A little bit about flood insurance that people may not know. Flood insurance goes through FEMA and the NFIP. It's federally funded and regulated, they set everything down to the price, we just sell it for them. The most contested regulation on flood insurance is the 30-day waiting period, meaning if you buy a policy today it doesnt start for 30-days. Which makes total sense to me, why would a company take $400 with the potential to have to pay out $200k immediately? As you may know theres a hurricane about to hit the east coast and I just talked to a lady on the coast of VA. \n\nCustomer: I need to get a flood insurance policy started. (Notice she said started, not a quote or looking for info)\n\nMe: *thanking for business, usual introductory politeness* \n\nMe: some things I have to tell you about flood insurance. Flood insurance goes through the nfip and FEMA, there is a 30 day waiting period for flood insurance, all policies we sell today go into effect on 10/11... (shortened to remove all the \"fluff\")\n\nC: oh, never mind. We have a storm coming, if that's not covered I'm not interested. \n\nM: What about the next storm?\n\nC: I'm not interested. \n\nThis is why you are in this position. I have no idea why people calling me today are passing up this policy. If you're concerned about hurricanes, and they're not stopping, why not just take out this policy? You already know you cant just call before the eventual next storm. This always blows my mind. ",
        "created_utc": 1536673755,
        "upvote_ratio": ""
    },
    {
        "title": "A catch 22",
        "author": "startingover815",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9ew8m4/a_catch_22/",
        "text": "Me: Thank you for calling (insurance company) claims how can I help you?\n\nCustomer: Yeah I got in a minor fender bender and it wasn't my fault (proceeds to tell life story... Main point is he was rear-ended by another driver)\n\nMe: Oh ok I'm sorry to hear that well are you wanting to file a claim today?\n\nC: well not under my insurance!\n\nMe: ok then you can call the other insurance company directly to start the process with them and they would be able to help you through all of your next steps :)\n\nC: well why can't you do that your my insurance company what do I pay you for!?\n\nMe: *replaying 'what do I pay you for' over and over in my head* \n\nMe: if you would like our assistance with your accident we can certainly get a claims representative involved, they can help you by taking your facts of the incident and estimates and once a liability decision has been reached they can help report over to the other insurance company so they can help you with the repairs if that is what you would like to do, but this would require filing a claim under your policy.\n\nC: well I already said I don't want a claim under my own policy I wanna go through the other insurance company can't you just call them!!?\n\nMe: no sir you would need to call them to give your facts of the incident if you are not filing with us.\n\nC: I just told you I'm not filing under my policy...\n\nMe: ok then you will need to go through the other insurance company directly...\n\nC: but I want you to help me go through them\n\nMe: for us to speak on your behalf we would need to file a claim\n\nC: I DON'T WANT TO FILE A CLAIM\n\n\nNow at this point I feel it necessary to interject that at my company we cannot hang up on anyone.... This went on for a solid 15 min before he finally understood the predicament he was putting himself in, stated I was no help at all, and hung up. Que immediate smoke break.",
        "created_utc": 1536660728,
        "upvote_ratio": ""
    },
    {
        "title": "I just quit my call centre",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9escfn/i_just_quit_my_call_centre/",
        "text": "[deleted]",
        "created_utc": 1536622978,
        "upvote_ratio": ""
    },
    {
        "title": "Hurricane Stories: Hurricane Charley",
        "author": "wolfgang239",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9epzna/hurricane_stories_hurricane_charley/",
        "text": "Many moons ago i worked at an insurance claims call center.\n\nAfter Hurricane Charley, we went into disaster mode and handled insurance claims for hurricane damage for various insurance companies. this would consist of getting the claim set up in the system, getting a description of the damage, and assigning an adjuster to the policy holder.\n\nIn dealing with these types of claims you had to remain neutral but sow apathy for the situation they are in.\n\nIll give you 2 calls i had back to back.\n\nCall #1\nCast - ME: Yours truly\nPH: Policy Holder\n\n*ring*\nME: Thank you for calling (deleted) insurance, are you reporting a hurricane claim?\n\nPH: Yes, i am.\n\nME: Ok sir, may i have your policy number please? (i hear him outside walking around, chainsaws and other noise in the background)\n\nPH gives me the information and i pull up his policy and start the claim. I ask all the standard information and he provides it. I think this is going to be a smooth claim until i ask...\n\nME: Ok sir, please describe the damage.\n\nPH: I have no house.\n\nME: You have damage to your house? Is that correct?\n\nPH: You can call it damage if you want, but i have no house. Physically. No house at all. Im currently standing on the slab where my house USED to be. (he lets out a chuckle).\n\n*i should point out at no time was he yelling, aggravated, demanding, or in any way upset. He was very polite.*\n\nME: Oh...well...wow. Ok, Its safe to then assume there is a total loss. \n\n* I hear him pick something up and hear a metallic POP like a tin door opening *\n\nPH: Well, all be dammed! May not be a total loss after all...i found my mailbox...with mail still in it! (he laughs a genuine laugh)\n\nME: well that's a good thing. So i have your claim made and ive issued it to an adjuster, they will contact you in 24 to 48 business hours. Here is your claim number.\n\nPH: Thank you very much. This went better than i expected. (he exits the line)\n\nCall #2\n\nNow i tell you that story to make this next call stand out. This was the very next call i got after i hung up.\n\nME: still yours truly\nAH: for Asshat\n\n*ring*\n\nME: Thank you for calling (deleted) insurance...\n\nAH: I NEED AN ADJUSTER OUT HERE NOW AND I WONT GET OFF THIS FUCKING PHONE UNTIL ONE SHOWS UP!\n\nME: Im sorry your upset. Have you filed a claim already?\n\nAH: IM TRYING TO DO THAT NOW YOU IDIOT!\n\nME: Yes sir. May i have your policy number please?\n\nAsshat gives me the number and i get the claim started and i get to where i ask them to describe the damage.\n\nME: Ok sir, can you describe the damage please?\n\nAH: I have a ripped screen on my pool cage.\n\nME: Just one rip on one screen, is that correct sir?\n\nAH: Yes that is correct! Now, get me a damn adjuster out here today!\n\nME: Sir, i can only say an adjuster will contact you withing 24 to 48 business hours about your claim. They do take claims by priority. \n\nAH: Get them out here TODAY or i swear ill have your ass!\n\nME: here is your claim number sir. An adjuster will contact you withing 24 to 48 business hours about your claim. Thank you for using (deleted) insurance. Have a wonderful day. *click*\n\nTLDR\n\nHurricane damage claims. one policy holder looses everything and is pleasant to deal with. Very next call the policy holder has extremely minor damage and demanded an adjuster today.\n",
        "created_utc": 1536605915,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever wanted to slap a tween?",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9eoy1c/have_you_ever_wanted_to_slap_a_tween/",
        "text": "I used to work taking inbound calls for a bank.\n\nMe: Yours truly\n\nC: Customer\n\nSB: Spoiled Brat\n\n&amp;#x200B;\n\nAfter giving my standar greeting, asking the customer for his name and all the info I needed to look up his account.\n\nMe: How may I help you Mr Customer?\n\nC: So I have a question for you, is it possible to give a copy of my credit card to my underage daugther? she is 13.\n\nMe: If you are the primary card holder and you want to add her as an authorize user, then yes, it is possible. Would you like to do that?\n\nSB: Yes, he wants to give me a copy of his card. Didn't you hear?\n\nMe: Hello, my name is LadyNoir93, may I have your first and last name please?\n\nSB: Why are you saying your name again? WTF!\n\nMe: I need to introduce myself everytime someone new is on the line. May I have your first and last name please miss?\n\nSB: You are so annoying. Anyway, my name is Spoiled Brat.\n\nMe: Mr Customer, may you give me your permission to disclose your information with the third party on the line?\n\nSB: I'm not a third party, I'm his daugther bitch!\n\nC: I apologize. But yes. You can speak with her on the line too.\n\nMe: Thank you sir. So you were going to add your daugther as an authorized used?\n\nC: What is the difference between an authorized user and a primary card holder anyway?\n\nMe: The authorized users have their own plastic and a credit limit within the primary's credit limit. However, the primary card holder is still the only responsible of the account. All the information on this account is reported to the credit bureaus only under the primary's name. And the primary card holder is the only one that can make changes on the account.\n\nSB: So I'll be some lesser user? I don't want that! I want to be a primary too!\n\nC: Is that possible?\n\nMe: Sadly sir, we are unable to add another primary card holder.\n\nSB: Don't lie to me. I know mom and dad have a card where they are both equals. But I cannot be equal to my dad, that's bullshit.\n\nMe: It is possible to have joint accounts, but you cannot add another primary to an already existent account. You can either combine two existent accounts or apply for a brand new joint account.\n\nSB: I want to do that!\n\nC: Can we do that?\n\nSB: Yes we can. You and mom have one, why can't we have one?\n\nMe: I can connect you to our application center, but since your daugther is underage I don't think you can get approved for...\n\nSB: Stop talking! Just stop talking and transfer us to the application center.\n\nMe: Sir?\n\nC: Just transfer the call please, we'll try.\n\n\\*I tranfered the call\\*",
        "created_utc": 1536598728,
        "upvote_ratio": ""
    },
    {
        "title": "Can you please pretend to try?",
        "author": "D0nkeyTamer",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9el4jh/can_you_please_pretend_to_try/",
        "text": "It's so easy to lose it at customers, but sometimes it's the other members of the team that make you want to clock out early for a strong drink.\n\nSo here's the thing, stores and regular customer service agents can be just as much of a hopeless donkey than the customer at times! My department's role is transferring existing customer's lines to another account. Think parent kicking kid off the cell phone plan or couples consolidating into one - that sort of stuff.\n\nWish my call queue was just transfers of service instead of being mixed with care overflow, but what are you gonna do? Anyway, for actual transfer requests, you have to do one thing before my department gets involved and holy shit do people fail this simple thing 9 times out of 10.\n\nWhat is that one thing? You NEED permission to take a line from someone. Those of you reading might be going duh in how that makes sense, but common sense isn't so common. The reason is obvious: If anyone can just call in to make a major change on your account unchecked, that is massive violation of security.\n\nPermission to take over a line or lines is pretty simple. You either have the account owner release the number(s) online or call customer service to fill an authorization form which functions as a consent form. Basically if Bob wants his number from Jill's account, Jill calls in to have a rep release Bob's number before Bob can work on that new account.\n\nMake sense? Good. Wish the stores and customer service only agents weren't this dense. I've lost track of the many cold transfers from care or a store rep calling in only to pass me to a lost customer.\n\nLiterally, I can't do ANYTHING if I have this account pop up and the person on the other line isn't an authorized user. If you're the owner or manager, we ask for the PIN to verify the account so we can access it. Blindly passing along a customer who's neither authorized nor had a release form done for them is hella awkward for both of us!\n\nThe best part is when the customer responds with they were given a number to call to take their line and that was it. At least customer service agents have the ability to do a release form before transferring, store reps don't even bother doing the basics of explaining WHO has to call in to release the phone number. They're too busy ripping off old people with \"free\" tablets without disclosing that shiny 2 year contract.\n\nThis results in having to make outbound calls and those don't always work out when the owner ignores the 800 number calling. Most of the time this kills my handle time, but we get the owner on the line to release the number. For those other times, I get a pissy customer that can't do anything because no one bothered to explain the basics before shoving a number on them to call.\n\nFailed a survey like this before which was total BS because even if a call was disputable due to non authorized caller, the call itself wasn't perfect enough. Been doing this long enough that sometimes I flat out don't answer calls when the number is clearly from a store / customer service.\n\nTo any store reps reading, stop being a shady AF donkey and tell customers to get the owner to call us first instead of dumping the customer on my department. Likewise to care only reps, fill out the release form first instead of dumping the customer off. It's not hard, Jesus.",
        "created_utc": 1536568049,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't you ask one of your 40,000 friends?",
        "author": "llegaluan",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9ebt5l/why_dont_you_ask_one_of_your_40000_friends/",
        "text": "Little while back, worked for this outdoor leisure equipment distributor. One of the backpack brands we sold had a very solid lifetime warranty on everything. Only exceptions were purposeful dammage and bags too dirty/stinky for inspection.\n\nClient calls in and tells me he fell into a stream while biking, and his bag now stinks as the water was contaminated.\n\nI explain to him our policy but add that it can easily be washed at home and recommend a few products that he can safely use in a bath/sink while wearing gloves.\n\nClient retorts that it would be unsanitary to use his bath. I don't want to argue that point so I suggest a bucket or wash basin.\n\nCustomer proceeds to lose his patience and goes on a rant about how he doesn't have a wash basin and he's on facebook groups with over 40,000 bikers who are all his friend, and that he'll tell tell them all about the poor service we've given him.\n\nAfter his 10 minute rant ends, I lose some of my usual cool, and without thinking answer: \"Maybe one of your 40,000 friends has a wash basin you can borrow?\"\n\n10 second silence, and customer finally says: \"Go f**k yourself.\"\n\nAnd hangs up.\n\nThough my comment wasn't that harsh, a note of condescension may have been present in my voice...\n\n",
        "created_utc": 1536485550,
        "upvote_ratio": ""
    },
    {
        "title": "This isn’t the right company",
        "author": "bmaeder2020",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9eazxj/this_isnt_the_right_company/",
        "text": "Took a call from one of my reps, who said This customer would like to speak to a supervisor.  I’m going to start posting the best ones I remember from my time as a Sup at the Ecommerce company. \n\nMe: Afternoon, this is Bee.  I am a supervisor here at XYZ Ecommerce company, how can I help you?\n\nC:  Finally.  Your representative doesn’t know where they work.\n\nMe:  What seems to be the problem?\n\nC:  I’m calling because I ordered “pens” from you, and I haven’t received them.  My order has been in for two weeks, and you’ve taken my money, and I have nothing to show for it.\n\nMe:  Okay, I can certainly look into this for you.  What was your order number, as I’ve tried to pull up your order by the phone number you’re calling from, and our system does not have it.\n\nC: I don’t know why, I put it on my order.  It’s 18-\n\nMe:  Oh, let me stop you right there.  Our order numbers start with 3 or 2.  That seems to be a competitors.  I apologize but you have the wrong company.\n\nC: NO, NO! I googled it, and your number clearly comes up under Pens R us. \n\nMe:  Ma’am, when you googled Pens R Us did you call the first number listed?\n\nC: Yes!\n\nMe:  Okay that’s why.  We have a google ad running right now, you just called the wrong listing.\n\nC:  Why do you not want to help me? You so easily took my money, and now you don’t want to provide me with the product?\n\nMe:  if you ordered from us, I would be more than happy to assist.  We are pensforless.com.  You ordered from Pens R Us.  We have a google ad out right now, so when you google something like “Pen Store” our company will be the first one that pops up.\n\nClick.\n\nCustomer calls back, we’re short staffed so I’m also taking calls in the queue.\n\nMe:  Thank you for calling pens for less, this is Bee, how can I help you?\n\nC: Hello, hopefully you can help me as I just got off the phone with a very rude supervisor.\n\nMe: Hi ma’am, this is still me, and you’ve still called the incorrect company.\n\nC: How can I get you to see that I ordered from you?\n\nMe:  Ma’am do you have your email up with your order confirmation?\n\nC: Yes\n\nMe:  Okay, please read to me the company name in the logo of the email.\n\nC: Pens R Us! Do you need me to spell it to you since I’ve told you this before?! P-E-N-S R U-S\n\nMe:  Ma’am you have the wrong company.  We are Pensforless.com\n\nC: You’re all the same company! Why are you not helping me?!\n\nMe:  We can not help you as the order you placed is not with us.  I’ve tried to explain that to you.  I would be more than happy to take an order for you, but you have an existing order with a different company.  I will not be able to check the status of that order, as it would be like placing an order at Walmart, and calling target asking them where it is.\n\nC:  This isn’t the same thing, I’m not that dumb. \n\nMe:  Have a good day Ma’am.\n\nNot 20 minutes goes by, and we get an email in the email box.  She forwarded on her order confirmation.  At this point, I take her order confirmation, and circle the logo, and the contact number, and and screen shot our logo and contact number.  I explain all the differences.\n\nWe then get an email back from her saying she will be filing a complaint with the BBB for our customer service and not sending the goods she paid for.  I replied with “You are within your right for filing a complaint.  Just please make sure to file it with Pens R Us.  My name is Bee” \n\nWTF IS SO HARD TO UNDERSTAND.  I, in that moment felt like Patrick.  “Krusty Krab?” “No this is Patrick!”\n\n(Edited for spelling)",
        "created_utc": 1536474199,
        "upvote_ratio": ""
    },
    {
        "title": "Massive Delivery Fail",
        "author": "Anubis86",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9ea78o/massive_delivery_fail/",
        "text": "I work at a call center for a furniture store. The furniture delivery drivers my company hires can be the biggest morons sometimes, they remind me of Laurel and Hardy in The Music Box short. Today's sordid tale is one such case.\n\nA customer calls in, having ordered a large desk, a bookcase, and some other odds and ends that need to be delivered to the third story of a building. Today was the third attempt at it, because the warehouse keeps sending out a two man team when they need three people. There are notes all over the salescheck, notes sent to the warehouse imploring them to send a three man team, but no, they keep sending two people.\n\nAnd to spice things up a bit, the customer says that the drivers  dented his car on the way out! Now there is a protocol for property damage, but for minor things like damage to a wall or a carpet. They don't even have a category for car damage. As per policy I'm supposed to offer a $200 settlement before escalating the case, which the customer predictably refers to as a \"slap in the face\", but whatever. Since it's Saturday it takes 20 minutes to get ahold of a supervisor, and when I drop this case in her lap she sort of panics and calls the warehouse to get some answers, which caused another 15+ minute hold (which of course counts negatively toward my calls per hour, oh goody I just love being penalized for things beyond my control). To make a long story short this is now something between the customer and the warehouse, there was nothing else I could do. The customer still doesn't have his order either, by the way, which has to be brought back to the warehouse and reprocessed for 48 hours before another date can be scheduled. If that's still happening at this point, lol. Luckily, despite that I had no damn clue what to do in this situation and it was probably quite obvious, killing the messenger was kept at a minimum during the call. ",
        "created_utc": 1536464953,
        "upvote_ratio": ""
    },
    {
        "title": "My first threat! Oh how it annoyed me",
        "author": "Tangtastictwosome",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9e5ya8/my_first_threat_oh_how_it_annoyed_me/",
        "text": "I had my first complaint in my job. They are few and far between in the industry I am in (commercial electricity) so they tend to be tricky when they come in. This one was no different.\n\nBack in June I had logged Mr Knobheads (MK) first complaint. He wasn’t happy that he had to be logged with us as a supplier before he could move to his new (industry standard), and that he would have to send us in  meter readings to prove his property was not using any electricity. I resolved this one and all was well until last week.\n\nMK: Hello is this tangtastictwosome? This is Mr Knobhead.\n\nMe: Hello there. How can I help you today. \n\nMK: Yes I just wanted to say I had sent in my final read. \n\nMe: Yes I can see you’ve moved supplier now. That means that after you meter reads are check and validated in around 5-10 days, you will get your final bill and we can close your account.\n\nMK: Wait...5-10 days? Why? I don’t want to deal with your company any longer - you have my read, give me my bill!!\n\nMe: Sorry sir that’s standard for the industry. If it happens in less than 10 days you will get your bill sooner.\n\nMK: yeah but I sent in my read. It should be done instantly.  Frankly your customer service has been horrendous and this is just the icing on the cake. \n\nMe: Sorry sir I can’t do anything about that. I will raise a complaint on your behalf and get your invoice to your ASAP.\n\nMK: Yes, and, if you care about your companies reputation, my final bills better have a nil balance. \n\nI pause. I’m trying not to explode at MK right now. This was a whole new level of knobhead. \n\nMe: I will see what I can do sir, but I can’t promise anything.\n\nLong story short, my manger said no, we hadn’t done anything wrong, so he was getting his bills and would need to pay them. She was also very upset that he had threatened a member of her team. High five for a great manager :-)",
        "created_utc": 1536428342,
        "upvote_ratio": ""
    },
    {
        "title": "I don’t like this contract",
        "author": "sh605",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9e1ywb/i_dont_like_this_contract/",
        "text": "This was from a while back. Just like it says, this guy didn’t like the contract sent to him. I’m only in accounting, but he got dumped on me after being transferred a few times.\n\n\n\nCaller: You are the 4th person I’ve talked to! I need to talk to someone about this contract but every time I get sent to that department it’s just voicemail! I need to talk to someone not a machine.\n\n\n\nMe: Well, I’ll email someone and see if they can take your call, but they may be unavailable right now. Did you leave a message?\n\n\n\nC: No, this is too much for voicemail. \n\n\n\nMe: Ok. If I can’t find anyone to take the call I can give them your name and number?\n\n\n\nC: I just don’t like this contract! I don’t want to sign it, there’s too many sections. It doesn’t feel right to me.\n\n\n\nMe: That’s definitely something to discuss with them. I’m just in accounting, I wouldn’t want to give you incorrect information. I do know you don’t have to sign anything you’re not comfortable with, we would love to work with you but there’s no obligation here.\n\n\n\nC: Not you guys! I’m happy with you but this is from (Sister Company). There are so many pages!\n\n\n\nMe: *facepalm* That’s our sister company, we do work together but we are still pretty separate, you’d be much better off talking to them about their contract. \n\n\n\nC: Yeah but why do I have to have a contract with them, too?\n\n\n\nMe: You don’t.\n\n\n\nC: Oh! So it’s okay with your company if I don’t sign this?\n\n\n\nMe: It’s not our decision to make for you, sir. \n\n\n\nC: Cause there’s just so many fees for a bunch of different things and stuff I don’t want to be liable for. There’s like five pages!\n\n\n\nMe: I see. I’ve never seen it, I think you should give them a call if you’re concerned. Maybe they can put you a bit more at ease with it or maybe it’s not for you. Either way, we’re no experts on their terms and conditions.\n\n\n\nC: I just want to make sure nothing will happen if I don’t sign his.\n\n\n\nMe: We aren’t going to make you sign it, sir.\n\n\n\nC: Can I talk to contracts?\n\n\n\nMe: Sure. *sends to voicemail*\n\n\n\nMan, a whole 5 page contract. Must be some shady stuff in there, better call a different company and make sure they won’t get mad and punish me if I don’t sign it!",
        "created_utc": 1536384870,
        "upvote_ratio": ""
    },
    {
        "title": "I have a very specific Scale",
        "author": "bmaeder2020",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9e1bls/i_have_a_very_specific_scale/",
        "text": "I was a Supervisor for an E-Commerce company that sold a variety of things across a couple different websites.\n\nI do not want to give too much away, but let’s pretend that we sold pens.  (Seriously, something so menial as pens that do not have any power to ruin your day whatsoever) You could order 60+ colors of pens, singularly.  After the order went through our system, our warehouse team would pack your pens, and weigh the package on the FedEx scale that is calibrated by FedEx.  We then print the shipping label with that exact weight on it.  FedEx also weighs the package as well at its sort facility.\n\nNow, our policy is if the “missing items” are under $10 we give you a refund of the amount.  If the amount is over $10, we re-pick the package, reweigh it, and make sure the weights match.  \n\nThis call was transferred to me from one of my reps who said this lady was going ballistic. (M- for me, BL- Balistic Lady)\n\nM- Good Afternon, my name is Bee.  I understand you’ve requested to speak to a supervisor in regards to your missing pens.  I’ve spoken to the rep -\n\nBL- YES!  I’ve ordered 18 Pens! A set, that means 2 of 9 different colors.  Imagine my surprise when I open my package and there are only 9, 9 Pens in the package! One of each color! I ordered 2!\n\nM- i checked the order, you are correct.  You did order 2 of each color.\n\nBL- Well then what is the problem! Why do I only have 9 pens?! I can’t write on my paper with only 9 pens, My paper only looks nice with a set, not just one pen!\n\nM- Ma’am, I can assure you, we will attempt to make this right.  I do apologize, but can I have your permission to put you on hold? I need to call over to warehouse, and have them re-weigh the package.  Once I do that, I can give you an appropriate solution.\n\nBL- I guess that will be fine, but I want my 9 pens!\n\n[Call the warehouse, confirm all counts match on our current inventory, and that the weight of the package sent, and confirmed by FedEx show that we definitely sent her 18 pens]\n\nM- Thank you for being so patient Ma’am.  After further review, we went ahead and pulled the same order, and weighed the package.  We also counted our current inventory against the numbers that are in our system.  While I understand this is frustrating, everything is confirmed that we sent -.\n\nBL- who are you to call me a liar?! You know what, I have a scale, and I have this package.  I have a very specific scale, and I am going to video myself weighing this package and send the video to you.\n\nM-  Ma’am, I understand this can be frustrating.  As good faith I would be willing to send out 9 pens to you, and discount shipping (we marked up shipping) to $2.17.  We’re not sure what happened, but we’re willing to work with you as everything on our end shows we sent all 18 pens.\n\nBL-  I DON’T KNOW WHO YOU TALKED TO IN YOUR WAREHOUSE BUT HE IS A LIAR.  He told you an absolute lie.  A bald face lie.  While I was on hold I looked up your yelp.  You tell Gary (owner of the company) who is named in plenty a yelp review that I am going to write him enough bad reviews to take him down.  I am going to run a campaign like nothing you’ve ever seen before-\n\nM-  Ma’am there is no need to get this upset.  We are trying to do what’s fair here.  We have confirmed with every system that you should have received 18 pens.  With that being said, we need to cover ourselves too.  So we as a company are okay with taking the loss on the cost of goods, but we do have to -\n\nBL- WILL YOU PLEASE, do you hear me?! You tell Gary that I am going to take him down.  Take him down like nothing he’s seen before.  I know people, I know plenty of people.  I am going to-\n\nM-  Ma’am at this point we have been sympathetic to your situation.   However, we will no longer be offering to resend you product for free.  We are now also going to ban you, so you will not be allowed to order from us again.\n\nBL-  You listen to me! I am going to take Gary down with my dying breath!!!!\n\nM- Ma’am I am hanging up now.\n\nBL-  WITH MY DYING BREATH, GOOD DAY!\n\nI don’t understand how people can work themselves up this much over an insignificant product.  ",
        "created_utc": 1536378252,
        "upvote_ratio": ""
    },
    {
        "title": "Still feel bad about this to this day",
        "author": "kazon82",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9e0y3w/still_feel_bad_about_this_to_this_day/",
        "text": "So this was several years ago, but for six months I worked at an outbound call center. Our main client was a credit card company. We did a few things for them, called people to sign up for the card. Called people who already had the card and tried to sell them add ons, stuff like that. I worked in the acquisition side, trying to get people to sign up for the card. \n\nThis isn't going to be word for word because it was kinda complicated and frankly I just don't remember everything that was said. Autodialer called the lead and the lady picked up and I did my scripted greeting yadda yadda, tell her she's been preapproved to recieve an offer for a line of credit, her possible interest rates. All the different promotions and possible benefits. The one that caught her ear was balance transfers. Turns out she had a couple other cards with decent balances at a much higher rate then our introductory rate. \n\nShe seems excited and actually tells me she's happy I called and wanted to take advantage of this. I'm thinking, cool, easy sale. Then she tells me the reason she's so excited to do this is her husband just passed away and left her in some financial hardships and it'll help her to consolidate the other cards under our lower rate. So I get serious cause i really want to help her. Problem is this was my first time doing a transfer and our call centers training sucked. \n\nBut I soldiered on and got all the ladies information and did what I had to do to get her set up. She had to step away a couple times to find all her info. Over an hour later we are finishing up, the final process is a few steps that I get her through and tell her she's all set. She'll get a call from credit card company in a day or so with final approval and confirmation the transfer is complete. She thanks me and I tell her I was happy to help and we say our good byes. \n\nLater on that day the rep next to me is doing a balance transfer and I'm kinda paying attention. Then I see it, he does a step I didn't do. One step I missed that I'm pretty sure caused this poor ladies whole application to be denied. FUUCK! A simple damn step of checking a box and answering 2 questions that come up. FUUUUUCK!\n\nI hated that job, I'm not a pushy person. Someone tells me they don't want the card I say thank you for your time, have a good day. Not what the bosses liked to hear. Was happy to get out of there, but this one lady is the one I still feel bad about.\n\nEdit: grammar, on mobile",
        "created_utc": 1536374729,
        "upvote_ratio": ""
    },
    {
        "title": "A goof up on my end, but Jesus Christ.",
        "author": "hoodmouse1",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dzkp7/a_goof_up_on_my_end_but_jesus_christ/",
        "text": "So, today at work, I was updating the customer's debit card on file that was set up on a recurring payment and of course, because she was rushing me telling me she needed to get this done because she was busy, (why the hell did you call then?), I didn't notice the most important thing which was that the payment was scheduled for today and had taken the payment from the previous card.\n\n\nSo of course, when I updated the card, the system automatically assumed \"Hey, new card!\" And drafted another payment.\n\nSo at that point in the conversation, she noticed that transaction and advised the customer due to the system and me updating the card, it did do draft it however once it wasn't in the settled status, we could issue that refund and of course, 7-10 business days until the funds returned however some Banks don't even take that long.\n\nAt that point everything was clear, or so I thought... Right?\n\n\n#wrong\n\nShe calls back with another rep who's in customer service and literally blew up at her.\n\n\nC: Yeah, hoodmouse1 fucked up and because of that, I want my money back NOW. TODAY.\n\nR: Ma'am, I do apologize but it was something that was due to the system's set up, as soon as it clears, we can issue that refund immediately.\n\nC: I don't give a fuck, I want my money now.\n\n\nAsks for a supervisor then she hangs up.\n\n\nToday was a very frustrating day, and it just got to me.\nI try not to make mistakes, but this one really upset me.\nIt may also be the fact that I'm sort of fed up with dealing with this environment and people.\n\nLike fuck man, why can't people be less fucking rude?",
        "created_utc": 1536362239,
        "upvote_ratio": ""
    },
    {
        "title": "His wife left him on Christmas eve",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dwrdv/his_wife_left_him_on_christmas_eve/",
        "text": "I used to work taking inbound calls for a bank. This is one of the saddest and most definitely the longest call I've ever take, I got this call on December 24th 2016.\n\nMe: Yours truly\n\nC: Customer\n\n&amp;#x200B;\n\nMe: Thank you for calling \\*Bank's name\\* this is LadyNoir93, may I have your first and last name please. \n\nC: Hi LadyNoir93. I'm Customer. Can you help me take out my wife from my account? It's my account but she has a copy of my card, is it possible to just take her out?\n\nHis speech was slurred. I suspected he was drunk.\n\nMe: Hi Mr Customer. If you are the primary card holder and your wife is the authorized user, then yes it is possible to remove her anytime you want. \n\nC: Good, I want to do that. \n\nMe: May you give your full sixteen digits credit card number?\n\nC: The number is xxxx-xx... sorry I mean is xxxx-xxxx-x... sorry. Ok I'm too drunk for this. I'll call you back tomorrow. \n\nHa! I knew he was drunk. \n\nMe: It's ok sir. We' are open 24/7, you can call us back in a more convenient time and we'll be happy to assist you.\n\nC: I know, is just that I wanted to cancel the card ASAP because she left me you know? She's fucking her friend and she fucking left me today. \n\n(Auch)\n\nMe: I'm really sorry to hear that sir. (That's my script but I did felt sorry for the dude).\n\nC: Yeah, so I wanted to take her from my card because I can't stand the idea of her using my credit card with him. \n\nMe: I totally understand your concern sir, you can call us back...\n\nC: Why would she do that? She left me on christmas eve? Who does that? My dad passed away earlier this year, and now she left me. I'll be alone in Christmas. \n\nMy heart ached for the dude. But he didn't seem to be waiting for a response. He just kept rambling and rambling about his wife and how he loved her but she left him. \n\nI listened to him for about 15 minutes, before calling my supervisor and asking what should I do since there was nothing I could help the customer with, but he wouldn't stop talking. \n\nMy supervisor told me that usually he'd advice me to disconect the call, but heck it was Christmas eve and there was no queue. So if I wanted to keep listening to him I could. \n\nI didn't disconnect the call but to be honest I stopped paying him any attention. I let the guy ramble with my mic in mute while I talked with my team mates. He legit talked for 2.5 hours, without me saying anything besides a couple of standar comfort phrases every once in a while. After talking for 2.5 hours he thanked for my time and disconnected the call. ",
        "created_utc": 1536342671,
        "upvote_ratio": ""
    },
    {
        "title": "Rewards!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dvxnb/rewards/",
        "text": "[removed]",
        "created_utc": 1536337462,
        "upvote_ratio": ""
    },
    {
        "title": "NO CREDIT FOR YOU",
        "author": "D0nkeyTamer",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9drs4c/no_credit_for_you/",
        "text": "So today I figured out I could remove a credit given to a customer.\n\n&amp;#x200B;\n\nLittle backstory -\n\n&amp;#x200B;\n\nI work at an indirect center for a major US cell phone provider. Not to give too much info, but the one the pink guys can never shut up about. Anyway, I had this older woman call in complaining another rep didn't give her a credit she was promised. The credit? It was for a late fee. Yes, this entitled lady believes she's immune to late fee charges.\n\n&amp;#x200B;\n\nGet to looking at the account to see if there is any credit, there was none applied. Dug a little further to see maybe if one was pending, nada. Usually a credit applies to the account right away, in some cases it pends to show on the next bill based on how far along the bill cycle is. Anyway, it was my \"Friday\" and being that it was a pay period at that, I've decided to go ahead and get this woman her credit since it was already only an hr or so left of my shift. Somehow the call dropped mid crediting. Normally this means to stop doing any sort of change on a customer's account. In good faith, I added the credit anyway and texted her confirmation.\n\n&amp;#x200B;\n\nDidn't think much of it and later came to found out she failed my survey. Those working in a CC knows exactly how BS those are when it comes to messing with your pay. Wouldn't even have known she failed my survey till days later, but I went in earlier today on my day off because of mandatory overtime. Trust me, I dread being in that center during my normal schedule, let alone spending an hour+ more. Doing a few hours on a day off makes it feel like a short shift.\n\n&amp;#x200B;\n\nChecked my email an hour into this prison sentence when I should have been asleep at home and noticed my coach sent out stats. This is when I discovered I had a dropped survey and checked who and why. No verbatim, lucky me means it can't be disputed.  Considering I credited her in good faith and this could possibly F me over for next month's bonus, I tried to see if a credit could be removed.\n\n&amp;#x200B;\n\nLo and behold, it can! The awesome part was that not only was I able to revoke her credit, it let me know she would be getting an email confirmation that it was taken away. Icing on the cake as far as I'm concerned.\n\n&amp;#x200B;\n\nCustomer's aren't always right and if you do anything to jeopardize my livelihood when I was only trying to help you out, you can feck off.",
        "created_utc": 1536303579,
        "upvote_ratio": ""
    },
    {
        "title": "Free Talk Friday - Sep 7",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9drgjs/free_talk_friday_sep_7/",
        "text": "Welcome to Free Talk Friday! We are suspending the usual 'tales only' rule within this thread (other rules still apply) meaning you guys can talk about whatever you like and let your hair down.\n\nP.S. If you want to have a rant about something, head over to /r/callcentres as you'll find the Weekly Rant &amp; Rage Thread has just been posted.\n",
        "created_utc": 1536300410,
        "upvote_ratio": ""
    },
    {
        "title": "Do you even listen?",
        "author": "WanderingWitch13",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dqj4d/do_you_even_listen/",
        "text": "Unfortunately I haven't got a long entertaining story to share, but I'm currently sitting at work mindlessly scrolling through Reddit trying to waste time until the end of my shift. \n\n&amp;#x200B;\n\nI'm sure that everybody in customer service experiences this, but I just can't even fathom how these people get by. These people aren't even hard of hearing- they're either just fucking thick or can't be bothered listening even though ya know, they called us, they should probably listen if they want help with their issue.\n\n&amp;#x200B;\n\nJust the basic shit grinds my gears. I'll throw a few examples out there (I'll be changing the words to basic colours etc to protect details of my workplace) - I'm **M** and the customer will be **C**.\n\n\\- - - - - - \n\n&amp;#x200B;\n\nM: Can I please have the ***BLUE*** number from the back of your card?\n\nC: The RED number or the BLUE number?\n\nM: \\*facepalm\\* The BLUE number please..\n\n\\- - - - - -\n\n&amp;#x200B;\n\nM: Would you like to select the ***BLUE*** option or the ***RED*** option?\n\nC: -silence-\n\nM: Hello?\n\nC: Yes?\n\nM: \\*repeats question\\*\n\nC: Yes thanks. \n\nM: \\*facepalm\\* \\*repeats question and explains each option again\\*\n\n\\- - - - - - \n\n&amp;#x200B;\n\nM: What's your first and last name?\n\nC: 123 Home Road\n\n\\- - - - - - \n\n&amp;#x200B;\n\nM: What's your date of birth, please?\n\nC: Firstname Lastname\n\n\\- - - - - - \n\n&amp;#x200B;\n\nThese are just some very basic questions that I have to ask multiple times a day and people seemingly fuck it up more often than not.\n\n&amp;#x200B;\n\nPlease feel free to share any basic questions you've needed to ask a customer, and the idiotic or just plain simple responses they've given you. Absolutely nothing wrong with people who are hard of hearing or where English isn't their first language, I'm just talking about the people who are so obviously too lazy to listen. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created_utc": 1536292050,
        "upvote_ratio": ""
    },
    {
        "title": "Santa for a Day.",
        "author": "Reykira",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dnlx4/santa_for_a_day/",
        "text": "So I used to work within the technical support department for a telecomunications company doing the phones for the Hospitals for the 4 regions that the company covered.\n\nOn a normal slow saturday morning one November, close to December, a call comes in and it sounds like the sweetest little 3-5 year old girl calling in. I say hello and she was so excited to get a line to Santa, that the nurse was right, and proceded to spend the next 15 minutes telling me about all the good things she has done and things she would like for Christmas. Doing my best (which is pretty bad I will admit) Santa voice I get the girls name and tell her that if she continued to do good until Christmas, I would see what I could do about her list.\n\nThe nurse came on after I heard the scamper of what was likely a very happy little girl and say thank's for it and hung up.\n\nWhenever I have a rough day working I just have to remeber that little girl's excitement about being able to call Santa.",
        "created_utc": 1536271215,
        "upvote_ratio": ""
    },
    {
        "title": "Call Centres in Canada",
        "author": "JRWellman",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dm5qj/call_centres_in_canada/",
        "text": "So, I spent the past year working for two different call centres in Saint John, New Brunswick Canada. I'd love to hear from others in Canada who've had similar jobs; I couldn't believe the sketchy practices, and inhumane treatment that call centre workers  - HERE, in a First-world country - are subjected to.\n\n&amp;#x200B;\n\nApparently, neither could the CRTC, the body governing telecommunications here. They're currently conducting an inquiry into the telecoms' sales practices - however, I find they're almost completely ignoring the way they treat their employees ie forcing them to make sales and pushing them to commit illegal acts in order to keep their jobs.\n\n&amp;#x200B;\n\nIt's an election year here in New Brunswick, to boot. Thoughts, anyone? Or will this insanity just get swept under the rug, and continue, with workers in poor cities like Saint John continuing to be exploited and then blamed when the call centre operators get found out?",
        "created_utc": 1536262404,
        "upvote_ratio": ""
    },
    {
        "title": "Insane Man doesn't understand how holes work.",
        "author": "scootmccute3",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dl0tz/insane_man_doesnt_understand_how_holes_work/",
        "text": "I used to work in a call center for a BMW mechanics shop. We set appointments, gave prices, etc. During my time, I had the absolute pleasure to speak with some of the most dim witted wealthier people I've ever came across. How some of these people managed to make enough to afford the $100 charge every time their tires were low on Nitros and they freaked out because there's a light blinking at them or even figure out how to get to work each day is still a mystery to me. \n\n(Disclaimer: some were middle class and I know BMW is not a rich person car, but in this area if you can afford more than a one bedroom AND a BMW, you're above standard middle class. Also, if you have a BMW buy all the damn warranties and then turn it in when they run out.)\n\nOne day, right before closing, Insane Man calls. \n\n**Me:** Standard bullshit greeting that included referring to myself as Director of First Impressions\n\n**Insane Man:** I ran over a bolt with my new tire.\n\nWe set up a time for him to bring it in and he does have the warranty because he just used it to get the tire that now has a bolt in it. Then he drops this marvelous question.\n\n**Insane Man:** Should I pull the bolt out? \n\n**Me:** Um, no. That would not be a good idea. The tires have a system in place that will allow you to drive on it while flat for 50 miles, but if you pull out the bolt, it will most likely be completely deflated by the morning. \n\n**Insane Man:** But, it's a new tire.\n\n**Me:** Yes, with a bolt in it.\n\n**Insane Man:** If I don't pull it out, it will hurt the tire.\n\n**Me:** Sir, your tire has a bolt in it which has created a hole that will allow it to completely deflate if you pull it out meaning you'll have to tow it to us tomorrow instead of drive it in.\n\n**Insane Man:** It's new so I don't want the bolt to keep damaging it over night. I'm going to pull it out.\n\n**Me:** Sir, please do not pull out the bolt. It will be fine until tomorrow morning when you can safely drive it in. \n\n**Insane Man:** Well, if you say so....\n\nIIRC, he did end up driving it in and it had to be replaced thanks to where the bolt punctured it. He wasn't happy. ",
        "created_utc": 1536255699,
        "upvote_ratio": ""
    },
    {
        "title": "Pretending to be his mom",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dkbas/pretending_to_be_his_mom/",
        "text": "I used to work taking inbound calls for a bank.\n\nMe: Yours truly\n\nC: Caller.\n\n&amp;#x200B;\n\nMe: Thank you for calling \\*Bank's name\\* This is LadyNoir93, may I have your first and last name please?\n\nC: Hey, this is Mrs Customer.\n\n(The voice kind of sounded like a teenage boy instead of a woman, but I shouldn't question customer's voice. I mean as far as I knew she could have a cold, she could be a transwoman, she could smoke, like I don't know).\n\nMe: Hi Mrs Customer, how may I help you today?\n\nC: I don't want to receive a statement this month. Is that possible?\n\nMe: Sure it is. Let's go ahead and do it.\n\nIs not uncommon for customers to not want to receive a paper statement. So I thought nothing of it. Most people manage their account online nowadays anyway.\n\nMe: I need your full credit card number and the last four digits of your SSN.\n\nC:  The credit card number is xxxx-xxxx-xxxx-xxxx. But I don't really remember my SSN.\n\nMe: In that case I'll need your address and Date of Birth.\n\nC: The Address is \\*address\\* and my date of birth is April 2nd, 2003. Shit...sorry I mean my date of birth is January 10th 1971.\n\nThe second date of birth the caller provided matched the information we had in our system, but it was really suspicious that the caller didn't remember the  social and messed up the date of birth.\n\nMe: I'm sorry Mrs Customer, I was not able to open the account. I'm really going to need the last four digits of your SSN.\n\n(That was a shameless lie. I got the account. But I'm didn't trust the caller).\n\nC: Oh, shit. You see this is actually my mom's account. She is the one who doesn't want to receive statements. I'm just helping her.\n\nMe: Oh I see. What's your name?\n\nC: My name is Caller.\n\nMe: Hi Caller. In order to make changes in the account I need the primary card holder on the line. Is your mom there with you?\n\nC: No, she is at work.\n\nMe: In that case I won't be able to work in the account. You can give us a call later with the primary card holder on the line and we'll be happy to help you.\n\nC: No wait. Uhm she is here, but she doesn't speak english.\n\n(That's weird. Usually when a customer doesn't speak english there is a huge red  note on the account explaining they need a translator and what language they speak. There is no note here). Her mom had a hispanic last name so I had to ask.\n\nMe: What language does your mother speak?\n\nC: She only speaks Spanish. She doesn't know a word in english\n\nMe: What a coincidence! I'm a native spanish speaker. I can speak with the primary card holder. You can put her on the line.\n\nThe caller said nothing for like 30 seconds.\n\nMe: Hi, um Mr Caller. Are you still there.\n\nC: Can I be honest with you?\n\nMe: Sure.\n\nC: I have my mom credit card, and I made a charge on the account a couple of hours ago. But now I realize my mom is going to see it, and I'll be in so much trouble. Is there anything you can do to help me?\n\n(Just out of curiousity I went to the last charges, I wanted to know what this kid wanted to hide. The last charge on the account was some pay per view porn sites. Of course).\n\nMe: I'm sorry Mr Caller. I understand your situation but I'm not able to work on an account without the card holder on the line. Besides I don't have access to the account anyway since you never provided me the lat four digits of the SSN.\n\n(Hey I already lie about not having access to the account, I better stick to it).\n\nC: Oh I understand. Thank you so much anyway. Bye\n\nMe: Bye Mr Caller.\n\n&amp;#x200B;\n\nEdit: For privacy reasons I changed the day and month on the dates of birth, I only kept the years.",
        "created_utc": 1536251494,
        "upvote_ratio": ""
    },
    {
        "title": "This literally just happened",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dj2u3/this_literally_just_happened/",
        "text": "[deleted]",
        "created_utc": 1536243723,
        "upvote_ratio": ""
    },
    {
        "title": "I need a quote NOW!!!",
        "author": "pugmommy4life420",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dfpi4/i_need_a_quote_now/",
        "text": "I used to work for an insurance company as an agent. Part of my job was quoting clients and in order to get an accurate insurance price I needed the clients information such as dates of birth(younger drivers are more expensive) the types of cars(if you have a 2018 Bugatti vs a 2018 Honda Civic), where you live(if you live in an area that gets lots of car jackings or maybe you aren’t close to a fire dept in case of a fire), drivers license(if you have a ton of accidents we can’t insure you as easily) etc. Prices are typically dependent on the info you give us and if you give us more info we get a more accurate rate. Anyway here comes Mr.Prick(mp) and I’ll be obviously me lol\n\nMe: (Insurance company) pugmommy420 speaking how can I help you?\n\n\nMP: I need a home and auto quote NOW. \n\n\nMe: Okay may I ask for a bit of info before we get started?\n\n\n\nMP: ....\n\n\nMe: um... hello?...\n\n\n\nMP: what do you need??\n\n\nMe: I need your first and last name, a good contact number in case the call drops, and....\n\n\nMP: First and last name and I’m not giving you any more. I don’t want you spamming me...\n\n\nMe: okay what about an email?\n\n\nMP: no. Didn’t you hear what I said about spamming?\n\n\n\nMe: Okay well just in case you can call me back if the call drops. Anyway I also need your birthday, address, who are the drivers and the VIN for the vehicles. I also...\n\n\n\nMP: I’m not giving you any of that information I need a quote NOW. \n\n\n\n\nMe: well MP I need this information to quote you. Blah blah blah yadda yadda yadda (Goes into why we need the info and that we are only using it for a quote)\n\n\n\nMP: I DONT CARE! I NEED a quote and you don’t need any of that information. How come (lizard insurance) can give me a quote without any of that information???\n\n\n\n\n(NOTE: usually those quotes you get from random insurance companies in the mail will give you some BS number to reel you in. They give you that “rate” but only in like the ideal world. Even people who are great clients still don’t get those rates as they’re used to bring people in)\n\nMe: oh well MP, they basically do a ballpark and...\n\n\nMP: I don’t care! Give me my quote.\n\n\nMe: -.- (sigh) okay MP since you want a quote it will cost you 6,000$ for a 6 mo policy on the auto which would be $1000 mo. And as for your home it would be 12,000\n\n\n\nMP: what??!?? Are you people NUTS? You insurance companies are a bunch of scam artists blah blah blah goes into a tirade about how insurance companies suck and how we’re trying to rip him off and he demands a copy of the quote. \n\n\n\nMe: MP I don’t have a copy of the quote. You said to give you an idea of the rate and that’s it. If I don’t have accurate numbers I don’t know how much you’ll need to pay. If you want once you actually need the quote you can give me a call and I’ll need the information requested. \n\n\nMP:-click-......\n\n\nThis prick then has the audacity to call back 20 min later and gave my boss the same shit and complain. My boss told him to basically fuck off or give us the info. Finally after like 20 min the prick gave us like half the info needed and I was able to look up the rest. \n\n\nAlso thankfully the asshole tried it with my boss so he was just as annoyed as I was and I didn’t get in trouble. ",
        "created_utc": 1536216319,
        "upvote_ratio": ""
    },
    {
        "title": "The One Time We Got Lucky on a Survey",
        "author": "dallastossaway2",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dewz6/the_one_time_we_got_lucky_on_a_survey/",
        "text": "So, I used to be a supervisor in a telecom company; those of you that have worked in those centers know how the surveys go. A lot of the fails are bullshit ones no one can get overturned. \n\nMy agent was on his way to break and said “DFWtossaway2, I’m pretty sure Bob Smith is going to fail my survey. Sorry, he wanted something unreasonable.”\n\nI told him it was fine and I’d review it. He got me the account number, and I checked it so I’d recognize his notes so I could make it top priority if a failed survey came in. He generally took good calls with angry dudes, so he half a chance. \n\nHe gets all of his surveys for the day in the next couple of survey periods. They are all perfect, and one of them is from Bob Smith. I listen to the review, and the customer’s mother had taken the damm thing and was talking about how happy her son was with their service. I also listened to the call; Bob Smith was not happy. He said that many times. \n\nI pulled my rep to listen to the review, and then we spent 15 minutes with him  talking to me about woodworking. We absolutely told no one else, because that was our gimme survey. ",
        "created_utc": 1536209359,
        "upvote_ratio": ""
    },
    {
        "title": "This is the policy, I assure you.",
        "author": "pumpkinpiemonster",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9ddz9q/this_is_the_policy_i_assure_you/",
        "text": "I work in a call center for a large U.S. bank. The call center I work in does not assist customers (Thank Tehlu), we only assist bankers. This usually means that the callers are very respectful and calm. There may be some friction at times, but all in all, pretty chill. Today, however, I got the first call where I actually had to vent about it.\n\nLet me set the stage. I don't know if other banks have this same procedure, but whenever a customer's account number is compromised, we have two options: 1) close the account and open another one or 2) process what our bank calls a \"Lost/Stolen Transfer\". The second option is used when a customer has an account type that is grandfathered and they want to keep the type of account. This allows them to have all the special perks go over to the new account. Usually, branches can process Lost/Stolens very easily, but whenever the account has been opened in another state, they cannot do it and the customer has to call in to customer service. If customer service cannot do it either, then the branch has to call the branch that opened up the account. That is policy and there is no way around it.\n\nThis is the conversation:\n\n\"Thank you for calling (department), my name is PumpkiePieMonster, how can I help?\"\n\n\"Yes, hi. I am a branch manager in Oregon. I am on the phone with a branch manager in Nevada. They want me to process a Lost/Stolen, but the customer is not in here. They are are in Nevada. Obviously, I have to have the customer in front me fully identified to do this, so what is the correct way to do this?\"\n\n\"That is a great question, sir. That is -\" (At this point, the BM interrupts me).\n\n\"Actually, I'm going to bring on the other BM, so she can hear you say it, is that okay?\"\n\n(We are not allowed to talk to more than one branch at a time, but he doesn't even let me say that it is not okay and puts her on. Whenever this happens, we have to continue with the call, but we have to document both of their names for the ticket software.)\n\nI do my spiel again, which is required.\n\n\"As I understand it, you are both trying to process a L/S, correct?\"\n\n(NV) \"Yes. I called into your department earlier and the CSR told me that I would have to call the branch that opened up the account, because customer service could not do it. That is correct?\"\n\n\"Yes. That is the policy.\"\n\n(OR) \"What?! That is ridiculous. I am not going to do that! The customer is not in my branch. That is not the correct policy. I assure you. I have worked with this bank for ten years and I have never had to do this.\" (To be fair, this policy changed a few years ago.)\n\n\"Sir, the branch that opened up the account needs to process the Lost/Stolen. It is policy.\"\n\n\"No.\"\n\n\"Sir, I just sent you the policy and procedure on this.\"\n\n(After a few minutes of him reading it.) \"This make absolutely no sense. All it says is that we have to call you.\"\n\n\"Yes, because I have to verify a few things on the system first, before you can do that. I did the verification at the beginning of the call and you can process it now.\"\n\n\"Is there another way to do it?\" (His voice is getting higher and more aggressive.)\n\n(NV) \"Can we please hurry this up? The customer has been in the branch for thirty minutes now.\"\n\n\"I'm sorry about that. Unfortunately, this is the only way that we can do this.\"\n\n(OR) \"This is not right. Not right at all. I want to speak with your supervisor about this.\"\n\n\"Okay, sir. I will get you both to my second level and they will assist you from here on, but they are going to tell you the same thing. I also have to advise that at this stage, I will have to email your District Manager about this issue.\"\n\n\"That's fine, because he will agree with me!\"\n\n(NV) \"Can you please just transfer the account? You have the policy and procedure in front of you.\"\n\n(OR) \"No. I will not do this until I have the customer in the branch with me.\"\n\n\"Alright, I will transfer you to my second level right now. Thank you for calling in and have a great day. It will just be a brief hold while I find someone.\"\n\nOur policy states that we have to do a warm transfer, so I explain the situation to my second level. She laughs and says that I am correct. She then takes over the call to tell them everything I just did. Gosh, people! All it would have been was just a few clicks and it would have been over with. After typing all this out, I can understand that the BM did not want to get in trouble, but the policy was clear.\n\n&amp;#x200B;",
        "created_utc": 1536201949,
        "upvote_ratio": ""
    },
    {
        "title": "How do make sense of this",
        "author": "rosesandhoneyyyyyyyy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9ddv9k/how_do_make_sense_of_this/",
        "text": "I work in online sales for a major outdoor outfitter helping a customer with fitness watch features. At the time of the call, he wasn't readily available to look at the item online, but wanted the item number to look at it later. His words to me were, “If you could do the favor and not send me the item number for a white watch because I’m a heterosexual “ . I Didn't question his rational and just wrote if off as, \"Okay, this guy doesn't like the color white\"   \n\n\nSurely, I was entertained as much as I was bewildered, but am I missing something or is this guy so disconnected and hateful that he is no longer making sense? I've asked coworkers, friends, and family to which their responses were either, \"I am so confused\" or \"What?\"",
        "created_utc": 1536201132,
        "upvote_ratio": ""
    },
    {
        "title": "WHY DID HE USE MY EMAIL ADDRESS!?",
        "author": "WanderingWitch13",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9ddgpo/why_did_he_use_my_email_address/",
        "text": "Okay so, I'm currently working in a small call centre for a loyalty programme where we manage people's cards and accounts, and part of our job here is to make sure the cards are active so they can claim their rewards. When they are activating their cards (which they can also do on our website), they will be sent an email afterwards notifying them that the registration is complete.\n\n&amp;#x200B;\n\nThis happened around two years ago so my memory is a little foggy, but the conversation went somewhat like this- this is also a shortened version as I can't remember the specifics. I'm **M** and the customer is **C**.\n\n&amp;#x200B;\n\n&gt;**M**: Welcome to \\[company name\\], you're speaking with Wandering!  \n&gt;  \n&gt;**C:** \\[flustered\\] Hi Wandering, I'm confused.  \n&gt;  \n&gt;**M:** What can I help you with today?  \n&gt;  \n&gt;**C:** Well, I've just received an email with my ex-husbands name in it.  \n&gt;  \n&gt;**M:** Oh okay, lets have a look\n\n\\- Collects email address, locates ex-husbands account and confirms security questions -\n\n&gt;**M:** So it looks like he's just registered an account under his details and used your email address. Would you like me to remove it?  \n&gt;  \n&gt;**C:** But but, WHY?? Why would he use my email address????  \n&gt;  \n&gt;**M:** I'm sorry C, I'm not too sure. He may not have one and just used yours to complete the registration.  \n&gt;  \n&gt;**C:** But I have a restraining order against him! Why has he used my email address!? Can he see my account?  \n&gt;  \n&gt;**M:** No no, C, your account is completely secure. I'll remove your email address so you don't receive any email notifications about his account.  \n&gt;  \n&gt;**C:** Okay, thank you. Sorry, I had to get a restraining order against him after our divorce because he tried to shoot me and I was worried that he was trying to get into my account.\n\nAfter pausing for a moment as I was absolutely *speechless*, I told her that her concern was completely understandable and reassured her that her information was safe and not accessible to him. After ending the call, I was still absolutely baffled and had to tell every else. It's not every day a stranger tells you a short story of her crazy ex-husband trying to kill her. \n\n&amp;#x200B;",
        "created_utc": 1536198274,
        "upvote_ratio": ""
    },
    {
        "title": "This is the bank’s fault and I want my $700 back!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9ddbkz/this_is_the_banks_fault_and_i_want_my_700_back/",
        "text": "[deleted]",
        "created_utc": 1536197257,
        "upvote_ratio": ""
    },
    {
        "title": "What is it called at your call center when another employee or manager sits in and listens to your calls live?",
        "author": "pokemon4all",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dd5he/what_is_it_called_at_your_call_center_when/",
        "text": "Where I work we “double-jack”\n\nYes, at my workplace saying things like “I have time at noon to double-jack” or “I’d love to double-jack with you” are common phrases. \n\nI’m very interested to learn about your non semi-sexual way to say this. Not that I’ll actually use it at my office though. What can I say, I enjoy a nice double-jack every once in awhile. ¯\\_(ツ)_/¯",
        "created_utc": 1536196049,
        "upvote_ratio": ""
    },
    {
        "title": "Rewards are more important than my life!",
        "author": "talensoti",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9db76m/rewards_are_more_important_than_my_life/",
        "text": "I just got off the phone with a customer on this one:\n\nCx: (before I can even start my spiel) where my gift visa at?\n\nMe: Thank you for calling xxxx rewards center, may I have your name and billing address?\n\nCx: blahblah louisiana. Now where my card at?\n\nMe:  I do apologize for that, (looking up account). Sir there’s a hurricane in that area.  I do see your reward has been mailed out on the end of August and should be to you in 5-7 business days.\n\nCx: that no good! I need card now!\n\nMe: hearing warning sirens in background) sir you should really take shelter now, for your own safety. \n\nCx: i’s not going in one o those shelters I want my card to i’s can go to a hotel and live it up!\n\nMe: sir the cards come by postal service mail. I don’t think that the post office is going to deliver during a hurricane. \n\nCx: ya’all are f$&amp;&amp;$&amp;&amp; useless! *click*\n\nWhat the hell just  happened here?\n\nEdit:  this is a literal transcription of the call. ",
        "created_utc": 1536182966,
        "upvote_ratio": ""
    },
    {
        "title": "\"You aren't being exactly clear on what you are asking\"",
        "author": "Throwawayxxx8",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9dat9q/you_arent_being_exactly_clear_on_what_you_are/",
        "text": "Just got off this call and my head hurts from guy's stupidity.\n\nMe: Thanks for calling (my work), this is Throwawayxxx8, how can I help you today?\n\nStupid Guy: I just need a plan balance.\n\nMe: I can help you with that. Can I please start with your primary contact phone number?\n\nSG: Contract Number? Where do I find that\n\nMe: Your contact TELEphone number\n\nSG: *Starts to give me our number*\n\nMe: The primary contact telephone number that you would have listed on the account\n\nSG: I don't have no CONTRACT NUMBER\n\nMe: Sir, what is YOUR PHONE NUMBER?\n\nSG: OH. My number. You aren't being exactly clear on what you are asking.\n\n*Pounds head on desk*",
        "created_utc": 1536180594,
        "upvote_ratio": ""
    },
    {
        "title": "Other agent didn't believe me.",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d8tu4/other_agent_didnt_believe_me/",
        "text": "I used to work taking inbound calls for a bank.\n\nMe: Yours truly\n\nC: Customer\n\nOA: Other agent\n\n&amp;#x200B;\n\nMe: Thank you for calling \\*Bank's name\\*, this is LadyNoir93, may I have your first and last name please?\n\nC: Hello. My name is Mr Customer, I have hearing problem and sometimes it's hard for me to understand high pitched voices. Can I speak with someone with a deeper voice?\n\nI'm a girl with a really high pitched voice, so I was definitely not the agent for him. I called my supervisor, explained the situation and he told me to just tranfer the call to a male agent. Usually we don't transfer calls to our same department, but it was an unusual situation.\n\nI placed the customer on hold and called a random agent. It took me a coupe of tries since there are more than 3000 agents in our call center and the phone dialed a random number. Finally at the third try I got a guy with a deep voice.\n\nOA: Thank you for calling \\*Bank's name\\*, this is Other Agent, may I have your first and last name please?\n\nMe: Hi, this is LadyNoir93, I'm a \\*Bank's Name\\* Customer Service agent as well. So  I have Mr Customer on the line...\n\nOA: You do know you can't transfer the call if we work on the same department right?\n\nMe: Yes, I know that. What happen is that Mr Customer has a hearing problem and...\n\nOA: And you don't want to help him because is hard so you are trying to get rid of him.\n\nMe: Can you stop making assumptions? Mr Customer has a hearing problem and he wants to speak with someone with a deep voice. As you can hear I'm a female with a high pitched voice, can you take the call?\n\nOA: Sounds like you don't want to help him.\n\nMe: Look I've had Mr Customer on hold for almost 10 minutes now. My supervisor gave me green light to transfer the call. Just take the call.\n\nOA: Just for you to know I'm copying your ADP and I'm reporting this to your supervisor.\n\nMe: You are losing your time. I've told you he already gave me green light. I'm not lying. How much of an idiot do you think I'm to make something up if I know the call is being recorded?\n\nOA: Bullshit, you just don't want to help a disable customer. Shame on you.\n\nMe \\*sight and resigned to having to dial a fourth number, knowing that I'm hurting my transfer record\\*: It actually sounds like you don't want to take the call.  Just for your knowledge I already copy your ADP as well and I'm reporting this to your supervisor too. Bye.\n\nAnd have to try twice until I finally got a nice guy who took the call.\n\nEach try hurt my transfer record and the customer was on hold for a little over 10 minutes.\n\n&amp;#x200B;",
        "created_utc": 1536168660,
        "upvote_ratio": ""
    },
    {
        "title": "Basic math",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d8lx2/basic_math/",
        "text": "I think I've told this story before in my old account or maybe on another subreddit, but it's woth repeating.\n\nI used to work taking inbound calls for a bank.\n\nMe: Your's truly\n\nC: Customer\n\n(After the usual greeting)\n\nMe: How may I help you Mr Customer?\n\nC: So I'm calling because I received my credit card statement claiming I owe you $256. I know that from I purchased \\*item\\* from \\*store\\*. I returned it, so I shouldn't owe anything right? Did the store refund my money?\n\nI gave him my usual script of how I understood his concern and I was going to review the account to see what was going on. I asked for the usual information to verify him and checked the account.\n\nMe: Thank you so much for waiting Mr Customer. I was reviewing your account and I can see that indeed \\*store\\* made a refund to your account on \\*date\\*. \n\nC: Then why I still owe $256?\n\nMe: What happened sir is that you had a balance of $512, since the store refunded $256, you still have a balance of $256.\n\nC: Why? The store refunded that, I shouldn't have to pay for that. \n\nMe: Sir, you had a balance of $512, minus the $256 of the refund, you still have a balance of the remaining $256.\n\nC: Minus the $256 that's 0, right?\n\n&amp;#x200B;\n\nRise, rinse repeat for about 15 minutes. \n\nI even read his transactions one by one and encourage him to do the math himself with me, to show him it added to $512, minus the $256 refund he still owes $256. \n\nAt the end he decided he wanted to be transfered to the dispute department because he thought the store was robbing him. At least he was not rude about it, jut incredibly stubborn and dense. ",
        "created_utc": 1536167311,
        "upvote_ratio": ""
    },
    {
        "title": "\"No, it's YOUR issue!\"",
        "author": "4amSOSCall",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d7u53/no_its_your_issue/",
        "text": "Some background: I work on a specialised tech support team for a large telecom in Canada. Essentially customers who have had several tech visits within a period of time are routed to my team, where we act as case owners. We're able to go beyond the usual troubleshooting, as well as having more pull in getting things expedited to resolve whatever ongoing issues for customers. Sometimes these can be a single persistent issue or a variety of issues. Generally people are frustrated, but are relieved when we explain we're here to help and they wont have to jump through the usual hoops. \n\nAdditionally, there is another team who are managers for recurring or problematic callers. Think of people who call in several times a day or are abusive, etc. As a result, there is a bit of overlap between our customer bases, so we work very closely. My team kind of acts as a filter for that team, so they can focus on the legitimate problem customers. \n\nNow here in Canada, we have a federal regulatory group called the CRTC, which has a rule regarding \"demarcation\" points. This rule basically states telecoms are only responsible to a certain point in the house, anything past is considered the responsibility of the customer. This usually means things such as inside wiring (yes, you're responsible for the wiring in your home, not us) or how to use your own devices (I'm not a computer tech or a teacher).\n\nAnyway, on to the story!\n\n----------------------------\nI receive an internal transfer from a frontline agent, saying he has a customer on the line and she's calling in about not being able to connect her laptop to the internet. I take a look at her previous visits and see she had a tech earlier that day, and the tech notes show there's nothing wrong with anything on our side, just her laptop not connecting as it's older. So I tell the agent he can pass her on through to me, but he then says she just hung up...not a good sign. \n\nI call her back and start in on trying to figure out what the issue is. Turns out her laptop isn't the issue, it's that the netflix on her smartTV keeps giving her a \"network error occurred\" message. She's able to connect on her cell phone, but not her smartTV. It likely needs to be given the wifi name and password so it can connect properly.\n\nAs her cell phone is connected and working fine, I'm unable to assist with connecting the smartTV, as simply put, I don't know how (I'm sure I could figure it out if I really tried, but I'm not about to set **that** precedent) However, if she gives me the manufacturer of the TV, I can get their support number and they'll be able to assist her.\n\nMe: Me\n\nSOPA: Stubborn Old Pain in the Ass\n\n----------------------------------\nMe: So you're able to connect and surf okay on your cellphone, but you're having issues with your TV?\n\nSOPA: Yes, that man was here just a while ago and did something to the internet, so now it's different (he literally just moved the modem to a different location and ensured her busted ass laptop connected, so there shouldn't be any differences but whatevs)\n\nMe: Okay, well at that point, this is technically beyond my scope of support, as I'm not a television tech support specialist; however, if you know the manufacturer, I can get their support number for you and they'd be able to help.\n\nSOPA: No, this is YOUR issue. You need to do this for me\n\nMe: Ma'am, I am unable to do so, I don't know your TV or how to change these settings. There's no issues with your internet, as your cell is connected. Again, I can get the support number for the TV, but I'm unable to do much else.\n\nSOPA: NO, I don't care about any of that, I just want it working now. \n\nME: Ma'am you need to understand, I **cannot** do anything. Again, if you provide the make of TV, I'll get the manufacturer and they'll solve it for you very quickly.\n\nSOPA: I want to talk to a manager\n\nMe: ...allright, one moment.\n\n----------------------------\n\nSo I get her to an escalation manager and he takes it from there. But oh no, we're not done.\n\nI take a look at her previous tickets, mainly as if she has a certain amount within a certain period of time, she is considered a problem customer for the other team. And look, she has 8 tickets in the past 2 months alone, all of which indicate she is consistently unwilling to do any sort of troubleshooting and just demands we \"fix it\". \n\nSo now she is with the other team, which is essentially the \"end of the line\" for customers. They have final say on issues, you likely won't speak with anyone else, and if you somehow do, any changes/credits/visits etc will be undone. Basically all you can do is either cancel or smarten up. \n\nThe icing on the cake is moments later I receive a message from the other team that SOPA has been assigned to the biggest bitch on the team, who never breaks on anything. She's gonna have some fun there.",
        "created_utc": 1536162709,
        "upvote_ratio": ""
    },
    {
        "title": "Proving middle-management are incompetent",
        "author": "MrStaunch22",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d7s5z/proving_middlemanagement_are_incompetent/",
        "text": "I originally posted this on r/MaliciousCompliance, but u/eiskoenigin mentioned this sub would enjoy it too. \n\nLong time lurker, first time poster. Im posting this on mobile so please take it easy on me if the formatting is off!\n\nSo, a bit of context first.\n\nI worked at a call centre for an insurance company. I was a sales and service consultant looking to move up within the company, so i was always looking to complete additional tasks to improve my chances on gaining the next promotion.\n\nAs some of you may know, call centres are usually quite toxic and inolve micro-managing employee’s until they hate themselves. This call centre was no different.\n\nOne of the biggest company focus’s at the time was our online ‘self service centre (SSC)’ - basically it was to assist customers in moving their transactions online so that we didn’t have 1000 calls a day asking for something small such as a change of registration number or updating the address their vehicle was parked at.\n\nConsultants were required to promote (read: force feed) the SSC to every customer on every call. In the office was roughly 13 team leaders, as well as a senior manager. Each team had roughly 10-15 people, so all together there was about 150-200 people on the floor. Each team leader had their own idea of how it should be promoted and forced that ideology down the throat of their consultants - the most common proccess was to promote it immediately at the start of the call. You can imagine this was a mess, as you call your insurance company for help and they tell you to jump online before they even discuss or acknowledge your call.. which is frankly extremely rude customer service.\n\nAdditionally, the consultants never received proper training for the SSC - so they were not 100% sure of what processes you could and could not complete online... so no matter what the customer called for, the consultant would tell them at the start of the call they could complete it online.\n\nNow, back to me completing additional tasks; i decided to take ownership of the SSC and to help educate my fellow consultants on how we could better promote the online service.\n\nI had lengthy conversations with consultants to determine why they were uncomfortable promoting the SSC, and (big surprise) there was two main reasons;  they felt it was rude to promote it at the start of the call, and they did not know what processes you could complete online.\n\nI organised a presentation with the team leaders and discussed my findings, and asked for their thoughts.\n\nI was greeted with a fair bit of tirade, which went along the lines of “we have taught our consultants the right way, you’re just a consultant yourself so we know better than you do, and until you prove otherwise, we wont listen to your suggestions at all!” \n\nI had a chat with the senior manager, and i told him that the reason we were experiencing low digital promotion numbers were because the team leaders did not understand the capabilties of the SSC, and were forcing cosultants to promote the service even if you were not sure if their request could be completed online. His exact words were “prove it, and i’ll take your side on this.”\n\nI waited until the next big presentation ( which included the senior manager, team leaders, and all of their consultants. I requested 10 minutes for a quick presentation on the SSC, and my senior manager agreed without asking what i was planning to do.\n\nQueue the malicious compliance - i created a 20 question true/false quiz on the functionality and capability of the SSC, and handed one copy and a pen to each of the team leaders and asked them to fill it in quickly.\n\nThe look of horror on each of their faces as they recieved the quiz and realized they knew nothing about the SSC was amazing to see. Their consultants were all smiling ear to ear, as they could see the point i was trying to prove.\n\n10 minutes later, i read out the answers and got the team leaders to mark the sheet of the person seated next to them; it wasnt a suprise when they read out the name of the team leader and their score - none of them scored more than 10/20. The senior manager was seated in the corner of the room, with a little smile on his face as he watched this all unfold.\n\nHe had a chat to me afterwards and let me go through with the presentation i had planned for the SSC - digital promotion numbers increased from 13% to 85% within the space of a week.\n\nTL;DR; team leaders think they know everything about a program, i provide them with a quiz in front of all of their consultants and they fail miserably.\n\n",
        "created_utc": 1536162402,
        "upvote_ratio": ""
    },
    {
        "title": "\"No, this is YOUR issue!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d7fwi/no_this_is_your_issue/",
        "text": "[deleted]",
        "created_utc": 1536160244,
        "upvote_ratio": ""
    },
    {
        "title": "I helped a customer find out that her husband was cheating",
        "author": "Kyrinaki",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d7b8w/i_helped_a_customer_find_out_that_her_husband_was/",
        "text": "I worked at a large telecommunications call centre 10 years ago. This is one of my most memorable calls. I was an accounts manager for business cell phone accounts, and one morning I received a call from a very upset and abrupt woman. After she begrudgingly verified her full name, DOB, address for authentication purposes I enter her business cell phone account. \n\nShe asked me to go through the call history for the past few days on one of the two cell phones on her business account, BUT specifically she wanted to know if ONE number in particular had been dialled. \n\nI go through the call history:\nMe: “ok ma’am, the number x-x-x was dialled at 8am, 2pm and 7pm yesterday”\nCustomer: “UGHHHHH i fucking KNEW it! that ASSHOLE!”\n\nAt this point I realise the other name on the account is a guy with the same surname and most likely her husband. I then spent the next 5 minutes going through all the calls dialled from her husbands cell to this particular number and telling her the length of the call and the time dialled. She was breathing heavy and told me she needed to take a seat because she was shaking. I felt so bad for her so I offered to send her the itemised call list through fax so she didn’t have to wait until next month (or pay the $5 fee for the full itemised bill). She tells me “thank you for your help. I now have proof to divorce the bastard”\n\n“Anytime ma’am. Good luck (with your divorce) and thank you for calling (company)” I hope the guy has learnt not to link his cell phone to a shared account next time he cheats. Idiot.\n\nTLDR: I helped a wife go through her husbands cell phone record. He was cheating. ",
        "created_utc": 1536159393,
        "upvote_ratio": ""
    },
    {
        "title": "When A Customer Wants Declined Payments Refunding",
        "author": "peacesalaamz",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d5t2s/when_a_customer_wants_declined_payments_refunding/",
        "text": "Just for some info. my manager was sat next to me whilst I took this call. I would say that I was surprised but I have been working in call centres for far too long. On phone so sorry for any formatting errors. I will be **ME** and the customer will be **CL** for Crazy Lady.\n\n---\n\n&gt; **ME**: Hello and welcome to [Bank]. You’re speaking to Peace. How can I help.\n\n&gt; **CL**: I wanna know when you’re going to refund me my money! I didn’t even buy anything!\n\nUgh, I pray for the day customers stop opening with such vehement rhetoric. Calm your precious little socks.\n\nSecurity is completed. I put the customer on hold for ~2mins before going back.\n\n&gt; **ME**: Okay, **CL** I can see 5 transactions that were declined due to merchant error. The 6^th one went through it. If you’re disputing that payment because nothing was purchased you would need to raise this with the merchant. It was their error. Their number is 1234 555 6789. Alternatively, you could just visit their store.\n\n&gt; **CL**: Yeah, I know the payments were rejected! So when you going to refund them?! Huh?!\n\nWhat? I thought maybe I misheard.\n\n&gt; **ME**: I’m sorry Crazy Lady but the payments were declined. As in they were rejected. There’s no way to refund them. They didn’t leave your account. Only one payment did and as I’ve explained you would need to speak to the merchant.\n\n&gt; **CL**: Stop telling me they were declined! I already know that! I just want my money back. Let me speak to your manager!!\n\nWhat. The. Actual. Fuck?! My face hit the desk so hard I still have a mark. Fortunately, my manager calmed me down. He was completely mind fucked too. It took another 5mins for my manager to tell this person that we could not refund declined payments because y’know a) it’s impossible because b) they never left her account. \n\nI really want to believe that people are logical and rational. I really really do. But this job man. It diminishes call after call. Why are customers so stupid?\n\nEDIT: formatting.",
        "created_utc": 1536148765,
        "upvote_ratio": ""
    },
    {
        "title": "Oh, so you ADMIT it!!",
        "author": "perfectway76",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d20is/oh_so_you_admit_it/",
        "text": "I work for a financial institution. We communicate important info to our customers by phone, letter, email etc.\n\nWe had some major changes to our policies recently and sent communication to all customers.\n\nGuy calls me today ranting and raving and claims he \"wasn't told\" about the changes blahblahblah. Blaming anyone and everyone.\n\nI informed him of the ways we communicate with our customers (by letter, phone, email etc). He mumbles something to the effect of \"Well I don't read my mail\".\n\nOh, so you admit it then!!! ",
        "created_utc": 1536113185,
        "upvote_ratio": ""
    },
    {
        "title": "Customer refuses to give info and causes call to take 10 minutes when it should’ve been 3",
        "author": "Aloaacc",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d1t5r/customer_refuses_to_give_info_and_causes_call_to/",
        "text": "So ftp and on mobile! Sorry in advance! I just took this call a few days ago. I work for a big name insurance company and we have strict verification guidelines we have to follow. \n\nMe: Hello, thanks for calling *insurance* do you have your policy number?\n\nRude Guy: I got an email from you saying you need forms. I already sent you what you need. What’s going on?!\n\nMe: *Tried to look up account with phone number he called in on with no luck* Well, I can definitely see what I can do to help you but I need your policy number first. Do you have that available? \n\nRG: No! I already gave it to your system! You should have me pulled up! Why don’t you have my information pulled up!? \n\nMe: I’m sorry, sir, but I don’t have anything that came through. Before I can do anything I need your policy number. Do you have it?\n\nRG: This is ridiculous! I can’t believe how terrible this company is and how awful your system is! *mumbles about going to get it* I found it it’s xxxxxx. *continues on about how awful we are*\n\nMe: *generic answer about how sorry I am regarding the system* Thank you for finding the number, now can I have your name and DOB to verify you?\n\nRG: No you already have my information I’m not giving you anymore!!!! \n\nMe: I understand, but before I can talk about the account I need to verify you. \n\nRG: I didn’t call in to play 20 questions! Do you have my account pulled up!?\n\nMe: Yes, you gave me the number. \n\nRG: My DOB is x/x/xx. Now do you have it pulled up?!\n\nMe:...Yes. Now I need your name to verify who I’m speaking with. \n\nRG: I’M NOT GIVING YOU ANY MORE OF MY INFORMATION, YOU HAVE MY ACCOUNT PULLED UP NOW FIGURE OUT WHAT YOU DID WRONG AND FIX IT!  \n\n*click*\n\nAfter reading through the notes, all we needed was to verify some information from what he sent us in. So. Needless to say I did not “fix it” and he will most likely have to call back later after more emails, all because he wouldn’t give me his name.  ",
        "created_utc": 1536111494,
        "upvote_ratio": ""
    },
    {
        "title": "Airline call center pet peeves",
        "author": "Ceyepher",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d1sdk/airline_call_center_pet_peeves/",
        "text": "Not having the reservation code ready.\n\n \"Oh you need that?\" Or \"can't you just look it up by my name?\" Yes, but if you booked through a third party website, your name might have Mr or Mrs attached or maybe your first and middle name smushed together. Or maybe you have a unique name and instead of trying to understand a combination of 6 letters/numbers, now I have to make sure I hear 27 letters correctly. Or maybe your name is Jose Gonzales and there are approximately 200 other Jose Gonzales' flights so I will need to ask you extra questions to narrow it down. Heaven help me if you misremembered the right date so I'm trying to narrow it down by criteria that doesn't apply. \n\nName spelling bonus: people calling in to make a name correction without their confirmation code and when I ask them to spell out the name so I can pull up the reservation, give me the CORRECT spelling. I tell them there's no reservation under that name and *they* get sassy with *me* saying , \"I *know*! That's because it's spelled *wrong*. I'm calling to fix it!\" \n\nJust ..just... Gaaahh! \n\nComplaining about hold times. There is zero benefit to complaining about hold times. It contributes to the hold times for customers after you when you and every other customer wants to comment on our ask about or exaggerate how long you were waiting for. \n\nDouble that if you had to wait on hold for 20 minutes and you STILL don't have a confirmation code ready!\n\nAngrily asking why your flight is delayed. I don't mind if you're curious what's going on and I'm happy to answer with the limited information I have. Any information I have will be very generic. Maintenance. Crew. Weather. Air Traffic Control. \n\nBut if you're the \"I demand to have an answer!\" type, just...why? It will literally make no difference to you. Especially when there's a lot of other customers waiting on hold for help. It's just a waste of time and an invitation for more useless questions/or useless arguing. \"What do you mean weather? It's fine here!\" \"What's wrong with the plane?\" \"Is it going to be safe to fly?\"  \"Are they going to cancel the flight? When? I'm inconvenienced! What are you going to do about it?\"\n\nLetters in confirmation codes.\n\nMany letters sounds very similar over the phone regardless of the clarity of the call. Most of the time, I'm used to it and can guess which letter I may have heard wrong. \n\nSometimes I ask for a word to be used with each letter only to have the letters repeated again, no words. Or words that do not start with that letter. \"Q for cute.\" Or rhyming words that could also make sense with different letters that sound the same (sun/fun) (boy/toy)(might/night).\n\nOr not listening properly when I try to clarify. \n\nMe: \"So that's T like Thomas, B for bravo....\" \nCustomer: \"uh huh\"\nMe: \"Hmm... It's not pulling up. Can you tell me again?\"\nCustomer: \"oh really? It should be there. D like in David, P like Peter....\"\n\n\n\n\n\n",
        "created_utc": 1536111315,
        "upvote_ratio": ""
    },
    {
        "title": "12pm doesn’t exist",
        "author": "diamondback2",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d1ofu/12pm_doesnt_exist/",
        "text": "I seriously contemplated quitting today since the call centre I work at is my second job but my team lead convinced me to stay, and I seriously contemplated quitting in the middle of my last call. A guy calls in to file a property claim for missing jewellery of an estate he’s settling so I ask for the date of when he realised the jewellery was missing. He gave me the date, so I asked for the time. He didn’t know, so I ask if it’s okay to use 12pm/noon as an estimated time, per our guidelines. He proceeds to tell me that “12pm doesn’t exist”. So I was like ??? “Well 12pm as in 12 noon as opposed to 12 midnight..” and he repeats himself. So I just said “Okay” because I didn’t really care to argue. He went on to tell me what pm and am stand for and something about the sun’s positioning and how there was a Supreme Court Case about how a parking sign said 12pm and the guy (in the case) argued that 12pm doesn’t exist. I just said “Oh. You learn something new everyday!” Then he made a statement about how you don’t really know what time you’re setting your alarm for when you set it for 12pm or 12am and in my head I was thinking, maybe YOU don’t know, but the rest of us do... he was just unnecessarily smug because he knew exactly what I meant when I said 12pm. Then a little later he asked if something isn’t written into the policy will it still be covered (like if a certain jewellery item wasn’t written in the policy), and I told him I’m just trained to take claims and an adjuster will let him know what’s covered (even though I’d assume that if something isn’t written into the policy, it’s not covered) because we’re not supposed to get into policy details or coverage info. So he repeated himself and asked the same question like my answer would change, so I repeated my answer. He was just such a jerk for no reason, like he just wanted to feel intellectually superior because he knew a useless fact. I just imagine how many people he’s “educated” about 12pm and I imagine him finding opportune moments to insert random trivia into conversations like “1 in every 2000-3000 babies is born with a tooth”. I was professional through the whole thing and didn’t hang up like I wanted to but the whole time I was just gritting my teeth hoping the call dropped. Some people have too much time on their hands. ",
        "created_utc": 1536110417,
        "upvote_ratio": ""
    },
    {
        "title": "There are other ways besides deliberatly lying that you can be incorrect about something ma'am.",
        "author": "Ceyepher",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9d12af/there_are_other_ways_besides_deliberatly_lying/",
        "text": "Wish I said that.\n\nIt bothers me when customers deny certain information that's clearly recorded in their reservations.\n\nLady: I booked this ticket for my 12 year old daughter as an unacommpanied minor with your agent over the phone. \n\nMe: This was booked as an adult ticket on our website with the birth year listed for her as 1993. If she's an unacommpanied minor, we need to fix the date of birth and add the fee--\n\nLady: ARE YOU ACCUSING ME OF LYING? \n\nMe: No ma'am, I'm simply telling you what my computer shows. There's no record of a phone call or any agent that made this reservation. It was booked on our website.\n\nLady: WELL EITHER YOU'RE LYING OR I AM SO WHICH IS IT?\n\n*Sigh* No, customer, there no way you could possibly be genuinely mistaken or have forgotten some details about a flight you booked two months ago.\n\nI had another one today asking for a receipt insisting she booked from us directly when I can very clearly see it's from Expedia and she'll have to get it from them. \n\n\"But I *always* book with you directly. Why would I go through Expedia?\"\n\nBeats me lady. I don't know! But I can clearly see you did!\n\n",
        "created_utc": 1536105404,
        "upvote_ratio": ""
    },
    {
        "title": "Yes Mrs Customer, I do need your full SSN",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9cxh26/yes_mrs_customer_i_do_need_your_full_ssn/",
        "text": "I used to work taking inbound calls for a bank.\n\nMe: Yours truly\n\nC: Customer\n\n&amp;#x200B;\n\n(After standard greeting and asking her for her name).\n\nMe: How may I help you Mrs Customer?\n\nC: I lost my credit card.\n\nMe: I understand that can be a distressing situation but I'm here to help you. Let's file a missing card report, we'll review your recent transactions to make sure there hasn't been any fraudulent transactions and then we'll send you a new credit card.\n\nC: Sounds good, thank you.\n\nMe: May I have your full Social Security Number please?\n\nC:No, why do you need my SSN?\n\nMe: To locate your account.\n\nC: I have never been asked for my full SSN before. You guys usually ask for the full credit card number and the last four digits of my SSN.\n\nMe: Exactly Mrs Customer. but right now you do not have your plastic with you and that's the only place where the full number is. So we need your full SSN to be able to locate your account without using the full credit card number.\n\nC: How do you know I don't have the plastic with me? Are you spying on me?\n\nMe: You called to report it got lost. We are going to fill a missing card report.\n\nC: Oh yeah right. Sorry. I still don't want to give you my full SSN.\n\nMe: I understand, but it's the only way I can locate your account without using your credit card number.\n\nC: Can't you do it with my name, you have my name?\n\n\\*Sight, there are millions of clients in the bank. Was I supposed to browse until I found her. Besides, that's not safe at all. With only the name anyone could call and be like \"I'm this person\"\"\n\nMe: That's impossible Mrs Caller. I need your full SSN.\n\nC: I don't want to give it to you because you might use it to access my bank information.\n\nMe: That's exactly what I'm trying to do.\n\nC: So you admit it. I record every call and I'm calling the police. You'll be arrested.\n\n\\*Call disconnected\\*\n\n&amp;#x200B;\n\nEDIT: All these people saying why didn't I ask for her Date of Birth/Phone Number/Address. How safe would you feel if people can access to your bank account with info that family/friends and SO knows.",
        "created_utc": 1536079995,
        "upvote_ratio": ""
    },
    {
        "title": "Aren't lawyers supposed* to be good at logic?",
        "author": "NotTryingToConYou",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9cxc2f/arent_lawyers_supposed_to_be_good_at_logic/",
        "text": "Hi, it's the dude who works at a tech/law website.   \nThis is a quick one that just happened 5 minutes ago.  \n\n\nMe = Me  \nLawyer = L  \n\n____\nL = Your website keeps redirecting me and keeps giving me this error when I log in.  \nMe = I just logged into your account, looks fine. Could you clear your cache?  \nL = I'm not that tech inclined how do I do that.\n\nMe = What browser are you using?   \nL = Idk\n\nMe = Is it green red and yellow? Orange and blue? or Blue with an E?\n\nL = Blue with an E.\n\nMe = Aite, I'll send you a link with the steps.   \n\n\n\\*\\*5 Minutes Later L Calls back\\*\\*  \n\n\nL = Your steps don't work, I can't find the \"Gear\" icon.  \nMe = It should be right next to the search bar, could you tell me what you see there?   \nL = YEAH IT'S NOT THERE. All it says is search bar and then three dots which say \"Customize google chrome\" when I hover over them\n\n  \n\\*\\* Me Dies from Face palming\\*\\*",
        "created_utc": 1536079170,
        "upvote_ratio": ""
    },
    {
        "title": "Wrong bank",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9cxb22/wrong_bank/",
        "text": "I used to work taking calls for a bank.\n\nMe: Yours truly\n\nC: Caller\n\n​\n\nMe: Thank you for calling \\*banks name\\*, this is LadyNoir93. May I have your first and last name please?\n\nC: Hi, I'm Caller.\n\nMe: Hello Mr Caller, how may I help you?\n\nC: I want to know how much I have available in my credit card.\n\nMe: I'll be happy to assist you, may you give me your full credit card number and the last four digits of your SSN.\n\nC: My credit card is xxxx-xxxx-xxxx-xxxx and the SSN is xxxx.\n\nMe: I'm sorry Mr Customer, I'm unable to find an account with this information. May you repeat your information please.\n\nC: Oh ok. Pay attention please I'll repeat it slowly: my credit card is xxxx-xxxx-xxxx-xxxx and the SSN is xxxx.\n\nMe: Thank you so much sir. I'm still unable to find your account. May I have your full social security number?\n\nC: I'm not liking this but whatever. xxx-xx-xxxx.\n\nMe: I'm sorry sir, but I'm unable to find you in our system. You are not in our customer data base.\n\nC: What do you mean I'm not in your database. I have been your customer for 20 years! I can't believe this. DId you deleted me from the system just because I was late last month?\n\nMe: That's impossible sir. \\*Bank's name\\* doesn't delete people from...\n\nC: Wait a second, did you said \\*Bank's name\\*?\n\nMe: Yes.\n\nC: I thought I was calling \\*Another's bank name\\* I don't have an account in \\*Bank's name\\*\n\nMe: I understand the confussion Sir. In that case there is nothing I can help you with. Have a nice day.\n\nC: Wait a second, can you check my account in \\*Another's bank name\\*\n\nMe: I'm unable to do that sir, we can only see accounts from \\*Bank's name\\*\n\nC: You are so useless. That's why I don't have an account with you. Bye",
        "created_utc": 1536078997,
        "upvote_ratio": ""
    },
    {
        "title": "\"...I am NOT threatening you...\"",
        "author": "BrigandBrawnsbane",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9cv1uy/i_am_not_threatening_you/",
        "text": "I used to be a Customer Service Rep at a Call Center for a fairly prominent retail entity. Taking orders, general info, fan talk, you name it. The following call I can 100% guarantee the recording was kept on file for future training purposes.\n\n(Some details have been kept vague in order to maintain anonymity of the company, myself and the customer.)\n\n\\--------------\n\n**The Problem:** The customer tried to register his kid’s online computer game incorrectly, wasn’t working. Here’s what happened:\n\n\\--------------\n\n\\- Out the gate, Customer claims he's been on hold for twenty minutes. Our call queues show no wait times, so he’s either lying to gain leverage / justify his anger or was transferred from another line that has nothing to do with us.\n\n&amp;#x200B;\n\n\\- Customer starts going full abusive; interrupting to tell me how bad I am at my job then attacking me for waiting for him to finish yelling. Just opportunistically switching from *“No, YOU let ME talk, YOU shut up and take this.”* to\\* “Are you still there? Well SAY something, you idiot!\\*”\n\n​\n\n\\- Refusing de-escalation attempts, he pops off this gem: *\"What is WRONG with you? Are you educated? Are you even REMOTELY educated? I don't think you are. You don't SOUND educated to me. I bet you didn't even finish high school. Do you know what the word \"egregious\" means? Do you? Egregious means \"colossally bad\", that's what this is.\"*\n\n&amp;#x200B;\n\n\\- Customer puts ME on hold twice, taunting me in the process. (*\"You know what? I'm putting YOU on hold. Let's see how YOU like it!\"*) During this time, I figure out the issue, but every time I try to explain the situation the customer cuts me off. At this point he is actively preventing me from solving his problem.\n\n&amp;#x200B;\n\n\\- After growing bored of putting me on hold, he reverts back to demanding I fix his problem: *\"SHUT UP AND TELL ME HOW TO FIX THIS.\" (At this point, I repeat back to him \"Yes, I WILL shut up and tell you how to fix this\")* He fires back wi*th: \"OH DON'T DO THAT.... DON'T*.\" This garners the attention of the rest of my team, who begin passively eavesdropping.\n\n&amp;#x200B;\n\n\\- Customer then demands to speak to my manager. My manager takes over the call at my desk with me. Because the customer is still refusing to give the info I need to fix the issue he proceeds to treat her just as badly. He then puts HER on hold for two minutes out of spite and then proceeds to bully her so much that she nearly breaks down in tears, forcing me to take the phone call back. Upon hearing my voice he responds *\"Oh good, it's you again.\"*\n\n&amp;#x200B;\n\n\\- At this point he is now screaming his credit card information at the phone when I start explaining what the issue is, demanding: *\"JUST FIX IT. JUST FIX IT. I HAVE MONEY JUST FIX IT. (Screams card number and security code)\"*\n\n&amp;#x200B;\n\n\\- Customer demands my full name. After receiving it, he starts saying: *\"Listen to me (my name); I'm not threatening you... I AM NOT THREATENING YOU..... but I am a VERY wealthy and powerful man and I can make your life VERY difficult. I am NOT threatening you! \"*\n\n&amp;#x200B;\n\n\\- He then begins screaming away from the phone, seemingly directed at someone in the room, which sounds like a wife and child. I hear what sounds like a kid crying and a woman trying to calm him down as a door slams.\n\n&amp;#x200B;\n\n\\- I’ve run out of care at this point, so I talk down to him and spell out that in order to solve his problem I need to obtain a valid e-mail address and get an authorization code from a different department, which involves either putting him on hold or doing a follow-up call. I recall using the phrase **“I can’t wave a wand to magically fix this problem right now. Believe me; if I could I would have done it five times over by now.”**\n\n​\n\n\\- The customer becomes more cooperative. He coughs up the information I need. He then says: *\"Just send me an e-mail, my phone is dying.\"* and hangs up.\n\n​\n\n\\- Five minutes later, I send an e-mail with the info he needs along with instructions on how to register his kid's computer game correctly so he doesn't have to call us back. I also tagged on some extras as apologies for the trouble. Never heard from him again. I think about that phone call once every couple months. This was ten years ago.",
        "created_utc": 1536063341,
        "upvote_ratio": ""
    },
    {
        "title": "No Supervisor? Oh I’ll wait!",
        "author": "mystandtrist",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9cua0a/no_supervisor_oh_ill_wait/",
        "text": "Worked with supplemental health insurance in a very small call center. Now little back story on how our call center worked. We generally never had a supervisor available as there was only one in the dept and then it fell on the team leads to take escalated calls. If they were already on calls you were screwed. Customer could either wait or choose to receive a callback (which they almost never got in any sort of timely manner). So we close at 7pm. Supervisor leaves at 4 last team lead leaves at 5 and only 3 of us stay till closing. Now the fun part I’ll be Myst and SC will be stubborn customer.\n\nMyst: Thank you for calling blah blah how may I-\n\nSC-sorry to cut you off but I’ve been having trouble with the status of my claim and need to speak to a supervisor.\n\nMyst: unfortunately I have no supervisor available and will have to set up a callback can I get your name and phone # to look up the account?\n\nSC: no I’ll give it to the supervisor, go get me your supervisor.\n\nMyst: There is no supervisor-\n\nSC: you can’t tell me there’s no one there higher than you. No call center would leave the reps unsupervised. Put me on hold and go get someone there should be a supervisor in another dept or something go get them.\n\n(Queue in my head sarcasm cause yes we’re obviously not adults that can be left alone for two hours)\n\nAt this point I put him on hold and this was at 5:30. This entire conversation basically continued in the same manner for an hour and a half. Typically if you have to place them on hold for long periods you’re supposed to check in on them every couple of minutes. I let him sit for 20 minutes hoping he’d hang up but oh no I was obviously just not wanting to get a supervisor and there must be someone there.\n\nMeanwhile we have about 15 calls holding the two other reps busy with calls and I had to sit on hold for an hour and a half till closing because per their rules I couldn’t hang up on him cause technically he was being overly rude. \n\nClosing finally comes\n\nMyst: I’m sorry sir but we are now closed so you will have to call back tomorrow.\n\nSC: oh no you don’t you have to stay on the line till I get a supervisor don’t you dare- click\n\nSo in ending I don’t necessarily blame the guy most places have supervisors available at all times but when I’m telling there’s literally no one I can transfer him to I mean come on give me a break.",
        "created_utc": 1536055696,
        "upvote_ratio": ""
    },
    {
        "title": "Sorry, Dr. Poo",
        "author": "GryphonGirl420",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9crq1u/sorry_dr_poo/",
        "text": "I work taking and dispatching disaster calls to houses/businesses that are flooded, had a fire, and all other manner of distressing things that can happen to buildings. Today I was alone in the office. The storms were unreal, as was the flooding. My busiest (most fun) day to date. It was 25 minutes after leaving time, yet I stayed to finish one last job entry for a backed up toilet. The customer called back. My stupid ass answered.\n\nThank you for calling *cleaning service* , this is  *me* how can I help you?\n\nIT'S BEEN AN HOUR SINCE I CALLED!! NOBODY HAS CALLED ME BACK!!\n\nSir I am very sorry, due to the storms and the holiday we have been extremely backed up.. I just dispatched your job, you should get a call any moment now. \n\nI AM A DOCTOR!! THIS IS AN EMERGENCY! MY BATHROOM IS COVERED IN POO!! WHAT HAVE YOU BEEN DOING?!??\n\n*stifle chuckle, stifle chuckle* I am sorry Dr. .... But you will get a call any moment.\n\nHe continues to treat me like I am the scum of the Earth for a few minutes while I attempt to reassure him. I mean cmon. I stayed late to finish this guys job up. On a holiday. I'm sorry, Dr. Poo. \n",
        "created_utc": 1536028974,
        "upvote_ratio": ""
    },
    {
        "title": "I did it. I hung up on a customer.",
        "author": "Ceyepher",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9cq5eg/i_did_it_i_hung_up_on_a_customer/",
        "text": "I might get in trouble. I was already 30 min past my click out time. This lady just took forever to pick her flights in the first place chasing her mind multiple times and asking the same questions over and over about different flights. \n\nWe finally get to the confirmation page for the flight and she changes her mind. At this point I have to start completely over. But she promises she's sure she wants the other one. \n\nWe do the whole thing again, including more hemming and hawing and asking the same questions as before. We get to the confirmation page again and she changes her mind AGAIN.\n\nSo I start over a third time. Same deal. She changes her mind for the 4th time! I apologize that I can't help her and advise her to check online. She promises again like she has been the whole that she's sure but at this point, I honestly have no idea how long she's going to be doing this. So I just ended the call.\n\nAnd I'm super mad.",
        "created_utc": 1536015987,
        "upvote_ratio": ""
    },
    {
        "title": "Price Matching &amp; Reality...",
        "author": "Fenix159",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9ch3t8/price_matching_reality/",
        "text": "I'm not technically in a \"call center\" these days. \n\nI do e-commerce appliance sales, so it does involve incoming calls for people that want to buy fridges and whatnot. Mostly it's online order processing, support e-mails and live chats but phones are still part of it. Oh well, pay is worth it so whatever.\n\nPlus we get gems like this frequently...\n\n---\n\nCust: [Big Box Store] has this FFHD2250TS fridge for $1100 out the door including tax.\n\nMe: Great. What can I do for you?\n\nCust: Do you price match?\n\nMe: I can only match advertised prices.\n\nCust: I mean I just told you it's their advertised price, can you match it?\n\nMe: I see it advertised online on their website at $1698 and I'd be happy to match that, but if you can get it for $1100 including tax and delivery buy one. Buy two, I'll buy one off you and resell it.\n\nCust: That wasn't very nice. I just wanted to know if you can price match $1100 out the door.\n\nMe: No, I absolutely can't. But I'm not kidding if you can get two let me know I'll buy one too.\n\nCust: Ugh, you can't help me?\n\nMe: No but apparently [Big Box Store] can?\n\nCust: Ugh. Bye.\n\n---\n\nI used my automated system to price check and manually checked their website. $1698. Cost on that thing is $1466 (padded cost, I don't see real cost... but still). \n\nMoral of the story: If you want to fudge a price match, at least come in within the realm of possibility! \n\nMy assumption if you come in with a price match request below my cost is that you're either a liar, or an idiot that just passed up an amazing deal. But either way, I can't do it. ",
        "created_utc": 1535936082,
        "upvote_ratio": ""
    },
    {
        "title": "Today I accidentally took a picture of my penis on the work mobile.",
        "author": "incendiaryburp",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9ccwa3/today_i_accidentally_took_a_picture_of_my_penis/",
        "text": "I work IT support at a call centre and we have a mobile that is used by whoever is on IT at the time. \n\nI was in the bathroom at a urinal when the Mobile rang. Just to clarify i aim with the right hand so I answered with the left hand, anyway, I miss the call by milliseconds and must have hit the camera by mistake when putting the phone back in my pocket. \n\nJust got an email from the guy taking over from me asking why there is a picture of a penis in the phones camera gallery. Realising what had happened I explained, I am not looking forward to facing my judgemental colleagues on Tuesday morning.",
        "created_utc": 1535902336,
        "upvote_ratio": ""
    },
    {
        "title": "I want everything free!",
        "author": "mitzikatzi",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9caasj/i_want_everything_free/",
        "text": "So I work at a online shop as customer care. So we had a glitch in our system one day that made every item free for certain customers. We didn't see there was a glitch until we got a call!\n\"Hello I ordered from your website. It was 0€ and now you wanna charge me 4,50€ in delivery! Why!\"\n\nI mean how dumb can you be and call for a 4,50€ charge if you could have had all this stuff for just paying the delivery fee ? \nIt's good she called and we ended up canceling a bunch of orders, but what the hell?",
        "created_utc": 1535872184,
        "upvote_ratio": ""
    },
    {
        "title": "\"Just thought I should ask...\"",
        "author": "Dhiox",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9c44w6/just_thought_i_should_ask/",
        "text": "So I work for my University's Tier 1 IT support, which means we handle both IT problems over the phone or Email, or we escalate it to someone who can help. However, our jurisdiction is strictly IT, nothing more.\nSo one evening, after hours when most departments go home and our help desk only keeps a few people, a Professor called us and asked very casually:\n\nProfessor: So I had a student say they heard there might be an active shooter in Campus, is that true?\nMe: There's a WHAT? Excuse Me, but did you just say active shooter?\n\nNow the moment I said that my supervisor immediately perked up and had me transfer the call to them. She quickly asked where she heard this and after being told a student mentioned it, she asked for screenshots of the chat and began contacting higher-ups. We eventually determined there was no known threat, just a rumor, but it was kind of tense.\nTurns out police just did a wellness check on a student and found an unlicensed firearm on them, kid's gonna get arrested but no major threat to the School. However it blew up into a rumor and some student mentioned it to their professor through email.\nThe bigger question is why the Professor thought to call IT on this. If you think there might be a school shooter threat, call 911, or at least the non-emergency campus police line. Why IT, if she was correct, we were currently victims at the time. This isn't the first time either we've had tgis sort of issue, we've been called avout busy fires and other 911-worthy emergencies.",
        "created_utc": 1535817515,
        "upvote_ratio": ""
    },
    {
        "title": "A lady asking how to open someone's profile on Facebook",
        "author": "filip1998",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9c22u0/a_lady_asking_how_to_open_someones_profile_on/",
        "text": "So I'm working as tech support for a registrar in our country. The job mostly consists of assisting customers with any problems they have with our services: hosting and email hosting, that kind of a thing.\n\nYesterday I got a call from some lady and the conversation went something like this:\n\n----------------Begin Conversation---------------------\n\nMe: (Company's name), How may I help you? \n\nHer: Hello, I found this phone number online. Could you help me with something? \n\nMe: (Thinking it's something to do with our services) Yes, of course. Tell us what you need help with. \n\nHer: I received some messages on my Facebook and I can't open their profile. I think somebody might have hacked me. \n\nMe: (Not really understanding what's going on. I thought I didn't hear her right) Apologies. Could you just repeat your question? I didn't hear you well. \n\nHer: (Repeats herself) \n\nMe: (Not sure what to say, my first instinct is to try and help her somehow) I really don't use Facebook so I'm not sure how to help you, but you could try and report them or try and find contact support page on Facebook. \n\nHer: How do you not use Facebook? \n\nMe: I'm not sure if you know you've reached (Company's name) tech support. We have no affiliation with Facebook what so ever. \n\nHer: Well how do I resolve my problem now? They're hacking my account. Who do I contact? \n\nMe: I am really sorry, but I don't really know who should you contact with this problem. Just try and search Facebook support or something like that and you'll find what you need. \n\nHer: (Thinking for a second) sigh Okay. Thank you. Goodbye. \n\nMe: You're welcome. Goodbye.\n---------------------End Conversation-------------------\nI was a bit stunned at that moment and trying to think how did she figure she should contact us for this problem.\n\nEdit: Formatting, Readability ",
        "created_utc": 1535797515,
        "upvote_ratio": ""
    },
    {
        "title": "x-post from /r/talesfromretail Customer service bingo",
        "author": "mronion82",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9bz3zz/xpost_from_rtalesfromretail_customer_service_bingo/",
        "text": "A lot of customers show a few of these traits, but some seem to have them all-\n\nThe belief that they are the only truly important customer, and you should see to them first\n\nAsking for 'corporate' as a first move\n\nDescribing anything that displeases them as 'unacceptable'\n\nThey have a true and deep knowledge of customer service, which often dovetails exactly with their own desires at that moment\n\nChuckling derisively at the low wages of lowly droids while themselves being retired/unemployed/married to an idiot with more money than sense\n\nClosely connected is 'I pay your wages, you work for me'\n\nThe idea that there's some secret extra supply of goods or services that can be accessed if you wheedle/cry/threaten in the right combination.\n\nAsking your name repeatedly as an intimidation tactic and then...\n\nUsing your name repeatedly, often demanding a surname. (If pressed I give a family surname 'Featherstonehaugh' which is irrationally pronounced 'Festonhew'. Good luck with that one)\n\nDeliberate stupidity. You've broken it down to 'Harold the Bunny needed some lights in his house, so he signed something called a contract' level but they obstinately refuse to understand. Some people are really dim, but I've had doctors try it on\n\nThere must be loads I've missed, so please feel free to add...\n",
        "created_utc": 1535763779,
        "upvote_ratio": ""
    },
    {
        "title": "Crazy Pierogi Lady",
        "author": "norahnerd",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9by4ku/crazy_pierogi_lady/",
        "text": "So, I don't work for a call center, but this has been happening for over a month and I'm not sure where to post it besides here. Plus I enjoy r/talesfromthecallcenter so why not contribute. \n\nAnyway, I work for a nonprofit organization that cares for 20 historic sites and buildings, keep in mind we only have about 7 FT employees, and maybe 10 PT (including myself). And my job does involve a lot of phone calls, answering questions, selling tickets, booking events, stuff like that.\n\nEvery summer we have a festival towards the end of July. A couple days after this festival I received a phone call from a wonderful woman who I will call Crazy Pierogi Lady (CPL), and I will be Me. \n\nMe: Thank you for calling nonprofit visitor center. This is u/norahnerd, how can I help you? \n\nCPL: Yes, um hi. I purchased three bags of pierogies at your festival the other day and they were awful. I spoke with someone yesterday and they never got back to me.\n\nMe: Well I'm sorry to hear about that. Could you please fill me in on the situation? \n\nCPL: Yes well I preordered three bags of pierogies (we use PayPal for preorders, this is important later) and they were disgusting.\n\nMe: Well I'm sorry you had that experience. Was there anything wrong with them or did you just not like them? \n\nCPL: No! I bought these for my family. We ate all of them, we even tried putting powdered sugar on them to make them taste better but they were disgusting. \n\nMe: So you ate all of them? \n\nCPL: Yes. \n\nMe: And did anyone get sick? \n\nCPL: No. I want a refund! \n\nMe: I'm going to have to speak to a manager about a refund since you did say you ate everything and no one got sick. We are a non-profit and everything you spend with us goes directly into maintaining our 20 historic sites and buildings. Let me take your contact info so someone can update you later. \n\nFast forward to now, almost a month later. I never heard anything back from this woman so I assumed my supervisor either denied her refund request or granted a refund and everything was fine. About a week ago I get a call from this woman again. \n\nMe: Thank you for calling nonprofit visitor center. This is u/norahnerd, how can I help you? \n\nCPL: Hi Yes, I purchased pierogies at your festival last month and they were very bad. I talked to you guys and you said you'd give me a refund but I just got my card statement and its not on there! Can you help me? \n\nMe: Yes, I'm familiar with this situation, I believe you and I spoke near the end of July. Did my supervisor get in contact with you?\n \nCPL: Yes, she EVENTUALLY got into contact with me. I had to open a case with Paypal and report the payment as fraudulent to my credit card company! \n\nMe: So someone from nonprofit told you you'd get a refund? \n\nCPL: Yes \n\nMe: So why did you mark the payment as fraudulent?\n\nCPL: Because I never got my refund! \n\nMe: Well, if someone at nonprofit told you you would receive a refund, then you will receive a refund. I feel that was unnecessary on your end.\n\nCPL: Well can YOU help ME? \n\nMe: Let me put you on hold and I'm going to get in contact with the person responsible for refunds (now known as refund lady) and get back to you. \n\nMe: Hi, refund lady. Remember CPL? Whatever happened with that? Did we give her a refund? \n\nRefund lady: Yes! I've been trying to get in contact with her for the past two weeks... Paypal is not letting us refund her since she opened up a case. Tell her she needs to close the case so we can refund her. If there are any more problems just give her my extension. \n\nMe: Hi, CPL thanks for waiting. I just got off the phone with refund lady. She said she's sent you several emails over the past few weeks?\n\nCPL: Emails? I don't know anything about that! \n\nMe: Okay, well she told me that you needed to close the case you opened with Paypal so we can refund you. \nCPL: What does Paypal have to do with this? I have a credit card. \n\nMe: That's the payment method we use for preorders. You did do a preorder, yes?\n\nCPL: Yes\n\nMe: So you used Paypal, you need to end your case with them so we can refund you.\n\nCPL: Can't you just give me the refund now? \n\nMe: There's literally nothing else I can do for you. Here is the number and extension for refund lady. \n\nCPL: Can't you just transfer me? \n\nMe: No, I'm not even in the same building as refund lady. \n\nSo that happened about a week ago. Today, refund lady came into where I work and I asked her about it. Apparently, refund lady had to call Paypal to force a refund through and WE were charged a $20 fee for closing the case. SO on top of this CPL's $37 refund, multiple 30 min phone calls, we now are also out an extra $20. For pierogies. That she ate all of, with powdered sugar for some reason. \n\nAlso CPL's excuse for ignoring two weeks of emails is that \"she doesn't know how.\"",
        "created_utc": 1535755082,
        "upvote_ratio": ""
    },
    {
        "title": "\"I want you improve my credit score\"",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9bv6dr/i_want_you_improve_my_credit_score/",
        "text": "I used to work taking inbound calls for a bank.\n\nMe: Yours truly\n\nC: Customer\n\n&amp;#x200B;\n\nMe: Thank you for calling \\*banks name\\* , My name is LadyNoir93, may I have your first and last name please?\n\nC: Hi my name is Mrs Customer. \n\nMe: Hello Mrs Customer, how can I help you?\n\nC: I want you to improve my credit score. I want to buy a house and i can't with my  current credit score.\n\nMe: I understand Mrs Customer but we cannot alter your credit score. As your bank we report all your credit information to the credit bureaus two days after your cycle ends and then...\n\nC: Don't give me excuses. Just increase my credit score. \n\nMe: Mrs Customer, I'm unable to modify your credit score. We report all your information to the credit bureaus. If you need further information you can always contact them. \n\nC: I won't call them. In fact I won't disconnect the call until you improve my credit score. \n\nMe: It's going to be a long call, I'm unable to do it. \n\nC: It's your fucking job. Do your fucking!\n\nMe: Actually it's not. Improving your credit score is YOUR job.\n\nC: I want to speak with your manager. I'm going to get you fired. \n\n&amp;#x200B;\n\nThen she proceed to try to convince my manager to get me fired right away.",
        "created_utc": 1535733614,
        "upvote_ratio": ""
    },
    {
        "title": "CALL CENTER BIWEEKLY PAY",
        "author": "burntoutCC",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9bsyib/call_center_biweekly_pay/",
        "text": "First time poster. This may get deleted as I am not sure what the heck im doing, but im curious...\n\nDoes ANYWHERE pay WEEKLY anymore? This bi weekly crap is killing me. I work for a CC at a bank and im riding in my overdraft protection every pay period. This crap is for the birds. Denied food stamps because I make to much (That's a laugh)\n\nIts hard out here for a 24 year old and her son. 5 years call center bank experience.. Anybody have any suggestions?\n\nI'm subscribed to the tales from CC community, makes me feel better sometimes, but the mental anguish from thia hellacious job along with BEING BROKE AS HECK is slowly KILLING ME. ",
        "created_utc": 1535716474,
        "upvote_ratio": ""
    },
    {
        "title": "Send me new documents for my closed account!",
        "author": "Tangtastictwosome",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9br8fy/send_me_new_documents_for_my_closed_account/",
        "text": "Often in the electricity industry we get Third Parties or Brokers who are supposed to manage accounts on behalf of the customer, but often they are completely incompetent. This is one of those times. I will be Me and she will be Annoying Broker (AB)\n\nEmail from AB: Hi Ladies, I need a new electricity certificate for this account. The old one has expired! \n\nShe then calls in a few seconds later. AB expects a response instantly and will harass you if you don’t get back to her ASAP. \n\nMe: Hi Ab. This account closed in August, and it wasn’t in a contract when it left us, so we would not look send a new certificate. \n\nAB: But why is it closed? It’s not closed!\n\nMe: It is. As of August we are no longer the electricity supplier. \n\nAB: Who organised this? It should still be with you!\n\nMe: I wouldn’t know. (We don’t know. We just get a formal notification from another department that an account is leaving). You need to speak to your colleagues to find out.\n\nAB: Well I will ask! I still need that certificate you know.\n\nMe: As I said, the account isn’t active anymore. We can’t offer this service anymore. You’ll need to go to your new supplier to get an up to date certificate.\n\nAB: -huffs- Fine. I was not aware of any of this! \n\nThen some Broker you are! Not sure why the customer was paying you. \n\n",
        "created_utc": 1535696792,
        "upvote_ratio": ""
    },
    {
        "title": "Free Talk Friday - Aug 31",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9br4oo/free_talk_friday_aug_31/",
        "text": "Welcome to Free Talk Friday! We are suspending the usual 'tales only' rule within this thread (other rules still apply) meaning you guys can talk about whatever you like and let your hair down.\n\nP.S. If you want to have a rant about something, head over to /r/callcentres as you'll find the Weekly Rant &amp; Rage Thread has just been posted.\n",
        "created_utc": 1535695595,
        "upvote_ratio": ""
    },
    {
        "title": "Spanish Lessons from Mr Customer.",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9bq6ag/spanish_lessons_from_mr_customer/",
        "text": "I used to take inbounds call for an USA bank. Once a customer called because he was going to be in Costa Rica the following week and he wanted to be able to use his credit card there.\n\nMe: Yours truly\n\nC: Customer\n\n\\*I asked all the information I needed to locate his account\\*\n\nMe: You are going to be in Costa Rica from \\*this date\\* to \\*this date\\*. Is that correct sir?\n\nC: No\n\nMe: No? I apologize then sir, may you repeat me the dates please?\n\nC: The dates are correct, the country is wrong, I'm going to be in COSTA RICA.\n\n\\*I was confused because I just told him that, but I thought he may have misheard me or maybe we had a bad connection\\*\n\nMe: Yes sir, you are going to be in Costa Rica from...\n\nC: No, I'm going to be in COSTA RICA. Why do you pronounce it so weird? It's COSTA RICA.\n\nMe: I'm afraid I'm lost here.\n\n(I was seriously confused about what was going on)\n\nC: Here is an advice: If you are in America, learn english, or just go back to your country. You can't even pronounce Costa Rica, for fucks sake.\n\n\\*So:\n\n1. This guy thinks the words Costa Rica are in english.\n2. I'm a native spanish speaker, I know how to pronounce Costa Rica.\n3. He was giving me shit about \"Knowing english if I'm in America\\* but he was going to Costa Rica without the first clue that's spanish for \"Rich Coast\" (hypocrisy much?)\n4. I don't even live in America anyway. \\*\n\n​\n\nMe: if you feel more comfortable with a native english speaker I can get you one sir.\n\nC: Yes please.\n\n​",
        "created_utc": 1535685892,
        "upvote_ratio": ""
    },
    {
        "title": "\"Like a refugee\"",
        "author": "MissSommer",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9borv5/like_a_refugee/",
        "text": "Hey guys! On mobile, english not first language, etc\n\nI work roadside assistance and today I had a day full of nasty customers. Full on toddler-like meltdowns every other call for no reason (wasn't even a day where shit was late, we were on top of things).\n\nI'm gonna tell you about the call that made me speechless.\n\nMiddle aged lady is gonna be EA for entitled ass.\n\nMe - usual spiel\n\nEA - I've been waiting here for a cab for 3 hours, I demand to know how long do I still need to wait.\n\nMe - I'm sorry to hear about that, please hold while I take a look at this.\n\nSo I look at the notes. EA called at 18.15h asking for a towing service. We also always ask if the ocupants need transport back home (or whatever they want to go), the operator wrote on file that she said she had a ride from a family member and transport wasn't needed.\n\n EA called us again at 19.20h-ish asking for a cab. I see that we had some difficulty finding an available cab because it's summer in a touristy hot country and there's accidents and dead engines everywhere, but still.\n\n It's now 20.15h, so she actually has been waiting for only one hour since she asked for the cab. I see confirmation that the cab was sent, but she's also in an area full of traffic. I'm not gonna disturb the poor driver on its way for this. Also I see she's in a police station (she was towed from a bridge above a river and they took her there for safety), so she's not in the middle of the road - she's surrounded by cute guys in uniforms in a place where there's toilets, coffee machines, fucking machines to buy snacks and most probably nice cool AC!\n\n I get back to the call.\n\nMe - thank you for holding, Mrs EA, I confirmed  the taxi was sent and it should be there any minute -\n\nEA - I've been waiting for 3 hours!!this is not acceptable!! Where is my goddamn cab?\n\nMe - As I was saying, there's very heavy traffic in the area but I can assure you it's on its way and should be -\n\nEA -3 hours!! I've been waiting for 3 hours!!\n\nMe (using my firm 'talk-to-the-toddler' voice) - Actually when you called us asking for the towing service at 18.15h you said you had a ride, right? Then at 19h...\n\nEA (full on meltdown) - 3 goddamn hours!! Like a GODDAMN REFUGEE!!! Nobody should suffer like this!!!!\n\n So I pause. I don't know what to say to a middle aged, middle class white bitch who's comparing a 1 hour wait for a taxi back home to the suffering of a person fleeing a war zone. I just don't have any words. So I stay silent while she keeps venting. I still stay silent when she gets tired and shuts up.\n\nEA - Are you there? Are you listening to me?\n\n*long pause*\n\nMe - Mrs EA. Traffic is heavy. I assure you the cab is on its way. Is there anything else I can do for you?\n\nEA - I don't know why I pay for this service, to be treated like this, \n\nMe (interrupting in the most calm voice I can find) - Is there anything else I can do for you?\n\nEA - Do something! Talk to your company!! SEND HELICOPTERS!!\n\nMe - Mrs EA, if there's nothing else I can do for you I'm sorry but I'll have to disconnect this call. Have a good day. *click*\n\n It was a long day, guys. I love this job but today was just hard AF.\n\n\n\nEdit. Traffic, not traffick! \n\nEdit2. White previlege is a thing in a colonialist country that never had a war inside its borders in the 20th century and does welcome refugees from many different ethnicities, for those wondering why I mentioned that.",
        "created_utc": 1535673783,
        "upvote_ratio": ""
    },
    {
        "title": "When a customer calls to void their warranty",
        "author": "daanbrg",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9bjrns/unhappy_camper_a_true_story/",
        "text": "",
        "created_utc": 1535647153,
        "upvote_ratio": ""
    },
    {
        "title": "Siblings love",
        "author": "LadyNoir93",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9betx5/siblings_love/",
        "text": "I used to work taking inbound calls for a bank:\n\nMe: Yours truly\n\nC: Caller\n\nMe: Thank you for calling \\*Bank's name\\* this is LadyNoir93. May I have your first and last name please?\n\nC: Hi, I'm Caller. I'm calling because we just moved and I want to update our address.\n\n\\*I took her info and pulled up the account. I realized she was not the account holder, it was a man with the same last name\".\n\nMe: Excuse me Mrs Caller, in order to work in an account I need to have the account holder in the line. By any chance is he there with you?\n\nC: Not Mrs, Miss. I'm not married. And yeah he is here, but he cannot talk to you right now. He is my brother, why can't I update the address?\n\nMe: I apologize Miss Caller, for security reason we cannot work in the account unless we have the account holder on the line. If he is not there with you, you can always call us back later and...\n\nC: He is here with me, but he cannot talk to you because I'm masturbating him right now. Why can't I do it?\n\nMe \\*With a fake calm voice\\*: I'm sorry Miss Caller, for the inconvenience. You can give us a call later with the account holder on the line. And we'll be happy to assist you. Have a nice day.",
        "created_utc": 1535588732,
        "upvote_ratio": ""
    },
    {
        "title": "“But sir, I am technical support”",
        "author": "weneedthebitter",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9bcl02/but_sir_i_am_technical_support/",
        "text": "A user called in today about a pretty common issue with files not pulling into our website once they attempt to send them over to it. Now, this person had already emailed in regarding the issue, and I myself had advised them to call in, because I knew we’d need to remote in to fix the problem. \n\n(We’re an inbound call center and try limiting outbound calls as much as possible unless it is a special internal request, and because usually the customers never answer when we try calling them.)\n\nAnyways, since we aren’t a very large center either, rather a dept at our company HQ, I often handle chats and emails, along with calls. So getting a call in and then an email from the same user, or someone who chats in and sends an email as well, is something I see often. \n\nWe also handle everything from technical issues to education issues on how to properly use the programs, so most of us reps are cross-trained in 10+ applications and can use them fluently for the most part. \n\nMe: “Customer Support this is X.”\n\nUser: “Hi, I was emailing your support team and they told me I needed to call in so you need to get me over to technical support because you probably can’t help me.”\n\nMe: “Hi were you emailing in about files not coming to the website like they were supposed to?”\n\nUser: “Yes I was, can you get me over to the team who can fix this for me?”\n\nMe: “Sir, I am the technical support and I’ll be glad to fix this for you!”\n\n\n\nThe user was a little quiet for a moment when he realized that I could indeed help him, but he was then pleasant for the rest of the call and had one of the easiest issues I’ve had to fix in awhile. \n\nGirl power, I guess?\n\n*edit*\n\nUser assumed I couldn’t help because I was a female, even though I corresponded via email with him and told him to call in so we could resolve the issue for him by remoting in, since we couldn’t walk him through it via email. ",
        "created_utc": 1535572126,
        "upvote_ratio": ""
    },
    {
        "title": "Well, I certainly screwed up.",
        "author": "Reptilian_Nastyboy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/9b2ylx/well_i_certainly_screwed_up/",
        "text": "I just had a most unpleasant interaction with a customer. As I've said before, I work in a call center for an auto manufacturer. Right now I'm in a department geared toward helping customers schedule appointments for a specific safety recall at their local dealerships. Due to the nature of the department, angry customers are rare. We get the call, schedule an appointment, and that's that.\n\nToday I got a call from a customer who not only had this recall to complete, but also had an issue with the seat cushions on her car. Apparently the cushions were decayed, and she had been expecting a call back from a different department for assistance. No one had ever called her back, so she was already pissed when I got on the phone with her, and she had one of the whiniest, most grating entitled soccer mom voices I've ever heard. I didn't have jurisdiction to do anything about the cushions, I told her, but could go ahead and call her local dealership to schedule an appointment for the recall.\n\nI got the customer on the line with a dealer representative. The customer was horrible to her, belittling and screaming at her every time she was asked to repeat something the representative did not hear clearly due to poor call quality. When the representative asked the customer to confirm which recall needed to be completed, the customer yelled at her, \"I don't know! You guys are supposed to know that already!\" I could tell the rep was getting anxious and I felt bad for subjecting her to this curmudgeonly bitch.\n\nFinally the customer started to calm down a little as the rep prepared to finalize the appointment. Then the three of us realized something -- I had connected the customer with the wrong dealership. See, we use a dealer locator that automatically pulls up the nearest dealer to the customer's zip code. However, there's a glitch in the system where it will sometimes automatically populate the last zip code you searched. So I had put the customer, who lives in California, through to a dealership in Florida.\n\nWhen the realization hit me, all I could think was \"Oh, shit.\"\n\nThe representative, who was fed up with being screamed at by this woman, dipped out of the call as soon as she could. I apologized profusely to the customer and attempted to explain my mistake. She wouldn't accept my apology and continued to press me about the issue with her seats. I informed her that steps had already been taken by the correct department to address this concern, but she didn't care. She wanted someone to do something about it now. I reminded her that my department could not address any issue other than the recall. She simply said \"I don't care,\" and demanded that I patch her through to someone. All I could tell her was that I couldn't, and that she would have to wait for a brand ambassador to call back.\n\nI apologized again about the mixup and gave the customer the number to the correct dealership. She admonished me for making her go through all that for nothing and hung up on me. And again, I fully admit that it was my bad. I should've checked to make sure I was calling the right dealership. But I promise you, this woman had already lost it. My fuckup was just the final nail in my own coffin.\n\nAnd I have to call her back tomorrow to see if the brand ambassador ever called back about the seats. Wish me luck.",
        "created_utc": 1535491419,
        "upvote_ratio": ""
    }
]