[
    {
        "title": "A lady got mad because I wouldn't allow her to commit fraud",
        "author": "foolishpheasant",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6tqniw/a_lady_got_mad_because_i_wouldnt_allow_her_to/",
        "text": "I'm a bank teller, and usually things go pretty well with customers. I've worked a wide array of customer service jobs, from Walmart to a movie theater to taking sales calls for HSN. Working at a bank is probably the best so far, because people are less likely to be jerks to you when it comes to their money. Usually.\n\nThis past Saturday, I had a lady write a check from her business account. She wrote the check right in front of me. When I took it from her to cash then deposit it, as she requested so they'd get the funds right away, I glanced at it and felt my heart sink. She was already back from a previous transaction which wasn't done the way she wanted, so I knew she was the type that was going to be snotty about any little thing that didn't go her way.\n\nThe check was made out to her business's co-owner, a guy, and... she had signed the back. In his name.\n\nWhen I refused to take it, and gave her another option that would have saved her from writing/wasting another check, she got huffy and said it *had* to be written to the guy for business reasons. Okay, so, he has to sign it. Otherwise it's fraud. Even if he approves, if it's not his signature, he could come back later and say he didn't sign it and I'm the one on the hook. Regardless, it's fraud, and I'm not doing it.\n\nMad now, the lady \"threateningly\" said she could go get him, but he wouldn't be happy. I just gave her my best customer service smile and said, \"Okay!\" and turned around to go back to my station until I could actually help her.\n\nThe funny thing is, the guy didn't seem phased when they came back in. He signed the check, I did their transaction, and that was it. Except the lady paused before leaving, staring at me like she expected an apology. Again with the stupid, fake grin, I thanked her, and walked away.",
        "created_utc": 1502756329,
        "upvote_ratio": ""
    },
    {
        "title": "When my coworker went bananas Part II",
        "author": "mrselephantine",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6t9yhw/when_my_coworker_went_bananas_part_ii/",
        "text": "After all what happened with Johnny in the last post we were sure that he wouldn´t come back. We were so wrong.\n\nHR was calling Johnny's celphone all the time, he needed to know if he was thinking of coming back. After a couple of weeks someone pick up the celphone, but it was not Johnny, it was his BIL.\n\nHR: Hello, Johnny? Are you there?\n\nJBIL: Who's this?\n\nHR: It's HRname of Johny's work, is he there?\n\nJBIL: He is ... unfit, he will call you later..\n\nHR: Unfit? Is he ok?\n\nJBIL: You better talk to Johnny's wife.\n\nAccording to HR, wife explained all:\n\nJohnny was fired of his previous job because he started to neglect his job, he started to hiting of some female coworkers by phone and when they filed a complain he started to calling her names. After Johny runaway from my boyfriend he started to pick up fights with randoms dudes, he pick one with the wrong person and spent the night in jail.\n\nWife and BIL helped him, but he was acting very erratic, he was being abusive with his wife (he had never been) and she called his family for help. They called an ambulance and the police again. Somebody started to tell the wife that maybe Johnny needed some therapy, his behavior was all bananas. That moment is went wife told the truth, Johnny was bipolar, but he didn't wanted to be treated. Nobody knew this, his family were in shock. She said that this was the reason that cost him two jobs and now their marriage. She didn't know what to do.\n\nHis family helped them, he went to therapy and treated himself. \nHR told the wife what happened (Johnny didn't tell her the truth, just some random lie) and told her that he was happy that Johnny was being treated but he was unfit to work right now, so he was fired, but they will give him a recommendation letter and a cash bonus. She was ok with that.\n\nThe owner of the company blamed HR because with the little time that he had he didn´t make psycometric test on Johnny (A rule of the company), so they didn't know neither about the bipolarity.\n\nA couple months past, and my boss comes all pale to my workstation.\n\nMy boss: Johnny it's outside, he says that he needs his access card..........\n\nMe: what?\n\nMy boss: He thinks that he stills work here...He is even wearing the uniform.\n\nMe: What should we do? \n\nMy boss: HR told me that Johnny called him yesterday at midnight all excited for returning to work...\n\nHR had to talk to him in private because he was starting to scream to the acces guard.\n\nHR: Hi Johnny, What happened? what do you need?\n\nJohnny: The guard doesn't let me pass, I need to go to my workstation, Elephantine will be mad..\n\nHR: Johnny you don't work here anymore, I talked to your wife, you signed, do you remember?.....What about your treatment?\n\nJohnny: I had to quit it, the medicine was to strong, I couldn't take it anymore (he was getting angry).\n\nHR: Johnny im sorry I can't...\n\nJohnny: Listen it's ok, I forgive you guys, you were mean to me but it's ok, I'm willing to forgive all of you. \n\nHR: (In disbelieve)......I......I can't give you your job back.\n\nJohnny was trowing a tantrum again about how HR was unfair, how it was all my fault, how he was ok and how we couldn't see it. All this was very unsettling and sad.\n\nThe access guard escorted him out of the company property.\n\nAnd that was the sad end of Johnny.\n\n\n\n",
        "created_utc": 1502561415,
        "upvote_ratio": ""
    },
    {
        "title": "When my coworker went bananas",
        "author": "mrselephantine",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6t9hls/when_my_coworker_went_bananas/",
        "text": "Hi Reddit,\nThis happened some time ago, but it has been one of the craziest experiences I have had in my working life.\n\nSome Background: This happened three years ago, in my job of back then, the field of that company is not very comun in my country. My husband (then boyfriend) and I met at work.\n\nSo I was in my mid twenties, have been in the company almost three years, my job was very stressful and demanding. I had always a ton of work and was underpaid. So after the last refusal I had about a raise, I decided to quit with a two week of notice. I started to look for another job and received some offers, so I had in mind that after the two weeks of my remaining work I will take a week of vacation and then start in a new job. \n\nMy boss (F40s)did not take my resignation very well, but began to push the dude of human resources to find an adequate replacement. She wanted a person like me (her words): woman, young, college degree and with experience in our field. HR with the little time he had find: a man in his late 30s without a degree with little experience on our field. They hired him. We will call him Johnny.\n\nThey brought Johnny with me so that I could train him to fill my position. I could see that Jhonny was introverted and not very quick learning. The last day of work, my boss calls me to her office, she starts to say that she does not want me to leave the company, and she gives me a sheet with a new job offer, the offer came a very significant increase in salary, a scholarship for my masters, schedule facilities and an assistant ... Johnny. I was in shock, I asked for some time to think about it, but in the end I said yes, I will take my vacation and then I will come back to the company. \n\nWhen I return to the company I see that Johnny has changed, now is more extroverted, has been able to make several friends, has dominated his work more and he is really kind to me, I mean after all now I was his boss. Three months past and I learn more things about him, apparently he was a very religious person (Im not), he had a very bad economic situation, he had been months without work, he was married but the marriage was not very good, they were trying to keep together for their children.\n\n\nOne day I notice a couple more things: Johnny has lowered his productivity a lot in the last two weeks, he has been texting a lot on his cell phone and he has been making inappropriate comments to Betty (F20s) the assistant of my boss. Betty was really incomfortable, and was planing talk to HR about it. \n\nI talk to Johnny about it and he just tells me that it's not thrue he is doing his job but I need to relax and been more chill....wtf. I just tell him to do his job without any excuse and then I leave to my masters class. \n\n\nThe next day my boss calls me at her office. And the conversation went like this:\n\nMy boss: Elephantine, is everything ok between you and Johnny?\n\nme: yes, I mean we talked yesterday about his productivity but I think he got it.\n\nMB: well, he came here yesterday and told me that he is submiting a complaint against you..\n\nMe: what??..\n\nMB: apparently he says you threat him poorly, that you yell at him and asks him to work extra time.\n\nMe: that bullshit. I do not threat people like that, you know me.\n\nMB: yes, thats why I don't believe him, he talked to Benny (vice president of the company) too and Benny called me. What is going on? \n\nIn that moment Johnny enters to the office, he was surprised that I was sitting there. He went pale.\n\nMB: Johnny, sit down please. We are talking about what you tell me yesterday. And there are some inconsistencies...\n\nJohnny: (very nervous) What do you mean we didn't talk about nothing....\n\nMB: You came here telling me that Elephantine shouldn't  be your boss, because she is a woman, a younger woman. \n\nMe: (Completly angry) what?¡ Because Im a woman I can't be your boss¡¡ Im more experienced in this than you¡¡. You don't know even how to use the computer programs right (now I was screaming). That's why you came here yesterday saying bullshit behind my back?¡ \n\nJohnny: No¡¡ I mean she is lying (point towards my boss) she is jealous of our friendship Elephantine, you have to believe me. She doesn't like a man in her team. (We had another three mens in the team)\n\nMy boss: Are you calling me a liar?. You came here yesterday and said that to me. What are you trying to do Johnny?\n\nJohnny: (In ugly man crying) Im sorry, Im just trying my best and now Elephantine will never thrust me again. I ruined everything. \n\nMe: (In disbelieve) I'm not buying it... (He stops inmediatly the crying and stands up)\n\nJohnny: We need to hug, that way you will forgive me. \n\nI do not stand up, so he graves my hand and tries to pull me, I just don't move.\n\nMe: I'm not a hugger, and I do not forgive you. (To my boss)I don't want to work with him, if that means that I will work alone again I'm ok with that, if you want put him in another department it's your call. \n\nJohnny is just angry, I refused his friendship offer. My boss agrees with me. And he just goes to \"smoke a cigar\" he didn't smoke, but ok.\n\nWhile my boss and I are sitting there thinking what the hell was that. Johnny went to smoke, there he finds Betty. He proceeds to bitch about me and my boss, that we are cunts to him, how we need a real man to tell us our place, etc. Then he tried to grab Betty's ass, and said her that she had such a great ass, that she needed some love and perv stuff like that, Betty just ran. Did I mention that Betty and I are best friends in the office?? She told my boss and I everything.\n\nMy boss, Betty and I filed a complain to HR against Johnny, and he said that Johnny will be suspended three days without pay and when he came back he will be in another department. \n\nHR bring Johnny to talk to him, this was a 180° degree change in his conduct and he wanted to know why:\n\nHR: Johnny, I don't understand, what happened? you were doing a good job...\n\nJohnny: I'm a good man you know? I'm a very religious man, a man of God. \n\nHR: I know, that is why I can´t..\n\nJohnny: Elephantine is not very religious type...\n\nHR:.....\n\nJohnny: She has a better car than I, a better relationship with his partner, better job, and you guys are paying her much better than me and even a scholarship¡¡....fuck¡¡ \n\nHR: She has a been while in this company, you are new, if you are persistent...\n\nJohnny: You just don't care about me, you don't care shit¡¡ I was going to have her job and you just throw me aside and put me in a secretary position. (He was not a secretary, but because his boss was female he was feeling emasculated). She just abuse man, she is a cunt to \"Boyfriendname\"..\n\nJohnny continued thowing a tantrum for another 20 mins, trashing me. Until HR got tired and told him to go home. \n\nLater my boyfriend told me that Johnny followed to the bus stop looking for fight, my boyfriend it's a big dude (I like them big) and Johnny was kinda petite:\n\nJohnny: You should control your woman¡¡ she is beeing a real bitch\n\nBF: (Pushing him easily) You call her like that one more time... (pushing him again) \n\nAt this point Johnny just runaway.\n\nThe days that he was suspended past by and he didn´t came back to work, we hoped that he would never come back...but no, Johnny would return.\n\nPart 2\n\n\nhttps://www.reddit.com/r/talesfromthejob/comments/6t9yhw/when_my_coworker_went_bananas_part_ii/\n\n",
        "created_utc": 1502556494,
        "upvote_ratio": ""
    },
    {
        "title": "Certifiable coworker.",
        "author": "metooeither",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6szhgq/certifiable_coworker/",
        "text": "I work at a general goods store, and a coworker is certifiably insane. She constantly needs validation, because none of her ideas are her own- she imitates everyone. If I fall down skateboarding &amp; call in sick from the ER with a broken wrist, she’ll tell people “I think I’m coming down with what metooeither has!” A supervisor has cancer. Yup. Suddenly ‘Jennifer’ is posting on social media “My stomach hurts, I bet it’s cancer. Pray for me, I’m going to Urgent Care. *weeping emoticon*”. Someone was fired recently for exposing himself to customers. Suddenly Jennifer is dressing sluttier and moving in such a way that her shirt keeps exposing her. \n\nWe all ignore her, because although she’s in her 40’s, she has the mentality of a 13 YO. She follows us around while we are working, and if we don’t drop what we are doing to talk to her, she’ll yell at us from across the store later in that shift. \n\nShe’s also racist. She learned the hard way not to complain about certain minority groups openly when one of our coworkers told her “my husband, who is that race would disagree with you”. \n \nNepotism got her the position, so we have to pretend we like her, and that we are riveted by her drama- or else “we all hate her” or “we are out to get her”. We have to cater to her, take her litters of puppies, buy her multi level marketing crap, all but bring her her dry cleaning or it’ll show up on our next review that we ‘don’t get along with our co workers.’  \n\nPunch line. She claims she’s shy and has too much anxiety to interact with anyone of us, yet she can complain about even made up infractions when she feels she isn’t getting enough attention.\n",
        "created_utc": 1502434542,
        "upvote_ratio": ""
    },
    {
        "title": "APOPLEPTIC!",
        "author": "aqutalion",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6syxft/apopleptic/",
        "text": "I haven't had the brain bandwidth to write up the next Closed Area Tales thing, due to the impending (I hope) end of grad school, so here's a tidbit.\n\nFor a short time before I left Wasteland (check the previous posts I've submitted here for background), I was moved to a different part of the project, and as a result, ended up transferred to an office outside the closed area. This was a cubicle in a largish room, with actual closed offices off to the side. The people in these offices usually kept their doors open.\n\nOn the one hand, I could go pee after 5 o'clock without having to bother with the lab's combination lock, and the wonky lab door was no longer my problem. On the other, the office dwellers were also overly fond of their speakerphones. *Even when they were talking to each other!* Often, I'd hear both sides of conversation, with an echo from both due to the speakerphone. Seriously, guys, you're twenty feet from each other. Get up and walk.\n\nBut, this also meant you could hear lots of interesting gossip. One guy in particular had an especially loud voice, and once I was privy to a heated conversation he had with someone in another office. They were having some argument over a policy decision, and he was apoplectic. **A-PO-PLEP-TIC!**\n\n'Cuz he'd been doing this for **eleventy-bajillion years** and knows this contract **better than anyone** and don't ask him for any help after this! Just **don't!** Because he'll go all **apopleptic** on your ass, and he won't even help you! He doesn't need this! He knows **better!** You're on your own after this! He's **apoplectic** about this, you hear?\n\nBut of course, that wasn't the end of it. A couple of hours later, I got to listen to him again, making several phonecalls apologizing about getting apopleptic.\t",
        "created_utc": 1502426547,
        "upvote_ratio": ""
    },
    {
        "title": "Hey, I need you to train your manager.",
        "author": "palaverhound",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6sypo2/hey_i_need_you_to_train_your_manager/",
        "text": "This didn't happen to me, but to my coworker. \n\nI work at an animal hospital. The management is inept on the best of days. My friend is the receptionist; she's been there about six months and works just as well, if not better than the veterans who have been there 30 years. \n\nRecently she had been promised a pay raise with the job promotion of Reception Supervisor. Her manager said, just wait. I gotta get it okayed with my dad. \n\nHis dad is the boss. \n\nA woman comes in who's a client. Also friend with the boss. People say she's a slut. I'm not sure if the rumors are true. Let's call her Molly. Molly worms her way in to getting a job. Boss man thinks. Good. I'll hire her. \n\nBoss's son knows how much Daddy likes this woman. So he says she's going to be Reception Supervisor. \"They need someone from outside to make changes. Business 101.\" \n\nBoss's son tells my friend she's going to be training Molly. Friend asks if Molly is going to be manager. He says no. \n\nMolly isn't a very good worker by the way.  Boss has since confirmed that she's getting trained as a manager. My friend also has not received a raise. \n\nI hate this place. If there weren't animals inside I'd wish for it to fucking burn.",
        "created_utc": 1502423841,
        "upvote_ratio": ""
    },
    {
        "title": "How do I work this flag?",
        "author": "BrogerBramjet",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6smshu/how_do_i_work_this_flag/",
        "text": "It's County Fair time again and most of my family is working there again.  Dad is running Parking.  If you're over 15, you get hired, so standards are otherwise slim.  This year he has to teach how to do the job.\n\nVisitors park their own cars, so there are workers to direct them to the open rows.  The workers are given an orange plastic flag on a stick.  You wave towards the parking-  simple right?\n\n  One girl was seen waving her flag in a circle above her head.  Another held it by the end of the flag.  One complained how hard the work was and wondered when their break was- 20 minutes into her shift.\n\nThe boys aren't any better.  One has been bruised because he was throwing it in the air to catch it during slow times.  He missed.  Another refused to let the car with handicapped plates park in the handicapped spots.  Why? He'd only ever seen the permits that hang from the mirror and didn't think the plates were legit.\n\n  Might I add, these happened in the first TWO days.  5 to go.",
        "created_utc": 1502297591,
        "upvote_ratio": ""
    },
    {
        "title": "My boss loudly said that my shoes were \"really gay\" at a company meeting",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6saplp/my_boss_loudly_said_that_my_shoes_were_really_gay/",
        "text": "[deleted]",
        "created_utc": 1502161079,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the funniest/most unbelievable stories from part-time work you have had?",
        "author": "gilesbidder",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6s75fg/what_are_some_of_the_funniestmost_unbelievable/",
        "text": "",
        "created_utc": 1502127403,
        "upvote_ratio": ""
    },
    {
        "title": "\"Just because I said I was going to put a stop payment on it, doesn't mean I'm actually going to do it.\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6s6ecm/just_because_i_said_i_was_going_to_put_a_stop/",
        "text": "[deleted]",
        "created_utc": 1502121032,
        "upvote_ratio": ""
    },
    {
        "title": "Don't like being told you can't cut the line? Complain until you get a pass that lets you!",
        "author": "woodperson",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6ryxec/dont_like_being_told_you_cant_cut_the_line/",
        "text": "I work at an amusement park where I run one of the roller coasters. Yesterday was rainy and cold, which usually means the park will be dead. However, it was also a Saturday so the park was fuller than I've ever seen it. More guests means more crazy people, of course.\n\nHalfway through the day, my coworker sees two little girls cut about twenty minutes worth of line. When they get into our station, she tells them that they cannot cut the line and will not be permitted to ride. They don't move or show any sign that they heard her. When they get to the front of the line, my coworker says that they have to cross through the train to the exit because they cut the line and she told them before that they couldn't ride. \n\nThe girls didn't actually say anything the whole time, but their mom went off on my coworker. She was furious that her daughters couldn't just cut a ton of people in line. Her reasoning was that the line was so ridiculously long that they had to go to the bathroom so they got out of line. \n\nOur line was about an hour long for most of yesterday. Lots of people came up to the front having to go to the bathroom and we would let them go and come back up the exit because that is way easier than having to clean up pee (or poop, as we had to do last night). Even more people leave the line and come back at the end. I'm assuming the majority go before they get in line. \n\nThis lady, as all angry people seem to, wanted to speak to someone higher up. So my team leader came to talk to her. After a few minutes of being told that her daughters couldn't cut the line, she wanted someone even higher up. My supervisor happened to be coming up to check our evening paperwork so we had her talk to the angry guest. My supervisor told her that it was our job to enforce park and ride policies and that we did nothing wrong. We couldn't run the next cycle until they were outside the exit, so they went and talked out there for a long time before walking off somewhere together. We were fools to think it was over. \n\nAn hour later she shows up at our exit with an exit pass. Exit passes let you go to the exit of a ride and skip the line entirely. One use only. There's a few ways to get them, but you can always tell where a guest got one from the signature on it and gets came from high on the park totem pole. She got rewarded because her kids cut the line. \n\nWhen a guest has one of these, we have to take it and give it to our supervisor at the end of the night. \nThis is so guests don't reuse them, don't try to reproduce them, and so we know how many are given out each day and where they are used. \n\nWhen she comes up I ask how many are in her group and where they want to sit. She tells me and I take the pass. She asks if she's getting it back and I tell her I have to take it to the operator booth. She asks if she gets it back after and I say no, it's one use only. She gets mad and says she can use it as many times as she wants. I show her on the pass the places where it says one use only, but she's insistent that she was told she could use it as many times as she wants. \n\nThe operator called our supervisor who said it was indeed one use only and we relayed that to her. She demanded a supervisor so we called for one. When he showed up he talked to her for a while, made a long phone call, and told her what we did. She eventually left and didn't come back. After all that I asked if I could put in another two weeks notice because I really felt like I needed to quit twice. ",
        "created_utc": 1502033160,
        "upvote_ratio": ""
    },
    {
        "title": "Watch costume drama movies for free - 1 Movies Website",
        "author": "raelenessgeidne",
        "url": "https://1movies.online/genre/Psychological",
        "text": "",
        "created_utc": 1501964786,
        "upvote_ratio": ""
    },
    {
        "title": "Smartest Human Seeks Job",
        "author": "yuno44907",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6rkbjv/smartest_human_seeks_job/",
        "text": "[removed]",
        "created_utc": 1501851793,
        "upvote_ratio": ""
    },
    {
        "title": "How a small action can change the whole company's spirit",
        "author": "talesofnyanko",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6rchol/how_a_small_action_can_change_the_whole_companys/",
        "text": "I actually don't know where to start with all the stories we already experienced. But i will start with the first one, when everything started to turn. \nFirst a little background information:\n-You should know, that we are a small company with around 40 people working. we have 5 team leaders (they don't have a special degree or education, they just got selected from our PR Manager(she also don't have a degree in leading people) So we are a typical small family business.\n-We are an online shop and we do all our shipping at our office. So when we have a big shipment to make, all our people from marketing, accounting etc.. are helping with packing. That means that someday we will stay late at the office. Back in the good days, management offered us pizza and drinks for our help and our late night work. But that was a long time ago. \nSo now to our story: \nSo everyone is working ones butt of to help during this tough 4 months. Everyone is working overtime and if they need help with shipping we stand in our warehouse within minutes. Mostly we have to give credits to our guy in the support division; he does his work alone and is always the first to help. \nAt our company dinner. Everyone is glad that the hard time is over. Our Management is holding a speech how much sales we had etc. And at the end of this speech our personal manager stands up, and says she wants to thank a few people: and these are our Team leaders, they are doing so much work, and without them it wouldn't be possible to have reached this good year. something along these lines. She gave them chocolate  and drowned them basically in praise. So every other employee was sitting there staring at each other and clapping awkwardly...\nWe all know that they helped too, but they never really stood out with what they were doing. And they already got awarded with a big fat bonus. and it's not that we didn't know that. So everyone spirit was crushed. It's not that we expected something, not even praise. We were happy with our pizza and the beer they offered. If she just didn't say anything... \nAfter that dinner, the attitude from my coworker changed from we are happy to be here and our hard work is appreciated to fuck that job why are we even trying so hard. \n\nI know it was a small action but it changed the whole company. ",
        "created_utc": 1501769040,
        "upvote_ratio": ""
    },
    {
        "title": "Please discriminate against me!",
        "author": "its_bill",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6r8ktz/please_discriminate_against_me/",
        "text": "I had an employee come to me one day and explain that she had an urgent medical issue and needed to leave work to go to a doctor's appointment. This was no big deal -- it happens all the time, and the answer was always yes. However, this employee had plenty of history being batshit crazy, so I pulled in another manager to witness the conversation.\n\nShe made her request with both of us in the room, and I immediately said yes and asked her to just let me know on the way out the door for staffing purposes. She then asked if she would be punished or fired for going to the appointment, and of course the answer was no. Seemingly satisfied, she said she would leave a couple hours early and promised to let me know on the way out the door.\n\nI sent her a quick email summarizing the conversation (she's welcome to leave early today for an appointment, the company values her health above all else, etc etc).\n\nI then walked out of the room and hear her burst into tears in front of the entire office and scream \"They said they would fire me if I went to the doctor today, but I might die if I don't!\" She repeated this loudly several times as she cried at her desk for half an hour, then dramatically stood up, peeled off her fake lashes, looked at me and said \"See, now you've made me ruin my lashes!\" as she threw them in the trash and stomped back to her desk.\n\nShe even had the guts to complain to my boss about the \"discrimination\" she had suffered at my hands. My boss was more than a little confused when I brought in the witness and showed her the paper trail.\n\nI wasn't sad a month later when that employee quit with virtually no notice. None of her coworkers seemed to miss her either, oddly enough.",
        "created_utc": 1501719374,
        "upvote_ratio": ""
    },
    {
        "title": "Past Coworker",
        "author": "slimskinny22",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6qjau0/past_coworker/",
        "text": "No new stories from janitoring, instead I was reminded of an old coworker from my old job. I worked at my college's fieldhouse, where I had worked my way up the ladder and was essentially assistant manager during the school year and manager during the summer (boss is women's basketball coach so he was busy with recruiting and setting up camps, as well as relaxing so he turned the building over to me). My last two summers I had a coworker we'll call R. R was a sorority girl who last summer lived with a few of her sisters in a house near campus. These are a few stories from working with her. \n \n*One night I received a text from her asking if we could switch shifts and I could come in at 8 so she could sleep off her hangover. I said yes only because it was 1 in the morning and I wasn't sure who would answer their phone to cover for her. I tell her this is the last time and she says \"well I thought we were friends and could do this sort of thing but whatever, thanks.\" No, you cannot take advantage of me like that each time you decide to go drinking. \n \n*We host a large Christian conference for high schoolers each summer, and are asked to unlock the doors before each show to help out. They have workers stand by the doors and check wristbands (1000 students and parents show up for each week it happens, they check to make sure everyone's a part of the conference), so they cannot be expected to open the doors, hold them, and be able to check everyone in at the same time and catch everyone. I'm out getting groceries and receive a call and a text from two different people informing me that the doors weren't unlocked and the conference people were mad. I tell them I'm on it, and when I get to work and ask what happened she said she heard kids so she went to check and asked how they got in. They said the doors were unlocked so she went back to the desk without checking. Then she proceeded to get mad when I said I had to let our boss know because he was most likely going to receive a call about it. \n \n*She told me once she needed to leave at 4 for a Dr's appointment, then told the guy she was working with that I gave her the OK to leave at 3. She left at 2:30.\n \n*She would ask for a sub two hours before needing to leave because a sorority sister was spending her last night in town and they were having a party for her. The schedule was set in April, you know when you work. We all made the decision to never help her when we got that text. \n \nThis girl currently is helping to do my old job (my best friend is the other person doing that job, so I hear a lot from her about R). Lord help her coworkers this summer. ",
        "created_utc": 1501442823,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes you decide to really try, and the customer still gets screwed",
        "author": "desultorysock",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6qdxdy/sometimes_you_decide_to_really_try_and_the/",
        "text": "This just happened today. I work at a dealership in the service department as a service advisor. I had a customer having engine troubles. He was from out of town, as many of our customers are since we are in the middle of nowhere, so we had ordered parts for him ahead of time, suspecting (correctly) what his issue was.\n\nThe problem was not with this particular customer - he was swell, very understanding; perhaps more so than I would've been in the same situation. The part that we had ordered was an aftermarket piece, which usually works fine, but occasionally you run into hiccups that are out of our control. This was the case today.\n\nNo matter how hard my technician tried, this part would not fit. He tried for *hours*, and as a flat rate technician, he tried well past when he could've given up, even though it'll ~~likely~~ definitely hurt his pay. We ended up needing to order the part from the OEM manufacturer, but that means it takes at least two days to get here - further slowed down by the weekend. This customer is from approximately six hours away; he came in for business, and then his vehicle started acting up. He's stuck here.\n\nI immediately went into apology-mode. I explained as openly and honestly as I could what had happened with the part, the technician came and showed him the piece, and I involved the only manager on duty today, who also happened to be high up the food chain.\n\nMy manager spoke with the customer, and mentioned perhaps an arrangement for a rental car or a fix on the bill. The customer was a little disappointed with his vehicle, but facing hotel and food costs, he wanted to follow up with the manager on his offer. I took him back to see the manager, hoping we could find something to make him happy.\n\nComing back to my manager, he now said that car troubles are a risk of owning a car, and that they have no control over defects in parts or discrepancies between manufacturers (which is true). However, just ten minutes prior, I had a lot more hope we'd be able to even minutely help this customer - even a free rental car would allow him to drive home and come back when his car was ready, for much cheaper than a hotel. I thought that was the least we could do, but since it wasn't my decision, I let my manager disappoint my customer.\n\nI foresaw trouble today and prepared accordingly, and met with a wonderful customer who, in the face of trouble, was very tolerant and never rude. I apologized again and again, and blatantly told him I thought my manager intended to do more but it was above my pay grade, and he said he understood and he would come back when the vehicle was ready.\n\nIt was just so embarrassing, on our company's part, in my opinion. I shared a similar story with one of my coworkers, who likewise had an older customer once, from out of town, who didn't have much money to come in and go home and come back again. My coworker even offered to help pay for the customer's rental car, but he was told not to.\n\nIn my years of customer service, I would say 99% of my time is spent between miserable people and problem-free people. This was the first time I experienced this sort of problem, and it was absolutely heartbreaking to imagine myself in the same predicament.\n\nMy coworker and I are both in our 20s, and we're some of the youngest of the crew here. I'm beginning to wonder if this demonstrates a little bit of the paradigm shift in society today about customer service. In all honesty, I view this customer as a potential for coming back as any, since most of our customers don't live here. If he travels for work, maybe he'd think of us next time he's through for an oil change, even? Considering we'd have to write off literally hours of pay for the technician anyway, the rental car would cost barely anything in comparison for a couple days. The customer would still be paying for fuel.\n\nPutting an end to the lengthy rant, but... Just disappointed in my management today. I really wanted to help the customer.",
        "created_utc": 1501367858,
        "upvote_ratio": ""
    },
    {
        "title": "No wonder she divorced you.",
        "author": "watchmewoge",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6qamtd/no_wonder_she_divorced_you/",
        "text": "Hello folks,\nI work in a call center for a utility company who i am cross trained to take payments, set up arrangements and move your name to another location.\n\nLet's get on with it!\nI'll be me, struggling mom will be AM and JEH: jerk ex husband.\n\nSo i receive a call today:\n\nMe: thank you for calling [company name]  my name is WatchMeWoge. How can I help you? \n\nSM: Hello darling!, i need to get my services restored can you help me?\n\nMe: of course! I need your account number, as well as last 4 of SSN.\n\nSM: okay sweetie, its xxxxx-xxxxx and xXxX\n\nMe: Okay thank you. You owe $xxx.xx to restore with 6 installments of xx.xx plus your current bill. \n\nSM: I also need to transfer it to my name as well were divorcing.\n\nMe: Okay there is still a balance however it will be his responsibility to call us and arrange that remaining amount.\n\nSM: okay i will let him know.\n\n- call drops-\n\nShittttt.....i have to call back.\n\n[Dials number on acct] and i get a voicemail response\n\nIm sorry the person you are calling cannot answer the phone right now.\n\nMe: 😐 great.\n\n[Dials other number] \n\nJEH: Hello?\n\nMe: HI! I'm looking for SM can i speak with her or do you have a number for her? This is  WatchMeWoge from [company name].\n\nJEH: dont ever fucking call here again -click-\n\nMe: ...lol...this dude.\n\n-redials number-\n\nJEH: are you fucking retarded didn't i say never to call ba-\n\nMe: SIR. YOUR KIDS DONT HAVE ELECTRICITY RIGHT NOW. I DON'T CARE THAT YOU DON'T WANT ME TO CALL BECAUSE I'M NOT HERE TO TALK TO YOU.  I'M HERE TO TALK TO YOUR EX WIFE SO THEY CAN HAVE POWER. \n\nJEH: I don't care.\n\nMe: its obvious, thats fine you actually owe us the remaining balance on the account so please contact us later to resolve that.\n\n-hangs up-\n\nNo wonder she divorced you. Asshole.\n\nAnyways I did get to speak with her again through the queue which is awesome because i really wanted to help her ☺ we got her services moved to her name and everything she got off Scott free no deposit and he owes us alot of money but karma was served. \n",
        "created_utc": 1501330089,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Night MOD",
        "author": "slimskinny22",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6q8hsc/friday_night_mod/",
        "text": "Guys, you'll never believe it. One of the MODs at my work has a spine!!! \n \nThe past five or so of my shifts (probably few weeks, wouldn't be surprised if this happens on my days off), the last person to leave is always the same. He starts showering five minutes before we close, and begins putting his clothes on five minutes after we close. He meticulously puts on each piece of clothing and usually leaves around 15-20 after.\n \nTonight he does the same thing. It's about 15 after, and as he's beginning to walk out the MOD walks in to see how many people are left. The following conversation occurs. \n \nMOD: *looks at wrist like he's checking time* where do you work? \nGuy: *laughing* why do you wanna know? \nMOD: oh, just so I can come to your work and stay ten minutes after you guys close. \nGuy: well you guys get paid the longer I'm here, so I don't see a problem. \n \nI couldn't hear the rest of the conversation too well, but MOD essentially said that that doesn't matter, when we close you need to be leaving or close to leaving. I've had many people apologize to me when they're running late and I joke and say \"the longer you're here, the more I get paid.\" However, I say that only to people who are packing up their bags and almost done. \n \nI wish my MOD hadn't left before I got an opportunity to thank him. I read too many stories of spineless managers, nice to know there's at least one at my work. ",
        "created_utc": 1501295377,
        "upvote_ratio": ""
    },
    {
        "title": "Tin foil hat + Dropbox = winning",
        "author": "sxmxc",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6pzo41/tin_foil_hat_dropbox_winning/",
        "text": "So I've waited a little while to post this due to NDAs and all, but I think it's finally time. This is from actual user. Keep in mind, I have not edited it in the slightest: \n\n\"HERE WE GO. YOU ASKED FOR IT.MOTHERFUCKING, COCKSUCKING E-MAIL MARKETING INTRUSIVE PRICKS.I E-MAILED PRIVACY LAST WEEK TO NOT SEND ME ANY OF THIS CRAP.SOMEONE SENT ME FILES AT DROPBOX AND I WENT AND GOT THE FILES.THAT'S IT. WE'RE DONE. \nUNSUBSCRIBE ME FROM THIS.I WILL NOT CLICK YOUR UNSUBSCRIBE LINK.I NEVER SIGNED UP FOR THIS.REGARDLESS OF WHAT YOU THINK I AGREED TO BY USING YOUR WEBSITE, I HAVE MY OWN TERMS &amp; CONDITIONS.UNDERSTAND?DO NOT PUT YOUR ROBOT SERVER APP INTO MOTION AND MAKE WORK FOR ME.\n\nI AM A SOUR MOTHERFUCKING PIECE OF SHIT.STAY OUT OF MY LIFE.FIX THIS OR I WILL MAKE IT UGLY.  - Please have a chat with these clowns.I will forward you the e-mail I sent to their privacy address BEFORE I started receiving this crap.I am way ahead of these pricks and I would appreciate it if you could rein them in and splain to them how they have fucked up. \nYou are their registrar.\" \n\nI feel this needed to be shared. Enjoy 😁\n\nEdited for readability",
        "created_utc": 1501195569,
        "upvote_ratio": ""
    },
    {
        "title": "Who else has had problems with older coworkers?",
        "author": "alecisacoolname",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6pyxj7/who_else_has_had_problems_with_older_coworkers/",
        "text": "In the jobs I've had, it seems like the older coworkers are hard to be around. I found them to be intimidating and pushy. Everything has to be done the right way,  they wont let little things slide. They're always waiting for an opportunity to call you out. They verbally abuse you when you mess up. I remember when I was 19 I got a job as pizza maker and the old cunt that was training me was just awful. All she did was insult me and bully me. I had to tell the manager to have someone else train me because I couldn't work with her. The same bitch also looked for every chance to insult and belittle everyone who messed up. One time I was just using the bathroom and the bitch was trying to say that I was hiding in the bathroom. wtf? I didn't want to tell her I was taking a shit. There have been other jobs I've had where the oldies would time us to make sure we weren't going over our allowed break time. I know training new people is stressful and annoying but there's no need to be a bitch just because you know how to do everything and been there for 20 years. Why do they assume all people younger than 30 are lazy just because they're young? ",
        "created_utc": 1501188649,
        "upvote_ratio": ""
    },
    {
        "title": "Dress for the job you want...?",
        "author": "CWinthrop",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6ps2bt/dress_for_the_job_you_want/",
        "text": "So since you liked my story about the [red crayon](https://www.reddit.com/r/talesfromthejob/comments/6og7pj/if_they_fill_out_the_application_in_red_crayon/), I figured I'd pull another one out of the dusty drawers of my past on this, my birthday...\n\nConversationally I'll be \"Me,\" and the new hire will be \"NH.\"\n\nThis one took place a couple of months later. The steakhouse was doing great business, the brothers were keeping everything clean (*they even kept the accent lighting bulbs up in the rafters changed out regularly!*), and we had started planning on longer hours (*going from just dinner service to lunch and dinner service*).\n\nOf course, with longer hours we needed more staff. So out with the big stack of applications!\n\nFound a few decent candidates, scheduled interviews, etc. One new hire, though, was a bit...well...\n\nHer interview went decently, nothing spectacular, no crayon on her application, decent references (*2 personal, 1 a former employer*), she was well dressed (*office casual, bit much for restaurant work*), and she was actually on time!\n\nNow for the employee uniform, we provided the tops (*black polo shirts embroidered with their name over the left breast, restaurant logo on the right shoulder*), and the employees provided black jeans and black skid safe shoes.\n\nThe shirts would take about 2 weeks to arrive (*custom embroidery*), so until then, we would give the new employees 3 branded black tee shirts, and a pin-on name tag.\n\nSo I'm helping out in the prep room in the back when our hostess called me on the radio, asking me to come to her station because the new hire was here, and we \"may have an issue.\"\n\nI made my way up front, and when I got there, I saw exactly what the \"issue\" was, and my jaw hit the floor.\n\n&gt; NH: \"I'm here, and ready to start making money!\" (*said with a \"flirty\" shake, and EVERYTHING shook*)\n\nThe hostess was standing behind NH, hand over her mouth, trying to not laugh.\n\n&gt; Me: \"What in the hell are you wearing? You can't seriously expect to work like that!\"\n\nShe had her hair teased out in \"wings\" (*very 80's porn-look*), more makeup than Tammy Faye Bakker, 6-inch stilleto boots, one of the tee-shirts I had given her cut to shreds (*[like this](https://s-media-cache-ak0.pinimg.com/736x/04/9b/76/049b765c5ed7029e7b4a02481e2ccc22--cutting-shirts-cut-up-shirts.jpg)*), across the lower front and and entire back, and black jeans cut up both sides and safety-pinned back together, showing far too much skin overall (*it was VERY clear she wasn't wearing a bra or underwear*).\n\n&gt; NH: \"What? I jazzed my outfit up a bit so I could earn more tips! Don't you like it?\" \n\nShe did the \"cutesy\" spin and bend over, showing me \"the whole outfit.\"\n\nWhat I wanted to do: Tell her to get the hell out of my restaurant and get back on her street corner.\n\nWhat I did: \n\n&gt; Me: \"We need to go back to the office **NOW!** and hurried her back to the office before any customers could see her.\n\nJust so happened one of the owners was there, in the office.\n\nOh, quite the conversation ensued! \n\nShe simply couldn't understand why we didn't like her outfit, because it was sure to \"bring in more tips\" for her, and \"more business for the bar.\"\n\nYes, the restaurant has a bar in it. With a fully trained and licensed bartender, who wore our standard uniform. (*NH was being hired as a regular server, btw, not a bartender*). Had NH ever worked a bar before? \n\n&gt; NH: \"Well not serving drinks, no... But I worked on the stage in a bar, doesn't that count?\"\n\n(*That wasn't on her application. Her old employer was listed as a pizza place across town.*)\n\nThe term \"FAMILY restaurant\" made no sense to her at all, so finally I told her flat out:\n\n&gt; Me: \"Go home, dress reasonably like all our other staff here, and we'll let you try again tomorrow.\"\n\n2 weeks later, she showed up, wearing a ratty looking \"belly shirt\" and \"painted on\" jeans, wanting to pick up her \"paycheck\" (*she'd never actually clocked in, and had never started work, so WTF paycheck?*) and drop off her tee-shirts (*yes, she had shredded all three, no we didn't bill her for them, sadly*).\n\nThat ended with the hostess telling her to get out of the restaurant before we \"call the cops on her for solicitation,\" and we never saw her again.\n\nSo yes, dress for the job you want, but at least be aware of where you're working!",
        "created_utc": 1501112106,
        "upvote_ratio": ""
    },
    {
        "title": "You don't like losing money? Then learn to listen.",
        "author": "zztri",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6pi7f2/you_dont_like_losing_money_then_learn_to_listen/",
        "text": "Greetings. First post in this subreddit, I do sincerely hope it fits, sorry in advance if it does not.\n\nI'm developer specialized in bigdata, image processing, GIS; usually having my expertise marketed as an \"undertaker\". I join dying projects and try to revive them, or at least bury them leaving as much profit to the customer company as I can.\n\nBut I wasn't always a developer. When I first graduated, foreign export/import was an incredible market. During those times having fluent English and some basic info about import/export was pretty profitable. I confess, I also had my fill with middle/upper manglement during my part-time years in college so doing the import/export in a suit and not staring at a computer screen for ten hours straight in a basement floor somewhere looked great to me. So I started working as a free agent, offering translation, import/export know-how and also IT/development/web design support in my home city as a free agent.\n\nOf course I gave up, because a customer is... a customer. A customer is never right and true happiness lies in the path of developing with the least contact to other human beings. I needed experience to learn this simple fact.\n\nJust a few moments ago I was telling a friend about my import/export adventure so I decided to share one prominent story here. It'll be quick in greentext. I'll call myself $me because all cool kids call themselves $me and the customer will be called ~~utter moron~~upper management, $UM for short...\n\n&gt;**$UM**: Zztri, we'd like to join $veryLargeAndSeriousB2BNetwork. Can you arrange that?\n\n&gt;**$me**: That's great. It's time you expanded horizons to e-biz. But they're rather serious and have some tedious joining procedure to avoid scammers. I'll check and get back.\n\n*I check with the customer service of $veryLargeAndSeriousB2BNetwork and learn the prerequisites, how they'll declare we're a real business.*\n\n&gt;**$me**: You need all your trademarks patented. You need to have your company name registered in the chamber of commerce. They'll also check your records in the tax department and you need to have declared positive tax for at least last tax season. The accounting must send formal documentation about the tax when they request. Are we all clear about these?\n\n&gt;**$UM**: Sure, we're a real company, aren't you aware, Zztri?\n\n&gt;**$me**: Yeah sure, I was only worried about the \"at least one year with positive declared tax\" portion, being a new company and all..\n\n&gt;**$UM**: Then we can apply?\n\n&gt;**$me**: Yeah sure, we also have to pay x amount as a fee. I'll send the requirements, fee and the deposit account info as a mail to accounting.\n\n*About 15 days pass. They receive in mail - actual, paper mail, it was years ago - that they're rejected because there doesn't seem to be a company registered for the name $theirFriggingNameWrittenOnEverything in either the chamber of commerce or tax department.*\n\n&gt;**$UM**: What the frick, Zztri?! You said we'd just send the fee!\n\n&gt;**$me**: There must be a mistake! How can you be not registered to the chamber of commerce or tax department? I advise you to go visit the local offices right away and get formal papers proving that you're registered.\n\n&gt;**$UM**: Uhm...\n\n&gt;**$me**: *???*\n\n&gt;**$UM**: We're registered as $similarButDifferentName.\n\n&gt;**$me**: .... Why?\n\n&gt;**$UM**: It was my brother's company. When he went bankrupt, we started using that name and took over his existing customers. Our formal documentation is on $similarButDifferentName but we use the name $name in everywhere else.\n\n&gt;**$me**: Then why did you agree when I told you the conditions?!\n\n&gt;**$UM**: You didn't tell us about those conditions at all.\n\n&gt;**$me**: I did. I even sent a mail about the requisites to the accounting!\n\n*We head over to accounting. $PNC; poor number cruncher enters the story here.*\n\n&gt;**$me**: $PNC, did you receive a mail about joining requirements to $B2BNetwork from me a couple weeks ago? Why didn't you warn me about you being registered in another name?\n\n*$PNC stares at us like a deer caught in headlights for a few moments, then stares at $UM.*\n\n&gt;**$PNC**: Because $UM said they're just formality and we're good.\n\n*I'm not a calm person. I should say I'm actually very aggressive. So I did what would stop me from headbutting people all around.*\n\n&gt;**$me**: I'm going now.\n\n&gt;**$UM**: Uhm.. Zztri? When will they return the registration fee?\n\n&gt;**$me**: They won't. You don't like losing money? Then learn to listen.\n\nHope I could give you at least a weak chortle.",
        "created_utc": 1501007985,
        "upvote_ratio": ""
    },
    {
        "title": "Yestderdays jackass customer is today's jackass coworker, and it's 100% my fault.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6pernx/yestderdays_jackass_customer_is_todays_jackass/",
        "text": "[deleted]",
        "created_utc": 1500970024,
        "upvote_ratio": ""
    },
    {
        "title": "8 Hours of Crap",
        "author": "slimskinny22",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6p61uo/8_hours_of_crap/",
        "text": "Before anyone reads this and decides to post \"grow up ya wimp\", here's some food for thought. \na) I'm fresh out of college and trying to make ends meet.\nb)  my job in college wasn't janitorial or anything like the things I do during my shifts here. \nc)  half of the reason I couldn't handle today is because of stuff at home. \n \nNow that that's done.....\n\nI get a call from the front desk saying one of our personal trainers found something in the parking lot and needs us to check it out. As he's walking with me out there, he tells me that the car next to him has needles under it and he's afraid a child will find them or the passenger in the car next to it will step on them. I'm thinking your stereotypical hospital needles with the long needles and short plungers. NOPE. We get there, and there are five epipens (or at least that's what they look like) laying under the driver's door. So I run back inside, grab my broom and dust bin, and sweep those bad boys up. Problem is, my biohazard bin (don't have sharps containers at my job) hasn't been changed in the two months since I've been there and is filled to the top, and I've never been shown where the bags are so that has to be put on hold until I find the MOD. I go on lunch (30 minutes on Sundays so I have to clock out) and find her afterward (needles were hidden from view so nobody could get hurt). We run around and finally find the bags, so I replace mine and dump the needles in a separate one before running the trash out. I continue on with my day, only to realize that, with an hour left, I NEVER CLOCKED BACK IN. To top it off, when I checked the boy's shower I found roughly 3/4 of a stack of towels just laying in there soaked. A stack is about 20, so you can imagine how difficult it was for me to put them into an already full basket and drag that out to our dirty towel bin. I know the kids who probably did it too, but there's sadly nothing I can do as for some reason management lifted the rule saying you can only take one or two. \n \nI just keep telling myself that after tomorrow I have three straight days off to unwind.....",
        "created_utc": 1500869040,
        "upvote_ratio": ""
    },
    {
        "title": "most of our customers are law enforcement",
        "author": "MKEgal",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6p23gg/most_of_our_customers_are_law_enforcement/",
        "text": "Yet there are many things in the shop which are zip-tied to their shelves so they aren't stolen *(think small flashlights, battery packs for same)*,            \nand the sales guys regularly catch customers pocketing things from a display on the counter *(which has keychains with a badge on them from the largest local LE agency)*!             ",
        "created_utc": 1500826090,
        "upvote_ratio": ""
    },
    {
        "title": "If they fill out the application in red crayon...",
        "author": "CWinthrop",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6og7pj/if_they_fill_out_the_application_in_red_crayon/",
        "text": "Back when I was the day shift GM at a certain steak restaurant (*no, not that one, the other one*), we were doing a hiring streak for the new location's grand opening.\n\nI had a BIG stack of applications to go through. A few stand out as being memorable, like the guy who listed his fellow inmates and his parole officer as references (I was willing to give him a shot, but he missed his interview by being arrested and in jail again), or the woman who had \"tons of experience\" listing her last 5 restaurants where she'd worked a total of 2 weeks.\n\nBut the one that really caught my attention was the application written in red crayon. Yes, seriously. Neat printing throughout, but completely done in red crayon. I called this guy in for an interview just for the hell of it.\n\nWhen he showed up he was well dressed (*polo shirt, black jeans, comfortable non-skid shoes*), had excellent references, a decent work history, good knowledge of restaurant work (*dish pit, bussing, and prep*), and overall, was perfect for the job.\n\nFinally, at the end of the interview (*I'd already decided to hire him. I'd be insane not to!*), I asked the big question: \"Why did you fill out the application in red crayon?\"\n\n\"Well, I figured you'd have a ton of applications to dig through, so I wanted to stand out.\"\n\nAfter his second day on the job, I jokingly told him \"You're the best worker we've got! Any more like you at home?\"\n\n\"Well, I've got a brother who could use a job.\"\n\nHe brought his brother in the next day for a trial run. Hired him on the spot, too. The brothers were still working there when I left 4 years later, and they took over my position as co-GMs.",
        "created_utc": 1500557196,
        "upvote_ratio": ""
    },
    {
        "title": "The time when we were hilariously robbed",
        "author": "iamonlyoneman",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6odsu2/the_time_when_we_were_hilariously_robbed/",
        "text": "Once upon a time, there was a soap factory, and it was good.  They made soap and candles in a bigass warehouse out in the country.  The factory fell on hard times and at one point they felt a need to put up a sign inside that said\n\n&gt;Any employee caught in the parking lot during working hours will be subject to immediate termination\n\nwhich may have been related to the large pile of empty beer bottles behind the fence along the parking lot.  The company finally closed and the soap factory stood abandoned.  But this is all by the way. \n\nThe soap company phones were on a a POTS system with lots of wires running to terminal strips in an electrical room.  Very obviously phone-system-looking.  When we bought the place and moved in, it was more effort than it was worth to remove, so we left the remnants of the old phone system and went right to IP telephony.  The time-clock system is also IP-based.  Video cameras were installed, as was a security alarm (IP-based as well).  And bars on the windows.\n\nFast forward and my company had a few hundred-thousand dollars worth of computers and spares laying around in the warehouse, and a pair of *clowns* broke in.  The alarm went off of course and this sent them into a panic.  They (literally) ran around cutting every cable that looked like it could be telephone-related to try to kill the alarm.  This included the time clock's keyboard (a USB tenkey keyboard) and most of the old phone system's wiring.  The alarm continued blaring, and they continued running.  The storage area of the warehouse has locked gates and they couldn't get in to get any goodies.   They attempted to flee out one of the windows, but only managed to break it and then (shockingly) they couldn't get the bars off, so they ran out the door where they came in, and off into the night.  Some laughs were had when the security video was reviewed the next day.\n\nThe time clock keyboard cable was previously draped in ugly fashion along the wall, so after I was done repairing it, the only part of the company that they damaged that anyone ever sees actually looked better.  \n\ntl;dr: burglary fail involving cutting of wires that did nothing.",
        "created_utc": 1500522658,
        "upvote_ratio": ""
    },
    {
        "title": "\"Let's be honest\"",
        "author": "chauchalotapus",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6nvptv/lets_be_honest/",
        "text": "I work in phone sales selling space on our website to other businesses.  I am the Lead Account Manager.  I make a minimum of 100 sales calls a day, and using the same script gets awful tedious.  Today, I was calling companies who have used our website in the past and I either say \"your company has used us from time to time\" or \"your company has used us in the past.\"  I usually don't know which one I will use until I am saying it.  \n\nI called a company who has used us and had a new contact.  I recited my script and said \"your company has used us from time to time\" instead of \"your company has used us in the past\".  The woman got completely offended and said \"No, let's be honest.  We used you in the past, not from time to time.  I only deal with vendor's who are honest so lets say the truth and that we used you in the past.\" Instead of agreeing with her, I moved on and said, \"I was just checking to see if you have any needs at this time?\" and she said \"not a chance\" and ended the call. WTF? To be completely honest, they had been using us off and on for years, which is what \"from time to time\" means, right?",
        "created_utc": 1500322532,
        "upvote_ratio": ""
    },
    {
        "title": "When Google humor goes right over someone's head",
        "author": "Duzzeno",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6nur7y/when_google_humor_goes_right_over_someones_head/",
        "text": "There's a fellow in another department who's not super tech-savy but is a lot of fun to talk to. Every now and again when I would talk to this guy I would bring up some sort of funny website that he could check out himself or share with his wife and son to have a laugh.\n\nGizoogle, the gangster search engine was a hit: http://gizoogle.net/\n\nElgoog, the mirrored search engine was even better: http://elgoog.im/\n\nEventually I heard him ranting about someone who was either less tech-savy than him, or just plain lazy. The guy was constantly sending emails asking basic questions that he should be able to figure out himself in a few seconds. My friend was quite busy and could easily take more than an hour to get to an email so these little requests were causing big delays.\n\nThe straw that broke the camel's back was the guy asking for our address. The street address was displayed prominently on our homepage, with additional details on the contact us page, and in the side bars of various other pages. Our site was also the top google search result so even though the guy should have the address on file since he'd dealt with us before, he still sent an email asking for it.\n\nSeeing my chance, I told my friend about the website \"Let Me Google That For You\" which plays a short video of someone typing something into a search bar, clicking search, and then getting to whatever link you share with them. The site is meant to insult people asking stupid questions so I thought he'd get a kick out of it. My friend loved it and said he planned to share it with his family like all the others.\n\nA few days later my not so tech-savy friend drops by my desk with his head in his hands. I ask him what's wrong and he tells me he sent the guy a \"Let Me Google That For You\" link to our website which was the top search result.\n\nI'm panicking at this point because it was meant to be a joke, I didn't expect him to send it off to the guy and he seems so down that something must have gone wrong.\n\nI ask him if he got a write up or something since he's obviously not fired and he's shocked. What? No! Nothing like that, he says. I sent the guy the link and he… thanked me. Thought the link was very helpful and proceeded to bookmark and share it with anyone who needed it.\n\nThe joke had passed so far over his head he probably couldn't have seen it with binoculars.\n\ntl;dr: Show a friend a website to mock someone, friend uses it and the other guy doesn't realize it's an insult.",
        "created_utc": 1500314082,
        "upvote_ratio": ""
    },
    {
        "title": "My former boss's philosophy on professional growth. Also why I don't work there anymore.",
        "author": "bagofwisdom",
        "url": "http://i.imgur.com/JfiIgwP.jpg",
        "text": "",
        "created_utc": 1500294060,
        "upvote_ratio": ""
    },
    {
        "title": "Email: from newish VP of Engineering, 5/13/2002... There is a good chance that this email might do one of the following to you: 1) anger, 2) frighten, 3) have a positive impact.",
        "author": "dacracot",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6novu7/email_from_newish_vp_of_engineering_5132002_there/",
        "text": "My goal is for #3 to happen but I must say what must be said... Our Delivery organization needs an attitude adjustment.\n\nFirst, a little perspective...\n\nI have been at &lt;company&gt; for over 10 months now.  During that time period, I have sat back and observed a number of interesting things/behaviors.  Believe me, I have been on both sides of the \"new team being brought in\" situation and I realize it isn't overly comfortable for those folks who have been at a company for a while or the new folks coming in.  For that reason, I typically will do my best over the first 6 months to be sensitive to the range of actions and emotions that typically go on... This include:\n\n1. Old team thinks the the new team wants to change everything without any good reason; Everything works so why change it?\n\n2. New team thinks the the old team is not opening their minds to new ideas; There is definitely a better way to do things...\n\nTypically, within 6 months, things get better and the old team and the new team eventually work things out and become the \"newest\" team.  I've actually waited an additional 4 months longer than usual and the \"newest team\" has yet to emerge.  This makes me very unhappy.\n\nSo, what do i do?  Well, this is when I change things the way I want them.  I will no longer wait for the correct behaviors to surface.\n\nHere's how it will work from tomorrow forward...\n\nI was once told that there are actually 6 options that a boss and an employee have when they are not in synch:\n\n1. The boss is terminated by his/her boss and the employee gets his/her way.\n2. The boss quits and the employees gets his/her way.\n3. The boss changes his/her mind and defers control to the employee therefore giving in to his/her way.\n4. The employee change his/her behavior and gets in synch with the boss.\n5. The employee quits.\n6. The boss terminate the employee.\n\nThe above has actually held true throughout my career and I suspect it has held true in yours as well.  Given the above, I can tell you that #1, #2, and #3 are not going to happen.  &lt;VP's boss&gt; is in full support of my actions and I'm committed to making &lt;company&gt; a success by leveraging my knowledge and experience in making Engineering/PS teams successful.  So that really leaves the last 3 options.  We are now at the point where you and I will be making some decisions.\n\nSo what are some of the things that will be happening here from this day forward?\n\n1. We will execute (with extreme prejudice) the plans that have been set forth in our v3.0 architecture.  This includes:\n    * Anthem architecture and all of its pieces (VTL, Turbine, etc.)\n    * Ipedo as the Transaction Engine\n    * Oracle as the data warehouse\n    * RI as the major piece of Comms\n    * JRules as the Rules Engine\n2. We will begin doing things the \"right way\" instead of the \"convenient way\".  This includes:\n    * Support a schema/dtd structure that is very close to the standard if not a standard\n    * Creating the appropriate documentation before development (Architecture, Functional Spec, etc)\n    * Publishing our work to source control\n    * Following correct CM protocols\n    * Following correct QA methodology\n    * Conducting peer reviews\n\nShort-cuts are killing us.\n\n3. We will check our attitudes at the door.  I don't require you to like each other but I do require you to work together in an effective manner.  You are all owners of this company.\n4. We will be acting entrepreneurial.  I know many of you have families but we need to commit to long hours and tireless commitment to excellent results.  Entrepreneurial companies work nights and weekends to ensure success.  Know many of you work hard but I don't get a feeling that we like what we do and are  committed to making it successful (&lt;VP's boss&gt; shares my feeling on this one and has gone as far as to prove his suspicions).\n5. We will not miss project plan dates.  We will give each other support to ensure that we don't.\n6. We will make the Sales organizations successful.  Without sales, our stock is worth nothing.  None of us came here for that result.\n\nNet... net... I'm done with screwing around.  Many of you might think I'm a pretty nice guy but you don't want me to feel the way I'm currently feeling for too long.  I was brought here to build a successful Engineering (and recently PS) team.  &lt;VP's boss&gt; has empowered me to do so in any way that makes sense.  We've made some great hires in the Sales, Product Marketing, and PS areas and we won't waste the investment.\n\nSo the decision is really yours.  The good news is that you are in control of 2 of the 3 remaining aforementioned options... #4 = Change the behavior or #5 = Decide this company is not really where you want to be.\n\nI'm certainly open to answer questions regarding the above but I must warn you... my patience is thin.  I suggest you digest the above and schedule time with me tomorrow if you want to talk.\n\nOver and out...\n\nRegards,\n\n&lt;VP of Engineering&gt;\n\nVice President, Engineering\n\n&lt;the company&gt;\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\nThis email came out on Monday.  We all stewed for a few days, but when I came in on Friday, the VP of Engineering and the three senior engineers of the five he had brought with him, had all been fired.  He was right about the choices, just not the one that quickly happened.\n\n",
        "created_utc": 1500241483,
        "upvote_ratio": ""
    },
    {
        "title": "Candy Fruits kostenlos online spielen ohne Anmeldung im Internet",
        "author": "fernandavounsic",
        "url": "http://www.kostenlos-poker.com",
        "text": "",
        "created_utc": 1500027569,
        "upvote_ratio": ""
    },
    {
        "title": "The residents at my college had a penchant for stealing signs… but I didn't realize how much.",
        "author": "Duzzeno",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6n27es/the_residents_at_my_college_had_a_penchant_for/",
        "text": "I worked as an RA (Resident Assistant) in my residence for a few years back in college. I have many fond memories of those times but I was just reminded of one when I got stuck in traffic on my way to work.\n\nLike most colleges we had our fair share of petty thefts of things like signs, traffic cones, and anything that would catch a drunk college kid's eye. I knew my roommates occasionally took part in it so once I started officially working there I told them to make sure I didn't find out about anything since I didn't want to go full cop on them. They kept it to a minimum, I rarely saw anything of note and we were all happy… right up until the city started doing mass construction nearby.\n\nSuddenly traffic cones started appearing all over the building, signs were popping up at every corner, and construction worker orange seemed to be in every common area. The manager of the building finally had a meeting with the RAs and told us it was getting out of hand. He was fine with the occasional sign appearing and the resident getting a warning because let's face it, keeping college kids in line is like herding cats and he picked his battles. He told us to spread that word that this was all illegal and anyone found in possession of these items could receive a hefty fine if anyone found out. Rather than doing a door to door witch hunt he said that starting the following monday anyone who had any of these items could drop them off at the office, no questions asked and he would take care of it. We made the rounds, told everyone the news and happily went about our weekend. I had a fun moment with my roommates standing in their bedroom sharing the info and pointedly ignoring the Orange sign five feet to my right.\n\nThe following monday I had to drop by the front office to check something on our schedule and was met with quite the site. \n\nHeavy metal signs were stacked to one side so deep the secretary could barely make it to her desk, small traffic cones were stacked on every surface, and large pylons were placed creating walkways for visitors.\n\nApparently the residents were all too happy to get rid of their ill gotten goods once they realized there was a possible fine (I'm not sure how they didn't realize this before hand) but the manager had underestimated the number of participants.\n\nI found out later that the manager spent the rest of the day making trips back and forth as well as having a long discussion with one of the construction guys who I'm told wound up laughing at the whole situation in the end.\n\ntl;dr\n\nCollege kids steal a lot of stuff, manager gives them a free pass if they give it back, manager's office turns into an obstacle course from the sheer number of items.",
        "created_utc": 1499958668,
        "upvote_ratio": ""
    },
    {
        "title": "Shutting down chastisement from a junior coworker.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6n1vzr/shutting_down_chastisement_from_a_junior_coworker/",
        "text": "[deleted]",
        "created_utc": 1499955537,
        "upvote_ratio": ""
    },
    {
        "title": "Customer claimed sexual harassment",
        "author": "Sully1102",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6n1a8f/customer_claimed_sexual_harassment/",
        "text": "I work in B2B software sales, and my office will host monthly training for our clients. I will be notified if there are any attendees coming from my accounts, at which point I reach out to say hi, and invite them to dinner/drinks after class one night. \n\nAfter getting one of these notifications, I see an attendee is coming from an account in my city (most attendees travel in for these classes). I change up my email to acknowledge that SHE is local, so I assume she'll just head home after class. \n\nA day later, I get a call from HR. Apparently the client felt that I singled her out as a woman, and that no one else from her team was invited (no one else was attending). The invite made her \"uncomfortable\", and she told her manager, who then called my HR manager. \n\nSo, just for doing my job of building a relationship with my accounts, I get called out for sexual harassment. ",
        "created_utc": 1499948828,
        "upvote_ratio": ""
    },
    {
        "title": "Emberassing work exerience",
        "author": "anonymo1424",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6mua1y/emberassing_work_exerience/",
        "text": "I didn't really know where to post this so here it is, good enough I suppose. Anyways, I am a temporary intern at this bank office. After a month in, I kicked ass at my job and completed everything they wanted me to do, everything they hired me to do. So one morning I show up to work (fifteen minutes late) and I arrive at an empty office. I meander over to my desk and there is a sticky note on my monitor that tells me there's a meeting going on in the conference room. Great. I go over to the conference room and enter just as the department boss is talking. Im shy and everyone is looking at me: not the best thing to calm me nerves. I am directed to walk across the room to sit, all the while all eyes are on me. I sit down and the boss continues his conversation. Basically what he said was I made all my coworkers look bad because I outperformed and set the new office standard for work ethic. Hooray for me, right? Wrong. When the boss left, the supervisor put the spotlight on me in a room full of people. My supervisor thanked me and I was too scared to thank him or say anything. I was frozen with fear like a deer in headlights. I ended up looking down at the ground without saying a work. I looked dumb and that was incredibly emberassing. I left that room and everything went back to normal... I just worry about what my coworkers think. Just thought I'd share my woes for you redditors to laugh at. :)",
        "created_utc": 1499869775,
        "upvote_ratio": ""
    },
    {
        "title": "Stories From The 'Hood': The \"Incident\"",
        "author": "ThirdShiftStocker",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6mbzok/stories_from_the_hood_the_incident/",
        "text": "Between the summer of 2013 and spring 2016, I worked at an after-school/summer day camp program in New York City. This is a series of stories I’m writing to describe my personal experiences as well as provide an outlook to how things have fared since the time I started in this mostly overlooked neighborhood. The community center was also shut down recently without much notice.\n\nIt was a cloudy day in July when I pulled up to the public housing project community center with my friend. We’d been transferred to a new job site after a botched job placement in the summer youth program we had signed up for. As one of the only remaining options, we jumped at it. How bad could it be? We went inside and inquired with the center director and office manager, who quickly brought us up to speed and gave us some work gear. We were then introduced to the kids and the rest of the group leaders. Okay. So far so good. I wound up with the youngest age group for the remainder of the day as we played indoor games. The rest, is pretty much history.\n\nOne of the group leaders was the center’s program coordinator. She was a great person to be around. She was the one who showed me most of the ropes when I eventually became a permanent staff member at the center. One of the earliest things I learned from her was why the children were forbidden to play on the fixed structures in the playground. Through her, some poking around on the computers and old incident reports combined, I learned of The Incident. The center director had made it known at a meeting after the end of summer camp one day that it was the reason for why the center was under a lot of scrutiny by headquarters.\n\nHaving happened the year before I first started, the “incident” remained fresh in many heads since then, and I’m sure that if you asked the kids who saw it first hand, they would tell you everything. Per the information I gathered, the story begins with the K-2 age group of kids lining up at the water fountains for a water break. The group leader attending to them at the time decides to take the opportunity to poke into the main office, which is not more than 25-30 feet from the fountains. As he does so, the kids take it upon themselves to run out into the playground as the door is wide open after getting their water. Supposedly some water puddles had formed on the ground and that made some of the kids’ shoes wet.\nNot long after is there a piercing shriek and a girl is somehow bleeding from her nether regions. She’d slipped, fell and caught the pull up monkey bar between the legs as she attempted to stand on them. She was rushed into the office by another staff member who was manning the front desk area where the center director at the time administered first aid. The child’s pants were not removed but instead bandages/gauze were applied on top of the clothing to help stall the bleeding until paramedics arrived to take her away. The stepfather of the little 7-year old victim wasn’t very happy about this situation and threatened legal action against the center though that is something I never saw come up in the years since.\n\nI never found out the extent of the little girl’s wounds, but I overheard one day the kids mentioning that the injuries left her with trouble using the bathroom. The group leader in charge basically lost his job and life went on as usual. \n",
        "created_utc": 1499657680,
        "upvote_ratio": ""
    },
    {
        "title": "An instance of comedic relief at the hospital",
        "author": "Sapphira45",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6mbene/an_instance_of_comedic_relief_at_the_hospital/",
        "text": "I've been working as tray runner in the kitchen of one of the biggest hospitals in my city and surrounding areas since May. Near the end of shift tonight I was delivering food to patients in the ER. One tray was going to a room that was near one of the trauma rooms, where they were working on someone who had just been brought in. The trauma room being in use is a common occurrence when I go to the ER, so I ignored the commotion and set about my business.\n\nAs I'm getting the tray ready to actually go into the designated room, the commotion suddenly picks up with some added noise. I look up in time to see several paramedics booking it down the hallway with a woman on an ambulance stretcher who was just brought in. She was extremely pregnant and in labor. As they went by, she proceeded to scream at the top of her lungs, \"IT'S COMING OUT NOOOOOOOOW!\" The entourage disappeared around the corner and about a minute later I heard transport being paged to triage to get this lady up to Labor and Delivery. Hope they made it. In the meantime, I just stood there for a second thinking, \"did I REALLY just see that??\". It was like something straight out of a scripted sitcom.",
        "created_utc": 1499650422,
        "upvote_ratio": ""
    },
    {
        "title": "Literally Cleaning Crap/After-hours Shower",
        "author": "slimskinny22",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6lyovv/literally_cleaning_crapafterhours_shower/",
        "text": "Hey guys, my last post seemed to be well-received (Grad Party) so I thought I'd post a double-story, one from last Sunday and the other from today. For those who didn't read the last one, I work at my local Christian-oriented fitness facility. \n \n1: Last Sunday, I got a call from the other janitor on duty asking me to meet her at the family locker room. I get there and she takes me to the area leading to the pool, and there's a couple turds laying on the ground. While waiting and directing traffic around the poop, I get a call on my radio from the MOD asking me to meet him in the boy's locker room.\n\nI head over there, turn the corner to the shower area, and immediately see a literal pile of crap on the floor. He tells me to go get the hose downstairs and we use it to try and spray it into oblivion. He goes at it for maybe five minutes, then hands the hose to me and goes to finish up his rounds. I have to step out twice to get some air and not vomit, and finally give in. Thankfully third shift was given the task of cleaning it up.\n \n2: On Fridays, we close the building at 9 (hour earlier than the rest of the work week). The MOD gives a warning over the speakers starting at half hour til, so people have plenty of time. When we finally close, I go into the locker room and start taking care of towels. Normally we have a few guys finishing getting dressed and it's all good. Not tonight. Tonight, I had a guy decide to take a shower FIVE MINUTES AFTER WE CLOSED. I thought he was going back to use the bathroom, so I thought nothing of it until the MOD came in and asked me if the one guy left was it. I said someone went to the back but I haven't seen him yet, which is when we realize that there's a shower running. He goes back and tells the guy he needs to stop and get dressed. Normally I say to the people who apologize \"the longer you're here, the more I get paid\" but I'm not going to be joking when you know were closed and yet take a shower. ",
        "created_utc": 1499483726,
        "upvote_ratio": ""
    },
    {
        "title": "My bosses railroaded me in a meeting that I recorded, which I turned into a funny video. I quit, and later I sent it to them and their bosses.",
        "author": "FeralCarson",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6lq9b4/my_bosses_railroaded_me_in_a_meeting_that_i/",
        "text": "The video: [Lessons in Management](https://youtu.be/ynx66kI5DSk)\n(Last names and the company name have been edited out.)\n\nThe backstory:\nI used to be a supervisor at a food production plant. One of my duties was to make sure employees were keeping up with their assigned cleaning duties.\n\nOne employee, whose full time job was to clean drains, was not doing it. And I don't mean he was doing it poorly, he wasn't doing it at all. So I started to document it with pictures which I then sent to my supervisor, who then showed them to his manager.\n\nThe drains got cleaned after this, and right before an audit of the facility.\n\nUnfortunately, it soon went right back to the way it was. I spent the six months trying to get this guy to do his job, photographing drains and emailing various managers in attempt to correct the situation.\n\nThe employee was given a written warning about 2 months into this 6-month ordeal and it changed nothing. A few months into this I was told by other employees that I should leave the situation alone because this guy was personal friends with my manager, hanging out at his house and at the bar with him, and that I would never get anywhere. This only made me try harder.\n\nI tried to get four separate superiors to deal with it. Eventually, I contacted the 2nd-in-charge at the plant and it was finally taken care of. Still no further discipline, but the drains were clean and I was content with that.\n\nA couple of weeks later this employee started telling people in the plant that was I out to get him because he had caught me hitting on his wife on Facebook. I immediately informed my managers of this story (one of them being the personal friend of the drain guy) and they brought him in for a meeting (without me). I was told by these managers the following day that he had admitted to making this story up and that he was told he would be fired if he did anything like this again, but no discipline was handed down, no documentation.\n\nAfter this I told my bosses that I no longer wanted to work as a supervisor under them and I took another job in the plant under another manager. Life improved slightly.\n\n\nMany months later an entirely separate incident occurred... \n\nThe drain guy's friend/manager bought pizzas for just that department. Something that he did often (on the company account). The rest of the plant was typically annoyed that the company was paying for pizzas for \"his boys\". Still feeling disgust for this manager and his ways, I went to their breakroom and took one of the pizzas and shared it with my co-workers.\n\nThis evidently pissed someone off. Almost 2 weeks later I found an anonymous, sarcastic sympathy card on the outside of my locker in the men's room. It had a handwritten note inside, in a woman's handwriting, along with a gift card to the local pizza place. \n\nI called the pizza joint and found out who had bought the gift card. It turned out to be another guy from that department that I used to supervise. This guy had been a total dick to me for years so that removed some of the humor from it. Now it just seemed like a dick move, hanging up this sarcastic card for the whole plant to laugh at, and by a guy that everyone knew treated me like shit.\n\nAnyway, since this guy refused to talk to me, and had to have his wife write the note for him, I figured it would be appropriate for me to thank her. So I did. Sarcastically. Through a private Facebook message. Just a simple note thanking her for the card and saying how nice it was nice of her to write this note for her husband. A back and forth ensued with her being mad and me being annoyingly polite.\n\nThe guy then complained to the manager that I had contacted his wife on Facebook. So I was hauled into a meeting with the plant manager and 4 other managers. I was suspended from work for three days for \"contacting the spouse of an employee on Facebook.\"\n\nI was a little pissed since all these managers saw that this note was up for three days before I found it and just waited for a situation to play out. In the meeting, the fact that the wife wrote the note and the guy hung it up to harass me no longer mattered. It was like time reset once I sent that FB message. But in the end, stupid as the whole thing was, I accepted my punishment.\n\nBut during this meeting things took a weird turn. The plant manager said this reminded him of 'the time I contacted the wife of the drain cleaning guy'. And right next to him sat the manager that told me the drain guy had admitted to making the story up, who all of a sudden had trouble recalling that part of the story...\n\nI actually never talked to the plant manager about the BS story from the drain guy, so his information could only have come from this manager, personal friend of drain guy.\n\nSo it began to make a little more sense; this manager had convinced the plant manager that there was a pattern of me doing this sort of thing and maybe that's why this seemed like such a big deal. Of course I objected and told them how it really went down. So then he says its not relevent. Yeah the guy that brought it up said it wasn't relevant to this situation! And then he says he doubts his super manager would have forgotten that drain guy had confessed to making it up. \n\nThis meeting went on for 20 minutes, and I recorded all of it. Them raising their voices at me while I laugh at them and defiantly defend myself against drain guy's slander.\n\nA couple of weeks later I quit that job. The whole thing just felt dirty and I knew I'd never be able to work for those people.\n\n\nAlmost a year later I took that recording and turned it into a funny video lampooning my bosses, using various still photos to depict what was happening, and proving that my story was true texts exchanged with my manager. Of course I used fake, unflattering images to represent my bosses. I then sent it to some former coworkers.\n\nIt spread like wildfire at the plant! There's about 120 employees there and it had 115 views in 3 days. I felt pretty proud of myself at first. But then I started to wonder if I had gone far enough. \n\nSo I typed up a timeline of events about the drain guy, add the photos of the filthy drains that I had taken and screenshots of the texts and emails I had sent to my managers about it, all in chronological order. As well as a screenshot of drain guy's wife herself saying that his story was untrue.\n\nI then emailed all of it to the president and vice president of the company (plant manager's bosses) and told them that they should see the video that everyone was watching at one of their plants. And yes, I was kind enough to provide a link to the video.\n\nThen I emailed the plant manager and the other managers (as well as a bunch of random managers and salespeople) and told them what I had just done. I figured the subject would have to be brought up by one side or the other if it was in separate emails. And I did all this on the morning of a holiday. Hopefully it ruined the holiday and allowed it some extra time to fester before the returned to work to face each other and their employees.\n\nYou'd think the head of a food company would be a little upset about a manager choosing a friendship over the cleanliness of his plant, as well as conspiring to slander the employee that reported it to him. But we'll see.\n\n\nThe video ends up painting a hilarious picture of the meeting: [Lessons in Management](https://youtu.be/ynx66kI5DSk)\n\nBy the way, this was in a \"one party consent\" state.",
        "created_utc": 1499389286,
        "upvote_ratio": ""
    },
    {
        "title": "Kmart Cashiering gone Weird",
        "author": "triplextralarge",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6kci7i/kmart_cashiering_gone_weird/",
        "text": "A few different times while working at Kmart I have had some weird experiences. Once I saw two kids naruto running while a fat man chased them holding like 10 fidget spinners. Another time A woman bought over 200 dollars in Propel water. While ringing them I thought that they were on sale or something I looked and they were ringing up 1.59$ each, I asked \" You know these aren't on sale, Right?\" She looked at me like I was a rambling mad man and said \"Uh... Is there a problem?\" I said no and kept ringing things up, it was like 240 dollars in total. The last story Ill say is I asked a guy \"Hey are you ready to check out sir?\" And he said \"No I no check out, I just take.\" Then smiled at me creepily. He had easily 400 dollars in merchandise, But I was so taken aback by the situation and said \"Oh... ok\" and walked away.",
        "created_utc": 1498782180,
        "upvote_ratio": ""
    },
    {
        "title": "Graduation Party",
        "author": "slimskinny22",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6k156e/graduation_party/",
        "text": "FTP here, on mobile so sorry for any issues. I'm a locker room attendant at the local Y, so on top of my regular janitorial duties I also keep the men's locker room clean and take care of our dirty towels. This story happened a couple weeks ago so I'll try to remember it as best I can. \n \nMe=me, M=mom, D=daughter. \n \nI'm over by my locker room when a call comes over the radio from the front desk, asking for custodial. As the front desk is right near me, I walk to them and ask what's up. They point me to a mother and daughter (M and D) and say that they're setting up for a graduation party in one of our community rooms and need chairs to be set up. Tables are already set up so I ask how many chairs and they say probably 80 (8 per table). No problem, I grab what I can from the storage room near the room they're using and go upstairs to grab the rest. \n \nI come back and help take the chairs off the racks while they set them up, and all the while I hear them bickering and catch a hint of \"we're very important people\" tone in the voice (hint: they're not very important people). Whatever, I'm doing what I can to help. We're all done with chairs, and as I'm taking the racks and extra chairs away they then ask me for a vacuum, so I grab mine and bring it to them. They turn it on, and can't figure out where the lever is to be able to maneuver it better (not sure how to describe it, but I'm sure you guys know what I mean.) I go show them and say \"you really have to stomp on it\" with a laugh, and D emotionlessly says \"thanks.\" I go take care of things in the locker room and come back to see how they're doing. They tell me they're all done with the vacuum and thank me, and I ask if they need anything else. \n \nM: Can you go and ask if there's anything going on in the other room tomorrow? (Room they use is one divided by a removable wall.) \nMe: Sure, lemme go check. \n\n*I ask front desk, they say there's something from 8-2*\n\nMe: They said there's something from 8-2.\n\nD: WHAT??? \n\nM: What did you say? \n\nD: He said there's something from 8-2.\n\nM: We were told there was something 8-1!\n\nMe: That's just what I was told. \n\nM huffs out of the room, saying very clearly that they will never come back and should've gone somewhere else. She proceeds to take her frustration out on the front desk worker, who handles it very well. \n\nAt the end of my shift, I'm restocking towels by the women's locker room when the front desk worker comes over and asks how I'm doing. She says that later the lady came back and asked nicely if they could get more chairs but if somebody else could, as \"the janitor (me) had already done so much to help\" and they didn't want to make me do any more. Thanks, but you'd been rude all night long. A little nice comment like that, as much as I appreciated it, changes nothing. \n \nTwo side notes. \n1. There was a call on the radio from our MOD to another janitor saying these people needed a ladder and wondered where to get one. As I walked past him, carrying the ladder he found, he looked at the front desk workers and said \"Watch, they're gonna say 'this won't work, it's too short.'\" Everyone down front knew how rude they were. \n2. Turns out there was something later on in the next room. One of my coworkers had her college grad party in there, and said that she was in the bathroom with the mother and another lady. The mother was complaining about how the floor wasn't vacuumed and how they, yet again, were never coming back.",
        "created_utc": 1498662477,
        "upvote_ratio": ""
    },
    {
        "title": "It's Raining Cats and Dogs. And Giraffes.",
        "author": "doihavemakeanewword",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6jt0bc/its_raining_cats_and_dogs_and_giraffes/",
        "text": "Sometimes things go horribly wrong and the only person to blame is Mother Nature. \n\nI'm the carnival barker for a Ring Toss game. For a few dollars you get 30 rings to try and throw one so it lands around the neck of a bottle [like so] (https://qph.ec.quoracdn.net/main-qimg-1d22b082924c28bba5c4b983e771ca95). Our set up is very similar to [this] (http://1.bp.blogspot.com/-jmpsqGfE7Wo/VBNORxx1wDI/AAAAAAAAL3c/irMBGi70Pk8/s1600/IMG_0423.JPG), open on three sides with prizes hanging down from the ceiling, on shelves attached to the ceiling, and on shelves on the back wall. Also at the back wall is several buckets to store excess rings. There are several rows of bottles, with a gap in between rows to catch rings that miss. The operator has to spend most of his time fishing out rings from the rack (which goes all the way to the back under the aforementioned storage buckets), as it can take up to a half an hour to clean them all out depending on how many rings are out and about. This requires spending a lot of time crawling around under the thing with a hook. [It's a really nice hook] (https://youtu.be/heMFNsjYmZE?t=1m29s). For prizes we have a variety of stuffed animals, from tigers to Weiner dogs. Our largest prizes are these 3ft tall giraffes that are really unstable and fall over a lot, but the smaller ones tend to stay up very well. As part of my duties I also have to watch over the clown slingshot game on the other side of the wall, but you don't need to know the ins and outs of that for this story. \n\nWhen I first came in to work the area is a disaster. Every single ring is on the rack (there are 200 of them), a few giraffes have fallen over, one shelf is completely empty, part of the siding that had been coming loose is now completely off, ammo from the clown game is all over the floor, and an entire row of bottles has dominoed over. This row happens to be the middle one, requiring a delicate act with the hook. The whole thing takes an hour and a half to clean up, and we're just getting started. \n\nDue to inventory issues the majority of the restocking delivery is for the clown game, even though the ring toss is missing an entire shelf of prizes. My manager suggests spreading the prizes out to make it look like there are more of them. This is a good idea, but moving prizes on the back shelves involves moving the storage buckets, climbing up on the rack, tiptoeing around the giant unstable giraffes, and then climbing back down within 30s to make sure nobody has lined up at the clown game while you couldn't see it. To make matters worse I had put the storage buckets on the counter and a curious 3 year old was grabbing handfuls of rings and throwing them at random people; I had to leap off the rack and over the counter to go chase all the stray rings. I'm also handing out rings to people with essentially no time to clean, meaning that after I was finished with that I had 150 rings to deal with. \n\nAnd then the wind started to pick up. \n\nI was on the floor hooking rings when a smaller giraffe was blown off a ceiling shelf and landed on the bottles.  It was followed by several tigers and a Weiner dog, 3 of which bounced off the counter and rolled away. The entirety of the shelf I had meticulously rearranged prizes to fell off and landed on top of me. Every single one of the giant giraffes keeled over and wiped out row after row of bottles. One of them hit the card reader and knocked it off the wall. I had to run after escapees, fish stuffed animals out of the rack, restore bottle formation, collect rings, engage with customers, and wrangle with a dying card reader all at the same time with more disaster coming with every gust of wind. I gave up returning stuffed animals to their places and started piling them in the clown game. After a while I had managed to get all the rings out of the rack and close the overhead gate on one side to block more wind just in time for my  shift to end. \n\nTL;DR Wind caused a stuffed animal avalanche. ",
        "created_utc": 1498573487,
        "upvote_ratio": ""
    },
    {
        "title": "Technical Staffing &amp; Recruiting World:1",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6joksv/technical_staffing_recruiting_world1/",
        "text": "[deleted]",
        "created_utc": 1498516970,
        "upvote_ratio": ""
    },
    {
        "title": "Technical Staffing &amp; Recruiting World:Background",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6jn6aq/technical_staffing_recruiting_worldbackground/",
        "text": "[deleted]",
        "created_utc": 1498503667,
        "upvote_ratio": ""
    },
    {
        "title": "Fired a few times,always bullshit",
        "author": "BlondieMonster89",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6j6k6f/fired_a_few_timesalways_bullshit/",
        "text": "I know what you're thinking. Yeah right, totally not your fault right? Bullshit. Well I have some interesting, well maybe   not interesting but personally infuriating stories revolving around the couple of times I have been fired. I usually carry that weight around with me like a sack of burning coals that fry through skin down to the bone. Letting the anger really get to me, from time to time I have fantasies about certain restaurants I have worked for completely burning to the ground with everyone inside of them but I try to keep that to myself. Try to. I do get myself into trouble from time to time, hence me making a Reddit account.\n\nA little backstory, I grew up in a chaotic environment and around age 14 or so I was diagnosed with anxiety and depression. Not fun, but hey I didn't kill myself right? Here I am. Fat but I lost the weight anxious but I learn to get through it. After many years of unemployment, what felt like many years anyways, I got a job working in very popular local bar and restaurant. As a Busser. Where is my ass off and worked my ass through crippling shyness and anxiety to the point where I was becoming a valued employee yet no one would promote me to being a waitress. I needed to make more money and honestly I was tired of doing the bitch work. A certain manager lied to me and told me that I was set to be on the schedule to start serving and that I would receive training all of that fun stuff. After repeated questioning it turned out that that was not true, I have no idea why he was telling me that. At this particular restaurant there were three managers and apparently one of them was not so convinced of my ability to bring shit from the kitchen to a table. Long story short I got a job working as a waitress elsewhere in town and I tried to juggle both. I told my current manager, he said we will get through it and work with me, needless to say that did not happen. I was fired right before St. Patrick's Day for not prioritizing the company they didn't give a shit about the hard work I had put in. Yay. Not a total disaster as hey, I already had that other job and now I could tell them that I could work more hours. \n\nI ended up working for this place for over a year. Great money. Hectic hours, always understaffed and loads and loads of bullshit made every day a little more stressful than the one before. At this time I was doing a lot of live streaming on my Facebook, usually just silly stuff. One day I made a little video probably was  about 30 seconds long talking about how I hope no one was planning on coming into clock tower ales because you were looking at at least a 45 minute wait for your salads and nobody gives a shit.\nEmployees that would win employee of the month or rude as fuck, had absolutely no manners, or sense of personal hygiene, people were smoking pot on the job later on in employee was getting wasted on the job yada yada yada a fucking shit show.\n\nSo if you employees saw my little video and shared it with the boss. No shit, my bad but everything I said was the truth so in the and I didn't give a fuck. And how do they deal with this? My manager texted me for three days in a row saying that they didn't need me to come in. That was it that they didn't need me for that particular shift. After three days I texted them and ask them what the fuck was up and she said \"you haven't been here the past couple days so I'm going to take that as you quit\" \n\nYAAAAAY . Anyways at this point in time I had already got another job, working for a lovely French bakery and brunch spot in town. I started working there at the request of one of the waitresses who was constantly pestering me to apply, after a year I finally did. I really liked working there. Shortly after I began seeing a doctor for my anxiety and depression and those fucking geniuses put me on Paxil.  It nearly ruined my life. Pack soul made me a completely anxious vessel. I stop seeing my boyfriend for weeks and weeks and weeks I was afraid to leave the house, my energy was zapped and I was frequently depressed. I also gained about 15 pounds. I wholeheartedly agree that it is a piece of shit drug and that no one should take it. It caused me to make decisions that I never would have made if I hadn't have been on that drug, and honestly to think of it I am extremely upset at my doctors for them ever deciding to put me on this. It was so bad that I didn't even care about getting out of bed on a lot of days, of course I was fired after that because there were days when I was nearly suicidal laying in bed with no care for anything.\n\nNot fun. I soon got off the drug, quickly transferring onto Zoloft. I did all of this my first week of starting a new job at Starbucks, they are a great company and they really do take care of their employees and my boss likes me. The only thing is I fucking hated standing in a goddamn counter for hours. Now none of this is particularly interesting I just wanted to get this out tonight. I just kind of wanted to put it all in one spot. There are better things I can say and better stories I can talk about but I just wanted to vent here instead of having this history of bullshit in my head. Good night\n",
        "created_utc": 1498282800,
        "upvote_ratio": ""
    },
    {
        "title": "When You Lie, You Pay",
        "author": "_Pebcak_",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6iobrx/when_you_lie_you_pay/",
        "text": "I used to work at a nation-wide bank as a teller. This is just one of the many, many stupid stories of the nightmare that was that job.\n\nFYI - In my branch, each teller had her own station. Nobody else would ever sit there, and if she was on vacation or working in the drive through, it would be empty. (The drive through stations were the only shared stations.) For this particular story, I am in the drive through, and my lobby station is empty; the only empty station at that time.\n\nA lady comes in trying to order 30 money orders, which can be free, but that depends on the type of account you have. Yes, it is within our power to waive the fee anyway and I never, ever have a problem doing that unless someone is being a jerk. Spoiler Alert: This lady does not have the \"free money order\" type of account.\n\nM=Me, L=Lady, TM=Teller Manager\n\n\nL: *(Nasty, whining voice)* What do you mean the money orders are $5.00 each? I was here last week getting the same thing, and I got them all for free!\n\nM: *Innocently working in the drive through, hearing all of this happening behind me, and generally curious which customer was having the unfortunate luck of having to deal with TM.*\n\nTM: Do you know who it was that helped you? I can talk to her and see what's going on.\n\nL: Of course I do, it was the woman who sits down there in that empty station. *(At the point, I turn around to look at the lady, and also take a waiting customer in lobby.)*\n\nTM: *Makes brief eye contact with me.*  Okay, can you describe the person who sat there?\n\nL: Yes. She was older, had grey hair, and was a bigger lady. (I am not any of these things.)\n\nM: *Finishes up helping lobby customer and turns now to fully give my attention to that lady. Lady looks at me and continues trying to describe not-me.* I'm sorry, Lady, but I am the only one who sits at that desk and I have never given you free money orders before.\n\nAt this point, Lady turns bright red, stops complaining, and pays her bill, fees included, then leaves. Never saw her again.",
        "created_utc": 1498074852,
        "upvote_ratio": ""
    },
    {
        "title": "My boss almost killed my coworker",
        "author": "wuliten",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6ijm5x/my_boss_almost_killed_my_coworker/",
        "text": "This is a story from... Maybe 7 years ago, give or take a couple years. We had a manager who was kind of short, but built like a dwarf. I mean the race from the fantasy genre. All muscles because he was a bit of a body builder. I had a coworker who was even shorter and built like a twig. They had an odd relationship, and it included him feeding her his beer when she was only 16. But stories for another day there.\n\n\nShe liked to pretend attack him and then run away. One day, she came up from behind and went to kick him playfully. I guess he'd been doing some self defense classes, and instinct kicked in. He grabbed her leg and lifted. She went in the air and did a complete 180. Landed on the top of her spine where it meets the neck on our concrete floor. The manager was sure he was going to get arrested, but she said she was fine. She also said she was seeing double for the rest of the night, but who am I to judge?",
        "created_utc": 1498020391,
        "upvote_ratio": ""
    },
    {
        "title": "Your Child's Size",
        "author": "burgerpantz",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6i8b1l/your_childs_size/",
        "text": "Probably not as frustrating as some of the other things going on here, but it was frustrating for me.\n\nI work as a warm body in the mornings for a small local summer camp, and also handle new enrollments. When kids haven't had paperwork filled out about them, parents do so when their child comes in. We give the kids tshirts, which is relevant.\n\nToday, a dad is filling out paperwork on his two kids and looks me dead in the face and asks \"What size is [son]?\"\n\nUh, what?\n\nThe guy wanted me to tell him what size tshirt he wears, when the kid is wearing a tshirt and I've never seen him before. When I said \"I'm not sure\" he looked ten kinds of annoyed.\n\nYou're an adult, buddy, and he's your kid. Know his size, don't ask the counselor something you should know. ",
        "created_utc": 1497896768,
        "upvote_ratio": ""
    },
    {
        "title": "Change",
        "author": "ironmaidenfan92",
        "url": "http://imgur.com/a/GXi1J",
        "text": "",
        "created_utc": 1497881739,
        "upvote_ratio": ""
    },
    {
        "title": "You're Killing Me",
        "author": "wuliten",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6hib39/youre_killing_me/",
        "text": "We're gonna switch it up a bit with a quick tale from my wife's time in retail. Once upon a time, when we were struggling, broke, and not yet married, she worked two retail jobs. I only worked one because I was a manager and needed open availability. She worked at a department store (job A) and a discount clothes/home goods (job B) store that were right next to each other. The discount store was the worse of the two. Weird scheduling, not consulting her hours from her main job, open until 2am for some awful reason.\nOne night she was closing at job B, she became very ill. Coughing, wheezing, could barely breathe or stand. They refused to let her leave despite it being dead from 11-2. Literally 2 customers. The next day she called in at job A and went to the doctor. It was full fledged pneumonia. Doctor told her to take a couple of the weeks off, here's your note, drink your fluids. Job A was pretty okay with it. She was brand new and they still accommodated her. Job B...\nWhen she called to tell them, her manager's exact words were \"Your killing me, wuliten's wife.\"\nShe never went back to that job. She found an office job at an HVAC company that paid more, and was a year of hell, but those are probably stories for another sub.\nThe icing on the cake came a month later. At some point, her boss from job B came into job A while my wife was working. They saw her, she saw them, and they awkwardly avoided each other. A week after, job B called and said something along the lines of \"We haven't seen you at work in a while, we were wondering if you wanted some hours next week.\"",
        "created_utc": 1497564171,
        "upvote_ratio": ""
    },
    {
        "title": "DAE get blamed for things that happen after doing exactly what your boss told you to do? By the boss himself/herself?",
        "author": "ojisan-X",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6hi3z2/dae_get_blamed_for_things_that_happen_after_doing/",
        "text": "...and even worse is when you point it out, they act disgusted and spin it in way that it's still your fault.\n\nEDIT: For those saying keeping something written will save me, here are my boss's favorite lines: \"you take things too literally\" and \"things evolve over time.\"  Saying that I did what she asked and showing her records of it has NEVER worked.",
        "created_utc": 1497562210,
        "upvote_ratio": ""
    },
    {
        "title": "Closed Area Tales, part 7: Wasteland and Six Sigma",
        "author": "aqutalion",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6hcsmd/closed_area_tales_part_7_wasteland_and_six_sigma/",
        "text": "If I ever meet the person responsible for Six Sigma, I will kick them in the shins. I will kick them in the shins *so hard.*\n\nFor those of you who have avoided dealing with this nonsense, a little background. It's meant to be a sorta-crowd-sourced system for increasing efficiency in the workplace. The idea is, someone sees some process or system that could be improved, develops a way to improve it, and submits it. The company then adopts the change and becomes that much more efficient. Maybe someone notices that they're running the TPS query for multiple reports, and figures running it once for the first one and having all reports link to those results would cut down on server load.\n\nOn paper, this seems great. Everyone's doing little improvements, and they all add up. Awesome, right?\n\nThe problem is that this system is used by large companies, full of red tape and bureaucracy. Processes must be followed, and trying to push through all these little changes just creates more red tape to wade through.\n\nWasteland had a rule that all their employees had to have at least one Six Sigma project under their belt within a certain period of time, and my deadline was approaching. I was on the lookout for something- anything- that I could improve on. Inspiration finally came when I was updating some test data. I was doing basically entering the same data for all the tests, by hand since there was no tool to do it. The programmer in me figured that this nonsense ought to be automated.\n\nSo I submit this. My boss thinks it's a good project, but I have to follow the Six Sigma process. For efficiency.\n\nFirst is writing up a proposal, stating the problem, my solution and how my solution was to be implemented and tested. Standard stuff, so far.\n\nMy solution was to write a script that would do the duplicated data automatically. But I couldn't write the actual script, because the database used a proprietary programming language, and only the DB developers were allowed to program stuff for it. So what to do? I wrote up the algorithm I had in mind in pseudo-code and submitted it with the proposal, but procedure required that I test it somehow. For efficiency.\n\nYes, I had to officially test whether doing something by hand was slower than automating it. For efficiency. But how to do this if I couldn't program something for the actual database? The answer turned out to be \"fake it\". I mocked up a fake DB on my local machine, and wrote a fake program to do the fake updates to my fake DB.\n\nAnd how to time it? My boss, who was probably as irritated with this nonsense as I was, said to time it with my watch and they'd just take my word for it. Apparently, efficiency needs to be tested, but not verified. Had I not been mostly honest, I could probably have faked the whole thing, but I actually went through with it. I ran my update program, then did the exact same updates by hand, and timed them both. I wrote up these times and submitted them with my report. *For efficiency.*\n\nSo the project was accepted, and now it was time to implement it. As I said earlier, only the DB developers were allowed to program actual DB scripts. I begged and pleaded to be able to write the thing. It would have taken me maybe 10 minutes, 15 if we leave time for testing. But it was not to be. Policy had to be followed, and policy stated that only the DB devs could make this change. All I could do was submit the project and hope it eventually made it to the right people. **For motherfucking efficiency!**\n\n**Six months later,** I was still updating the test data manually. I don't know what happened to my project, and eventually I stopped caring. Once it was submitted, I got credit for it and was rewarded with a Wasteland Six Sigma polo shirt and a certificate that I probably lost. Wasteland didn't care whether your change was implemented, only that you submitted it and followed procedure. Essentially, it was busy-work for its own sake, the exact opposite of what Six Sigma claims to be.\n\nI could have fixed it in ten minutes, but because we had to follow the Six Sigma process, it was drawn out for at least a year, and may have fallen through the cracks, resulting in wasted work and time. **EFFICIENCY!**",
        "created_utc": 1497500604,
        "upvote_ratio": ""
    },
    {
        "title": "PSA: If you have full-coverage insurance on your car, please don't call AAA when you're in an accident that requires a tow truck!",
        "author": "henrytm82",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6h91ik/psa_if_you_have_fullcoverage_insurance_on_your/",
        "text": "I was going through some old pictures on my phone, and I came across one from back when I was a tow truck operator, and thought I'd share a story, and a little friendly advice.\n\n--\n\nThe towing business I worked for is a small, local business, and they have a contract with AAA. Any calls in my town from AAA customers go straight to this towing business - they don't pay much (peanuts, really), but usually they make up for the lack of payment with volume. $7 for a tire change or a jump start isn't much, but it adds up when you do 150 of them in an afternoon. Because of that, we were happy to do AAA calls and help them out when they needed us. But AAA is supposed to be for basic services - your car breaks down, we'll tow you to a nearby shop. Your battery dies, we'll jump you. You lock your keys in the car, we'll get it open. Things like that. It's not meant for major, catastrophic things that should normally be handled by insurance. Which brings us to the story...\n\n--\n\nIt was the middle of December in the midwest, and it was *cold*. There wasn't any snow on the ground yet, but the wind was biting and it was miserable outside in the middle of the night. I was on-call for $WreckerService, and got a call about 1 in the morning - pretty common for our college town, we tended to get a lot of calls as the bars are closing down. Usually it was the police calling me at this hour, but tonight it was AAA. They've got a customer who was in a \"fender bender\" (their words) and needed a tow to the body shop. Alright, no problem! I'll grab them real quick and be home in no time, as they're just on the other side of town from me.\n\n--\n\nI head over to the scene, and the cops and firefighters are finishing up and leaving for the evening. [I immediately knew that this wasn't going to be a quick, simple \"fender bender\"](http://imgur.com/a/s5LuV) grab when I pulled up and found a Jeep Cherokee parked in the back seat of a Kia. Literally - the front wheels and oil pan of the Jeep were resting on the Kia's back seat, the rear windshield and back end of the roof having been peeled away like a sardine can. Thankfully, nobody was seriously hurt - the Kia had been parked on the street, and the girl driving the Jeep (drunk) had been checked out and arrested.\n\n--\n\nI approached the owner of the Jeep - the girl's dad - and started discussing what he wanted done with the Jeep. It was going to the body shop for repairs. Our conversation went like this:\n\nMe: \"Do you have full coverage insurance on the Jeep?\"\n\nDad: \"Yes.\"\n\nMe: \"So insurance is paying for the repairs?\"\n\nDad: \"Right.\"\n\nMe: \"Okay, well then why don't I cancel your AAA ticket and save you one of your annual tows - I'll charge the cost of the tow to the shop, who will simply add it to the bill they send to insurance. You won't have to pay me anything at all, and you can save your tow.\"\n\nDad: \"No, it's okay, I've used AAA for accidents before.\"\n\n--\n\nGuys. *Guys*. Please don't do that. What I was trying to get across to this guy, without blatantly shoving it in his face that it was about money, is that it was about money. You see, if I'd been allowed to claim the tow as a cash call, and bill the body shop (who would in turn bill insurance), I would have charged around $300. \n\n--\n\nNow, that might sound a little high, but look at it like this: it's 1 in the morning in December in the Midwest - it's about two fucking degrees outside. I'm tired, I'm cold, and I've got some work ahead of me. I have to separate these two vehicles while trying not to cause any extra damage to them. I have to clean up the accident scene - I have to wander around in the dark, picking up the pieces of the cars that have gone flying everywhere, cleaning up all the debris and broken glass spread all over the road, cleaning up all the spilled fluids. Then I've got to drive out of town to the body shop their insurance wants to use to unload it into their lot. I'm not going to make it home until some time after 2 in the morning - before 3, if I'm lucky. For doing all the hard, miserable work in the wee hours of the night, I get to charge a premium - but **only** if I get to charge cash prices. It's also important to note that, during on-call hours, I don't get paid hourly - I work on commission. For calls that we charge cash prices for, I make 25% of the ticket, so for this call I stood to take home $75 for my trouble, before taxes. Now, that isn't bad, but, again, I'm only making that much money *if* I can charge the cash price.\n\n--\n\nBut dude is insisting on keeping this a AAA call, which means a *lot* less money for $WreckerService and myself. For the same amount of work and time, AAA is going to pay $56 to $WreckerService, of which I will make 35% (we were given a higher percentage of AAA calls to help offset how much less the calls were worth). That's $19 before taxes. That feels a *lot less* worth my effort.\n\n--\n\nI tried politely to talk the guy into letting me close the AAA ticket and charging it to insurance, but he's not having it. So I did my job, got the cars separated, got everything cleaned up, got his Jeep to the shop, and got home at about 2:45 in the morning, dirty, cold, and pissed off because I just missed out on two hours of sleep so that I could bring home enough money for lunch at McDonald's.\n\n--\n\nGuys. Do your tow-truck driver a favor, and don't screw him over. If you're in a major accident and repairs on your vehicle are covered by insurance, your tow is part of that total bill. If you call AAA, you are not doing anyone any favors. By all means, call them when you need them, but be smart.",
        "created_utc": 1497461547,
        "upvote_ratio": ""
    },
    {
        "title": "I'm retarded.",
        "author": "-Sacs",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6h8dxq/im_retarded/",
        "text": "I drive a garbage truck, and there is this small island I drive through once a week. So I was about to empty a container, and some old man approaches me with a plastic bag. I see some cans through the bag, and I tell him I don't really take cans. He says \"Oh, you don't drink beer?\" I chuckle lightly and say \"I do, but... Ah, I guess it's fine\" I take the bag and throw it in to the garbage chute and continue with the work. We converse while I'm emptying the container, and he is talking about how much he appreciates the work we do (food waste is fucking disgusting). I finish up and continue on with the route. Afterwards, I thought it was kind of odd how he would want to throw away a bunch of unopened cans of beer. Then it hit me... This nice old man came to offer me a bunch of beer as a token of appreciation for the work I do, which I then proceeded to throw right away...\nI feel fucking ashamed...\nI think he knew that I miss understood his gesture, but I still feel awful about it. I hope\n I'll get the chance to clear things up.\n",
        "created_utc": 1497455674,
        "upvote_ratio": ""
    },
    {
        "title": "Brutal e-mail",
        "author": "math_rand_dude",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6g794t/brutal_email/",
        "text": "A few years ago I've send a mail to some people (including my first boss in that company; I had 4 direct bosses)\n\nIt didn't get me fired and y boss as still the same aftwards. (I was let go a few years later due to reorganisations)\n\n\nCharacters:\n\n$me: me\n\n$Mgr: Manager\n\n$WannabeMgr: Mgr unofficial Lieutenant\n\n$co: coworker, like me he's the only person from the team in his respective country\n\n$hell: company I worked for\n\n$GovOrg: Government of biggest region in my country, biggest client (or set of clients) for $hell in my country.\n\n$scotsman: a coworker (not in my team) working in my country who knows $GovOrg and isn't afraid of asking difficult questions. His job: finding out how we can improve the way we approach $GovOrg.\n\n\n---------------------------------------\n\n\n\nFrom: \"$me\" &lt;$me@$hell.portal&gt;\n\nDate:\n\nTo: \"$co\" &lt;$co@$hell.portal&gt;,\"$wannabeMgr\" &lt;$wannabeMgr@$hell.portal&gt;\n\nCc: \"Curran, $Mgr\" &lt;$Mgr@$hell.portal&gt;\n\nSubject: RE: technology stack\n\n\n\n\nHi $Mgr, $wannabeMgr and $co,\n\n \n\nTbh,\n\nOnly problem I see with $scotsman is he’s pretty good at pointing out the issues.\n\nThe task he’s been given is to get some clarity on the mobility field so we can approach the $GovOrg with a clear $hell united front.\n\nSo far most answers to questions that were asked in $country that have been given by our team are way too indirect.\n\nI’m getting tired of having to give people BS answers because our team doesn’t have its stuff together instead of straight answers.\n\n \n\nI’ll put the risk more clearly:\n\nIf we don’t start giving solid answers we risk not becoming the primary delivery organization for the $GovOrg. (And I don’t need to remind you that’s the biggest account for $hell $MyCountry.)\n\n \n\nAnd $co, $scotsman IS NOT THE PROBLEM. He’s a guy who has even less patience for political BS cover-your-own-ass games then I have. (He’s a technical guy who needs to make things happen on $GovClient level.)\n\n \n\n\nCURRENT PROBLEMS:\n\n\n    ·        My big mouth while venting frustrations\n\n\n    ·        Me being pretty junior expected to take quite some responsibility with often slow feedback\n\n\n    ·        $Mgr is busy doing who-knows-what instead of\n\n                             o   deciding on ONE strategy,\n\n                             o   sticking to it\n\n                             o   appointing people to make it happen\n\n                             o    creating an organogram so we can see who does what\n\n\n    ·        $Mgr saying “good idea” or “we’ll do that” and then not following up on it or not giving people clear instructions to do that, which ends up in $Mgr thinking half a second later that it has been done and finished\n\n\n    ·        $co judging $scotsman without knowing the guy (everyone says we could use some local guidance for me, well $scotsman helped me out on multiple occasions and I detest seeing a personal attack like that.)\n\n\n    ·        Our team existing 2 years and still not having a proper foundation or enough maturity\n\n\n    ·        Too little or to many standards (barely any general rules within the team, except some half-baked stuff.)\n\n\n    ·        All different stuff being started while not being properly finished\n\n\n    ·        A lot of people giving BS answers and ppt/presentations instead of getting to the point\n\n\n    ·        A big part of each team meeting is often used for sales talk instead of a short overview of where we stand.\n\n\n    ·        The zombie-factor: if someone requests input from the team, only a select few will give feedback (unless you drag it out.)\n\n \n\nI know this mail’s been brutal, and it’s intended to be so hopefully some of the problems will finally be handled by the ones who got the power to make the necessary changes.\n\n\nI don’t need nor want a reply with promises; I need to see the problems being solved. And don’t propose to set up meetings to talk on how to solve the issues we have, just solve them.\n\n\n \n\nRegards,\n\n$me\n\n$CoorporateSignature\n\n\n\n\n\nedits: formatting\n",
        "created_utc": 1496998766,
        "upvote_ratio": ""
    },
    {
        "title": "Closed Area Tales, part 6: Wasteland and the Security Glitches",
        "author": "aqutalion",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6g5kkw/closed_area_tales_part_6_wasteland_and_the/",
        "text": "A few teething troubles are to be expected with a new building. A few. Wasteland's new building had more than a few.\n\nOur closed area had two exits, the main one and the emergency exit. They were only about 50 feet from each other and on the same hallway, so I'm not sure what advantage there was to this arrangement. For the first few days, the security company kept getting alerts that people were going through the emergency exit. All our cubicles had a good view of this door, and that wasn't happening. Eventually, they determined that the wires had been crossed up with the door next to it, the main entrance to another project's closed area.\n\nBut the main door had problems, too. By this time, I'd been at Wasteland long enough to finally have the ability to lock the closed area, myself. The first time I tried to close up the lab, the lock wouldn't arm, no matter what I did. That meant I couldn't leave, as we're not allowed to leave the lab unlocked and unattended. I asked the security guard, and even he didn't know what to do about it. Apparently, he'd tried to get his boss to tell him how to work the alarms, but got yelled at for \"trying to tell the customer how to do their job\". Maybe I'm clueless, but I'd think that knowing how to lock the doors and arm and disarm the alarms would by an important part of the guard's job. And that begs the question of what to do if the last person out didn't have the door combo. We had to call the guy's boss at home and have him drive over and deal with it. He wasn't happy. Neither was I, since it made me miss karate class.\n\nThat wasn't the last problem with the door. The first issue got solved, but as time went on, it started simply not locking. This was worse than before, because the system would register it being locked and armed, but the lock wouldn't actually engage. If you didn't physically check the door after locking it, you'd never know it had failed. This happened to me, once, and I got written up for leaving the lab unlocked. They weren't kidding about this stuff- a cubicle neighbor actually got fired when she left it unlocked three times.\n\nThey eventually figured out what the problem was. The closed areas' doors were metal things with heavy-duty locks installed. They were unusually heavy, and the builders had installed them on frames for ordinary doors. Over time, the extra weight warped the frame enough that the lock no longer lined up.\n\nBut I haven't gotten to the biggest security glitch, yet. Our closed area had windows. No, not the operating system. Actual panes of glass in the wall that people can see through.\n\nBut our lab was on the second floor and you'd have to scale the wall to see inside, right? Nope! While waiting with the security guard for the supervisor to come deal with the non-arming alarm, he told me a story about another facility he'd worked at. They'd had a closed area with windows, too. Every so often, they'd see little flashes of light out in the woods by the building. Someone eventually investigated this and found that the flashes were from cameras. People were setting up outside with huge telescopic lenses, taking pictures of the computer screens inside the lab.\n\nFortunately, our lab kept the classified laptops in a separate, windowless alcove (no vault, this time, alas), and everyone had enough sense to turn their monitors away from the windows. But that's not the end of the problem. People aren't always after specific information. Sometimes they're looking for patterns. Metadata.\n\nAs an example of this, my mother once had a conversation with the guy who picked up our recycling, and he said that he could always tell when the college students were back home by the contents of the recycling bins. If a bin that usually only contains Diet Coke cans suddenly starts overflowing with a truly superhuman amount of Dr. Pepper cans, you can infer that there's now another person in the house.\n\nThis sort of thing is why people tell you to stop your mail and such if you'll be away from home for a while. Patterns, and deviations from those patterns, can be useful information.\n\nIn this case, they'd be able to see who was first in or last out of the lab (and therefore who could lock/unlock the door), who regularly went in the classified alcove, who had access to the safes (and with a good enough lens, they might have been able to see the combo). By watching who talked with whom and when, they could discern the chain of command. They wouldn't be able to get any information directly, but they'd know who to target to get it.\n\nAnd this was apparently a real concern, if the yearly spies-are-bad-don't-be-a-spy-mmkay presentations are to be believed. According to one of them, AquVille ranked 4th in the country for foreign espionage activity. I'm not sure I believe it's that high up, but it was still an issue. We had to sit through multiple presentations and training videos on OPSEC on how to avoid being a target. Things like not wearing our lanyards after work so people wouldn't know what project we were working on, or the army base discontinuing the vehicle decals so the cars aren't marked as targets. I'm probably breaking a few rules by posting this, but all the information I have about Stonehenge or Wasteland is years out of date, so targeting me won't be useful. Sorry, spies!\n\nWe actually had a scare, not long after we moved in. Some people reported that there was a mysterious black truck always parked across from the building, that at least once, appeared to be following people home. Management sent out a cautionary email, letting us know what to look for.\n\nKeep in mind, the lot across from ours, where the truck was supposedly parked, was still under construction, at the time. It's very possible that it was just a case of a construction worker having a particularly creepy-looking truck and taking the same route to the highway as the majority of the cubicle-dwellers in the office park. But because it was also possible that it could be someone looking to target Wasteland employees, we all had to be extra careful for a couple of weeks. I never saw the truck, myself, so I can't say which it was.\n\nThe windows were fixed by the addition of some blinds, which we were instructed to keep closed at all times.",
        "created_utc": 1496974513,
        "upvote_ratio": ""
    },
    {
        "title": "You don't have to love your job to find it meaningful",
        "author": "dacracot",
        "url": "https://qz.com/999209/how-some-people-stay-motivated-and-energized-at-work-even-when-they-dont-love-their-jobs/",
        "text": "",
        "created_utc": 1496760243,
        "upvote_ratio": ""
    },
    {
        "title": "[X-post from /r/jobs] It's been almost 10 years since my manager tried to fight me",
        "author": "Eshyj",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6fgfix/xpost_from_rjobs_its_been_almost_10_years_since/",
        "text": "When I was 18 I worked at a Mediterranean restaurant, the workers were nice and the staff was great. \n\nOne issue though, the Owner/Manager was an absolute control freak. He also had deeply held religious beliefs that he brought into the work place. Two examples were that males were strictly not allowed to speak to females unless it was work related, and he would berate you if he found out you drank alcohol.\n\nNaturally I thought that was a load of bull because last I checked this was America and as long as it's not illegal, I'm allowed to do what I want and be friends with who I want.\n\nWell the manager found out I was friends with a female at work and asked to talk to me behind the restaurant. He got in my face saying, \"You don't like the way I do things motherfucker, you have a problem with me?\"\n\nThen he squares up and says, \"If you want to talk shit about me we can handle this...\" \n\nI looked at him like he was stupid, took off my apron and work shirt, and walked away. He yelled asking where the fuck I thought I was going. I said \"home\" and as I was leaving he yelled that I HAD to cover my shift. Not my problem asshole.\n\nI left and never looked back, currently about to start college after 5 years in the military, been working in IT for about 8 years now.\n\nMoral of the story, don't let assholes walk all over you. Stand up for yourself, you can do better.",
        "created_utc": 1496690655,
        "upvote_ratio": ""
    },
    {
        "title": "Closed Area Tales, part 5: Wasteland's New Building",
        "author": "aqutalion",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6fc82l/closed_area_tales_part_5_wastelands_new_building/",
        "text": "Not long after I started there, Wasteland started building its own building in the AquVille's trendy new office park. Just about every decent-size company in AquVille eventually had a facility in this park, including Missiles-R-Us and several others, most of which I've either interviewed with or worked for at some point. But not NotRockets, oddly enough.\n\nAs an aside, this office park is a bit creepy, even today. It's huge, the lots are huge, and it was built right when the economy started to sink into the toilet. Not surprisingly, there weren't too many companies willing to shell out for oversize land parcels and shiny new buildings in the middle of a recession. This left many lots empty. If you drive around, you'll see a lot of empty space, with road turn-ins that go nowhere and ghost-town cul-de-sacs. Some of the lots were leased to farmers, rather than let them go empty, so there's often crops growing right next to the offices. Add in the fact that every building seems to have overestimated the amount of parking they'll need, and evenings that are prone to fog, and it looks like you're basically all alone in the world. The mysterious unidentified buzzing noise from the totally-not-an-evil-villain-compound in the center doesn't help.\n\nThey had a big to-do about the groundbreaking for the site. The state's governor even came to it and made a speech. I had a bit of a chuckle when he described the office park as a \"national treasure\". It's an office park! In a town where you can't swing a stick without hitting half a dozen office parks (at least two of which I've worked in)! Okay, he actually meant the stuff being done in the office park, not the park, itself, but still. There's an honest-to-goodness *moon rocket* across the street, and you're going on about an office park. Only in this state.\n\nManagement hyped the new building to the moon and back. It would be environmentally friendly! Look at all the new amenities! A cafeteria! A fitness center! An atrium! Ergonomic things all over the place! Multiple closed areas! Decent vending machines! More parking! NotRockets had had a cafeteria and fitness center, too, and that was really the only thing about them that I missed, so I was looking forward to the new place.\n\nEventually, moving day came, and that was when the fun started.\n\nThey'd been at the current facility for several years, and as anyone who's ever moved house can testify to, stuff accumulates. I had it pretty easy. I hadn't been there long, and wasn't in the habit of keeping lots of stuff in the office, anyway. There was a bookshelf full of mysterious binders that had been left there by the office's previous occupant, and a filing cabinet I'd never even looked in. No one could identify what the contents were for. I had to empty them all out and shred the contents.\n\nThe document destruction company had dropped off several shred bins (locked bins that you can put documents into but not remove them), but these filled up before noon. We dumped the overflow into some big trash bins, but these filled up, too. There was a pile literally as tall as I am of paper waiting to be shredded. They probably made a mint that day.\n\nWe all had junk to throw out, and the hallway was soon overflowing with trash. The veteran ubertechie down the hall had it the worst. He'd been there as long as Wasteland had been at that facility. The pile outside his office was nearly blocking the hallway, and was almost as tall as me. I took a look though it, just to see what the heck it all was. Floppy disks, backup tapes, Zip disks, Jaz disks (ask your parents, kids), PC cards, software boxes dating back to the mid-90's, SCSI cables, serial cables, various other cables I couldn't identify, what might have been RAM chips. I suspect if I dug through the pile I might have found punchcards or UNIVAC parts (ask your grandparents, kids).\n\nBy the way, moving day was on a Wednesday. We weren't going to be able to get into our new building until Monday. That meant we either had to use up vacation days or work in the conference room of some other facility. I tried the conference room, but as it wasn't connected to the network I needed, I couldn't do much. I had to borrow a couple of vacation days from the next year to make up the time (thanks, jerks).\n\nWhen Monday came, we could at least get into the building. The cafeteria wasn't open, the fitness center wasn't open, the parking lot wasn't completely paved, and not all the cubicles had power. But they at least made sure the security system was in place and working before putting the classified stuff inside, right?\n\nSpoiler alert: No.",
        "created_utc": 1496639393,
        "upvote_ratio": ""
    },
    {
        "title": "Zipped, copied, and zipped a computer nearly to death then returned 2 years later to fix my dumb teenage entertainment.",
        "author": "Duzzeno",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6ev2o8/zipped_copied_and_zipped_a_computer_nearly_to/",
        "text": "Several years ago I was a teenager and landed a job working for small group who's main job was to entertain the seniors in my small town.\n\nThe job was mostly going to be creating bristol board posters and creating several written documents but fortunately my new boss purchased a laptop specifically for my position.\n\nI quickly found out that my not really tech-savy new boss had overestimated my workload so I was frequently left to do \"research\" on the new computer. Normally this would just be permission to slack off but since the computer didn't have an internet connection, my entertainment options were limited.\n\nPinball either didn't work or wasn't on there, Solitaire quickly became boring, I taught myself how to minesweeper for a few days, and Microsoft Word's Clippy became my only company.\n\nEventually I decided I would try to take up as much space as possible on the computer by creating a folder, copying the folder multiple times, zipping the copied folders, and repeating. I would also occasionally give the files a random extension so anyone else using the computer wouldn't prematurely delete my cartoon monstrosity before I had a chance to fill up the PC. Dumb, I know, but after a few days of realizing how big it was getting it became a mildly entertaining challenge. \n\nNear the end of my job I had managed to fill up about 75% of the laptops memory with my giant garbage file and was feeling rather accomplished. Unfortunately my boss saw how bored I was and found some field work for me to do to finish out my job. The work was distracting enough that I had completely forgotten about the garbage file.\n\nAround two years later I was visiting home and I bump into my old boss. We have a chat and eventually she mentions how her work laptop wasn't working. Being the resident nerd in town I offer to give it a once over. I show up to her house and see that it's the same laptop I had used and remember my giant garbage file. I delete the file, restart and see the computer is running properly and feel horrible that my little bit of entertainment had been slowing her computer down so much this whole time. I proceed to do an honest check up (Cookies, updates, defragmented, virus scan) since I feel I owe her and she thanks me for \"souping up\" her computer. \n\nI still felt a little bad but was happy to fix the problem I had caused.",
        "created_utc": 1496417350,
        "upvote_ratio": ""
    },
    {
        "title": "Closed Area Tales, part 4: Wasteland and the Classified Safe",
        "author": "aqutalion",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6ess3k/closed_area_tales_part_4_wasteland_and_the/",
        "text": "[Previous post](https://np.reddit.com/r/talesfromthejob/comments/6ecr28/closed_area_tales_part_3_wasteland_and_the_vault/?st=j3fhelhy&amp;sh=217324f2)\n\n---\n\nWasteland was where I first had to deal with honest-to-goodness classified stuff.\n\nLike everything else in the industry, classified information was compartmentalized as heck and very very specific. This was partly due to the fact that safeguarding classified stuff is expensive, time-consuming and a pain in the ass. So they'd want to save the effort for places where it would actually be worth it.\n\nConsider, as a totally made-up example, a new model of tank with a cosmic-ray antenna. The existence of the antenna, or its height would likely not be classified, at least not after the tank was deployed. It's made to be used on an open battlefield, where anyone with eyes can see it. Keeping the existence of the antenna classified would not be useful. If another country learned about the tank, nothing much would be at risk.\n\nHowever, the fact that it detects cosmic rays and the range it can detect is another story. If an enemy found out this, they'd be able to figure out how to avoid detection, or counteract it. This is the kind of thing that gets classified.\n\nBut, the compartmentalization also goes the other way, for lack of a better analogy. Given the above scenario, a photo of the tank would not be considered classified, even if it showed the antenna, but a user manual with a chapter detailing the care and maintenance of the antenna would. And even though only a small part of the manual contained classified information, its presence would render the entire document classified, regardless of the content of the other pages.\n\nAnother bit of background. In between NotRockets and Wasteland, I'd decided to go to grad school and get a MS. In Defense (at least in AquVille), if all you have is a BS, your resume's just another one on the pile, and I figured it would help me find a job. At this point, I was still in classes. Wasteland was generally pretty cool about this. My schedule was pretty flexible and they either didn't know or didn't care that I was doing my programming homework on company computers.\n\nSo one day, I needed information from a particular document to finish a project. This document was classified, and as such, was kept in a safe. Although I had the required security clearance and need-to-know to see the doc, I didn't have access to the safe. That meant my boss had to get it out for me. It should be noted that this 40-someodd-page document only contained 2 pages of classified data, and the info I needed was on one of the unclassified pages. If we continue the tank example, what I needed would be the paint color- not classified, and only tangentially related to anything that is. But, like above, those two pages rendered the entire document classified. I'd suggested only taking the pages I needed, or leaving the 2 classified ones in the safe, but that wasn't an option.\n\nI got the info I needed and finished my task, and then it was time to return the doc to the safe. But there was a problem. My boss had gone home, and I didn't have the safe combo. Further complicating things was the fact that I had a class to get to- and an exam that period (and to complete the cliche pile, it was an open-book exam and I'd left my book at home). I had to leave, and that meant I had to get that document out of my hands.\n\nLeaving it out and just leaving was out of the question- classified stuff must either be locked up or in someone's custody at all times. And since I couldn't split up the document, I still had those two classified pages. I had to leave and leave soon, and that meant I had to find somebody- anbody- to take this thing off my hands.\n\nMiraculously, I found someone, about 10 minutes before class started. I made it to my exam, only a little bit late. There wasn't time to go get the book, but I passed, anyway.\n\nAnd frustratingly, it took another couple of years before they decided to give me the safe combo, so this scenario was repeated a few more times.",
        "created_utc": 1496386123,
        "upvote_ratio": ""
    },
    {
        "title": "No good deed goes unpunished",
        "author": "SpamJavelins",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6els3j/no_good_deed_goes_unpunished/",
        "text": "I'm now working in Project Management but spent the first few years working in Operations for financial services companies. My first job in a large FI was in an Ops centre 1 town over from my childhood home. I have to be slightly vague about what this centre did so apologies if anything seems unclear.\n\nOver time working there, I moved into a specialist role but would still provide cover in other sections as in the 2 years I was there I had been trained or trained myself on just about every role in the centre. One day they decided to move me back into a mail room style manual role with 0 warning and unfortunately my back started giving me trouble. I ended up being seconded (so they didn't have to deal with me) into a role in London that interacted with my centre and apart from the commute, was a great move for me.\n\nBecause I still had to have regular updates with my original Line Manager they arranged it so I could work from that home centre a couple days a week to spread the burden of the commute.\n\nSo that's the scene set. 3 months into this arrangement it's December and the weather decides to cover the South of England with Snow - if you know us Brits this means we grind to a complete halt. Living just under 4 miles away and having a pretty urgent deadline for my new role and no way to tele-commute I decide to walk it in knee high snow as it's not save to drive and none of my buses are running.\n\nI get into the centre and the duty manager is having kittens. Most of the centre staff, despite living locally, took it as an excuse to have a day in bed. In the particular field this centre worked, there were certain legal requirements that needed to be completed. Some areas you could shut down for the day, and apart from a backlog, they'd be fine but some things needed to be done same day and reported to various parts of the FI.\n\nSo little old me shows up and this manager begs me to help her keep the centre open. I get it cleared with my secondment manager over email (after the centre manager begs her) and get to work. A couple hours later I've put out most of the fires and one of the \"golden boy\" management prospects drops by the office. He asks if I can forward an urgent message  so I type it up neat and forward the scan across to the central team so they have both. Now this information went to a senior team in the FI and it turned out golden boy hadn't checked his data.\n\nI find this out when one of our area managers rings me up and literally screams down the phone at me, effin' and blinding, really giving me the hairdryer treatment while I try and interject and tell him what must have happened. He won't have any of it and apparently it's my fault for not double checking it. Eventually the duty manager takes the phone and finishes the call and we get the instructions to fix it.\n\nThis is one of those memories where you wish you knew then what you know now. I know with 100% certainty I'd have had him rolled over by HR and fucked out the other side. Sadly he got away with it.\n\nIn the meantime the weather is getting worse and the executive decision is taken to close the centre at 4pm so I put my boots back on and trudge the 4miles home (incidentally passing one of the managers whose job I'd covered - they were sledding...).\n\nA couple weeks later I find out through the local comms that everyone who came into the centre that day is being nominated for outstanding service and given shopping vouchers. Everyone except me. Apparently the Centre Manager, who was the closest I've come to a real female David Brent, didn't want to stir things up with the area manager and deliberately excluded my name.\n\nTLDR: Trudge miles uphill (both ways) in neck high snow to heroicly keep financial services centre open only to be cruelly shouted at for someone elses mistake then left out of the awards for keeping the centre running.\n",
        "created_utc": 1496311633,
        "upvote_ratio": ""
    },
    {
        "title": "Closed Area Tales, part 3: Wasteland and the Vault",
        "author": "aqutalion",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6ecr28/closed_area_tales_part_3_wasteland_and_the_vault/",
        "text": "It took almost a year to find another job after getting laid off by NotRockets, but eventually I ended up getting hired by a company I've decided to call **Wasteland**, because that's what working there felt like- being stuck in an endless expanse of nothing, with no end in sight. It's going to have more stories than most, because I was there about twice as long as most other projects. And that was twice as long as I should have been there, at least.\n\nThe project I was hired for was the other huge, long-running missile system, which I'll call **Stonehenge**.\n\nBut first, SWAG ROUNDUP! Wasteland won't win any prizes for quantity, but they did bring the weird stuff. \n\nFirst, a box on a lanyard. What is this supposed to be used for? Is it for ID cards? Disks? These were given out at some \"safety\" demo, and apparently, it's meant to be a \"first aid kit\". The \"kit\" consisted of some bandaids, wet wipes and packets of off-brand aspirin. Maybe that's all you'd need in an office?\n\nAnd then the set of jumper cables. Technically, that wasn't from Wasteland itself, but one of the insurance companies they'd contracted with for employee benefits. They had all the companies come and give a spiel about why we should pick them, and one of them held a raffle. I won a \"car safety kit\", the only really useful part of which was the jumper cables. Not bad, though. I needed a set.\n\nAnd the rest of the stuff: A baseball cap with the Stonehenge logo, a metal pin with the same, a fleece jacket (nice!), a stress ball in the shape of a brain, at least one polo shirt, still more lanyards, a really nice refillable metal pen, a hand sanitizer bottle on a clip, and a (probably imitation) leather folder that I still use to keep resumes in.\n\nYes, I keep all my logo swag. It's all in a RockeTech tote bag I got during an interview there. We'll hear about RockeTech, later.\n\nAlthough I'd had to get a security clearance to work at NotRockets, I'd never had to deal with actual classified stuff there. That changed at Wasteland. The software we were working on wasn't classified, but the special hardware it was intended to run on was. That required our closed area to have something unusual: a vault.\n\nYes, a vault. Metal walls with EM-blocking insulation and a door like you'd find in a bank. My boss had to lock it up at the end of they day, since none of the rest of us had the combo. That's in addition to the closed area itself, by the way (which I still didn't have the ability to open and close on my own). The ruggedized laptops we ran our tests on were kept inside, with no connection to the outside network, or even anything in the rest of the closed area. This meant that if we wanted to install something or copy files over, we had to burn it on a CD and physically carry it in. I had to do that with some test files once- a whopping 100kb. What a waste of a CD.\n\nThe reason for this setup was so you couldn't get any classified stuff information *off* the machine. Only media that was physically prevented from being written to was allowed to be mounted on it. No USBs, no floppy disks (those were still a thing), no writable CDs. Classified stuff gets weird like that- if one were to put a writable disk or thumb drive in the machine, that media would then become classified, due to the possibility that something got copied over. The get it back down to normal, it would have to be completely wiped and then inspected by someone with more authorization than me.\n\n\"Ruggedized\", by the way, basically means armor-plated. These things were meant to be used in active combat zones. They had thick metal plating and were heavy as a motherfucker. Later in the project, we got to mess with the actual combat hardware and there were ruggedized folding chairs. Armor-plated folding chairs! Surprisingly comfy, too.\n\nAlso, the Stonehenge logo used as a background image looked suspiciously like a marijuana leaf. Probably not intentional, but when you're stuck by yourself in a chilly, creepily quiet room, that kind of thing seems funny.\n\nA while after I joined, Wasteland moved to another facility, and a paper company ended up in the space we left. I still wonder what they did with that vault.",
        "created_utc": 1496206084,
        "upvote_ratio": ""
    },
    {
        "title": "Closed Area Tales, part 2: Purgatory Project and the Resume WTF",
        "author": "aqutalion",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6dm1l5/closed_area_tales_part_2_purgatory_project_and/",
        "text": "[Previous post](https://www.reddit.com/r/talesfromthejob/comments/6d7ibk/closed_area_tales_part_1_monolith_project_and_the/?st=j36tk75m&amp;sh=123898c1)\n\n---\n\nAs was common in the early '00s, Monolith got its budget cut. And once again, I was cannon fodder. I, and a group of others the Monolith project couldn't afford to keep, ended up on a project I'll call Purgatory.\n\nI call it Purgatory for two reasons. First, because it was allegedly dying, scheduled to be either replaced by or absorbed into Monolith. I say \"allegedly\" because even now, 10+ years later, I still come across job listings looking for experience with it. For all I know, it could still be shambling along like a government-funded, missile-launching zombie. It wouldn't be the first or the last project to end up in undead project limbo.\n\nSecond, because, as the project was dying, it was where NotRockets dumped all the people who weren't valuable enough to keep on Monolith, but not quite useless enough to lay off, completely. Purgatory's management was exactly as thrilled as you might think to be saddled with Monolith's rejects, and didn't bother to hide it. Morale, not just among us rejects, but in the project as a whole, was somewhere between negligible and nonexistent. No one- not us, not management, not NotRockets, gave a single solitary crap about Purgatory, making it a... well, let's call it an \"interesting\" experience.\n\nFirst, the facility. While Monolith was run out of NotRockets' main Aquville facility, Purgatory was relegated to a satellite office in a low-rent office park. We shared the building with a questionable telemarketing firm. The parking lot was partially blocked off with weirdly-situated concrete barriers that had obviously not been part of the original design. I assumed NotRockets put them there as a post-9/11 security thing (the main facility had blocked off and removed the \"executive\" parking lot because it was right next to the building, and considered a security risk), but I went for an interview in that complex recently and the things were still there. There was no signage, except the probably-obligatory one at the office park entrance. Nothing on the walls besides some Purgatory-specific publicity diagrams that were probably years old. For comparison, Monolith's offices were festooned with company propaganda posters, pictures and awards from previous projects and borderline-schmaltzy \"Respect Our Troops\" posters.\n\nThe offices were windowless, with cheap paneling and ancient carpet. The cubicles in the back, where us rejects were seated, were badly painted relics left over from a previous tenant. Dead roaches in the hallway were a regular occurrence. Once, we had to evacuate the building because the AC motor was burning oil and filled the place with smoke. The electric lock on the door to the classified offices had a habit of failing, which, at least once, resulted in the entire classified staff being locked out when it failed while they were all in a conference room. It was a cheap, crappy place, is what I'm saying.\n\nThe computer setup was also cheap. Like always, the project was compartmentalized as hell, and there had to be measures in place to make sure none of Purgatory's files or data were ever in the same place as any of NotRockets' other projects. Not an uncommon setup, but in every other case, the cubicles had two terminals, one connected to the network for one project, and one for the other. Purgatory couldn't afford this, especially not for the Monolith rejects. Instead, our computers had switchable hard drives. If I wanted to fill out my timecard or check my non-Purgatory company email, I had to exit out of what I was doing, power down the computer, switch the HD and start back up.\n\nAnd, of course, it had a Closed Area. And there is where the true depths of NotRockets' apathy was most apparent. Like at Monolith, we weren't allowed to leave the lab unlocked and unattended, and again, I wasn't important enough to be granted the ability to lock it up on my own. The same policy as Monolith held- if you couldn't lock up yourself, you had to call security to do it for you. Fortunately, it was only a single room and our actual offices were outside, so there was no cubicle odyssey at the end of the day. Unfortunately, the crappy satellite office had no security person. We had to call security back at NotRockets' main facility, who would then drive over to the satellite facility to lock the door once he was able. If we were lucky and we caught him while he was at his desk, we might be able to get out of there in ten or twenty minutes. If he was out on patrol or in the mens' room, we were stuck waiting until he got back and hoping we didn't miss him. And no, he had no cell phone, at least not that they gave us the number for.\n\nThis cauldron of apathy and despair gave rise to the two most WTF things I've ever put on my resume. The first wasn't all that weird, on the surface. A simulation utility that had been developed in-house needed a user manual, as no one really knew how to use it. Management put this project out on the shelf for anyone who wanted to take a shot at it to pick up, but no one wanted anything to do with it. Eventually, I ran out of things to do and got so achingly bored that I decided to give it a try. After all, I'd written my fair share of video game walkthroughs. This couldn't be that different, right? The result was... well, I hesitate to call it good, but it was the best that could be achieved under the circumstances.\n\nYet again, the developers unavailable. They had left no documentation whatsoever, and this time, we didn't even have access to the source code. What exactly were we supposed to document? The only thing I could think to do was go through all the commands and menu options and recording what they did. Was it useful? I don't know, but at least we could say we had some documentation and I could put \"writing user manuals\" on my resume and technically not be lying.\n\nBut the real WTF on my resume? **\"Translating Python code to C++\"**.\n\nThe programming peeps reading this probably all just went \"buh?\", and recruiters probably thought I was padding my resume, but I assure you, it was a real project. Management actually assigned it to me, and I got paid real money to do it. I spent a week or so teaching myself Python from a book borrowed from Main Dev, and another week slogging through his uncommented, barely-readable code. He did not take my advice from the last chapter. He really liked reusing variable names, too, which caused some confusion (Python is untyped, C++ is strongly typed. In Python, you can have a variable containing a string, then put in a number or an object pointer. You can't do that in C++). Is this variable 'x' the same one that was used as an array iterator 10 lines ago, and if so, why are you trying to assign a string to it? But I did it, and as far as I know, it worked. Yay, me.\n\nBut... why? Truth is, I still don't know. The official story I got was that the Main Dev insisted on doing everything in Python. As my programmer peeps are probably itching to point out, Python is an interpreted language, and therefore too slow to be any use on a real-time simulation, so it needed to be translated to C++. I suspect that the real reason was busy work. Management knew the project was dying and we'd all by laid off soon, and was just keeping us busy and running out the clock.\n\nI kept that on my resume for a while, if only because I enjoyed the confused reaction it got. Eventually, I took both WTF's off, partly because I needed the space for more recent and relevant things, and partly because I got tired of lazy recruiters calling me because their keyword search suggested I might be a great fit for a Senior Python Developer position, despite the fact that I haven't touched Python in ten years.\n\nOnly a couple of months after the two WTF's, Monolith got its budget cut again. This time, NotRockets remedied this by dipping into Purgatory's budget, which meant us rejects were out for real. This was my first time being laid off, so I was panicking. Little did I know how quickly it would become old hat.\n\n---\n\nPurgatory epilogue:\n\nPurgatory is, surprisingly, not yet dead. According to the security person at NotRockets I recently talked to, they still have \"a whole 2 people\" working it. I feel for those people.\n\nNotRockets no longer has the crappy office. Last time I drove by there, Missiles-R-Us had it.",
        "created_utc": 1495862706,
        "upvote_ratio": ""
    },
    {
        "title": "Companies From Hell? Do You Work For One?",
        "author": "TRexSaysRoar",
        "url": "http://www.freeabq.com/2017/05/24/how-do-you-know-youre-interviewing-with-a-bad-company/",
        "text": "",
        "created_utc": 1495736789,
        "upvote_ratio": ""
    },
    {
        "title": "Closed Area Tales, part 0: Management shakeup",
        "author": "aqutalion",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6d7qd5/closed_area_tales_part_0_management_shakeup/",
        "text": "Remembered this nonsense while typing up [part 1](https://nr.reddit.com/r/talesfromthejob/comments/6d7ibk/closed_area_tales_part_1_monolith_project_and_the/?st=j33z29xx&amp;sh=f3c675c2).\n\nThere's not actually a Closed Area involved, but still…\n\n---\n\nI got offered my first job at NotRockets while I was still doing my undergrad degree. They invited a herd of us out to their HQ near DC for interviews, and a bunch of us got offered jobs after we graduated (The late 90s/early 00s were a different time, kids). My offer letter stated I'd be working with **Manager A**.\n\n6 months later, graduation is looming, and I confirm with NotRockets that I'm still coming. They send me an updated letter, telling me my tentative start date, and to report to **Manager B**.\n\nA month or so before graduation, I start to make preparations for moving to DC, including applying for apartments. One of them wanted the name of my manager so they could verify employment. I give them Manager B's info. A few days later, they call me back, and said that Manager B has *retired*. I contact NotRockets, and they give me the name for **Manager C**. I forward this to the apartment complex, and get the apartment.\n\nAfter finally getting to DC and starting at NotRockets, I am assigned to **Manager D**. I don't know what happened to Manager C.\n\nThree months in, Manager D gets promoted. His people are reassigned to **Manager E**.\n\nAnother four or five months in, they powers that be decide that Manager E's group is too big, and splits it in half. My half is reassigned to **Manager F**.\n\nSo far, 6 managers in about 18 months.\n\n…And then, after 9-11 caused the government to basically drop our project like a hot potato (it was an *air traffic control* project, of all things), I transferred to the \"Space Systems\" division, under **Manager G**.\n\nManager G is transferred to another project and **Manager H** takes over.\n\nThen, I'm transferred to a different project (spoiler alert!) under **Manager I**.\n\nIn total, 9 managers in three years.",
        "created_utc": 1495690810,
        "upvote_ratio": ""
    },
    {
        "title": "Closed Area Tales, part 1: Monolith Project and the Batshit HR Department",
        "author": "aqutalion",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6d7ibk/closed_area_tales_part_1_monolith_project_and_the/",
        "text": "Previous post (not chronologically): [Hurry Up and Wait](https://nr.reddit.com/r/talesfromthejob/comments/6cn898/the_4monthlong_hurryupandwait_saga/?st=j33x18ym&amp;sh=c2bf07c8)\n\nI'm gonna try to do these in mostly chronological order, although I may end up fudging things.\n\n---\n\nThe year is 2002. The economic aftereffects of 9-11 have killed the project I was working so hard and so suddenly that it left skidmarks. Everyone, and I mean *everyone*, was scrambling to find a job somewhere. With not much choice in the matter, I ended up taking a position in AquVille, for the \"Space Systems\" division of the company. I'd taken the job with this particular company in the hopes of eventually working on the space program, so that seemed like a step in the right direction. AquVille has a NASA facility and the company at least had the word \"space\" in it. It seemed like an improvement.\n\nThen I got to AquVille and discovered that the \"Space Systems\" division actually makes missiles. *sigh*\n\nI shall, therefore, call this company **NotRockets**.\n\nThe project NotRockets transferred me to was one of two huge, long-running missile system projects that every major player in AquVille, and most of the minor players, has or had a piece of. I'll call it **Monolith**. This was my first defense project and my first exposure to the \"joy\" of working in a closed area.\n\nFirst, a little background on just what I mean by \"closed area\". The thing about defense projects is, they're compartmentalized as all hell. There's a thing called \"need to know\". If you don't have a \"need to know\" for a project, you're not allowed to see anything relating to it, even if you have the required security clearance. Some take it a step further, putting measures in place to make sure none of Project A's information or documents are ever physically in the same place as Project B's. This could be locked file cabinets, separate computer networks, and in one particularly annoying case, switchable HDs. Closed areas are an area that is only accessible by people working on a given project. Sometimes this includes an even more closed area for classified things. Sometimes offices are inside the closed area, sometimes just the workstations. In most cases, they are not allowed to be left unattended. Someone must be inside, or the door must be locked. This becomes a problem as they don't give the door codes out to just anyone, and bathrooms are not always part of the design.\n\nMonolith's closed area was, as I later found out, unusually large. Our offices were inside, in several rooms and hallways. We had a big oversize keychain that was the \"token\". If you had the token and needed to leave, you had to find someone else inside the closed area to pass the token to, or lock it up (or call security to do it for you if you don't have the clearance to do it). As my hours were often later than most, this usually resulted in having to go on an odyssey among the labyrinth of cubicles to find the next unlucky token holder when it was time to go home. That was rarely successful, so I was on a first-name basis with the security guards by the time I left.\n\nMonolith was where I picked up my seething hatred of undocumented and unreadable code. Like any well-run project, there were procedures developers had to follow, which included code style guidelines and a comment header template that was required to be included in any source code file. The header was meant to do some of the work a version control system would have done (this project didn't have one, oddly) and have important information about the file, including who wrote it, its update history, its intended purpose, and what data its functions took in and returned. What the guidelines apparently *didn't* specify was that the header had to be filled out. When I finally dug into the code, I found the header dutifully included in every code file- completely empty.\n\nThis was a problem. Being a relative noob, they only assigned me to test and debug code written by other team members. But, being a noob, I didn't always understand what it was trying to do, and when this happened, I tried to find out what the deal was from the others who worked on it. That turned out to be impossible, more often than not. In what I soon learned was true defense contract fashion, the original authors of the code were universally off on other projects or even other companies, and unavailable. Defense, as an industry, still has not gotten the memo that retaining your project expertise is a sound investment.\n\nSide note to my programmer peeps: Please document your code. Please. Get into that habit early. I know it's boring, but someday, someone other than you is going to have to read it. Maybe your teacher, your coworkers, or future-you who has forgotten what past-you was trying to do. This someone can't see into your head and might not be as experienced with the codebase as you. It doesn't have to be huge, expansive headers. Put comments explaining what you're doing, and use variable names that actually mean something. Please. Past-Aqu will thank you.\n\nWhat really made my time at Monolith memorable, however, was the HR department. It's not unusual at all for a company to have little celebrations for major holidays. Cake and punch for the 4th of July, maybe a big institutional-food spread somewhere between Thanksgiving and Christmas. Some organize little events for the employees, like a picnic (if the budget is up to it) or a potluck (if it isn't). They know that if employees feel like the company sees them as people and not just cogs in the machine, they'll be happier and work harder. It's fake, of course. We know it's all fake. They know we know it's fake. But they make the effort and we pretend to be impressed. Plus, HR will take pretty much take any excuse to have food catered in on the company's dime, and I, for one, have no problem with that. Free food is free food.\n\nNotRockets' HR department, however, took this to truly insane levels. Keep in mind that all these happened in the space of a little more than a year.\n\nFirst, the insane amount of logo swag they handed out. Any time a group of employees were gathered together, there was usually loot to be had. Mostly decent stuff, too. Take the new hires out for a get-together? Have a bag! All-hands meeting to discuss the year's projects? Have a notepad! Another all-hands meeting to announce budget cuts and potential layoffs? Have a stress ball!\n\nDuring my stay there, I snagged a leather card holder, two CD holders, three mugs (one metal, one ceramic, one plastic), a gym bag (which I'm still using), at least one T-shirt, a paperweight, a plaque commemorating reaching a project milestone that mostly happened before I started there, more pens than I can count, a plastic slinky, a metal slinky (which one of my asshole officemates stole), a stress ball in the shape of a globe, a couple of binders, some lanyards, and a giant stack of personalized notepads. Giant. I mean, the stack was about three feet high, and that's not an exaggeration. I kept them when I left NotRockets, and I still haven't used them all up, even 10+ years later.\n\nFor Cinco de Mayo, they had one of the local Mexican restaurants bring in food. Nothing unusual there. But they also set up a cartoon-\"Mexican\" backdrop, complete with a cactus and a burro, and had everyone unfortunate enough to walk through the front door that morning photographed in front of it wearing a giant sombrero and holding a sign with our name on it. I don't know what they did with the pics, but the did give us copies of ours. I suspect HR was stockpiling blackmail material. I think I still have the picture somewhere. No, I will not be posting it.\n\nFor Black History Month, they brought in fried chicken. **From KFC.** Yes, I'm serious. No, they really had no idea why the rest of us were either trying not to laugh or awkwardly not making eye contact. Alas, there were no collard greens or watermelon to be had.\n\nValentine's Day meant crate upon crate upon crate of little boxes of valentine hearts. Literal crates, just left on a table in the lobby for people to take. I can't decide if that's more or less awkward than having your boss give them to you. And seriously, where did they get them all? They must have needed a forklift to bring them in.\n\nFor St. Patrick's Day, a mountain of green cupcakes. Again, where did they get them all? They must have cleaned out every bakery in the city. How did they explain the radioactive green tinge of the sewage the next day?\n\nBut the most batshit of all? A **Rennaissance festival**. Yes, I'm serious. An honest-to-goodness (attempt at a) Ren-fest. They went all-out, too, or as all-out as you can go when your ren-fest is set in a modern office building and parking lot. They hired actors in costume to play characters and had some people put on a sword-fight. It probably would have been fun, anywhere else. Yet, somehow the fact that the supposedly medieval actors were still surrounded by posters of modern missile systems and a missile launcher in the parking lot, and all the patrons were wearing office-casual, somehow killed the mood. I think they should have at least dressed the missile launcher up as a catapult.\n\nBut, alas, the economic downturn continued on. Monolith got its budget cut, which resulted in a bunch of us being transferred elsewhere. This, I would soon learn, is par for the course in this industry.\n\n(to be continued…)",
        "created_utc": 1495687625,
        "upvote_ratio": ""
    },
    {
        "title": "Am I really being stalked right now?",
        "author": "Kazkadez",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6d6122/am_i_really_being_stalked_right_now/",
        "text": "This happened about a month ago and it honestly scared this shit out of me. This is incredibly long and I apologize.\n\nI work overnights in a manufacturing company. It's just me and one other person in the entire building for 10 hours. Usually, this job is incredibly meticulous, but it doesn't bother me. I just grab parts from the machines and send a new job. \n\nOne night, I get a message on Facebook from some random guy in another state asking me for nudes in a rather explicit way. This guy has 0 mutual friends with me. Mind you, I'm a guy, married to a woman, and my Facebook doesn't reflect where I work. So I do what any sensible person would do and I reply, \"Whoa, whoa. I'm not interested. Who are you? How did you find me\"? \n\nAs soon as I responded to him, I started going through is wall. I'm not kidding you, every single post was from Murder Mystery and Crime Scene Investigation scenes. Loads of them. Every. Single. One. I could feel a subtle flicker of concern starting to form in the back of my mind. Normally, I'd just chalk this up as a weird experience and move on. Less than a minute had passed since my reply to this guy and I'm going through countless murder mystery/crime scene game posts looking for something a little less creepy... and I hear the loud, piercing sound of glass shattering.\n\nI've never heard the phone ring where I work before. It's 3am, I'm sitting literally 1 foot away from this phone and NOBODY calls my department, but APPARENTLY someone has a sadistic sense of humor to set the ringtone to the sound of FUCKING EAR-BLEED INDUCING GLASS SHATTERING NOISES. I look at the caller ID and normally, you'd expect to see a regular phone number or \"Unidentified\", \"Blocked\", \"Restricted\", \"Unknown Caller\", etc. No. This read, \"Anonymous Is Here\".\n\nFirst, my department isn't listed in the system when it spits out departments when you call my work. You have to KNOW my extension to get my department, which, and I'm not even kidding, is extension 666. My coworker looked at me and said, \"Are you okay\"? The color in my face had apparently voided itself from existence and I was a slate of pure white. He motioned to pick up the phone and I begrudgingly grab it and give the default prompt, \"Business Name, Department, This is my name\". On the other end, I hear breathing. Slow, wheezy breathing. I prompted again. This time, I hear a quiet chirp. Not a bird, or a cat. Of a human. Like the quiet sound of someone saying \"Oh, shit,\" under their breath. Then they hung up. I hang up the phone and look at my coworker and said, \"I'll be back in a minute\". \n\nFellow smokers will understand that when you go through a stressful situation, your first instinct is to smoke to calm down. So, that's where I was going. Half way down the stairs, I came to the interesting hypothesis that I may be being stalked. When I reach the doors to leave the building, I did a quick survey of the parking lot. The parking lot at my work is completely fenced off. To get into the facility, you need a gate code. Only a handful of people have a gate code. But lo and behold, there's a 3rd FUCKING VEHICLE SITTING IN THE FUCKING PARKING LOT! No, this wasn't just any vehicle. It was a black van. Of course. Why would it be anything else at this point? I couldn't. I couldn't do it. I couldn't go outside to have a smoke while my panic neurons are firing at the break-neck rate of train-wreck.\n\nI ran back upstairs and slipped out the back door to have a quick couple puffs and do a little breathing exercises. Was I being stalked? Was this a prank? I go back inside, insistent on not leaving the building again. I locked the doors to my department and waited for the next event that I was sure was going to result in my death. My panic slowly subsided throughout the rest of my shift as nothing else strange happened. I felt relieved when the morning crew started to arrive. \n\nAs I left the building, I briskly walked to my car, got in, and drove home. As I left, I noticed that the black van was still in the parking lot, empty.\n\nThe following day when I came to work, I talked to the department head about it and he said, \"Oh, yeah. The CEO is SO open source that our phones need to be open-source. Hackers are constantly giving us hell with 'Phantom Phonecalls'. When I talked to him about it, he just shrugged it off saying, 'Yeah, it happens all the time,' like it didn't even phase him\". \n\nAm I being stalked? I don't know. Is it likely? No. Was it just coincidence? Probably. Did I shit my pants? Just a little.\nNothing strange has happened on that scale again since I've been working here. I wish someone would have warned me, though. \n\nTL;DR \nStalker-ish dude on Facebook with an obsession with Murder Mystery and Crime Scene Investigation games asked me for nudes. I declined and within a minute, my department's phone rang. My department isn't listed anywhere, my Facebook doesn't show where I worked, but someone dialed my work with extension 666 to get to my department, the only department operating this late. The phone sounds like glass shattering and reads out, \"Anonymous is Here\". Nobody answered, but whoever it was made a chirp and hung up. I went to have a smoke and there was a black van in our fenced in, gate code restricted parking lot. I went full panic and about had a coronary. Turns out that my work is obsessed with open source tech and chose hackable phones. The CEO doesn't have an issue with it as far my department lead knows. So this was probably all just coincidence in the worst possible way.",
        "created_utc": 1495670014,
        "upvote_ratio": ""
    },
    {
        "title": "When you try to make a joke with management and wind up hiding in your cubicle all day of embarrassment.",
        "author": "Duzzeno",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6d46n0/when_you_try_to_make_a_joke_with_management_and/",
        "text": "A while back I worked at a place where the CEO was very nice, but rather intimidating. The guy was always smiling and would frequently swap stories to set people at ease. Unfortunately since I had just started at the company, every time I would clam up faster than a high school boy talking to his crush.\n\nI was planning on being a \"lifer\" at the company so I wanted to make friends with all the important people and that wasn't going to happen if I couldn't say more than two words to one of the heads of the place.\n\nI got my chance one day when coming back from lunch I saw the man himself standing in front of the building obviously waiting for someone.\n\nAs I walk past him I build up the courage and tell him \"Don't look so down, people will think you got fired\" or something along those lines. CEO looks at me, laughs, does one of those business guy finger gun gestures and I head inside.\n\nI'd done it, finally broken the ice with the guy. Now I could make the occasional joke in passing or ask him how is day was or anything just like everyone else was doing.\n\n\"Bing\" my inbox chirps.\n\nNew e-mail from HR.\n\nCEO is no longer with the company, his responsibilities will be divided up between… And that's when I had realized what I'd done. The guy had literally just been let go and was waiting for his daughter to come pick him up. I had probably made what had seemed to be the most insensitive joke at his expense.\n\nOther people who had heard my brief conversation with the now former CEO began giving me dirty looks for my tactless humour as I tried to stutteringly defend myself, I didn't know, I didn't know!\n\nTo this day I still cringe whenever I remember it.\n\n**tl;dr** I see our CEO hanging out in the parking lot and make a joke about him getting fired, then read an email confirming I'm a psychic.",
        "created_utc": 1495652047,
        "upvote_ratio": ""
    },
    {
        "title": "Full Stop",
        "author": "Dfiggsmeister",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6d227f/full_stop/",
        "text": "This one goes to the last company I worked for.  \n\n**Background:** The company had been doing well for a long time under the wing of this ex-pat who came in from our world headquarters after several CEOs quit/got fired in quick succession over the course of a year (as relayed to me by folks who had worked there long enough).\n\nThe new CEO changed up how the U.S. wing ran the organization and things changed for the better.  People were happier, the company was doing well, and we were turning our brands around.  Then we went through a reorg where they let go the head of sales.  The guy was ok at his job, but he was a horrible public speaker and I think the then CEO felt that they needed someone with more public speaking experience.\n\nIn comes Roger.  Roger was a sales executive from a big soda company (think Coke or Pepsi).  Roger had hopes becoming CEO of that soda company but I guess he didn't fit the mold so he left the company and came to our organization to head up sales.  At the time our company had split sales and marketing and turned it into three branches: Marketing, Sales, Retail Focus.  I was in the Retail Focus group which involved things like sales analytics, in store merchandising, pricing, etc.\n\nWhen Roger came in, he made this big speech about how he wants to work with our group and that we need to be working hand in hand with each other, Full Stop... Full Stop...  The man kept saying that word after every sentence. Full Stop.\n\n**Where I inadvertently changed Roger:** In comes a new CEO for our organization, I'll call him Frank (he looks more like a Frank and changing names because).  Frank also came from World Headquarters but his background was more finance focused.  Over the summer the two CEOs were to transition the organization over, Frank to take over from the old CEO and business was to move on as usual.\n\nAt the time, our head of Retail Focus, David, had a lot of good ideas on where he wanted to take the organization and his team.  At one point, David had approached me about my ideas for the organization and we got to talking about certain things we were missing and how I could close that gap. I was ecstatic.\n\nAbout two months later, there's a big announcement from Frank. We're merging Sales and Retail Focus back together and just calling it Sales.  Roger makes his speech again, saying Full Stop after every sentence and this just pisses me off.  David then gets on the phone and tells us all that he's decided to leave the organization.  You could tell he was bitter and pissed.  He had every right to be, considering Roger had been schmoozing it up with Frank and convinced Frank that the organization would be more efficient with Retail Focus and Sales under Roger, which means that David would have to take a step down and Roger would be his new boss.\n\nI and my team had been hearing rumblings from the sales team that Roger was known for being a penny pinching blow-hard that couldn't give you any idea of what he wants beyond he doesn't like it.  As you can imagine, this created a lot of over-work for his team.\n\nFlash forward to a few months later and we're having a team meeting/transition meeting where Brian is taking over for David (Brian was under David but was moving up to take David's spot) and Roger was taking over the team.  The first day, David ran the meeting and talked about how great things were, but by lunch time, he was to walk out and Roger was to take over for the next two days.\n\nWhen Roger got up to speak, I started tallying how many times he said, you guessed it, Full Stop.  That first half day, he said Full Stop at least 36 times.  The second day, in the morning, he said it again another 42 times.  By this point, I had tallied up that he had said Full Stop 78 times and he wasn't done. In the afternoon he was up to saying Full Stop 120 times.  \n\nThat afternoon we did a team rotation where we were going to select a new name for ourselves considering that Roger hated that our team name was Retail Focus.  He said it made us full of ourselves.. ok? I moved to another table completely forgetting the pad I had been using... yep, the tallies of him saying Full Stop.  And guess who happened to be sitting in my spot when we moved? Roger.  He saw the page, blanched, took a picture of it then sighed heavily.  Thank god I didn't put any indication that it was me who had wrote it (we were in a room with over 100+ people, kind of hard to figure out who sat where).\n\n**The Reveal:** Flash forward to 6 months later, I'm in a meeting with Roger, my boss, my boss's boss and another coworker to present this strategy deck we had created. In the middle of the convo, Roger is about to say Full Stop but stops himself and says, \"Man, I've been trying like hell to fight that part, but I just can't help myself from saying it. Back when David left, I found that someone had written down how many times I said Full Stop and it blew me away. I had no idea I said it that much. When I showed my wife, she laughed and confirmed that I say it way too much. Wish I knew who it was.\"\n\nI kept my mouth shut and acted ignorant of it but I was thankful that the Full Stops mostly stopped.\n\nI left the company 6 months later after realizing how terrible that place was getting and where it was going.\n\n**TL;DR** Got the head of sales to stop saying \"Full Stop\" after every sentence when he found my tallied notepad.\n\n",
        "created_utc": 1495631839,
        "upvote_ratio": ""
    },
    {
        "title": "Taxi driver forgot he had a passenger",
        "author": "kiwi-ms",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6czlau/taxi_driver_forgot_he_had_a_passenger/",
        "text": "My husbands family owned a few taxis back in the days of strict regulations on how many taxi licenses were issued and there were only two companies in the major city.\n\nIt's winter so the heaters running and windows are up.\n\nHusbands uncle was one of the drivers one night and had worked a long shift.\nUncle decided he was calling it a night and was going home 45 minutes away.\n\nHe saw there was a fare going to his town and decided to do the job as it was on the way.\n\nProceeds to pick up the passenger, promptly forgets about poor passenger in the back.\nDriving down the motorway he farts and rolls his leg and farts some more. He doesn't feel any relief so he let's rip a huge cloud that had him questioning what he eaten it's so toxic\n\nHe feels a breeze from the back and looks in his mirror to see his passenger looking rather ill with his head out the window trying to breathe\n\n",
        "created_utc": 1495595537,
        "upvote_ratio": ""
    },
    {
        "title": "I took a food order over the phone today...",
        "author": "FreeBroccoli",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6crkjq/i_took_a_food_order_over_the_phone_today/",
        "text": "#4:54 PM  \n  \nThe phone rings.  \n\nMe: [Fast food location], this is FreeBroccoli, how can I help you?  \nCustomer (E): I need to place an order.  \nMe: Okay, will this be picked up soon?  \nE: Yes, I'm in a hurry, so I need it to be ready when I get there.  \nMe: Okay, we can do that. What can I make for you?  \n\nI proceed to take his order: two sandwiches with extra meat.  \n\nMe: Okay, we'll have that ready when you get here.  \nE: Okay, you need to make it fast so it's ready when I get there.  \nMe: No problem.  \nE: See, I'm at the service station down the street, and we're going to leave in just a moment.  \nMe: We'll get started as soon as we hang up.  \nE: It neeeds to - oh, okay.  \n\nWe hang up.  \n\n#4:58 PM  \n\nThe phone rings - same number.  \nMe: [Location], how can I help you?  \nE: I just called and placed an order. Will it be ready soon?  \nMe: Yes-  \nE: We're almost ready to leave.  \nMe: We are just wrapping up your sandwiches now. It's ready whenever you get here.  \nE: Okay, and my name is Earl [last name].  \nMe: Okay, we'll see you in a moment.  \n\nWe hang up.  \n\n#5:00 PM  \n\nThe phone rings - same number.  \n\nMe: [Location], how can I help you?  \nE: It's Earl again. I wanted to make sure you got the extra meat on that.  \nMe: Yes, I made it exactly according to order.  \nE: Okay, thanks. I'll be there in just a minute.  \n\nWe hang up.  \n\n#5:14 PM  \n\nThe phone rings - same number.  \n\nMe: [Location].  \nE: This is Earl. I'm sorry I haven't gotten there yet. We're still waiting on the police to get here. Don't throw them away, I'll be there as soon as I can.  \nMe: Okay, we'll hold onto them.  \n\nWe hang up.  \n\n#5:42 PM  \n\nEarl arrives to pick up his sandwich.  \n\n#6:12 PM  \n\nThe phone rings - same number.  \n\nMe: *sigh* [Location] How can I help you?  \nE: Hello, this is Earl [last name]. I places an order for two sandwiches.  \nMe: Yes, I remember.  \nE: Oh, you remember? Then why didn't remember to put extra meat like I asked?  \nMe: I put on six scoops, which is the correct amount for extra meat.  \nE: How much is extra meat?  \nMe: $1.50. The normal amount is four scoops, and I put on six scoops, which is extra meat.  \nE: Six scoops is extra meat?  \nMe: Yes.  \nE: ...  \nE: Okay, thank you.  \n\nHe hangs up.  ",
        "created_utc": 1495502801,
        "upvote_ratio": ""
    },
    {
        "title": "Coworker told me this story from the ladies' bathroom",
        "author": "JPAviation",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6co7e6/coworker_told_me_this_story_from_the_ladies/",
        "text": "Not a whole lot to tell here, but as a guy, this REALLY screwed me up.\n\nAbout a year ago, one of the ladies at my job was in the restroom minding her own business in the stall. She proceeds to tell me that another lady comes in to use the facilities and uses the stall next to her. As some ladies prefer, the person in the stall next to her hovers instead of sitting on the seat. Totally normal behavior.\n\nEXCEPT THAT THE LADY IS FACING THE TOILET. AS A GUY (and I might be TOTALLY out of the loop here), WHAT?? YOU CAN DO THAT?? SINCE WHEN???\n\nTo make matters worse, my coworker tells me that as her neighbor is answering nature's call, she sees something that horrifies her. Coworker says that she hears a small noise, a plop, then notices a turd sitting on the floor next to her neighbor's feet.\n\n\n................\n\nPlease tell me if you've have a similar experience or if you were as horrified as I was that these things happen.",
        "created_utc": 1495469657,
        "upvote_ratio": ""
    },
    {
        "title": "The 4-month-long Hurry-up-and-wait saga.",
        "author": "aqutalion",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6cn898/the_4monthlong_hurryupandwait_saga/",
        "text": "I already posted this story on my blog, but I figured, ya'll would get a kick out of it, too. Behold, the saga of how I got paid to sit on my butt for four straight months.\n\nFor background, I was a software developer for a very large defense contractor, which I’ll call Missiles-R-Us. I’d started working there after my previous project dropped me for reasons I never got the details of. Probably budget-related, but who knows? After I started there, I found out that they’d brought on quite a few new people- to replace a whole bunch of other people that had left, all of a sudden. In retrospect, this should have been a huge red flag, but I didn’t see it.\n\nAbout ten months in, the project I was on had its budget slashed, and my position was one of the ones to go. This, unfortunately, is par for the course in the defense industry. Contracts come and go, and the industry as a whole hasn’t figured on that hanging on to their project experience and subject matter expertise is a good idea. And they never quite make the connection between letting all their expertise get away and the project not being as awesome as it could have been.\n\nLuckily, I was able to find a spot on another project with the same company. This was no thanks to either my HR contact, or my “dedicated placement rep”, I should mention. I still have no idea what either of those people were supposed to do for me, as the only advice they could give me was to check the company’s job listing site. But the new project seemed like it would be fun. The HR person “extends” my layoff date.\n\nThe project is based out of a facility in another state, so I and the team I’m with are working for them remotely. The team lead and I are installed in a backwater office near the airport. The other two guys are in other states. I don’t mind the move, as the new office is closer to my house, and the new commute route doesn’t have to go over the then-under-construction bridge. Plus, I get to drive by the intermodal center and watch the huge cranes moving containers around. Yeah, I’m weird. So I liked the new place, but it was still pretty obvious just where in the pecking order we were.\n\nAlso, I still report to my old manager from the previous project, at least on paper. I never did find out why this was. It may have been because I was never “permanently” attached to the new projects(s), because the lead on the new project(s) didn’t have the corporate authority to sign timecards and such, or maybe there was a policy that employees and their managers had to be in the same geographic area. I don’t know, but it was weird.\n\nSo I set about learning a new software language and a new dev framework for this new project. I’ve never used either, before, so the only thing they assign me are tutorials and non-SW-related research, figuring I’ll get up to speed in a couple of weeks. This isn’t the most organized of groups. The project is new and in its very, very early stages, no one knows exactly what they’ll end up doing, there are basically no SW requirements or plan, and everyone being in different states isn't helping. We’re fumbling in the dark. But it looks interesting, and at least I’ll pick up some more bling for the resume.\n\nA couple of weeks in, the higher-ups decide (rightly, IMHO. The first group was mainly UI-focused, and my skills are data/backend-focused) that my skills are a better fit for a different group within the same project, and I am transferred there. This happens without notifying either the group lead for the group I was with, or my manager-in-name-only, resulting in some confused emails. HR again “extends” my layoff date.\n\nBut this new group looks better! The work is right up my alley, and since it’s in its very very very early stages, I might get to take a leadership role in the development of my piece. I get excited.\n\nAh, but there’s a problem. The work for this new group requires installing some new software on my company machine. Most of it’s routine- updated Java, Firefox, etc.- but the company machines are so tightly locked down that the regular users can’t install a thing. For some of the software, they can supposedly be ordered from the company’s internal SW store, and IT will install it for you. I do this for the things I can order there and wait.\n\nBut for the rest, like the DBMS, I need either a waiver or admin access on my machine. I apply for both of these, aand wait. I send paperwork to my manager-in-name-only. When nothing happens, I send it again. When still nothing happens, I get in touch with his manager, the project lead, the engineering lead, trying to fight my way up the chain so I can get this nonsense installed.\n\nBut I can, for some reason, install Eclipse and JBoss (no, I don’t know why), so I can at least look around in the code, maybe do some testing that doesn’t require the DB? There isn’t much that falls into that category, since the DB and the layer that accesses it are basically my entire job, but there ought to be something. Nope. The JBoss version they use needs a later version of Java, which I can’t install! I can look, sure, but I can’t run it or do anything useful.\n\nIf you’re wondering why I didn’t already have a dev environment set up, it’s because the first project did all its actual dev work on classified machines connected to their classified network. I’d already gone through the bureaucracy red tape to get that set up, and the unclassified company laptop was really only used for email and timecards. Oddly, the classified machine setup actually involved less red tape, as the environments were standardized and the contents largely contract-mandated. Also, the admins that handled the classified network were there onsite, so we could bug them in person.\n\nOne of the waiver requests is rejected by IT, because I do not have a waiver for the software requested. No, I don’t understand it, either. The request is resubmitted.\n\nTwo weeks later- *TWO WEEKS LATER*- still nothing. I get on IT’s case about the stuff I ordered from the internal store, and am informed there was a server issue and orders got lost. I reorder them, and wait.\n\nThen I start climbing the bureaucracy chain again, trying to chase down either the admin access or the SW waivers. This time I am able to use the magic words- “Work Stoppage Issue”, which apparently gets them moving. Gears of bureaucracy turn, albeit ponderously. My admin access miraculously comes through! The waiver requests are never heard from again, and the SW store’s server apparently never found my orders after its ‘issues’, but with my shiny new admin access card (yes, a physical card. Our ID badges had chips in them, and they had to install some certs on it.) , I can finally install all my stuff and actually get some work done!\n\nIt’s been close to a month, at this point. Between this and the disorganized clusterfuck going on in the first group, Missiles-R-Us has basically been paying me to twiddle my thumbs for almost 2 months. Don’t get me wrong, data security is a good thing. You don’t want employees installing porn and malware on the company machines, especially since there’s government data on them, and a slight chance there might even by legitimately classified data, too (there shouldn’t be any on these machines, ever, but breaches happen). But when it gets to the point where it’s actively preventing people from doing their jobs, maybe you need to lighten up on the red tape. Seriously, if you won’t let a Java developer install Java…\n\nAbout a week later, on a Tuesday, I get a message from the manager of another project, wanting to know if I’m available. It gets me thinking- it was getting to the end of my layoff extension, and I hadn’t heard from HR about extending it again. My last day was the coming Monday. On Wednesday, I get to work to find a voicemail from my manager-in-name-only, saying I need to come fill out the final layoff paperwork.\n\n…What?\n\nI frantically chase down the team leads, the managers, the HR reps, trying to find out what the flaming crap is going on. At last, I get a hold of the team lead. Apparently, they’d decided to get rid of not just me, but all the people in the group I’d just left. The requirements and specs for our parts of the project weren’t yet developed enough to justify having someone on them full-time.\n\nGee, thanks for the heads-up, jerks. When were you planning on telling us? At least on the first project, they gave us 6 weeks notice.\n\nBut there’s light on the horizon! The other project that contacted me! I’ll just get a hold of that guy and see if I’m a good fit there!\n\n…Aaaaaand, there’s a problem. The email was sent via the company’s internal job/resume-search site, and it hadn’t included the name or email of the sender. Basically “Hey, we need a programmer for a remote project in City X. Wanna talk?”\n\nSo I email my HR rep, hoping she’d know who sent it. But, not wanting to wait, I decide to hunt it down on my own. I look up project managers at the site mentioned (fortunately, it wasn’t one of the larger ones) and send a generic “Hey, was this you?” email to some of them. After a couple of leaps, it ends up in the hands of the original sender, and we start talking. But he’s going out of town tomorrow, and wants to set up an interview for next week.\n\nNext week? My last day is Monday! Can we move faster? He contacts some other team members to see if they can do it. One of them IMs me and tells me about the project, and I’m absolutely drooling. Not only is it perfect for my skillset, but the subject matter is something I’ve been researching as part of my thesis/dissertation. Seriously, have you read my thesis? It’s totally relevant, and I have a copy here on my handy thumb drive (Don't judge. If you'd spent that much time on something, you'd carry it around, too). She says she’ll email me tomorrow to set up a phone interview.\n\nThursday. I wait. And wait. I IM the person I’m supposed to be talking to. I wait. I email her. I wait. Eventually, she contacts me. They’re in the middle of a huge demo, and got swamped. No big deal, we can talk tomorrow.\n\nFriday. I wait. I wait. I IM. I email. And frankly, my desperation is showing and I’m not proud of it. At about 4:30, I realize it’s probably not going to happen that day, so I email my HR rep, asking if the layoff date can be extended a few days to get this cloffprunking interview done. The rep has already gone home for the day, so I have to wait until Monday for an answer. Have a good weekend, Aqu!\n\nMonday. The HR rep says they can extend the layoff until Wednesday, but I’ll have to use my PTO time to cover it. That’s rather a dick move, but it beats being unemployed.\n\nNo, what a minute. It’s not rather a dick move, it’s *totally* an absolute dick move. I’ve been in that situation before, with other companies, and the other companies always had an overhead charge number we could use for a few days between projects. Fuck you, Missiles-R-Us.\n\nAnyway. Tuesday. The interview finally goddamn happens! And since both I and the HR rep had impressed upon them that they need to move quickly, they make a decision right then. I’m officially transferred to the new project. HR “extends” my layoff date.\n\nWait, extended again? I thought this was a permanent thing.\n\nWell, I’m working remotely, and they’ve been burned before by people who weren’t able to keep up without their coworkers around. “Died on the vine”, they called it. And they want to make sure I can hack it, and that this project is what I want to do. Not unreasonable, but still irritating. And if I don’t wash out, it should turn permanent. The lead think that’s pretty likely, too. This is hot-topic program that the army’s pretty gung-ho for. They haven’t had a budget problem in five years!\n\nAnd guess what! I need to install new software! But this time, they know what they’re doing. Instead of wading though the red tape to use the company machines, they have VMs set up for the devs with admin access and everything. I have the tools I need in three days. Yay for organized projects.\n\nSo all’s rosy? No, not yet. I’ll have to go to the facility at City X to get completely set up. So we throw around a few dates for this…\n\n…And nothing. The demo is still going on, and they’re still swamped. I keep at it, and eventually, we settle on the next week. All I need to do is go to the company’s travel site and use my company card to make the arrangements…\n\nWait, company card? What company card? Crap. Let’s get that rolling. It means next week is out, though, as is the week after because of a holiday, and the week after that because both the people I’ll need to work with will be out of town.\n\nThat puts the expected date of the trip past my layoff date. So guess what. HR has yet again “extended” my layoff date.\n\n…Sigh.\n\nIf you’re counting, that’s about 2 ½ months, so far, they’ve been paying me to basically sit on my butt.\n\nOver the next couple of weeks, I do manage to get a bit of work done. Not much, mind you, but at least I’m not twiddling my thumbs, all day. They even assign me a bug. There’s still the matter of getting access to one of the network systems, but I’m sure that will be taken care of once I can go to City X. \n\nSo, three weeks later, the trip to City X happens. And it actually wasn’t so bad. I finally meet my new coworkers in person, and we get the rest of the tools and systems set up. City X is almost creepily similar to where I live, complete with a cornfield right outside the office building.\n\nBut, my last day there, the team lead calls a meeting. He’s gotten word that the project is getting its budget cut.\n\nWhat? *What!?* Are you fucking kidding me? Supposedly no budget issues for five years, and it gets its budget cut as soon as I get there? Are you fucking kidding me?\n\nDespite the lead’s assurances that they’ve only laid off 2 people in the 19 years he’s worked there (I call bullshit, unless he's been living under a rock), I know I’m toast. Last in = first out in these projects.\n\nIt was suggested to me by multiple people that they knew this would happen and only brought me on to be cannon fodder, so they wouldn’t have to lay off someone who mattered. Catch me in a bad enough mood, and I might agree. It’s possible, to be sure, but why go to all that trouble- even setting up a multi-day business trip- if all you want is cannon fodder?\n\nSo I go through the motions again, applying for things on the internal job site- and increasingly on outside sites, too. My “dedicated placement rep” continues to be useless. This time, however, there’s nothing for it. My layoff date arrives. I turn in my security badge and the laptop and my still-brand-new company card, and leave. The HR rep says she hopes we’ll work together again, someday. I try very hard not to laugh. Although I’m disappointed at not being able to work on that last project, I do not miss Missiles-R-Us, and I’m not going to miss the defense industry, either.\n\nBut it’s not over, yet. Remember the company card? I’d submitted the expense report just before I got laid off, and the HR rep said the company would be paying the card directly, so I didn’t need to worry about it. However, a couple of months later, I start getting calls from the card company- Missiles-R-Us didn’t pay the card. I email the HR rep to find out what’s going on, but never heard back. I was still unemployed, then, and if they thought I was going to pick up the tab for a $1500+ business trip, even I could afford it, they’re nuts.\n\nAnother couple of months pass, and the card company is calling again. Seriously, Missiles-R-Us, laying me off wasn’t enough, you have to wreck my credit, too? This time, I email not only the HR rep, but my former manager, the team lead, the admin person who set up the trip, and my boss’s boss. The former team lead actually replies, saying they’re looking into it. I haven’t heard anything else, nor has the card company contacted me, so maybe it’s taken care of. I have no access to the card, and can’t get into the company system to check on the expense report, so I can’t be sure.\n\n---\n\nAs an epilogue, after some adventures in consulting and a couple more short-lived projects, I'm back with Missiles-R-Us… kinda. The contract structure for this current project is the most borked thing I've ever seen, but Missiles-R-Us and I are connected, at least tangentially. They have not changed their ways.",
        "created_utc": 1495459682,
        "upvote_ratio": ""
    },
    {
        "title": "How my boss fired me and got angry because I left",
        "author": "chloeru",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6cg34i/how_my_boss_fired_me_and_got_angry_because_i_left/",
        "text": "So yeah, this really happened. \n\nI worked as a paralegal for a small law firm (20 employees) in a coworking building (not our main office). I had no guidance, no internal education, no deadlines, salary was bad, supervising 3 interns: I was really really bored and had no idea what to do. Despite several meetings where I told my boss that this was not going well, he always made promises to look into things but in the end he never did. One week before my contract ended, my boss and his partner scheduled a meeting. I assumed they would renew it as legally they should've told me a month earlier. However, they did not. They had to let go of me because of monetary issues. I was perfectly fine with it as I had other job interviews planned. They gave me a contract for another month to find something else and apologized for the lack of guidance etc. Two days after, my boss handed me the contract, telling me he changed it into two more months. I told him that I was planning to get another job earlier, so I was fine with signing it, but that I wanted to leave earlier if I find something else. He understood and agreed. \n\nThe first month continues and I get another job. I told my boss that it would be my last two weeks and he seems happy for me but also a little overwhelmed. He was not ready for me leaving. However, my last weeks continue and I do not hear anything from my boss. He wanted to sit together and talk about my work and what to do with the interns etc, but he never planned a meeting or let me know. \n\nMy last day arrived and I invited all coworkers from the main office for drinks in the coworking space I work at. No one showed up, only my boss. I invited some friends and people from the building and some gave me presents. My boss was just sitting there, not really saying anything. After an hour, he leaves and says: let's still plan that meeting, I will call you Monday. I am surprised, but agree as I still need him for a reference for my new job. Later that night, I get a calender invite from him for a meeting on Tuesday. I took the month off as I have to move to another city and still finish some things here at Uni. \n\nOn Monday I got a text from a coworker saying: hey we are not letting you go this easy, what about a drink at the main office Wednesday at 5pm to say goodbye to you? (On Wednesday we had a company dinner planned and my boss told me earlier I should come there too.) I thought that was really sweet and thoughtful, although I should do all these things on the days that I'm free. On Tuesday, I drive to the office for the meeting with my boss. He is sitting in his office and says hi, but he is still busy. I wait outside for 15 mins. Than someone asks me what I am doing here. I say I am here for the meeting. She tells me my boss will be leaving soon. I walk into the office and ask: you know we have a meeting now? He says: I am really sorry but I have to leave, let's do it another time. I am surprised and say: I do not have time anymore upcoming week.  He says he will call me and I just leave, wondering why he did not just send me a text message earlier. \n\nWednesday arrives. I do not want to go to have my goodbye drink anymore after Tuesday and my meeting with the boss. However, I still drive to the office again. When I arrive, it is completely silent in the office. Literally no one is there. I walk around and see one partner on the phone. I get some coffee and just wait. I feel very stupid and as I am about to leave, the partner walks towards me and hands me over some flowers. He apologizes that no one could be there. Stupid thing is I still have to go to the dinner later that night. I still go there. \n\nDinner is awful. Everyone ignores me because they feel ashamed of not being at my goodbye event, I want to go home. I try to leave early and say goodbye to people. I say goodbye to my boss and he is very surprised and even a little angry. He says: but we are still seeing you right? Me: uhh don't think so. Him: why not? Me: because I don't work here anymore? Him: oh. \n\nLater, one of the interns told me he was angry because I left. The only thing I could do was laugh at that moment. They fired me, they let me come to the office for no reason on my free days TWICE, and now he's angry? He had enough time to plan a meeting with me in my last month. \n\nI have to add: I now found a great job and this experience taught me to be more careful with accepting jobs too easily. I will (at least for now) never work for a company again that has no HR department or internal employee policy. I've learned my lesson! ",
        "created_utc": 1495366430,
        "upvote_ratio": ""
    },
    {
        "title": "Job helper in 66 countries",
        "author": "JuliaBlanco",
        "url": "http://jooble.org",
        "text": "",
        "created_utc": 1495277327,
        "upvote_ratio": ""
    },
    {
        "title": "Some reflections regarding the job of your dreams",
        "author": "JuliaBlanco",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6c9elf/some_reflections_regarding_the_job_of_your_dreams/",
        "text": "[removed]",
        "created_utc": 1495269910,
        "upvote_ratio": ""
    },
    {
        "title": "Where do you see yourself going in your second temporary job?",
        "author": "TheLightningCount1",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6c53gj/where_do_you_see_yourself_going_in_your_second/",
        "text": "So to pay for some unexpected expenses I took a second job as a tech for a retail location. You could say I work with a squad of computer people. \n\nWell I took this job saying full well it is temporary and that I only wanted the job to help pay off extra expenses. My bosses knew this. My coworkers knew this. Hell even the regional manager knew this. So far everyone has been OK with it and is actually willing to work on me with my schedule. Nights and weekends. \n\nSo a few nights ago we get the new schedule and it shows some morning hours for the weekday. I groan and ask my manager about it. Basically he was told that I need some morning hours for training for a specific role his manager wants to put me in. \n\nI basically asked him \"what role?\" I reminded him of how I was temporary and that I wanted no advancement or promotion opportunities. My manager gave me a smug \"Oh I think you will reconsider when you see the offer.\" I gave him a nice \"don't count on it\" as I walked down to his managers office. \n\nI walk into his office and ask him about the hours. \n\nActors in this scene are \n\n&gt; $me = Peter Gibbons\n\n&gt; $MGR = Dan (The restaurant manager from waiting...)\n \nI walk in and set down at the table in the center of the room. (Managers do not have an office here.) \n\n&gt; $ME - So what is going on with my schedule? Why are you giving me hours during the day?\n\n&gt; $MGR - Ah $ME good to see you. You want anything? Soda? Water?\n\n&gt; $ME - *instant red flags* No thanks I am good. \n\n&gt; $MGR - So where do you see yourself going with (our company?)  \n\n&gt; $me - I see myself going back to (my day job)\n\n&gt; $MGR - *Annoying laugh* I thought you might say that. They said you were a jokester. That was a good one. \n\n&gt; $ME - No. No it wasn't \n\n&gt; $MGR - Listen there is an opportunity that has come up which I have already put your name in the hat. You know the (name of position that gets paid well... for this company) they have an opening very soon. I know you are about to talk about your commitment to your current company. But do not worry, the position will not be opening up for a few weeks. Plenty of time to square things away. \n\n&gt; $ME - *I will play along.* Pay, benefits, and hours?\n\n&gt; $MGR - Excuse me?\n\n&gt; $ME - Pay benefits and hours. What are they?\n\n&gt; $MGR - I do not know the full details of the benefits. But the pay is 16 an hour starting out. After every six months you get an employment review where we bump your pay up. \n\n&gt; $me - *No you wont. You wont give me reviews every six months you will pretend I do not get one and then give me one after 2 years where you bump my pay by 50 fucking cents.* The cap?\n\n&gt; $MGR - Well for this position the cap is 19 an hour. You will be guaranteed 40 a week. Plus I know that we have a week of paid vacation after one year. So are you interested?\n\n&gt; $ME - *If you could double the pay, triple the vacation, and guarantee medical with only a 1.2k deductible sure.* I don't think so. My other job pays me more and we have better benefits. I honestly just came in here so I can get my schedule fixed. \n\n&gt; $MGR - I think you are making a big mistake. You are throwing away a big opportunity here. \n\n&gt; $me - Look I was trying to be nice. I make ____ an hour working 8-5 m-f. I get 3 weeks of vacation a year and my health insurance only has a 1.2k deductible. Unless you can beat that I will not be taking the opportunity. \n\n&gt; $MGR - But how do you know that job will be there come tomorrow. \n\n&gt; $ME - Because the company is worth significantly more than ____. We are growing and growing and have no stopped. Recent events at my job have put me in the spotlight in a good way. I am currently being groomed and the only reason I took this job was to pay off a debt. Now please fix my schedule. \n\nThe assistant manager grudgingly changed the schedule and told me I had made a big mistake. \n\nFast forward to last night. The store manager wanted to speak with me. She sat down with me at the table, handed me a write up, and then asked me one simple question. \"Where do you see yourself going in this company?\"",
        "created_utc": 1495214806,
        "upvote_ratio": ""
    },
    {
        "title": "Not technically my job, but hilarious nonetheless.",
        "author": "Vuthakral",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6bueb7/not_technically_my_job_but_hilarious_nonetheless/",
        "text": "I was 16 at the time of this, taking my Driver's Ed. class. There were points where we could stop and go walk out to get lunch and come back. One day, I went over to McDonalds, had to take a leak really bad too, so I went to the bathrooms before ordering my food, the bathrooms absolutely **REEKED** of weed, like I could barely breathe in there. There was nobody else in there, and no sign of anything left in the bathroom, so figuring nobody else wanted to smell that crap when I left the bathroom I went up to the guy at the register, and told him that the men's restroom smelled like someone just lit up a full marijuana plant in there. He lets out a heavy sigh, reaches down below the counter, and walks around to the bathrooms with a huge leaf blower, walking past me he says \"Not again...\"\n\n10/10 would share story to friends time and time again.",
        "created_utc": 1495087461,
        "upvote_ratio": ""
    },
    {
        "title": "Sneaking in at night",
        "author": "helpdesknoobie",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6btezh/sneaking_in_at_night/",
        "text": "I started at this Helpdesk job 2 weeks ago. Most of the calls we receive are users needing their password reset, account unlocked, or a driver installed. This afternoon I answered a call.\n\n&gt;I'm locked out of my computer by someone named *IT guy* and I think thats who is sneaking in at night.\n\nOn our systems, when a user doesn't log out of the computer, only that user can log back in unless the computer is restart. The *IT guy* had to visit the computer in person overnight to install a windows update.     I just simply asked her to restart her computer and that fixed the problem.\n\nWhat she said at the beginning grabbed my attention and before I completed the ticket I asked her to explain \"sneaking in at night.\"\n\nHere are the notes I ended up taking in case I had to submit another ticket.\n\n&gt;POC is concerned about frequent unauthorized access in work-space. POC states devices are left on when leaving work and are powered off/ manipulated when\nstaff arrives. Locks were installed to stop the issue when forks and spoons\nwere disappearing. Locks had no effect. Somebody then soiled a work chair and put it in the bathroom.\n\n&gt;Recommended to POC to contact manager, Site manager, and Facilities about\nthe situation.\n\nShe explained to me that a couple of months ago she started noticing things being disturbed in the office when they arrived in the morning. It started with computers and fans being switched off over night. Then chairs and the items in the general work space were being rearranged. When utensils like spoons started disappearing they installed locks on some of the doors. The locks did not deter the \"Unauthorized Personnel\".    \n\nOne morning they arrived at work. Everything seemed normal until someone walked into the bathroom. Sitting in the center of the tiled floor was an office chair that was delicately described as \"soiled.\"\n\nIn 7 years my boss has never dealt with anything that crazy. I guess it is all downhill from here.\n\nThrow away because coworkers know I'm posting this.",
        "created_utc": 1495074413,
        "upvote_ratio": ""
    },
    {
        "title": "Hey guys. We've just created a new subreddit for sharing stories about your horrible coworkers. /r/talesofmike we'd love for you to share your stories here!",
        "author": "hupacmoneybags",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6bl5ii/hey_guys_weve_just_created_a_new_subreddit_for/",
        "text": "Everyone has a \"Mike\" at work. Someone you can't stand. The guy everyone hates... Because he makes them hate him. Mods can delete this this isn't allowed I just thought you guys would like it since our subs are similar. \n\n/r/talesofmike",
        "created_utc": 1494978400,
        "upvote_ratio": ""
    },
    {
        "title": "Interview Questions Regarding Bullying and Aggression in the workplace",
        "author": "DocHolidayPhD",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6atypq/interview_questions_regarding_bullying_and/",
        "text": "[removed]",
        "created_utc": 1494622716,
        "upvote_ratio": ""
    },
    {
        "title": "Office manager throwing some shade",
        "author": "linzinthecity07",
        "url": "https://imgur.com/a/dSneL",
        "text": "",
        "created_utc": 1494612522,
        "upvote_ratio": ""
    },
    {
        "title": "A summer recycling job made me fear orange soda.",
        "author": "Duzzeno",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6alnoj/a_summer_recycling_job_made_me_fear_orange_soda/",
        "text": "One year in high school I got a summer job working in a recycling centre. It was a great job mostly due to the fact that my boss was a cantankerous old man who loved to talk while he worked. The man could curse a blue streak like nobody's business.\n\nMost of the job was basically sorting people's trash because apparently nobody knows what is recyclable these days (I mean come on, who thinks a diaper is recyclable?) but it was always an adventure and it paid alright.\n\nThe recycling centre just barely managed to pay for itself so we were always looking for ways to make some money and the best way to make money in recycling is through aluminum. We would always keep an eye out for that precious metal and would even make occasional trips when we would hear about a large haul in town. One such tip came from a nearby grocery store.\n\nThe store had a small warehouse and was always looking to save space. One of the ways they saved space was storing things too many pallets high. At one point someone had stacked two pallets of Orange Soda on top of each other and then put something far too heavy (or incorrectly) on top of it to save space. The heavy item wound up crushing the top pallet causing it to spray orange soda all over the warehouse.\n\nMy boss hears about this soda spray and immediately scopes out the place because soda cans are made from aluminum, cha-ching, and is hoping to snatch them up before they're disposed of. I'm not sure why but he was only able to get the bottom pallet grumbling something about the other one already being gone but the store was happy to donate the remaining pallet to us as long as we were willing to haul it on out of there.\n\nThis bottom pallet was perfectly fine aside from the fact that the entire thing was coated in sticky soda from the burst one above it so I was given the job of opening each can, emptying the contents, and placing the cans in the crusher we had. Some of the cans were in perfectly fine shape and we were welcome to drink as many as we wanted as long as we didn't take them off of the property. No free soda for home. \n\nTo was plopped down with a bucket and a pair of gloves with a pallet of sticky soda on my right and an empty crusher on my left. The only thing is, have you ever tried to open a can of soda with gloves on? After a while I gave up on the gloves and started opening cans with my bare hands. Unfortunately after a few cans in quick succession my finger was beginning to get sore so I started opening them with my ring finger instead. After a few hours of opening cans I had trained myself to open cans with every finger, even my pinky. This later became a party trick I would do for easy to entertain drunks in college.\n\nThe next day I wake up and my hand is killing me. Every finger has little half moon scar/welt in it from opening cans. I'm young and dumb so I go about my day which involves among other things, handling people's trash. I'll save you the gross details but eventually my boss realizes that something serious is going on and rushes me to the hospital. I had gotten quite a nasty infection and after a few days of medication and bed rest I was back fighting fit. Honestly I felt fine the whole time aside from the pain in my hand but I was a lazy teenager and loving an excuse to sleep in.\n\nTo this day I'm still not a huge fan of that soda.\n\n**TL;DR** Recycling centre job had me opening an entire pallet of soda which led to an infection and a disdain for orange soda from that day on.\n\n**Bonus side problem!**\n\nI was told to dump the bucket of soda outside since the sugar would \"wreck the pipes\" so every couple of cans I poured it outside. The small pond I created not only killed the grass nearby but also had a similar effect to salting the ground, meaning that nothing grows within a few feet of it to this day.",
        "created_utc": 1494524117,
        "upvote_ratio": ""
    },
    {
        "title": "We are closed",
        "author": "crazyyarn",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6ag743/we_are_closed/",
        "text": "This happened about a month or so ago on a slow Friday evening. I work part time at a university library that is open to the public so it is not unusual to have community members come in to borrow items.  My coworker and I had already cleared the floors, shut off the computers, and turned off all of the lights except those in the circulation area. As we are getting ready to leave a women comes down from the 3rd floor, which should have been cleared, wondering why the lights were all off and with a DVD collection on how to learn French. We were flabbergasted as to how she got past both of us and how she didn't realize we were closed by the lights being off and only one door open. Thankfully she was apologetic and thought that the individual rows had their own lights. We decided to boot the computer back up and check the material out to her because it was easier for all of us if she didn't come back anytime soon. My coworker and I have not seen her since.",
        "created_utc": 1494456164,
        "upvote_ratio": ""
    },
    {
        "title": "Ticket submitted to Facilities today",
        "author": "JamesHaven75",
        "url": "http://i.imgur.com/zQLzKMT.png",
        "text": "",
        "created_utc": 1494008914,
        "upvote_ratio": ""
    },
    {
        "title": "How my company dodged the outsourcing bullet and avoided being \"that company\"",
        "author": "Duzzeno",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/69fpwn/how_my_company_dodged_the_outsourcing_bullet_and/",
        "text": "I work for a wholesaler which basically means we buy a thousand of one item, sell bunches of one hundred, so companies can sell individual items and everyone makes a profit. We have a massive online database where all the info is stored and people can use our website to buy items.\n\nI started here around ten years ago and was happily working away until we get called into a meeting to inform us of some great news for our company. We're going to improve our website by outsourcing the data entry to a company in India who will enter it for a fraction of the price. (Some of our online items had an all caps auto generated title with no additional information) The time we save will reduce costs, up sales, and assure generous bonuses for all people involved.\n\nThe great speech is winning everyone over but I start running through the logical path and start to dread the outcome. If we outsource data entry then we can probably outsource coding. If we outsource coding then we can probably outsource design. If we outsource design we can probably outsource just about anything else. I immediately start working on my resumé as I picture my job being sent overseas.\n\nThe six month project wound up becoming a 2 year project that we're still getting echoes of occasionally to this day.\n\n**Some of the highlights:**\n\n- Product bullets, (the bulleted list of specs like this list) all began with the word bullets. We do not sell anything gun related.\n\n- The second language content for our bilingual website being google translated to a third language, causing us to realize they were only doing half the work.\n\n- Instructions taken so literally that the entire content of the page was entered as information which included items such as: Navigation of the supplier page, Header and Footer, and Logos in text form (with image logos being described)\n\nThere's more but these are just some that jumped to mind.\n\nThe company trashed their hopes of the entirely outsourced website and made use of what they could from the project and have gone back to their roots of honest well paid labour. I'm proud to say that I still love the company and we've managed to consistently being awarded one of our country's best managed companies several years in a row now!",
        "created_utc": 1494001634,
        "upvote_ratio": ""
    },
    {
        "title": "The Tattle Tale",
        "author": "Dfiggsmeister",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/69eurp/the_tattle_tale/",
        "text": "This goes back a while ago at my first company.  You can see my other posts about the same company:\n\n[Jumping the Corporate Ladder](https://www.reddit.com/r/talesfromthejob/comments/68t39r/tried_to_jump_the_corporate_ladder_get_blacklisted/?ref=share&amp;ref_source=link)\n\n[Talent Factory](https://www.reddit.com/r/talesfromthejob/comments/68tnb3/be_wary_of_the_talent_factory/?ref=share&amp;ref_source=link)\n\n[Slightly Racist Boss](https://www.reddit.com/r/talesfromthejob/comments/68tcge/the_slightly_racist_boss/?ref=share&amp;ref_source=link)\n\n**Background:** Going back to 2008, we had this guy in our office that loved to tattle on everyone. If you came in late, bosses would find out and you'd get reamed. Nobody realized who it was that kept telling the bosses because he was really covert about it, until I fucked up his scheming.\n\nThe guy was nice and seeming enough, but there was always something just slightly off about him. He kept to himself a little but he was a hard worker, his girlfriend was in the military and was always abroad so he was usually on his own. He never really went out like the rest of us so we figured he didn't really drink. He had been at the company almost as long as I had and right before I left the company, he was slated to take over my work.  \n\nHere are the players:\n\n* **Tattle Tail:** TT for short, the guy who ratted on everyone\n\n* **Mike:** One of my good friends from the company.  We started living together after about a year and a half.\n\n* **David:** Met him later at a company alumni event, became good friends afterwards.\n\n\n**The outing:** What he didn't anticipate was what I had left behind in the files. At the time, I had been single and ready to mingle. I had a few girlfriends from time to time but spent a lot of time flirting with random girls online. Due to the nature of our business, this meant I did a lot of it while at work since most of the time I was in the office vs at home.\n\nI was good friends with the IT personnel at the time and so I had open access to my computer. As a result, I was able to download certain programs and files at will without worrying about IT snooping. I had downloaded some *ahem* unsavory images of certain women I had been seeing.\n\nPrior to leaving, I went through my folders on my hard drive and cleaned out anything and everything private, including said files. What I had neglected to delete were the files out on our shared drive. At some point, I must have backed up those files onto there and completely forgotten to dump those from the system; I was in a hurry to get the hell out of there and didn't do my due diligence.\n\nAnyways, so TT starts digging through my files, searching for my work.  I had done a pretty good job in labeling my files, so they were easy to find.  I guess TT decided to dig further and went through *All* of my files.  Lo and behold, he found my stash, even though it was 1 picture, but it was enough to run to the directors and tell on me.\n\nProblem is, I was already gone from the company and everybody had access to the files. Since they really couldn't do anything, TT decided to start a smear campaign against me, using the image as evidence that I was a scumbag.\n\n**Where he failed:** There were several things going against the guy.\n\n1. He wasn't very sociable and had been an outcast from the get go\n\n2. I was still really good friends with a lot of people in that office, including JR.\n\n3. Two of my friends from the office were living with me still.\n\n4. People were leaving in droves at this point so nobody really gave a shit.\n\nBecause he started the smear campaign, my roommates alerted me to it as he went around the company telling people I was a sleaze ball. When Mike asked me about the photo, I scrambled to find my portable hard drive of where I kept all of my work files. I found the photo he was referencing. I immediately burst out in laughter.\n\nTT was claiming I had spied on a previous roommate who was quite attractive and had the photo on my personal computer. I had no photos of her, but it was a photo of a girl I met once and had a fling with then that was it. I had completely forgotten about it.\n\nMike was pulled into the offices of the directors and was asked about the photo. He told them what I had told him. They asked if I was ashamed. Mike goes, \"Not only is he not ashamed of it, but he laughed his ass off when I told him.\"\n\nBecause it was so blaringly obvious that TT was willing to tell on former co-workers, people started putting two and two together.\n\n**Aftermath:** TT realized his folly and decided that he was done with the place and moved in with his girlfriend where she was stationed.  Eventually he quit the company.\n\nBefore that happened, the directors made an announcement that employees were not allowed to store personal information on the networks anymore and that they'd do routine checks for images and documents.\n\nI became a legend because of my reaction. David approached me several years later at an alumni event.  Him and Mike had been talking since we all had left the company so they kept in touch.  Mike asked me about the photo scandal and I started laughing again about it. He relayed to me that when news broke out how I had reacted to the image being found, people had a new found respect for me.\n\nIt dawned on me why I started getting more invites for outings after I had left.  I guess I had made an impression there.\n\n**TL;DR** Left a picture of a naked woman in my folders on the shared drive, TattleTale rats himself out, Directors make a new rule, I become a legend.",
        "created_utc": 1493992956,
        "upvote_ratio": ""
    },
    {
        "title": "Pardon my French...",
        "author": "FergusonNDC",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/69cvbh/pardon_my_french/",
        "text": "When I was in highschool I worked at an independently owned restraunt. As we are in Quebec, the majority of the people speak French obviously. However, I do not judge people who can only speak English. One day, a customer walks through the door and I greet him in French like I normally would... Me: \"Bienvenue!\" Customer(in an English accent):\" uh, bonjour... je besoin de...\" (When it should actually be \"j'ai besoin de...) As I notice he is struggling, I try to be kind and switch to English Me:\" do you need a table, sir?\" At this point he loses his temper. Customer: \" honestly? God damn it you French people are all the same, pompous assholes are what you are! You think that if someone can't speak your precious French perfectly then they shouldn't at all!\" Me:\"I'm sorry sir! I didn't mean to...\" Customer: \" and you have the nerve to still talk to me in English!\" Me: \" uh..\" Customer: \" well what?forget it, you just lost my buissiness. Explain to your manager how you're losing customers due to your bigotry!\" He then proceeded to walk out the door, slamming it on the way out. The customers who witnessed the whole thing just laughed and told me not to worry about it.",
        "created_utc": 1493962371,
        "upvote_ratio": ""
    },
    {
        "title": "Dear customers: We laugh at you",
        "author": "havenothinglefttosay",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/69c077/dear_customers_we_laugh_at_you/",
        "text": "Dear Customers \n\nIt's come to my attention you're not satisfied. \n\nSomething is wrong?  Well then feel free to make a song and dance about it. It could be the exercise you needed. Get it out of your system. \n\nYou want to speak to my manager?  He's the one who hired me and taught me to say  exactly what I just told you. What makes you think you'll have any more luck with him?\n\nYou want to raise your voice? Go for it. If it makes you feel powerful,  then it must be the right thing to do. Surely you are representing customers everywhere, and your voice must be heard. \n\nYou want to complain that we never contacted you? I would want to complain that you didn't write your number clearly, but what would that achieve?\n\nYou want to sue us? There's a lot of legal fees involved, I hope it's worth it. I won't try to talk you out of it.\n\nYou want to go crazy and start flipping tables?  Please do. It's been a while since I've had anything interesting to post about on Facebook. (or reddit) \n\nBut at the end of the day, you can tell all your friends how you 'put me in my place '. But please remember that I'll also be sharing the news with my own friends. \n\nThat's right, we don't feel intimidated, or stressed out or even angry. No, we put all our energy into not letting that small smile slip across our face. \n\nYes, as soon as you leave, your visit is going on Facebook. I'm going to go right to the shop next door and tell my mate what just happened. Sometimes he finds it even more funnier than I do.\n\nSo thank you for dropping by my shop and making our day. \n\nPlease come again \n",
        "created_utc": 1493950413,
        "upvote_ratio": ""
    },
    {
        "title": "How many pixels should that vector be?",
        "author": "IAmUnique-2r8y4dd3a3",
        "url": "https://i.redd.it/e476ijzfahvy.jpg",
        "text": "",
        "created_utc": 1493901507,
        "upvote_ratio": ""
    },
    {
        "title": "Today I switched my job.",
        "author": "megabitch420",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/691wnz/today_i_switched_my_job/",
        "text": "I have been working for a gas station for 2 years now and the job itself was easy but night time co worker never did her job correctly.  My boss got tired of hearing me complain about having to do both jobs with the lowest pay. So he thought he would put me at his hardest job in a different station. \n\nTurns out im better at the new job and feel more fulfilled and useful. It was hard and I struggled but I loved every second of it. Kinda excited to go to work tomorrow. ",
        "created_utc": 1493833453,
        "upvote_ratio": ""
    },
    {
        "title": "When Mikey gets food poisoning",
        "author": "Duzzeno",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/68uz1b/when_mikey_gets_food_poisoning/",
        "text": "We all have that one guy who is always down for food. He'll happily eat your leftovers, snatch up any noms that are offered and is generally the \"Give it to Mikey, he'll eat anything\" of the group.\n\nAt my company people love doing food related activities. Potlucks every other month. Snacks brought from home. Cookies when you make a trip out for lunch. The whole thing. And Mikey took advantage of all of them.\n\nRight up until about a week ago.\n\nLike most companies ours has a fridge and several people who frequently forget to clean it out. We also have several people who love to remove the dirty containers from the fridge and leave passive aggressive notes next to them.\n\nMikey heads to the kitchen one of these times to get water and sees that someone must have put the leftovers from a potluck out to share and chows down unknowingly eating several varieties of bad food.\n\nI have no idea why he didn't stop immediately but he somehow managed to make it through three different containers before realizing his error and rushing for the bathroom. If the sounds I heard from there for the rest of the afternoon were any sign then he deserved the next few sick days he took off.\n\nEdit: Just FYI, he didn't actually get food poisoning, just violently ill and took a few days off out of shame mostly. He's since made a few Facebook updates so I know he's ok.\n\n**Update:** My company also brings in a cake whenever an employee has a birthday. Mikey grabbed two portions as well as two handfuls of other snacks that were on the birthday boy's desk. So... no... he hasn't learned anything.",
        "created_utc": 1493750009,
        "upvote_ratio": ""
    },
    {
        "title": "Be wary of the \"Talent Factory\"",
        "author": "Dfiggsmeister",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/68tnb3/be_wary_of_the_talent_factory/",
        "text": "If you ever hear your company talk about how they're a \"Talent Factory,\" be afraid, very afraid.  I've heard this from three separate companies, and all three times right before the shit hit the proverbial fan. Usually there was increased workloads followed by massive lay-offs/quitting and then followed by merging of roles and people just generally being burned out.\n\n**Story Time:** The first time I heard that word was when I was at my first job as a Market Researcher. This was a few months before I found a new job and left the company. We had a Townhall with a VP of our group. During said call, the VP called our group a \"Talent Factory\" in that we should be proud for the fact that other companies like to steal their employees since they churn out such high quality talent.\n\nOh how that become so true..  I was part of the first wave of employees to leave the company, if not one of the first people to leave and go elsewhere. A few months after I left, a whole wave of people started leaving. Eventually turn over was so high that the corporate executives started running statistical models to determine which people had the highest probability of quitting the company and going elsewhere.  Part of this was to anticipate who was leaving to back fill roles, but the real reason was to figure out how to coerce employees to stay and if that failed, to fire them and essentially make them unhirable (kind of backwards but not having a job makes companies pass over you).\n\n**Side note:**So why were people leaving in droves? The company wanted to move the entire office into the corporate HQ, which would have increased people's commute and/or require relocation.  On top of this, the company started outsourcing its research services to China and India, which only made things worse.  Ironically, outsourcing modelling seems like a great idea, but in reality it adds a lot more work and increases costs since work constantly has to be re-done.\n\n**Back to the Story:** Eventually, the move happened and those left merged over to HQ. About two years after the move, the entire group was completely dissolved and I believe there's maybe a handful of people still working there from our original group of 50+ people.\n\nIn any event, if your company ever utters the fatal words of \"Talent Factory\" know that you're about to hit into a world of chaos and you should start looking elsewhere.",
        "created_utc": 1493737479,
        "upvote_ratio": ""
    },
    {
        "title": "The *Slightly* Racist Boss",
        "author": "Dfiggsmeister",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/68tcge/the_slightly_racist_boss/",
        "text": "Sorry for the flooding of stories but I just remembered another one from the time I worked in Marketing Research for a large research company.\n\n**Back Story** This goes back about 8 years ago, after the economic crash of 2008/2009.  This was mid 2009 so things were just ok.  Our company started consolidating offices.  We were stationed in a remote office in Connecticut and our office was getting merged with an office from NY.  They had let go a number of people on the NY office team so they decided to move them to our office. This team handled a different aspect of the business; they primarily focused on our databases and data warehousing.\n\nOur team in market research wasn't what you would call culturally diverse. We had a smattering of different ethnic groups, but we were dominantly white 20 somethings as the company had a habit of hiring recent college graduates and working them to the bone. The NY office was a lot more diverse.\n\nIn my previous post, JR had moved back into the office. What I didn't tell you before is that JR wasn't originally born in the U.S. He was born in Greece and immigrated at a young age so English was mostly a second language. If you've ever met someone who speaks greek, they tend to flub english sayings all the time which can cause some hilarity.  One of those times happened during a townhall.\n\n**Story Time** As being in a remote location, we did a townhall in a big conference room. We were often told that we had to be 5 minutes early to any meeting otherwise we would considered to be late. So most of our team was already in the conference room. JR, the database guy from the previous story, one of his underlings, and I were hanging out by the window discussing data issues we were having on a project. Our team started trickling in.\n\nWe see a couple people from our NY office walk in but knew that there was more of them. The town hall was set to start in a few minutes but the NY office folks were running a little behind. A black lady from the NY office walks in and JR being JR, yells out loud, \"Where are all the white people at?\"\n\nOur entire team erupts in laughter as the black lady gives JR an evil glare. JR is confused, he doesn't understand why we're all laughing. Database guy replys back between giggles, \"You just asked a black lady where all of the white people are at, in a room full of white people.\" JR turns beat red, starts telling us to shut up and stop laughing; this just spurs us on even more. JR tries to back pedal and says, \"I meant to say where are all the white plains people at.\"  We laugh harder and JR kicks us out of the conference room. The three of us spent a good 20 minutes laughing before we could finally compose ourselves and come back in.\n\nI have a lot more hilarious stories about JR and that company.",
        "created_utc": 1493734270,
        "upvote_ratio": ""
    },
    {
        "title": "Tried to jump the corporate ladder; get blacklisted",
        "author": "Dfiggsmeister",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/68t39r/tried_to_jump_the_corporate_ladder_get_blacklisted/",
        "text": "Moved from r/ProRevenge and r/talesfromprintandcopy; not sure if this is a place for it, but felt I wanted to share my story of a crazy co-worker.\n\n**Back Story:** This happened about 10 years ago, when I first moved from my hometown to go work for a giant research company. When I first joined the company, I was assigned to a mentor, we'll call her Melissa.\n\nMelissa had been at the company for a few years and was at a Senior Analyst level and she had been gunning for Manager/Director for some time.  Melissa was a little weird as she always carried around a 1 liter plastic water bottle.  And no, not the hard plastic kind; the kind you buy at a convenience store; maybe evian or something like it.  Anyways, she toted the bottle around every where she went, she was/is slightly neurotic, but the great aspect about her was that she was a fellow nerd and her soon to be husband (John) was a big gaming nerd.  Being that I was new to the area, I soon became fast friends with both John and Melissa.\n\nMelissa and John had been planning their wedding as I had come onto the scene, they invited to their wedding which was awesome of them. I knew Melissa for a few months (started in May) and she invited me to her wedding in August.\n\nWe both had a boss named JR. Much like other bosses at our company, JR came from a competitor and became a director quickly after joining and then eventually made his way up to senior director. The company had a habit of promoting people based on their work ethic (working all hours of the day/night/weekend) vs how they treated employees. JR wasn't by the far the worst offender but he had a habit of yelling at people if they screwed up.\n\nWhat I didn't know is that JR and Melissa had a horrible relationship. Melissa would do things to subtly screw him over but he could never really do anything about it since there was no real proof. As the newbie, I started to figure out quickly that Melissa really really wanted to be a director.\n\nAfter being under Melissa's wing for several months, JR decides that its time that I take on my own projects and moves me off of Melissa's projects onto my own. I'm thinking, great, this will be my time to shine! Melissa goes off on her honey moon and I start working with another Senior Analyst.\n\nWhile on Melissa's honeymoon, JR calls us in to his office (there were 5 of us total, 4 excluding Melissa) and tells us he's been promoted to VP and is moving to the UK in a few weeks. He also announces that Jen, our current senior manager would move up into his position as a director, Peter would become the new senior manager and the rest of us would remain as is.\n\nBeing close friends with Melissa, I knew that she'd be pissed about the changes, especially since Melissa and Jen absolutely despised each other. Jen knew her shit and did things by the book so I had a lot of respect for her.\n\nAnother week goes by and Melissa finally comes back from vacation. Within an hour of her being at her desk, she pulls me outside for a chat. She rips into me about how I didn't tell her about the changes and what a bitch Jen is and that she should have gotten the promotion. I pointed out that Jen was already a manager and JR probably went down the totum pole. Melissa was having none of it... Little did I realize I had become an unwilling participant of her scheme to topple Jen, which hilariously backfired in her face.\n\n**The Scheme:** As I mentioned above, Melissa decided that Jen had to be destroyed in order for Melissa to become the new Director. And to do that she decided to make Jen look incompetent...  In front of a client. As part of that scheme, she started making odd requests from me.\n\nShe asked me when Jen would come and go from the office and what questions she asked of me to do. Melissa also asked me if I could forward Jen's emails to her. Being wise to what Melissa was doing, I waited for Melissa to go on a smoke break (which she often did) and walked into Jen's office. I asked her why I had to start sending Melissa emails from Jen and if I should be taking orders from Melissa now. Jen looked pissed but said under no circumstances am I to send over any emails to Melissa.\n\nI went back to work like nothing had happened and quietly started collecting all of the email requests from Melissa. I knew something was up and knew somehow I was being roped into something bad, very bad. \n\nAs I mentioned before, I knew her husband John very well at this point and made a polite mention that Melissa was doing some weird stuff at work. He told me that she mentioned something weird to him but shrugged it off. I told him she had been acting really weird lately towards me and wasn't sure if I had done something wrong. He assured me that I hadn't pissed off his wife.\n\nAll is quiet in the office up until a week before Jen and Melissa are to go down to a client's office. They were supposed to present a proposal for a project, get the nod from the client and then start the project. Melissa was to be the lead with Jen as the acting director.\n\nThat's when the phone calls, weird texts and emails started hitting me. Melissa started reaching out to me asking for help on various slides, if I knew any drug dealers for either cocaine or Aderall, and if something happened by Friday, I would have her back. I told her it depends on what she was doing. She said, you'll see. \n\nI figured what the hell and helped her out with her slides. Come Friday morning, Melissa is in a panic. They have to get down to the client by 1pm and Melissa is still not done with her slides. She starts calling in favors to have people help her out. We pull together a bunch of stuff for her.  I am then asked to drive Melissa, Jen, and our data expert to the client meeting (not the first time this has happened); I oblige. On the way to the meeting, Melissa is still working on the slides.\n\nI drop them off, head back to work, and think nothing of it.  By about 4 pm, all three of them walk into the office. Jen immediately storms into her office and slams the door. The data guy looks at me and just shakes his head. Melissa comes to my desk and asks me to step outside. I'm thinking to myself, \"Aww shit, what did you do?\"\n\nTurns out, Melissa decided to use the client meeting to sabotage Jen. She overtalked Jen and generally threw Jen under the bus for not having the slides completed (Melissa was supposed to be the one doing them). Jen being professional, kept quiet until the end of the meeting and afterwards on their taxi ride back, proceeded to scream at Melissa for the bullshit she just pulled.\n\nMelissa has me outside and tells me the whole story and I stand there flabbergasted. She then pulls out a tape recorder and says, \"Oh and btw, I got the whole thing on tape.\"  We live in a state where two party consent is required by law to be recorded. This is highly illegal and can land you in jail. I inform Melissa of this and she tells me that she doesn't care, she's got the company by the balls (for what, I have no idea).\n\n**The Revenge:** I finally realize what all of the emails and check-ins were for, she's trying to get Jen fired for incompetence. I immediately save everything I have (emails and IMs) and put it in a file, knowing what's about to happen. I also notified her husband that she's about to be fired and to have a talk with her.\n\nJR comes back into the office on Monday. Jen and JR are in the office and stuck in a room all day. This goes on for a few days before Melissa is called into the office. I remain quietly shaking and wondering what's about to happen. Melissa is still a good friend but holy shit I don't want to be screwed over.\n\nThe time comes and I'm called into JR's old office/Jen's new office. Both ask me what happened. I tell them my view of events. They asked if I knew about the tape recorder. I told them the truth that I hadn't known about it until after the fact. \n\nThey asked for my laptop, login and password. Here it is, I'm fucked because of Melissa. She's decided to fold me into her scheme and we're both going to get canned. Knowing they were going to ask for that, I tell them to look into the evidence folder on my hard drive. They thank me, tell me that I shouldn't discuss this with anyone and to have a good weekend.\n\n**The Aftermath:** Monday morning rolls around and I come into the office and am pleasantly surprised to see my laptop back at my desk with a note to see JR and Jen when I settle in. I walk into the office and they ask me to go for a nice long coffee break with the rest of the team.  I head out for a few ours with the team, we have some coffee and just bullshit a little and finally get back into the office a few hours later.\n\nMelissa's desk is empty with no laptop, her stuff in a box. I get pulled into the office. They tell me that Melissa has been let go due to gross insubordination and that I am to no longer discuss the company with Melissa. \n\nFrom what I found out later from Melissa, she had decided to blackmail both Jen and JR with the tape of them lying to the client about services and how she was going to whistle blow on the company if they didn't give her a promotion and a raise. They asked for proof and when she played the tape, nothing had been recorded (I guess the recorder was shitty). They promptly asked her to leave and that they'd have a decision by Monday.\n\nAt this point, our friendship started to get rocky as Melissa started asking me for weird things and her marriage with John started going into the crapper.  Eventually we stopped talking as I realized how batshit crazy she is and how detrimental it is to be associated with her.  But the story doesn't quite end here.\n\n**Karmic Backlash:** Remember how I said there was some serious karmic backlash?  Here's where Karma stepped in and screwed her life over even more.\n\nShe had found a new job after she got fired, but they had no idea she had been fired. They assumed she just left to come work for them. A year later, she was let go because of budget cuts (this was back when the market crashed in 2008; the real story is that they did a background check on her and called JR, he told them what happened). After that she did a series of contract work with various other research companies but never did land back on her feet.\n\nDuring the course of her contract work, things between John and her went south fast. She alienated all of their friends by calling/emailing/texting people randomly at night, asking for various drugs and drug dealers. Her insanity spiraled out of control to the point where they started going to couple's therapy. Months before their marriage collapsed I get a random call from Melissa asking me to lie to their counselor, acting like her husband John, and telling the counselor that I had been beating her. I flat out refused and told her to never call me again.\n\nJohn and I continued to be friends and we hung out at other people's places together. After the incident with the therapist, Melissa went on a mini-vacation to see her favorite band.  A week afterwards, Melissa is acting super awkward with John and so he grills her about it. She confesses and tells John that she had met a random guy online, met up with him at the concert and they hooked up. John was finally done with her shit and divorced her. He was awarded alimony for all of the debt she drove up on their cards. He soon moved out of the state with his new girlfriend. We still game via online, despite time differences.\n\nLast I heard of her, she moved back home with her parents where she continues to be absolutely weird to this day.  I think she was doing some kind of secretary type of work.\n\n**TL;DR:** Mentor tries to undermine her new boss, winds up getting canned. Karma jumps in and she becomes known as the weird lady in our industry, essentially being blacklisted from the industry. Husband divorces her after her crazy antics, dangerous behavior, and having an affair.",
        "created_utc": 1493731453,
        "upvote_ratio": ""
    },
    {
        "title": "I don't work here.",
        "author": "SomeUnregPunk",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/67lkpr/i_dont_work_here/",
        "text": "I'm a managing agent for some apartment buildings. So sometimes I head out to local giant hardware store with an employee or two to pick bulk items like sheetrock, cement bags, sand bags, tools, lights &amp; fans, etc. I tend to go while wearing painter's slacks and shirts because I'd rather not dirty up my good clothes for this task. Sometimes I get other customers asking me where something is because for some reason they assume the guy that is wearing white which isn't the color of every employee's shirt in the place must also work there. I normally just say, *\"I don't work here,\"* and ignore them. In in this one instance that didn't work.     \n\nI'm in the plumbing aisle trying to find the bulk items of toilet flappers. When an mid-forties lady and her family or friends that seemed to be in their thirties asked me where they could find the a type of paint. I say the thing I normally say while looking through the shelves. They all get offended.   \n\n**Lady 1:** \"Excuse me?\"  \nI ignore her. I haven't realized that she is still talking to me. I found what I was looking for and was grabbing a few packages.   \n**Lady 2:** HEY! We are talking to you!   \n**Lady 3:** What idiot trained you?   \nAt this point I got what I needed and was backing away from the shelving and noticed the ladies were staring at me angrily. I realized then, that my standard reply didn't work. So I shrugged and said, *\"I don't work here. I have no clue.* Then I turned around started to leave.     \n**Lady 1:** I don't fucking care if you don't work in this aisle. I need some paint and if you don't help me, I'm going to do my best to get you fired.   \n**Lady 2:** We should do it anyway. He needs to learn that's not how you talk to a lady.   \n**Lady 3:** Asshole. \n\nWe were in aisle 6 and I knew the public bathrooms was located over at aisle 23, so I said, \"I'm sorry. The paint area is located in Aisle 23, go halfway down the aisle and on the right hand side there will be group of people that can best help you.\"     \n\n**Lady 1:** Was that so hard?   \n*me: No it wasn't. I hope you have a pleasant day.*     \n\nThe best part? The paint aisle is located in aisle 3. ",
        "created_utc": 1493176742,
        "upvote_ratio": ""
    }
]