[
    {
        "title": "Do you watch a samurai film set in Japan or do they have to be set in San Francisco to appeal to a bigger audience?",
        "author": "DirectorAkiko",
        "url": "https://www.reddit.com/r/television/comments/117liyq/do_you_watch_a_samurai_film_set_in_japan_or_do/",
        "text": "[removed]",
        "created_utc": 1676929537,
        "upvote_ratio": 1.0
    },
    {
        "title": "School Spirits/Official Trailer/Paramount+",
        "author": "StrawberryShortcakeL",
        "url": "https://www.youtube.com/watch?v=nB2w3OuaP64",
        "text": "",
        "created_utc": 1676928887,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m starting to hate shows releasing weekly on streaming.",
        "author": "Isaac706",
        "url": "https://www.reddit.com/r/television/comments/117kb2k/im_starting_to_hate_shows_releasing_weekly_on/",
        "text": "I know, call me young, but I’ve grown accustomed to and really enjoyed binge watching shows for years. I liked the freedom of having every episode in front of me, so I could watch however many I wanted, whenever I wanted. Now, I liked this format when it’s return was new with shows like Wandavision and the Mandalorian, but now it makes it feel like a chore to watch my favourite shows. For example, I really love The Last Of Us. It’s my favourite game of all time and I am enjoying the series a lot. But only being able to watch one episode at a time and feeling almost obligated to watch to stay in the loop as avoid spoilers makes it so much less exciting to watch. I grew weary of it around the time of Hawkeye, but now I’ve just had enough of watching great shows not feeling like an exciting time anymore, but just a chore that I have to complete. I’ve tried watching some when they’re all finished so I can binge them, but by that time its either been spoiled for me or everyone’s lost interest. It’s so annoying and I can’t wait for this crap to end yet again. Sorry for the random long paragraph I just really wanted to get this off my chest!",
        "created_utc": 1676926662,
        "upvote_ratio": 1.0
    },
    {
        "title": "RIP Actor and Comedian Richard Belzer, Munch of “SVU” and “Homicide,” Famous for Dry Sense of Humor",
        "author": "DeadLizardBill",
        "url": "https://www.showbiz411.com/2023/02/19/rip-actor-and-comedian-richard-belzer-munch-of-svu-and-homicide-famous-for-dry-sense-of-humor",
        "text": "",
        "created_utc": 1676926361,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a teacher looking for outdoor live videos where a tv presenter deals with any kind of issues",
        "author": "GreatMadaleno",
        "url": "https://www.reddit.com/r/television/comments/117k5k5/im_a_teacher_looking_for_outdoor_live_videos/",
        "text": "I need them for my classes to show my students how to solve different kind of situations... can you help me?\n\nI had my previous post deleted so wanted to explain myself better.  I've read the rules but I really don't think this is a rule infringement...",
        "created_utc": 1676926286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bear McCreary's soundtrack for Rings of Power is the best part about the show for me",
        "author": "MayonnaiseOrchestra",
        "url": "https://youtu.be/Ip1a57e4yJ4",
        "text": "",
        "created_utc": 1676925171,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘The Tick’ Team Reflects on Live-Action Comedy’s Budget Challenges, Struggling With Fox: “They Murdered This One”",
        "author": "exophrine",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/ant-man-the-tick-live-action-series-1235325669/",
        "text": "",
        "created_utc": 1676920160,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some uncommon dialogues from the show “FRIENDS” that you read in the characters’ voices?",
        "author": "Even_Supermarket_629",
        "url": "https://www.reddit.com/r/television/comments/117h1u6/what_are_some_uncommon_dialogues_from_the_show/",
        "text": "Ross- Ohio, thank youu!\n\n\nRachel- I wasn’t supposed to put beef in the trifle\n\n\nChandler- And condoms are the way to do that. \n\n\nJoey- What’s not to like? Custard, good. Jam, good. Meat, gooood. \n\n\nPhoebe- It’s so exhausting waiting for death \n\n\nMonica- Welcome to the real world, it sucks. You’re gonna love it.",
        "created_utc": 1676918994,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some uncommon dialogues from the show that you read in the characters’ voices?",
        "author": "Even_Supermarket_629",
        "url": "https://www.reddit.com/r/television/comments/117gzfn/what_are_some_uncommon_dialogues_from_the_show/",
        "text": "Ross- Ohio, thank youu!\n\n\nRachel- I wasn’t supposed to put beef in the trifle\n\n\nChandler- And condoms are the way to do that. \n\n\nJoey- What’s not to like? Custard, good. Jam, good. Meat, gooood. \n\n\nPhoebe- It’s so exhausting waiting for death \n\n\nMonica- Welcome to the real world, it sucks. You’re gonna love it.",
        "created_utc": 1676918842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone still find it hard to believe Entourage depicted Mark Wahlberg’s experience as an up and coming star, even loosely?",
        "author": "Hessian-Ghost",
        "url": "https://www.reddit.com/r/television/comments/117ga5z/does_anyone_still_find_it_hard_to_believe/",
        "text": "What period in his career was it supposed to be based on, and how accurate do you believe it was? I guess I just don’t see him as being anything like Vincent Chase, nor any of his friends being remotely similar to the supporting cast.  \n\nI’m sure Wahlberg pulled plenty of women and enjoyed lots of the same fame and treatment as Grenier and his crew, I just don’t think he was ever a superstar A-Lister like DiCaprio or Brad Pitt the way Vincent Chase was depicted.",
        "created_utc": 1676917197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two and a half men (season 1-8) is the most underrated comedy series of all time",
        "author": "Exotic-Put9396",
        "url": "https://www.reddit.com/r/television/comments/117g0ng/two_and_a_half_men_season_18_is_the_most/",
        "text": "[removed]",
        "created_utc": 1676916586,
        "upvote_ratio": 1.0
    },
    {
        "title": "UK broadcaster ITV set to commission a reboot of 'Jeopardy!' hosted by Stephen Fry",
        "author": "ExtendJuanSoto",
        "url": "https://www.tvzoneuk.com/post/jeopardysfryhostrp1",
        "text": "",
        "created_utc": 1676914741,
        "upvote_ratio": 1.0
    },
    {
        "title": "UK broadcaster ITV set to commission a reboot of 'Jeopardy!' hosted by Stephen Fry",
        "author": "realRaviAhuja",
        "url": "https://www.tvzoneuk.com/post/jeopardysfryhostrp1",
        "text": "",
        "created_utc": 1676914666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Futurama as Marvel Heroes",
        "author": "ailover157",
        "url": "https://youtu.be/m4W9jkoFl7Q",
        "text": "",
        "created_utc": 1676913944,
        "upvote_ratio": 1.0
    },
    {
        "title": "I created this in my free time. I often do video edits like this. \"Martial Law\" I had a fear during COVID-19 that the country was going to turn into this so this was how I expressed myself to my subscribers on gamepwn at the time. Yes that's me. Revealed myself recently due to the state of the world",
        "author": "East_Home2007",
        "url": "https://www.reddit.com/r/television/comments/117ep31/i_created_this_in_my_free_time_i_often_do_video/",
        "text": "[removed]",
        "created_utc": 1676913874,
        "upvote_ratio": 1.0
    },
    {
        "title": "JUDGE JUDY JUSTICE [EPISODE 9611] Amazing Cases Season 2023 Full Episode",
        "author": "NeighborhoodLoose759",
        "url": "https://youtu.be/uRR8LwKwxaE",
        "text": "",
        "created_utc": 1676912509,
        "upvote_ratio": 1.0
    },
    {
        "title": "PSA: this isn't a The Last of Us sub, not every second post needs to be talking about one specific show.",
        "author": "HotSexWithGrandad",
        "url": "https://www.reddit.com/r/television/comments/117d9ud/psa_this_isnt_a_the_last_of_us_sub_not_every/",
        "text": "[removed]",
        "created_utc": 1676911680,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Party Down’ Revival: On the Rowdy Set With Paul Rudd, Adam Scott",
        "author": "jamesthegill",
        "url": "https://www.rollingstone.com/tv-movies/tv-movie-features/party-down-revival-starz-rowdy-set-paul-rudd-adam-scott-jennifer-garner-ken-marino-1234656859/",
        "text": "",
        "created_utc": 1676911348,
        "upvote_ratio": 1.0
    },
    {
        "title": "India's DisneyPlus Hotstar Streaming Site Down, Because They Forgot to Renew Domain, Others says it was a marketing stunt",
        "author": "SoftPois0n",
        "url": "https://www.youtube.com/watch?v=lbqV-h-6cQo&amp;ab_channel=BusinessStandard",
        "text": "",
        "created_utc": 1676908865,
        "upvote_ratio": 1.0
    },
    {
        "title": "55 of the Best Shows on Television",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676908554,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Best TV Shows You Haven't Watched Yet",
        "author": "Mr_Tanan",
        "url": "https://www.reddit.com/r/television/comments/1179gk2/the_best_tv_shows_you_havent_watched_yet/",
        "text": "1.  **\"Killing Eve\"** \\- A gripping drama about a cat-and-mouse game between a MI5 agent and a psychopathic assassin.\n2. **\"The Good Place\"** \\- A smart and funny comedy about the afterlife, featuring a great cast and clever writing.\n3. **\"Mindhunter\"** \\- A dark and intense crime drama that explores the psychology of serial killers.\n4. \"The Crown\" - A beautifully crafted historical drama that chronicles the life of Queen Elizabeth II and the royal family.\n5. **\"Dark\"** \\- A mind-bending sci-fi thriller that explores time travel and the interconnectedness of people's lives.\n\nWhether you're in the mood for drama, comedy, crime, or science fiction, these shows are sure to keep you entertained and engaged. Give them a try and discover a new favorite!",
        "created_utc": 1676906433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use ChatGPT to discover the best new TV shows and receive tailored recommendations based on your interests.",
        "author": "ForTechSupport",
        "url": "https://www.youtube.com/watch?v=MY5CR_4bf8I",
        "text": "",
        "created_utc": 1676905913,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Best TV Shows You Haven't Watched Yet",
        "author": "Mr_Tanan",
        "url": "https://www.reddit.com/r/television/comments/1178rai/the_best_tv_shows_you_havent_watched_yet/",
        "text": "1.  **\"Killing Eve\"** \\- A gripping drama about a cat-and-mouse game between a MI5 agent and a psychopathic assassin.\n2. **\"The Good Place\"** \\- A smart and funny comedy about the afterlife, featuring a great cast and clever writing.\n3. **\"Mindhunter\"** \\- A dark and intense crime drama that explores the psychology of serial killers.\n4. \"The Crown\" - A beautifully crafted historical drama that chronicles the life of Queen Elizabeth II and the royal family.\n5. **\"Dark\"** \\- A mind-bending sci-fi thriller that explores time travel and the interconnectedness of people's lives.\n\nWhether you're in the mood for drama, comedy, crime, or science fiction, these shows are sure to keep you entertained and engaged. Give them a try and discover a new favorite!",
        "created_utc": 1676905350,
        "upvote_ratio": 1.0
    },
    {
        "title": "New TV stream for free",
        "author": "frankiefunn",
        "url": "https://www.reddit.com/r/television/comments/1178gpe/new_tv_stream_for_free/",
        "text": "[removed]",
        "created_utc": 1676904601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find a tv show that I thought was called American Demonds",
        "author": "Impress_Active",
        "url": "https://www.reddit.com/r/television/comments/11782bd/trying_to_find_a_tv_show_that_i_thought_was/",
        "text": "There was an old series from a few years back where the characters were demons or something. Perhaps possessed? There were one or two Middle Eastern actors in it. Does anyone know the name? Thanks.",
        "created_utc": 1676903497,
        "upvote_ratio": 1.0
    },
    {
        "title": "An interpretation of symbolism I took from a moment in The Last of Us Episode 6",
        "author": "inbredandapothead",
        "url": "https://www.reddit.com/r/television/comments/1177q5c/an_interpretation_of_symbolism_i_took_from_a/",
        "text": "This moment that is [pictured](https://imgur.com/a/l0ojGRv) is Joel and Ellie travelling on the horse towards the University. This comes immediately after Joel teaching Ellie how to shoot a rifle. I believe in this moment there is some symbolism to be seen. \n\nTraditionally in the western world at least, things go from left to right. We read from left to right, book pages progress from left to right, music and video players go from left to right. Very often left to right means going forward. However, in this shot here, we see Joel and Ellie travelling from right to left. This can be interpreted in multiple ways, but I’ll mention how I interpret it for Joel specifically. \n\nEver since the outbreak, Joel has closed himself off emotionally a fair bit due to the death of his daughter Sarah. But 20 years later, he gets tasked with smuggling Ellie to the fireflies. He tries his best to emotionally isolate himself from her, but after all they go through an attachment obviously forms. \n\nJoel is not a fan of this of course, as he wants to avoid ever having anything happen to him again like what happened with Sarah. Neil Druckmann and Craig Mazin have been saying this on the official podcast too repeatedly, that he has sworn to never let anything like that happen again. He calls her cargo, explicitly says he’s not her dad, but the fatherly feelings towards her are developing. After Joel leaves her to go to bed after telling her that they’re going their separate ways, we see Joel thinking of Sarah, further solidifying these feelings, which then influences him to give her the choice to stay with him. \n\nAfter they leave Jackson we see Joel teaching Ellie how to shoot a rifle. This is a nice bonding moment for them as we see Joel opening up more emotionally to Ellie. Then the shot comes in that I love, where they’re riding from right to left as apposed from left to right. As I’ve stated, left to right is the traditional way, progress. I believe them riding the opposite way is symbolism of Joel going back on his promise to himself. Joel is opening himself up to the chance of being hurt again for the ability to almost be a father again to what is becoming his surrogate daughter in Ellie. Joel is taking what Tommy said about life not stopping for him like it did Joel and deciding it’s time to try start living again. \n\nI think this is only further solidified by the following moment where Joel tells Ellie about how he was a contractor before the outbreak which is another lovely bonding moment for the two. After this [we see Joel with a hearty smile on his face with Ellie resting her head on his back](https://imgur.com/a/xQGQx06) as they continue to ride from right to left, with [another shot following this of them continuing to ride from right to left.](https://imgur.com/a/YOMCZtB)\n\nThere’s many interpretations that could be taken from this I imagine, another little one could be that they’re making a mistake leaving Jackson and going towards the University where Joel gets hurt and whatever comes next happens. Would be interested in seeing what people think of this and what interpretations they have! ❤️",
        "created_utc": 1676902576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's a 27 minute video, of two short documentaries about Orthodontics that aired years ago, both starring *John Mew* (of *Mewing* and *Orthotropics* Fame)",
        "author": "Luke_low",
        "url": "https://www.reddit.com/r/television/comments/1176uih/heres_a_27_minute_video_of_two_short/",
        "text": "Both Starring British Orthodontist, *John Mew* \n(He's now 94 btw), a critic of conventional orthodontics, aswell as also starring a set of Twins *Ben* and *Quinton* one had \"Orthotropics\", whereas the other had Extraction/Retraction Orthodontics.\n\nThe latter starring Aussie Orthodontist, *Dr Derek Mahony* who advocated for Early-Intervention Orthodontic Treatment (E.g like starting at 7-9 years old, rather than 12-14) And also warned of patients being deceived into getting often times Unnecessary Teeth Extractions for Braces....\n\n\nhttps://youtube.com/watch?v=FK_xo5YtGYI&amp;si=EnSIkaIECMiOmarE",
        "created_utc": 1676900242,
        "upvote_ratio": 1.0
    },
    {
        "title": "BRAKING: Biden makes surprise visit to Kyiv ahead of Ukraine war anniversary",
        "author": "agonhaziri",
        "url": "https://informeri.net/2023/02/20/braking-biden-makes-surprise-visit-to-kyiv-ahead-of-ukraine-war-anniversary/",
        "text": "",
        "created_utc": 1676900107,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's the 'tv show feeling'? Like the 'after a movie' feeling, but for tv shows, and not only after?",
        "author": "Spare_8056",
        "url": "https://www.reddit.com/r/television/comments/1176k09/whats_the_tv_show_feeling_like_the_after_a_movie/",
        "text": "Is it a kind of production, that gives a standard 'feel' or emotional quality? \n\nWhat production aspects are they, and what is the feeling? Is it like how hbo or apatow documentaries feel similar, but a wider standard? \n\nIs it deeper? Or when is it not? Sometimes it feels nice, like less production would be worse, but other times confusing, like pop or classic songs for outro\n\nWho doesnt do that, but still a distinct style, not just plain?",
        "created_utc": 1676899426,
        "upvote_ratio": 1.0
    },
    {
        "title": "BBC News Says Presenters Can Relax Formal Dress Code As “Sweaty &amp; Dirty” Look Is More Trustworthy",
        "author": "MarvelsGrantMan136",
        "url": "https://deadline.com/2023/02/bbc-news-tells-presenters-to-relax-formal-dress-code-1235265455/",
        "text": "",
        "created_utc": 1676898569,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Last of Us is Overrated (Yes, this is another one of those posts, but I'm going to give reasons as to why)",
        "author": "Pelkur",
        "url": "https://www.reddit.com/r/television/comments/11762lq/the_last_of_us_is_overrated_yes_this_is_another/",
        "text": " \n\nWarning: spoilers from all episodes so far. No spoilers from the games because I haven't played them.\n\nI think The Last of Us is a wildly overrated show. It's not bad television, but it's not spectacular television by any means, and I wouldn't even give it an 8 out of 10 rating, let alone give it a 9+ as you see in some websites. Why? Because the show is plagued with bad/questionable writing. It has good writing too, of course, but the point I'm trying to make is that it's not even. It rises and falls, and that keeps the show from being considered more than \"mildly entertaining\".\n\nLet me use the last episode to make my point. I submit to you the following: the whole encampment part of the episode could've been axed and we wouldn't have lost anything.\n\nLet's backtrack a little. Storytelling 101: whenever you write a story, any story, for it to be considered truly good you need events that will impact the characters' lives and cause them to change, growing out of their wrong beliefs and adopting better ones. This process of change is at the core of most good stories, and it's often equated with \"character development.\" There is a basic formula that you follow when you're working on changing your character:\n\n1. Characters with incorrect beliefs about what they want\n2. Plot complication that forces characters to expose their beliefs\n3. Conflict between characters\n4. Relationship downturn and incorrect actions taken\n5. Further plot complications that forces character to make a decision that either confirms or goes against their incorrect belief\n6. Character chooses against their incorrect belief, forcing them to reevaluate this same incorrect belief and realize it was incorrect from the beginning\n7. Character adopts new and correct belief; meaningful change happens\n\nNow, let's take a look at the last episode of the show and run it through the formula.\n\n1. Joel has an incorrect belief: he's too afraid of losing someone again, and so he believes the best way to avoid suffering loss is to avoid human connection altogether. He realizes he's getting too close to Ellie and that's causing his fear of loss to grow, so his solution is to ask his brother to take Ellie to her destination instead. He doesn't want to get closer to Ellie, and he doesn't want to be responsible for her death.  \n\n   1. Problem 1: the show does a poor job at establishing Joel's incompetence in this regard. In fact, it does quite the opposite: he went across half the United States and was able to protect her. True, there were some close calls, but that's expected.\n   2. Possible Solution: this last episode should've established Joel's fear much better than just him sleeping through the night and having a mini panic attack. There should've been some event that caused him to nearly lose Ellie due to his incompetence and, by a sheer stroke of luck, being able to save her. That way, when he arrives at the encampment, he feels much more justified in his fear of not being able to protect her\n2. Plot complication that forces Joel to exposes his belief: Joel and Ellie reach the encampment and he finds his brother Tommy. That's it. That's the \"complication\". Joel asks Tommy to take Ellie with her, Ellie listens to it in secret.  \n\n   1. Problem 2: there were much better solutions. Joel could've try to convince the people from the encampment to keep Ellie locked up for a month (like the fireflies did) and send a whole team with her to the University to try and save the world. Or, even if you don't want to go that far, Joel could've gone with Ellie and his brother. At no point is it clear why that isn't an option. You can try to shrug it off as \"Joel is afraid that he'll fuck up just by being there\", but that is a hell of a stretch. Two bodyguards for Ellie, even if one of them is old and out of shape, is better than just one bodyguard.\n   2. Possible Solution: Joel should've been forced to make a choice between going alone with Ellie or letting her go with a team that would protect her. How that choices comes about would be tricky. Perhaps we establish that the people from the encampment regularly go to the city where the fireflies are, and there's a group living the next day, and there's no room for Joel to go, so he decided to let Ellie go with them, because it's most rational choice and because he's afraid. Ellie wouldn't like the plan, because she trusts Joel more than an assortment of random strangers, and she doesn't want to lose him.\n3. Conflict between characters ensues: Ellie confronts Joel about abandoning her. Joel reacts defensively and says that he's not her dad. This is actually the good part of the episode (if you ignore the fact that Joel could've simply accompanied Ellie and his brother on the journey). Joel is standing by his incorrect belief that he can't protect Ellie and therefore it's better that he severs their relationship. Good. That's what's creating the conflict. I wouldn't change this scene, but I would try to fix what made us get here.\n4. Relationship downturn and incorrect actions taken: Joel decides to leave Ellie with Tommy. Ellie accepts it. Also good. I wouldn't change this at all.\n5. Further plot complications that forces character to make a decision that either confirms or goes against their incorrect belief: now this is crux of the reason why this episode is bad. What were the plot complications that caused Joel to reevaluate his views and decide to go with Ellie instead? Think about it. I'll give you some time. Done? Yeah, okay, so... there were none. Literally NOTHING happened that caused Joel to change his mind. He just slept on it and waited by a horse. WHAT? That's a MAJOR writing flaw. If your character can just change their mind with a good night of sleep, then you DON'T NEED A STORY. Why even have a plot? Just let him sleep, reevaluate and say \"oh yeaah, that was not good thinking on my part. I guess I'll change that now.\"  \n\n   1. Problem 3: there were no plot complications to force Joel to face his incorrect belief. None at all.\n   2. Possible solution: simply introduce a plot complication damn it! One example (out of thousands you could choose): Tommy leaves with Ellie. Joel stays in the camp, to recover and get some gear before deciding his next move. The next day the horse that Tommy left with returns to the camp, alone. Boom, red alert for Joel. He has to make his decision now: is he going to go after Ellie and his brother, confronting his incorrect belief that he can't protect them? Hell yeah he will. You can even spicy it up by making Tommy's wife go alongside Joel and having either his brother or his wife dying as a consequence for Joel's incorrect actions before.\n6. Character chooses against his incorrect belief, forcing them to reevaluate this same incorrect belief and realize it was incorrect from the beginning: that's the scene of Joel standing by the horse and saying \"yeah, I guess I'll let you make that decision.\" WEAK. There was nothing that led up to this outside from a good night of sleep. It makes the entire argument before seem hollow and pointless if Joel just needed to sleep on it and change his mind.  \n\n   1. Problem 4: Joel changes his incorrect belief on a dime.\n   2. Possible Solution: there is none, except for INTRODUCING A PLOT COMPLICATION (see point 5) and actually forcing Joel to make a decision that will lead him to change his mind. Let me repeat what I just said: if a character can change their mind with just a night's sleep of reflection, then THERE'S NO POINT TO HAVE A STORY.\n7. Character adopts new and correct belief; meaningful change happens: apparently Joel decided to face his fears and change out of nowhere. Therefore, the meaningful change that we see feels forced, more like a plot contrivance to see Joel and Ellie along each other on the journey again. It's not even explained why Tommy can't go along with them!  \n\n   1. Problem 5: Joel changes, but there was no particular reason for it.\n   2. Possible Solution: don't even include the encampment scenario. There we have it. If we're gonna go through this whole song and dance for Joel to change out of nowhere, then simply REMOVED IT from your story. If the complication you presented is not forcing the character to change, choose another complication.\n\nThe decision to have Joel change on a dime is even worse when you consider the fact that he gets stabbed and collapses later on the episode. In short, the episode is basically CONFIRMING Joel's incorrect belief from the start: he's slow and out of shape and can't protect Ellie and himself. It makes Joel seem justified in his initial plan of avoiding human connection - because, after all, that's only gonna get you killed.\n\nAnd there we go. I'm sorry, but this is just bad writing. The entire episode is massively flawed, to such a fundamental level that it makes you believe the writer is an amateur who didn't know any better. And these flaws are present in other episodes too, I'm just singling out this one because it's the most recent one and therefore it's fresher in my mind. I don't understand how people can enjoy this show.\n\nTL;DR: The Last of Us ignore the basic principles of establishing character development to such a massive extent that it seems like amateur writing. In the last episode, we don't see a justification for Joel to change, and yet he does. People call that \"character development\", when it's simply flawed writing. This problem of flawed writing plagues the entirety of the show, not just this episode. The show is hugely overrated.",
        "created_utc": 1676898075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dan Walker: TV presenter injured in bicycle crash",
        "author": "Kagedeah",
        "url": "https://www.bbc.co.uk/news/uk-england-south-yorkshire-64704132",
        "text": "",
        "created_utc": 1676896810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for some fun, cheesy mystery documentary shows",
        "author": "DrDejavu",
        "url": "https://www.reddit.com/r/television/comments/1175ld6/looking_for_some_fun_cheesy_mystery_documentary/",
        "text": "I love those cheesy History channel-type \"investigative\" mystery documentaries. You know, the kind with titles like the \"Looking for Hitler's Gold,\" or \"On the Hunt for Atlantis,\" or whatever. I like more serious documentaries as well, but these occupy a different space. Stuff about the Bermuda Triangle, Bigfoot, Aliens, Area 51, and so on. They're fun, guilty pleasures. They're easy watches. I just wish more of them were a bit more honest about their own nature. They're TV shows, they're written for entertainment, but the people on camera rarely acknowledge it. You'll have people on screen talking about stuff like the challenges and the logistics of using metal detectors in harsh conditions, all with a hilarious sense of urgency - it's a hundreds' year old mystery! It can wait for the rain to stop! - all the while, there's no mention of the production crew. You want a subplot about how hard it is to reach a lake on a remote Alaskan island to dig for pirate treasure? Fine, but show me the camera crew! Make it real! I'm sure there are behind-the-scenes challenges that'd be super interesting to see too!\n\nThat's why I loved Sam Sheridan's 'Atlas of Cursed Places' on National Geographic, and I wish there were more episodes. They were fun and hit exactly the right tone. Skeptical but open-minded. Sarcastic and upfront about the format, but still quite sincere about looking into the mysteries. Very genre aware, and didn't treat the audience like idiots. Looking for more shows like that! Well-made and authentic documentary shows/ movies about less serious mysteries!",
        "created_utc": 1676896608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Netflix's The Witcher is absolutely terrible",
        "author": "TheSkyGamezz",
        "url": "https://www.reddit.com/r/television/comments/117513y/netflixs_the_witcher_is_absolutely_terrible/",
        "text": "SPOILERS FOR BOTH THE SHOW AND THE FIRST BOOK\n\nI recently reread the first Witcher book, and so I decided to watch the Netflix show just to see how well adapted the stories were. I heard good things about the show and went in with some pretty hefty expectations, especially after reading the book.\n\nHoly shit it's bad.\n\nI've only watched the first season, and man, I'm not impressed. Now I do have complaints about the show as a show such as the shitty art style and the low budget look, but those aren't my major complaints. \n\nMy biggest problem with the show is how terribly they adapted the book. If you don't know, the first Witcher book (The Last Wish) is a compilation of seemingly unconnected short stories, perfect for a tv show adaptation. The main purpose of the book is to introduce you to Geralt and his more infamous adventures. It's Geralt's story through and through. That's one reason why the show wasn't very good. It had 2 other plot lines that you had to follow, which just caused the show to suffer. It added unnecessary complexity to a fairly straightforward book. \n\nWe don't need to know Yennefer's story yet, nor do we need to know Ciri's. \n\nNow here's the thing I'm the most mad about: the misunderstanding of the short stories.\nEach short story has a message, has a point to it, which the showrunners completely missed. Either on purpose to shorten the runtime, or they just didn't get it.\n\nI'll give you an example. In the first episode, Geralt killing Renfri and her gang was justified (if you don't count him magically knowing their plan). He chose the lesser evil and seemingly made the right decision. However, in the book, it's completely different. Geralt slowly figures out Renfri's plan, rather than magically knowing it, and kills her gang at the marketplace. Then, Renfri appears and reveals that they weren't gonna go through with their plan since the wizard wasn't gonna leave his tower either way. So Geralt killed those people for nothing. Geralt getting the \"Butcher of Blaviken\" title in the show was unjustified as he did the right thing, but in the book, it's up left to your interpretation. Maybe he did deserve it, or maybe he didn't.\n\nThe whole message in that story was that you shouldn't choose between two lesser evils, yet that message wasn't in the show. \n\nThis is a problem in literally every episode. Every time they try to adapt the short stories, they completely miss the entire point. The Law Of Surprise episode was the worst, and it's my favorite story from the book. It also doesn't help that you have 2 other shitty plotlines, making it even worse.\n\nWhew, I'm sorry for the wall of text. I just needed to rant.",
        "created_utc": 1676894897,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Doctor Who gets any better after Eccleston's series?",
        "author": "Geriperi",
        "url": "https://www.reddit.com/r/television/comments/1174qi6/does_doctor_who_gets_any_better_after_ecclestons/",
        "text": "Any better by my standards, od course, I know it is an acclaimed TV series and lots of people love it, but I don't really see the appeal in the Eccleston season (2005), which is where I decided to start watching.\n\nFor me the tone of the season is a little bit simple/childish, the plots are not very entertaining and the acting from Eccleston and Piper are too expressive and artificial. In general it feels like a science fiction minor product, and if I didnt know its success I'd have guessed it was cancelled after this season.\n\nIf someone hasnt already downvoted this and is willing to answer, how do you feel about this season? Does it get better with the next Doctor in any way or the things I dislike about it are actually the charm of it?\n\nThanks in advance for any response!",
        "created_utc": 1676893935,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘1923’ Star Aminah Nieves On Show’s Brutality Toward Indigenous People: “I Felt Like Sometimes, I Wasn’t Even In Control Of My Body”",
        "author": "zsreport",
        "url": "https://deadline.com/2023/02/1923-star-aminah-nieves-on-teonna-brutality-sister-mary-1235265148/",
        "text": "",
        "created_utc": 1676892617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Black Summer tie itself up with season 2? Or was it cut short abruptly?",
        "author": "Merit-Rest-Surrender",
        "url": "https://www.reddit.com/r/television/comments/117495p/does_black_summer_tie_itself_up_with_season_2_or/",
        "text": "Just wondering if I wanna give it a watch or if I'm just gonna be upset with a 2nd season released with an intended 3rd season.",
        "created_utc": 1676892176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top 10 best seasons ever made?",
        "author": "saulgoodman673",
        "url": "https://www.reddit.com/r/television/comments/1173zvl/top_10_best_seasons_ever_made/",
        "text": "For me:\n\n**10: The Wire: Season 1***\n**9: The Wire: Season 3***\n**8: Better Call Saul: Season 3***\n**7: The Sopranos: Season 6: Part II***\n**6: Breaking Bad: Season 5***\n**5: Daredevil: Season 1***\n**4: Better Call Saul: Season 5***\n**3: The Walking Dead: Season 1***\n**2: Breaking Bad: Season 4***\n**1: Better Call Saul: Season 6***",
        "created_utc": 1676891243,
        "upvote_ratio": 1.0
    },
    {
        "title": "John Oliver Takes Swipe At Fox News For Peddling Election Fraud Claims: “If I Were A Fox Viewer, I’d Feel Pretty Betrayed”",
        "author": "Epic_Legend125",
        "url": "https://deadline.com/2023/02/john-oliver-takes-swipe-fox-news-peddling-election-fraud-claims-hbo-max-1235265400/",
        "text": "",
        "created_utc": 1676891117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nippon TV Strikes Deal With Netflix To Produce ‘Ariyoshi Assists’",
        "author": "Pietkroon",
        "url": "https://deadline.com/2023/02/nippon-tv-netflix-japan-comedy-series-ariyoshi-assists-1235265465/",
        "text": "",
        "created_utc": 1676886908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it that a lot of TV shows these days have really poor sound mixing",
        "author": "StarChild413",
        "url": "https://www.reddit.com/r/television/comments/1171am2/why_is_it_that_a_lot_of_tv_shows_these_days_have/",
        "text": "Reminded of that watching the pilot of The Company You Keep on Sunday night and though the story was interesting otherwise the one thing that made it almost painful to watch (other than how these guys could be much better con artists if they learned from Leverage's example) was how it felt like the background music was so absolutely booming that it drowned out dialogue or at least pushed it into the background. I could get it to some degree if it was a stylistic choice to emphasize the covert and hush-hush nature of how both leads live their lives but if it was it probably wouldn't have been so loud that at points character names or lines of dialogue feel completely drowned out unless you've got metaphorical Vulcan hearing",
        "created_utc": 1676880602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Psychedelic Assisted Therapy: Last Week Tonight with John Oliver (HBO)",
        "author": "BoogsterSU2",
        "url": "https://www.youtube.com/watch?v=a546lxxJIhE",
        "text": "",
        "created_utc": 1676878671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which people in the TV world (real or fictional) would you classify as a genius?",
        "author": "unitedfan6191",
        "url": "https://www.reddit.com/r/television/comments/11705cu/which_people_in_the_tv_world_real_or_fictional/",
        "text": "Hi.\n\nHope you’re doing well.\n\nLet’s get right into it, as the title says, who in the industry or the characters on screen are the epitome of exceptional creative intellect?\n\nI don’t just hand out the title of “genius” freely and it’s all a matter of opinion but I’m fair,y confident this list is full of real and fictional people who are amazingly gifted people who also relentlessly put in overtime to make their shows or roles or fictional communities a success.\n\nYou can name show creators, writers, directors, actors, producers, characters. Anyone really who has had a big impact and, in your eyes, has had a genius level impact on the industry. This list isn’t exhaustive, but some notable names.\n\nThere are probably so many more I could name including other writers, actors, producers and directors who worked with these people who had fairly big involvement with many of these same shows that the people in my list are associated with, but “genius” cannot just be handed out to just every smart person; it’s reserved for the select few who transcend the medium and their genre, in my opinion.\n\nIn no particular order, but I think there are some standouts: \n\nAaron Sorkin\n\nGreg House\n\nGreg Daniels\n\nTina Fey\n\nDan Harmon\n\nLisa Simpson\n\nProfessor Farnsworth\n\nTemperance \"Bones\" Brennan\n\nVince Gilligan\n\nJordan Peele\n\nKeegan-Michal Key\n\nSteven Levitan\n\nChristopher Lloyd\n\nWhich people in the TV world (real or fictional) would you classify as a genius?",
        "created_utc": 1676876201,
        "upvote_ratio": 1.0
    },
    {
        "title": "is sopranos still popular??",
        "author": "Water8ucket",
        "url": "https://www.reddit.com/r/television/comments/116zu7g/is_sopranos_still_popular/",
        "text": "i've seen the sopranos on imdb popular tv shows taking the #35 place while i've never seen anyone watching it or talking about it.. so does anyone knows whats imdb popular tv shows list based on?? or is it just randomly chosen??",
        "created_utc": 1676875037,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do the first 4 seasons of Dexter compare to the first 4 seasons of Game of Thrones?",
        "author": "Artistic-Toe-8803",
        "url": "https://www.reddit.com/r/television/comments/116zseb/how_do_the_first_4_seasons_of_dexter_compare_to/",
        "text": "Everyone by now knows how terribly received the final season of GoT was by fans and critics alike, and so people who've never seen GoT will usually steer clear as a result. But I still encourage people to watch it, bc I believe the first 4 seasons are the greatest 4 season stretch of anything, ever, and that show completely changed my perception of what a TV show could be. You could truly *never* tell a story like this in the format of film, even ones like Dr. Strangelove &gt;!where literally everyone dies!&lt; can never have the sense of character develipment and true stakes, utter suspense in that literally anything could happen to any character. There's no plot armor, nothing that makes anybody untouchable, etc. Now, personally I didn't think season 5 was as bad as everyone else seems to, I loved season 6, and didn't hate 7 as much as most (although it did feel like it was worse in the final 2-3 eps than the first 3-4 or so). But 8 was absolutely every bit of the incorrigible disaster that everyone and their mother has been calling it since it aired. Despite all this, I still think pretty much anyone who hasn't seen the show should watch the first 4 seasons, they're just that insanely good imo.\n\nThe only other majorly popular show (which is also renowned to have fallen off terribly) that I hear the same sentiments about, is Dexter. Nobody suggests to watch TWD nowadays due to how bad it got after season 1, same goes for basically every CW show ever made (many have terrible 1st seasons as well nowadays but the Flash, Arrow, Riverdale, etc at least started pretty well), Supernatural, True Blood, etc. \n\nIt's interesting that Dexter lasted the same amount of seasons as what most seem to view as top tier TV, so I'm curious if it was every bit as good as early GoT (or even better maybe?). If that's the case, I may watch it despite how much it apparently falls off",
        "created_utc": 1676874854,
        "upvote_ratio": 1.0
    },
    {
        "title": "خرید محافظ صفحه فول Samsung Galaxy S23 Ultra از فارس کالا",
        "author": "webario",
        "url": "https://farskala.ir/product/uv-full-glass-screen-protector-samsung-galaxy-s23-ultra/",
        "text": "",
        "created_utc": 1676874723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tv shows",
        "author": "Kylestick",
        "url": "https://www.reddit.com/r/television/comments/116z5m3/tv_shows/",
        "text": "[removed]",
        "created_utc": 1676872588,
        "upvote_ratio": 1.0
    },
    {
        "title": "خرید محافظ صفحه پرایوسی گوشی Xiaomi Redmi A1 Plus",
        "author": "webario",
        "url": "https://farskala.ir/product/nano-privacy-film-screen-protector-for-xiaomi-redmi-a1-plus/",
        "text": "",
        "created_utc": 1676871752,
        "upvote_ratio": 1.0
    },
    {
        "title": "خرید محافظ صفحه نانو مات Xiaomi Redmi A1 Plus از فارس کالا",
        "author": "webario",
        "url": "https://farskala.ir/product/nano-matte-screen-protector-for-xiaomi-redmi-a1-plus/",
        "text": "",
        "created_utc": 1676870696,
        "upvote_ratio": 1.0
    },
    {
        "title": "In ‘Kin,’ The Last of Us Reaches the End of the West",
        "author": "verissimoallan",
        "url": "https://www.escapistmagazine.com/the-last-of-us-episode-6-review-kin/",
        "text": "",
        "created_utc": 1676869454,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘The Last of Us’ Episode 6: Pedro Pascal’s Powerhouse Performance",
        "author": "verissimoallan",
        "url": "https://www.rollingstone.com/tv-movies/tv-movie-recaps/the-last-of-us-episode-6-recap-pedro-pascal-powerhouse-joel-ellie-threat-rutina-wesley-1234678616/",
        "text": "",
        "created_utc": 1676869433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loki Season 2 Cast: Every Marvel Character Confirmed to Appear",
        "author": "Bunnystrawbery",
        "url": "https://thedirect.com/article/loki-season-2-cast-marvel-characters-appear",
        "text": "",
        "created_utc": 1676868511,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Company You Keep",
        "author": "1cockeyedoptimist",
        "url": "https://www.reddit.com/r/television/comments/116x8ke/the_company_you_keep/",
        "text": "A night of passion leads to love between con man Charlie (Milo Ventimiglia) and undercover CIA officer Emma (Catherine Haena Kim) who are unknowingly on a collision course professionally.",
        "created_utc": 1676866063,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Company You Keep",
        "author": "1cockeyedoptimist",
        "url": "https://www.reddit.com/r/television/comments/116x39a/the_company_you_keep/",
        "text": " *A* night *of* passion leads to love between con man Charlie and undercover CIA officer Emma, who are unknowingly on *a* collision course professionally.",
        "created_utc": 1676865582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else waiting on Carnival Row to be cancelled before giving it a watch?",
        "author": "Merit-Rest-Surrender",
        "url": "https://www.reddit.com/r/television/comments/116wi1y/anyone_else_waiting_on_carnival_row_to_be/",
        "text": "What's the statistics of scifi/fantasy shows that aren't cancelled? I feel like I've been trained to not invest in Shows beyond the first season now because I know they won't make it and I'm dead sick of shows jarringly cut short without wrapping anything up.",
        "created_utc": 1676863627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we talk about how ridiculously stacked Netflix’s ‘Green Eggs and Ham’ is?",
        "author": "Vibrantmender20",
        "url": "https://www.reddit.com/r/television/comments/116v1li/can_we_talk_about_how_ridiculously_stacked/",
        "text": "Just randomly put this show on to entertain my toddler one day, thought it was good enough for a kids show. Decided to watch the opening credits today. Holy shit. \n\nStars: Michael Douglas, Adam Devine, Illana Glazer, Diane Keaton. \nNarrated by: Keegan-Michael Key\nGuest stars: Eddie Izard, Jeffery Wright, John Turturro, Gwendoline Christy, Tracy Morgan, etc. etc. etc.\nProduced by: Ellen DeGeneres (meh) \n*Opening Theme*: Rivers freaking Cuomo. \n\nTo be a fly on the wall for whoever pitched this *massive* amount of talent for a seemingly unnoticed kids show.",
        "created_utc": 1676859151,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Last of Us - 1x06 \"Kin\" - Episode Discussion",
        "author": "LoretiTV",
        "url": "https://www.reddit.com/r/television/comments/116uo6k/the_last_of_us_1x06_kin_episode_discussion/",
        "text": "**Season 1 Episode 6**: Kin\n\n**Aired**: February 19, 2023\n___\n**Synopsis**: [Joel and Ellie must survive ruthless killers and monsters on a trek across America after an outbreak.](https://ibb.co/9bD3JBP)\n___\n**Directed by**: Jasmila Žbanić\n\n**Written by**: Craig Mazin \n___\n**Subreddits**: r/TheLastofUsHBOseries, r/TheLastOfUs",
        "created_utc": 1676858054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hells Kitchen has to be staged right? How do they get experienced chefs and literally 20 seasons in a row they cannot finish dinner services?",
        "author": "herewego199209",
        "url": "https://www.reddit.com/r/television/comments/116ua0o/hells_kitchen_has_to_be_staged_right_how_do_they/",
        "text": "There are ihop Chefs who can compete with busy breakfast and lunch rushes, but these trained chefs can't complete dinner services. Does anyone know if the show is ridiculously staged or do they legitimately look for the worse chefs possible?",
        "created_utc": 1676856884,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me which parental guidance rating you think my show will get",
        "author": "MiniMarshall11",
        "url": "https://www.reddit.com/r/television/comments/116u5wm/tell_me_which_parental_guidance_rating_you_think/",
        "text": "[removed]",
        "created_utc": 1676856561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which TV Shows were complete masterpieces, but then dropped the ball in the last 1-2 seasons?",
        "author": "njdevils901",
        "url": "https://www.reddit.com/r/television/comments/116tyyo/which_tv_shows_were_complete_masterpieces_but/",
        "text": "I know people will disagree with me, but I think Atlanta was on the way to being my top 3 favorite show of all time, and I think they really dropped the ball in the last two seasons. Still obviously really well-done TV, but man the first two seasons are masterpieces, and the last two are just kind of unfocused and I feel like they really could have been known as something amazing. Still a great show that for the most part is fantastic, but the two seasons are not something I think I'll ever go back and re-watch like the first two seasons.\n\nJust interested in other tv shows like this, as I know there are other examples out there that people think would go with this question.",
        "created_utc": 1676856003,
        "upvote_ratio": 0.99
    },
    {
        "title": "Is there anyway i can watch old Emmy awards?",
        "author": "WARPATH_07",
        "url": "https://www.reddit.com/r/television/comments/116tdms/is_there_anyway_i_can_watch_old_emmy_awards/",
        "text": "Specifically looking for 1993 &amp; 1992, Sorry if this doesn't belong in this subreddit, I've been looking all over YouTube for full length of the 1993 &amp; 1992 Emmy awards but all i can find is short clips, If anyone has a full length of either one of the emmy's listed above could you please comment down below.",
        "created_utc": 1676854397,
        "upvote_ratio": 0.99
    },
    {
        "title": "How do I picture show to Hulu?",
        "author": "MiniMarshall11",
        "url": "https://www.reddit.com/r/television/comments/116sv5i/how_do_i_picture_show_to_hulu/",
        "text": "[removed]",
        "created_utc": 1676853037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does america have a show like come dine with me?",
        "author": "thesnapening",
        "url": "https://www.reddit.com/r/television/comments/116stwx/does_america_have_a_show_like_come_dine_with_me/",
        "text": "[removed]",
        "created_utc": 1676852950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last Week Tonight Returns Chances of John Oliver and ChatGPT?",
        "author": "fdjadjgowjoejow",
        "url": "https://www.reddit.com/r/television/comments/116sh0y/last_week_tonight_returns_chances_of_john_oliver/",
        "text": "You recall that one guy that went nuts with DALL-E and Oliver pictures? What do you think the chances are that there is a segment  tonight with Oliver and ChatGPT or ChatGPT Bing?",
        "created_utc": 1676852010,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Equalizer (with Denzel) should have been a tv series",
        "author": "No-News-2655",
        "url": "https://www.reddit.com/r/television/comments/116se8y/the_equalizer_with_denzel_should_have_been_a_tv/",
        "text": "Many complaints I hear about the films are that there are too many side stories.\n\nI want The Equalizer to be a TV series, where each episode focuses on a single person that Robert Mccall helps. I would also like more backstory into his life, marriage and who he used to be.\n\nI already know there's the Queen Latifah show, but that's garbage. \n\nUnfortunately, I don't think Denzel would agree to a TV show",
        "created_utc": 1676851806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Richard Belzer wild final words before death at 78",
        "author": "The_Jizzbot",
        "url": "https://www.news.com.au/entertainment/celebrity-life/celebrity-deaths/law-and-order-stars-wild-final-words-before-death-at-78/news-story/4d120ec2a4df85a338c1d04eedb01ad5",
        "text": "",
        "created_utc": 1676851519,
        "upvote_ratio": 1.0
    },
    {
        "title": "NetFlix Can Be Cancelled Easily, Stick To Amazon Prime and Salvage Your Family Day",
        "author": "EnvisionLBV",
        "url": "https://www.youtube.com/watch?v=7f3GV_q8WOc",
        "text": "",
        "created_utc": 1676850479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Utopia Season 2 - \"His birth was a selfish act\" scene",
        "author": "DrVagax",
        "url": "https://youtu.be/rcx-nf3kH_M",
        "text": "",
        "created_utc": 1676848239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyway i can watch old Emmy awards?",
        "author": "WARPATH_07",
        "url": "https://www.reddit.com/r/television/comments/116qu4x/anyway_i_can_watch_old_emmy_awards/",
        "text": "[removed]",
        "created_utc": 1676847879,
        "upvote_ratio": 0.99
    },
    {
        "title": "Which one ?",
        "author": "AH-hoopz",
        "url": "https://www.reddit.com/r/television/comments/116qpoo/which_one/",
        "text": "[removed]",
        "created_utc": 1676847602,
        "upvote_ratio": 1.0
    },
    {
        "title": "dinosaur - with Steven fry",
        "author": "metaphoricalmuch",
        "url": "https://www.reddit.com/r/television/comments/116qkoe/dinosaur_with_steven_fry/",
        "text": "[removed]",
        "created_utc": 1676847251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dickie Davies, World of Sport presenter, dies at 94",
        "author": "ToffeeFever",
        "url": "https://www.theguardian.com/tv-and-radio/2023/feb/19/dickie-davies-world-sport-presenter-dies-94",
        "text": "",
        "created_utc": 1676846346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Detroiters Appreciation Post",
        "author": "LegitimateTrifle1910",
        "url": "https://www.reddit.com/r/television/comments/116psur/detroiters_appreciation_post/",
        "text": "I’m sure this show has gotten brought up a lot in recent years since Tim Robinson’s I Think You Should Leave got popular, but I just love Detroiters so much. I liked it when it first came out, and finally am rewatching (yes, probably due in part to ITYSL) - and it holds up so well. I think Tim is funny in almost everything he’s in. And Sam Richardson is so precious to me. So lovable and funny. Really love this show. That’s all - thanks for reading ❤️",
        "created_utc": 1676845355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Emma Mackey confirms she's leaving Sex Education after season 4",
        "author": "SurvivorLover19",
        "url": "https://www.radiotimes.com/tv/comedy/emma-mackey-leave-sex-education-season-4-newsupdate/",
        "text": "",
        "created_utc": 1676844794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody remember this Australian late 90's / early 2000's era show",
        "author": "firstpc13",
        "url": "https://www.reddit.com/r/television/comments/116p7uk/does_anybody_remember_this_australian_late_90s/",
        "text": "I remember decades ago either in the late 90s or early 00s there was an Australian tv show with the two main characters being men probably 20s , one was blonde hair one was black hair.  I remember in one episode they pulled out their dicks and had a sword fight. If anybody has any information that can help, let me know",
        "created_utc": 1676843961,
        "upvote_ratio": 1.0
    },
    {
        "title": "How 'Wolf Pack' Became a Certified Hit",
        "author": "D_B_4986",
        "url": "https://www.esquire.com/entertainment/tv/a42885459/wolf-pack-paramount-interview/",
        "text": "",
        "created_utc": 1676843699,
        "upvote_ratio": 1.0
    },
    {
        "title": "National Geographic’s New Docuseries, UFOs: Investigating the Unknown, Gives Insight Into UFO Sightings by Providing New HD Pictures from Across the World.",
        "author": "DragonfruitOdd1989",
        "url": "https://www.space.com/ufos-investigating-the-unknown-docuseries-leslie-kean",
        "text": "",
        "created_utc": 1676843662,
        "upvote_ratio": 1.0
    },
    {
        "title": "National Geographic’s New Docuseries Gives Insight Into UFO Sightings by Providing New HD Pictures from Across the World.",
        "author": "DragonfruitOdd1989",
        "url": "https://www.space.com/ufos-investigating-the-unknown-docuseries-leslie-kean",
        "text": "",
        "created_utc": 1676843063,
        "upvote_ratio": 1.0
    },
    {
        "title": "New UFO docuseries seeks to shed light on flying saucer folklore",
        "author": "DragonfruitOdd1989",
        "url": "https://www.space.com/ufos-investigating-the-unknown-docuseries-leslie-kean",
        "text": "",
        "created_utc": 1676842890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Johnny Knoxville Is Still Processing Reboot’s Demise",
        "author": "stroh_1002",
        "url": "https://www.vulture.com/article/johnny-knoxville-reboot-interview-hulu-cancellation.html",
        "text": "",
        "created_utc": 1676842292,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Essalieyan' combines grimdark storytelling with epic adventure, and it would be a great fantasy adaptation in a post-'Game of Thrones' and 'Rings of Power' landscape",
        "author": "Skeelo_Fan",
        "url": "https://www.looper.com/1200714/essalieyan-is-the-biggest-baddest-fantasy-series-youve-never-heard-of-its-ripe-for-adaptation/",
        "text": "",
        "created_utc": 1676841829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's talk about the other How I Met Your Father show",
        "author": "StarWarsBlogsbot",
        "url": "https://showsnob.com/2023/02/17/the-other-how-i-met-your-father-show/?a_aid=46089",
        "text": "",
        "created_utc": 1676841477,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Last of us Season 2, possible spoilers in comments.",
        "author": "Percilus",
        "url": "https://www.reddit.com/r/television/comments/116o3ba/the_last_of_us_season_2_possible_spoilers_in/",
        "text": "Is anyone nervous about how this plays out for the show long term or do we think they will end it after S2. I personally think once they pass that certain point that's in the games(if you know you know) they need to wrap the show up quick or it's gonna be tainted like GOT was. \n\nAm I way off? Mixed reviews for part 2, the game was super divisive and I'd hate them to play out the same with the show. What are other people's thoughts?",
        "created_utc": 1676841091,
        "upvote_ratio": 1.0
    },
    {
        "title": "National Geographic’s New Docuseries Gives Insight Into UFO Sightings",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676840872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finishing up “Lonesome Dove” from 1989",
        "author": "reedzkee",
        "url": "https://www.reddit.com/r/television/comments/116nxvf/just_finishing_up_lonesome_dove_from_1989/",
        "text": "Laying in bed bored and recognized robert duvall in the picture, saw the positive reviews, and gave it a spin.\n\nMy god. It’s incredible. This is almost golden era HBO good. Performances from Duvall, Jones, Lane, and Huston are top notch. This show has a ton of heart, too, without being sappy or cheesy. It ain’t deadwood as this aired on network TV, but it has so much more substance than something like Yellowstone.\n\nIt’s a touch dated but it will pull you in so fast you won’t mind at all.\n\nIf you have any interest in 19th century frontier america, do yourself a favor and watch this short mini series. I had never heard of it as I was 3 when it aired,  but I’d be willing to bet there’s some old timers out there that know it well.\n\nYoung Diane Lane is also a total babe. Off the charts.",
        "created_utc": 1676840712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Former ITV World of Sport presenter Dickie Davies dies at the age of 94",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676840570,
        "upvote_ratio": 1.0
    },
    {
        "title": "ITV 'World of Sport' presenter Dickie Davies dies aged 94",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676840461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everything everywhere all at once",
        "author": "observer_bh",
        "url": "https://www.reddit.com/r/television/comments/116myyx/everything_everywhere_all_at_once/",
        "text": "Can someone explain to me wtf is this fuss about?\n\nLike can someone list three good things about it.\n\nI don't want you to praise soundtrack, cinematography or acting..the movie has no plot..grusome scenes and it is all around silly..Iean if marvel is not a cinema..then this is even worse.\n\nDo ppl think it is cool to like it..and then shocked ppl like me feel like they do have to like it?",
        "created_utc": 1676838276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which sitcoms do you think should have a crossover?",
        "author": "TheBasaClub",
        "url": "https://screenrant.com/best-television-sitcom-crossovers/",
        "text": "",
        "created_utc": 1676837201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have any information on if there is a possibility of a 7th season or a spin-off of TNT’s Animal Kingdom.",
        "author": "Responsible-Idea-243",
        "url": "https://www.reddit.com/r/television/comments/116lxr0/does_anyone_have_any_information_on_if_there_is_a/",
        "text": "[removed]",
        "created_utc": 1676835704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sitcom Crossover Ideas.",
        "author": "TheBasaClub",
        "url": "https://www.reddit.com/r/television/comments/116lw8g/sitcom_crossover_ideas/",
        "text": "[removed]",
        "created_utc": 1676835603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daniela Estefania 🌙 on TikTok",
        "author": "Plus_Inevitable5359",
        "url": "https://vm.tiktok.com/ZMYB84Yy7/",
        "text": "",
        "created_utc": 1676834272,
        "upvote_ratio": 1.0
    },
    {
        "title": "PARKS AND RECREATION, fun side project I made for any fans of the show. Would love to know what you think of the likenesses.",
        "author": "Mysterious-Science35",
        "url": "https://youtu.be/Luzpu1EQKeM",
        "text": "",
        "created_utc": 1676833589,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future-Set Hello Tomorrow! Is Another Unique, (Qualified) Success for Apple TV+",
        "author": "PetyrDayne",
        "url": "https://www.pastemagazine.com/tv/apple-tv-plus/hello-tomorrow-review/",
        "text": "",
        "created_utc": 1676832545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Empress Ki (Netflix UK)",
        "author": "ISayISayISay",
        "url": "https://www.reddit.com/r/television/comments/116kkaz/empress_ki_netflix_uk/",
        "text": "Earlier today I made a post about this, but being the fool that I am I got the title wrong and called it *Princess Ki*... so I thought I'd post again with the correct title, just in case anyone is looking for it and remotely interested in what I have to say (unlikely as that may be).\n\n  Here's my original post: [https://old.reddit.com/r/television/comments/11682jj/princess_ki_netflix/](https://old.reddit.com/r/television/comments/11682jj/princess_ki_netflix/)",
        "created_utc": 1676832382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Star Trek: The Next Generation",
        "author": "Jake_Thador",
        "url": "https://www.reddit.com/r/television/comments/116kixw/star_trek_the_next_generation/",
        "text": "After many years of hearing how stupendous Star Trek is, and seeing it available on Netflix, I decided to invest my time and watch this series. \n\nI am ~60% through season 1 and am tired of the Enterprise crew acting like a bumbling fool falling into pit after pit. The personal relationships maintain some interest, but even that is getting tiresome. I was expecting to have to trudge through campyness and poor acting while suspending a moderate amount of disbelief, but there have been very few compelling concepts addressed on the show. \n\nDoes it get better?",
        "created_utc": 1676832293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Richard Belzer Dead at 78: 'Law &amp; Order: SVU' Actor's Colleagues Confirm His Passing",
        "author": "Majnum",
        "url": "https://popculture.com/celebrity/news/richard-belzer-dead-78-law-order-svu-actors-colleagues-confirm-passing/",
        "text": "",
        "created_utc": 1676831294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Edge of your seat TV Shows? English or foreign.",
        "author": "Muthafuckaaaaa",
        "url": "https://www.reddit.com/r/television/comments/116k1ug/edge_of_your_seat_tv_shows_english_or_foreign/",
        "text": "What TV shows have the most episodes that feel like season finales? Regardless of genre or language. English or foreign with subtitles. \n\nFor example, a lot of shows move very slowly through a season and sometime only 1 or 2 major things happen/come to fruition (if that) with a ton of filler until the actual season finale where something actually happens.  Then sometimes the thing that happens in that season finale are walked back in the next season's premiere and things get really dragged out.\n\nWhat shows (regardless of genre) have a lot of progression/big events that continue to push the story along and make it feel like you're watching a ton of series finales with how exciting they all are do you recommend?",
        "created_utc": 1676831149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don’t movies make use of the entire screen size",
        "author": "mutalisken",
        "url": "https://www.reddit.com/r/television/comments/116k1ag/why_dont_movies_make_use_of_the_entire_screen_size/",
        "text": "All tvs since 20 years are widescreen, yet so many movies have the black stripes at the top and bottom of the screen which essentially removes 20% viewing size. \nWhy aren’t the movie creators shooting movies utilizing the entire screen?",
        "created_utc": 1676831114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Richard Belzer, 'Law &amp; Order: SVU' &amp; 'Homicide' Actor, Dies at 78",
        "author": "MarvelsGrantMan136",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/richard-belzer-dead-homicide-law-order-1235329813/",
        "text": "",
        "created_utc": 1676831085,
        "upvote_ratio": 1.0
    }
]