[
    {
        "title": "Who remembers Total Drama Island? 😍 Here's a little edit for nostalgic people ❤️",
        "author": "Infamous-Penalty5301",
        "url": "https://www.youtube.com/watch?v=ihaVVtSuD3c&amp;list=PLHBRAnh6CEArUMlc_S3jmuNB6bxwXF3Wd&amp;index=14",
        "text": "",
        "created_utc": 1678503995,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Britain, will I need a TV License to watch Wild Isles?",
        "author": "Astro3840",
        "url": "https://www.reddit.com/r/television/comments/11o7oqh/in_britain_will_i_need_a_tv_license_to_watch_wild/",
        "text": "I know that a license is needed for streaming services and/or other apps, but what about live cable programming like the upcoming Wild Isles series?  I know that most British viewers pay for the license but i'll be travelling there and only be staying a few months.  I've heard good things about Wild Isles and it's one of the shows I'd like to catch while I'm there. Is it something I have to ask about regarding my rental lease or are all  residents obliged to purchase the license?  Any help on this matter is much appreciated.",
        "created_utc": 1678499823,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Britain, will I need a TV License to watch Wild Isles?",
        "author": "Astro3840",
        "url": "https://www.reddit.com/r/television/comments/11o7fbq/in_britain_will_i_need_a_tv_license_to_watch_wild/",
        "text": "[removed]",
        "created_utc": 1678499066,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Red Dwarf' Rights Dispute Resolved, Plan to \"Launch Seperate Iterations[...] Across Various Media\"",
        "author": "Illustrious-Ranger22",
        "url": "https://reddwarf.co.uk/",
        "text": "",
        "created_utc": 1678497893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roku had one-fourth of its cash in failed Silicon Valley Bank, most of it uninsured; streaming giant says it can still meet expenses",
        "author": "HRJafael",
        "url": "https://deadline.com/2023/03/roku-cash-failed-silicon-valley-bank-streaming-1235285439/",
        "text": "",
        "created_utc": 1678497776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does “Mad Men” get better after Season 1?",
        "author": "saulgoodman673",
        "url": "https://www.reddit.com/r/television/comments/11o53zw/does_mad_men_get_better_after_season_1/",
        "text": "I recently finished Season 1, and while I thought it was ok, I didn’t think it was anything crazy. \n\nThe 1st 5 or 6 episodes of the season, imo, were pretty rough and hard to get through. I found them to be pretty boring. The season did start to become somewhat enjoyable and solid starting from Ep. 6 or 7 to me, but it was still boring at times.\n\nThe last 2 episodes of the season were pretty good, and a couple more from Ep. 6 or 7 onwards were pretty solid too, but I wish there was just overall more drama and excitement. \n\nThe Wire S1’s and Better Call Saul S1’s 1st halves were both slow paced, but they still had some enjoyable stuff going on to keep us engaged while they were building to the 2nd half. Mad Men’s 1st season didn’t really do that: it was just boring most of the time and didn’t really build to much or have a main plotline.\n\nIs the show going to be like this the entire way through where it is boring a lot of the time and sometimes decent without much of a main plotline? Or is the show’s 1st season similar to that of other well-regarded shows, like The Sopranos, BoJack Horseman, etc., where the 1st season isn’t that crazy, but it finds its footing with succeeding seasons?",
        "created_utc": 1678492799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why isn't \"Xena Warrior Princess\" highly regarded as Buffy the Vampire Slayer or Wonder Woman?",
        "author": "jdpm1991",
        "url": "https://www.reddit.com/r/television/comments/11o4mb7/why_isnt_xena_warrior_princess_highly_regarded_as/",
        "text": "When people list bad ass TV heroines in the past I always see Buffy Summers and Wonder Woman listed in the first two of the list. \n\nFeels like barely anyone talks about Xena is it cause Xena was a syndicated show and Buffy/Wonder Woman were mainstream? \n\nPeople mention Xena sometimes but not as much as WW or Buffy are.",
        "created_utc": 1678491530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which guest stars have appeared in the most episodes of a show without ever being a cast member?",
        "author": "JeffRyan1",
        "url": "https://www.reddit.com/r/television/comments/11o4d6i/which_guest_stars_have_appeared_in_the_most/",
        "text": "For instance, [Yvette Freeman plays the nurse Haleh Adams](https://er.fandom.com/wiki/Haleh_Adams) in *ER:* she appeared in 182 episodes over 15 seasons, without every being a cast member. Never a cast member, but rarely ever not there.",
        "created_utc": 1678490883,
        "upvote_ratio": 1.0
    },
    {
        "title": "'I Think You Should Leave with Tim Robinson' Season 3 Premieres May 30 on Netflix",
        "author": "MarvelsGrantMan136",
        "url": "https://variety.com/2023/tv/news/i-think-you-should-leave-season-3-premiere-date-1235549225/",
        "text": "",
        "created_utc": 1678489249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Classic Conan bit: George Wendt (Norm on Cheers) has his family holiday dinner on Conan's set. Ft. his babyfaced nephew Jason Sudeikis",
        "author": "Ygoat",
        "url": "https://youtu.be/TXp8rgFwmJU",
        "text": "",
        "created_utc": 1678488946,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Daredevil: Born Again’ Lands ‘Dexter’ Director Michael Cuesta",
        "author": "Melodic-Work7436",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/daredevil-born-again-lands-director-1235346034/",
        "text": "",
        "created_utc": 1678486820,
        "upvote_ratio": 1.0
    },
    {
        "title": "REPORT: Black Panther Disney+ Series Lands a Wakanda-Centric Working Title",
        "author": "TexOliver93",
        "url": "https://www.cbr.com/black-panther-wakanda-series-working-title/",
        "text": "",
        "created_utc": 1678486815,
        "upvote_ratio": 1.0
    },
    {
        "title": "The $500 cash app for free",
        "author": "AdLongjumping8007",
        "url": "http://sintogamer.ml/251808c",
        "text": "",
        "created_utc": 1678485446,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Daredevil: Born Again' Recasts Vanessa Fisk",
        "author": "danielthetemp",
        "url": "https://www.murphysmultiverse.com/daredevil-born-again-recasts-vanessa-fisk/",
        "text": "",
        "created_utc": 1678485289,
        "upvote_ratio": 1.0
    },
    {
        "title": "does Better Call Saul still exist????",
        "author": "mod-day-turd",
        "url": "https://www.reddit.com/r/television/comments/11o22bw/does_better_call_saul_still_exist/",
        "text": "[removed]",
        "created_utc": 1678485286,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Daredevil: Born Again’ Lands ‘Dexter’ Director Michael Cuesta (Exclusive)",
        "author": "Cataclysm-Nerd01",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/daredevil-born-again-lands-director-1235346034/",
        "text": "",
        "created_utc": 1678485077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ted Lasso was a lock to drop in reviews in season 3 regardless of quality - the problem with TV critics",
        "author": "RusevReigns",
        "url": "https://www.reddit.com/r/television/comments/11o1kwr/ted_lasso_was_a_lock_to_drop_in_reviews_in_season/",
        "text": "Lasso had 71 on metacritic in season 1, 85 on season 2 and is back down to 72 in season 3.\n\nDoes that jump from season 1 to 2 make any sense? No, while I think it's underrated personally, season 2 seems to polarize people more quality wise, season 1 having the best reviews would have made more sense. All that happened is Lasso became the hottest show in the world, and AppleTV started to get better reviews, so by the time of start of season 2 more critics jumped on the bandwagon, the start of season 2 reviews capture peak Lasso good will.\n\nThen midway through season 2, it became more popular online to criticize it and call it semi annoying. For this reason, Lasso season 3 was a stone cold LOCK to get worse reviews in season 3. This is where season 2 status being revised to \"above average, but kind of too much/annoying at times\" gets reflected. Because of confirmation bias if you go in expecting to see the half annoying Lasso you can see it. There is literally NOTHING they could have done quality wise in the first three episodes of season 3 to match that season 2 metacritic of 85. \n\nIn an ideal world this is not how things would work, why not just have a bunch of individuals with separate interesting opinions, instead of attached to this groupthink fads type of nonsense. These people are mentally weak collectivists who want everyone online to have the same opinions.",
        "created_utc": 1678484120,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Daredevil: Born Again’ Lands ‘Dexter’ Director Michael Cuesta",
        "author": "MarvelsGrantMan136",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/daredevil-born-again-lands-director-1235346034/",
        "text": "",
        "created_utc": 1678483567,
        "upvote_ratio": 1.0
    },
    {
        "title": "How far we've come",
        "author": "_random_one",
        "url": "https://www.reddit.com/r/television/comments/11o1182/how_far_weve_come/",
        "text": "[removed]",
        "created_utc": 1678482802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Red Dwarf will continue... kinda...",
        "author": "PloppyTheSpaceship",
        "url": "https://www.reddit.com/r/television/comments/11o0wto/red_dwarf_will_continue_kinda/",
        "text": "From the official Facebook post:\n\n“Rob Grant and Doug Naylor are delighted to announce that the ongoing dispute over the Red Dwarf rights has been resolved. Moving onwards and upwards Rob and Doug hope to launch separate iterations of Red Dwarf across various media, working again with the cast and other valued partners, and wish each other the very best. Smoke a kipper, Red Dwarf will be back for breakfast!!”\n\nSo after disputes between the two original creators, various separate iterations of Red Dwarf will hopefully be launched across various media.\n\nWhat does that entail? Hopefully (and most likely) we see Doug continuing the show, while Rob can do novels and stuff like Big Finish productions (apparently both he and BF have shown interest in the past). Hopefully again, Rob may have some input again on the TV series.\n\nEither way, given how good a fair bit of series 11, 12 and TPL were, this is excellent news!",
        "created_utc": 1678482510,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the worst reason actor leave show? What is the worst explanation why character disappear?",
        "author": "Ill_Heat_1237",
        "url": "https://www.reddit.com/r/television/comments/11o0k2x/what_is_the_worst_reason_actor_leave_show_what_is/",
        "text": "Actually, stupid is better word for second question. What is the most dumbest reason writers come up to explain missing character? \n\nFor the first part of question, Charlie Sheen oj 2,5 men is good (in his case terrible) example. \n\nFor the second, anything involving plastic surgery is terrible explanation.",
        "created_utc": 1678481669,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Town Called Malice | Official Trailer",
        "author": "PetyrDayne",
        "url": "https://youtu.be/X09ZFYeNfA8",
        "text": "",
        "created_utc": 1678480384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ted Lasso final season",
        "author": "KakrafoonKappa",
        "url": "https://www.reddit.com/r/television/comments/11nzjzp/ted_lasso_final_season/",
        "text": "I never really expected to like this show, as I don't like football or other sports. I mainly watched it because I live a stone's throw from Richmond town centre, and I quite like Jason Sudokus! \n\nCan't wait to see what happens with various character arcs, like Ted's love life, Roy Kent (fave character!), what happens with Evil Nate, and if we'll ever get to find out why the show's called Ted Lasso!",
        "created_utc": 1678479306,
        "upvote_ratio": 1.0
    },
    {
        "title": "MGM+'s A Spy Among Friends Is a Patient, Magisterial Addition to the Spy Pantheon",
        "author": "PetyrDayne",
        "url": "https://www.pastemagazine.com/tv/mgm-plus/a-spy-among-friends-review-guy-pearce-damian-lewis",
        "text": "",
        "created_utc": 1678478024,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘New Girl’ Leaving Netflix, All Episodes to Stream on Hulu and Peacock Starting April 17",
        "author": "MarvelsGrantMan136",
        "url": "https://variety.com/2023/digital/news/new-girl-streaming-hulu-peacock-leaving-netflix-1235549569/",
        "text": "",
        "created_utc": 1678477615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elizabeth Banks Leads Voice Cast Of ‘The Flintstones’ Animated Series ‘Bedrock’ As Comedy Scores Pilot Presentation At Fox",
        "author": "Wheresrenaldo",
        "url": "https://deadline.com/2023/03/elizabeth-banks-flintstones-bedrock-pilot-presentation-fox-1235285122/",
        "text": "",
        "created_utc": 1678477147,
        "upvote_ratio": 1.0
    },
    {
        "title": "مسلسل جانبي الايسر الحلقة 28 مدبلجة | شوف تي في - شوف تي في - Shoof Tv",
        "author": "Common_Tourist_565",
        "url": "https://shooftv.org/video/janibay-alaysar-s01-ep-28/",
        "text": "",
        "created_utc": 1678477099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Primal | Zombiedinosaurier | Adult Swim",
        "author": "PetyrDayne",
        "url": "https://youtu.be/VON_VBsytbk",
        "text": "",
        "created_utc": 1678476787,
        "upvote_ratio": 1.0
    },
    {
        "title": "The future of TV is up in the air",
        "author": "Fanfootie",
        "url": "https://www.reddit.com/r/television/comments/11ny3va/the_future_of_tv_is_up_in_the_air/",
        "text": "[https://www.theverge.com/23629525/tv-atsc3-free-antenna-broadcasts-scripps-nuvyyo](https://www.theverge.com/23629525/tv-atsc3-free-antenna-broadcasts-scripps-nuvyyo)",
        "created_utc": 1678475931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elizabeth Banks Leads Voice Cast Of ‘The Flintstones’ Animated Series ‘Bedrock’ As Comedy Scores Pilot Presentation At Fox",
        "author": "MarvelsGrantMan136",
        "url": "https://deadline.com/2023/03/elizabeth-banks-flintstones-bedrock-pilot-presentation-fox-1235285122/",
        "text": "",
        "created_utc": 1678475149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Killing Eve star Jodie Comer rumoured to reunite with Ridley Scott for Prime Video's upcoming Blade Runner 2099 project.",
        "author": "Cee-Jay",
        "url": "https://sffgazette.com/sci_fi/movies/jodie-comer-rumored-to-be-in-talks-to-star-in-blade-runner-2099-a4868#gs.s7q1pw",
        "text": "",
        "created_utc": 1678474251,
        "upvote_ratio": 0.5
    },
    {
        "title": "Gavin Newsom vs Walgreens | A Club Seats Highlight | Game #39",
        "author": "rawce__",
        "url": "https://youtu.be/1VWtgNO3_eE",
        "text": "",
        "created_utc": 1678473406,
        "upvote_ratio": 1.0
    },
    {
        "title": "TAYLAND'DA 30 TL'YE AMY WINEHOUSE OLDUM.DEVASA TAYLAND FİYAT REHBERİ #tr...",
        "author": "volkanc",
        "url": "https://youtube.com/watch?v=GMkQERfX08E&amp;feature=share",
        "text": "",
        "created_utc": 1678472751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Netflix's YOU season 4 writing makes no sense",
        "author": "its_Preshh",
        "url": "https://www.reddit.com/r/television/comments/11nwmqn/netflixs_you_season_4_writing_makes_no_sense/",
        "text": "So many characters making dumb decisions that rely solely on plot convenience.\n\nMarienne and Nadia's plan was to fake Marienne's death while hoping that a serial killer who burnt up his ex-wife won't do anything to her body. What?\n\nJoe usually cuts up and/or buries bodies. He's a master at taking care of bodies. But guess what? He left her body on a bench so she'll be found as a junkie? What?\nHe could have cut her up. That was a dumb plan that only needs plot convenience to work.\nVery dumb plan coming from so-called smart characters. There was no valid reason for not calling the police on Joe. Is Joe superhuman? What would he do if he was arrested?\n\nApparently, even if by luck the plan worked, the killer who tracked her across the globe won't suspect for a second that she's alive?\n\nThis season had too many writing issues, forced plot twists etc...it's almost as if the writers wanted to add as many elements as possible in the show and drag it on further...\nI guess the numbers are good so Netflix won't let it end even when this season would have been a perfect time to end the show\n\nMy biggest issue is characters acting irrational. Yes most of the cast are junkies...it still doesn't cover up the random behavior of these characters. These characters feel like they're just there to occupy screentime.\n\nEven the police...wtf... It's crazy how they don't suspect Joe despite him being the most suspicious. \nSomeone was murdered in a resort with a killer on the loose almost burning 2 others alive, yet the police did nothing? They didn't even question or investigate the people there. Police didn't even ask questions about how TF they took care of the body. At least someone should have given statement about how Joe took the body downstairs or something. \nThe police didn't even question them? What?\n\nWhat about Joe? He has multiple personality disorder but how TF did he set the bunker he was in on fire with no way to escape. In fact if Kate hadn't come to save them, he'd be dead. There was no way he could have predicted she would even find where he was.\nTerrible writing there.\n\nI cannot forgive the character assassination of Joe. The explanation for why Joe murdered those people was beyond terrible. So Joe killed someone because she made a drunk and high remark around a table that \"people started dying the moment he appeared?\"\nWhat? No one even took her seriously.\n\nJoe throughout the past seasons has never been someone to kill so thoughtlessly. That's the reason he's survived for so long. He's smart. \n\nWhat was his other motives for the other murders? Someone he barely knew was taking advantage of his former staff and getting all the credit?\nWhat?\n\nIt's almost as if the writers don't even understand Joe's character. Character assassination right there.\n\nKate's father, Tim, he knew his daughter was dating someone who he suspected had previously killed his wife and yet he allowed him? And even blackmailed him to kill Rhys? What?\nFor someone that powerful, it makes no sense that he couldn't pay someone with no trace to him to do the job. It had to be someone he thought was an amateur?\nWhy would he even leave the daughter he was so protective of with Joe?\n\nDon't let me get started on the mess that Phoebe was.\n\nI heard the previous seasons were adapted from novels...but I won't be surprised if this season was not...it was probably just a season to milk the shows popularity.",
        "created_utc": 1678472530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Katt a linkre",
        "author": "Difficult-Bed-6817",
        "url": "https://moneysocial-orq.buzz/27603736676502/?s=rd",
        "text": "",
        "created_utc": 1678472015,
        "upvote_ratio": 1.0
    },
    {
        "title": "With 'Burn Notice,' Bruce Campbell was given a role that was tailor-made for his sensibilities as an actor",
        "author": "Skeelo_Fan",
        "url": "https://www.looper.com/1222600/everybody-remembers-evil-dead-but-burn-notice-was-bruce-campbell-at-his-best/",
        "text": "",
        "created_utc": 1678471553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who’s Winning the Streaming Wars, Ranked by Revenue and Subscribers",
        "author": "Hidethegoodbiscuits",
        "url": "https://www.indiewire.com/2023/03/whos-winning-the-streaming-wars-revenue-subscribers-netflix-disney-1234813738/",
        "text": "",
        "created_utc": 1678471011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Season 3, Episode 4 of Picard, \"No-Win Scenario,\" one of the best episodes of Trek in the past 20 years?",
        "author": "stumpcity",
        "url": "https://www.reddit.com/r/television/comments/11nvjm7/was_season_3_episode_4_of_picard_nowin_scenario/",
        "text": "**Spoilers:** &gt;!Yes. It was.!&lt;\n\n(Degree of Difficulty: Not particularly interested in the by-now standard YouTube Geek Culture Grift responses about \"nu-trek\" or whatever, as if I wanted those I could drink heavily and turn off the YouTube Comments Blocker add-on and just swim in Malding Nerd Froth pooping back and forth forever under any given RLM thumbnail.)\n\n**The Episode:** There's just legitimately great acting going on in here from multiple actors who are not only delivering *as* actors, but what they're being given feels completely in keeping with the characters as they've been presented to this point, and in context of their larger history in the show. \n\n**Also:** Frakes' direction isn't just impressive in terms of pacing, but blocking and camera movement was really, really well thought out. This is up there with his work on First Contact (which this season has been overtly referencing quite a bit) but I'd argue this is even tighter and more impressive than that? \n\n**AND**: I have a hard time believing Paramount *isn't* going to replace Discovery with a Picard-spinoff set on the Titan and starring Shaw, Seven, LaForge, and Jack Crusher as the primary leads. And based on this one episode, it would immediately become a must-watch on the level of Strange New Worlds. \n\nNow, I understand the inclination to weigh this by whether or not it justifies the two preceding seasons, or the decisions made on other shows by other creative teams, or to springboard into the aforementioned Geek Culture Talking Points about \"real trek\" and so on and so forth, but I really do think that - all that inevitable mess aside - as a solid hour of sci-fi storytelling, this was way, *way* up there. Just remarkable work by basically everyone. I loved watching it.",
        "created_utc": 1678470016,
        "upvote_ratio": 1.0
    },
    {
        "title": "BBC will not broadcast Attenborough episode over fear of rightwing backlash",
        "author": "Konradleijon",
        "url": "https://www.theguardian.com/media/2023/mar/10/david-attenborough-bbc-wild-isles-episode-rightwing-backlash-fears",
        "text": "",
        "created_utc": 1678469671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else think King of the Hill at its peak may have been even better than The Simpsons at its peak?",
        "author": "unitedfan6191",
        "url": "https://www.reddit.com/r/television/comments/11nv8f5/anyone_else_think_king_of_the_hill_at_its_peak/",
        "text": "Hey.\n\nHope you’re all doing well.\n\nFirst off, both were awesome shows at their respective peaks so i don’t consider it a landslide either way and i’m not even necessarily saying either was necessarily better than the other, but that I think King of the Hill, because Simpsons is often considered the superior show by most people, deserves to at least be considered as a strong contender and maybe even superior.\n\nKing of the Hill when it aired felt like a breath of fresh air and different from pretty much anything that came before, especially as an animated comedy. Simpsons was as well, but Simpsons always had that cartoony vibe even when it was more down to earth - Homer jumping the gorge, for instance, and living.\n\nThe writing on King of the Hill was very strong, characters felt multilayered and complex, stories and characters felt down-to-earth and it was a show which I think could have worked as both an animated show and live-action.\n\nThe Simpsons in its peak years had many of the same qualities but I felt some of their stories (especially big social topics episodes like the gun episode or the one tackling immigration) didn’t have the same kind of nuance and sophistication that King of the Hill did.\n\nI like both shows so I don’t necessarily have a preference as far as better snow goes, but I think if someone said King of the Hill was slightly better, I couldn’t argue.\n\nWhat are your thoughts and do you prefer one over the other?",
        "created_utc": 1678469286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hassan Minaj needs to be the new permanent host of The daily show",
        "author": "Too-Far-Frame",
        "url": "https://www.reddit.com/r/television/comments/11nuxhy/hassan_minaj_needs_to_be_the_new_permanent_host/",
        "text": "He CRUSHED it during his week stint at the daily show guest hosting. He was hilarious but also wasn't afraid to really drill someone down like Jon used to. He's also fine with getting silly giving basketball players candy sweets. \n\nPatriot act ended too soon! Would love to see Hassan be the new permanent host of The daily show",
        "created_utc": 1678468567,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Sweet Tooth’: Naledi Murray, Neil Sandilands, Marlon Williams Upped to Series Regulars For Season 2, Two More Cast",
        "author": "indig0sixalpha",
        "url": "https://deadline.com/2023/03/sweet-tooth-season-2-cast-neil-sandilands-naledi-murray-murray-williams-1235284787/",
        "text": "",
        "created_utc": 1678467662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gary Lineker to step back from presenting MOTD",
        "author": "Kagedeah",
        "url": "https://www.bbc.co.uk/news/uk-64920557",
        "text": "",
        "created_utc": 1678467618,
        "upvote_ratio": 1.0
    },
    {
        "title": "HBO Max/Discovery+ Merged Service Price Revealed",
        "author": "DemiFiendRSA",
        "url": "https://www.indiewire.com/2023/03/hbo-max-discovery-plus-merged-service-price-revealed-1234818078/",
        "text": "",
        "created_utc": 1678467610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gary Lineker to step back from presenting Match of the Day until an agreement is reached on his social media use",
        "author": "BordersRanger01",
        "url": "https://www.bbc.co.uk/news/uk-64920557",
        "text": "",
        "created_utc": 1678466554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yellowjackets Official Season 2 Trailer: So We Have Some New Theories",
        "author": "Healthy-Recover7544",
        "url": "https://bleedingcool.com/tv/yellowjackets-official-season-2-trailer-so-we-have-some-new-theories/",
        "text": "",
        "created_utc": 1678465419,
        "upvote_ratio": 1.0
    },
    {
        "title": "QUIZ: Can You Guess The TV Show?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678465184,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Ted Lasso’ Season 3 Coasts on Good Vibes and Little Else",
        "author": "mrnicegy26",
        "url": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/ted-lasso-season-3-coasts-on-good-vibes-little-else-jason-sudeikis-1234691305/",
        "text": "",
        "created_utc": 1678464056,
        "upvote_ratio": 1.0
    },
    {
        "title": "CITV channel to close as ITV makes most children’s shows online-only",
        "author": "Kagedeah",
        "url": "https://www.theguardian.com/media/2023/mar/10/citv-channel-to-close-itv-childrens-television-online-only",
        "text": "",
        "created_utc": 1678464053,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you watching and what do you recommend? (Week of March 10, 2023)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/television/comments/11nsxr8/what_are_you_watching_and_what_do_you_recommend/",
        "text": "Comments are sorted by new by default.\n\n* Feel free to describe what shows you've been watching and what you think of them.\n\n* Feel free to ask for and give recommendations for what to watch to other users.\n\n* All requests for recommendations are redirected to this thread, however you are free to create your own thread to recommend something to others or to discuss what you're currently watching.\n\n* Use spoiler tags where appropriate. Copy and edit this text: \\&gt;!Spoiler!&lt; becomes &gt;!Spoiler!&lt;. Type *inside* the exclamation marks, with no extra spaces.",
        "created_utc": 1678464012,
        "upvote_ratio": 1.0
    },
    {
        "title": "William Shatner on 'Star Trek,' Space Travel and Dying",
        "author": "CorporateSympathizer",
        "url": "https://variety.com/2023/film/news/william-shatner-star-trek-space-travel-death-leonard-nimoy-documentary-1235548320/",
        "text": "",
        "created_utc": 1678462597,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Kind of Country - Official Trailer | AppleTV+",
        "author": "Saar13",
        "url": "https://youtu.be/H-rsqQJ2pXs",
        "text": "",
        "created_utc": 1678461525,
        "upvote_ratio": 1.0
    },
    {
        "title": "BBC will not broadcast Attenborough episode over fear of rightwing backlash",
        "author": "misana123",
        "url": "https://www.theguardian.com/media/2023/mar/10/david-attenborough-bbc-wild-isles-episode-rightwing-backlash-fears",
        "text": "",
        "created_utc": 1678460576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clarkson’s Farm Needs to Pick a Lane",
        "author": "meowskywalker",
        "url": "https://www.reddit.com/r/television/comments/11nr944/clarksons_farm_needs_to_pick_a_lane/",
        "text": "There are two Clarkson’s Farms happening simultaneously. \n\nIn one he’s a celebrity tourist who wants to do farming stuff. He buys the big dumb tractor he doesn’t need because it’s the coolest one He plants a new type of crop every day, he buys sheep for a year, decides he’s bored with them, buys cows instead.  He opens shops and restaurants to give his fans a chance to be a part of the experience. Its all a lot of fun, and the sort of thing you can do when profitability isn’t not a concern because you have endless piles of Top Gear Grand Tour Millionaire money chilling out in a bank account. \n\nBut then there’s the other show. The “oh No look how hard it is out here for farmers show”.  “I worked all year and I barely made any money!” “Look at all these endless forms I have to fill out! How am I supposed to protect my cows from TB if the mean old government won’t let me murder badgers?!”  And that show is just incompatible with the other show. Of course you didn’t make profits, you kept spending money on whatever new thing tickles your fancy today.  Of course the local town government is pissed at you, you invited 11 million twitter followers to this tiny town where the road isn’t even wide enough for two cars to pass each other.  Of course your cows are at risk of getting TB, everyone said “hey this is a high TB if you get cows they’re probably gonna get it” and you said “that’s okay I want cows.”  And why oh why is he so insistent that his restaurant be on his farm?  Surely there is a restaurant in the town he could just purchase to sell his stuff directly to the people that wouldn’t require asking building permission for nine hundred fiddly little things?\n\nEither one of those shows on its own would be a fine show. But both at once makes it remarkably frustrating.  How can I be on his side against the council when he’s argues his farm needs to make a profit, despite the fact that I’ve watched ten episodes where it’s clear he’s not actually that concerned with making a profit?  Also, the more he whine about snowflakes and their doomsday climate change predictions, the harder it is for me to feel bad for him when he farm is struck by extreme never before seen weather patterns that risk it’s viability. Well dang man, why do YOU think you got hit by the most rain and then the largest drought ever if it’s not climate change?",
        "created_utc": 1678460000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a Japanese version of Narcos?",
        "author": "Tamagotchi41",
        "url": "https://www.reddit.com/r/television/comments/11nqp12/is_there_a_japanese_version_of_narcos/",
        "text": "I have always been interested in the Japanese crime world and was curious and there are any shows/movies documenting undercover personal into Japanese gangs.\n\nI would like as close to reality as possible and even \"based on true events\" \n\nThanks in advance!",
        "created_utc": 1678458580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to watch The Other Me(2019) series?",
        "author": "cardiffExpress",
        "url": "https://www.reddit.com/r/television/comments/11nqdrl/where_to_watch_the_other_me2019_series/",
        "text": "[removed]",
        "created_utc": 1678457762,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Ted Lasso’ Review: Season 3 Is Both Too Much and Not Enough",
        "author": "fdjadjgowjoejow",
        "url": "https://www.hollywoodreporter.com/tv/tv-reviews/ted-lasso-review-apple-tv-season-3-1235347328",
        "text": "",
        "created_utc": 1678456658,
        "upvote_ratio": 1.0
    },
    {
        "title": "UK viewers of Apple TV, am I going mad? (Watchers of Foundation specifically)",
        "author": "RudePragmatist",
        "url": "https://www.reddit.com/r/television/comments/11nptko/uk_viewers_of_apple_tv_am_i_going_mad_watchers_of/",
        "text": "I know I watched season 2 of Foundation last year but I went back to watch it again and can only find season 1.\n\nWhat did they change? Anyone have any idea why I can't find it now? :)",
        "created_utc": 1678456400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robert Blake, actor acquitted in wife's killing, dies at 89 | AP News",
        "author": "oliverkloezoff",
        "url": "https://apnews.com/article/robert-blake-dies-ddf7a0c37dae4690ac82bf377e5aec70",
        "text": "",
        "created_utc": 1678451646,
        "upvote_ratio": 1.0
    },
    {
        "title": "Star Trek: Picard Season 3, Episodes 2, 3 and 4 - re:View",
        "author": "ImpossibleGuardian",
        "url": "https://youtu.be/tRXaMxt09-I",
        "text": "",
        "created_utc": 1678451540,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Red Dwarf' Rights Dispute Resolved, Franchise to expand further into \"Seperate Iterations[...] Across Various Media\"",
        "author": "Illustrious-Ranger22",
        "url": "https://twitter.com/RedDwarfHQ/status/1634162231951736833?t=p-EHLsbgnHcTyPAq22J0jQ&amp;s=19",
        "text": "",
        "created_utc": 1678451366,
        "upvote_ratio": 1.0
    },
    {
        "title": "ITV to close its linear children’s channel CITV after 17 years",
        "author": "Kagedeah",
        "url": "https://www.broadbandtvnews.com/2023/03/10/itvx-kids-to-replace-linear-channel/",
        "text": "",
        "created_utc": 1678446928,
        "upvote_ratio": 1.0
    },
    {
        "title": "ITV is to close its linear children’s channel CITV after 17 years",
        "author": "Kagedeah",
        "url": "https://www.broadbandtvnews.com/2023/03/10/itvx-kids-to-replace-linear-channel/",
        "text": "",
        "created_utc": 1678446676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luther - S5 question (question and answers will contain spoilers)",
        "author": "thechrisare",
        "url": "https://www.reddit.com/r/television/comments/11nm2oj/luther_s5_question_question_and_answers_will/",
        "text": "I’m going to watch the Luther movie tonight. I was going to rewatch season 5 to remind myself how it ended up but didn’t get time to. I’m pretty sure I remember everything important except for one thing:\n\n&gt;!What triggered Alice to turn on John and want to kill him at the end of the final episode?!&lt;",
        "created_utc": 1678446133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sir David Attenborough voted UK's favourite TV presenter of all time",
        "author": "Captain_Smartass_",
        "url": "https://uk.news.yahoo.com/sir-david-attenborough-voted-uks-123000340.html",
        "text": "",
        "created_utc": 1678444160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jimmy Fallon, The Roots &amp; The Super Mario Bros. Movie Cast Sing the Super Mario Bros. Theme Song",
        "author": "Captain_Smartass_",
        "url": "https://youtu.be/h4nq-JDPDgA",
        "text": "",
        "created_utc": 1678443810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Surat ul Fateha translation in English سورۃ الفاتحہ کا ترجمہ انگریزی میں",
        "author": "OK-Concept-4754",
        "url": "https://youtu.be/wYffhD-fhuc",
        "text": "",
        "created_utc": 1678443383,
        "upvote_ratio": 1.0
    },
    {
        "title": "David Attenborough voted Britain's favourite TV presenter of all time",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678441566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scream VI Review: The Best Scream Since The Original?",
        "author": "Screenviewing",
        "url": "https://www.screenviewing.com/post/scream-vi-the-best-scream-since-the-original",
        "text": "",
        "created_utc": 1678440926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Becoming Frida Kahlo: new BBC documentary paints a compelling portrait of the Mexican artist",
        "author": "Hidethegoodbiscuits",
        "url": "https://theconversation.com/becoming-frida-kahlo-new-bbc-documentary-paints-a-compelling-portrait-of-the-mexican-artist-201427",
        "text": "",
        "created_utc": 1678440390,
        "upvote_ratio": 1.0
    },
    {
        "title": "LIVE Ai generated Spongebob episodes 24/7",
        "author": "Eight__Septillion",
        "url": "https://www.twitch.tv/ai_sponge",
        "text": "",
        "created_utc": 1678432960,
        "upvote_ratio": 1.0
    },
    {
        "title": "LIVE Ai generated Spongebob episodes 24/7",
        "author": "Eight__Septillion",
        "url": "https://www.twitch.tv/fraisier3000",
        "text": "",
        "created_utc": 1678432929,
        "upvote_ratio": 1.0
    },
    {
        "title": "FrAIsier 3000 is Now alive! Scratch that itch by listening into a procedurally generated talk show hosted by FrAisier",
        "author": "Eight__Septillion",
        "url": "https://www.twitch.tv/fraisier3000",
        "text": "",
        "created_utc": 1678432340,
        "upvote_ratio": 1.0
    },
    {
        "title": "Penn Badgley Unpacks the Major Twist of ‘You’ Season 4",
        "author": "verissimoallan",
        "url": "https://www.hollywoodreporter.com/tv/tv-features/you-finale-penn-badgley-twist-season-4-part-2-interview-1235343167/",
        "text": "",
        "created_utc": 1678431565,
        "upvote_ratio": 1.0
    },
    {
        "title": "tv",
        "author": "InformalWestern6163",
        "url": "https://youtu.be/-tFb6cKaTcA",
        "text": "",
        "created_utc": 1678431073,
        "upvote_ratio": 1.0
    },
    {
        "title": "FrAIsier 3000 - The Latest AI Experiment",
        "author": "DPC_1",
        "url": "https://www.twitch.tv/fraisier3000",
        "text": "",
        "created_utc": 1678426633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Importance of Outdoor LED Display Screen in Today's Advertising",
        "author": "vrscomputersdubai",
        "url": "https://www.vrscomputers.com/blog/importance-of-outdoor-led-display-screen-in-todays-advertising/",
        "text": "",
        "created_utc": 1678426546,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Owl House series finale, \"Watching and Dreaming\", revealed to be airing on April 8th (9pm EST)",
        "author": "MulciberTenebras",
        "url": "https://www.cbr.com/the-owl-house-season-3-finale-date-report/",
        "text": "",
        "created_utc": 1678425059,
        "upvote_ratio": 1.0
    },
    {
        "title": "come suck👅my pu🥵🥵y🍆if you wanna💧🍆have serious👅🍆 and hot🔥🔥s** 👻s chat and come taste👅my warm 💯creamy 🍆pu**yHMU on snapchat 👻👻👻@Noahisabella11011 And also in GOOGLE CHAT noahisabella100@gmail.com on google chat",
        "author": "refwttw1226",
        "url": "https://www.reddit.com/r/television/comments/11nf6zq/come_suckmy_puyif_you_wannahave_serious_and_hots/",
        "text": "[removed]",
        "created_utc": 1678424095,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Chicago Fire’ Will Return Jesse Spencer In An Upcoming Episode, Social Media Leak Reveals",
        "author": "lostwanderer92",
        "url": "https://deadline.com/2023/03/chicago-fire-will-return-jesse-spencer-in-upcoming-episode-social-media-leak-reveals-1235284486/",
        "text": "",
        "created_utc": 1678422199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jimmy Fallon, The Roots &amp; The Super Mario Bros. Movie Cast Sing the Super Mario Bros. Theme Song.",
        "author": "FredererPower",
        "url": "https://www.youtube.com/watch?v=h4nq-JDPDgA",
        "text": "",
        "created_utc": 1678422040,
        "upvote_ratio": 1.0
    },
    {
        "title": "CBC Affirms Commitment to Radio/TV Broadcasting, for Now",
        "author": "antdude",
        "url": "https://www.radioworld.com/news-and-business/headlines/cbc-affirms-commitment-t o-radio-tv-broadcasting-for-now",
        "text": "",
        "created_utc": 1678417591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello Im no one",
        "author": "Marble_FunkHouse",
        "url": "https://www.reddit.com/r/television/comments/11nci8u/hello_im_no_one/",
        "text": "[removed]",
        "created_utc": 1678416726,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Stranger Things’ Star Grace Van Dien Is ‘Turning Down Acting Projects’ After Alleged Sexual Advances From Movie Producer",
        "author": "DemiFiendRSA",
        "url": "https://variety.com/2023/tv/news/stranger-things-grace-van-dien-turning-down-acting-projects-sexual-advances-movie-producer-1235548768/",
        "text": "",
        "created_utc": 1678414534,
        "upvote_ratio": 1.0
    },
    {
        "title": "People’s Choice Country Awards To Air In September On NBC &amp; Peacock",
        "author": "singleguy79",
        "url": "https://deadline.com/2023/03/peoples-choice-country-awards-september-nbc-peacock-1235283767/",
        "text": "",
        "created_utc": 1678414186,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Making of The Last of Us Special To Air After the Finale | The HBO show will give us at least a little more Pedro Pascal and Bella Ramsey after season one ends.",
        "author": "chrisdh79",
        "url": "https://gizmodo.com/the-making-of-the-last-of-us-special-to-air-finale-hbo-1850210214",
        "text": "",
        "created_utc": 1678413564,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should be the 1001 TV Shows you must watch before you die?",
        "author": "Ozmeow1900",
        "url": "https://www.reddit.com/r/television/comments/11na61v/what_should_be_the_1001_tv_shows_you_must_watch/",
        "text": "In 2015 as part of the 1001 before you die they published the book 1001 TV Shows You Must Watch Before You Die, the general consensus is that the list is pretty bad.\n\nThe point of this discussion is to see what people think should be on a list like this. News broadcasts, award shows, sports events, &amp; TV movies are excluded. Please try not to overlook non-english shows and animation. The entries should try to tell the story of the history of television. The main question is simply what shows do you think everyone should watch before they die?",
        "created_utc": 1678410732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Actor Robert Blake, known for \"Baretta\" and \"Lost Highway,\" dies at 89",
        "author": "shellystarzz",
        "url": "https://www.cbsnews.com/news/actor-robert-blake-baretta-lost-highway-dies-at-age-89/",
        "text": "",
        "created_utc": 1678409976,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Was the Best Recasting in TV History?",
        "author": "mwilliams1960",
        "url": "https://www.reddit.com/r/television/comments/11n9gka/what_was_the_best_recasting_in_tv_history/",
        "text": "If you don't have a favorite do you have a specific recasting that you'll always remember or a character you wish HAD been recast?",
        "created_utc": 1678408949,
        "upvote_ratio": 1.0
    },
    {
        "title": "You season 4 part 2 review (2023) — no, really, it’s super unhinged",
        "author": "BetFar2378",
        "url": "https://www.thedigitalfix.com/you/season-4-part-2-review",
        "text": "",
        "created_utc": 1678408601,
        "upvote_ratio": 1.0
    },
    {
        "title": "1001 TV Shows redo",
        "author": "Ozmeow1900",
        "url": "https://www.reddit.com/r/television/comments/11n8zd8/1001_tv_shows_redo/",
        "text": "The general consensus of the actual 1001 TV shows you must watch before you die book is that it's pretty bad.\n\nSo the question I ask is what TV shows should be on the list? News broadcasts, award shows, sports events, &amp; TV movies are excluded. Please don't leave out international shows and animation. The entries should tell the story of the history of television. But the main question is what shows do you think everyone should watch before they die?",
        "created_utc": 1678407748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robert Blake Dies: Actor In ‘Baretta’ And ‘In Cold Blood’ Was 89, Beat Real-Life Murder Rap",
        "author": "Keikobad",
        "url": "https://deadline.com/2023/03/robert-blake-dead-actor-in-baretta-in-cold-blood-was-89-beat-real-life-murder-rap-1235284339/",
        "text": "",
        "created_utc": 1678407184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good sitcoms that have storylines and aren't like a short movie each episode that have no continuity?",
        "author": "Tricky_Photograph123",
        "url": "https://www.reddit.com/r/television/comments/11n8jgb/good_sitcoms_that_have_storylines_and_arent_like/",
        "text": "[removed]",
        "created_utc": 1678406693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Star Trek: Picard Season 3, Episodes 2, 3, and 4 - re:View",
        "author": "CrossXhunteR",
        "url": "https://www.youtube.com/watch?v=tRXaMxt09-I",
        "text": "",
        "created_utc": 1678405705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calling all Joey Tribbiani fans! Test your knowledge with our ultimate quiz and see if you're truly a true friend of Joey!",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678405450,
        "upvote_ratio": 1.0
    },
    {
        "title": "American Gods Season 1 was one of the best seasons of TV ever. Starz were fucking idiots for kicking Bryan Fuller and Michael Green off.",
        "author": "Raptor2705",
        "url": "https://www.reddit.com/r/television/comments/11n7x2v/american_gods_season_1_was_one_of_the_best/",
        "text": "Unpopular opinion I know. However Bryan Fuller has a track record of creating amazing shows with amazing casts. Shame that they always end up cancelled. It's like Firefly but on multiple occasions.",
        "created_utc": 1678405231,
        "upvote_ratio": 1.0
    },
    {
        "title": "SLIP | Official Trailer | The Roku Channel",
        "author": "matlockga",
        "url": "https://www.youtube.com/watch?v=Xg2Lynfu0Qw",
        "text": "",
        "created_utc": 1678405173,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘You’ Takes Over No. 1 Spot On Nielsen U.S. Streaming Charts, ‘The Last Of Us’ Rises To Third Place",
        "author": "MarvelsGrantMan136",
        "url": "https://deadline.com/2023/03/you-the-last-of-us-nielsen-streaming-ratings-netflix-hbo-max-1235284296/",
        "text": "",
        "created_utc": 1678405102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Teenage Mutant Ninja Turtles series?",
        "author": "vista_bagger",
        "url": "https://www.reddit.com/r/television/comments/11n7rfd/best_teenage_mutant_ninja_turtles_series/",
        "text": "My 6yo wants to watch Teenage Mutant Ninja Turtles.  He heard about it in a book, lol.  I watched it in the 80's-90's as a kid.  When trying to find it to stream, I see there are so many more versions than I dreamed of, so I'm looking for a recommendation for the best or conversely, which to avoid. \n\nThanks!",
        "created_utc": 1678404857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buy League of Legends Scripts | LoL Script FREE Trial by LolScript.com",
        "author": "yurischedlerwzi",
        "url": "https://LolScript.com/",
        "text": "",
        "created_utc": 1678403363,
        "upvote_ratio": 1.0
    }
]