[
    {
        "title": "American Born Chinese’ Review: Michelle Yeoh and Ke Huy Quan Reunite in Disney+’s Vibrant Graphic Novel Adaptation",
        "author": "Sisiwakanamaru",
        "url": "https://www.hollywoodreporter.com/tv/tv-reviews/american-born-chinese-review-michelle-yeoh-ke-huy-kwan-1235352437/",
        "text": "",
        "created_utc": 1678949073,
        "upvote_ratio": 1.0
    },
    {
        "title": "John Mulaney is gonna host SNL again",
        "author": "MyFatherKilledMe",
        "url": "/r/LiveFromNewYork/comments/11s8dpl/john_mulaney_is_gonna_host_snl_again/",
        "text": "",
        "created_utc": 1678946945,
        "upvote_ratio": 1.0
    },
    {
        "title": "V Packing Suppliers &amp; Piston Seals Suppliers in Turkmenistan - Ariiz International",
        "author": "Key-Television-4029",
        "url": "https://www.reddit.com/r/u_Key-Television-4029/comments/11slhiw/v_packing_suppliers_piston_seals_suppliers_in/",
        "text": " We are one of the best and most reputable suppliers of [***piston seals suppliers***](https://www.ariiz.net/our-products/v-packing/) and V-packing. We have years of experience providing V-packing and pneumatic sealing solutions. To learn more about V packing Seals Suppliers visit our website.",
        "created_utc": 1678945535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rhaenyra Targaryen is the worst character in the GOT franchise",
        "author": "Ihatemilkpeople",
        "url": "https://www.reddit.com/r/television/comments/11sle1y/rhaenyra_targaryen_is_the_worst_character_in_the/",
        "text": "I don't particularly dislike any particular character in GOT or HOTD except Rhaenyra. Every other character I can find some interesting points about - even Joffrey is entertaining sometimes. But I find Rhaenyra utterly, utterly pathetic, without any redeeming quality as a ruler, as a person, as a woman. She disgusts me to no end.\n\nShe is insanely selfish - am I the only one who thinks she's a very very scary narcissist? Never in the whole course of her life has she had a single concern about others - it's always about herself, her children who she sees as an extension of herself. Even the great narcissist Cersei has shown some small sympathy towards Sansa when she was engaged to Joffrey. She never even bothered to visit or care for her father, instead she was chilling with her creepy uncle on Dragonstone.\n\nThis point is tied to the previous one - she uses and manipulates, and tramples over others and treats her allies like absolute garbage. Corlys Velaryon was first grandcucked, then got his son murdered either by her or her husband, then got his granddaughters deprived of their birthrights and betrothed to bastards. Yet for some reason still supports his great abuser.\n\nShe inspires zero loyalty and devotion from either her people or the nobles. She insults important nobles who have never offended her, doesn't make alliances.\n\nShe took it for granted that others should die for her ungrateful and pathetic cause. She gaslights others into lying about her bastards' parentage and maims/executes everyone who disagrees.\n\nShe is an atrocious, atrocious ruler with zero redeeming quality. She never made allies or made sensible political decisions. \n\nShe never defends the rights of other women, she thinks she is the special exception to the patriarchy. She usurps her stepdaughter's birthright in favor of her bastard Luke and her own son's right in favor of her bastard Jace. Unfortunately, her bastards are so sheltered and disliked that that one has been immediately killed off during the war. By giving birth to them, she puts their life in mortal danger and ensures they will always be ridiculed.\n\nShe has spent her whole life avoiding duty and responsibility, using, abusing and manipulating those closest to her.\n\nTell me one positive quality of this utter failure of a Targaryen has and I will refute you.",
        "created_utc": 1678945202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rhaenyra Targaryen is the worst character in the GOT franchise",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678945070,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the use of Touchscreen in Business?",
        "author": "vrscomputersdubai",
        "url": "https://www.slideshare.net/VRSComputers/what-is-the-use-of-touchscreen-in-business",
        "text": "",
        "created_utc": 1678944779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Miss Lemon - Poirot (1989)",
        "author": "steppenwolf666",
        "url": "https://www.reddit.com/r/television/comments/11skyda/miss_lemon_poirot_1989/",
        "text": "I'm currently working my way through Poirot (1989) and have noticed something for the first time about his secretary - Miss Lemon (Pauline Moran)\n\nShe is the actual Woman in Black (1989)\n\nHard to unsee it once seen",
        "created_utc": 1678943702,
        "upvote_ratio": 1.0
    },
    {
        "title": "FX's 'Class of '09' Series Sets Premiere Date on Hulu (US) and Disney+ (Canada) : May 10",
        "author": "HumanOrAlien",
        "url": "https://collider.com/class-of-09-series-release-date/",
        "text": "",
        "created_utc": 1678943407,
        "upvote_ratio": 1.0
    },
    {
        "title": "FX's 'Class of '09' Series Sets Premiere Date on Hulu: May 10",
        "author": "HumanOrAlien",
        "url": "https://collider.com/class-of-09-series-release-date/",
        "text": "",
        "created_utc": 1678943234,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Monk' Reunion Movie Set at Peacock",
        "author": "Yummie23",
        "url": "https://variety.com/2023/tv/news/monk-reunion-movie-peacock-1235555549/",
        "text": "",
        "created_utc": 1678941944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gotham Knights: We Watched It So You Don't Have to",
        "author": "haydenclaireheroes",
        "url": "https://legendsoftomorrowpodcast.com/uncategorized/gotham-knights-we-watched-it-so-you-dont-have-to/",
        "text": "",
        "created_utc": 1678941321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Puzzle, performance, or prank? TV’s best game show isn’t a game show at all",
        "author": "TransFattyAcid",
        "url": "https://www.polygon.com/23639574/dropout-tv-college-humor-game-changer-sam-reich",
        "text": "",
        "created_utc": 1678939987,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mando S3E3 was not good",
        "author": "Fanfootie",
        "url": "https://www.reddit.com/r/television/comments/11sjmzs/mando_s3e3_was_not_good/",
        "text": "[removed]",
        "created_utc": 1678939515,
        "upvote_ratio": 1.0
    },
    {
        "title": "सतभक्ति करने से जीवन सुखी हो जाता है। पापों से बचाव होता है, गृह क्लेश भी समाप्त हो जाता है। SA True Story 🥀🥀 आध्यात्मिक जानकारी के लिए 𝐏𝐥𝐚𝐲𝐒𝐭𝐨𝐫𝐞 से 𝐈𝐧𝐬𝐭𝐚𝐥𝐥 करें 𝐀𝐩𝐩 :- \"𝐒𝐚𝐧𝐭 𝐑𝐚𝐦𝐩𝐚𝐥 𝐣𝐢 𝐌𝐚𝐡𝐚𝐫𝐚𝐣 𝐯𝐢𝐬𝐢𝐭 :- ↪️ 𝐒𝐚𝐧𝐭 𝐑𝐚𝐦𝐩𝐚𝐥 𝐣𝐢 𝐌𝐚𝐡𝐚𝐫𝐚𝐣 𝐘",
        "author": "Ok-Television-5505",
        "url": "https://v.redd.it/5l9ed43ou0oa1",
        "text": "",
        "created_utc": 1678937995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life becomes happy by doing true devotion. There is protection from sins, home distress also ends. SA True Story 🥀🥀 For spiritual information Install 𝐃𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥𝐥 \"",
        "author": "Ok-Television-5505",
        "url": "https://i.redd.it/btf5eyrxa2oa1.jpg",
        "text": "",
        "created_utc": 1678937419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ana Gasteyer Has Waited Her Entire Career for American Auto",
        "author": "stroh_1002",
        "url": "https://www.vulture.com/article/ana-gasteyer-american-auto-snl-interview.html",
        "text": "",
        "created_utc": 1678937202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poonam, Etawah, Uttar Pradesh I had a lump in my womb and after taking Naam Updesh from Saint Rampal Ji Maharaj, I was cured. SA True Story 🥀🥀 For spiritual information 𝐃𝐥𝐥𝐥𝐥 from PlayStore",
        "author": "Ok-Television-5505",
        "url": "https://i.redd.it/8kc4iypc92oa1.jpg",
        "text": "",
        "created_utc": 1678936886,
        "upvote_ratio": 1.0
    },
    {
        "title": "ParamountPlus running a scam",
        "author": "kasey1951",
        "url": "https://www.reddit.com/r/television/comments/11si22i/paramountplus_running_a_scam/",
        "text": "ParamountPlus created a bundle package with Showtime. It leads subscribers to falsely believe they will get the full Showtime catalog. You do not. Some of the shows, even recent ones, are not available with the bundle.\n\nDon't fall for corporate deals. There are no deals. No one gives consumers anything free or at a reduced rate without ensuring the company will come out ahead and the consumer will ultimately be shorted in some way. \n\nI dislike streaming services. They look for ways to dupe customers. After all, they are in the business to make as much money as they can. Sometimes they must lie.",
        "created_utc": 1678935094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Black Summer appreciation",
        "author": "vaseinahouse",
        "url": "https://www.reddit.com/r/television/comments/11sgu1v/black_summer_appreciation/",
        "text": "Anyone else love this show? Didn't think much of it before watching. \"Another zombie show\". Done to death, right? This show does not break new ground but damn it was a refreshing zombie show! Some points why I thought it was worth watching\n\n- scary zombies: everybody who dies turns into zombies immediately and they are fast and strong. Following along a cast of \"everymen\" it shows how brutal it is just to survive one of them. \n\n- deeply cynical view of humanity in a genre that is already known to push boundries with this idea. It seemed so so bleak. Every character is like the \"raider\" characters you meet in post apocalyptic media. There is nothing happy about this show\n\n- shown in vingettes, shot to look like one shot only. I'm sure there's camera tricks and it's not literally filmed all in one go, but this is what attracted to me when I first started watching it. It felt so much different in its cinematography and pacing than other zombie media. Very refreshing.\n\n- engaging characters. Spoilers follow but you'll quickly learn it's the conceit of the show &gt;!For a show that's making the choices it makes regarding the characters, no one's really the main character and most people you follow die, it's nice you got to enjoy most of their prescences!&lt; \n\nOverall, not perfect. It can get boring at times and the chronology choices they made in the first episodes of s2 felt super weird to me. But s1 is a great entertaining watch and s2 kicks into high gear around ep 3 or 4. 8/10",
        "created_utc": 1678932035,
        "upvote_ratio": 1.0
    },
    {
        "title": "South Park's Latest Episode 'Deep Learning' Was Written By ChatGPT",
        "author": "Gato1980",
        "url": "https://www.unilad.com/film-and-tv/south-parks-latest-episode-deep-learning-was-written-by-chatgpt-503331-20230315",
        "text": "",
        "created_utc": 1678931234,
        "upvote_ratio": 1.0
    },
    {
        "title": "I.O.U. Episode of a show I don't remember",
        "author": "2_0_1",
        "url": "https://www.reddit.com/r/television/comments/11se6uy/iou_episode_of_a_show_i_dont_remember/",
        "text": "I remember a long time ago my dad told me about this show that he used to watch with my older brother that he really liked. It was an animated mystery (?) show, and if I remember correctly, the style was similar to Invader Zim, or American Dragon: Jake Long. When I asked him about it again, he said he didn't remember.\n\nThere was one episode I remember the best; it was about I.O.U.s. The kid kept making I.O.U.s, and always said he would pay them off later. In the end, he was killed off screen, but you could hear him scream. I just really want to know if the show exists, or if it's another one I just made up in a dream, because I do that a lot lol.\n\nSorry I don't have much more info. Most of the stuff I remember about watching the show is what my house looked like at the time, and I have a feeling that won't help much.",
        "created_utc": 1678925674,
        "upvote_ratio": 1.0
    },
    {
        "title": "AMC+ AppleTV app is a total mess",
        "author": "leko",
        "url": "https://www.reddit.com/r/television/comments/11sdw4w/amc_appletv_app_is_a_total_mess/",
        "text": "My girlfriend had never seen Mad Men, and wanted to, so we went to start watching it. After a couple of episodes streaming on amazon we both were super sick of the ads (yes, irony,) so I thought I'd give in and pay for AMC+ so we could enjoy the show ad free. Well, mostly ad free, since you are forced to watch an ad for other AMC shows when you first start watching. \n\nBut after a couple of weeks of using this app, it's clear AMC really doesn't care much about giving their customers a decent experience. The app is so bugging I doubt I can even remember them all, but off the top of my head: \n\n* the ad they make you watch is absolutely horrible resolution for some reason\n* frequently when you resume playback you get a blank thumbnail box for a few seconds as if you had been trying to fast forward\n* captions just stopped working at one point for at least a week, but have since come back somehow\n* I haven't gone more than 2 episodes in a row without the video suddenly freezing (but the time index keeps ticking away). Force-killing the app is the only way to recover from this\n* The app is terrible at keeping track of your progress. I want to say it has sometimes correctly resumed where I left off, but certainly most of the time it resumes way before you actually left off. \n* When paused, after a while the playback will resume all on its own play the audio underneath the appletv screensaver\n\nThere are others, I'm sure. It's basically a constant annoyance. And this is on the latest appleTV hardware and software. I'm glad we're making quick work of this series because I'd like to not give them more than 1 month worth of subscription fees. Basically, do yourself a favor and avoid this app.",
        "created_utc": 1678924917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Now that Amazon &amp; Henry Cavill are taking on the Warhammer 40K universe, I want to (re)share the greatest piece of media to ever depict the awesome potential of that universe: Astartes Project",
        "author": "AirKicker",
        "url": "https://youtu.be/O7hgjuFfn3A",
        "text": "",
        "created_utc": 1678924860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Summary of recently cancelled shows",
        "author": "Fanfootie",
        "url": "https://www.vulture.com/article/tv-shows-canceled-ending-2023.html",
        "text": "",
        "created_utc": 1678924502,
        "upvote_ratio": 1.0
    },
    {
        "title": "eOne: Fremantle, Lionsgate &amp; Legendary In Pursuit Of Acquiring Hasbro Subsidiary",
        "author": "MoreThanAFeeling1976",
        "url": "https://deadline.com/2023/03/eone-sale-fremantle-lionsgate-legendary-acquisition-hasbro-1235299956/",
        "text": "",
        "created_utc": 1678923447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reid Scott &amp; François Arnaud Join Sarah Shahi In ABC Pilot ‘Judgement’",
        "author": "MoreThanAFeeling1976",
        "url": "https://deadline.com/2023/03/reid-scott-francois-arnaud-sarah-shahi-abc-pilot-judgement-1235300914/",
        "text": "",
        "created_utc": 1678923287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite Sam Claflin Character",
        "author": "ruth35raven",
        "url": "/r/Sam_Claflin_Fanclub/comments/11scyjw/favorite_sam_claflin_character/",
        "text": "",
        "created_utc": 1678922808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beef Trailer: Revenge is Best Served Raw in Netflix's Dark Comedy Series",
        "author": "karmagheden",
        "url": "https://www.comingsoon.net/tv/trailers/1274129-beef-trailer-netflix",
        "text": "",
        "created_utc": 1678922033,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Hour Block of ABC's One Saturday Morning (w/commercials) from 2001, for my fellow mid range to younger Millenials.",
        "author": "BinghamptonREVIVAL",
        "url": "https://youtu.be/cXku3KLXgZU",
        "text": "",
        "created_utc": 1678921018,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I missing in White Lotus? I can’t get into it.",
        "author": "Vile-X",
        "url": "https://www.reddit.com/r/television/comments/11sc2h3/what_am_i_missing_in_white_lotus_i_cant_get_into/",
        "text": "So many people are watching this show. I finished season 1 and there was no payoff or even much if a direction . I’m in season 2 and it seems like the same thing. Everyone says it gets better. When? Will this get better? What is it that everyone loves about it?",
        "created_utc": 1678920540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hanging out in front of the TV in 1998",
        "author": "meho7",
        "url": "https://www.youtube.com/watch?v=lM9MCetJ9fE",
        "text": "",
        "created_utc": 1678919607,
        "upvote_ratio": 1.0
    },
    {
        "title": "To all TV lovers",
        "author": "Key_Act_4748",
        "url": "https://www.reddit.com/r/television/comments/11sbnl6/to_all_tv_lovers/",
        "text": "[removed]",
        "created_utc": 1678919586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Green Acres TV show",
        "author": "BaltimoreBadger23",
        "url": "https://www.reddit.com/r/television/comments/11sbe60/green_acres_tv_show/",
        "text": "Based on a friendly discussion on a totally different sub, without looking it up, would you be able to tell me who any of the following are: One lead actor in Green Acres, one character name, or the basic overall plot.  Please don't put the answers in your response, just yes or no, and include your age and general location (country).\n\nThank you",
        "created_utc": 1678918990,
        "upvote_ratio": 1.0
    },
    {
        "title": "CBS Changes Name Of Justin Hartley Drama To ‘Tracker’; Will Begin Promoting Show This Week During March Madness",
        "author": "im_a_dick_head",
        "url": "https://deadline.com/2023/03/cbs-justin-hartley-drama-new-name-tracker-promos-this-week-march-madness-1235299566/",
        "text": "",
        "created_utc": 1678918880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gattaca Reboot in the Works at Showtime From Homeland Bosses",
        "author": "boumtjeboo",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/gattaca-reboot-homeland-duo-in-the-works-showtime-1235353770/",
        "text": "",
        "created_utc": 1678918599,
        "upvote_ratio": 0.5
    },
    {
        "title": "‘Gattaca’ TV Series Based On Movie In Works At Showtime From Howard Gordon &amp; Alex Gansa",
        "author": "MarvelsGrantMan136",
        "url": "https://deadline.com/2023/03/gattaca-tv-series-showtime-howard-gordon-alex-gansa-1235300890/",
        "text": "",
        "created_utc": 1678918582,
        "upvote_ratio": 1.0
    },
    {
        "title": "1973 Old Times Sake Award for Best Series",
        "author": "Formal_Fall7391",
        "url": "https://www.reddit.com/r/television/comments/11sb5hd/1973_old_times_sake_award_for_best_series/",
        "text": "The 1973 Old Times Sake Award for Best Series poll results are in!\n\n&amp;#x200B;\n\nSeason 2 of M\\*A\\*S\\*H has won the poll with 36 votes.\n\nSeason 4 of The Mary Tyler Moore Show is the runner up with 13 votes.\n\nSeason 4 of All in the Family received 12 votes.\n\nSeason 2 of The Bob Newhart Show received 8 votes.\n\nSeason 4 of Neil Simon's The Odd Couple received 1 vote.\n\nSeason 3 of Soul Train received 1 vote.\n\nSeason 7 of The Carol Burnett Show received 1 vote.\n\nSeason 2 of The Midnight Special received 1 vote.\n\n&amp;#x200B;\n\nA Posthumous Old Times Sake Award goes to Larry Gelbart!",
        "created_utc": 1678918466,
        "upvote_ratio": 0.99
    },
    {
        "title": "'Class of '09' FX Series by Tom Rob Smith premieres May 10 on Hulu",
        "author": "inkista",
        "url": "https://www.reddit.com/r/television/comments/11sb26z/class_of_09_fx_series_by_tom_rob_smith_premieres/",
        "text": "Full press release:\n\n[http://www.thefutoncritic.com/news/2023/03/15/fxs-class-of-09-premieres-wednesday-may-10-exclusively-on-hulu-33114/20230315fx01/](http://www.thefutoncritic.com/news/2023/03/15/fxs-class-of-09-premieres-wednesday-may-10-exclusively-on-hulu-33114/20230315fx01/)\n\nFirst two paragraphs:\n\n&gt;LOS ANGELES, March 15, 2023 - FX's Class of '09, the limited series thriller starring Brian Tyree and Kate Mara from Tom Rob Smith, will premiere Wednesday, May 10 exclusively on Hulu. The premiere will include the first two episodes of the eight-episode series, with a new episode each following week. Class of '09 will be available on Star+ in Latin America and Disney+ under the Star banner in all other territories.  \n&gt;  \n&gt;Class of '09 is a suspense thriller limited series that follows a class of FBI agents set in three distinct points in time who grapple with immense changes as the U.S. criminal justice system is altered by artificial intelligence. Spanning multiple decades and told across interweaving timelines, the series examines the nature of justice, humanity and the choices we make that ultimately define our lives and legacy.\n\nI wanted to mention this one because Tom Rob Smith is the guy who wrote [*MotherFatherSon*](https://www.youtube.com/watch?v=fn87RhvtG5Y)*,* [*London Spy*](https://www.youtube.com/watch?v=O1PEQkpKTLI)*,* and [*ACS: The Assassination of Gianni Versace*](https://www.youtube.com/watch?v=xL_qpDkF5A8)*.*  His style is a little surreal, often louche and unsettling, and he writes very taut thrillers.",
        "created_utc": 1678918260,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you describe as your Sleeper shows?",
        "author": "unitedfan6191",
        "url": "https://www.reddit.com/r/television/comments/11sb057/what_would_you_describe_as_your_sleeper_shows/",
        "text": "Hi.\n\nHope everyone’s doing well.\n\nThere’s only so many hours in a day and so many shows and movies that we all have popular or critically acclaimed shows that we have either never seen or perhaps have years after they’ve gone off the air.\n\nFor me, I just recently started watching Boston Legal for the first time and so far it’s a very well written show with good character development, funny and poignant moments, a nice examination of morality with some nice subtext and also very relatable in many ways. Great acting as well.\n\nWhat well-known shows were you late to the party with?",
        "created_utc": 1678918142,
        "upvote_ratio": 1.0
    },
    {
        "title": "snow on the tv problem",
        "author": "DIEGHOST_8",
        "url": "https://www.reddit.com/r/television/comments/11sa8ke/snow_on_the_tv_problem/",
        "text": "Hi. I have an Hitachi tv (used as a monitor) and it has a snowy effect only on darker areas. With HDR on the effect is even worse. Any help?",
        "created_utc": 1678916467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't miss tonight's episode of #TheMaskedSinger featuring special guest Damar Hamlin from the Buffalo Bills! Tune in at 8/7c on FOX",
        "author": "The_West_Poll",
        "url": "https://www.reddit.com/r/television/comments/11sa8e1/dont_miss_tonights_episode_of_themaskedsinger/",
        "text": "[removed]",
        "created_utc": 1678916456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't miss tonight's episode of #TheMaskedSinger featuring special guest Damar Hamlin from the Buffalo Bills! Tune in at 8/7c on FOX",
        "author": "The_West_Poll",
        "url": "https://www.reddit.com/r/television/comments/11sa7nn/dont_miss_tonights_episode_of_themaskedsinger/",
        "text": "[removed]",
        "created_utc": 1678916415,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Monk’ Returns As Peacock Orders Follow-up Movie Starring Tony Shalhoub &amp; Original Series Cast - 'Mr. Monk’s Last Case: A Monk Movie'",
        "author": "MarvelsGrantMan136",
        "url": "https://deadline.com/2023/03/peacock-orders-monk-movie-tony-shalhoub-original-series-cast-1235300773/",
        "text": "",
        "created_utc": 1678916041,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Drop-Off’: Michaela Conlin Joins ABC Pilot Based On ‘Motherland’",
        "author": "klutzysunshine",
        "url": "https://deadline.com/2023/03/drop-off-michaela-conlin-abc-comedy-pilot-british-series-motherland-1235300664/",
        "text": "",
        "created_utc": 1678916036,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Name of Short-lived TV Comedy",
        "author": "tps5352",
        "url": "https://www.reddit.com/r/television/comments/11sa0ls/looking_for_name_of_shortlived_tv_comedy/",
        "text": "* Maybe about 10 years ago?\n\n* Half-hour comedy.\n\n* Not sure it was on regular network (NBC, ABC, PBS, CBS, FOX, CW) TV?\n\n* Centered on young (20-something) adults. Apartment dwellers, I think.\n\n* May have been set in Chicago?\n\n* Lead male character was **highly** neurotic; like a young Woody Allen.\n\n* Young lead male actor (professional comedian background?) may have also been the originator of and/or contributing writer to the show.\n\n* I don't think it made it past--or even to--one season. Possibly only a handful of episodes?\n\n* From what I remember, focus was on (no surprise) relationships with opposite sex and parents--standard stuff.\n\nSorry, I can't remember the names of any actors or staff.",
        "created_utc": 1678915980,
        "upvote_ratio": 1.0
    },
    {
        "title": "James Gunn to Direct “Superman: Legacy” for DC Studios!",
        "author": "Palfanakar",
        "url": "https://streamingsight.com/news/james-gunn-to-direct-superman-legacy/",
        "text": "",
        "created_utc": 1678915273,
        "upvote_ratio": 1.0
    },
    {
        "title": "the dropout spin off",
        "author": "ohboyidkman",
        "url": "https://www.reddit.com/r/television/comments/11s9cs2/the_dropout_spin_off/",
        "text": "this is the best idea i’ve ever had. \n\nthere should be a spin off about linda tanner, the legal counsel for theranos. obviously with michaela watkins.\n\nthe way she called elizabeth out in the last episode is the kind of behavior i could watch an entire series of. especially if she surrounds herself with an eclectic group of patagonia wearing californians with similar characteristics.",
        "created_utc": 1678914544,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last Of Us Finale Gets IMDB’s Lowest Ratings of the Season",
        "author": "LarryPeru",
        "url": "https://twitter.com/domthebombyt/status/1636066342716440577?s=46&amp;t=3E6ZZm9TEJ86uliqnu99pw",
        "text": "",
        "created_utc": 1678914145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Circle Responds to Banking Problem by Offering 10% Rebate to Users",
        "author": "LogicalStructure9242",
        "url": "https://www.reddit.com/r/television/comments/11s82iu/circle_responds_to_banking_problem_by_offering_10/",
        "text": "[removed]",
        "created_utc": 1678911733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monk Reunion Movie In the Works at Peacock, According to Tony Shalhoub",
        "author": "AlexanderJJJ",
        "url": "https://tvline.com/2023/03/15/monk-reunion-movie-peacock-cast-returning-tony-shalhoub/",
        "text": "",
        "created_utc": 1678910949,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Monk' Reunion Movie In the Works at Peacock, According to Tony Shalhoub",
        "author": "SanderSo47",
        "url": "https://tvline.com/2023/03/15/monk-reunion-movie-peacock-cast-returning-tony-shalhoub/",
        "text": "",
        "created_utc": 1678908884,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breaking Bad: The King of Modern Tragedies - No Spoiler Retrospective Review",
        "author": "Wingi-eu",
        "url": "https://www.wingi.eu/articles/article.php?ID=353",
        "text": "",
        "created_utc": 1678908469,
        "upvote_ratio": 1.0
    },
    {
        "title": "With Tye Mandalorian apparently getting lower ratings than Seasons 1 and 2 isn’t this trouble for the future of Disney Plus?",
        "author": "JannTosh17",
        "url": "https://www.reddit.com/r/television/comments/11s6a7m/with_tye_mandalorian_apparently_getting_lower/",
        "text": "This is their flagship show. If this fading how can how is this Disney Plus infinitely sustainable? Just curious",
        "created_utc": 1678907925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tere Bin Episode 23",
        "author": "Watch-Online-drama",
        "url": "https://www.onlinepakistanidrama.com/2023/03/tere-bin-episode-23.html",
        "text": "",
        "created_utc": 1678906666,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Last of US (show) is mediocre",
        "author": "Creepy_Path_1618",
        "url": "https://www.reddit.com/r/television/comments/11s5e0f/the_last_of_us_show_is_mediocre/",
        "text": "I think that many people have become lost in the sauce with this show. I personally did not like it and I will admit it is not terrible. It is well produced and well acted, a bunch of talent and hard work has gone into the making of this series and I think that it shows in many aspects. There are a handful of powerful moments that I liked quite a lot, episode 3 was like a fantastic fresh breath of a spring afternoon. I feel that the show fails to build on these high moments and even though they exist it should not justify the rest of this exceptionally average adaptation of one of the greatest video game series I have ever played. The main reasons I believe the show is average is because of poor writing, the actors are not allowed enough space to really inhabit their characters, there is too much money put in the show, and the show runners are too obsessed with checking all the right boxes. \n\nThe issue I find most prescient is the writing. First, I don't like most of the dialogue, Ellie and Joel's exchanges feel rushed and rehearsed and any of their heart to hearts fall flat for me. Other characters either take their time to be exposition heavy or their words only serve the purpose of plot advancement. Audiences are more intelligent than having to be spoon fed information about the world they are watching, the writers could have taken time to either be more clever about delivering this information or focused more on Joel and Ellie. The plots established from episode to episode are full of popular troupes that at this point become derivative. I'll give one example. Episode four contains Kathleen, the de facto leader of Kansas City after their revolt against FEDRA. That group's entire arc I could do without. She and her gang are only created to produce more conflict for Henry and Sam and Joel and Ellie. I can't understand why this was done because the space Kathleen and her gang fill you could have explored the world with the four people we want to see most. Instead we juxtapose between what feels like short and insincere scenes between the four of them and Kathleen I don't care  who she is please take me back to Joel and Ellie. You don't need this added conflict, you didn't in the game. I felt much closer to Sam and Henry in the game, and I liked them in the show but I didn't feel that we spend enough time with them. All of this I think could have been remedied if you cut out Kathleen entirely since you have already established the threat all the characters face in the beginning of the episode. I will also mention, without specifics, the end of the Kansas City arc. There is a moment where the characters get backed into a corner and are miraculously saved by a deadly and intense event. Icing on the cake, its a troupe used throughout all of TV and it disappointed me to see. I cannot figure out who is to blame for all this, Neil Druckmann or Craig Mazin. All I know is the writing that we have got in TLOU show is beneath both of these men and their skills. \n\nThis leads me into the acting. I think Pedro Pascal and Bella Ramsey were rightly cast in their roles and both display great prowess in their abilities. I feel that the two of them are doing the best they can with the cards they were dealt. I do not believe that either of them were ever truly allowed to breath in their roles, aside from a few moments. This becomes ever more apparent when they attempt to reenact moments from the game, ie Sarah's death, the fight they have at Tommy's, the moment with the cannibals, etc. These moments fall flat for me, emotionally and physically. I think this is because of the in between interactions of Joel and Ellie, they are much too short and many of their lines feel rehearsed and clearly paced. Ellie often answers Joel too quickly or vice versa. Much of their built up relationship feels topical, only there to serve the purpose of furthering the plot rather than to establish a true connection between them and the audience. I blame the writers, producers and directors for this, not the actors. I feel that the show actively undermines the relationship of these two in favor of building the world up and focusing on a dearth of diverse enemy's, allies, exposition and side plots and they neglect the heart of the entire show, which is Joel and Ellie. I could have used more of Joel and Ellie meandering around talking about whatever fell into their minds.  I wanted longer takes where the actors get to flex a little and even get to adlib as much as they can, this is a shame since the cinematography was so apt for fostering this kind of directing. I wanted to see them pal around more, get into puzzling situations and work together to out of them, and develop that father daughter relationship over time. \n\nThe show obviously has a high budget and that money is put to use in the excellent fashion with great effects, set design, makeup, costumes, cinematography, editing, and sound design. I do believe that the show could have benefitted from a smaller budget. A smaller budget often allows creative minds to flex their problem solving skills. People have to find interesting solutions to technical, narrative, and artistic conundrums that arise during filming through collaboration, sudden inspiration and intuition. I do not see this being done throughout TLOU. To my eyes I find money being thrown around everywhere that it can be. In many ways it has paid off but where it wounds us the most is with the writing, the most important aspect of any tv show, and we lose a good amount of what made us love and care for Joel and Ellie. \n\nIn the end all that I have discussed thus far is a microcosm of my final issue with the show. I will call this \"checking boxes\". It seems to me that when a popular tv show is created a certain set of rules are followed, basic guidelines to insure the show's success and popularity. This is only natural because the producers pouring hundreds of millions of dollars on this product want to guarantee a return on their investment. And In the end it is the people who control the money who have final say. So, hence the \"box checking method\". What kind of boxes did TLOU check off? Big budget effects: check. Modern Sensibilities: check. Expository story telling: check. Commercial trends: check.  Representative casting: check. High paced editing: check. These are just a few off the top of my head and there are many more that I am neglecting here. All of the problems as I see them have stemmed from this. Now, TLOU accordingly is the HBO's most watched show of all time, in Europe and Latin America especially, so I imagine the formula will remain. It is a shame, I feel that creatively and artistically this approach boxes in talented people with them even realizing it. One of the things that made TLOU 2 so powerful was it's radical departure from the first game. The choices made with the story upset a lot people because the writers were willing to explore new territory that in my view only enhanced the experience of that game. I doubt after seeing all of the show that we will experience a similar kind of thing in the show's future, apart from an episode or passing moment here and there. I hope that I am wrong about this. \n\nI would like to reiterate that I do not think that this show is terrible, I think that it is mediocre. I believe that people today tend to inflate entertainment that they like as masterpieces or artistic highs of culture. TLOU appears from all directions to be a grand slam, an A plus by appearance. But if we peer behind the veil or look between the lines I think we can all see some glaring blemishes behind the foundation. In my view the show is a C plus disguised by the producers and built up by critics and audience to be an A plus. It certainly seems this way to me at the very least.",
        "created_utc": 1678906067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Judge: Netflix's 'Making a Murderer' didn't defame detective",
        "author": "HGpennypacker",
        "url": "https://www.channel3000.com/news/crime/judge-netflixs-making-a-murderer-didnt-defame-detective/article_f74c2617-f786-5488-af19-eddaf6c0cf20.html",
        "text": "",
        "created_utc": 1678906012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ted Lasso's Season 3 Premiere Has What Season 2's Premiere Lacked: A Sense Of Direction",
        "author": "bluerose297",
        "url": "https://www.slashfilm.com/1228890/ted-lasso-season-3-has-one-big-thing-season-2-lacked/",
        "text": "",
        "created_utc": 1678905369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worst example of a “previously on” recap spoiling the episode?",
        "author": "WannabeWonk",
        "url": "https://www.reddit.com/r/television/comments/11s4x5e/worst_example_of_a_previously_on_recap_spoiling/",
        "text": "I’m rewatching LOST and there’s a few times when the “previously on” recap shows a character they hasn’t been highlighted in a while only for them to play an important role in the episode. Really bugs me if I forget it skip for whatever reason.",
        "created_utc": 1678905087,
        "upvote_ratio": 1.0
    },
    {
        "title": "My review of the first episode of the 3rd season of Ted Lasso",
        "author": "jonsnowasoiaf",
        "url": "https://youtu.be/Wa5ThiaPgc8",
        "text": "",
        "created_utc": 1678905081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fox Developing ‘No. 1 Supreme Citizen Of America’ From Comedian Peter S. Kim",
        "author": "galaxystars1",
        "url": "https://deadline.com/2023/03/fox-developing-no-1-supreme-citizen-of-america-comedian-peter-kim-1235299559/",
        "text": "",
        "created_utc": 1678903775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fox Developing ‘No. 1 Supreme Citizen Of America’ From Comedian Peter S. Kim",
        "author": "galaxystars1",
        "url": "https://deadline.com/2023/03/fox-developing-no-1-supreme-citizen-of-america-comedian-peter-kim-1235299559/#utm_medium=social&amp;utm_source=email&amp;utm_campaign=social_bar&amp;utm_content=top_amp&amp;utm_id=1235299559",
        "text": "",
        "created_utc": 1678903722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fox Developing ‘No. 1 Supreme Citizen Of America’ From Comedian Peter S. Kim",
        "author": "galaxystars1",
        "url": "https://deadline.com/2023/03/fox-developing-no-1-supreme-citizen-of-america-comedian-peter-kim-1235299559/amp/",
        "text": "",
        "created_utc": 1678903640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Days of Our Lives Renewed Through Season 60 at Peacock",
        "author": "DemiFiendRSA",
        "url": "https://tvline.com/2023/03/15/days-of-our-lives-renewed-season-60-peacock/",
        "text": "",
        "created_utc": 1678903277,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Swarm’ Review: Dominique Fishback Is Superb in Amazon’s Horror-Comedy",
        "author": "fdjadjgowjoejow",
        "url": "https://www.hollywoodreporter.com/tv/tv-reviews/swarm-review-dominique-fishback-1235348155",
        "text": "",
        "created_utc": 1678901869,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Willow’ Canceled After One Season On Disney+",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1678901221,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Willow’ Canceled After One Season At Disney+",
        "author": "DemiFiendRSA",
        "url": "https://deadline.com/2023/03/willow-canceled-disney-disney-plus-no-season-2-1235300401/",
        "text": "",
        "created_utc": 1678901202,
        "upvote_ratio": 1.0
    },
    {
        "title": "So, according to the academy, Everything Everywhere All at Once is better than Peter Jackson's Lord of the Rings?",
        "author": "Aetius_Flavius",
        "url": "https://www.reddit.com/r/television/comments/11s2cxb/so_according_to_the_academy_everything_everywhere/",
        "text": "It has already long been clear that Oscar is dead and has lost all value, but this was the final nail in its coffin.",
        "created_utc": 1678899695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Swarm - Season 1 Review (Donald Glover)",
        "author": "WillScarbrough101",
        "url": "https://www.screenedcinema.com/post/review-swarm-season-1",
        "text": "",
        "created_utc": 1678897974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jenna Ortega Rejected ‘Wednesday’ Offers Because She ‘Wanted to Do Film,’ Says It’d Be Preferable if the Show Wasn’t a Massive Hit",
        "author": "Magister_Xehanort",
        "url": "https://variety.com/2023/tv/news/jenna-ortega-rejected-wednesday-offers-film-star-1235554072/",
        "text": "",
        "created_utc": 1678897799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Uuiii8",
        "author": "QuickLog4418",
        "url": "https://www.reddit.com/r/television/comments/11s136a/uuiii8/",
        "text": "[removed]",
        "created_utc": 1678896965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Crunchyroll the Right Specialty Streamer for the Moment?",
        "author": "Magister_Xehanort",
        "url": "https://www.hollywoodreporter.com/business/digital/sony-crunchyroll-specialty-streamer-asian-content-1235352518/",
        "text": "",
        "created_utc": 1678896701,
        "upvote_ratio": 1.0
    },
    {
        "title": "BEEF | Official Trailer | Netflix",
        "author": "indig0sixalpha",
        "url": "https://www.youtube.com/watch?v=AFPIMHBzGDs",
        "text": "",
        "created_utc": 1678896031,
        "upvote_ratio": 1.0
    },
    {
        "title": "BEEF | Official Trailer | Netflix",
        "author": "impeccabletim",
        "url": "https://youtu.be/AFPIMHBzGDs",
        "text": "",
        "created_utc": 1678896021,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Create a Calculator App with HTML, CSS, and JavaScript with chatgpt",
        "author": "ewaipc",
        "url": "https://www.youtube.com/watch?v=vWKpYv9RjTw",
        "text": "",
        "created_utc": 1678895606,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Beavis and Butt-Head' Season 2 coming to Paramount+ on 4/20",
        "author": "MyFatherKilledMe",
        "url": "https://variety.com/2023/tv/news/beavis-and-butt-head-paramount-plus-announce-season-two-premiere-1235547073/",
        "text": "",
        "created_utc": 1678894724,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Witcher Showrunner Lauren Hissrich Found Henry Cavill “Really Annoying” Due to His Over-Enthusiasm to Play Geralt",
        "author": "Eymm",
        "url": "https://www.vulture.com/2019/07/henry-cavill-in-the-witcher-the-story-behind-the-casting.html",
        "text": "",
        "created_utc": 1678893706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online Money Making Sites || Online Earning Website Without Investment || Simple Websites That Make Money",
        "author": "sini-1520",
        "url": "https://only4deta.blogspot.com/2023/03/Online-Money-Making-Sites%20.html",
        "text": "",
        "created_utc": 1678893685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amazon’s A League of Their Own Ending With Shortened Season 2",
        "author": "singleguy79",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/amazon-a-league-of-their-own-end-shortened-second-season-1235342070/",
        "text": "",
        "created_utc": 1678892682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Succession’s Alan Ruck On The Show Ending With Season 4: ‘It’s The Right Time – A Fifth Season Would Have Been Drawn Out’",
        "author": "MarvelsGrantMan136",
        "url": "https://www.empireonline.com/tv/news/succession-season-4-alan-ruck-exclusive/",
        "text": "",
        "created_utc": 1678892633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Succession’s Alan Ruck On The Show Ending With Season 4: ‘It’s The Right Time – A Fifth Season Would Have Been Drawn Out’",
        "author": "MarvelsGrantMan136",
        "url": "https://www.empireonline.com/tv/news/succession-season-4-alan-ruck-exclusive/",
        "text": "",
        "created_utc": 1678892502,
        "upvote_ratio": 1.0
    },
    {
        "title": "was the last of us good ? this is my review",
        "author": "__Skeleton__",
        "url": "https://www.reddit.com/r/television/comments/11ryy0o/was_the_last_of_us_good_this_is_my_review/",
        "text": "[removed]",
        "created_utc": 1678892436,
        "upvote_ratio": 1.0
    },
    {
        "title": "djdankmemes",
        "author": "djdankmemes1",
        "url": "https://youtube.com/@djdankmemes",
        "text": "",
        "created_utc": 1678891058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Channel 4 Expands ‘Taskmaster’ Universe With Six-Season Renewal &amp; Junior Version",
        "author": "MoreThanAFeeling1976",
        "url": "https://deadline.com/2023/03/channel-4-taskmaster-junior-version-six-season-renewal-avalon-1235297833/",
        "text": "",
        "created_utc": 1678890996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reshet 13 Boards Psychological Thriller 'Dust and Coal'",
        "author": "MoreThanAFeeling1976",
        "url": "https://variety.com/2023/tv/global/reshet-13-ronen-ben-tal-ron-ninio-1235555054/",
        "text": "",
        "created_utc": 1678890941,
        "upvote_ratio": 1.0
    },
    {
        "title": "John Mulaney’s New Standup Special ‘Baby J’ to Debut April 25 on Netflix",
        "author": "MarvelsGrantMan136",
        "url": "https://variety.com/2023/film/news/john-mulaney-standup-special-netflix-baby-j-1235554901/",
        "text": "",
        "created_utc": 1678890692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sovely (쏘블리ღ) This Korean model is as hot as a mermaid.",
        "author": "Strong-Community-587",
        "url": "https://www.instahottv.uk/2023/03/blog-post_14.html",
        "text": "",
        "created_utc": 1678889448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Netflix Beats Defamation Suit Over ‘Making a Murderer’ Docuseries",
        "author": "Cool--Pineapple",
        "url": "https://variety.com/2023/tv/news/making-a-murderer-netflix-defamation-lawsuit-thrown-out-1235554622/",
        "text": "",
        "created_utc": 1678888890,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Shotgun Wedding\" is Everything That's Wrong with Jennifer Lopez's Movie Career",
        "author": "BackSpinHipHop",
        "url": "https://www.reddit.com/r/television/comments/11rx7xn/shotgun_wedding_is_everything_thats_wrong_with/",
        "text": "[removed]",
        "created_utc": 1678888727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommend a series to watch",
        "author": "Fine_Pineapple_3893",
        "url": "https://www.reddit.com/r/television/comments/11rx6hz/recommend_a_series_to_watch/",
        "text": "I am currently searching for the next series to watch. I like action drama, enjoy the  post-apocalyptic setting, but it is not necessary. My favorite series is The Walking Dead. Have also watched Breaking Bad and Arcane. I am trying to find a new series to watch, but nothing I find hits the spot. Also, I know about The Last of Us, but first want to play the game on PC. Can you recommend a series to watch based on that information",
        "created_utc": 1678888630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has the anti-hero theme gone too far? Or, what caused me to quit some watching highly rated shows.",
        "author": "nosecohn",
        "url": "https://www.reddit.com/r/television/comments/11rx5qy/has_the_antihero_theme_gone_too_far_or_what/",
        "text": "**SPOILER ALERT:** This post contains spoilers about episodes of *Breaking Bad* and *Barry* that aired years ago.\n\n-----\n\nOver the last few decades of film and television, I have welcomed the shift from stories about unambiguous heroes (i.e., Superman, Luke Skywalker) to anti-heroes (i.e., Batman, Don Draper, Dexter). This shift has given characters more dimension and, in some ways, made them more relatable. \n\nBut at the same time, I wonder if the trend has been stretched so far as to test audiences' tolerance. I've had to stop watching a few highly rated shows because there were no longer any characters I could root for, including the protagonists.\n\nFor example, Breaking Bad was really well done and I enjoyed it for a while, but at the end of Season 3 when Walter and Jesse conspire to kill Gale, the likable chemist who assists Walter in the lab, I was done. I could forgive all the misdeeds prior to that, because they supported the anti-hero characters' development, plus all their victims were also, to some degree, bad people. But Gale was largely innocent and didn't deserve that, so I stopped watching.\n\nSimilarly, the writers of Barry set about to convince the audience that Detective Janice Moss was not only a good person, but the love of Gene's life. When Barry kills her in the Season 1 finale, the show lost me. I could no longer look at the protagonist as a character whose fate I was invested in. I tried to continue, but got frustrated that he kept evading capture and punishment.\n\nSo, I'm wondering if anyone else has had similar experiences with shows like this, where they know at the start that the main character is not an admirable person, but the writing pushes those negative qualities so far that you no longer enjoy watching. The popularity of these shows and others with similar themes tells me I'm in the minority, but I do wonder if it's a tiny minority or a significant one. What are some shows you've dropped because you could no longer support the main character's actions? As a corollary, who are some anti-hero characters who stayed within the bounds of supportable conduct?",
        "created_utc": 1678888582,
        "upvote_ratio": 1.0
    },
    {
        "title": "What TV shows do the worst needle drops?",
        "author": "ScarletSpiderForever",
        "url": "https://www.reddit.com/r/television/comments/11rwns1/what_tv_shows_do_the_worst_needle_drops/",
        "text": "I was debating this with a friend. I love great songs are inserted seamlessly into great TV shows, but it's really distracting when TV shows get it wrong or the song doesn't properly line up with the plot of the scene.\n\nWhat are some shows that you guys think get these music drops all wrong?",
        "created_utc": 1678887468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fast &amp; Furious 10: Release date, cast, plot and latest news on Fast X.",
        "author": "holisticgallantry67",
        "url": "https://www.radiotimes.com/movies/fast-and-furious-10-release-date/",
        "text": "",
        "created_utc": 1678886974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drew Barrymore To Host 2023 MTV Movie &amp; TV Awards",
        "author": "MoreThanAFeeling1976",
        "url": "https://deadline.com/2023/03/drew-barrymore-host-2023-mtv-movie-tv-awards-1235299664/",
        "text": "",
        "created_utc": 1678886919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Special prosecutor steps down in case against Alec Baldwin",
        "author": "blood_bag",
        "url": "https://apnews.com/article/alec-baldwin-politics-new-mexico-state-government-clovis-prop-gun-shooting-4318dd3bce9974099a8cdb599264f876",
        "text": "",
        "created_utc": 1678886285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gotham Knights",
        "author": "singleguy79",
        "url": "https://www.reddit.com/r/television/comments/11rw0fm/gotham_knights/",
        "text": "[removed]",
        "created_utc": 1678886066,
        "upvote_ratio": 1.0
    },
    {
        "title": "ABC Announces Next ‘Bachelorette’ Lead During ‘Women Tell All’ Special",
        "author": "Angel--Wonderland",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/the-bachelorette-charity-lawson-next-lead-zach-shallcross-abc-1235352834/",
        "text": "",
        "created_utc": 1678884701,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dave and Stacie look at Quantum Leap \"Ben Song For The Defense\"",
        "author": "KormanProductions",
        "url": "https://youtu.be/1uUnY7vI8yk",
        "text": "",
        "created_utc": 1678884482,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Voice of Holland’ Ex-Stars Charged With Sexual Offenses",
        "author": "Cool--Pineapple",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/the-voice-holland-metoo-sexual-assault-charges-1235352996/",
        "text": "",
        "created_utc": 1678884459,
        "upvote_ratio": 1.0
    },
    {
        "title": "BBC apologizes for shows falling off air as 1,000 staff stage biggest strike in 13 years",
        "author": "HRJafael",
        "url": "https://deadline.com/2023/03/bbc-strike-staff-walkout-content-cuts-1235299970/",
        "text": "",
        "created_utc": 1678882425,
        "upvote_ratio": 1.0
    },
    {
        "title": "German website - Watchbox",
        "author": "Movi3Eagle",
        "url": "https://www.reddit.com/r/television/comments/11rttu0/german_website_watchbox/",
        "text": "[removed]",
        "created_utc": 1678880339,
        "upvote_ratio": 1.0
    }
]