[
    {
        "title": "Upvote bots and their effect on subs",
        "author": "cmdrrockawesome",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7oefb0/upvote_bots_and_their_effect_on_subs/",
        "text": "I'm wondering how prominent upvote bots are on various subs. I've always suspected they're being used on /r/standupshots because of the ridiculous comment to upvote ratios a lot of the posts get. Case in point, a recent post with an objectively terrible joke garnered nearly 1,400 upvotes before the OP deleted it. Of all the comments in the thread, I'd say a good 95% of them were critical of the joke/post and a lot of them were wondering about the high upvote tally for the post since it was clear basically no one liked it.\n\nI didn't actually even believe upvotes bots were a thing, but having done a little research I've found that they're real and people are making actual money off of them. Are there other subs where their presence is really obvious? It really taints the whole browsing experience knowing certain posts are being artificially promoted. ",
        "created_utc": 1515187347,
        "upvote_ratio": ""
    },
    {
        "title": "We tested the effects of hiding downvotes in r/politics. Here's what we learned | crosspost from r/politics",
        "author": "likeafox",
        "url": "https://www.reddit.com/r/politics/comments/7odapz/we_tested_the_effects_of_hiding_downvotes_in/",
        "text": "",
        "created_utc": 1515178357,
        "upvote_ratio": ""
    },
    {
        "title": "By allowing THE_DONALD to exist and operate the way they do, the admins have caused the culture of Reddit to slide from one of openness to one of hair trigger banning and authoritarianism.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7oc2k6/by_allowing_the_donald_to_exist_and_operate_the/",
        "text": "[removed]",
        "created_utc": 1515167817,
        "upvote_ratio": ""
    },
    {
        "title": "By allowing THE_DONALD to exist and operate the way they do, the admins have caused the culture of Reddit to slide from one of openness to one of hair trigger banning and authoritarianism.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7obviw/by_allowing_the_donald_to_exist_and_operate_the/",
        "text": "[removed]",
        "created_utc": 1515166096,
        "upvote_ratio": ""
    },
    {
        "title": "Does being shadowbanned black-hole your upvotes?",
        "author": "zqzqz",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ob4s0/does_being_shadowbanned_blackhole_your_upvotes/",
        "text": "I'm curious how Reddit deals with upvote spammers. I know that being shadowbanned makes your 'content' (comments/posts?) visible only to yourself and mods / admins (https://www.reddit.com/r/self/comments/3ey0fv/on_shadowbans/) but I'm unsure whether it also affects upvotes provided by the shadowbanned user. It would make sense that it occurs, especially since 'vote fuzzing' is a thing, but I think that was to specifically counter downvote brigades, rather than upvotes.\n\nDoes anyone know? Is their a mod / admin statement somewhere that provides more details on what happens?",
        "created_utc": 1515158115,
        "upvote_ratio": ""
    },
    {
        "title": "How did reddit program me to be scared of nuclear weapons?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7nysu9/how_did_reddit_program_me_to_be_scared_of_nuclear/",
        "text": "[deleted]",
        "created_utc": 1515022975,
        "upvote_ratio": ""
    },
    {
        "title": "Weighted Subreddits",
        "author": "shortwave_cranium",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7nvd02/weighted_subreddits/",
        "text": "I often subscribe to niche subreddits on a whim that later end up dominating my front page. This cheapens the experience for me as I would typically like to see more of my hobby subreddits evenly dispersed with a few entertaining bits sprinkled in.\n\nWould it be beneficial to the user if Reddit allowed them to assign a weight (of importance) to a subreddit when subscribing? ",
        "created_utc": 1514993624,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone been browsing Other locales? It’s interesting to see what English posts make it through.",
        "author": "Consumer451",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7nutmf/has_anyone_been_browsing_other_locales_its/",
        "text": "Since reddit introduced localized reddit, I have been checking out other locales. Other English speaking countries are great if I get bored of my US feed.\n\nBut what’s more interesting is to see what English posts are high up in non-English locales.\n\nMaking light of Trump seems to be somewhat universal. Anyone find any other interesting patterns in what English posts make it into non-English locales?\n\nEdit: another question, anyone have any favorite other locales for unique POV? I seem to enjoy Ireland, Aus for English, and Japan is pretty great for non-English.",
        "created_utc": 1514988240,
        "upvote_ratio": ""
    },
    {
        "title": "When did /r/worldnews become a dooms day cult?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7nq254/when_did_rworldnews_become_a_dooms_day_cult/",
        "text": "[deleted]",
        "created_utc": 1514932792,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes, a user posts a comment making point A and it gets upvoted. Another user makes point B, and it's upvoted, but not as much. OP further argues point A in a third reply, but it's massively downvoted. Why?",
        "author": "reedemerofsouls",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7npsrw/sometimes_a_user_posts_a_comment_making_point_a/",
        "text": "I've noticed this happening to me and other users. It tends to happen in places with a lot of comments. It just happened to me and I'm curious why, I am not linking it though unless requested. I don't want people to think I'm whining or whatever.\n\nIt goes like this:\n\n1. I make a controversial point. +50\n\n2. Someone tries to refute it +25\n\n3. I try to explain / answer refutations -50\n\nFurther explanations on my end are downvoted, even if they are much milder.\n\nHow does that happen? It could be a brigade, but it seems unusual that someone would brigade that point (as it is not a super important topic.)\n\nIs it that only people who disagree with post 1 stick around for more replies? Why would that be?\n\nHow does that affect conversations on reddit?",
        "created_utc": 1514930536,
        "upvote_ratio": ""
    },
    {
        "title": "Is reddit's right wing bias due to it being filled with white American males, or is the reverse true, that white American males are attracted to reddit because of reddit's right wing lean?",
        "author": "prachandapath18",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7no2l2/is_reddits_right_wing_bias_due_to_it_being_filled/",
        "text": "[removed]",
        "created_utc": 1514916025,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit is a site run by mass hysteria all you have to see is my post history for proof.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7nja2h/reddit_is_a_site_run_by_mass_hysteria_all_you/",
        "text": "[deleted]",
        "created_utc": 1514857727,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit needs to fix the mobile app. Its like it took cues from YouTube.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7nibc4/reddit_needs_to_fix_the_mobile_app_its_like_it/",
        "text": "[removed]",
        "created_utc": 1514847777,
        "upvote_ratio": ""
    },
    {
        "title": "Any ideas why the Iran protests are barely being covered on reddit?",
        "author": "Agent_Windex",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ncfxh/any_ideas_why_the_iran_protests_are_barely_being/",
        "text": "The Iran protests is one of the biggest international stories of the year, yet there seems to be little discussion about the protests in reddit. There are lots of videos on twitter of protestors burning down government offices and the offices of various religious officials, as well as other videos of large-scale demonstrations, yet none of these videos have reached the front page. There also doesn't seem to be a central place of discussion regarding the protests, instead there are a few megathreads in general discussion subreddits such r/drama. The only subreddit that is consistently covering the protests seems to be r/the_Donald, which makes me wonder if there are politically motivated reasons for the very limited discussions about the Iran protests. Thoughts? ",
        "created_utc": 1514770573,
        "upvote_ratio": ""
    },
    {
        "title": "With Reddit's front-page algorithm, if people started upvoting an old post could it theoretically reach the front-page and/or popular?",
        "author": "aspalt_",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7nat28/with_reddits_frontpage_algorithm_if_people/",
        "text": "Does Reddit factor time into the algorithm to decide which posts reach the front page? Or is it purely based on upvotes?\n\nSo, for example, if people started upvoting one post from 3 months ago, what is the chance it could reach the front page and/or popular?",
        "created_utc": 1514752328,
        "upvote_ratio": ""
    },
    {
        "title": "With Reddit's front-page algorithm, if people started upvoting an old post could it theoretically reach the front-page and/or popular?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7nan2x/with_reddits_frontpage_algorithm_if_people/",
        "text": "[removed]",
        "created_utc": 1514750603,
        "upvote_ratio": ""
    },
    {
        "title": "Is it just me or is the average quality of advice I get on Reddit higher than what I find via a Google search?",
        "author": "ragnarkar",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7nacvq/is_it_just_me_or_is_the_average_quality_of_advice/",
        "text": "I've used Google since the early 2000s whenever I needed advice on something (i.e. by googling \"How to _____\" and variations of that.)  I was a bit reluctant to seek advice on Reddit when I first discovered it a few years ago but over time, I've started to notice that the advice here is usually of higher quality than the advice I get via Google.  In a nutshell, whenever I search Google for how to do something, I'll get 10 results per page, usually blog or news articles.  The first article might be a few years old or advice that has conventionally worked.  Then results 2-10 would pretty much be a rehash of the first article or even a straight up copy of it.  If I do the same search on Google but append \"site:reddit.com\" to it, I get advice that's written by a Redditor in his/her own words rather than bloggers who have churned out article after article trying to game SEO to get as much traffic to their sites as possible rather than giving real and good advice **in their own words.**\n\nDoes my experience here reveal a sad reality of blogging, SEO, and the media these days?  I often shun credible news sites or blogs (i.e. lifehacker, NY times, etc.) and find the advice on Reddit (and also on Quora, Stackexchange, etc.) written by ordinary people much more credible than the 10-20 news/blog articles Google gives me which all basically say the same thing, sometimes in different words.  Of course, there's plenty of junk advice on Reddit as well but it's relatively easy to separate the good stuff from the noise here.\n\nHere's a sampling of topics that I've found more meaningful advice through Reddit than through blogs or news sites:\n\n- Credit cards and personal finance.\n\n- Dealing with government bureaucracy (like simple income/property tax advice, registering a car, etc.)\n\n- Bitcoin/cryptocurrencies\n\n- And too much more for me to remember.\n\nI guess this is my first \"review\" of Reddit despite being here for just over 3 years.  Anyone else's experience similar to mine?",
        "created_utc": 1514747702,
        "upvote_ratio": ""
    },
    {
        "title": "I feel like the latest version of Reddit app is good... But anyone else having issues ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7n9syp/i_feel_like_the_latest_version_of_reddit_app_is/",
        "text": "[deleted]",
        "created_utc": 1514742197,
        "upvote_ratio": ""
    },
    {
        "title": "I feel like the new updated reddit app is great, but... Is anyone else having an issue with the app being slow/errors/freezing ? Never had this problem before the update",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7n94as/i_feel_like_the_new_updated_reddit_app_is_great/",
        "text": "[removed]",
        "created_utc": 1514735214,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone elses updated reddit app slower than the previous version ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7n8pz0/anyone_elses_updated_reddit_app_slower_than_the/",
        "text": "[removed]",
        "created_utc": 1514730506,
        "upvote_ratio": ""
    },
    {
        "title": "Anybody else notice the imgtv spam all of a sudden?",
        "author": "Jrook",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7n5mug/anybody_else_notice_the_imgtv_spam_all_of_a_sudden/",
        "text": "[removed]",
        "created_utc": 1514684206,
        "upvote_ratio": ""
    },
    {
        "title": "There should be an option to \"mirror\" the comment sections between two different posts on reddit.",
        "author": "JoelQ",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7n5kon/there_should_be_an_option_to_mirror_the_comment/",
        "text": "How many times have you clicked on a Reddit post that links you to somewhere else on Reddit? (think r/bestof as a popular example)\n\nOften times, the goal is not to discuss the same topic, but rather to discuss something else happening on Reddit. Such as, \"Hey, look at what these other redditors are talking about!\"\n\nSome communities even use an \"np.reddit\" link to discourage vote-brigading and cross-contamination between subreddits. \n\nBut sometimes you're posting in one subreddit and the real discussion is happening in a different subreddit. And when both communities are mutually  invested in the same topic, your goal is not to \"brigade,\" mock, or shame the other thread.  You just want to expose the subscribers of one subreddit to the discussion happening in another.\n\nThe problem is that many people don't leave comments in the original post. They comment on your newly-created cross-post or \"X-post.\"\n\nFor example, suppose I post a topic in r/CherryPies. But there's a much larger, more comprehensive discussion about this same topic happening in r/Pies. \n\nRather than having two different discussions, maybe there should be an option to make the comment section for your thread exactly \"mirror\" the comment section in another thread so that subscribers of different subreddits can communicate bilaterally.\n\nThe OP of the original post could be sent an automated invite link saying something like, \"A redditor from another subreddit has requested that the comments of *your post* be mirrored to the comments of *this post*. Reply Yes to accept.\"\n\nThis could also be done to multiple posts within the same subreddit, avoiding the need for a \"megathread.\"\n\n",
        "created_utc": 1514683537,
        "upvote_ratio": ""
    },
    {
        "title": "How does a post get removed?",
        "author": "Emilia327",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7n4xoa/how_does_a_post_get_removed/",
        "text": "Just out of curiosity, if a Reddit post receives a lot of downvotes, does it automatically get removed by the moderators?\n\n",
        "created_utc": 1514676842,
        "upvote_ratio": ""
    },
    {
        "title": "How To Get Fast Karma For New User?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7mukv8/how_to_get_fast_karma_for_new_user/",
        "text": "[removed]",
        "created_utc": 1514557557,
        "upvote_ratio": ""
    },
    {
        "title": "How I can Get Fast Karma For New User?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7muenc/how_i_can_get_fast_karma_for_new_user/",
        "text": "[removed]",
        "created_utc": 1514555488,
        "upvote_ratio": ""
    },
    {
        "title": "Is reddit one of the worst places to get your daily dose of news?",
        "author": "doorbellguy",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7mu37x/is_reddit_one_of_the_worst_places_to_get_your/",
        "text": "There have been claims of pushing agendas, censoring discussions and what not. Goes without saying that yes, no one place is a good to get all your news. It can be one of many sources for news, so it's best to read from various sources and verify the credibility.\n\nIf the upper mentioned claims are true, I believe we're really losing out on good and healthy discussions, which otherwise would have been great to participate in with the way this site is designed. \n\nWhat are your thoughts on this?",
        "created_utc": 1514551140,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit should have a setting for “view only mode” on removed comments",
        "author": "Slay3d",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7mrkwb/reddit_should_have_a_setting_for_view_only_mode/",
        "text": "They can hide the username that posted it\n\nI say this because I love scrolling controversial on everything, And very often, many controversial comments will be removed. It sucks as a reader. It would be a hidden option which would be turned off by default and if turned on, would allow you to view removed comments",
        "created_utc": 1514516537,
        "upvote_ratio": ""
    },
    {
        "title": "Did the well-rounded trophy algorithm change?",
        "author": "J4CKR4BB1TSL1MS",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7mqewi/did_the_wellrounded_trophy_algorithm_change/",
        "text": "AFAIK the algorithm used to compute min(max(post), max(comment)) for all users within a given day, and then the user with the highest score would earn the award.\n\nI've now seen a situation where not only this score was higher for me than for the winner of that day, but both my highest comment and highest post were significantly higher (and in the same day) as their highest comment/post. \n\nDoes it now take something else into account, such as relative scores within a user compared to different days, or number of posts/comments?\n\nNot a vital question, but I'm curious whether they changed the inner workings of these and/or other trophies recently.",
        "created_utc": 1514504429,
        "upvote_ratio": ""
    },
    {
        "title": "Hot posts(filter) never take in account the number of comments",
        "author": "Jeesuz",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7mkz6c/hot_postsfilter_never_take_in_account_the_number/",
        "text": "I posted two different links on the same subreddit at the same time and they both got the same number of upvotes.\n\nOne had approximately 200 comments and the other had 5.\n\nI thought the hot algorithm was a little more complex.\n\nAny thoughts on why it isn't taking more variables than that on a small subreddit (36K)?",
        "created_utc": 1514442898,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of influence does your average redditor really have on the world?",
        "author": "first_order_general",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7mhekf/what_kind_of_influence_does_your_average_redditor/",
        "text": "I know some political movements have gotten started purely because of the internet/reddit.  But to what extent? How common is this occurrence?",
        "created_utc": 1514405148,
        "upvote_ratio": ""
    },
    {
        "title": "Abuse of downvote that people keeps using and doesn't even read my post",
        "author": "DioX_Reddit",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7mgas8/abuse_of_downvote_that_people_keeps_using_and/",
        "text": "[removed]",
        "created_utc": 1514394965,
        "upvote_ratio": ""
    },
    {
        "title": "Explaining the downvotes a comment got can make you the speaker for these downvotes",
        "author": "JurijFedorov",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7mg6xs/explaining_the_downvotes_a_comment_got_can_make/",
        "text": "Becoming the speaker for downvotes can be a neutral or good thing. You can try to figure out why the comment was downvoted by supporting the user and you can together try to solve this detective case. But I want to point out another side of it.\n\nNow, usually I try to keep to subs where people are somewhat mature and intelligent. But because I am a big FC Barcelona fan I tend to visit r/soccer from time to time even though I had to unsubscribe from that sub to not visit that poisonous atmosphere too often. And of all the subs I visit on Reddit it it by far the one that has the biggest percentage of low intelligent people. Even worse than r/news.\n\nr/soccer has a very notorious flair downvote problem. I think it's worst for people with FC Barcelona user flair because there are a lot of fans of my team who just refuse to \"flair up\". Which means get a flair next to the username. This refusal to \"flair up\" is not something I have seen in other fanbases. Barca fans also often complain about r/soccer on our own team's sub and advice people to not visit r/soccer at all because you won't find any quality discussions there. Maybe there are some other fanbases who experience this too systematically but I have just not noticed it. Either way, I am not defending myself or my team here. I am trying to illustrate a behavior, that's it.\n\nNow, flair downvotes makes a certain Reddit behavior much more noticeable. It goes something like this:\n I make a comment defending a player from my team by saying something like \"I don't think his comments were bad. I disagree with your statement that he is a cunt\". I will get 30 downvotes for this comment and do not think much of it. If I made the same comment without a \"FC Barcelona\" flair I would not even be downvoted for such a statement as it would be seen for what it is, a counter-argument. Now it is seen as a biased statement and is attacked for that. But suddenly someone sees that my comment has 30 downvotes. Now, he knows that I am under attack. He knows that I have broken their cultural rules of \"don't have a Barca flair and support your team\". And now I am basically an injured enemy. So he thinks he can get easy points by attacking me. He wants to be the one who puts words to these downvote emotions. He wants to become the leader and speaker for his people. And he also thinks this is an argument he himself can easily win and get some satisfaction out of that. So he thinks a bit and comes up with some, in his mind, good counter-argument to my claim. \"Fuck you, how dare you attack other teams like this and support a psychopath of a player?\" Now, there is a problem here for him. Before I just ignored the downvotes. I had already \"lost\" the debate because I had lost standing in the group. But because he wants to be the voice of these downvotes he gives a reason for them. And as the reason for them is just \"hate the flair this user has\", he cannot make any kind of good argument for the downvotes. I can easily point out several fallacies in his argument. Which makes me go from having \"lost\" the argument to having pointed out how silly he is and how silly all the downvotes are. He is their only voice and he just was made to look like a fool.\n\n**TL:DR**\n\n1. Some users are putting a voice to downvotes to be a part of the \"winning\" side in the debate.\n2. This voice can be ignorant and wrong. The mass can be wrong and often is. So this clear voice can *backfire* and *shoot* the mass in the *foot* by illustrating that they do not have a *leg* to stand on. Their votes are just emotional outbursts.",
        "created_utc": 1514393975,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit is Suffering from Mean-World Syndrome. The site serves millions of users that can post what they want all at once, fueling a climate of paranoia in the name of viewership.",
        "author": "realyuvallevental",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7m9zev/reddit_is_suffering_from_meanworld_syndrome_the/",
        "text": "*Because of the increasing number of reddit users, it is getting harder to upvote moderate content, and extremes are growing ever more popular.*\n\nOne of the most famous hated subs was the incels subreddit.  Despite only having [40,000 subscribers](http://redditmetrics.com/r/Incels), compared to the 20 million members of reddit, [it received far more negative attention than was warranted](https://np.reddit.com/r/TheoryOfReddit/search?q=title%3Aincels&amp;sort=top&amp;t=all).  It is not clear how many people were truly threats out of this relatively small population, especially when the views on women still had significant variation.  Other possible threats in the world received much less attention.  Some only joined because they thought ForeverAlone was too passive and counterproductive (even though Incels wasn't much better).\n\nPersonally, I would see multiple posts about it on askreddit, the frontpage, and many other communities on a daily basis.\n\nThe other, more prominent example is the Donald Trump presidency.  About 50% of posts on the frontpage are against him.  While Trump is one of the worst presidents, it is unclear how big of a threat he actually is, and how useful filling the frontpage with posts against him is in stopping him.\n\nOf course, there are many subs focused on attacking a group of people, and the upvoted posts on those subs are getting more extreme by the day.\n\nIf Trump were to suddenly resign, and after reddit celebrated, what would be their most hated topic?",
        "created_utc": 1514318934,
        "upvote_ratio": ""
    },
    {
        "title": "History of /r/geopolitcs?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7m9oj2/history_of_rgeopolitcs/",
        "text": "[removed]",
        "created_utc": 1514315971,
        "upvote_ratio": ""
    },
    {
        "title": "Do minimum karma and age limits prohibit new users from really getting into reddit? If so, how can we improve upon that?",
        "author": "Marination1707",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7lwii5/do_minimum_karma_and_age_limits_prohibit_new/",
        "text": "It just seems to me things like that prevent people from really getting anywhere initially. On the large subreddits like r/politics or r/worldnews, either you can’t post or your account won’t clear the spam/new queue. The downside of this is that without karma, reddit will think you’re spamming the comment section and won’t let you comment more than every 9 minutes which can be a pain in the arse starting out.",
        "created_utc": 1514138736,
        "upvote_ratio": ""
    },
    {
        "title": "Do minimum karma and account ages prohibit new users from really getting involved in reddit in your opinion? If so, how can that be changed or improved?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7lwgk4/do_minimum_karma_and_account_ages_prohibit_new/",
        "text": "[removed]",
        "created_utc": 1514138135,
        "upvote_ratio": ""
    },
    {
        "title": "Years ago when I got downvoted I would entertain the idea that I was wrong and try to reconsider my stance on a subject. Now it's a great indication that I am saying what needs to be said. Anyone else experiencing this kind of shift?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7lphvc/years_ago_when_i_got_downvoted_i_would_entertain/",
        "text": "[removed]",
        "created_utc": 1514046882,
        "upvote_ratio": ""
    },
    {
        "title": "Did the fia in f1 in 1989 wanted senna out?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ll2ra/did_the_fia_in_f1_in_1989_wanted_senna_out/",
        "text": "[removed]",
        "created_utc": 1513984891,
        "upvote_ratio": ""
    },
    {
        "title": "Should we boycott reddit over their outright refusal to ban /r/T_D?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7lk8rj/should_we_boycott_reddit_over_their_outright/",
        "text": "[deleted]",
        "created_utc": 1513976491,
        "upvote_ratio": ""
    },
    {
        "title": "Why the trend on hot issue subreddits heavily pushing discord and other off-site social media usage?",
        "author": "diiejso",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ljpo9/why_the_trend_on_hot_issue_subreddits_heavily/",
        "text": "I've noticed a growing trend on reddit that whenever there is a new political or social issue that appeals to certain segments of the site there is almost immediately a subreddit created specifically about that issue by new accounts. Then the sub explodes in popularity hitting the top of /all. They use their sidebar, CSS design, and automod sticky comments on every post to push the userbase into joining their discord and following their social media accounts. The sub may be aimed at conservatives, liberals, people into a particular social issue, etc. and while the audience should be drastically different people the actions taken by the mod teams are practically identical across the board. They seem to be either the same people running the subs on each side of the issue or they're following the exact same rulebook.\n\nHas anyone else noticed this? If so, why do you think these types of subreddits are so heavily trying to get the userbase to interact with them off-site?",
        "created_utc": 1513971441,
        "upvote_ratio": ""
    },
    {
        "title": "Why are some people on reddit just stupid?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7l9umw/why_are_some_people_on_reddit_just_stupid/",
        "text": "[removed]",
        "created_utc": 1513867332,
        "upvote_ratio": ""
    },
    {
        "title": "The removal of discrete figures for upvotes and downvotes was one of the worst things to happen to Reddit.",
        "author": "_paiggey",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7l5nf0/the_removal_of_discrete_figures_for_upvotes_and/",
        "text": "It how can hide manipulation, it hides the algorithmic shifting of posts and paid upvotes.\n\nPlease discuss.",
        "created_utc": 1513815229,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit was a misinformation hotspot in 2016 election, study says",
        "author": "Epistaxis",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7kzhps/reddit_was_a_misinformation_hotspot_in_2016/",
        "text": "[link to the CNET article](https://www.cnet.com/news/reddit-election-misinformation-2016-research/)\n\n&gt; Researchers find a surge in links to controversial sites and redditors from \"fringe\" forums. The company's CEO says Reddit is “digging deeply\" on potential abuse.\n\n[link to the paper (PDF)](https://arxiv.org/pdf/1711.05303.pdf)\n\n&gt; We identify general trends in the (in)civility and complexity of political discussions occurring on Reddit between January 2007 and May 2017 – a period spanning both terms of Barack Obama’s presidency and the first 100 days of Donald Trump’s presidency. We then investigate four factors that are frequently hypothesized as having contributed to the declining quality of American political discourse – (1) the rising popularity of Donald Trump, (2) increasing polarization and negative partisanship, (3) the democratization of news media and the rise of fake news, and (4) merging of fringe groups into mainstream political discussions.\n\nSome highlights via CNET:\n\n&gt; Nithyanand found the activity was most intense in Republican-oriented subreddits, like r/Republican, r/Conservative, r/TedCruz, r/MarcoRubio and r/The_Donald. The increase was so much more pronounced on forums like those that Nithyanand thinks he might have stumbled on a planned push to change the tone and content of conservative political discussions across Reddit. \n\n&gt; ...\n\n&gt; What the researchers found is that visitors to Republican-affiliated subreddits were 600 percent more likely to see links to controversial sources after the start of the Republican primaries, and 1,600 percent more likely after the Republican National Convention in July 2016, than they were before the campaigns started.\n\n&gt; What's more, over 80 percent of all posts and comments about links to these sites were on Republican-affiliated subreddits before and after the election, Nithyanand said. \n\n&gt; ...\n\n&gt; Redditors active in the fringe groups Nithyanand identified increased their posts on subreddits affiliated with the Democratic party by 200 percent during the election -- that covers the time period between December 2015 and Election Day on Nov. 8, 2016. On Republican subreddits, it was 6,600 percent. \n\n&gt; There was a relationship between the number of comments made by redditors who were also active on hateful subreddits and the offensiveness of the comments on political subreddits. The more \"fringe\" commenters, the more offensive the discussions got, Nithyanand found. \n\n&gt; ...\n\n&gt; As the presidential primaries ended with national conventions in July 2016, redditors in political subreddits were about 20 percent more likely to see offensive posts than users looking at nonpolitical subreddits. That number held steady until May 2017, when it jumped to 30 percent. \n\n---\n\nEDIT: fixed typos in my copypasta",
        "created_utc": 1513749661,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people downvote",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7kup11/why_do_people_downvote/",
        "text": "[removed]",
        "created_utc": 1513704118,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit question. Is there a way to determine number of posts and comments on a subreddit in a given time frame?",
        "author": "DragonBard_Z",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ktxi3/reddit_question_is_there_a_way_to_determine/",
        "text": "I wanted to know how many threads there have been for 2017 and how many comments. I moderate the subreddit in question if that matters.",
        "created_utc": 1513697285,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit question. Is there a way to determine number of posts and comments on a subreddit in a given time frame? I wanted to know how many threads there have been for 2017 and how many comments. I moderate the subreddit in question if that matters.",
        "author": "DragonBard_Z",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ktilb/reddit_question_is_there_a_way_to_determine/",
        "text": "[removed]",
        "created_utc": 1513693154,
        "upvote_ratio": ""
    },
    {
        "title": "[question] How many threads deep can Reddit go, and do you think this makes Reddit qualitatively different from sites that only allow shallow threading?",
        "author": "cola_twist",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7kon03/question_how_many_threads_deep_can_reddit_go_and/",
        "text": "I've been looking for a limit to how deep reddit threads can go but my google-fu has failed me. Can there be an endless stack of threads branching off from a thread that itself branches off a previous thread? Does anyone have any idea how this deep threading leads to a different experience from sites that only allow 1 deep threads? ",
        "created_utc": 1513635217,
        "upvote_ratio": ""
    },
    {
        "title": "What’s the deal with Reddit Chat? Will anyone actually use it?",
        "author": "minimaxir",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7kngop/whats_the_deal_with_reddit_chat_will_anyone/",
        "text": "Reddit is apparently introducing [Reddit Chat](https://www.reddithelp.com/en/categories/using-reddit/chat), with support in the official App as of today and a staged rollout in the browser.\n\nBut what’s the purpose of this chat when there is already private messaging (and full-featured Discords for group chat)? Who is this targeting? ",
        "created_utc": 1513624912,
        "upvote_ratio": ""
    },
    {
        "title": "Requiring a reply when voting on a comment",
        "author": "Goby-WanKenobi",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7klfep/requiring_a_reply_when_voting_on_a_comment/",
        "text": "[removed]",
        "created_utc": 1513606286,
        "upvote_ratio": ""
    },
    {
        "title": "Is a diverse reddit at all possible?",
        "author": "thefrontpageofreddit",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7kiwoy/is_a_diverse_reddit_at_all_possible/",
        "text": "As it stands reddit is heavily middle/upper middle class, heavily white and heavily male. (With a sizable Indian men population) \n\nIs this the way things will always have to be? Almost every sub is dominated by this demographic. Reddit has also historically had a racist and sexist reputation.\n\nWe don’t really see the opinions of minorities, women, or poor people. I feel this would just make reddit a better website if it had more people. What do you think? Is this possible?",
        "created_utc": 1513570970,
        "upvote_ratio": ""
    },
    {
        "title": "In Ellen Pao's recent book, she lists the admins' fear of the reddit community as a major problem when making decisions for the platform. How does this mindset impact transparency and influence how the admins communicate with moderators and users? What needs to change?",
        "author": "shiruken",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7khza9/in_ellen_paos_recent_book_she_lists_the_admins/",
        "text": "Former reddit CEO Ellen Pao (/u/ekjp) recently [published a book](http://mashable.com/2017/09/28/ellen-pao-reset-review-interview/) about her lawsuit against Kleiner Perkins and it covers a fair amount of her tenure at reddit. In a section discussing the banning of /r/fatpeoplehate, she describes the \"fear\" the admins have of the reddit community:\n\n&gt; Our main problem was that our team feared the community of reddit users; it was hard for us to manage and resolve problems on the site when we were so scared about our users’ reactions that we tried to avoid interacting with them. We only allowed a few employees to communicate directly with users in an official capacity. Some of those employees talked trash about our policies with the moderators on back channels. We ended up with a lot of politics, a lack of transparency, and poor incentives for change.\n\nAdmin responsivity and transparency has always been a complaint amongst moderators and users. How does a company's fear of its userbase affect its ability to govern its own platform? Is this something that needs to change? Can it?\n\nTheir fears weren't entirely unfounded based on how reddit responded to the banning of those subreddits:\n\n&gt; We calculated that around 15,000 people were actively involved in the subreddits, but they generated an astounding volume and variety of images, and they prided themselves on their ability to upvote the images so that they would show up all over the most visible parts of the site. Moderators would take down the content and it would pop back up instantly. The private messages got angrier and angrier over time. The threats and images got more and more graphic, and people were pulling up old addresses and phone numbers, trying to dox me, or finding ways to manipulate Google search results so that typing in my name would yield photos of Hitler or the Islamic State flag. Some of the responses were so repulsive that I’ve blocked them from my memory. One of the community managers took me aside to show me that one redditor had offered to pay $1,000 to anyone who took a photo of me getting punched in the face. That was the only post we took down.\n\n&gt; One member of our community team was totally private and had carefully made sure no public photos of herself appeared online. Somehow, they found a picture of her anyway and fat-shamed her on the site. Another person on the team got doxed; they posted her home address and phone number. I have to say: Threats carry a bit more weight when the people threatening you also publish your address. Suddenly it goes from online to offline and becomes real. I noticed that only women on the community team were being personally identified and attacked. We were a small part of the staff, and we were catching most of the heat. There wasn’t much we could do to stop it, without prolonging or energizing the harassment.\n\n\n\n",
        "created_utc": 1513560727,
        "upvote_ratio": ""
    },
    {
        "title": "How is Reddcoin being used on Reddit?",
        "author": "profoundnexus",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7kfoo3/how_is_reddcoin_being_used_on_reddit/",
        "text": "I just searched this subreddit and cannot find any mentions of Reddcoin. \n\nI'm sure I am not the only one who would love to see Reddcoins being used on Reddit. \n\nAny ideas how?",
        "created_utc": 1513537985,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way people find out the most followed users in the new Reddit profile feature?",
        "author": "fallenbad-FAQ",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7kf41d/is_there_a_way_people_find_out_the_most_followed/",
        "text": "I have a Reddit profile which has about 1.5k followers. When the followers exceeded 1k I started getting spam inbox messages.\n\nhttps://i.imgur.com/dR2NRPD.png\n\nIt is usually people promoting Youtube videos or asking me to click links. Its clear they saw my profile in a list and are sending me spam along with other profiles.\n\nThe most popular profiles have thousands of followers but when it trickles down this is a new feature and not many people have thousands of followers so I may be on some list they are using to spam.\n\nThe only list I found didn't have me but it did have people with less followers than me as the \"most followed users on Reddit\". Someone may have made a new with me but I can't find it.\n\nWhat is most surprising is that you can't see how many followers I have, only I can and still they know who to spam. How are they even doing this and getting the numbers if they don't see the followers?\n\n",
        "created_utc": 1513532486,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an updated list of active users per subreddit?",
        "author": "2muchnothing",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7kc320/is_there_an_updated_list_of_active_users_per/",
        "text": "im wondering if i could find something like this thread but updated... It would be a graph on average online users based on the total amount of subscribers an entire subreddit has.\n\nhttps://www.reddit.com/r/TheoryOfReddit/comments/yev9s/some_initial_horribly_anecdotal_statistics_about/\n\nIt would be pretty interesting to see how reddit evolved throughout the years",
        "created_utc": 1513487590,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone collected data on how... upvotey certain subreddits are?",
        "author": "lRKSOME",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7k6vtl/has_anyone_collected_data_on_how_upvotey_certain/",
        "text": "I'm talking about some kind of ratio, like number of upvotes per subscriber, or something to that effect. Sorry if this has been asked; there was no buzz word I could think of to pull up a question like mine.",
        "created_utc": 1513429233,
        "upvote_ratio": ""
    },
    {
        "title": "Is Reddit owned by Russia?",
        "author": "PocketBearMonkey",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7jxhcn/is_reddit_owned_by_russia/",
        "text": "[removed]",
        "created_utc": 1513312967,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit: address the T_D mod problem",
        "author": "TheSoftBoiledEgg",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7jw2d8/reddit_address_the_t_d_mod_problem/",
        "text": "[removed]",
        "created_utc": 1513297869,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit is positioning itself to be a content source and will monetize it.",
        "author": "X019",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7jvb6s/reddit_is_positioning_itself_to_be_a_content/",
        "text": "Reddit hasn't been profitable for some time now. Reddit gold was an attempt to offset some of the costs, but running a top 10 visited website is expensive.\n\nMany users on reddit submit their own OC. Imgur was and is a largely used hosting site, but reddit has been taking some of that share. Same thing with youtube and video hosting on reddit. I think we can use Facebook as an example of what's to come. Users on Facebook were able to post videos to their pages and Facebook has inserted ads into those videos. I don't know what they're making from those ads, but if/when reddit does that, it will certainly help offset spending.",
        "created_utc": 1513290788,
        "upvote_ratio": ""
    },
    {
        "title": "Is reddit really being manipulated by Russian Bots?",
        "author": "Richard2099",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7jucd1/is_reddit_really_being_manipulated_by_russian_bots/",
        "text": "I keep hearing about it, but I’m wondering how exactly that would work. Usually you can tell if English isn’t a first language when people type. ",
        "created_utc": 1513282682,
        "upvote_ratio": ""
    },
    {
        "title": "New reddit profile icons",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7jpvmz/new_reddit_profile_icons/",
        "text": "[removed]",
        "created_utc": 1513233391,
        "upvote_ratio": ""
    },
    {
        "title": "I want a psychological reason why the internet is full of trolls and jerks and people who enjoy making others angry",
        "author": "urinetroublee",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7jpqyf/i_want_a_psychological_reason_why_the_internet_is/",
        "text": "Doesn't it seem like a real waste of time? What's going on psychologically with people who get off on making others angry/upset?\n\nDo you think these people are as worthless IRL as they are online? And if not, why don't they actually contribute to discussion if they have something valid and intelligent to offer?\n\nIt seems odd to me to wake up and go ''Oh man, I really want to piss people off today! Woo!'' \n\nDelve into these people's personality/psychology.\n\n\n",
        "created_utc": 1513231730,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit algorithm discourages discussion?",
        "author": "nihilset",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7jk2q3/reddit_algorithm_discourages_discussion/",
        "text": "As a forum, I would expect that the main algorithm for sorting comments would favor, aside from upvotes, discussion. \n\nOddly enough, in [this thread](https://www.reddit.com/r/dankmemes/comments/7jhaqb/one_net_to_rule_them_all/?st=JB57VFW4&amp;sh=36053974) i found  [this comments](https://imgur.com/gallery/3f2JT). As you can see, the most upvoted reply is sorted second to another one, and the only difference between each of them is that the most upvoted one has a reply \n\nIs this kind of sorting commonplace? Is there an explanation in the algorithm Reddit uses? Does anyone know the rationale behind this?",
        "created_utc": 1513179967,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Reddit so hostile towards transgender and non-binary people?",
        "author": "heretics_killers",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7jc2ll/why_is_reddit_so_hostile_towards_transgender_and/",
        "text": "In my experience, Reddit tends to be pretty transphobic, and here's some types of hateful rhetoric you see in almost any thread about the issue (and this type of stuff tend to get upvoted, too).\n\n* calling trans/non-binary people \"mentally ill\", \"snowflakes\" or slurs\n\n* \"attack helicopter\" and \"2 genders\" jokes \n\n* saying that they're \"just doing it for attention\"\n\n* refusing to call them by their preferred pronouns, and refusing to acknowledge their gender identity \n\nI find it strange, because reddit seems to lean more liberal on other social issues. What is it about this issue that makes reddit so conservative and hostile? has it always been like this, or is this something that happened during the run-up to the 2016 election?",
        "created_utc": 1513098064,
        "upvote_ratio": ""
    },
    {
        "title": "What happened to Novelty accounts?",
        "author": "confusedjake",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7jbkft/what_happened_to_novelty_accounts/",
        "text": "What changed in reddit that caused them to be less ubiquitous? Used to be that that every other top comment came from these accounts. Some are still active but they are mainly older ones. New ones are few and far between. And while we are here what happened to \"famous\" redditors like Andrewsmith and the like. I do remember them stepping away well before the advent on novelty accounts.",
        "created_utc": 1513093816,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit will soon begin removing posts already seen by users from their home feeds. How will this affect the content seen by users and what broader implications will it have for the platform?",
        "author": "shiruken",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7j8odp/reddit_will_soon_begin_removing_posts_already/",
        "text": "Earlier today the admins [made a post to /r/changelog detailing an upcoming change to the home page](https://www.reddit.com/r/changelog/comments/7j5w9f/keeping_the_home_feed_fresh/) where posts already seen by a user will be removed to allow for faster turnover. The majority of comments thus far have been critical of the change, expressing worries about how this will affect [discussion-oriented posts](https://www.reddit.com/r/changelog/comments/7j5w9f/keeping_the_home_feed_fresh/dr3ukvy/) (e.g. AMAs) and [breaking news threads](https://www.reddit.com/r/changelog/comments/7j5w9f/keeping_the_home_feed_fresh/dr3vp81/). There is no option to opt-out of the change and [the admins seem reluctant to implement such a feature.](https://www.reddit.com/r/changelog/comments/7j5w9f/keeping_the_home_feed_fresh/dr45mws/)",
        "created_utc": 1513057774,
        "upvote_ratio": ""
    },
    {
        "title": "Why does banning people from subs matter...",
        "author": "paavam_kalikkaaran",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7j6l1v/why_does_banning_people_from_subs_matter/",
        "text": "...if it takes only less than a minute to create a new account and post again?",
        "created_utc": 1513037181,
        "upvote_ratio": ""
    },
    {
        "title": "I spend about an hour a day removing violent comments and threats against US officials from the subreddits I mod and it's getting harder and harder to feel like I'm doing the right thing. (Also, reddit is smaller than you think)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/self/comments/7j4km9/i_spend_about_an_hour_a_day_removing_violent/",
        "text": "[deleted]",
        "created_utc": 1513022422,
        "upvote_ratio": ""
    },
    {
        "title": "Why \"Evil\" buildings?",
        "author": "heterosis",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7j3y6e/why_evil_buildings/",
        "text": "I see high point posts from r/evilbuildings popping up on r/all frequently.  It has 275K subs.  Many of the posts don't seem particularly \"evil\", more bizarre or interesting ([e.g.](https://www.reddit.com/r/evilbuildings/comments/7j2rbg/come_home_drunk_good_luck_finding_your_apartment/)).  But r/bizzarebuildings has 1/5 the subs.  \n\nSo why \"evil\", what is the appeal?",
        "created_utc": 1513015667,
        "upvote_ratio": ""
    },
    {
        "title": "/r/Israel: A curious subreddit history.",
        "author": "KBAREY",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7j38ky/risrael_a_curious_subreddit_history/",
        "text": "Yeah, I know, this topic is rather sticky...but, TBH, it's interesting.\n\nEarly in its history /r/Israel was used to post many articles criticizing the actions of Israel in relation to the conflict. At some point, it was taken over by more right-wing elements, and now is firmly pro-Netanyahu and anti-Palestine on everything. Jokes about how Palestine isn't real/claims aren't legitimate are frequently upvoted, settlements are routinely defended and most users engage in excessive defense of everything the Israeli government has done to the point where many seem to think it can do no wrong in the conflict. \n\nWhy did this shift take place, and is /r/israel in line with mainstream Israeli opinion? (If so, that is quite a depressing thought)",
        "created_utc": 1513009455,
        "upvote_ratio": ""
    },
    {
        "title": "Mob mentality of reddit",
        "author": "raumeat",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7iybqs/mob_mentality_of_reddit/",
        "text": "I feel that reddit should be a place to share ideas and have intellectual debates, but I have notice that a lot of sub reddits starts forming a shared ideological believe and any comment or post that does not agree with this believe gets down voted. As soon as something is -1, downvotes start snowballing.\n\n I think there is a version of the bystander effect that takes place, no one wants to break from the crowd or disagree with the opinion of the masses. And when the same opinions and ideas get up voted and repeated the community starts forming a hive mind, with people buying into the dominant ideology. Its kind of counter productive. \n\n\n   ",
        "created_utc": 1512953433,
        "upvote_ratio": ""
    },
    {
        "title": "Theoriy Is Barry Going To Save Wayne Family On Flashpoint movie!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7iv4c2/theoriy_is_barry_going_to_save_wayne_family_on/",
        "text": "[removed]",
        "created_utc": 1512925854,
        "upvote_ratio": ""
    },
    {
        "title": "Emojis on the Reddit",
        "author": "NightFury5",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7iqnmi/emojis_on_the_reddit/",
        "text": "Hi, I don’t know if this is the right place to ask this but this is the closest to discuss this I know of, so if there is any problem with my post feel free to delete it but I would like some suggestion where to place this. Anyway. Why aren’t the emoticons the thing on the reddit? We saw lately that modern society and technology (mainly facebook and apple) are adding emojis at the rate of couple dozens a year maybe and they are always improving them but only person I have seen so far using emojis on the Reddit was me and it’s interesting to see that the Reddit is one of the last  emoji-free sites on the internet. ",
        "created_utc": 1512866287,
        "upvote_ratio": ""
    },
    {
        "title": "On my \"Home\" tab the first post is always from r/Askreddit, the second post is always from r/totallynotrobots, the third is always from r/politics, etc... What's going on with the Reddit algorithm?",
        "author": "cwood1973",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ipo66/on_my_home_tab_the_first_post_is_always_from/",
        "text": "[removed]",
        "created_utc": 1512856228,
        "upvote_ratio": ""
    },
    {
        "title": "Why has reddit been largely unaffected by disinformation campaigns when virtually every major site was effected by bot spam and professional trolls?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7imerc/why_has_reddit_been_largely_unaffected_by/",
        "text": "[removed]",
        "created_utc": 1512821262,
        "upvote_ratio": ""
    },
    {
        "title": "What is reddit gold?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ikass/what_is_reddit_gold/",
        "text": "[removed]",
        "created_utc": 1512789675,
        "upvote_ratio": ""
    },
    {
        "title": "Is 4chan more shillproof than reddit?",
        "author": "RivetingPoop",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ij6lt/is_4chan_more_shillproof_than_reddit/",
        "text": "I ask out of random curiosity\n\nWith all the talk of reddit being taken over by shills with striking evidence here and there I was wondering if the cesspool of 4chan is more resilient against shilling\n\n",
        "created_utc": 1512778330,
        "upvote_ratio": ""
    },
    {
        "title": "Is 4chan more shill proof than reddit?",
        "author": "RivetingPoop",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ij48l/is_4chan_more_shill_proof_than_reddit/",
        "text": "[removed]",
        "created_utc": 1512777649,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit mechanics",
        "author": "Hatamaru",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7ie7fi/reddit_mechanics/",
        "text": "[removed]",
        "created_utc": 1512729578,
        "upvote_ratio": ""
    },
    {
        "title": "Why is r/shoplifting allowed to exist?",
        "author": "Slay3d",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7icnwp/why_is_rshoplifting_allowed_to_exist/",
        "text": "Not sure if this is the right sub for this, if not, plz point me to where I should post this\n\nSome people like to state that the sub is simply discussing shoplifting but that is not the case, people in that sub are actively posting their shoplifting “loot” which is like saying “crime pays, check out how much I made by committing crime” and others are posting/asking for advice about how to shoplift. Not as curiosity, these people are actually using advice to commit crimes.",
        "created_utc": 1512709353,
        "upvote_ratio": ""
    },
    {
        "title": "Why has the Reddit favicon been changed from a light blue square to a bright red circle?",
        "author": "outofpatience",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7iasab/why_has_the_reddit_favicon_been_changed_from_a/",
        "text": "Beginning today, the Reddit favicon (the tiny logo that appears atop each Reddit tab) is bright red and round, where it used to be light blue and square. It's garish. It's bright red, which really grabs the eye -- but who wants their eye grabbed by a favicon? And it's not much bigger than the bright red dot that signifies incoming messages, thus it's always making me think I have new messages. \n\nI don't like the big bright red dot! If anyone from Reddit is reading this, please make the big bright red dot go away. That is all. Thank you.\n\nExit cranky old man.",
        "created_utc": 1512691537,
        "upvote_ratio": ""
    },
    {
        "title": "Moderators: navel gaze on reddit in person at MIT Jan 27-28",
        "author": "natematias",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7i9wnc/moderators_navel_gaze_on_reddit_in_person_at_mit/",
        "text": "Hi TheoryOfReddit, thanks so much for your helpful feedback on my research over the last few years (on the [reddit blackout](http://natematias.com/media/GoingDark-Matias-2016.pdf), on [sticky posts](https://civilservant.io/moderation_experiment_r_science_rule_posting.html), on [fact-checking](https://medium.com/mit-media-lab/persuading-algorithms-with-an-ai-nudge-25c92293df1d)). \n\nJan 27-28, I'm convening a community research summit at MIT for reddit mods whose communities are interested to do A/B tests and other research on moderation ideas. [Applications are open through December 15](https://civilservant.io/civilservant_summit_jan_2017.html).\n\nYou can learn more about the overall project at [civilservant.io](http://civilservant.io).\n\nI would love to see you there!",
        "created_utc": 1512683643,
        "upvote_ratio": ""
    },
    {
        "title": "Was There An Algorithm Change to Front Page That Promotes Smaller Subs?",
        "author": "hairierdog",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7i90b4/was_there_an_algorithm_change_to_front_page_that/",
        "text": "I'm subbed to many large subreddits which usually take up at least the top 40 spots but suddenly my smaller subs are now number 2 and 5 on my front page.\n\nEDIT: The longer I've had to experience this change, the more I hate it. Small subs that I have interacted with in the past (but not in a meaningful way) now consistently occupy space 2, 3, 7, and 10 on my front page. I hope feedback like this can convince reddit to undo the change. It just amplifies the echo chamber by creating a feedback loop - it doesn't actually represent your interests, just your interactions.",
        "created_utc": 1512675324,
        "upvote_ratio": ""
    },
    {
        "title": "Was There An Algorithm Change to Front Page?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7i8zxx/was_there_an_algorithm_change_to_front_page/",
        "text": "[deleted]",
        "created_utc": 1512675237,
        "upvote_ratio": ""
    },
    {
        "title": "what is up with Reddit karma system?",
        "author": "Saltykaisar",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7i5aaj/what_is_up_with_reddit_karma_system/",
        "text": "I mean as a newbie to Reddit, I literally can't post or comment on almost all of the sub-Reddit. and then the biggest problem is having a different opinion then everyone else, it's like this site can't deal with people having opinions and discussions \n\nhow is this site called the Front page of the internet when there is so much censorship and butt hurt people aka snowflakes. Reddit?!? more like censor everything and everyone we don't like and also fuck new people.\n\n(this post will prob get deleted because i either don't have enough karma or some other bullshit reason, i will surprised if it doesn't)",
        "created_utc": 1512638967,
        "upvote_ratio": ""
    },
    {
        "title": "Why do Video Game subreddits have such a huge and dedicated user base?",
        "author": "rkdechamp",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7i59dm/why_do_video_game_subreddits_have_such_a_huge_and/",
        "text": "I actually started using reddit through lurking on the r/leagueoflegends subreddit - it just turned out to be the most active League of Legends community I've found online. \n\nAfter venturing outside of that subreddit, I've found that very few non video game subreddits are as active or have as many posts. Any theories to why video gamers have chosen Reddit as their portal of choice?",
        "created_utc": 1512638536,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Reddit's app so well designed graphically while the desktop design looks like it's from the 2000s?",
        "author": "Trewdub",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7i4ubi/why_is_reddits_app_so_well_designed_graphically/",
        "text": "Reddit has been very good about keeping up with graphic trends on mobile, but on my computer it's trash. ",
        "created_utc": 1512632027,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many r/food posts end up locked?",
        "author": "rkk2",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7hsz79/why_do_so_many_rfood_posts_end_up_locked/",
        "text": "I’ve noticed an inordinate amount of posts that reach the front page there end up locked. \n\nIt’s a default sub but the rate at which posts are locked seems much higher than other defaults.\n\nIt isn’t like r/politics or r/news where the material is often inherently controversial. In fact about the most controversial thing that happens there is someone mislabeling food (e.g. that’s just a cheesesteak, a Philly needs x, y, and z). \n\nSo if it isn’t inherent to the sub is it just heavy handed moderators? It seems they don’t often sticky a comment when they lock a thread so it is hard to say whether or not they are overreacting. ",
        "created_utc": 1512509471,
        "upvote_ratio": ""
    },
    {
        "title": "Why am I getting posts from certain subreddit pushed to the top of my frontpage all of the sudden?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7hswaw/why_am_i_getting_posts_from_certain_subreddit/",
        "text": "[removed]",
        "created_utc": 1512508781,
        "upvote_ratio": ""
    },
    {
        "title": "Is Reddit a place where social scientists can win discussions?",
        "author": "JurijFedorov",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7hqten/is_reddit_a_place_where_social_scientists_can_win/",
        "text": "I wanted to make a post about discussions and how to \"win\" them on Reddit. But the reason I even though about that is because it's so hard to have a good discussion on Reddit in the first place. And it's even harder to win it. No matter if you are right or not. Therefore I'm asking the question: How many discussions would a social scientist who is an expert on his field win on Reddit? I think they answer will be depressing.\n\nSocial science is in many areas a soft science. So even though I have a masters degree in psychology I feel like I'm only winning under 2% of discussions I have on Reddit on subjects I know a lot about and have read many books about. I'm not an expert as I have not had 25 years experience in the field but I'm not a layman either. It feels like many social science issues become so politicized that people plain and simple refuse to only look at the science by itself. When we discuss genders, intelligence, races or other stuff I feel like it's mostly a political discussion here. And these discussions turn into mud slinging very fast. And which political extreme is throwing mud doesn't really matter. Both extremes have their own extreme positions that go against very common and accepted social science. They are just wrong in each their own unique ways that surprisingly align perfectly with their political convictions.\n\nWinning a discussion about social science is for me several things. Either I teach someone something new by posting links to studies or ideas or I am taught something new. A draw is basically a discussion that leads to both parties getting nowhere as the science is lacking in the area. A loss is when time is wasted. No side learns anything or one side is only there to sling extreme ideology around everywhere on Reddit and refuses to even look into stuff. No matter the topic the solution is for this ideolog simple: much more of their extreme ideology will fix any issue as their extreme ideology is seen as the pure and good truth.\n\nSo I have evolved some tools that I use in Reddit discussions. They are meant to at least take me out from the Reddit discussions that go nowhere and cannot lead to a win on the larger issues. Too often the other side seems to use tricks and cheat tools to win the discussion instead of sticking to the science. When that happens it's good for me personally to know what to do.\n\nFirstly, I always deescalate discussions. If someone attacks me with a 20 line long aggressive text about Jews and women or whatever I make sure to always make fewer points than him to narrow down the discussion and create a testable hypothesis. He will mention 10 subjects and I will respond to one and ask him about it. The discussion can still be had but it must be narrowed down to go somewhere and not escalate into a full on war. If you go into a war without an end goal it will most likely end in a Vietnam. Narrow it down to see if the person you are discussing science with actually knows something about something that you can learn something from. Deescalation also makes the discussion less about direct attacks and emotions and more about single points.\n\nAlso, make sure to have science on your side. Always have at least one scientific source you refer too. I have often experienced in discussions about intelligence that the other part plain and simple refuses to accept my sources because: \"all the scientists in this area are Nazis\". Now, extremely few scientists are actual Nazis or even fascist. Most are liberal and nearly all scientists I know about are liberal or at most libertarian. No matter the social science area. Even scientists that study intelligence, gender or evolutionary psychology. Most are liberal or very left leaning. Everyone who gets certain results will be called alt-right or Nazi by some groups online. But if the person you are discussing with does that you just know that the user is refusing to acknowledge scientific articles as a valid source in a discussion. Just post the sources and leave by deescalating the discussion. Maybe someone else will spot your links and read them.\n\nThis mud slinging and personal attacks can hit you too. Sometimes the best counter-point I can make it to use myself as an example. If someone says that all people with black hair are tall I could maybe use myself as a counter-point. But I usually refrain from doing that. No matter who I discuss stuff with giving the other side ammunition that can make them ignore science is not a good idea. Very often I will be attacked personally if I even use the word \"I\" in my argument. It's just better to not allow the other side to take the discussion down to the gutter. When I'm called racist or sexist online I feel that I must at least defend myself and that nearly always leads to more attacks. If they see that I hate being called a racist they have now spotted a way to \"beat\" me in a discussion even though they know nothing about psychology as a science. In a regular academic discussion I use all kinds of examples all the time. But sometimes they lead to very cruel personal attacks. Some of them still make me sad when I remember them. Once I said I didn't like a certain kind of meme and right away a person attacked me with a really long text. It was just one of the kind of comments that hit deep and stuck around. Some of them do even though they are just words.\n\nSo. I have not found any sub on Reddit that is good for social science discussions. And the news subs and political subs pretty much all have a huge infestation of ideology that refuses to go away. Unless I make my own private science sub or make a sub with academic flairs I think this problem will persist. A lot of users here are extremely good at acting like they are smart. And they are hard to spot and avoid.\n\nFor psychology discussions I stick to a private group on Facebook where only people willing to learn are welcome. That way there is no karma or points to be gained by \"cheating\" the system.",
        "created_utc": 1512491545,
        "upvote_ratio": ""
    },
    {
        "title": "Problem with reddit",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7hnm21/problem_with_reddit/",
        "text": "[deleted]",
        "created_utc": 1512451791,
        "upvote_ratio": ""
    },
    {
        "title": "ME NEED UPVOTES...LOL",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7hne9u/me_need_upvoteslol/",
        "text": "[removed]",
        "created_utc": 1512449333,
        "upvote_ratio": ""
    },
    {
        "title": "Consumers and Curators: Browsing and Voting Patterns on Reddit",
        "author": "eleitl",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7hinr0/consumers_and_curators_browsing_and_voting/",
        "text": "https://arxiv.org/abs/1703.05267\n\nAs crowd-sourced curation of news and information become the norm, it is important to understand not only how individuals consume information through social news Web sites, but also how they contribute to their ranking systems. In the present work, we introduce and make available a new dataset containing the activity logs that recorded all activity for 309 Reddit users for one year. Using this newly collected data, we present findings that highlight the browsing and voting behavior of the study's participants. We find that most users do not read the article that they vote on, and that, in total, 73% of posts were rated (ie, upvoted or downvoted) without first viewing the content. We also show evidence of cognitive fatigue in the browsing sessions of users that are most likely to vote.",
        "created_utc": 1512407263,
        "upvote_ratio": ""
    },
    {
        "title": "What’s with people responding to posts on /r/askreddit but not upvoting?",
        "author": "Bunningsausage",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7hge8o/whats_with_people_responding_to_posts_on/",
        "text": "It feels like many of own posts and many others on subbreddits such as askreddit will get up to 15 replies but only get upvoted a few times. If you are responding to a post in a positive way engaging in the conversation you would think you would upvote it to continue the conversation.",
        "created_utc": 1512381556,
        "upvote_ratio": ""
    },
    {
        "title": "Share from reddit to snap",
        "author": "majiig",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7h5b8c/share_from_reddit_to_snap/",
        "text": "[removed]",
        "created_utc": 1512249143,
        "upvote_ratio": ""
    },
    {
        "title": "Probably not the right place for this, but the new 'red notification' in reddit chat is overly obvious - we know all the dopamine reward methods. Please...let's make them change it to upvote orange :)",
        "author": "Mayafoe",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7h2vnu/probably_not_the_right_place_for_this_but_the_new/",
        "text": "[removed]",
        "created_utc": 1512224748,
        "upvote_ratio": ""
    },
    {
        "title": "What's with all the pictures of politicians?",
        "author": "MichaelTen",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7gyc1w/whats_with_all_the_pictures_of_politicians/",
        "text": "What's with all the pictures of politicians?\n\nNet Neutrality i know. \n\nIt's like half of reddit right now. I'm exaggerating a bit....\n\nGot any insights into this dynamic? ☺😃",
        "created_utc": 1512164642,
        "upvote_ratio": ""
    },
    {
        "title": "\"This is My Senator\" posts are inundating r/all right now. Thoughts?",
        "author": "chimpaznee",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7gyc1l/this_is_my_senator_posts_are_inundating_rall/",
        "text": "These posts from individual state subreddits are filling r/all right now like the net neutrality ones a week ago. Something is very fishy here.",
        "created_utc": 1512164640,
        "upvote_ratio": ""
    },
    {
        "title": "Why is /r/space so seemingly anti NASA some times?",
        "author": "first_order_general",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/7gxg1z/why_is_rspace_so_seemingly_anti_nasa_some_times/",
        "text": "[removed]",
        "created_utc": 1512157032,
        "upvote_ratio": ""
    }
]