[
    {
        "title": "What explains the drop in comment votes on reddit?",
        "author": "BlankVerse",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2tlq97/what_explains_the_drop_in_comment_votes_on_reddit/",
        "text": "",
        "created_utc": 1422180261,
        "upvote_ratio": ""
    },
    {
        "title": "Noticed that the average of several page refreshes will put you close to the actual vote total for a submission circumventing vote fuzzing but there's a better way to tell provided you are not tracking multiple submissions, your current link karma minus your karma before the submission. Why fuzz?",
        "author": "Tezcatlipokemon",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2tkpfv/noticed_that_the_average_of_several_page/",
        "text": "This is just an annoyance to the general reddit population and not especially to the bad apples that will manipulate because automation can take advantage of these facts.  I would argue that accurate feedback on vote totals could drive better submissions over time through educating the submitters on how appropriate their posts were for the context. \n\n*Edit:* \n\nSo I know that neither the link karma nor the post upvotes beyond certain thresholds are not direct 1 for 1 representations of voting totals (for reasons other than obfuscation).  I am talking about ascertaining the representative score.  \n\nSome are claiming that the representative score for link karma and post upvotes are calculated importantly differently.  If you know or suspect this to be the case, please demonstrate it. At the scale I've been watching, I have noticed a very strong correlation between the two in count and rate of change. ",
        "created_utc": 1422151939,
        "upvote_ratio": ""
    },
    {
        "title": "If you are not supposed to downvote based on dislikes, why does Reddit officially call them likes and dislikes?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2tiydl/if_you_are_not_supposed_to_downvote_based_on/",
        "text": "I see everywhere, even in the Reddiquette, you should downvote posts that do not contribute/are random. You should never rate comments based on opinions.\n\nTaken from the Reddiquette:\n\n&gt; [Please don't] Downvote an otherwise acceptable post because you don't personally like it. Think before you downvote and take a moment to ensure you're downvoting someone because they are not contributing to the community dialogue or discussion. If you simply take a moment to stop, think and examine your reasons for downvoting, rather than doing so out of an emotional reaction, you will ensure that your downvotes are given for good reasons.\n\nIf you \"don't personally like it\" then it would be called a dislike. If you are not supposed to downvote things you dislike, then why, when on your profile, do they let you see all comments that you have [disliked](http://imgur.com/I2Gpk0O) and show the downvotes?\n#TL;DR\nReddit says downvote if you dislike, but Reddiquette says never downvote because you dislike",
        "created_utc": 1422119556,
        "upvote_ratio": ""
    },
    {
        "title": "/r/fatlogic and even /r/fatpeoplehate appear to be more feminist than much of the rest of reddit...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2tieub/rfatlogic_and_even_rfatpeoplehate_appear_to_be/",
        "text": "So I'm a feminist and I notice a lot of anti-feminist sentiment whenever feminism is brought up on the default subs, or on any major sub. However, on /r/fatlogic I see a lot of posts that amount to:\n\n&gt; These people give feminism a bad name.\n\n&gt; &gt; I agree! I'm a feminist and I wish we could disassociate ourselves from these people. [Very highly upvoted]\n\nAnd recently on /r/fatpeoplehate I saw [a post](http://www.reddit.com/r/fatpeoplehate/comments/2tf1x9/feminism/) where again people seemed to be much more willing to discern between the #thisisthinprivilege folks and actual feminists, and there seemed to be a lot more positivity towards the feminist mainstream that on much of reddit.\n\nThis is weird because you'd sort of expect a sub dedicated to hating fat people (who often identify themselves as feminists) would actually be against feminism in general. I mean, I'm sure that much of SRS would dislike /r/fatpeoplehate, for example, but ironically if the rest of reddit was as understanding towards the motivations of real feminists as /r/fatpeoplehate appears to be, then SRS would probably have a lot *less* to complain about.\n\nI'm not sure what my question is here, but I mostly wanted to point out something I found to be quite paradoxical.",
        "created_utc": 1422106880,
        "upvote_ratio": ""
    },
    {
        "title": "Add a \"deleted\" tab for subreddits, next to \"Hot . New . Rising\" etc.",
        "author": "citizensearth",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2thu2p/add_a_deleted_tab_for_subreddits_next_to_hot_new/",
        "text": "",
        "created_utc": 1422084264,
        "upvote_ratio": ""
    },
    {
        "title": "Why are emoticons almost non-existent on Reddit?",
        "author": "uninhabited",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2tha95/why_are_emoticons_almost_nonexistent_on_reddit/",
        "text": "Emoticons (emoji, smileys etc) are overused in SMS and most of the rest of the internet IMHO but appear underused on Reddit. Are some of them filtered out automatically at some level? ಠ_ಠ appears in places. Granted they may seem childish in 'serious' discussions, but conversely Poe's Law seem be in force much of the time on Reddit:\n\n&gt; *Without a blatant display of humor, it is impossible to create a parody of extremism or fundamentalism that someone won't mistake for the real thing*\n\nIs there more scope for the humble :-) or are there 'downvote emoticon bots' roaming around?",
        "created_utc": 1422070764,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many reddit posts start with the word \"so\"?",
        "author": "maxsil",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2tchs0/why_do_so_many_reddit_posts_start_with_the_word_so/",
        "text": "\nEnglish is not my first language, but in both the other two languages i speak (Swedish and German) there are a lot of words that are unnecessary \"fillers\" that can be entirely removed with the effect of making the text seem more professional or well written.\n\nAnd the word \"so\" seems very much like one of those words which strikes me as weird because reddit seems very much like that facebook friend who uses thesaurus too much. \n\n**Example:**\n\nSo, SOE please remove the ability to do this..\n\n**Compare with :**\n\nSOE please remove the ability to do this..\n\n\n**I pulled that** from the frontpage just before i started writing this post. (SOE is a games developer)\n\nIt could even work in the title of this post: *So, why do so many reddit posts start with the word \"so\"*?\n\n\nI'm sorry if this is a reposed question, but a lot of posts on this subreddit also start with \"So,\" which makes searching kinda hard. \n\nAnd i don't know if this really is a big thing, but it really irks \n",
        "created_utc": 1421971254,
        "upvote_ratio": ""
    },
    {
        "title": "Admins enforcing subreddit bans?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2tb9k6/admins_enforcing_subreddit_bans/",
        "text": "Recently I've found out from another user's banning that trying to evade a subreddit ban by using alts [is a shadow-bannable offense.](http://i.imgur.com/X55tdJQ.jpg) \n\n\n- What do you think of this change in policy? \n\n- Does this mean there will be more admin involvement in subreddits?\n\n- What could this mean down the road? \n",
        "created_utc": 1421951338,
        "upvote_ratio": ""
    },
    {
        "title": "Harvard Business Review article comparing wikipedia and encyclopedia britannica for bias, could reddit possibly analyze a question posed in the article?",
        "author": "vote_for_peter",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2tap1s/harvard_business_review_article_comparing/",
        "text": "[This HBR article](http://hbswk.hbs.edu/item/7689.html?sf35674267=1) refers to a study that tried to determine whether wikipedia or encyclopedia britannica was more biased to gauge whether an expert or a crowd-sourced article would be more likely to contain bias.\n\nOne quote/hypothesis stood out to me: \"The massive, ongoing natural experiment of Wikipedia offers a unique view into these questions. \"The Internet makes it so easy for people to aggregate; some scholars worry that people will self-select into groups with a similar ideology,\" says Zhu. As a result, the Internet may lead to more biased opinions, which only harden over time as users separate into rival virtual camps.\"\n\nwhich they later address: \"Perhaps the most interesting finding of Zhu and Greenstein's research is that the more times an article is revised on Wikipedia, the less bias it is likely to show—directly contradicting the theory that ideological groups might self-select over time into increasingly biased camps.\n\n\"The data suggests that people are engaging in conversation with each other online, even though they have different points of view,\" says Zhu. \"The crowd does exhibit some wisdom, so to speak, to self-correct bias.\"\"\n\nI thought this question was especially ripe for reddit, where \"the hivemind\" and \"circlejerks\" are terms of art.  I wonder if it would be possible to examine word use or devise another methodology to determine or quantify the extent to which groupthink affects reddit communities.",
        "created_utc": 1421941647,
        "upvote_ratio": ""
    },
    {
        "title": "Did I just find a bot? What is this user?",
        "author": "lefthandedspatula",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2t9qrd/did_i_just_find_a_bot_what_is_this_user/",
        "text": "",
        "created_utc": 1421914031,
        "upvote_ratio": ""
    },
    {
        "title": "Is anyone keeping track of all these inside jokes?",
        "author": "june_oyster",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2t9mpe/is_anyone_keeping_track_of_all_these_inside_jokes/",
        "text": "As has been discussed many times, reddit has become increasingly self-referential over time.\n\n[Sometimes, it gets quite ridiculous](https://www.reddit.com/r/SubredditDrama/comments/2t8q68/takeittorcirclejerk_drama_from/?sort=confidence) and is almost impossible to fully explain to a non-initiate.\n\nI'm surprised there isn't a full encyclopedia of reddit weirdness that's easier to navigate than microfiche.\n\nWould redditors rather preserve their secret handshakes?",
        "created_utc": 1421910675,
        "upvote_ratio": ""
    },
    {
        "title": "Speculation about utility of downvote brigades",
        "author": "diversity_is_racism",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2t715k/speculation_about_utility_of_downvote_brigades/",
        "text": "Reddit tolerates downvote brigades. This much is clear from the continued presence of the subs that organize them and their impact on certain small groups here on Reddit.\n\nWhy would it do so?\n\nReddit wishes to avoid being seen as infringing free speech, but also have an environment comfortable for its generally overly-sensitive ideal young urban liberal singles. It must thus find a way to eliminate upsetting speech... and the answer is to crowdsource it.\n\nBy simply not enforcing on downvote brigades, it allows them to through the work of a few fanatics purge Reddit of anything for which it could be criticized by its target audience and their advertisers.\n\nKind of brilliant. This first came up with the /r/jailbait fiasco where Reddit had to own up to the huge amount of CP and neo-CP flowing through this place, and finally settled on letting Adrian Chen and various SJWs be the hatchet men.",
        "created_utc": 1421864588,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find data regarding precisely what reddit gives to law enforcement / FBI / CIA other state entities?",
        "author": "ItsThatFkingGuyAGAIN",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2t4vu0/where_can_i_find_data_regarding_precisely_what/",
        "text": "Holy crap that sounded paranoid.  Can we just pretend I am asking in a less paranoid sounding way?   \n\nI'm interested in understanding how often reddit gets subpoenas from the court system, how often they fight them, and how often they give L.E. what it wants.  \n\nI assume everything that goes on here is archived with an associated IP number?  \n\nReddit seems like quite a honeypot.. people get on here and confess to all kinds of stuff, legal and illegal..  I find it hard to believe this fantastically valuable material is just allowed to evaporate.\n\nPossibly this is the wrong sub to ask this question, and if so I apologize.  THANKS!",
        "created_utc": 1421813573,
        "upvote_ratio": ""
    },
    {
        "title": "I have a speculative theory about why the Jenny / Zack TIFU grabbed Reddit's attention.",
        "author": "Eternally65",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2t3tez/i_have_a_speculative_theory_about_why_the_jenny/",
        "text": "I think it was update #2, when the updates came at regular and relatively short intervals. It was more like a TV show, where we couldn't stop refreshing, just to see what else happened.\n\nNote: I don't believe it, but I enjoyed it immensely.",
        "created_utc": 1421795274,
        "upvote_ratio": ""
    },
    {
        "title": "Top Subreddits Whose Submissions Receive the Most Karma on Average by Pandering to Reddit",
        "author": "minimaxir",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2t282y/top_subreddits_whose_submissions_receive_the_most/",
        "text": "[Image Link](http://i.imgur.com/eLOEkf4.png)\n\nJust because these are the subreddits where you get the most absolute karma on average *doesn't mean that pandering is always the best option for a given subreddit*, which genuinely surprised me.\n\nTool is R/ggplot2. Data is from my database of all 142 Reddit submissions used previously.\n\nMethodology:\n\n1) Select the top 100 subreddits by submission volume. This is necessary for computational simplicity and for ensuring that the average for Reddit-titled submissions has a sane confidence interval.\n\n2) Find the average scores for each subreddit for submissions whose titles containing Reddit and titles which do not.\n\n3) Plot the Top 20 subreddits with the highest absolute value of points via pandering descending. (It is possible to fit more than 20 on the chart, but that would strongly affect readability)\n\nThe differences between the averages for Normal and Pandering submissions for each subreddit is statistically significant in most cases. (if the black 95% confidence interval bars do not overlap at any value, then the results are statistically significant. If they do overlap, then it's a *maybe* and hypothesis testing is necessary. /r/cringepics would likely fail the hypothesis test, for example.)\n\nIn most of these subreddits, pandering to Reddit causes slightly more points than nonpandering, but there are exceptions, especially in the case of /r/gifs.\n\nYou can access the data for all top 100 subreddits [in this Google Sheet](https://docs.google.com/spreadsheets/d/1GjjSfospgv63hs2ezjfbkevuJgIxN05_HSUrl3s3oKc/edit?usp=sharing)\n\n(bonus: this chart took two tries to make; [the first try](http://i.imgur.com/a6uWn2c.png) made my head hurt trying to read it so I remade it.)",
        "created_utc": 1421770519,
        "upvote_ratio": ""
    },
    {
        "title": "Changing link karma to post karma?",
        "author": "Atofy",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2t13fv/changing_link_karma_to_post_karma/",
        "text": "Seeing as how a lot of Reddit is not simply links, why can't users get karma for text posts? I was looking at the [the posts that blew up on TIFU](https://www.reddit.com/user/MyLifeSuxNow/submitted/]), and I was just annoyed at how he has 1 link karma. Does this even make any sense?",
        "created_utc": 1421739096,
        "upvote_ratio": ""
    },
    {
        "title": "Major Decrease in this Sub's activity. Is this common across reddit?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2t0sr9/major_decrease_in_this_subs_activity_is_this/",
        "text": "I remember a time when this sub was really active but now it seems to be dead. Why did that happen? Is it something particular to this sub or do most subs wax and then wane in popularity.",
        "created_utc": 1421731415,
        "upvote_ratio": ""
    },
    {
        "title": "How does weighting work with regard to what posts I see on my page? Seems almost arbitrary.",
        "author": "Death_Star_",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2szs9p/how_does_weighting_work_with_regard_to_what_posts/",
        "text": "I have at least 75 subreddits I'm subscribed to.\n\nAmong them are /r/AskDocs and /r/NFL.\n\nYesterday, my first 3-4 Reddit pages had like 5 or 6 /r/AskDocs posts that have 1 upvote (just from the poster) and zero comments.  Then, several high activity threads in /r/NFL did not even hit my first couple of pages. These posts are called \"Game Threads,\" which are SO big and active that they had to divide the game thread into 4 quarters (the 4 quarters of a game) had over 1,000 upvotes and close to 6,000 comments each.\n\nThis happens EVERY DAY. I constantly miss out on posts that get a ton of karma and discussion and get posts that have zero attention to them. \n\nI apologize if this isn't the place for this question -- I'm just baffled and lost, and I think we know that the Reddit search function is terrible.  But it doesn't matter, since googling \"reddit post weight subreddit\" didn't yield relevant results.\n\n**TL;DR -- While browsing my front pages, how is it that I get so many low attention, virtually meaningless 1-karma-point/zero-comment posts while I have so many meaningful 1k-karma/6k-comment threads ignored?**\n\nP.S. -- I know that I can unsubscribe to these subreddits, which I probably will.  But as usual for me, I'd like an explanation behind my actions before exercising them -- I need to know WHY it has been happening.  It's not just /r/AskDocs that floods my pages with meaningless posts, and it's not just /r/NFL that has a ton of meaningful posts that I miss.",
        "created_utc": 1421712263,
        "upvote_ratio": ""
    },
    {
        "title": "Does anybody submit articles en masse and consult the comments and/or votes as a way of sorting what's worth reading without necessarily having to read it?",
        "author": "ZiRALiX",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2syy9b/does_anybody_submit_articles_en_masse_and_consult/",
        "text": "\nI'm trying to think of alternate motivations for \"power-submitters.\" To just chalk it up to internet points is intensely cynical and sort of lazy, I think (not that I couldn't be wrong). So here's a theory. ",
        "created_utc": 1421698644,
        "upvote_ratio": ""
    },
    {
        "title": "Have PC gamers made gaming discussion more toxic on reddit?",
        "author": "EasySchmitty",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sxynm/have_pc_gamers_made_gaming_discussion_more_toxic/",
        "text": "",
        "created_utc": 1421682696,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think about subreddit mods \"locking\" a thread so that no further comments may be added?",
        "author": "t9s2137",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sx42u/what_do_you_think_about_subreddit_mods_locking_a/",
        "text": "I can't list names, but one particular large default subreddit locks threads from further participation, often before they are even 24 hours old. \n\nThe mods use auto-moderator as a tool to auto-remove every new comment to these locked threads, once they consider the primary question in the title to be sufficiently answered. Effectively locking everyone out and halting every discussion that was taking place within that thread. This is something they probably wouldn't have the tools to do without automoderator, and really a new level of using its power, compared to anything I've seen before. Sometimes hundreds of comments will just be wiped out.\n\nOccasionally the thread might appear a bit out of control with dubious information, but other times it seems they just don't want to continue moderating the comments being added to the thread. Either way it all grinds to a halt, and sometimes the explanation gives no justification.\n\nIt feels massively against the spirit of reddit to me, where relevant  conversations that spring up in a thread are often half the fun. It also feels like a really easy escape from doing the job of a moderator, when the obvious solution would be to get more moderators. \n\nRecently I was part way through an interesting discussion about sleep patterns with someone who seemed extremely knowledgeable on the subject, then the mods decided they'd had enough and shut the whole thread down.\n\nIf it wasn't a default subreddit I'd just go somewhere else. But it's a huge subreddit with a lot of interesting discussion at times, and I feel like a default sub should have to adhere to some higher standards beyond just doing what the hell they feel like.\n\nWanting to hear your thoughts. Is this acceptable modding for a default subreddit?",
        "created_utc": 1421657751,
        "upvote_ratio": ""
    },
    {
        "title": "Custom search filters to find your personal balance between hot, new, rising etc.",
        "author": "Exacting",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sx0vg/custom_search_filters_to_find_your_personal/",
        "text": "",
        "created_utc": 1421654703,
        "upvote_ratio": ""
    },
    {
        "title": "Why is reddit constantly displaying error/overloaded pages while sites like imgur almost never have problems?",
        "author": "echocage",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2svkin/why_is_reddit_constantly_displaying/",
        "text": "",
        "created_utc": 1421623648,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best way to discourage trolling?",
        "author": "GaiusAurus",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sv1tw/what_is_the_best_way_to_discourage_trolling/",
        "text": "Trolls are rampant on reddit, at least in the more popular subreddits. I've been thinking about this a bit and have come up with three solutions to discourage the trolls from trolling:\n\n1) Ignore them.\n\n- Pros: Trolls don't get gratification of either upvotes, downvotes, or, as pointed out [here](https://www.reddit.com/r/TheoryOfReddit/comments/1201lq/negative_karma_troll_receives_an_inciteful/), trophies caused by some upvoting and some downvoting.\n- Cons: It doesn't address the problem, it just says \"I don't see you, so you aren't there!\"\n\n2) Upvote them.\n\n- Pros: Doesn't give the gratification of downvotes.\n- Cons: Some trolls just want attention, and upvotes are attention, which will perpetuate and encourage their trolling. Their comments also become more visible within threads.\n\n3) Downvote them.\n\n- Pros: Their comments are less visible in threads.\n- Cons: This is what they want. It will encourage more trolling.\n\n4) Strict moderation and administration. (I.e. lots of bans and strict rules)\n\n- Pros: It will discourage the trolls.\n- Cons: Reddit turns away from a community, into a content-based site, not a user-based site. Reddit would quickly decline in popularity and fade away.\n\n5) Something else... What do you guys think?",
        "created_utc": 1421613667,
        "upvote_ratio": ""
    },
    {
        "title": "We should make a subreddit with no moderator intervention whatsoever, a bit like /r/EVEX.",
        "author": "BANGEXPLOSIVE",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sujpn/we_should_make_a_subreddit_with_no_moderator/",
        "text": "",
        "created_utc": 1421604438,
        "upvote_ratio": ""
    },
    {
        "title": "Top comments on Humans of New York posts always seem very \"reddit\"-esque. Any idea why?",
        "author": "ageo",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2su7fi/top_comments_on_humans_of_new_york_posts_always/",
        "text": "If you don't know what Humans of NY is, it's a Facebook page where a photographer takes pictures of people living in NY and gets a short story or quote from them. I've noticed that the top comments on these posts follow similar lines of thinking to Reddit comment threads. \n\n\nFor example, on this post:\n\nhttps://www.facebook.com/humansofnewyork/photos/a.102107073196735.4429.102099916530784/864889756918459/?type=1&amp;theater\n\nSome of the top comments include a pun, a \"better love story than Twilight\" joke, and a \"How I met your mother\" joke.\n \nI guess in a way, these posts and comments are somewhat like Reddit in the sense that the most liked comments are shot straight to the top. \n\nI'm just not used to seeing this kind of conversation on Facebook. Is this how most of the internet talks? Has Reddit vernacular seeped into other forms of social media? Vice versa?\n",
        "created_utc": 1421597681,
        "upvote_ratio": ""
    },
    {
        "title": "People are still heavily using downvotes to show disagreement. This needs to change.",
        "author": "rdbcasillas",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2stuxv/people_are_still_heavily_using_downvotes_to_show/",
        "text": "",
        "created_utc": 1421588307,
        "upvote_ratio": ""
    },
    {
        "title": "How might differences in cognition be impacting reddit?",
        "author": "hex_m_hell",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sth7i/how_might_differences_in_cognition_be_impacting/",
        "text": "I'm starting to realize I might be a little ADHD. A friend of mine pointed it out a while back and I finally ended up researching it a bit.\n\nOne of the things I thought was interesting was that reddit is basically ADHD candy. Comments and posts can be crafted to get near instant positive or negative reinforcement. Data that is crafted for redditors who are ADHD is the most likely to become front page (image macros, pictures, well titled articles especially ones that are easy to parse). Even some of the cultural memes of reddit reflect an aspect of ADHD (\"you didn't read the article, did you?\", \"I should go to bed but I'm still on reddit... 8 hours later\").\n\nBut maybe we're all ADHD to some degree. One of my partners was synesthetic, so I ended up researching that a bit at one point. That's kind of an interesting thing in and of itself. All humans are synesthetic to some degree as demonstrated by \"Bouba and Kiki\". Likewise, people can be put in to situations that reduce their empathetic reactions, so in a we, all have the capacity to express sociopathy. It kind of follows that if you think about it, there's some level of cognitive experience thats shared by all of us where some of us some portions are magnified.\n\nSeveral questions naturally fall out of this...\n\n* Might reddit itself be biased toward specific types of cognitive experience?  \n* How might that impact the memes and the user base?  \n* What cognitive experiences might be magnified by reddit?  \n* How might reddit content or even the reddit experience be impacted by users with shared cognitive traits?  \n* Is there a feedback loop between how people experience reddit, the requests they make about changing it, and the people who join reddit?  \n\ntl;dr: How do people's different ways of experiencing the world show up on reddit and impact what reddit is.",
        "created_utc": 1421572593,
        "upvote_ratio": ""
    },
    {
        "title": "A note on subreddit redirection and the division of subreddits",
        "author": "Yanmega",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2squkn/a_note_on_subreddit_redirection_and_the_division/",
        "text": "So, there's a trend that's been going on for a while, a lot of the time in advice or maybe askreddit threads, where people use subreddit shortlinks as referrals. E.g., a person goes \"Oh, I've always wanted to travel,\" and someone will go \"/r/shoestring or /r/travel is that way\" or \"head on over to [subreddit].\" \n\n\nThis sort of referral isn't really problematic in a sense, just people acting as librarians, and the subreddits as sort of a Dewey Decimal for referral links and help (most notably wikis and sidebar posts). But it's kind of lazy commentating when it's just a subreddit link- which brings me to my next point.\n\n\nThere are a *lot* of subs on reddit. I'm talking, like, maximum overdrive amounts of subs. There's a sub for everything, and if there isn't one, one will be created (usually following a false link, like \"oh well you'd want /r/bigducks, not /r/horseducks,\" followed by \"/r/bigducks doesn't exist\" and then a follow up with \"it does now.\")\n\n\nBut pretty soon, the vast amount of specific subs leads more general subs to push content there. In a period of /r/pokemon, the sub became a crossroads with a big old road sign of commenters telling you your content didn't belong here, go to x-related sub for these posts. \n\n\nIn some cases, this kind of divying up of content can help. To use /r/pokemon again, following the release of X and Y, people made threads that cluttered up the sub asking for friend codes, as it was beneficial to a function in the game. Now, friend codes are exclusively in /r/friendsafari, and it worked out well, since the sub became active. But what about other subs? [Just look at the massive amounts of related pokemon subs](http://www.reddit.com/r/pokemon/wiki/related_subreddits). And that's just an official count. \n\n\nI'm going to continue using video gaming subreddits, since they're pretty simplistic in nature. /r/smashbros is dedicated to a catchall of smashbros- except art. Art as been banned from the sub, and delegated to /r/smashart. But /r/smashart only has a fraction of the activity /r/smashbros has. Content is less likely to be seen. This is only for karma, which some people view as problematic (e.g. people don't like it when people post solely for karma). But what about questions? I had an issue with an emulated version of the game, and was redirected to a less active subreddit about emulations where my question was never answered. \n\nTo be able to redirect certain kinds of posts to different subreddits, the topic has to be able to sustain a regular community, otherwise no one wins- the mods are stuck removing posts, commentators are redirecting and referring, and people asking questions/losing content don't get any discussion or answers.\n\n\nSorry for the long post, but what are your thoughts?",
        "created_utc": 1421514076,
        "upvote_ratio": ""
    },
    {
        "title": "People say imgur is nicer but...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sozzx/people_say_imgur_is_nicer_but/",
        "text": "There's lots of people that say imgur is nicer than reddit and that reddit is judgemental but my experience says otherwise. I've been on reddit for a month now and only one person has criticized me. I posted my first(and only) thing on imgur and in 30 minutes, 4 people had already teamed up to criticize me. Anyone else have any other stories?",
        "created_utc": 1421459846,
        "upvote_ratio": ""
    },
    {
        "title": "\"Autistic\" being thrown around more and more.",
        "author": "WW4O",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2snmb3/autistic_being_thrown_around_more_and_more/",
        "text": "Different words come and go as offensive pejoratives. \"That's gay,\" \"That's retarded,\" etc. On Reddit over the past year, I've noticed that the term \"autistic\" is being used more and more as a pejorative, and that calling anyone slightly awkward \"autistic\" has become almost completely socially acceptable. \n\nAm I the only one noticing/bothered by this? \n",
        "created_utc": 1421434876,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit and negative social media strategy",
        "author": "hotel_for_elise",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sn9np/reddit_and_negative_social_media_strategy/",
        "text": "Recently, the CEO of Nissan did an AMA, and was accused of having new accounts made to ask easy, uncontroversial questions, and answering them [here.](http://www.reddit.com/r/IAmA/comments/2s7obx/im_the_ceo_of_renault_and_nissan_and_were_making/) Only several of the questions he answered were from new accounts, but enough to kill the AMA and hurt Nissan's image. \n\nThis isn't the first time such accusations have happened, and it got me thinking about ways individuals and organizations could sabotage AMAs, likely organizations they despise or compete with. I thought of several ways. A simple example would be having a large number of accounts downvoting the post. A more intricate one would be to make new accounts that appear to be made by the posting companies PR people, ask very easy questions with those accounts, and having those accounts upvoted heavily by bot accounts to set up the AMA for accusations.\n\nHas anything like this ever occurred before, and are there any ways reddit can prevent this sort of thing? I would ask how you guys think people could ruin AMAs, but would then risk accusations of me being a bad-intentioned PR employee (nonsense, I'm obviously just the Nissan CEO seeking retribution)!",
        "created_utc": 1421428982,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think about the mods at ELI5 \"locking\" threads after the title question has been suitably answered? (in their view) Do you think it's appropriate for them to effectively halt every interesting discussion that was happening within a huge thread?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2slsyd/what_do_you_think_about_the_mods_at_eli5_locking/",
        "text": "",
        "created_utc": 1421389890,
        "upvote_ratio": ""
    },
    {
        "title": "What is going on in this topic?",
        "author": "jokul",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sl0el/what_is_going_on_in_this_topic/",
        "text": "",
        "created_utc": 1421373336,
        "upvote_ratio": ""
    },
    {
        "title": "Why is /u/maxwellhill allowed to spam?",
        "author": "mellokind",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2skk9y/why_is_umaxwellhill_allowed_to_spam/",
        "text": "",
        "created_utc": 1421365128,
        "upvote_ratio": ""
    },
    {
        "title": "Why is /u/maxwellhill allowed to spam?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2skd62/why_is_umaxwellhill_allowed_to_spam/",
        "text": "",
        "created_utc": 1421361727,
        "upvote_ratio": ""
    },
    {
        "title": "Why do controversial comments oscillate in a range of about 3 points when the page is refreshed?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sk10v/why_do_controversial_comments_oscillate_in_a/",
        "text": "It isn't people voting. I checked using an archived comment, and got results along the lines of 4,5,5,5,5,4,4,6,4,5,4,6,5,6,4,6,6... etc.",
        "created_utc": 1421356202,
        "upvote_ratio": ""
    },
    {
        "title": "Comment Chains",
        "author": "9084fcj0934",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sjdtx/comment_chains/",
        "text": "",
        "created_utc": 1421345995,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone done an analysis to determine what comment level in a thread typically receives reddit gold most often?",
        "author": "wickedmath",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2siysw/has_anyone_done_an_analysis_to_determine_what/",
        "text": "I was reading an AskReddit post and noticed that a lot of third-level comments had received gold.  It seemed like the trend was Story &gt; Clarifying Question &gt; Joke Answer.\n\nI'm just curious if anyone has ever dug into this to see what the most-gilded level of comment thread was.  Let's say that the post itself is level 0, a thread-starter is level 1, and so on from there.",
        "created_utc": 1421338931,
        "upvote_ratio": ""
    },
    {
        "title": "when someone gets exposed as stealing other user's content the moderator should not delete the thread but delete his karma",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sio8q/when_someone_gets_exposed_as_stealing_other_users/",
        "text": "",
        "created_utc": 1421333459,
        "upvote_ratio": ""
    },
    {
        "title": "when someone gets exposed as stealing other user's content, the moderator should not delete the thread but delete his karma !",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sin6p/when_someone_gets_exposed_as_stealing_other_users/",
        "text": "",
        "created_utc": 1421332857,
        "upvote_ratio": ""
    },
    {
        "title": "Why does nobody ever admit they are wrong?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2shz2v/why_does_nobody_ever_admit_they_are_wrong/",
        "text": "I've had a lot of arguments on reddit and I'm sure I've been wrong my fair share but I've never had a single person admit they were wrong in an argument. And except for a couple of cases where I made a factual error that could be proven, I don't think I've ever done it either.\n\nThe second there is disagreement it's like a battle each side is trying to win. It's not even about who is right or wrong anymore. Neither side ever for a second considers the arguments of the other side. They just try to refute them. They just try to win. The argument only ends when one side gets bored and stops responding.\n\nWhy do we do this? How can we fix it?",
        "created_utc": 1421311603,
        "upvote_ratio": ""
    },
    {
        "title": "The attractive regular thread phenomenon",
        "author": "karmabreak",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sfft4/the_attractive_regular_thread_phenomenon/",
        "text": "So I noticed a reddit phenomenon that occured on a few subreddits and would like to share it with you guys cuz I thought you might find it interesting. I call it the **attractive regular thread phenomenon** and it occurs on AutoModerator (or equivalent) regular threads. What happens is that the subreddit is very little or very differently used by its users outside of these threads. For example, the thread will 300 comments whilst other posts will get 5 or 10. Let me give you a few examples.\n\nAll **[Official]** posts on /r/makinghiphop\n\nMe monday threads on /r/LGBTeens and any other subreddit that has them\n\nSo that's pretty much all I wanted to say, just a petty constatation of a phenomenon. I don't have any other examples but I'm sure there's more.",
        "created_utc": 1421262153,
        "upvote_ratio": ""
    },
    {
        "title": "/r/climate begins its death spiral.",
        "author": "butch123",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2scvcp/rclimate_begins_its_death_spiral/",
        "text": "",
        "created_utc": 1421203462,
        "upvote_ratio": ""
    },
    {
        "title": "r/Redditgetsdrawn is run by the gestapo",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2scobz/rredditgetsdrawn_is_run_by_the_gestapo/",
        "text": "This sub reddit is so heavily moderated that it sucks to even comment there. http://imgur.com/a/iawcu",
        "created_utc": 1421200044,
        "upvote_ratio": ""
    },
    {
        "title": "How hard is it to make the front page? What has to happen? I'm a light user who made the front page accidentally and been curious how significant that was.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sbl1h/how_hard_is_it_to_make_the_front_page_what_has_to/",
        "text": "nQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIutCnQyGVF3WofpfqR423Ie3su6ubWN5zqN3IIYmL89prGczTM1KRugblFaYJSIu",
        "created_utc": 1421182412,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a light user who made the front page of reddit by accident the other day. Just been curious how significant really was that? What needed to happen? How difficult was it really?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sbj4y/im_a_light_user_who_made_the_front_page_of_reddit/",
        "text": "I also think this can shed some light on the nature of the site and how it works so I was intrigued, but I've done some research since hitting the front page and not been able to really get a more concrete or specific sense of how hard it actually is? I became familiar with some of the alogorithms and what not. But I still didn't have a way to really gauge anything. \n\nHow many other posts do you have to \"beat\" per se? About how many people would have upvoted it approximately? What are the statistical chances of doing it twice? How many posts hit front page in a day? Hundreds? (Not thousands surely.) And how does that reflect the level of competitiveness? \n\nShould I put this on my resume? Or do things this \"uncommon\" actually happen to me all the time in daily life? Like today I needed to talk to someone, then I randomly saw that exact person later walking down the hallway. What a great coincidence. But I fear front page status may be no more incredible than something like that. \n\nYes I know those questions are loosely framed and unqualified. But you smell what I'm stepin' in. Any help would be awesome. ",
        "created_utc": 1421181629,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a light user who made it to the front page the other day by accident with a dumb post. Just for curiosity how significant that was? What has to happen to get to the front and how difficult is is it? Because to me this question sheds a lot of light on nature of the website.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2sbf2k/im_a_light_user_who_made_it_to_the_front_page_the/",
        "text": "",
        "created_utc": 1421179954,
        "upvote_ratio": ""
    },
    {
        "title": "Does early vote fuzzing (fuzzing by 1 or a few votes) prompt anyone else to refresh the page a series of times to find the average? How likely is it that anyone looking to ascertain exact tallies in early stages of voting is not doing this same easy same thing programmatically-just adding bandwidth?",
        "author": "Tezcatlipokemon",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2saqev/does_early_vote_fuzzing_fuzzing_by_1_or_a_few/",
        "text": "First and foremost, am I the only sad soul who likes non-fuzzed numbers bad enough to do this or is this a frequent practice? \n\nCan fuzzing truly be an effective countermeasure at this level?  It's certainly a very easy pattern to figure out.  So I have to send 6 or so page requests to unfuzz the votes with reliability? So what? No big deal to me, it's all automated and votes at this point in the voting almost always trickle in slow enough that I won't lose anything. \n\nAnd if it's not truly helping there, why not show it to users?  Even at just a few votes fuzzed, with so few votes tallied couldn't the difference between 74% upvoted vs. 85% upvoted tell me something about the appropriateness of my post for the audience? ",
        "created_utc": 1421169005,
        "upvote_ratio": ""
    },
    {
        "title": "Is /r/IAMA effectively run by reddit itself? Do they get money for AMAs?",
        "author": "wasmachien",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2saep3/is_riama_effectively_run_by_reddit_itself_do_they/",
        "text": "Not sure if this is appropriate for this subreddit, but here goes.\n\nAre the big AMAs all organized and handled by reddit itself? Does reddit get anything in return for doing this, or is it just quid pro quo? \n\nI would guess that, if it's not the case, they have at least considered going this route, since it would be a good way to ensure a steady income. What do you think?\n\n",
        "created_utc": 1421163571,
        "upvote_ratio": ""
    },
    {
        "title": "I assembled an infographic in response to a thread on eternal september. Then I made another one. I think something like this should be on the sidebar of ToR.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s8xb2/i_assembled_an_infographic_in_response_to_a/",
        "text": "[First one](http://i.imgur.com/L7bBHPM.png)\n\n[Second one](http://i.imgur.com/otK79ly.jpg)\n\nPeople keep bringing this stuff up all the time and I figure it would be helpful to just have a static explanation of Eternal September and the 90-9-1 rule on the sidebar here, since it is related to internet communities.  I'm not great at digital design but the initial feedback on the first one was positive, I think there's some value here.",
        "created_utc": 1421123550,
        "upvote_ratio": ""
    },
    {
        "title": "An observation about AMAs",
        "author": "newtothelyte",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s8u66/an_observation_about_amas/",
        "text": "\n\nMany people believe the AMA to be a tool for promotion, but as shown by this AMA you can be too big for an AMA. So much so that it becomes a disaster. If you are in a position where you can not be 100% honest and upfront, people will call you out and more often than not it finds its way to the top. \n\nSee the Nissan CEO AMA today. http://www.reddit.com/r/IAmA/comments/2s7obx/im_the_ceo_of_renault_and_nissan_and_were_making/\n\nNow had he labelled it AMAA, he is given the freedom to answer whichever questions he wants but not many people use it. ",
        "created_utc": 1421121738,
        "upvote_ratio": ""
    },
    {
        "title": "Do you often downvote comments you agree with based on tone?",
        "author": "Sutartsore",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s75bc/do_you_often_downvote_comments_you_agree_with/",
        "text": "If someone is debating for my side (usually on really divisive matters of opinion like religion or politics) it paints me in a bad light if they're antagonistic/smug/arrogant about it.  I believe it just causes the opposition to entrench further into their original position rather than be receptive or willing to concede anything, so it winds up hindering hope of a real discussion arising out of the exchange.\n\nLately I've found myself regularly downvoting people who I think are right solely because they're unwelcoming and probably aren't going to convince anyone who isn't already with them.\n\nI know that's partially how votes \"should\" be cast as far as reddiquette is concerned, but how often does the average user use them that way?  I'd love some kind of sideways vote to convey \"Sure, yeah, but don't be a dick about it.\"",
        "created_utc": 1421092810,
        "upvote_ratio": ""
    },
    {
        "title": "Let's discuss how reddit's default front page system could be done away with",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s6czh/lets_discuss_how_reddits_default_front_page/",
        "text": "",
        "created_utc": 1421079693,
        "upvote_ratio": ""
    },
    {
        "title": "Over half of all reddit posts go completely ignored",
        "author": "SobanSa",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s5o7y/over_half_of_all_reddit_posts_go_completely/",
        "text": "According to [this information](http://www.reddit.com/r/dataisbeautiful/comments/2s2j0t/over_half_of_all_reddit_posts_go_completely/) posted over in Data Is Beautiful, it is shown that half of all Reddit submissions are ignored or downvoted. I will be laughing my ass off if this is one of them.",
        "created_utc": 1421063574,
        "upvote_ratio": ""
    },
    {
        "title": "I've thought for a while people were more apt to upvote admitting mistakes, rather than arguing them or deleting your post.",
        "author": "dtrmp4",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s548e/ive_thought_for_a_while_people_were_more_apt_to/",
        "text": "So there was a post recently about [this fuckhead] (http://www.reddit.com/r/JusticePorn/comments/2s2d87/put_em_in_a_coffin_douchebag_who_made_a_series_of/) getting arrested. One of the comments mentioned that he had to pay $25,000 dollars to get out.\n\nWhen I tried expanding it via RES, I only got his picture rather than the article, so I posted that he only had to pay 10%-ish or $2500 to get out on bail.\n\nI was immediately downvoted, and a response said his bail was $250,000, so $25,000.\n\nHere is my post now, with 17 upvotes:\n\n&gt;You only have to pay like 10% of the bail to get out.\n\n&gt;edit: oops. didn't realize bail was set at $250,000. Downvote away!\n\n&gt;edit2: I was at like -5 when I first edited. I very rarely delete my posts, so thanks for the upvotes!\n\nWhen I was negative, I thought about just deleting it after actually reading the article...but I don't really care about downvotes, and only delete insanely drunken inane posts the next day. Occasionally. Rarely though. I usually just let them stay. I cared for half a second when I was stuck at 8999 karma, but lost a few. Then I passed 9000 with that post. \n\nThere might be a discussion here. Some people delete their posts before I view them, and I always wonder what they could've said to bother deleting it. Karma has no value, so if I make a \"stupid\" post, I just edit it or continue to respond. In this case, I edited it while negative, and I was at +15 before my 2nd edit.",
        "created_utc": 1421044871,
        "upvote_ratio": ""
    },
    {
        "title": "What interests reddit? A network analysis of 84M comments by 200K users",
        "author": "cronbachs_beta",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s4iry/what_interests_reddit_a_network_analysis_of_84m/",
        "text": "A few weeks back I completed a text analysis of a large number of reddit comments. To state the methods briefly, I scraped all available comments for a set of ~200k redditors using [PRAW](https://praw.readthedocs.org/en/v2.1.19/). After removing stops words, highly infrequent words, and a few other things from the comments, I calculated the degree to which the remaining words co-occurred within the same redditors (i.e. if someone used the word 'skiing' frequently, did they also use the word 'traveling' frequently?). \n\nUsing this information, I constructed social network graphs to help explore the relationships between between topics of discussion. Related clusters of topics (known as communities in social network jargon) were identified with a walktrap algorithm. The full methods and resulting visualizations can be seen [here](http://markallenthornton.com/blog/what-interests-reddit/).\n\nThe results suggest that at a coarse level, there are 12 different interest groups of varying size on reddit:\n\n* Government\n* Technology\n* Gaming &amp; Sports\n* Music\n* Language learning\n* (Narrative) entertainment\n* Food and drink\n* Healthy living / dieting\n* Sex and relationships\n* Philosophy\n* Quotidean issues\n* reddit itself\n\nNote that these labels are my own imperfect subjective interpretations, so take them for what they're worth. On average, people mentioning a term from one of these topics are more likely to mention other terms from that topic than terms from another topic. The extent of this isolation varies from group to group, however. For example, the people talking about 'cars' (in the quotidean group) are also talking about a wide variety of other topics, while those focusing on dieting seem to have few other interests on reddit.\n\nI would be very interested to hear any speculation on the nature of the people who actually populate these interest groups! For example, do you think they can largely be traced back to demographic differences (e.g. age, SES), or are other factors that lead to the emergence of this structure in redditors' interests? Any interesting suggestions about how to test such hypotheses (in terms of the comment text) would also be more than welcome.",
        "created_utc": 1421031418,
        "upvote_ratio": ""
    },
    {
        "title": "Has the Reddit sorting algorithm changed? What could the possible effects be?",
        "author": "20002001",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s48vu/has_the_reddit_sorting_algorithm_changed_what/",
        "text": "",
        "created_utc": 1421026071,
        "upvote_ratio": ""
    },
    {
        "title": "/r/philosophy holds a discussion about itself",
        "author": "tesdfsa3",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s33sa/rphilosophy_holds_a_discussion_about_itself/",
        "text": "http://np.reddit.com/r/philosophy/comments/2s1yp9/meta_im_a_long_time_reader_and_im_shocked_by_the/\n\nAccording to the popular opinion in this post, /r/philosophy has gone downwards. Most posts point that since becoming a default sub this slope started. The problem in philosophy is especially that everyone thinks they can do it, which is correct, but idle musing mixed with discussion isn't going very well. That's probably why academy is using frameworks post arguments, which people coming from the front page don't know. /r/Showerthoughts solves some of those problems. \n\nIt basically boils down to mixing people deep in field with one from the outside. Other example probably include /r/math, /r/history, /r/science and each of their ask- subreddits. In those it's easier have a strict rule about sources, but still so many /r/science posts which hit the front page have sensationalized titles. \n\n\nHow do you manage a subreddit which both welcomes new user, but at the same time stays worthwhile for the core members, which built the sub? Or do you follow the majority and have every default subreddit converge to one point?",
        "created_utc": 1421005253,
        "upvote_ratio": ""
    },
    {
        "title": "Should admins of subreddits be able to veto being made a default?",
        "author": "NicolasGuacamole",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s2qx2/should_admins_of_subreddits_be_able_to_veto_being/",
        "text": "The obvious example being /r/TwoXChromosomes, many people believe that since becoming a default this sub has deteriorated in quality.\n\nThe question stands, should subs be allowed to reject being made a default if they fear this will damage the integrity of their sub?",
        "created_utc": 1420998582,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] What is /r/Fifthworldpics?",
        "author": "BengalClaws",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2s1tgj/question_what_is_rfifthworldpics/",
        "text": "",
        "created_utc": 1420971138,
        "upvote_ratio": ""
    },
    {
        "title": "If Reddit is so against reposts, why is it whenever an SR-71 story comes up, Brian Shul's Sleddriver story is posted in the comments?",
        "author": "enzo32ferrari",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rztfj/if_reddit_is_so_against_reposts_why_is_it/",
        "text": "There's even a [bot](http://www.reddit.com/user/sr71Bot) that posts the story.\n\nWhile some posts are downvoted, the overall attitude to the post is that \"it never gets old\"",
        "created_utc": 1420922737,
        "upvote_ratio": ""
    },
    {
        "title": "I created an \"evolving subreddit\". Come check it out!",
        "author": "Bossman1086",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rw5pt/i_created_an_evolving_subreddit_come_check_it_out/",
        "text": "/u/JAV0K came up with the idea for this in a [post](https://www.reddit.com/r/TheoryOfReddit/comments/2rqsue/what_would_happen_if_we_created_an_evolving/) on this sub yesterday. I thought it was an interesting idea and went ahead and created it. I thought people here might be interested in checking it out. I'm also open to suggestions on where to post it to to get attention and subscribers. You can find it over at /r/EVEX (abbreviation of \"evolution experiment\"). Also, if you have experience as a moderator and are interested in helping out on the sub, PM me!\n\nMaybe this will die a quick death. Hell, maybe no one will actually be interested and it won't even take off. But I loved the idea of this just as an experiment. And if there's a chance that it could play out and end up working, I think it's worth trying. Hope you come check it out. Feel free to subscribe and start submitting!",
        "created_utc": 1420835439,
        "upvote_ratio": ""
    },
    {
        "title": "A sob story in /r/pics and the same pic without the sob story in /r/aww: a difference of &gt;5600 points.",
        "author": "Doomed",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rvz3n/a_sob_story_in_rpics_and_the_same_pic_without_the/",
        "text": "http://np.reddit.com/r/pics/comments/2rv3vw/this_is_my_dog_bentley_he_died_two_days_ago_after/\n\nhttp://np.reddit.com/r/aww/comments/2d312q/adventure_dog_and_the_mountain_rains/\n\nMore info: http://np.reddit.com/r/no_sob_story/comments/2rvf3x/dog/\n\nPics is such an awful subreddit and most of its subscribers don't care. IMO, it should be renamed to /r/stories or something similar and a new /r/pics should be made that's actually about pictures.\n\nI don't have much to say about this, just that it demonstrates that, in the absence of moderation, user-made titles inevitably approach the most \"engaging\" style of headline, where description and fact are replaced by emotion and personal appeal. (See: Buzzfeed)\n\nedit: A sob story doesn't need to be false to be a sob story. I believe the OP's story, and it's quite sad. There should be a subreddit for such stories. I don't think that subreddit should be called \"pics\".",
        "created_utc": 1420832336,
        "upvote_ratio": ""
    },
    {
        "title": "OC Reddit Submissions receive almost double the score on average than non-OC submissions",
        "author": "minimaxir",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rv7jl/oc_reddit_submissions_receive_almost_double_the/",
        "text": "[Image](http://i.imgur.com/3iudvZ8.png)\n\nData is from my database of all 142M Reddit submissions. [OC] submissions were determined by finding \"[OC]\" in the submission title:\n\n\n\tSELECT date_trunc('month', created_at) AS sub_date,\n\tCOUNT(date_trunc('month', created_at)) as num_submissions,\n\tCASE WHEN title LIKE '%[OC]%' THEN '[OC]' ELSE 'Not OC' END AS is_oc,\n\tAVG(score) as avg_points,\n\tSTDDEV(score) / SQRT(COUNT(is_oc)) AS se_points,\n\tAVG(num_comments) as avg_comments,\n\tSTDDEV(num_comments) / SQRT(COUNT(is_oc)) AS se_comments\n\tFROM submissions\n\tGROUP BY sub_date, is_oc\n\tORDER BY sub_date\n\n[Which results in this data output](https://docs.google.com/spreadsheets/d/1V7sOVwm8vZg0oAmLlsvjC9xFCQbfOdlQ9bXioj_2L4M/edit?usp=sharing).\n\nThe reason I did a time series as opposed to a bar chart is to show how the ratio between scores of OC vs. Not OC posts has changed over time. [or rather, hasn't changed much]. I started at Jan 2012 because there is zero data for OC posts before then (by Oct 2014, there are more than 10,000 [OC] per month). It also shows the confidence intervals more clearly too.\n\nTwo statistical notes:\n\n1) [OC] submissions by construction aren't spam; Not OC posts may have a lot of spam so that would bring that average down.\n\n2) Not all OC posts are explicitly tagged as [OC]. That's why the confidence intervals are necessary for the posts that we know are OC. (we have enough to say that the ratio is about double even in worst case)",
        "created_utc": 1420819463,
        "upvote_ratio": ""
    },
    {
        "title": "Why do links still end up in my \"Recently viewed links\" when I open them in a new incognito window?",
        "author": "regularly-lies",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2ruqbe/why_do_links_still_end_up_in_my_recently_viewed/",
        "text": "Sometimes I don't want to leave the things I come across here in my browser history, so I right-click and open them in a new incognito window in Chrome. However, these links still end up in my list of \"Recently viewed links\", even though I'm not logged in in the incognito window and the normal window where I am logged in shouldn't know that the link was clicked. What voodoo makes this happen?",
        "created_utc": 1420808771,
        "upvote_ratio": ""
    },
    {
        "title": "Clickbait articles taken from r/askreddit [x-post r/IdeasForAskreddit]",
        "author": "sonicfirestorm212",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2ruhhn/clickbait_articles_taken_from_raskreddit_xpost/",
        "text": "",
        "created_utc": 1420800357,
        "upvote_ratio": ""
    },
    {
        "title": "Charlie Hebdo cartoons should have ranked higher on Reddit.",
        "author": "Anti-personnel",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rstff/charlie_hebdo_cartoons_should_have_ranked_higher/",
        "text": "",
        "created_utc": 1420761346,
        "upvote_ratio": ""
    },
    {
        "title": "Why must reddit randomly act like I am not subscribed to a subreddit, then bring it back at some other time?",
        "author": "ivyleague481",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rs9pe/why_must_reddit_randomly_act_like_i_am_not/",
        "text": "",
        "created_utc": 1420752205,
        "upvote_ratio": ""
    },
    {
        "title": "What is the algorithm for trending sub-reddits? Are they selected manually?",
        "author": "heterosis",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rrgqo/what_is_the_algorithm_for_trending_subreddits_are/",
        "text": "Yesterday the new sub /r/drawmuhammad got a lot of subscribers and highly rated posts.  I was sure that it would show up in todays \"trending subreddits\", but no:\n\nhttp://www.reddit.com/r/trendingsubreddits/comments/2rq6u1/trending_subreddits_for_20150108_ragentcarter/\n\nWhen other new subs get traction (even far less) they do show up as trending see /r/ThePhenomenon here:\n\nhttp://www.reddit.com/r/trendingsubreddits/comments/2r34x3/trending_subreddits_for_20150102_rpcmasterrace/\n\nWhat gives?",
        "created_utc": 1420739077,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if we created an evolving subreddit. A subreddit where anything goes, but once a week users vote on what type of posts should be banned. Over time time the subreddit will evolve to become what its community wants.",
        "author": "JAV0K",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rqsue/what_would_happen_if_we_created_an_evolving/",
        "text": "I got this idea through /r/funny. A long time ago the mods asked the community what type of content they wanted to be banned. Soon many types were no longer allowed and as a result /r/funny changed a lot.\n\nNow what if you apply this concept on a weekly basis. The first week will be anything goes and for sake of this experiment anything will. Including porn, self promotion, all memes, selfposts, sfw porn etc. No guidelines whatsoever, the votes will decide. All of this is accompanied by a stickied post in which people give suggestions on what they don't want to see.\n\nAt the end of the week all suggestions will be thrown into a [Google Form](https://docs.google.com/forms) and users will have two days to vote. After that all the suggestions with a majority vote are now banned.\n\nA new suggestion thread is made featuring all the previous bans and the process starts all over again, week after week. And after a while it will become obvious what the public wants. This would require major moderation of course.\n\nNow as diverse as Reddit is this can result in great failure and the sub is dead after the first vote or everything goes great and we will see new categories we previously didn't know existed.\n\nIf it seems like a worthy experiment, maybe we should try it out.\n\nEdit: clarification \n\nEDIT: We are doing this, join us at /r/EVEX (Evolution Experiment)!",
        "created_utc": 1420726599,
        "upvote_ratio": ""
    },
    {
        "title": "Why doesn't Reddit expand on the 'social platform part' of it, allowing more connection with friends and family - and compete against facebook as the biggest social platform?",
        "author": "karlkristiansen",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2ro858/why_doesnt_reddit_expand_on_the_social_platform/",
        "text": "",
        "created_utc": 1420667274,
        "upvote_ratio": ""
    },
    {
        "title": "What if a vengeful user systematically downvotes all your content? Does Reddit compensate \"vote manipulation\"?",
        "author": "SnowGabe",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2ro84b/what_if_a_vengeful_user_systematically_downvotes/",
        "text": "Sometimes I see a claim in the comments where user threats to \"downvote everything\" the redditor has posted. I hope that Reddit has a way to prevent this.",
        "created_utc": 1420667263,
        "upvote_ratio": ""
    },
    {
        "title": "How will users utilize their custom reddit alien avatar?",
        "author": "316nuts",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2ro7yl/how_will_users_utilize_their_custom_reddit_alien/",
        "text": "http://www.reddit.com/r/blog/comments/2rnf1z/create_your_own_reddit_alien_avatar_with_reddit/\n\nIt's easy to dismiss a personalized avatar as a something new to play with.  However, it has the capacity to communicate some direct visual cues as to the identity of the person behind the screen.  Custom colors can be used to identify race.  Some of stuff you wear or hold, while stereotypical, can be used to identify gender (or gender stereotypes).\n\nThis information could be inferred before, depending on how open the user was about this information.  The new snoo customization could still be misleading, but will offer a somewhat non-direct method of communicating a lot of personal information about the user, or how the user identifies.\n\nHow do you think users will use their snoo to communicate to other users?\n\nWill you use your snoo as a \"way to communicate\" with others about your identity, or treat it as a joke?",
        "created_utc": 1420667186,
        "upvote_ratio": ""
    },
    {
        "title": "What if a vengeful user systematically downvotes all your content? Does Reddit compensate \"vote manipulation\"?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2ro5yn/what_if_a_vengeful_user_systematically_downvotes/",
        "text": "",
        "created_utc": 1420666351,
        "upvote_ratio": ""
    },
    {
        "title": "Entire profile history downvoted... but comment karma goes up.",
        "author": "dandykong",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rnqrj/entire_profile_history_downvoted_but_comment/",
        "text": "",
        "created_utc": 1420659610,
        "upvote_ratio": ""
    },
    {
        "title": "Why does youtube have such problems with \"Fedora Trolls\" while on reddit, although joked about, are practically non-existent",
        "author": "echocage",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rniww/why_does_youtube_have_such_problems_with_fedora/",
        "text": "Does youtube voting somehow not count downvotes as heavily as reddit does or are people just not downvoting them?",
        "created_utc": 1420656104,
        "upvote_ratio": ""
    },
    {
        "title": "From +219 to -4 within thirty minutes - a bizarre difference in the same comment in two threads about the exact same topic.",
        "author": "girafa",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rlfua/from_219_to_4_within_thirty_minutes_a_bizarre/",
        "text": "/r/Movies mod here. Thought this was interesting.\n\nAnt-Man trailer came out earlier tonight. Our standard operation is to kill all reposts and leave up the first **official** youtube link. We mucked up though, one of our mods pulled an official one (Post A) and left its repost (Post B) up for thirty minutes. That meant some users noticed, the original submitter asked in modmail why his was pulled, etc. I then took down the second one (Post B) and restored the first (Post A). When I did that, Post B was at about 450 upvotes, and the top comment was at +219.\n\nI messaged both submitters and the top commenter about the switch, and was met with civil understanding by all three.\n\nThe top commenter then posted his comment in Post A, and within a few minutes was in the negatives.\n\nSo all within 30 minutes users [loved](http://np.reddit.com/r/movies/comments/2rl66r/1st_full_look_at_antman_marvels_antman_teaser_156/cngw721) then [hated](http://np.reddit.com/r/movies/comments/2rl5r7/marvels_antman_official_teaser_trailer_2015/cngx71h) his humor.",
        "created_utc": 1420604867,
        "upvote_ratio": ""
    },
    {
        "title": "What is the fastest shrinking subreddit?",
        "author": "ColdplayParadise",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rk59e/what_is_the_fastest_shrinking_subreddit/",
        "text": "So i was posting this question some days ago on AskReddit, but i would like to know what subreddit that actually is shrinking, in subscriber amount.",
        "created_utc": 1420581713,
        "upvote_ratio": ""
    },
    {
        "title": "Why is /r/promos forbidden?",
        "author": "ColdplayParadise",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rjrh4/why_is_rpromos_forbidden/",
        "text": "",
        "created_utc": 1420575602,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly is the Front Page of Reddit?",
        "author": "RunDNA",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rjr1f/what_exactly_is_the_front_page_of_reddit/",
        "text": "This may seem a trivial question, but people are always commenting about a particular post making the Front Page, and that gets me wondering how exactly we define whether a post has made the Front Page or not.\n\nThe answer may seem obvious, but there are two complicating factors:\n\n1) The number of posts on the Front Page. Some people's Front Pages only have 25 posts (eg. non-logged-on lurkers), while other people have 100 posts (eg. gilded people.)\n\n2) The subreddits that appear on the Front Page. Is the Front Page defined by /r/all, or the 50 default subreddits, or the particular subreddits that a user is subscribed to?\n\nA post that hits *my* Front Page made up of 100 posts from the subreddits that I subscribe to might not be on *your* Front Page, or the default front page, or the /r/all Front Page.\n\nSo how is it the Front Page defined?",
        "created_utc": 1420575393,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit as a 'true' social media site, akin to Facebook/Twitter. Would it work? Would it be successful? Would you use it?",
        "author": "Nintymat",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2ritnc/reddit_as_a_true_social_media_site_akin_to/",
        "text": "So, I saw a post a few pages back on here asking about if Reddit was classed as a social-media website. In my opinion, I say no, because to me, a defining feature of a social media website is a 'friend' or 'follow' system where you 'friend' or 'follow' specific PEOPLE and not a topic.\n\nEither way, this got me thinking if that style could work for reddit. Maybe as a side feature?\n\nThe front page, voting, subreddits etc stay the same but instead of just subscribing to subreddits, implement a feature which allows you to subscribe to users. Allow settings so that you can keep reddit as the normal, have it so you just have a front page dedicated to user subscriptions only, and a page which is a mix.\n\nSo let's say i've signed up to Reddit for the first time because i've heard it's \"kind of like facebook but with links.\" Well, I would immediately 'subscribe' to my friends who i know are on this site. Reddit could recommend you certain 'high profile' users depending what interests you have. Maybe even just bots that repost the top stuff from certain subreddits. Also, let's say i've heard about some cool users on reddit and i've seen some funny posts from a certain user.\n\nSo my subscriber base looks like this:\n\nFriend 1\n\nFriend 2\n\nFriend 3\n\n/r/Technology bot - re-posting the top post on the subreddit to my timeline\n\n/r/funny bot - same as above\n\nUnidan\n\nYungSnuggie\n\nOver time, I subscribe to more and more people based on activity I see over on the 'default' version of reddit.\n\nAnd now I get a front page which is personal to me and more importantly, im following people and not subreddits. I can easily see what my mates are posting. I can see when they submit a link to reddit instantly. How about a function that allows users to 'share' links to posts directly on my 'wall/front page' so i can see them? \n\nI know i'm shooting the shit here a bit but I could see this working if implemented correctly. I can imagine a few of my mates posting a link to my reddit 'wall' saying \"Check out this funny post I found over on SubredditX,\" or simply it would be used as an easy way to quickly share links and taking advantage of all of reddit's features as opposed to doing it through facebook.\n\nIf it ever caught on it would surely generate massive upswing of hits as people sign up for the 'next social media site innovation' and end up discovering 'default reddit' more and more.\n\nAnyway, just an idea. Tell me what you think.",
        "created_utc": 1420559588,
        "upvote_ratio": ""
    },
    {
        "title": "I think redditors(and internet commenters as a whole) should avoid saying \"As a _____, I ...\"",
        "author": "noZemSagogo",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rhz04/i_think_redditorsand_internet_commenters_as_a/",
        "text": "I believe a huge element of the beauty of anonymous commenting is that a reader has to personally judge the comment on its solid logic and not on its presumably reliable source. \"It is true because so-and-so said it\" is a logical fallacy to which the internet should be immune. I understand that this construction can be useful to demonstrate the angle from which an opinion or habitual action comes from, but it also lays claim to experience or expertise which the reader should presumably take for granted. Of course on the internet the comment reader cannot take this expertise for granted (with the exception of verified AMAs and things of the sort), and probably shouldn't completely trust someones thoughts in real life based on credentials alone either. Essentially this form urges the reader to accept the comments thoughts without their own understanding-the polar opposite of educating someone. \n\nEven when used in an honest way I don't believe this is a good habit, but I also see it abused all the time. I read someone's comment recently that said \"Grad student here.\" then went on to give his presumably definitive advice on buying pencils. Obviously this doesn't cover the breadth of the possibility of ways to abuse assuming expertise anonymously, but just one example.\n\nSuggesting a different perspective is a good thing, but presuming knowledge over the reader is not, so I would suggest when commenters or posters want to do the prior they say something like, \"Consider the ____'s perspective,\" or something of that manner, rather than elevating their own opinion above a layman reader. When I go to the doctor's office I'll take extra faith in his opinion, but not on the internet. Even in an AskScience thread I don't believe we should be placing extra faith in someone's comment because of an \"Engineer\" tag. Reddit isn't a scientific journal, it has no well equipped authority investigating the integrity of your knowledge, so the reader shouldn't presume you to know more than he. Those type tags encourage thoughtless acceptance. \n\nMy post could certainly use some more compactness and rewording, but for now I hope I've communicated my thoughts.",
        "created_utc": 1420535298,
        "upvote_ratio": ""
    },
    {
        "title": "Why is 2048.jpg such a popular filename for non-imgur links?",
        "author": "kreamatizer",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rcnws/why_is_2048jpg_such_a_popular_filename_for/",
        "text": "",
        "created_utc": 1420419331,
        "upvote_ratio": ""
    },
    {
        "title": "Difference of tone in /r/askreddit question success",
        "author": "SOwED",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rc8ek/difference_of_tone_in_raskreddit_question_success/",
        "text": "It's still early and hard to tell if either of these questions will really take off, but I noticed that two essentially identical questions had been posted within ten minutes of each other. \n\n[Here's the first](http://www.reddit.com/r/AskReddit/comments/2rbwob/reddit_what_song_gives_you_the_goosebumps/)\n\n[Here's the second](http://www.reddit.com/r/AskReddit/comments/2rc2a5/whats_one_song_that_leaves_you_with_goosebumps/)\n\nThey were posted so close to one another that I figured the timing of the posts had little to do with their success, but the second one is already doing a bit better than the first. The main difference I saw was that the first had a description saying that the OP wanted to feel some feels, while the second had no description.\n\nThe titles of each post are slightly different, and I think the second one sounds more literary or poetic even in comparison with the first. \n\nHave you seen other instances of this?",
        "created_utc": 1420410426,
        "upvote_ratio": ""
    },
    {
        "title": "Posting someone else's content = OK, posting a link to your own stuff = Self promotion",
        "author": "Reggedforthis2",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2rc3uh/posting_someone_elses_content_ok_posting_a_link/",
        "text": "I see this trend recently not only on reddit, but on imgur too. I am blogging and sometimes I post my articles on small subreddits (from another account), but when I say it is my original content I receive downvotes because of self promotion. When someone else submits the same article (of course not saying he is the original creator) receives upvotes and no complains.  \nThis is interesting because everyone on reddit say they like OC, but if I am not linking to imgur I only receive downvotes...  \nI am new to reddit, but I used reddit time machine to check what posts were trending 4-5 years ago, and looks like people upvoted links to websites which were submitted by the admin/operator of that site.  \nSo can you please define my what is self promotion and what is original content?  \nThank you for reading!  \n    \n\n**Edit**: I am not talking about spammy or clickbait sites, but about a simple techy blog where I write about interesting stuff. And the problem is not about I don't get upvotes, but a lot of people I see are getting downvoted because they share their own content (if it is not a link to an imgur image).",
        "created_utc": 1420407985,
        "upvote_ratio": ""
    },
    {
        "title": "Does this go here?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2r9orv/does_this_go_here/",
        "text": "",
        "created_utc": 1420343510,
        "upvote_ratio": ""
    },
    {
        "title": "Should downvoting be prevented on comments unless you have commented yourself?",
        "author": "slaitaar",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2r77o9/should_downvoting_be_prevented_on_comments_unless/",
        "text": "",
        "created_utc": 1420289017,
        "upvote_ratio": ""
    },
    {
        "title": "Has \"trending\" ever hurt or killed a subreddit, or is it always hugely beneficial to be shown on the front page for 24 hours?",
        "author": "Tizaki",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2r6lq8/has_trending_ever_hurt_or_killed_a_subreddit_or/",
        "text": "",
        "created_utc": 1420267012,
        "upvote_ratio": ""
    },
    {
        "title": "Simple Reddit Moderator Scatter Plot: Subreddits vs Subscribers Moderated",
        "author": "observ3r",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2r62yx/simple_reddit_moderator_scatter_plot_subreddits/",
        "text": "Just a quick scatter plot using highcharts with the data I've been collecting for 0bservat0ry. I'd like to make an animated one over time sometime soon. Please comment and let me know what you think!\n\n  \nhttp://0bservat0ry.com/art/scatter/reddit-moderator-scatter-plot-subs.html",
        "created_utc": 1420255306,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit’s White Supremicists now squatting murdered black men’s name/subs, to spew scurrilous virulence",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2r57hz/reddits_white_supremicists_now_squatting_murdered/",
        "text": "",
        "created_utc": 1420237899,
        "upvote_ratio": ""
    },
    {
        "title": "I ran IBM Watson User Modeling on a few subreddit and here is what I found.",
        "author": "heisgone",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2r10jc/i_ran_ibm_watson_user_modeling_on_a_few_subreddit/",
        "text": "&gt;The Watson User Modeling service uses linguistic analytics to extract a spectrum of cognitive and social characteristics from the text data that a person generates through text messages, tweets, posts, and more.\n\n\nI posted to /r/dataisbeautiful an [ analysis of various subreddit](http://www.reddit.com/r/dataisbeautiful/comments/2r0prh/what_ibm_watson_thinks_of_reddit_more_in_comments/cnbct82?context=3) but /r/TheoryOfReddit might be more appropriate for a discussion of the data.  \n\n&amp;nbsp;\n\nI summarize the methodology [here](http://www.reddit.com/r/dataisbeautiful/comments/2r0prh/what_ibm_watson_thinks_of_reddit_more_in_comments/cnbalw5).\n\n&amp;nbsp;\n\nOverall, the results are more or less in line with my subjective evaluation of the selected subreddit. Still, there are case were the Watson's definition of a traits isn't so clear.  \n\n&amp;nbsp;\n\nFor instance, /r/AskHistorians scores low on [Altruism](http://i.imgur.com/m1nsK1w.png), even if we know that its members are highly dedicated. But the kind of formal language used on such reddit might not reflect some emotionnal aspect that Watson is looking for to define Altruism.\n\n\nOn the other hand, /r/AskHistorians scores high on [Cooperation](http://i.imgur.com/SUXGtNK.png), which again tell us something about the language cues being used to interpret the data.\n\n&amp;nbsp;\n\n\n[Self-Consciousness](http://i.imgur.com/m1O1XzJ.png) is frowned upon in almost every subreddit, as post with low number of upvotes scores consistently higher on that scale. \n\n&amp;nbsp;\n\n\nThere are some highly predicatable results. [Cheerfulness](http://i.imgur.com/rEqwgvQ.png) and [Artistic interests](http://i.imgur.com/dgO698L.png) score low on more serious subreddit and high in more casual subreddit. \n\n&amp;nbsp;\n\nI could run my programs on some other subreddit. There is still some refinement to be done and I'm looking to plot results using other methods to highlight various trends.\n\n&amp;nbsp;\n\nFor an online demo of Watson User Modeling, follow this link:\nhttp://watson-um-demo.mybluemix.net/\n\n&amp;nbsp;\n\n**Edit 1:**\n\nAll the graphs:\n\n[Original selection (sorted alphabetically)](http://imgur.com/a/eyxFU)\n\n[Original selection (sorted by values)](http://imgur.com/a/JNkse)\n\n[Gaming subs (sorted alphabetically)](http://imgur.com/a/tiths)\n\n[Gaming subs (Sorted by values)](http://imgur.com/a/vDbDR)\n\n[Myers-Brigg subs](http://imgur.com/a/riHls)\n\n**Edit 2:**\n\n[Cities subs](http://imgur.com/a/DGdy4)\n",
        "created_utc": 1420140695,
        "upvote_ratio": ""
    },
    {
        "title": "Do the benefits of using AutoModerator to remove comments from new and low karma users outweigh the negatives?",
        "author": "NewAccount778946",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2qzgeu/do_the_benefits_of_using_automoderator_to_remove/",
        "text": "I have a habit of making a new account every few months or so. Sometimes I'll use a throwaway account to make a post or answer a question. I've noticed that more and more subreddits have automod configured to remove comments from users that are either new or don't yet have enough karma (not the -100 limit, but an arbitrary value like +10). Sometimes they are nice enough to have automod send a message, but many do not. My understanding is that this done in an attempt to curb trolling and/or spamming. However, this must surely have an impact on legitimate users as well?\n\nFor example, I made a throwaway for a somewhat embarrassing post that hit about +3500 votes in a default subreddit and was on the front page. People were asking a lot of questions in the comments, and I was doing my best to answer them as the built in reddit timer would allow. However, people were starting to upvote comments about the fact that I wasn't replying to anything. I checked the page from my normal account, and all the comments I'd made were removed. I messaged the mods who told me to just message them with links to my comments and they would manually approve them. I just abandoned the post as it got too frustrating to make a comment, message the mods, wait 30 minutes or longer for them to approve, repeat.\n\nAnother time, I'd been making comments in a sub for a couple days that were automatically removed, again with no notification, because I didn't have +10 karma as a mod told me after I realized what was happening. I was only participating, with on-topic comments not trolling, in the one subreddit. With no one ever seeing my comments, I would never be able to obtain the +10 karma they wanted.\n\nBecause of this, I've just started creating small batches of accounts and making a couple low effort puns in rising posts that automod doesn't restrict with them to give each one a couple hundred karma. By the time I want a new account, or need a throwaway, they're aged enough to bypass the automod restrictions.\n\nI have several concerns about this from the perspective of an actual new user though.\n\n* I assume many users browse the site for some time before making an account. They see a post that they know a lot about and can contribute something cool. This was my first comment and I upvotes and a lot of nice replies and answered some questions for people. A new person doing that today in that subreddit would just assume no one even bothered to vote on their comment.\n* Why allow a new user to make a post, but not any comments in their post? Most brand new users aren't going to realize their comments are only visible to them and message the mods about it.\n* Do the defaults have more of an obligation to allow new users to participate? They're the subreddits the admins think everyone should see first. It makes little sense to me for them to then hide your contributions there.\n* I can see the motivation for the account age restriction. Is a required amount of positive comment karma ever acceptable though? Just because a person hasn't been upvoted doesn't mean they aren't contributing.\n*If a subreddit is going to use automod to automatically hide all users based on account age or karma criteria, shouldn't those criteria be listed in the sidebar or some visible location? \n\nEDIT: Just saw an example of the confusion I was talking about: http://np.reddit.com/r/AskReddit/comments/2qzl1t/can_people_not_see_my_posts/",
        "created_utc": 1420088703,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone have success using Reddit Ads to promote your subreddit?",
        "author": "alienbrayn1",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2qzb6f/anyone_have_success_using_reddit_ads_to_promote/",
        "text": "I've exhausted literally every promotion technique available, from promoting my subreddit to /r/Newreddits, /r/shamelessplug, etc. X-posted dozens of links on other subreddits to my subreddit. Swapped sidebar promotion links to each other's reddits on related subreddits and so on.\n\nI've had pretty good success doing these things, got to a little over 3k subscribers in about 2 weeks... BUT, I'd like more. Because more is of course always better.\n\nSo I'm thinking about promoting my subreddit even further by using Reddit Ads, for $10 I can reach about 10k people which will hopefully net at least 10% of that in new subscribers. \n\nHas anyone had any success with this? Or is it a waste of money?",
        "created_utc": 1420084243,
        "upvote_ratio": ""
    },
    {
        "title": "How does reddit generate www.reddit.com/gilded/?",
        "author": "Puppier",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2qxmpc/how_does_reddit_generate_wwwredditcomgilded/",
        "text": "[Link](http://www.reddit.com/gilded/)\n\nI was looking at the tabs at the top of the front page and I noticed for the first time the \"gilded\" tab. I looked through it a little bit and I couldn't seem to figure out how it was generated or how it was ranked.\n\nIt looks like it's just subreddits I'm subscribed to, but I can't figure out how the ranking works. It doesn't appear to be chronological, nor by upvotes. It also looks like not all posts are listed [this thread for example](http://www.reddit.com/r/funny/comments/2qu3xk/my_secret_santa_sent_me_a_trash_can_lid_im_done/) was Midased, but not all of the comments have shown up in the gilded queue.\n\nIt's curious.",
        "created_utc": 1420046569,
        "upvote_ratio": ""
    },
    {
        "title": "Was my Reddit account Compromised? Is this a common issue?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2qvx0i/was_my_reddit_account_compromised_is_this_a/",
        "text": "",
        "created_utc": 1419998302,
        "upvote_ratio": ""
    },
    {
        "title": "What effect does the alphabetical order of subreddits have?",
        "author": "JustAnotherID",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2qun1b/what_effect_does_the_alphabetical_order_of/",
        "text": "In the dropdown menu in the top left corner aswell as in many mobile reddit apps (like BaconReader) the subreddits are ordered alphabetically. I have noticed that I visit the subreddits at the top of that list much more often if I am not looking for a particular subreddit.\n\n\n\nI wonder how much impact this effect has on the popularity of subreddits and on the number of visitors.",
        "created_utc": 1419973504,
        "upvote_ratio": ""
    },
    {
        "title": "Reasons why you can't see a post of your own while everyone else does.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2qt1lb/reasons_why_you_cant_see_a_post_of_your_own_while/",
        "text": "",
        "created_utc": 1419937613,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any way besides removing the voting system to prevent the \"hivemind\" mentality?",
        "author": "EzPzLmnSqzy",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2qqzh9/is_there_any_way_besides_removing_the_voting/",
        "text": "I know there has been a fair amount of discussion about this, but I didn't notice how readily people upvote fluff and generic comments until a shitty comment I left made the top of the thread in a relatively large subreddit, and the comment right below it is basically the same thing. Will people always hivemind or is there any way to change it?",
        "created_utc": 1419889116,
        "upvote_ratio": ""
    },
    {
        "title": "If extraordinary posts are automatically stickied can we break the cycle of forgetfulness?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TheoryOfReddit/comments/2qnlrr/if_extraordinary_posts_are_automatically_stickied/",
        "text": "",
        "created_utc": 1419807442,
        "upvote_ratio": ""
    }
]