[
    {
        "title": "On political posts and an unharnessed resource on Reddit.",
        "author": "dlj630",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/996vi0/on_political_posts_and_an_unharnessed_resource_on/",
        "text": "I present, item #1:\n\n* [Sen. Elizabeth Warren's new reform bill would ban members of Congress from owning individual stocks](https://www.reddit.com/r/politics/comments/993s4y/sen_elizabeth_warrens_new_reform_bill_would_ban/)\n\nWarren will get little support and this bill won't be voted on, very little effect. This bill will have a minuscule affect on the large scale of politics and U.S. national discourse, and seeing the post/link mildly annoys me.\n\nThere are (in my experience) a lot of similar posts, I see them on [/r/all](https://www.reddit.com/r/all) most days I'm checking. showing they appeal to a lot of voting redditors.\n\nI think that what's happening here is that people are supporting opinions/policies they like.\n\nThis is mostly wasted energy. The redditor upvoted an article on reddit which will increase the posts' exposure. The biggest effect will be re-enforcing existing opinions. A minor effect of exposing a minority, those who are learning and open, to the idea.\n\nFrom what I understand this resource is only being harvested by researchers/companies with the ability to crunch big data, but I don't know of any large impact that has.\n\nI put forward that there is an untapped resource of people who are willing to passively support ideas/policies (upvoting). Each upvote is relatively worthless, but multiply it's value by the 29k+ people who upvoted the post in it's short lifespan, and that is significant. I also put forward that it could be harnessed with 1) a market/platform for persisting ideas/policies, 2) restricting the market/platform participation to verified voters.  \n.  \nThis idea is anecdotal, I'm not citing any sources or verifiable analysis. As well, the idea of a market/platform is a HUGE if. I would like to avoid discussing specifics on a market/platform, but instead talk about the points leading to it.\n\nSo tear it apart, build it up, what do you think?",
        "created_utc": 1534884468,
        "upvote_ratio": ""
    },
    {
        "title": "On political posts and an unharnessed resource on Reddit.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/996qw6/on_political_posts_and_an_unharnessed_resource_on/",
        "text": "[deleted]",
        "created_utc": 1534883575,
        "upvote_ratio": ""
    },
    {
        "title": "On political posts and opinions, and an unharnessed energy.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/996nim/on_political_posts_and_opinions_and_an/",
        "text": "[deleted]",
        "created_utc": 1534882919,
        "upvote_ratio": ""
    },
    {
        "title": "Hopefully an easy question about new subreddits",
        "author": "CerebralPimp",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/98vbtt/hopefully_an_easy_question_about_new_subreddits/",
        "text": "If my settings for the board are public, I have the filters set to low, why is it I can't see peoples posts when I'm logged in but I can if I'm logged out? I'm the creator of the sub reddt DungeonAndHeroes and I really don't want to make anyone that subs or visits an \"approved submitter\", I'd just like everyone to be able to submit new content.",
        "created_utc": 1534784267,
        "upvote_ratio": ""
    },
    {
        "title": "How do Redditors decide whether to upvote a post/comment?",
        "author": "nacrosian",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/98urdz/how_do_redditors_decide_whether_to_upvote_a/",
        "text": "How can a post get 10 upvotes one day and 10k the next? Do people just upvote anything they see, and all that matters is how many people are browsing /new at the moment?",
        "created_utc": 1534780297,
        "upvote_ratio": ""
    },
    {
        "title": "I didn't join reddit to make friends...",
        "author": "Infinitewizdumb",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/98upma/i_didnt_join_reddit_to_make_friends/",
        "text": "I have been a lurker on reddit for a while now and have come to realize that I wish I was friends with so many people here(e.g., everyone in r/DunderMifflin, r/PandR, r/aww, r/solotravel, etc.). It just goes to show that the only thing that separates us is geography, ethnicity, religion...but we are all the same! All humans, full of love and laughter. Sometimes I feel like you are all long lost best friends. Have a great day!",
        "created_utc": 1534779934,
        "upvote_ratio": ""
    },
    {
        "title": "What recourse do you have when you're banned from a subreddit?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/98sb0v/what_recourse_do_you_have_when_youre_banned_from/",
        "text": "[deleted]",
        "created_utc": 1534759299,
        "upvote_ratio": ""
    },
    {
        "title": "The war of subreddits",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/98oxbg/the_war_of_subreddits/",
        "text": "[removed]",
        "created_utc": 1534723923,
        "upvote_ratio": ""
    },
    {
        "title": "Should a subreddit necessarily have to be against a group of people in order to be considered a hate sub?",
        "author": "babylicker",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/98opsk/should_a_subreddit_necessarily_have_to_be_against/",
        "text": "For example, I just found a place called \"Dogfree\". While it says in the sidebar that no animal cruelty is tolerated, that's probably to make themselves sound more legitimate. A typical hate sub might have a rule like, \"No calls to violence against [insert racial slur here]\". I'm just putting an idea out there that maybe sub that focuses it's anger on animals in any way should be considered hatred. This is all just food for thought, I'm not totally sold on this idea either. It would extend way beyond the internet too, for example a group that focuses on animal cruelty because they hate animals could be considered a hate group. A crime against an animal could be considered a hate crime, if it's done because they're vulnerable or out of hatred, etc. ",
        "created_utc": 1534722108,
        "upvote_ratio": ""
    },
    {
        "title": "Never seen a sidebar",
        "author": "gousey",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/98irfp/never_seen_a_sidebar/",
        "text": "[removed]",
        "created_utc": 1534665769,
        "upvote_ratio": ""
    },
    {
        "title": "Any ideas what automoderation settings ShowerThoughts would use to determine that my submission was a \"premise or a question\"? Because it wasn't.",
        "author": "FiveYearsAgoOnReddit",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/98fih5/any_ideas_what_automoderation_settings/",
        "text": "[removed]",
        "created_utc": 1534631165,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone else noticed Reddit ads with unusual high comment count, but have nothing to do with the ad itself?",
        "author": "YoutubeRoons11BR",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/98fecc/has_anyone_else_noticed_reddit_ads_with_unusual/",
        "text": "I always get click baited by the high comment count, but it always turns out to be uninformative and unrelated to the post itself. \n\nIt gives me a shady impression because I know Reddit users don't usually comment in this way. \n\n[Example comment](https://www.reddit.com/comments/984c7s/ai_for_email_addon_that_works_with_your_existing/e4dg2zh/) for an ad about \"AI for email\"\n\n[Another example comment](https://www.reddit.com/comments/984c7s/ai_for_email_addon_that_works_with_your_existing/e4ddyiq/) from the same ad thread\n\nI don't know how perma-linking ad threads work, but I hope it stays for archiving purposes. \n\nThis isn't the first one I've seen that's like this either. I saved them for future analysis, but when I tried looking for them a couple weeks later I couldn't find them in my saved section. ",
        "created_utc": 1534630144,
        "upvote_ratio": ""
    },
    {
        "title": "Why does it seem like reddit is the only website where people expect you to mark sarcasm with an /s?",
        "author": "hopdevil93",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/987zpj/why_does_it_seem_like_reddit_is_the_only_website/",
        "text": "This is just a bizarre part of reddit in my opinion. if you are being sarcastic/ironic but don't put /s, people will respond with \"you dropped this /s\" or \"i really hope you forgot the /s\". People will say \"well, its hard to tell if someone is being sarcastic\" but you don't really see this on any other website like youtube, instagram or 4chan. On other sites people just understand when sarcasm or joking is taking place, but redditors seem a lot more uptight and unable to detect irony. Why do you think that is? ",
        "created_utc": 1534556665,
        "upvote_ratio": ""
    },
    {
        "title": "From having enclosed to door-to-door service and to expedited shipping service. We fulfill all the car shipping needs that you have.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/user/autotransportcity/comments/971sy0/from_having_enclosed_to_doortodoor_service_and_to/",
        "text": "[deleted]",
        "created_utc": 1534526553,
        "upvote_ratio": ""
    },
    {
        "title": "Tv has been showing us Alternate Universes Lifestyles",
        "author": "mr-wond3r-",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/982zzd/tv_has_been_showing_us_alternate_universes/",
        "text": "[removed]",
        "created_utc": 1534518264,
        "upvote_ratio": ""
    },
    {
        "title": "What's up with the downvotes?",
        "author": "jillbob101",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/982otz/whats_up_with_the_downvotes/",
        "text": "Maybe I'm new to posting actively but noticed some of my posts get down voted for no reason. Posts asking for advise don't get a response and instead are downvoted.\n\nPS; don't you dare down vote this post 😉",
        "created_utc": 1534515922,
        "upvote_ratio": ""
    },
    {
        "title": "The difference between a post that becomes #1 all time and one that falls in to the abyss is a couple of votes within the first minute of posting.",
        "author": "ChipAyten",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97uwjm/the_difference_between_a_post_that_becomes_1_all/",
        "text": "Reddit is still too susceptible to this. There's too great a malaise of postings/content to fight through that visibility is nigh impossible without multiple attempts, or multiple accounts to boost a new post's standing. There's far too much chance/randomness and if you want visibility then you need to engineer your posts and that's not what Reddit is about.",
        "created_utc": 1534444614,
        "upvote_ratio": ""
    },
    {
        "title": "Only reddit has mostly posts from other social media yet the number one complaint on reddit is that a post is actually a repost.",
        "author": "nick82614",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97u0th/only_reddit_has_mostly_posts_from_other_social/",
        "text": "[removed]",
        "created_utc": 1534438593,
        "upvote_ratio": ""
    },
    {
        "title": "How do people gain subscribers to their new subreddits if no one enjoys crossposted \"ads\" for a new subreddit? Is this all a word of mouth game?",
        "author": "Kassandstorm",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97toq9/how_do_people_gain_subscribers_to_their_new/",
        "text": "I created a subreddit, r/entheogenicsex, which wants to build a community around transcendent/spiritual sexual experiences. It's a NSFW sub, so I can't post about it in r/newsubreddits, and mods get upset when I mention it in subs that seem related (r/sex). I'm confused about how this is supposed to work. Please offer advice if possible. Thank you. &lt;3",
        "created_utc": 1534436283,
        "upvote_ratio": ""
    },
    {
        "title": "can't collapse threads on 'new reddit' design. why. why. why why?!",
        "author": "the_solution__",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97rxfi/cant_collapse_threads_on_new_reddit_design_why/",
        "text": "[removed]",
        "created_utc": 1534423219,
        "upvote_ratio": ""
    },
    {
        "title": "55%??",
        "author": "RealityTVisRealLife",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97q1v1/55/",
        "text": "[removed]",
        "created_utc": 1534402594,
        "upvote_ratio": ""
    },
    {
        "title": "Buckets Vs Cannon balls",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97m3cg/buckets_vs_cannon_balls/",
        "text": "[removed]",
        "created_utc": 1534367461,
        "upvote_ratio": ""
    },
    {
        "title": "Karma does have value. Let me explain.",
        "author": "Shadow_Of_",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97hxkc/karma_does_have_value_let_me_explain/",
        "text": "Karma is divided into the subreddits you've gained the karma on. Just look at your userpage and view your karma breakdown. \n\nThe subs you have low karma on give you the \"you're doing that too much\" message when you post. Go ahead try commenting/posting on the subs you have low karma on. \n\nThe subs you have high karma on don't give you this message. \n\nIn conclusion karma does have value and does discourage the users who are aware of the function karma has from switching accounts.",
        "created_utc": 1534337160,
        "upvote_ratio": ""
    },
    {
        "title": "If money makes the world go round...",
        "author": "Downto1_percent",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97g3jt/if_money_makes_the_world_go_round/",
        "text": "[removed]",
        "created_utc": 1534315125,
        "upvote_ratio": ""
    },
    {
        "title": "How to Get Free Karma on Reddit with /u/Gallowboob",
        "author": "YoutubeRoons11BR",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97fw1f/how_to_get_free_karma_on_reddit_with_ugallowboob/",
        "text": "I came across this video while browsing YouTube and I thought this community would appreciate watching it.\n\nhttps://www.youtube.com/watch?v=FzGetqbDhqE\n\nIt's an interview about the daily Reddit habits of the owner of the current 1st largest karma account, Gallowboob. \n\nThe video is a year old, but I found the discussion still relevant to how Reddit functions today. \n\n---\n\nEdit: I think people are getting the wrong idea when reading this\n\n~~My favorite part was, \"A good guideline to know if your post will hit front page is if the minutes follow the upvotes\" (In other words, you should be getting one upvote per minute)~~  ",
        "created_utc": 1534312586,
        "upvote_ratio": ""
    },
    {
        "title": "I don't get how karma works - does it not matter anymore whether you are the original poster or getting karma from replies? I only see one number now...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97f8ny/i_dont_get_how_karma_works_does_it_not_matter/",
        "text": "[deleted]",
        "created_utc": 1534305896,
        "upvote_ratio": ""
    },
    {
        "title": "Theory, if you focus too much on how upvotes your post will get, it’ll get downvoted",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97dqvm/theory_if_you_focus_too_much_on_how_upvotes_your/",
        "text": "[removed]",
        "created_utc": 1534292903,
        "upvote_ratio": ""
    },
    {
        "title": "At what point will the posts and comments be over-saturated with cake-day users?",
        "author": "fingers",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97dixv/at_what_point_will_the_posts_and_comments_be/",
        "text": "When will cake-day users outnumber non-cake day users? I've seen A LOT of cake day users lately. (Could be due to summer subscribers?)  Will there come a time when non-cake day users are a minority?",
        "created_utc": 1534291129,
        "upvote_ratio": ""
    },
    {
        "title": "The downvote button isn’t for disagreeing, it’s for offtopic or irrelevant posts.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97d527/the_downvote_button_isnt_for_disagreeing_its_for/",
        "text": "Often I see posts/comments getting downvoted simply because the people of a particular sub don’t agree with the article or because someone says something that other users don’t agree with. This isn’t how it was meant to be used.\n\nI think reddit should force users to comment or articulate themselves whenever they wish to disagree with a post, not just filtering out discussion because they don’t agree with it. This makes subs like r/politics, r/news and r/worldnews most notably, circlejerks.\n\nEdit: case and point been downvoted on this lol. ",
        "created_utc": 1534287996,
        "upvote_ratio": ""
    },
    {
        "title": "Say you happen to glance at someone's profile and though it says they joined a month ago, you realize this can't be. The profile must be a secondary or auxiliary one. Why do people do this?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97d4np/say_you_happen_to_glance_at_someones_profile_and/",
        "text": "[removed]",
        "created_utc": 1534287908,
        "upvote_ratio": ""
    },
    {
        "title": "Is the sub r/333777 a way for Russian spies (or other nefarious groups) to communicate intel encoded in pictures, or am I missing something?",
        "author": "PacificPragmatic",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/97am11/is_the_sub_r333777_a_way_for_russian_spies_or/",
        "text": "Maybe it's an inside joke? Does anyone know what this sub is?\n\nI'm always on mobile, so sorry I'm advance if there's an explainer side bar I can't see. ",
        "created_utc": 1534269719,
        "upvote_ratio": ""
    },
    {
        "title": "r/BlackPeopleTwitter and banning transphobes",
        "author": "lion_OBrian",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/977whw/rblackpeopletwitter_and_banning_transphobes/",
        "text": "[In this recent post](https://www.reddit.com/r/BlackPeopleTwitter/comments/9743bn/its_that_simple/?st=JKTO24EQ&amp;sh=14df8aa5), A BPT mod removed any transphobic and bigoted post while also banning their their creators. While that sub is not the place to discuss transgendered identity, a number of the banned claimed the action unjust and hindering an actual discussion (though a lot of them seemed to do so in bad faith and bigotry). The stickied post itself was a tongue-in-cheek bait aimed at those unsavory individuals. \n\nShould the mods have had such a strict stance on the comments? Does it hinder discussion? Additionally, what is a good sub to understand trans people more/have a discussion with them?",
        "created_utc": 1534249477,
        "upvote_ratio": ""
    },
    {
        "title": "What does it mean to have 100% upvote on your post?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/9765qy/what_does_it_mean_to_have_100_upvote_on_your_post/",
        "text": "[removed]",
        "created_utc": 1534229415,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit after blocking the most prolific posters.",
        "author": "IAMA-Dragon-AMA",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/9760zy/reddit_after_blocking_the_most_prolific_posters/",
        "text": "I've noticed, more so lately than before, that a large amount of the content in each of the busy subreddits is consistently submitted by the same people.  Likewise when these users are examined more closely you can clearly see that there is minimal interaction in the comments.  In many cases if you watch their content compared to their peers there are obvious signs of vote manipulation as well or in some cases they are moderators who have been previously called out for deleting competing submissions.  So for a test I RES ignored them.  Using RES meant that there would be holes left where their content would have gone, but it wouldn't otherwise display.\n\nI did not block many users and I did this a week ago.\nBlocked accounts:\n\n* /u/adamcannon\t\n\n* /u/bunyippouch\t\n\n* /u/green_flash\t\n\n* /u/vriska1\t\n\n* /u/mvea\t\n\n* /u/maniaforbeatles\t\n\n* /u/maxwellhill\n\n* /u/speckz\n\n* /u/quiglius\t\n\nThat's less than 10 users blocked, and it was done last week.  My technique was to go to busy subs which appeared on my front page, to look for names that repeat then block them in RES until the subreddit's top 25 or so featured no username repetitions.\n\n[Here](https://i.imgur.com/s5bKNTN.png) is the current status of my front page a week later and this isn't atypical based on the last few days or even the worst it's been.  The top 25 are now the top 9 and every post in the top 10 was from a prolific account.  When it's mixed with other content from other subreddit's it's a lot less glaring but I'm beginning to realize the problem is quite severe.  This indicates that not just some, but a majority of content a user with my subscriptions would have seen would have been sourced from just those nine users.\n\nNow this might be specific to me or the subs I frequent though so I'd definitely be interested in people's experience trying something similar.  I found the results to be worth sharing though.",
        "created_utc": 1534227882,
        "upvote_ratio": ""
    },
    {
        "title": "Karma Whores on r/Music",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/975mgd/karma_whores_on_rmusic/",
        "text": "[deleted]",
        "created_utc": 1534223459,
        "upvote_ratio": ""
    },
    {
        "title": "Can people see what comments I posted even after I delete them?",
        "author": "creativewebuser",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/9741bg/can_people_see_what_comments_i_posted_even_after/",
        "text": "I heard reddit stores comments and posts forever but can people access them (see either that I posted a comment/post or what it said) or are they restricted?",
        "created_utc": 1534209024,
        "upvote_ratio": ""
    },
    {
        "title": "Is the storyteller on Reddit often the good guy in the story?",
        "author": "JurijFedorov",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/9708oi/is_the_storyteller_on_reddit_often_the_good_guy/",
        "text": "Reddit is not objective. That's kinda clear because most users here at people. And they are even young and often inexperienced and irrational people so that brings forth more irrationality. But it's still interesting how some irrationality seems to be mostly overlooked on Reddit overall.\n\nWhether you go to /r/relationship_advice or other advice or storytelling subs the most upvoted story will often be written in a very specific way. So specific that I often feel like I'm reading the same comment again and again. In such a story OP did everything right and was a great partner and even went above and beyond what is required. OP's ex or current partner did something very immoral. \"I was always there for my partner but my partner cheated on me\".\n\nThis is often told in a way where the good and bad guys are clear in the story itself.\n\n**In advice seeking subs** the formula is very specific. There will be no ambiguity at all but OP acts clueless about the whole thing. It will be a current partner as OP seeks advice. But to me questions like \"Was I right to get angry at my partner because my partner cheated on me with my best friend?\" are nonsensical unless OP has autism in a degree where they can't understand the most basic of human behavior. I often just assume that OP knows exactly what he or she is doing and what kind of major reaction they will get from telling the story in this specific way where OP is good but clueless and the partner is clearly evil and manipulative. We all want to help these good hearted but clueless people and such a story makes us want to help out with upvotes and positive comments.\n\n**In the storytelling subs** the story will be a bit different. It's not created to have young women want to give the obvious advice and support the storyteller. It's a story told to create outrage. \"I loaned my mother-in-law a car and she stole it.\" Again, the outrage is clear and the bad guy is clear. Here OP is not clueless but just a good guy. OP often didn't seek retribution like calling the police or getting his car back. Because that would easy some of the outrage tension that creates upvotes. But the good payback story is also a popular story on Reddit. It's just framed in another way.\n\nSince many stories on Reddit go like this I assume 2 things are happening. Writers want to adjust their stories to fit the formula and gain upvotes and pats on the back. And also, these stories are just more visible because they are upvoted while stories that don't follow these formulas are ignored and overlooked.\n\nI hope I was not too technical. I just really hate bringing examples to the table because I don't want to call out specific people. \n\nI think most Redditors are aware of these formulas and automatically lie a bit when they tell the personal stories just like we all do in real life. It's important to see yourself as a good and morally superior guy in many situations.",
        "created_utc": 1534180988,
        "upvote_ratio": ""
    },
    {
        "title": "Why people assume someone posting things in some ways (like in many different subs) are karma whores, and not that they are only interested in a conversation?",
        "author": "DraftDraw",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/96z6wh/why_people_assume_someone_posting_things_in_some/",
        "text": "Admiteddly, there are things I post in many different subs. But it's not because of karma, I genuinely want to gather a discussion with people and see users interacting with one another, sharing opinions, etc. I don't care about the karma, but it seems people think that's all you want, when in fact you just want to have some good time with different perspectives of people talking to each other.",
        "created_utc": 1534173740,
        "upvote_ratio": ""
    },
    {
        "title": "How reddit homepage feed works?",
        "author": "peter778",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/96ogu2/how_reddit_homepage_feed_works/",
        "text": "I am subscribed to more than 500 subreddits but on my homepage feed i don't see feeds from more than 40-50 of my subscriptions. How homepage feed works? ",
        "created_utc": 1534072252,
        "upvote_ratio": ""
    },
    {
        "title": "Analysis tool for a thread?",
        "author": "IHuser",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/96kizv/analysis_tool_for_a_thread/",
        "text": "I see many tools to view data from subreddits or users, but I'm looking soemthing to check a thread (a megathread really). I'm interested in:\n\n1. Top commenters by # comments. \n2. Top commenters by karma.\n3. Posts per hour/per day.\n4. Top comments per karma.\n5. Word cloud.\n\nIf ANY of these is possible, I'll be happy. I'm certain someone, somewhere has done something like this, can you point me in that direction? ",
        "created_utc": 1534027153,
        "upvote_ratio": ""
    },
    {
        "title": "No more old.reddit crossbar. Is this change meant to create continuity between Reddit mobile app and desktop browser?",
        "author": "blue-sclera",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/96ggzg/no_more_oldreddit_crossbar_is_this_change_meant/",
        "text": "Today was the first day I didn't have the bar that let me go directly to old.reddit... I absolutely abhor the new switch probably because I'm not used to it but it really just feels like a mobile app on my desktop (I would much prefer it if it were the other way around). Are sites trying to integrate their desktop browser to feel the same as the their mobile one (see Facebook, Twitter...)? Is this a branding thing? I know Reddit has been previously plagued with a lack of continuity on mobile and I suppose this will get people, especially newcomers, more comfortable with their mobile app over the others. Was curious to hear your guys' thoughts.",
        "created_utc": 1533993342,
        "upvote_ratio": ""
    },
    {
        "title": "Hi All! I’m new to Reddit and looking for advice on proper etiquette. Specifically when posting/OP, but ANY and ALL suggestions concerning etiquette are welcome.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/96dixk/hi_all_im_new_to_reddit_and_looking_for_advice_on/",
        "text": "[deleted]",
        "created_utc": 1533957812,
        "upvote_ratio": ""
    },
    {
        "title": "A way to explore and find new and interesting subs on Reddit",
        "author": "marienbad2",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/96cb5r/a_way_to_explore_and_find_new_and_interesting/",
        "text": "I sometimes feel like I am sat at the edge of a giant swimming pool, and am only just dipping my toes in when browsing Reddit.  I visit the same subs over and over, and sometimes I will try somewhere new when it makes it to the FP.  \n\nI wish there was a way for people to explore Reddit, like Stumbleupon when it was new and awesome, that would allow you to stumble.  I know there is a random button, but Stumble allowed you to see all kinds of stuff within certain ranges, and learnt from you liking pages.",
        "created_utc": 1533946619,
        "upvote_ratio": ""
    },
    {
        "title": "Idea: News and Political subs should partner with mediabiasfactcheck.com",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/96bpmw/idea_news_and_political_subs_should_partner_with/",
        "text": "[deleted]",
        "created_utc": 1533941712,
        "upvote_ratio": ""
    },
    {
        "title": "Time to rein in bots?",
        "author": "UltravioletClearance",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/96aup7/time_to_rein_in_bots/",
        "text": "It seems like every day the bot problem on reddit gets worse and worse. A vast, vast, VAST majority of bots on reddit are totally useless, add nothing to the discussion, and cause spam. \n\nBots that copy/paste paragraphs of wiki text, passive-aggressively “correct” your spelling with useless mnemonics that actually run contrary to the language, and bots whose literally only purpose is to spam while adding nothing to the discussion. \n\nThe problem is exacerbated by the whole “good bot” craze and the now FOUR bots which respond to each other at the utterance of the phrase. \n\nVirtually no one is following [bottiquette](https://www.reddit.com/wiki/bottiquette). Although not an official enforceable policy, it contains quite a few good rules to reduce this problem:\n\n* making sure your bot is a duplicate so we don’t have THREE “wiki text bots” quoting large blocks of Wikipedia text when the user could've just spent 15 seconds clicking the link and reading the post\n* Requiring bots to disclose their author for urgent bug fixes, etc so you don’t have spelling correction bots telling people to respond “delete” to remove the post but doesn’t actually work\n* “make sure your bot is actually adding something to the conversation it's posting in. A bot which says \"Good post!\" is pointless.” When there are literally dozens of bots that do exactly this (Good human! LOL)\n* “limit the amount of times your bot will reply within any given thread” so people don’t jerk the bot off and keep responding to it for lulz. \n\nPerhaps the admins should transform “bottiquette” into an enforceable policy, and, well, actually enforce it? Seems like 90% of bots would be banned in an instant if that were the case. \n",
        "created_utc": 1533935149,
        "upvote_ratio": ""
    },
    {
        "title": "Since I seem to have been banned from r/AskHistorians despite trying to post in good faith...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/96a3t3/since_i_seem_to_have_been_banned_from/",
        "text": "[removed]",
        "created_utc": 1533929801,
        "upvote_ratio": ""
    },
    {
        "title": "Are Trending Posts Organic or Hand-Picked?",
        "author": "VerifiedMadgod",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/969jlb/are_trending_posts_organic_or_handpicked/",
        "text": "Often posts are labeled as trending and I get a notification for them, even when there is no activity on the post. Most people who are there are there because of the trending notification. ",
        "created_utc": 1533925884,
        "upvote_ratio": ""
    },
    {
        "title": "I was on Askreddit and I saw the same comment chain that I saw probably 6 months ago.",
        "author": "Quak-Quak",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/968e90/i_was_on_askreddit_and_i_saw_the_same_comment/",
        "text": "It was technically NSFW, and the thread itself was different but I found a comment chain of 3 comments that is identical to something I read probably months ago.  Are people recycling ideas and responses on the popular text-based subreddits?  Am I experiencing deja vu? Am I crazy?",
        "created_utc": 1533918142,
        "upvote_ratio": ""
    },
    {
        "title": "Chat doesnt load",
        "author": "kriegnes",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/9672h5/chat_doesnt_load/",
        "text": "[removed]",
        "created_utc": 1533908847,
        "upvote_ratio": ""
    },
    {
        "title": "Are voting privileges removed based on some secret criteria?",
        "author": "nonconcurrence",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/966vwi/are_voting_privileges_removed_based_on_some/",
        "text": "I’ve noticed that if I vote on several comments and then refresh the page, all the vote totals return to their previous count. \n\nThis varies depending on which account I am logged in under. It also seems to vary depending on the sub. \n\nThere are lots of posts about the issue, going back as long as 10 years ago. The question is never answered definitively, but it seems like privileges mysteriously reappear not long after making a post about the issue. \n\nI have seen my privileges disappear and reappear, and disappear again over time. I occasionally use different accounts, but I’m careful not to vote on any of my own post/comments, or double-vote. \n\nIt’s not vote fuzzing, it’s not server lag, it’s not somebody else counter-voting at the same time.\n\nI’ve had several theories about it, but nothing certain enough that I could replicate the problem. My current theory is that it has to do with posting/commenting with more than one account in a particular sub. I’ve wondered if maybe it has to do with some secret ratio of voting to commenting, like if you don’t participate in the conversation, your votes don’t count. \n\nMaybe it’s just a glitch/bug, but I doubt it because it fits in too well with reddit’s pattern of passive-aggressive moderation methods, like shadow bans and hiding posts/comments. \n\nI like to upvote people that reply nicely to my post/comments. Otherwise, I don’t care much about whether I can vote, I’m just curious what triggers the removal of voting privileges, and if it varies depending on sub.\n",
        "created_utc": 1533907377,
        "upvote_ratio": ""
    },
    {
        "title": "Is it problematic that Reddit is US-centric?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/966sdc/is_it_problematic_that_reddit_is_uscentric/",
        "text": "[deleted]",
        "created_utc": 1533906597,
        "upvote_ratio": ""
    },
    {
        "title": "Proof that reddit allows astroturfing of certain accounts",
        "author": "kijib",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/96074c/proof_that_reddit_allows_astroturfing_of_certain/",
        "text": "I just noticed this on my sub\n\nhttps://np.reddit.com/r/FreePolDiscussion/comments/95y4y8/alexandria_ocasiocortez_why_do_we_write_blank/e3wp4nb/\n\nif you check the bot's page history, every comment gets exactly twelve dowvotes at least\n\nSo, basically, someone was annoyed enough with this bot to create 12 dowvote bots, and reddit hasn't done anything about it yet\n\nIs this not a huge issue? Think of all the accounts on /r/politics that are most likely tagged to get upvotes, someone can just as easily do this for more significant users, and probably has",
        "created_utc": 1533846949,
        "upvote_ratio": ""
    },
    {
        "title": "Editing titles, why is editing the post OK but not the title?",
        "author": "Sedorner",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/95yg6o/editing_titles_why_is_editing_the_post_ok_but_not/",
        "text": "Presumably it’s to prevent someone from changing their title ~~is~~ in some nefarious way, say originally the title was “puppies and kittens are SOOOO adorable” then after the massive flood of updoots, This Bad Redditor changes the title to “puppies and kittens are so delicious” and then all the people who see this post are horrified and it would have been downgoated into oblivion with the second title. \n\nBut then, there are posts with typos in the title which are infuriating and should be correctable. \n\nSo, why?\n\nSee, I made a typo in my text, ugh. ",
        "created_utc": 1533835324,
        "upvote_ratio": ""
    },
    {
        "title": "The Tipping Point",
        "author": "q7t1",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/95yer2/the_tipping_point/",
        "text": "There will come a time when the number of accounts linked to Redditors who are dead will outnumber the ones linked to Redditors who are living. This was covered in part by an XKCD comic but related to Facebook. I am curious as to what issues might come forward in the future, will usernames become scarce? Will Reddit (assuming it continues functioning) become like a mausoleum or museum into the past or will it continue growing, adapting, with the living population of those who still visit the site... It's a super interesting proposition that the internet as a whole will grapple with over the next few decades. On a Reddit specific scale though I would love to hear your theories on what this situation could look like.\n\nCheck out /r/DeadRedditors as an example of this already happening to some extent...",
        "created_utc": 1533835053,
        "upvote_ratio": ""
    },
    {
        "title": "/r/politics moderators are selectively hiding certain comments from public view in order to shape their preferred narrative",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/95sumr/rpolitics_moderators_are_selectively_hiding/",
        "text": "[removed]",
        "created_utc": 1533784477,
        "upvote_ratio": ""
    },
    {
        "title": "Has there ever been a secret celebrity reddit account that was later revealed?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/95qhar/has_there_ever_been_a_secret_celebrity_reddit/",
        "text": "Has there ever been a secret celebrity reddit account that was later revealed? \n\nI don't mean doxxed, I mean they decided to stop being anon. \n\nAlternatively, has any celebrity had a reddit account *before* they became famous? ",
        "created_utc": 1533765273,
        "upvote_ratio": ""
    },
    {
        "title": "Why is reddit politics such an Echo chamber of leftism / liberalism.",
        "author": "insertnamehere405",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/95lzjc/why_is_reddit_politics_such_an_echo_chamber_of/",
        "text": "[removed]",
        "created_utc": 1533734823,
        "upvote_ratio": ""
    },
    {
        "title": "This is the kind of moderation that will ruin reddit",
        "author": "mystriddlery",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/95jj4w/this_is_the_kind_of_moderation_that_will_ruin/",
        "text": "[removed]",
        "created_utc": 1533709016,
        "upvote_ratio": ""
    },
    {
        "title": "old.reddit's robots.txt prevents wayback machine from archiving it? Can't archive anything in old reddit like CSS themes",
        "author": "twenty_characters_su",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/95cj15/oldreddits_robotstxt_prevents_wayback_machine/",
        "text": "[removed]",
        "created_utc": 1533655117,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people mark \"edited\" if their editing? Shouldn't they just post the edited version? Why all this extra information?",
        "author": "FoxtrotUnicornJuice",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/95aev3/why_do_people_mark_edited_if_their_editing/",
        "text": "[removed]",
        "created_utc": 1533637304,
        "upvote_ratio": ""
    },
    {
        "title": "Baldi is caillou",
        "author": "Raindeerzz",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/956464/baldi_is_caillou/",
        "text": "[removed]",
        "created_utc": 1533596154,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit has become a breeding ground for bad humor and schlocky irreverance.",
        "author": "Monsterdrama",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/95555j/reddit_has_become_a_breeding_ground_for_bad_humor/",
        "text": "Every reddit thread is bombarded by both. There is no discussion of the link or post. Just schtick cringe.",
        "created_utc": 1533589151,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there so many \"Does this count?\" types of post in obviously appropriate subreddits?",
        "author": "Bubbly_Taro",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/951haa/why_are_there_so_many_does_this_count_types_of/",
        "text": "Like a party parrots posted on partyparrot, floofs on floof or birbs on birbs.\n\nPosts with those titles seem to do better than average, so there seems to be an incentive of using titles like this.\n\nBut why is this?",
        "created_utc": 1533563722,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit is increasing the price of gold. Thoughts?",
        "author": "LoungeLeaks",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94ydnn/reddit_is_increasing_the_price_of_gold_thoughts/",
        "text": "Currently it costs $3.99 per month and they want to change it to $5.99 per month without adding any real features. Any opinions?",
        "created_utc": 1533531043,
        "upvote_ratio": ""
    },
    {
        "title": "How do you know if you have Reddit Gold?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94y0l7/how_do_you_know_if_you_have_reddit_gold/",
        "text": "[removed]",
        "created_utc": 1533527483,
        "upvote_ratio": ""
    },
    {
        "title": "Is this where to ask, what’s happening with removed Bangladesh OC and comments on Reddit the last day or two?",
        "author": "Stompya",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94xl35/is_this_where_to_ask_whats_happening_with_removed/",
        "text": "[removed]",
        "created_utc": 1533523542,
        "upvote_ratio": ""
    },
    {
        "title": "Does any one else think that political correctness is out of control on Reddit?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94tvhc/does_any_one_else_think_that_political/",
        "text": "[removed]",
        "created_utc": 1533492779,
        "upvote_ratio": ""
    },
    {
        "title": "Most duplicate comments on a reddit post?",
        "author": "225millionkilometers",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94pxh8/most_duplicate_comments_on_a_reddit_post/",
        "text": "[This recent post](https://www.reddit.com/r/dankmemes/comments/94f4tt/corey_struggs_aka_big_nia_has_officially_passed/?st=JKGGOJI6&amp;sh=10f5c9aa) in r/dankmemes had roughly 7k comments solely consisting of the letter F.  Can anyone think of a reddit post that has more duplicate comments?",
        "created_utc": 1533450431,
        "upvote_ratio": ""
    },
    {
        "title": "Banned from r/aww for 'vote manipulation' for uploading a video of puppies playing that had 8 upvotes. Is this normal? No explanations given.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94nd3z/banned_from_raww_for_vote_manipulation_for/",
        "text": "[removed]",
        "created_utc": 1533424663,
        "upvote_ratio": ""
    },
    {
        "title": "Frustrated with frequent reposts? - proposal for a repost filter...",
        "author": "min-1",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94m684/frustrated_with_frequent_reposts_proposal_for_a/",
        "text": "I suggested on r/ideasfortheadmins that Reddit should “have a background screening tool which informs the poster that the content was previously posted in the last (say) 6 months. It would then block new posts of that content until the agreed period had elapsed. \n\nSome OPs post new content to different relevant subreddits within a short period. I see no problem with this and somehow the filter should allow for this practice.”\n\nI was informed that admins don’t view reposts as a problem.  \n\nAm I the only one?  What do you think and if this gets a lot of upvotes how could we petition the appropriate admins?",
        "created_utc": 1533414520,
        "upvote_ratio": ""
    },
    {
        "title": "[deleted by user]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94il0a/is_it_possible_to_recover_banned_reddit_profile/",
        "text": "[removed]",
        "created_utc": 1533383470,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit and/or moderators should be more open about why people get banned",
        "author": "cyrilio",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94igdh/reddit_andor_moderators_should_be_more_open_about/",
        "text": "Reddit is at its heart an open forum for discussing all kinds of topics. There are definitely cases where a ban is appropriate. Such as with harassments, spam, breaking specific subreddit rules, etc. However, I think that to having more insights and openness about why people get banned helps increases comment/post quality and makes it easier to expose censoring/misuse by moderators.\n\nMy inspiration for this post came to me while I was making [this infographic](https://old.reddit.com/r/dataisbeautiful/comments/94hwaq/reasons_why_redditors_get_banned_on_rdrugs/) for r/Dataisbeautiful. ",
        "created_utc": 1533381864,
        "upvote_ratio": ""
    },
    {
        "title": "[deleted by user]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94hsm6/poll/",
        "text": "[removed]",
        "created_utc": 1533372765,
        "upvote_ratio": ""
    },
    {
        "title": "There Is No Point In Buying Reddit Gold",
        "author": "Tenzio",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94h69a/there_is_no_point_in_buying_reddit_gold/",
        "text": "I see no benefit in buying Reddit Gold that can't already be achieved without the $3.99 a month pricetag.\n\n-No Ads\nThis can easily be achieved by using AdBlock or some other ad blocking software\n\n-Reddit Themes\nIf you go on mobile (which is what I use most of the time) You can pick different themes in settings without Reddit Gold\n\n-Create A Custom Reddit Avatar\nNever seen someone actually using their custom Reddit Avatar as their pfp, either way all it takes is PhotoShop to achieve the same effect\n\n-New Comment Highlighting\nI don't see why this isn't already a feature of Reddit, if anything it shouldn't be a selling point for Reddit Gold\n\n-Remember What Links You've Visted Across Computers\nAgain I feel like this should already be a built-in feature of Reddit, it shouldn't really be a selling point for Reddit Gold\n\n-Create Secret Societies (Create Private Gold Member Only SubReddits)\nEver heard of a private SubReddit? Again this shouldn't be a selling point for Reddit Gold considering that you can already create private SubReddits..\n\n-More Comments Per Page\nOnce again this doesn't feel like a \"premium feature\", if anything it feels like they just tossed this in just so they could say that they were adding features\n\nThe last three features are basically a repeat of what I've been saying, however the only redeeming feature for Reddit Gold is that you get to test out new features for Reddit. Personally I don't care for Reddit Gold, but if you are a Reddit Gold member thats cool. I personally would prefer a little bit more bang for my buck.\n",
        "created_utc": 1533364566,
        "upvote_ratio": ""
    },
    {
        "title": "[deleted by user]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94dpi9/can_we_remove_thanks_for_joining_us_on_the_journey/",
        "text": "[removed]",
        "created_utc": 1533332373,
        "upvote_ratio": ""
    },
    {
        "title": "username u/nasa got re-appropriated",
        "author": "LowAsimov",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/94cqhm/username_unasa_got_reappropriated/",
        "text": "I noticed [the astronaut AMA](https://www.reddit.com/r/IAmA/comments/94aqd7/were_going_to_be_the_first_us_astronauts_to/) today was submitted by /u/nasa. I had never noticed this user being associated with NASA AMAs in the past, so I clicked to the overview page and saw they are a 2-month old user. It seems impossible that a world-famous four-letter acronym could have been unused for over 12 years, so I checked archive.org. sure enough they have a result from a couple of years ago for that user's overview page, which leads to [this post](https://www.reddit.com/r/reddit.com/comments/qzlm/beautiful_little_widgets_locked_in_flash_yourminis/). but the post and comment are now attributed to /u/*polhold00188 (a user with no overview page). I assume the asterisk in the name denotes it's replacement nature, but I'd never seen this before, so I thought I'd make a record of it here. I know reddit has in the past reclaimed specific usernames for use by more famous individuals (I believe they did this for President Obama's AMA), but I had no idea what went into it. ",
        "created_utc": 1533325251,
        "upvote_ratio": ""
    },
    {
        "title": "\"If your website's full of assholes, it's your fault\" - Anil Dash",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/946vf6/if_your_websites_full_of_assholes_its_your_fault/",
        "text": "[deleted]",
        "created_utc": 1533273786,
        "upvote_ratio": ""
    },
    {
        "title": "[deleted by user]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/944yf7/is_there_any_way_to_see_my_reddit_posts_rankings/",
        "text": "[removed]",
        "created_utc": 1533256933,
        "upvote_ratio": ""
    },
    {
        "title": "r/inthesoulstone getting more and more tribalistic",
        "author": "lion_OBrian",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93yzca/rinthesoulstone_getting_more_and_more_tribalistic/",
        "text": "Following the snap, where half of r/thanosdinothingwrong got banned from that sub only, said banned users were moved to r/inthesoulstone. In theorey the soulstone is for snapped users only, but:\n\n\n1)the sub is ripe with uninvolved and even spared reddittors, defying the entire point of the sub. This prompted 3 votes to wether or not make the sub private, which has been the preferred option in all 3 votes, but takes a long time to be fully implemented, according to the mods.  \n\n2)3 out of the 6 mods are spared (not part of the snapped users), sparking a wave of general discontent amongst snapped users  and of conspiracy theories as to why the sub is not private yet. \n\n\nThe thing is, any uninvolved or spared user gets downvoted and yelled out the sub once they out themselves as such or someone discovers the truth. Some even get called expletives, though it could be argued it’s part of the role playing nature of the sub. \n\nThere is a vehement call for the spared mods to step down and give snapped users with mod experience/desire the chance to replace them\n\nIt has gone as far as to spark the creation of r/modsdidsomethingwrong  as a database of unscrupulous moderators. \n\nAll in all there is a clear desire for the sub to go private and exclusively allow snapped users. \n\nIt’s an interesting social experiment which sees a group of people trying their hardest to be left amongst their peers and shun everyone else out. \n\n",
        "created_utc": 1533214159,
        "upvote_ratio": ""
    },
    {
        "title": "Why do some threads get little to no comments?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93xp57/why_do_some_threads_get_little_to_no_comments/",
        "text": "Sometimes I try to make a insightful discussion on subreddits but it saddens me when my threads receive no replies. Does anyone have any idea why certain threads tends to not get any response?",
        "created_utc": 1533200959,
        "upvote_ratio": ""
    },
    {
        "title": "[deleted by user]",
        "author": "surrealfaith",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93w88o/dont_lose_her/",
        "text": "[removed]",
        "created_utc": 1533184465,
        "upvote_ratio": ""
    },
    {
        "title": "Could Reddit Gold become more popular/funded if it increasing the user's voting power?",
        "author": "JustinJamm",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93w35m/could_reddit_gold_become_more_popularfunded_if_it/",
        "text": "Could even be as simple as going from 1 up/down vote per post/comment to 2.\n\nCould also be bigger than that.\n\nOr would this just make it so everyone without Reddit Gold would stop voting because they felt kinda powerless?",
        "created_utc": 1533183111,
        "upvote_ratio": ""
    },
    {
        "title": "posts with a single spelling mistake seem to do very well on Reddit. what causes this phenomenon?",
        "author": "Dogfoodburger",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93usjh/posts_with_a_single_spelling_mistake_seem_to_do/",
        "text": "it seems like a disproportionate amount of popular posts have a single spelling mistake. why would that be? ",
        "created_utc": 1533171165,
        "upvote_ratio": ""
    },
    {
        "title": "Can you all downvote this post and my comments please? I want to see if I can get negative karma on this new account.",
        "author": "Humane-Human",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93prlc/can_you_all_downvote_this_post_and_my_comments/",
        "text": "[removed]",
        "created_utc": 1533136042,
        "upvote_ratio": ""
    },
    {
        "title": "Can you all downvote this post and my comments please? I want to test whether I can get negative karma on this new account.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93pns9/can_you_all_downvote_this_post_and_my_comments/",
        "text": "[removed]",
        "created_utc": 1533135317,
        "upvote_ratio": ""
    },
    {
        "title": "Bot comment randomly received ~12 downvotes within &lt; 10 seconds of being made.",
        "author": "WorseThanHipster",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93pbm8/bot_comment_randomly_received_12_downvotes_within/",
        "text": "I made a (admittedly shitposty) reply to a bot comment, and approximately 25 second after my comment, I got an alert to a reply by the same bot, which I immediately clicked.  To my shock, ~~[the reply comment](https://www.reddit.com/r/progressive/comments/93m3y9/trump_makes_it_clear_that_he_hasnt_been_in_a/e3eu8le/)~~ was already @ `-11`.  I hovered over the timestamp and it had been made ~10 seconds prior.  When the page loaded it was probably less than 5 seconds old.\n\nKeep in mind, my comment was &lt; 30 seconds old and, I made it myself obviously, so I can assure everyone this isn't simply a case of an offset clock on a server somewhere.  What gives?  Any ideas?\n\n—-\n\n\n\nLooks like the mods removed it. It was something like “bananaFactsBot_11” or something. It literally gave banana facts and the comment above mine in that thread was also one, upvoted to +6. ",
        "created_utc": 1533132914,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion: Should The Karma System Be Removed? If So What Would Be A Better System To Take Its Place?",
        "author": "Tenzio",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93ntfl/discussion_should_the_karma_system_be_removed_if/",
        "text": "I feel that the Karma system works but only in certain subreddits. For example, a meme subreddit where mostly comedy content is consumed is perfect for the Karma system. However in a serious subreddit, maybe one based on debate the Karma system becomes kinda flawed. Most people on this website don't post their true feelings, and opinions for fear of being downvoted. Especially new users who only start off with only 1 Karma point.\n\nAt the moment I can't think of a better system to replace the Karma system, as most established systems are either too similar or too complicated. ",
        "created_utc": 1533119617,
        "upvote_ratio": ""
    },
    {
        "title": "My theory of still moving picture illusions",
        "author": "TheTechKidd",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93kgp5/my_theory_of_still_moving_picture_illusions/",
        "text": "[removed]",
        "created_utc": 1533086470,
        "upvote_ratio": ""
    },
    {
        "title": "Jackie",
        "author": "Mr_Nov",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/93elf7/jackie/",
        "text": "[removed]",
        "created_utc": 1533044678,
        "upvote_ratio": ""
    },
    {
        "title": "Does downvoting discourage debate?",
        "author": "cmdrrockawesome",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/939jgy/does_downvoting_discourage_debate/",
        "text": "If you’re in an argument/debate/discussion with someone (or a group of people) and you are holding a less than popular view, does the upvote/downvote system actually encourage heart debate? I know that the voting system isn’t necessarily designed to comment on the validity of an argument (unless I’m incorrect), but it effectively does. Especially when a heavily downvoted comment is minimized and hidden from the general browsing public. \n\nIs there a better solution or is this just what we have to deal with? I feel like it makes people censor their comments, but not necessarily in a good way. At least not always. ",
        "created_utc": 1532995901,
        "upvote_ratio": ""
    },
    {
        "title": "Big cryptocurrency opportunity. Two coins are about to swap. High ROI. Take it or leave it.",
        "author": "RippleEffect1000",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/939dtx/big_cryptocurrency_opportunity_two_coins_are/",
        "text": "[removed]",
        "created_utc": 1532994663,
        "upvote_ratio": ""
    },
    {
        "title": "The Mirror Theory",
        "author": "emomaddie",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/92y8ru/the_mirror_theory/",
        "text": "[removed]",
        "created_utc": 1532900005,
        "upvote_ratio": ""
    },
    {
        "title": "What about a super gild option that costs 8 instead of 4 dollars. Also what about an anti-gild option where if you hate a comment so much that you can pay for that user to have a worse or slower experience of Reddit for a month",
        "author": "kda184",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/92x01y/what_about_a_super_gild_option_that_costs_8/",
        "text": "[removed]",
        "created_utc": 1532890119,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion: What is the primary objective of the average Reddit user's browsing experience?",
        "author": "xx2Hardxx",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/92v0kx/discussion_what_is_the_primary_objective_of_the/",
        "text": " I hope this post is okay, I've lurked this sub for a while but haven't ever posted.\n\nTo restate the question: What are most Redditors attempting to satisfy with their browsing experience?\n\nObviously you're going to find a wide spectrum of viable answers to such a broad question. For some it could be harmless entertainment, for others a forum for (potentially) heated discussion on issues ranging in severity. Some may use it as their primary news source, others may exclusively browse humorous subreddits, and some may even rely on it as their primary NSFW supply. Of course, the answer changes significantly depending on the demographic being focused on: is it a specific, rather low population subreddit, or is it a massive mainstream one with hundreds of thousands of subscribers?\n\nI think simply saying \"Entertainment\" doesn't really function as a one-size-fit-all answer either. I am fully convinced that a non-insignificant portion of Reddit's userbase pursue above anything else gratification that they are \"correct\". I.e., their opinion is shared by enough people that they feel validated, that their understanding of a historical event (for example) is the most accurate and therefore they are intelligent for having spread the word, etc. Reddit users make many jokes about the infamous popular \"unpopular opinions\", but they truly are common occurrences. These are the people who have inspired many stereotypes/tropes about \"Internet Warriors\", \"Armchair Experts\", whatever you'd like to call them, and I believe that Reddit's voting and karma system inherently attract these types of attitides, for better or worse.\n\nThese types of discrepancies come up all the time in the general, Entertainment-based subreddits when a news story or other kind of post is made that initiates a level of discussion beyond whether or not the content was \"enjoyable\". Pulling my own biases into this post, but for example, an article about John Lennon describing his life philosophies and how he incorporated it into his music or something like that. Some people may read the article and think, \"man, it's really cool to read about the mentality that inspired his songwriting,\" and inevitably others will instigate the matter into a, \"but he's a piece of shit woman-beater, how can you respect him as a person or his music?\" sort of discussion. Ultimately it varies on which direction the comversation will progress, and it can be nigh impossible to achieve a coexistence without one perspective trying to overpower the other.\n\nWhat are your thoughts? Is Reddit indeed primarily filled with people seeking simple, harmless entertainment, or is it dominated by the fact-hunting individuals who desire to be the most correct over anything else? How do these population distributions vary between subreddits of vastly differing sizes? How would one best articulate a sort of middle ground between the two? Do you think this population distribution would be different if the voting/karma system functioned differently? If it didn't exist at all?",
        "created_utc": 1532873530,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people on Reddit make proper use of capitalization and punctuation?",
        "author": "ultramarineyellow",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/92rms2/why_do_people_on_reddit_make_proper_use_of/",
        "text": "Sites like Tumblr and Twitter seem to have left these behind in their growth.",
        "created_utc": 1532831712,
        "upvote_ratio": ""
    },
    {
        "title": "How to unarchive an archived post that is current again?",
        "author": "MonkeyTacoBreath",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/92neo4/how_to_unarchive_an_archived_post_that_is_current/",
        "text": "[removed]",
        "created_utc": 1532795630,
        "upvote_ratio": ""
    },
    {
        "title": "Does crossposting (using the crosspost feature) hurt a post's score?",
        "author": "NotActualyAReference",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/92nc83/does_crossposting_using_the_crosspost_feature/",
        "text": "The devs have said that one of the things crossposting does is keep the same post from being shown to a person multiple times.\n\nSo let's say that you crosspost it to two subs, and most of your audience is subscribed to both subs. In a normal case they would see both posts, but using the crosspost feature, they will only see one or the other. Won't this leave you with two posts that are half score, instead of a single, high-scoring post?",
        "created_utc": 1532795105,
        "upvote_ratio": ""
    },
    {
        "title": "I automatically downvoted +1000 posts without my consent",
        "author": "gulumei",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/92kj6t/i_automatically_downvoted_1000_posts_without_my/",
        "text": "I pratically never downvote anything, i mean I think I down-voted like 30 posts since I started using Reddit. When I went to my \"down voted post page\", I just see like hundreds of posts I downvoted, it was post I never saw in my life, pratically all were post of r/FortNiteBR or r/Strasbourg or r/france or r/gtaonline whereas I never went on thoses subreddit in my life except for r/france.\n\n**Do you think Reddit downvote things with your account for any reasons ? Is it the reason why you always get insta-downvoted when the first hour you posted a thing on reddit ?**\n\nIs it the same for you ? I checked all the logs, 0 applications have the control of my account except reddit for android, and noone connected to my account except me. My account is not still connected on any other computer.\n\n**EDIT:** No it's not my thumb who misscliked. I never use reddit on mobile, just few times at toilet. I never browse the front page, and i **never went on those subreddit except for** r/france. Also, i don't have kid or little brothers. Also, it's only on my downvote and not in my upvote, who are clean as hell. So it's not just a guy who use my account for fun. All the downvote are concentrated in time, the majority were 2 months ago and spread in few days.\n\nu/kalabash is maybe right saying my acount is used by karma farmer with their script. The downvotes are centralised on r/xboxone r/gtaonline r/FortNiteBR so pretty much xbox gaming. Also on r/Strasbourg and r/france\n\nSince i'm active on r/france only. Should it be possible that somebody from r/france and r/Strasbourg is guilty ? (just a  idea tho). Coincidence, i'm moving to strasbourg in 1 week to live there.\n\n^(and please stop telling me to buy a carbon monoxyde detector i'm healthy boi as hell)\n\n**EDIT 2**: thanks to a lot of users, I realized all the downvotes are centralised on 3 reddit users. One that get in trouble because of a fake post, one that is apparently a strong extreme activist in Paris and the third one I haven't identified what could trigger someone to attack him with my account. I contacted the mods. I think the mystery is starting to clearing himself \n\n**EDIT 3**: What the fuck ??!! [I just got banned from reddit](https://imgur.com/a/dBCfy8S) (smartphone screen because with computer it just show [this](https://imgur.com/a/IpF3ES3). I suceeded in recovering the account by following the procedure tho. I disconnected from all accounts and changed my password. I contacted the mods.\nThanks you so much everyone who helped me. I'm pretty much safe right now, it just depends how far i wanna go to find how it happends.",
        "created_utc": 1532764752,
        "upvote_ratio": ""
    },
    {
        "title": "I want information on the Theory of Online Communities, please help!",
        "author": "oldaccount29",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/92k8hh/i_want_information_on_the_theory_of_online/",
        "text": "Hello, Im very interested in researching how different choices that online games, forums, websites, chatrooms, video chat sites etc affect their communities.\n\nThis sub is certainly an excellent resource for reddit and I love it, but Im interested in a variety of things. Here is just a small sample of the type of questions im interested in.\n\nGames:\n\nHow can game developers make a environment that will shape their player base into a healthy and non toxic one? In a game like Rust players fight against each other, as well as form an alliance. and they can talk to strangers (and \"enemies\") over their microphones.  This was a design that allows for people to kill someone and then not just do something like teabagging, but yell in the mic all sorts of things, but it also allows for unique positive interaction between players.\n\nIn a game I dont remember, the devs implemented a new anti hacking algorithm and banned thousands of players, and announced they could come back if they filmed and uploads a video of themselves apologizing for their shameful behavior.  Did this have a positive result? \n\nIf you were designing a game, what features, rules, etc might be implemented if you were going to focus on making a healthy positive community? \n\nForums:\n\nReddit has an upvote system which pushes generally mostly fairly quality content to the top.  but it also has a number of flaws and downsides. We know that posts can be manipulated by people or groups by voting with fake accounts. We know that the first few votes on a post often matter more than hundreds that come after them. We know that common knowledge, even if its incorrect, and common opinions even if wrong will often win out over truth if more people believe them (which they do).  \n\nThere are other sites that are similar to reddit, that take different approaches. Steemit.com is an example: https://steemit.com/faq.html#What_is_Steemit_com    -  This comes with its own flaws.\n\nYoutubes comments section is known for often being trash. Is there a way that this could be improved without massive resources being invested?  Youtube tried a system, I dont know if they are still doing it, where certain users get to police content. this got a lot of backlash.  What other options are there?\n\n\n\n\n--------------------------------------------------------\n\nSo thats the type of thing Im interested in.  Are the literal experts who study this? Is there a feild that this falls under?  Are there books that discuss this type of thing?  Any information you have would be greatly appreciated.\n\n\nI know games/sites/etc have \"community managers\" which sounds promising, but i think in practice they tend to be promoters, event coordinators and \"image management\", though I could be wrong.",
        "created_utc": 1532760918,
        "upvote_ratio": ""
    }
]