[
    {
        "title": "Who runs the /u/lol33ta account?",
        "author": "Narrative_Causality",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/55p100/who_runs_the_ulol33ta_account/",
        "text": "[removed]",
        "created_utc": 1475518275,
        "upvote_ratio": ""
    },
    {
        "title": "The problem with personal karma scores being displayed on user comments using RES",
        "author": "wobinidan",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/55nzsk/the_problem_with_personal_karma_scores_being/",
        "text": "So I've been using RES for a while, and after spending a while in some smaller subreddits, particularly political ones, I've noticed that certain regular users are showing up frequently enough that I start to have opinions about them rather than their comments.\n\nThis is exacerbated by RES showing how many times I've upvoted or downvoted them in the past. For those that don't have RES, once you downvote someone once, their username will have a -1 displayed next to it.\n\nSo I find myself reading a comment, agreeing somewhat with the premise and then seeing a -5 next to their username. This makes me hesitate to upvote them, even if I agree with them, since I obviously disagreed with them before. I don't really want to reward them, nor do I want to diminish the ability to differentiate them from other posters.\n\nI am generally only on reddit for the content of people's posts, and I'm not a fan of drama created between users. Until recently, everyone was anonymous to me. \n\nSo, what do you guys think? Is this a negative feature of RES? ",
        "created_utc": 1475506169,
        "upvote_ratio": ""
    },
    {
        "title": "How does the program for /r/spam decide which user accounts to delete?",
        "author": "BrunoBMT",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/55jdof/how_does_the_program_for_rspam_decide_which_user/",
        "text": "I've been submitting things to /r/spam recently and it seems like only half of the userpages I submit get IDed as spam accounts and deleted. I'm having a hard time telling the difference between the ones that get deleted and the ones that don't. For example, I thought the bot would have considered [this userpage](https://www.reddit.com/user/suekahnreadnow) full of spam, but I submitted it a few days ago and it's still there. Usually the account gets deleted in a few minutes or not at all. This one in particular bugs me because the account is blogspamming subs like /r/dyslexia and /r/specialed.",
        "created_utc": 1475431368,
        "upvote_ratio": ""
    },
    {
        "title": "Has the demographic of reddit become more juvenile in the past two years?",
        "author": "moccajoghurt",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/55fobs/has_the_demographic_of_reddit_become_more/",
        "text": "I have been a heavy reddit user about 6 years ago but lost interest after a while. Today I spent a bit more time here and started reading comments on the popular subreddits again.\n\nTo me it looks like there has been a significant downfall of the quality of the posts.\n\nComments like \"holy shit\" or \"you are kidding, right?\" were at the top, while comments that are more indepth were at the bottom.\n\nIt feels a bit like reading Youtube comments or comments of popular facebook pages.\n\nDo I feel that way because I am a bit grumpy today or can you confirm that there is indeed a change in the demographic?",
        "created_utc": 1475362927,
        "upvote_ratio": ""
    },
    {
        "title": "All the comments in this r/AskReddit thread are downvoted below threshold. I've been on reddit for over a year now and have honestly never seen anything like this before. Can someone tell me what is going on?",
        "author": "bkiddo22",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/55fi95/all_the_comments_in_this_raskreddit_thread_are/",
        "text": "Link to the thread: https://www.reddit.com/r/AskReddit/comments/55f8v2/who_was_your_worst_teacher_why/.",
        "created_utc": 1475360435,
        "upvote_ratio": ""
    },
    {
        "title": "Is Reddit testing real crossposting?",
        "author": "shopthor",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/55e89d/is_reddit_testing_real_crossposting/",
        "text": "I saw this on my frontpage today:  http://i.imgur.com/lYXgX0b.png.  As far as I know, Reddit \"crossposting\" has always been plain-old double-posting.  I looked for an announcement of a new feature but didn't find one.  Cross-posting would be great if it exists.  Did I miss something?",
        "created_utc": 1475343317,
        "upvote_ratio": ""
    },
    {
        "title": "A curiosity popped in my head: How would predictive text change Reddit comments?",
        "author": "sympathico",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/55bz3h/a_curiosity_popped_in_my_head_how_would/",
        "text": "[It's late, I just got back from my girlfriend's house, there's a live band jamming about 100 feet from me (ergo no sleep), I'm drinking a beer, and about to play a video game.](https://www.youtube.com/watch?v=gvKs2VLmVnY)  So, I wonder:  Would predictive text actually help or hurt the comments?  It would definitely make things much funnier, but also more helpful for those of us who have been crippled by this tool (I used to pride myself in my ability to spell, now I barely even try...is that a Pearl Jam lyric?).  Honestly, I use Google more often than I care to admit to fix my half-assed attempt to spell a word, when commenting on Reddit.*\n\n*Just checked my history.  I looked up mannorisms [sic], because I cared a lot about expressing myself when it comes to large English dwellings, I suppose.  Nope, mannerisms, idiot. Copy/paste, and I was done with it.",
        "created_utc": 1475299851,
        "upvote_ratio": ""
    },
    {
        "title": "I think that smaller subreddits only use Reddit to inform/organize mods; Bigger Reddits use a 3rd party service and when they suffer drama the leaks of 3rd party communications is treated worse than internal Reddit Modmail leaks",
        "author": "Sachyriel",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/55a2yg/i_think_that_smaller_subreddits_only_use_reddit/",
        "text": "So this theory comes in 2 parts.\n\n1. Smaller subreddits don't really use 3rd party communications, preferring to handle moderation on Reddit and notifying other mods on reddit. Large subreddits have 3rd party websites or software where multiple mods logged in at a time can communicate. \n\nA mod leak from the small subreddits is *usually* modmail on reddit, a modleak from the big subreddits is on 3rd parties. This theory different from how these leaks are treated when they're from different sources.\n\n2\\.  Screenshots of modmail aren't as convincing as screenshots or text dumps of 3rd party websites (like a modmail leak transcribed onto pastebin). I think Reddit puts priority on upvoting/spreading the leaks hosted by 3rd parties **because** of the drama potential for a big sub, rather than a small sub. \n\n`TL;DR:`Reddit drama caused by small subs is just modmail screenshots; big subs use slack/skype/discord/whatever to communicate, and 3rd party Reddit leaks demand more attention.",
        "created_utc": 1475269574,
        "upvote_ratio": ""
    },
    {
        "title": "Kashmir attack: India 'launches strikes against militants Pakistan'",
        "author": "paradisefarmar",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/558vxr/kashmir_attack_india_launches_strikes_against/",
        "text": "[removed]",
        "created_utc": 1475254930,
        "upvote_ratio": ""
    },
    {
        "title": "What are your feelings about the removal of a valid question by r/science mods during an ama about racism? The question (in the body) shows research that goes against what the scientists doing the ama were researching.",
        "author": "trenil",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/557faa/what_are_your_feelings_about_the_removal_of_a/",
        "text": "[removed]",
        "created_utc": 1475234421,
        "upvote_ratio": ""
    },
    {
        "title": "Three identical videos are rising on /r/videos right now. They're all the exact same but on different sites, Twitter, Youtube, and some news site. This should provide some good data on how Reddit treats different sites.",
        "author": "DageParty",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/5541n0/three_identical_videos_are_rising_on_rvideos/",
        "text": "https://np.reddit.com/r/videos/comments/553ln6/ryder_cup_heckler_given_the_chance_to_make_the/d87ba4h\n\nThis guy is posting the same comment on each of these videos comparing titles and hosting sites to see which will go to the top. I think the Youtube one will win, but the Twitter one is ahead at the moment.\n\nOpinions? Which hosting site does reddit like better? I doubt the news site will go anywhere because it's such a hassle to view\n\nHis comment:\n&gt; ####Now which one of these three identical posts will go to the top?\n&gt; \n&gt; ---\n&gt; It's an interesting case study, they are all identical but vary in hosting site:\n&gt; \n&gt; Reddit Post | Host Site | Title | Submitter | Time (EST)\n&gt; ---|---|---|---|-\n&gt; [Link](https://www.reddit.com/r/videos/comments/553ln6/ryder_cup_heckler_given_the_chance_to_make_the/) | [Twitter](https://twitter.com/McIlroyRory/status/781535441233162241) | \"Ryder Cup Heckler Given the Chance to Make the Putt Rory Missed\" | /u/lazythunder | 2:21PM\n&gt; [Link](https://www.reddit.com/r/videos/comments/553vx5/fan_heckles_rory_mcllory_at_ryder_cup_rory/) | [YouTube](https://www.youtube.com/watch?v=7oGNjuCuLro) | **\"Fan Heckles Rory Mcllory at Ryder cup. Rory challenges the fan to make a putt for 100 dollars.\"** | /u/Kharizma_v2 | 3:15PM\n&gt; [Link](https://www.reddit.com/r/videos/comments/553mfe/watch_a_ryder_cup_heckler_pull_off_the_most/) | [USA Today](http://ftw.usatoday.com/2016/09/ryder-cup-heckler-fan-video-rory-mcilroy-henrik-stenson-made-putt-100?v=1.812360a08f77465b735) | \"Watch a Ryder Cup heckler pull off the most legendary move of all time\" | /u/lapekes | 2:25PM\n&gt; \n&gt; \n&gt; **Current Thread title is in bold.*",
        "created_utc": 1475178350,
        "upvote_ratio": ""
    },
    {
        "title": "Why does a site specific Google search on Reddit for \"pedophile\" return zero results?",
        "author": "BlueMacaw",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/550f28/why_does_a_site_specific_google_search_on_reddit/",
        "text": "I originally posted this in /r/NoStupidQuestions and it was suggested I ask here.\n\n\nIn /r/HelpMeFind, a user asked for help locating a Reddit post talking about and showing proof for systematic coverup of pedophilia amongst those in positions of power.\n\n\nMy go to method of finding a Reddit post is a site specific search on Google for keywords (Reddit's search function is mediocre). I was surprised that were no results at all. There are tons of Google results if you omit the specific site. But if you search \"pedophile\" in the Reddit search engine, thousands of results come up. I tried a couple of site specific searches on other search engines (Bing, DuckDuckGo) successfully; Google was the only one that didn't work.\n\n\nI found other search terms blocked were \"pedophilia\", \"pedophile\", \"child sex\", and \"underage sex\" when specifying site:Reddit.com but accessible for other sites (i.e. site:cnn.com or site:bbc.com). I'm genuinely curious as to why these Google searches return zero hits for Reddit. Is Google censoring Reddit?  Or is Reddit blocking Google?  A yes answer on the former is a little too \"nanny state\" acting by Google for my liking, and a yes on the latter raises concerns that Reddit might be shielding predators.\n\n\n\n\n",
        "created_utc": 1475121276,
        "upvote_ratio": ""
    },
    {
        "title": "I found out that in a sub where I have a high karma count, I am \"not allowed\" to start threads yet I can comment on them. What might be going on?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/550657/i_found_out_that_in_a_sub_where_i_have_a_high/",
        "text": "[removed]",
        "created_utc": 1475117320,
        "upvote_ratio": ""
    },
    {
        "title": "Are reddit's admins going to prison for obscuring evidence? According to this Youtube video, it definitely seems implied...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/54zz0j/are_reddits_admins_going_to_prison_for_obscuring/",
        "text": "[removed]",
        "created_utc": 1475114519,
        "upvote_ratio": ""
    },
    {
        "title": "On what basis do you accept the authenticity of posts/comments on Reddit?",
        "author": "Apostjustforthis",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/54vjgl/on_what_basis_do_you_accept_the_authenticity_of/",
        "text": "Subreddits like r/adviceanimals, r/oldschoolcool, r/pics, r/aww and several others thrive on the backstory that is attached to the content that is posted. Needless to say, the majority of the text based subreddits are essentially people sharing anecdotes from their life.\n\nComments, independent of which subreddit they are made in, are many times stories and anecdotes.\n\nWhat tells you they are true? After all, this is an internet forum, where nothing should be assumed true on the face of it unless proved in some way. Why do you upvote such posts? Do you simply upvote them because they're interesting/amusing etc. or do you also \"believe\" that the story attached actually happened?\n\nJust wanted general discussion in this regard. Feel free to comment on any related topic as well.",
        "created_utc": 1475055136,
        "upvote_ratio": ""
    },
    {
        "title": "Three different approaches to me using a script to delete all my posts",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/54upq6/three_different_approaches_to_me_using_a_script/",
        "text": "[deleted]",
        "created_utc": 1475037123,
        "upvote_ratio": ""
    },
    {
        "title": "Afait reddit had to revert to a 24hr backup very recently. Anyone notice?",
        "author": "andrejevas",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/54tan0/afait_reddit_had_to_revert_to_a_24hr_backup_very/",
        "text": "[removed]",
        "created_utc": 1475016177,
        "upvote_ratio": ""
    },
    {
        "title": "What is going on in this AskReddit thread? Huge string of golds for comments that aren't that great?",
        "author": "maynihc",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/54fnyt/what_is_going_on_in_this_askreddit_thread_huge/",
        "text": "https://www.reddit.com/r/AskReddit/comments/4w5wvz/redditors_who_have_been_banned_from_somewhere/\n\nSomeone drunk gilding is what some people in the thread think. Does this happen often?",
        "created_utc": 1474818762,
        "upvote_ratio": ""
    },
    {
        "title": "Procedurally generated reddit submissions are highly upvoted when they contain references to Trump or Clinton",
        "author": "Seahonk",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/54dpkw/procedurally_generated_reddit_submissions_are/",
        "text": "Here is a screenshot of /r/SubredditSimulator's front page from a few minutes ago  \nhttp://i.imgur.com/VfV2UXu.png\n\nFor comparison here is the top&gt;month sort from the same day  \nhttp://i.imgur.com/Q57Z3zm.png\n\nLow-investment readers, democratically curated spaces, click-bait spammers, and propagandists have a complex relationship enabled by procedural generation of fake content.\n\nThink there's anything interesting to see here?",
        "created_utc": 1474777336,
        "upvote_ratio": ""
    },
    {
        "title": "How the admins can fix r/all",
        "author": "1f90304",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/54dc6a/how_the_admins_can_fix_rall/",
        "text": "[removed]",
        "created_utc": 1474770728,
        "upvote_ratio": ""
    },
    {
        "title": "How the admins can fix r/all",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/54dar4/how_the_admins_can_fix_rall/",
        "text": "[removed]",
        "created_utc": 1474770054,
        "upvote_ratio": ""
    },
    {
        "title": "Downvoting is becoming insane",
        "author": "petrus4",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/54ahf5/downvoting_is_becoming_insane/",
        "text": "[removed]",
        "created_utc": 1474729590,
        "upvote_ratio": ""
    },
    {
        "title": "Having a Pause before Submission",
        "author": "BeABetterHumanBeing",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/54887x/having_a_pause_before_submission/",
        "text": "[removed]",
        "created_utc": 1474682741,
        "upvote_ratio": ""
    },
    {
        "title": "Comment Karma",
        "author": "SpinalPrizon",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53zara/comment_karma/",
        "text": "[removed]",
        "created_utc": 1474555678,
        "upvote_ratio": ""
    },
    {
        "title": "How did Reddit manage to get a Trademark on AMA? Isn't that the equivalent of trademarking \"lol\"? Did someone at Reddit come up with the name or was it something the community came up with and it stuck?",
        "author": "godelbrot",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53sp2j/how_did_reddit_manage_to_get_a_trademark_on_ama/",
        "text": "It blows my mind that they were able to get this. And I really don't understand under what cases it would be infringed. \n\nIf Sarah Silverman wants to have a questions session on twitter is she allowed to say \"I'm SS, Ask me Anything\"? Is she allowed to say \"I'm SS, AMA\"? Or would only be if twitter rolled out a feature directly for that? Could they call it Ask me Anything (non-abbreviated)? \n\n--------------\n\nI can't link to the trademark entry itself, because the site has a session timer, but if you go to http://www.uspto.gov/trademark\n\nclick on \"TESS   \nsearch trademark database\" \n\nscroll down to \"search trademarks\"\n\nclick \"basic word search\"\n\nenter \"ama\" into the search term box and select the \"live\" tick before searching\n\nthe 17th entry will be Reddit's\n\n----------------------\n\nI did some digging and apparently AMA has been around for a hell of a lot longer than reddit has been. It started on some AOL threads according to knowyourmeme and started getting used pretty universally on message boards. Which makes it even weirder than Reddit claimed it.\n\n-------------------\n\nI just did an AMA Request for the [guy who actually foudned r/iAMA and who apparently got iced out when it became so successful (and it's been removed) according to [u/earcaraxe's comment](https://m.reddit.com/r/TheoryOfReddit/comments/53sp2j/how_did_reddit_manage_to_get_a_trademark_on_ama/d7w1sxz)",
        "created_utc": 1474457625,
        "upvote_ratio": ""
    },
    {
        "title": "How did Reddit manage to get a Trademark on AMA? Isn't that the equivalent of trademarking \"lol\"? Did someone at Reddit come up with the name or was it something the community came up with and it stuck?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53so3q/how_did_reddit_manage_to_get_a_trademark_on_ama/",
        "text": "[removed]",
        "created_utc": 1474457132,
        "upvote_ratio": ""
    },
    {
        "title": "What could trigger a vote manipulation ban when there was no vote manipulation?",
        "author": "hadtomakenewname",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53kuuo/what_could_trigger_a_vote_manipulation_ban_when/",
        "text": "[removed]",
        "created_utc": 1474332769,
        "upvote_ratio": ""
    },
    {
        "title": "Does the user \"block\" function work on Web sites?",
        "author": "GonzoNation",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53khj8/does_the_user_block_function_work_on_web_sites/",
        "text": "[removed]",
        "created_utc": 1474327682,
        "upvote_ratio": ""
    },
    {
        "title": "How does the \"block\" function work? With reddit users under personal attack is it possible to all posts from an entire Web site such as the Daily Caller?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53jkvw/how_does_the_block_function_work_with_reddit/",
        "text": "[removed]",
        "created_utc": 1474316378,
        "upvote_ratio": ""
    },
    {
        "title": "Can you search for posts made in a subreddit on a particular day?",
        "author": "JenniferColeRhuk",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53hgu6/can_you_search_for_posts_made_in_a_subreddit_on_a/",
        "text": "Is it possible to search a particular subreddit for posts made on one specific day? I want to see how particular news stories in the media affected the traffic to r/ebola (e.g. the news that infected aid workers were going to be flown back to the U.S. for treatment; the news that a case had been diagnosed on U.S. soil for the first time). I have the subscriber growth stats (from reddit metrics), and the unique page views stats (as we downloaded them and saved them as the sub was growing) but I'd like to see exactly what types of post were being made, and where link posts were linking to.\n\nI've tried searching on dates (e.g. 2 August) but this brings up all posts that mention that date, not all posts that were made on it.\n\nAny suggestions appreciated, thanks!",
        "created_utc": 1474290684,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many people downvote everything on /r/all ?",
        "author": "CykaIdaNaHui",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53dxyg/why_do_so_many_people_downvote_everything_on_rall/",
        "text": "Hi guys, I dont know if this is the right place to ask but I am pretty curious. Basically posts like [this](https://www.reddit.com/r/funny/comments/53ckgb/a_science_teachers_worst_fear/) had like 11k upvotes and now it only has 9k upvotes and my question is: what's up with that? are those downvote bots or what's going on there? It's like that on every post that reaches /r/all ",
        "created_utc": 1474229890,
        "upvote_ratio": ""
    },
    {
        "title": "What percentage of the top comment in threads were also the first comment?",
        "author": "karmaslag",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53d5ep/what_percentage_of_the_top_comment_in_threads/",
        "text": "I imagine it is higher in lighter subs (funny, pics, videos) than more serious subs (askscience, history, etc)",
        "created_utc": 1474219789,
        "upvote_ratio": ""
    },
    {
        "title": "Do you systematically upvote a thread where you made a comment, in the hope that it will drive more traffic and therefore more karma to your comment?",
        "author": "sexyama",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53c71j/do_you_systematically_upvote_a_thread_where_you/",
        "text": "[removed]",
        "created_utc": 1474206329,
        "upvote_ratio": ""
    },
    {
        "title": "The BadX subreddits seem to get quite a lot of traffic, indicating that many Redditors enjoy discussing these topics. Why isn't it the case for r/AskEconomics and r/AskPhilosophy?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53bf8i/the_badx_subreddits_seem_to_get_quite_a_lot_of/",
        "text": "[deleted]",
        "created_utc": 1474188345,
        "upvote_ratio": ""
    },
    {
        "title": "Why such a massive difference in the number of posts submitted between these 4 similar sized subs?",
        "author": "MarkAusD",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53bd8f/why_such_a_massive_difference_in_the_number_of/",
        "text": "/r/Whatcouldgowrong: 285k subscribers - 3 posts today\n\n/r/nonononoyes: 276k subscribers - 1 post today\n\n/r/holdmybeer: 264k subscribers - 5 posts today\n\n/r/Youtubehaiku: 264k subscribers - 150+ posts today\n\nWhy does /r/Youtubehaiku have so many more posts? What does it have going for it, that the other subs don't? Is content easier to find? What suprised me is that /r/videos is the man giant of the YouTube based content subs and most people on Reddit prefer gifs over videos, with the other 3 subs being comprised of like 90-95% gifs! so I just am curious why the huge difference in activity, considering the other 3 subs are also of similar size?\n",
        "created_utc": 1474186804,
        "upvote_ratio": ""
    },
    {
        "title": "Does deleting all your own past Reddit comments have an effect on the account?",
        "author": "chainer3000",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/53abvf/does_deleting_all_your_own_past_reddit_comments/",
        "text": "Hi guys,\n\nI wasn't sure exactly which of the many communities I am a part of to post this to. I thought maybe AskReddit but they are a lot larger and I felt the question would be specific enough to violate the rules, so I thought I would ask this smaller community I've been a part of for quite some time. \n\n**Basically, I'm wondering if deleting all of ones prior comments would have any sort of effect on the account if it is still in use. **\n\nI typically try to post possible self-identifying comments using alternative accounts, but after 5+ years of using this as my main, I'd like to erase any possible breadcrumb trails I might have left. Despite periodically posting misinformation as a security measure, I'm thinking of deleting all my comments that are a month or older. Would that have any effect on my account - karma, posting ability, submission limitations, etc? \n\nCould anyone tell me which of the many programs out there would be best for this function? I just don't want to ditch my account, but I'd be okay deleting every comment on it as a 'purge' of some sort. \n\nThanks everyone!!",
        "created_utc": 1474164723,
        "upvote_ratio": ""
    },
    {
        "title": "why do subreddits have so many rules?",
        "author": "trdsystem",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/5394cb/why_do_subreddits_have_so_many_rules/",
        "text": "not just the rules on the sidebar, but also auto deletions, posts being removed, etc. It's a pain in the ass having to follow the rules of a dozen different subs. I even get posts deleted after following the rules.  If spam is such a problem, just get more mods. Or maybe just except that rules will be broken there and there, but not the end of the world or worth making the user experience hell. \n\nAnother problem is the lack of choices: although reddit is a large community, either you must submit to a large sub to get any views but have a high risk of deletion, or submit to a small sub but it will get very few views. The distribution is very skewed:  The top, most moderated subs get 99% of traffic.",
        "created_utc": 1474145973,
        "upvote_ratio": ""
    },
    {
        "title": "Setting up a Reddit experiment.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/538331/setting_up_a_reddit_experiment/",
        "text": "[removed]",
        "created_utc": 1474132042,
        "upvote_ratio": ""
    },
    {
        "title": "Are subreddit rules too often used as a way for mods or users to remove/report posts and opinions they do not agree with?",
        "author": "danny_b23",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/5351x2/are_subreddit_rules_too_often_used_as_a_way_for/",
        "text": "Especially in the politics and news subs, are subreddit rules too often used as a way for mods or users to remove/report posts and opinions they do not agree with?\n\nDo posts they disagree with get more scrutiny than others they agree with, when it comes to finding how much of the sidebar has been violated?",
        "created_utc": 1474073211,
        "upvote_ratio": ""
    },
    {
        "title": "Someone wrote a Master's thesis about a German circlejerk subreddit.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/532r3n/someone_wrote_a_masters_thesis_about_a_german/",
        "text": "[removed]",
        "created_utc": 1474043459,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many OP's of wildly successful submissions (things that are universally loved and make it to the front page) suddenly delete their posts, or even accounts?",
        "author": "Lurlex",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/52yvom/why_do_so_many_ops_of_wildly_successful/",
        "text": "Here's an example: I couldn't help but notice that the OP for this [Front Page post about a mouse being found in a dress](https://www.reddit.com/r/WTF/comments/51v0gr/my_friend_ordered_a_dress_online_and_it_came_with/) has recently deleted either their original successful post, or their entire account with reddit. The post seemed to be going well in my eyes, and they were reaping karma by the truckload. Not many people had anything negative to say.\n\nYet, the user deleted what I think (I can't remember for sure, but I know I've been in the right place at the right time to observe it in the past) may have been a long-lived reddit account that seemed to be in good standing, after having a successful Front Page post, out of NOWHERE. \n\nGranted, it's also possible that only the OP's posts in the thread were deleted, but that's just a less extreme example of the same kind of behavior -- walking firmly backwards from something they originally set out to promote. I've heard of people that ditch a 5-year-history of reddit cultural participation overnight, and managing to get their first front page post often seems to be the trigger.\n\nI do have some ideas, but I have no way to really know if they're true or not.\n\nIs it, \"Oh my God, I've revealed way too much and people know how to dox in 2016\"? Or, \"I thought I wanted to be upvoted to the sky, but now that I have it, I'm mentally exhausted by the flow of thoughts of random people on the Internet responding to me\"?\n\nHow many of them are getting called out (see /r/quityourbullshit) in a way that starts trending badly for them, and decide to bail out?\n\nWhat is it about the attention that's so scary?",
        "created_utc": 1473979411,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else spend forever trying to figure out the taxonomy of a post?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/52x1tg/does_anyone_else_spend_forever_trying_to_figure/",
        "text": "[deleted]",
        "created_utc": 1473957458,
        "upvote_ratio": ""
    },
    {
        "title": "I am so tired of pseudoscience in social science getting upvoted",
        "author": "JurijFedorov",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/52vgm8/i_am_so_tired_of_pseudoscience_in_social_science/",
        "text": "I have a psychology degree and I visit different subs on social science. Some of them have pseudo science as the most popular topics every week. Like a blog post with a random opinion that follows the main progressive thinking getting 200 upvotes. This irritates me a lot. I comment on these posts and tell them I disagree. But no one cares as when the circlejerk is in full speed nothing can stop it, it just goes through everything. The comments telling an anecdote that fits the pseudo hypothesis gets 100 upvotes. The correct rebuttal gets 10 downvotes and a snarky offensive comment.\n\nNow, I know it's not as big a problem in hard sciences that are apolitical. But I wish there was something besides the upvote and downvote bottoms. Even ignorant people can use a vote system. And often the title is pretty much the only thing they read. Like the title? \"upvote\". Title doesn't fit my worldview? \"downvote\". What about a system that only people with degrees or great knowledge on the subject can use? Or giving posts flairs like: \"Not a study\", \"Blog post\". What about giving certain users 10 votes per vote when the flair of the post is relevant to their field of study? Scientists are at least generally more correct than the public. At least this could be tried out in some subs. There is little to ruin in those subs anyway.\n\nSo, for me this is a huge proglem. The downvote/upvote system works maybe 85% of the time? But it's not perfect by any means. How do we fix this problem? Where do I go to actually discuss the science and not just fight the ignorant opinions on social science?\n\nDon't believe me? Try to visit r/asksocialscience and see for yourself. Look at the politically progressive answers that get upvoted. But anything that's even slightly fits the conservative values, no matter if it is true or not, gets downvoted. (BTW. I am not conservative. I am just saying that political progressive thinking is not correct 100% of the time)",
        "created_utc": 1473933981,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit is like the North Korea of the internet.",
        "author": "granthonyj",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/52tkqh/reddit_is_like_the_north_korea_of_the_internet/",
        "text": "[removed]",
        "created_utc": 1473898366,
        "upvote_ratio": ""
    },
    {
        "title": "Did /r/cringe which started about two or three years ago shame away much of Reddits OC (memes for example)- /r/Adviceanimals was almost kaput two years ago from the backlash?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/52tgai/did_rcringe_which_started_about_two_or_three/",
        "text": "[removed]",
        "created_utc": 1473896600,
        "upvote_ratio": ""
    },
    {
        "title": "There should be a day where all gold profits go to charity.",
        "author": "PM_ME_YOUR_SANS",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/52sx07/there_should_be_a_day_where_all_gold_profits_go/",
        "text": "[removed]",
        "created_utc": 1473889341,
        "upvote_ratio": ""
    },
    {
        "title": "The upvote/downvote karma system is severely flawed...",
        "author": "lunseisleidee",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/52sr2y/the_upvotedownvote_karma_system_is_severely_flawed/",
        "text": "As we all know, the upvote/downvote system of Reddit just doesn't work.\n\nPeople may get downvoted to oblivion just for politely expressing a personal opinion that isn't the common one of that particular subreddit.\nPeople end up fishing for upvotes, not trying to make a constructive discussion but only trying to come up with what the particular subreddit's hivemind approves of, or funny links.\n\nAnd the consequences of having to wait 10 minutes to post just because you said something that subreddit didn't like, is not encouraging any real discussion, but it's what forms the hivemind in the first place.\n\nNow, I don't know what IS the hivemind of this subreddit. If the hivemind here is to praise Reddit, I may get arbitrarily downvoted until I can't post here without waiting long minutes. Or maybe, my point of view is flawed, but the hivemind agrees with me and I'll be upvoted and only people like me will be encouraged to write here.\n\nIn short: the system is too flawed. We can't keep it like this. maybe removing the reddit-karma effects would be the first step.",
        "created_utc": 1473887313,
        "upvote_ratio": ""
    },
    {
        "title": "How does vote blurring work and why do we need it?",
        "author": "Kyle1337",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/52i7bu/how_does_vote_blurring_work_and_why_do_we_need_it/",
        "text": "I know that low scoring posts/comments (&lt;20 points) are practically untouched but as you go higher they tend to change more dramatically. I remember some of my top (archived) posts fluctuate up to around 50 or more points over the course of an hour.\n\nHow does this help reddit? what possible advantage could there be in not showing the true values once a post cannot be voted on? what is the threshold?",
        "created_utc": 1473733461,
        "upvote_ratio": ""
    },
    {
        "title": "Has new account discrimination and automoderation gone too far?",
        "author": "pastas00",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/52d99s/has_new_account_discrimination_and_automoderation/",
        "text": "I made this account 6 days ago and it has been absolutely exhausting trying to make a simple post or even engage in any community at all in any subreddit.\n\nEvery single time I try and make a post, it doesn't matter where, one of two things happens.\n\n1) Automoderator removes my post because my account is too new.\n\n2) Automoderator removes my post for some kind of weird rule that I am apparently breaking.\n\nThree times I tried to post a cool .gif of a rocket in three different subreddits. Two times it got deleted instantly because I'm too new, and a third time it got deleted because apparently .webm's aren't allowed in /r/gifs.\n\nI said okay, I'll go take a look at the PC gaming community. Let's get my feet wet. I see a giveaway thread, and OP said anyone older than 3 days can enter! Yay! I post. Oh wait, automoderator deleted my post instantly because I'm not 30 days old. Welp.\n\nThen I try and make a post in  r palestine...oh wait, deleted instantly because I'm not 30 days old. It's just one deletion after another. I cannot get a single post through. I have **never** seen a website punish the user this much.\n\nAnd I know what you are all going to say and I know it's reddit's favorite catchphrase, \"but the spammers!\"\n\nSeriously? Spam is your excuse? *Every single website* has figured this out by now, they have figured out an effective and efficient means of curtailing spam **without** making the real users suffer as a result.  Reddit, has not. It is happy to screw over legitimate users like me in the means of culling \"spam.\" \n\nWhereas every other website on the internet would let one spammer and 1000 real users through the gates, reddit would rather catch one spammer, and turn away 1000 genuine users. This website has a report AND a downvote function for spam. If these draconian policies aren't reversed this website isn't going to grow a healthy community. And it's not just me, I was talking to a girl friend about reddit and she said the same thing. \"Oh I tried to post there a couple times but my posts got deleted. I'll just use twitter or tumblr instead.\"\n\nThoughts? Or am I just going to get tons of downvotes and hate from vets?",
        "created_utc": 1473667074,
        "upvote_ratio": ""
    },
    {
        "title": "Is it true that /r/politics is censoring negativity against Hillary Clinton or is it just a conspiracy theory from Trump supporters who think shitposting is quality just because it's anti-Clinton?",
        "author": "MrOaiki",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/529foi/is_it_true_that_rpolitics_is_censoring_negativity/",
        "text": "[removed]",
        "created_utc": 1473613049,
        "upvote_ratio": ""
    },
    {
        "title": "Analyzing the frequency of comments containing Hillary vs. Trump over the past week",
        "author": "Stuck_In_the_Matrix",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/526lyv/analyzing_the_frequency_of_comments_containing/",
        "text": "I collect Reddit data and also feed Reddit comments directly into Google's BigQuery.  I used BQ to examine which subreddits have the highest frequency of comments related to the two main presidential candidates.  The reason for doing this was to better understand the underlying activity of various subreddits and which ones have a disproportional number of comments for one candidate vs. the other.  \n\n**Data Collection**\n\n------------------------------------------\n\nData was collected from BigQuery's real-time Reddit tables created by myself with the help of /u/fhoffa.  For more information on how to use this for your own analysis, you can use my blog posting at https://pushshift.io/using-bigquery-with-reddit-data/\n\nThe data below reflects the previous 7 days of activity on Reddit.\n\n\n**Results**\n\n------------------------------------------\n\nBelow are the top 100 subreddits with the number of comments containing Hillary, Trump and the total comments mentioning either for that subreddit.\n\nThe reason the \"Total Count\" column does not equal the counts for Trump and Hillary are because some comments contain both terms.  For example, if there were 5 comments and one contained both Trump and Hillary while two contained Trump and two contained Hillary, you would see a total count of 5 and a count of 3 for Hillary and 3 for Trump.\n\nSubreddit| Total Count | Trump | Hillary\n:--|--:|--:|--:\npolitics|54582|41147|20705\nThe_Donald|20996|14124|9304\nPoliticalDiscussion|5061|4290|1394\nhillaryclinton|4787|3315|2148\nAskReddit|3720|2824|1392\nEnoughTrumpSpam|3251|2766|803\nworldnews|2897|2438|703\nAskTrumpSupporters|1805|1581|465\nAskThe_Donald|1313|1054|466\nGaryJohnson|1260|1087|425\npics|1238|1015|381\nnews|1132|847|389\nconspiracy|997|560|580\nHillaryForPrison|884|349|646\nLibertarian|852|698|336\nKotakuInAction|727|521|348\nConservative|717|555|311\nIAmA|588|458|242\nWayOfTheBern|556|241|415\nEnough_Sanders_Spam|515|237|340\nKossacks_for_Sanders|466|261|297\nchangemyview|456|365|174\naskhillarysupporters|371|251|202\nuncensorednews|370|185|233\nnottheonion|346|281|89\ntodayilearned|335|251|119\njillstein|290|160|186\nfunny|284|216|89\nworldpolitics|282|197|131\ngifs|268|168|141\nvideos|262|213|70\natheism|247|210|58\nPoliticalHumor|246|171|98\nSubredditDrama|240|175|86\nAnarcho_Capitalism|228|202|57\ntechnology|226|162|91\ntelevision|213|170|80\nMensRights|213|128|132\ncringe|205|149|100\nukpolitics|198|180|32\nPolitical_Revolution|197|113|115\nforwardsfromgrandma|184|122|68\neurope|183|166|28\nShowerthoughts|176|140|62\nPOLITIC|159|94|99\nBlackPeopleTwitter|153|106|64\nGamerGhazi|146|134|29\nDallas|141|112|56\nEnoughHillHate|140|94|74\nwillis7737_news|139|127|64\nAdviceAnimals|139|106|51\nRepublican|136|116|37\nbadeconomics|133|113|30\nOutOfTheLoop|131|115|34\nCringeAnarchy|126|89|45\nTrollXChromosomes|119|67|69\nPoliticalVideo|118|81|60\ncanada|117|95|28\nsyriancivilwar|115|72|57\nprogressive|112|94|25\nAsk_Politics|108|97|27\nmovies|104|71|41\nTwoXChromosomes|103|84|24\nJokes|101|73|33\ndemocrats|99|66|47\nLiberal|98|69|53\nTrueReddit|97|79|27\nTumblrInAction|94|80|30\nSquaredCircle|94|84|16\nwallstreetbets|93|63|48\nsocialism|91|72|35\nmexico|90|77|24\nWikiLeaks|89|22|75\nCFB|88|59|30\nguns|88|61|42\nconservatives|88|75|30\nunitedkingdom|87|83|7\nWTF|87|60|32\nformula1|84|80|7\nDrama|83|65|27\naltright|83|66|27\nopieandanthony|80|51|42\nDNCleaks|79|38|52\nmetacanada|76|63|22\nEnoughLibertarianSpam|73|50|27\nNeutralPolitics|72|58|37\nasktransgender|72|58|21\nPhilippines|71|59|14\nAustin|69|48|24\nPurplePillDebate|68|54|29\ntexas|66|57|18\nmildlyinteresting|66|51|16\nConservativesOnly|66|58|29\nleagueoflegends|65|54|17\nShitPoliticsSays|65|53|23\nitaly|64|46|31\nRandomActsofTrump|60|52|12\nCanadaPolitics|59|52|15\nfrance|58|48|14\n",
        "created_utc": 1473562178,
        "upvote_ratio": ""
    },
    {
        "title": "What subreddit benefit from or could benefit from heavy and strict moderation from the mods?",
        "author": "KaiserCanton",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/5244qr/what_subreddit_benefit_from_or_could_benefit_from/",
        "text": "I was looking throught some older posts on /r/TheoryOfReddit and I clicked on a post from 4 months ago talking about the best and worsted moderated subreddits on Reddit, and then I came across this response comment which was a response to OP about the post.\n\n&gt; Not necessarily. I think that some subs will benefit from strict moderation more than loose moderation, and vice versa.\n\nSo that got me wonder what you guys think would benefit some subreddits if the mods there had to enforce heavy and strict moderation on?\n\nPost links\n\nPost: https://www.reddit.com/r/TheoryOfReddit/comments/4fbmz0/what_are_the_best_and_worst_moderated_subreddits/\n\nComment: https://www.reddit.com/r/TheoryOfReddit/comments/4fbmz0/what_are_the_best_and_worst_moderated_subreddits/d27nyht",
        "created_utc": 1473528553,
        "upvote_ratio": ""
    },
    {
        "title": "I made a website that generates VLC playlists from Reddit subs, so you can watch the videos (youtube, gifv) on a loop directly inside VLC Media Player. What do you think?",
        "author": "sexyama",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/5236na/i_made_a_website_that_generates_vlc_playlists/",
        "text": "[removed]",
        "created_utc": 1473515625,
        "upvote_ratio": ""
    },
    {
        "title": "I think I've found the highest rated \"100% upvoted\" post",
        "author": "SmokeyMcPotHead",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/522v1o/i_think_ive_found_the_highest_rated_100_upvoted/",
        "text": "[removed]",
        "created_utc": 1473509940,
        "upvote_ratio": ""
    },
    {
        "title": "Where do those long comment threads full of deleted comments by deleted accounts come from?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/5217lp/where_do_those_long_comment_threads_full_of/",
        "text": "[removed]",
        "created_utc": 1473476178,
        "upvote_ratio": ""
    },
    {
        "title": "What surprising things ARE allowed on reddit?",
        "author": "SoylentRox",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/520jzq/what_surprising_things_are_allowed_on_reddit/",
        "text": "[removed]",
        "created_utc": 1473466434,
        "upvote_ratio": ""
    },
    {
        "title": "Hopefully this is the right sub. Can anyone explain what is going on in the comments of this post?",
        "author": "Spiritsailor",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/51zid0/hopefully_this_is_the_right_sub_can_anyone/",
        "text": "So there's this post in a sub I follow:\n\nhttps://www.reddit.com/r/RedditLaqueristas/comments/51np2k/purple_geode_nails/\n\nI returned to it today to access the link for the tutorial and noticed that all of the downvoted comments seemed... Weird? The more I read them, I realized they were doing something similar to what the subredditsimulator bots do. They seem to have grabbed bits and pieces of OP's comments on her post and formed awkward comments. Most of the accounts seems to have fairly normal activity before these comments, but many have been inactive for a week or more before leaving this comment. What tipped me off was the two lowest rates comments both start out with the same phrase \"Started off well, but I kept fiddling with\" and that stood out to me.\n\nI've never noticed this happening before. I'm just curious what it is. Hopefully this was the right place to ask, I checked out all of the related subs but none really seemed quite right for my question.",
        "created_utc": 1473453108,
        "upvote_ratio": ""
    },
    {
        "title": "What is the actual top 1% of reddit?",
        "author": "loulan",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/51qofs/what_is_the_actual_top_1_of_reddit/",
        "text": "/r/top claims that it is for the top 1% of reddit, based on karma. They added me when they created the subreddit, but I highly doubt I'm in the top 1%. If you look at http://www.karmalb.com/, I'm #3664 in total karma, which *looks* like it would easily be in the top 1% of reddit if there 1.8 million accounts.\n\nHowever, I'm pretty sure *the very large majority* of these accounts are either accounts that were created but never used, accounts that haven't been active in years, throwaway accounts that were only used once, etc. So is there a way to estimate what is the real top 1% of reddit, counting only active accounts?",
        "created_utc": 1473331346,
        "upvote_ratio": ""
    },
    {
        "title": "Does the average upvote amount for the top ten posts each day usually increase daily?",
        "author": "MichaelTen",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/51o2jf/does_the_average_upvote_amount_for_the_top_ten/",
        "text": "[removed]",
        "created_utc": 1473288288,
        "upvote_ratio": ""
    },
    {
        "title": "Should reddit be a place where bots have a considerable voice in the discourse/discussions?",
        "author": "danny_b23",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/51nbbg/should_reddit_be_a_place_where_bots_have_a/",
        "text": "Should Reddit be a place where bots have a considerable voice in the discourse?  I know we have the power to upvote and downvote, but then again lots of subs/admins remind us to only upvote/downvote if it is/isn't a thoughtful contribution.  Is the only thing separating bots from spammers their thoughtful contribution to discussions? Are bots thoughtful contributors?\n\nedit: spelling, added 'their'",
        "created_utc": 1473279428,
        "upvote_ratio": ""
    },
    {
        "title": "Cake day",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/51gk50/cake_day/",
        "text": "[deleted]",
        "created_utc": 1473185855,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit is literally the front page of the internet.",
        "author": "MrNudeGuy",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/51fd58/reddit_is_literally_the_front_page_of_the_internet/",
        "text": "[removed]",
        "created_utc": 1473171011,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way to browse an inverted frontpage? Basically r/all without the subreddits I'm currently subscribed to",
        "author": "calming_loneliness",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/51bxvz/is_there_a_way_to_browse_an_inverted_frontpage/",
        "text": "Hi\nI usually browse r/all and when I'm done I switch to my Frontpage for more personalized content. It's annoying that I've already seen half the posts from my frontpage because a lot of them are also on top of r/all. \n\nIs there a way to quickly and easily filter all posts from r/all that are from subreddits, that I'm subscribed to?\n\nI'm sorry if this is the wrong sub. If it is maybe someone can point me to a more fitting sub?",
        "created_utc": 1473113968,
        "upvote_ratio": ""
    },
    {
        "title": "Are the results really random when you hit the random button?",
        "author": "I_LikeToReddit",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/51a5pc/are_the_results_really_random_when_you_hit_the/",
        "text": "I like using the random button to explore new subreddits. However I am noticing recently that when I cycle through a number of different subs that certain subs seem to crop up more frequently appearing more than once in the subs that are generated with 20 or 30 clicks. Each repeat lasting 1-3 days at a time. Are the results truly random or are they weighted some way such as number of subscribers, recent traffic, my subscriptions, my location etc?",
        "created_utc": 1473092471,
        "upvote_ratio": ""
    },
    {
        "title": "Why do the scores of my archived posts fluctuate?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/519l41/why_do_the_scores_of_my_archived_posts_fluctuate/",
        "text": "[deleted]",
        "created_utc": 1473084861,
        "upvote_ratio": ""
    },
    {
        "title": "People complain about a dominate mainstream media. Isn't Reddit a counter-force to this? Is Reddit a reason to be optimistic?",
        "author": "MichaelTen",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/516usu/people_complain_about_a_dominate_mainstream_media/",
        "text": "People complain about a dominate mainstream media. Isn't Reddit a counter-force to this? Is Reddit a reason to be optimistic? \n\nWhat do you think? ",
        "created_utc": 1473035481,
        "upvote_ratio": ""
    },
    {
        "title": "Hi",
        "author": "Jaxz416",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/50z49m/hi/",
        "text": "[removed]",
        "created_utc": 1472914162,
        "upvote_ratio": ""
    },
    {
        "title": "What percentage of Reddit is devoted to learning and education? What percentage of Reddit is devoted to entertainment and fun?",
        "author": "MichaelTen",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/50xxj2/what_percentage_of_reddit_is_devoted_to_learning/",
        "text": "What percentage of Reddit is devoted to learning and education? What percentage of Reddit is devoted to entertainment and fun? \n\nJust curious. ",
        "created_utc": 1472889990,
        "upvote_ratio": ""
    },
    {
        "title": "How does a submission yield so much positive traction?",
        "author": "cooldudedoe",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/50w7rk/how_does_a_submission_yield_so_much_positive/",
        "text": "I've been puzzled how this works. Does a submission in any sub-reddit yield more traction when the user has more Karma in that sub-reddit? I've noticed that submissions which appear on the front page are generally (or almost always) by people with high amount of Karma. Is this pre-submission or has the submission itself generated that much Karma?\n\nHope what I am asking makes sense. Perhaps its luck, perhaps I don't post what Reddit wants but my Karma generally gets around 3 then drops to 0...\n",
        "created_utc": 1472859801,
        "upvote_ratio": ""
    },
    {
        "title": "My apologies if this isn't the correct venue: do any tools exist that could show me top users for a subreddit?",
        "author": "AmericanDerp",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/50uvxu/my_apologies_if_this_isnt_the_correct_venue_do/",
        "text": "I'm curious along the lines of:\n\n* Top submitters (by volume/frequency and karma)\n* Top commenters (by volume/frequency and karma)\n* Top submitters and comments by karma per submission/comment\n\nI'd love to share a dataset like that with my subreddit. Previously, /u/dwaxe helped me put together a great report that was pretty well received, on what were our top submitted domains, by him pulling it from a data dump:\n\nhttps://np.reddit.com/r/Seattle/comments/4y954w/ever_wonder_what_rseattles_top_submitted_domains/",
        "created_utc": 1472842954,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Massanari's Learning From Reddit",
        "author": "mcleaner_leaner",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/50lfj3/thoughts_on_massanaris_learning_from_reddit/",
        "text": "Don't know if this is the most fitting subreddit, but I'm reading Adrienne L. Maasanari's Participatory Culture, Community, and Play (Learning from Reddit) for class. Does anyone have have any thoughts, opinions, or critiques on the book? ",
        "created_utc": 1472703276,
        "upvote_ratio": ""
    },
    {
        "title": "Rate me pop-up on mobile?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/50kl9z/rate_me_popup_on_mobile/",
        "text": "[removed]",
        "created_utc": 1472691461,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way to block all links to certain sites from appearing in subscribed subreddits?",
        "author": "my_lucid_nightmare",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/50anac/is_there_a_way_to_block_all_links_to_certain/",
        "text": "[removed]",
        "created_utc": 1472556858,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the ability to filter specific subreddits from /r/all a premium function and not available by default?",
        "author": "throwawaytimeson",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/5064yp/why_is_the_ability_to_filter_specific_subreddits/",
        "text": "This has never made sense to me. Shouldn't I have the ability to curate my /r/all without having to pay additional money to do so (e.g. gold) or download a third-party app?  ",
        "created_utc": 1472491321,
        "upvote_ratio": ""
    },
    {
        "title": "Why does the karma on the top posts of all time change each time I refresh the page?",
        "author": "boaza",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/500pr1/why_does_the_karma_on_the_top_posts_of_all_time/",
        "text": "Most of the top posts of all time have been archived, so people can no longer upvote or downvote them. However, when you refresh the page (at least on mobile), the karma for each post changes slightly. Does anyone know why this happens?",
        "created_utc": 1472409403,
        "upvote_ratio": ""
    },
    {
        "title": "Where do people get the idea that moderators should take a hands-off approach to content curation?",
        "author": "razorbeamz",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/500mre/where_do_people_get_the_idea_that_moderators/",
        "text": "I never understood the \"Let downvotes handle it!\" people. That's how the absolute worst subreddits do it.",
        "created_utc": 1472408380,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Reddit racist? (Proof in post.)",
        "author": "Hansungani",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zz9nm/why_is_reddit_racist_proof_in_post/",
        "text": "* First, visit /r/Whites\n* Second, visit /r/BLACKS\n\nSeems Reddit has more against blacks in particular than other races, too. See /r/Hispanics, /r/Asians, ~~/r/PacificIslanders~~ *doesn't yet exist*, ~~/r/Indians~~ *that's the baseball team* (or /r/NativeAmericans). Maybe even /r/Mestizos. (Did I forget any?)\n\nSo, how come? \n\nWhere are some pro-black subreddits by the way, that aren't banned?",
        "created_utc": 1472388966,
        "upvote_ratio": ""
    },
    {
        "title": "How does Reddit decide what to put in your feed? It doesn't seem to matter whether I'm on HOT or TOP but I seem to keep getting huge blobs of the same subs in a row. Like 5 posts from the same sub on my FP despite being subscribed to ~50 subs.",
        "author": "HappyCloudHappyTree",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zy2yp/how_does_reddit_decide_what_to_put_in_your_feed/",
        "text": "How does Reddit decide what to put in your feed? It doesn't seem to matter whether I'm on HOT or TOP but I seem to keep getting huge blobs of the same subs in a row. Like 5 posts from the same sub on my FP despite being subscribed to ~50 subs.",
        "created_utc": 1472361178,
        "upvote_ratio": ""
    },
    {
        "title": "How does Reddit decide what to put in your feed? It doesn't seem to matter whether I'm on HOT or TOP but I seem to keep getting huge blobs of the same subs in a row. Like 5 posts from the same sub on my FP despite being subscribed to ~50 subs.",
        "author": "HappyCloudHappyTree",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zxwox/how_does_reddit_decide_what_to_put_in_your_feed/",
        "text": "[removed]",
        "created_utc": 1472358032,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone noticing a larger volume of repost bots on major subs recently?",
        "author": "Maize-Haze",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zvazr/anyone_noticing_a_larger_volume_of_repost_bots_on/",
        "text": "I've been noticing a lot of bot posts on major subs like /r/pics and /r/trees lately, most with the exact same title as the original. This has risen in the last few weeks. Anyone else notice similar patterns? Any ideas why? ",
        "created_utc": 1472319887,
        "upvote_ratio": ""
    },
    {
        "title": "Why is /r/Politics just Trump hate?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zuniq/why_is_rpolitics_just_trump_hate/",
        "text": "[deleted]",
        "created_utc": 1472311292,
        "upvote_ratio": ""
    },
    {
        "title": "What's the deal with votes?",
        "author": "Lawsford_lawliet",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zsrpx/whats_the_deal_with_votes/",
        "text": "So I've been using reddit for around 2 years now but made an account only recently. What I still don't understand about this website is why people care so much about being up/down voted? Do karma points in some way result in money or something?",
        "created_utc": 1472273367,
        "upvote_ratio": ""
    },
    {
        "title": "How is autobanning users who have had anything to do with certain other unrelated subreddits not against the rules?",
        "author": "LawlessCoffeh",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zm64v/how_is_autobanning_users_who_have_had_anything_to/",
        "text": "[removed]",
        "created_utc": 1472176014,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think Reddit is one of the major catalysts for the rise of the Alt-Right movement? If so, Why do you think Reddit seems to attract so many people from the Alt-Right?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zm0i6/do_you_think_reddit_is_one_of_the_major_catalysts/",
        "text": "[removed]",
        "created_utc": 1472173929,
        "upvote_ratio": ""
    },
    {
        "title": "What reasons do most redditors delete comments?",
        "author": "Cloudhwk",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zglgo/what_reasons_do_most_redditors_delete_comments/",
        "text": "I have been wondering personally recently at what point do you consider deleting comments/posts ok?\n\nI know some redditors tend to view deleted comments/posts as victory.\n\nFor me personally it's usually because I'm tired of being in an argument with someone who will never ever back down from their perspective no matter how much proof you throw at them\n\nSo my question for the sub is what reasons does reddit think comment deletion is acceptable?\n\n",
        "created_utc": 1472096578,
        "upvote_ratio": ""
    },
    {
        "title": "Would a subreddit where mods are voted in and have to run for reelection work?",
        "author": "Basketball835",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zfdrl/would_a_subreddit_where_mods_are_voted_in_and/",
        "text": "[removed]",
        "created_utc": 1472079790,
        "upvote_ratio": ""
    },
    {
        "title": "I made a site that displayed the backpage of Reddit. Presenting notreddit.top, the most downvoted posts on reddit",
        "author": "programmerChilli",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4zd665/i_made_a_site_that_displayed_the_backpage_of/",
        "text": "www.notreddit.top\n\nSo first of all, I must say, I got the idea from https://www.reddit.com/r/TheoryOfReddit/comments/1kgvz4/i_created_a_link_to_the_back_page_a_page_that/\n\nEver since I saw that post (2 years ago), I thought it was a massive pain that I needed to manually change the link for different time periods (not to mention that going to the next page was a massive pain), and I wanted to make a site for doing it.\n\nWell I finally did do it. Hope you guys find it interesting.",
        "created_utc": 1472052844,
        "upvote_ratio": ""
    },
    {
        "title": "Redditors who started using the Hide button to clear away read posts, how did it effect your enjoyment of the site?",
        "author": "godelbrot",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4z8efi/redditors_who_started_using_the_hide_button_to/",
        "text": "While on the surface it is alot more instant gratification to see more content from lower down the rankings, I noticed myself feeling like Reddit was one big Inbox that turned everything into a chore.\n\nI also noticed I spent drastically less time in discussion, and more time just clicking through posts.\n\nAnyone else have similar/different experiences? ",
        "created_utc": 1471981924,
        "upvote_ratio": ""
    },
    {
        "title": "Downvoting: What It Should Be and What it Is",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4z7eld/downvoting_what_it_should_be_and_what_it_is/",
        "text": "[deleted]",
        "created_utc": 1471970496,
        "upvote_ratio": ""
    },
    {
        "title": "What were the negative effects that Reddit admins were trying to prevent when they chose to not allow you to edit your post titles?",
        "author": "godelbrot",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4z6hvx/what_were_the_negative_effects_that_reddit_admins/",
        "text": "I mean I get the usual changing a title to \"Upvote this if you like to eat babies\" as a joke or something like that, but Facebook has allowed this for years and I have actually never once seen it being misused in this fashion. I am sure it does happen, but at least with Facebook the positive convenience effects outweigh the negative of potential misuse. Perhaps it is the fact that Facebook is public profile?\n\nI am assuming that there must be other reasons that I can't think of.",
        "created_utc": 1471959562,
        "upvote_ratio": ""
    },
    {
        "title": "What were the negative effects that Reddit admins were trying to prevent when they chose to not allow you to edit your post titles?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4z6hj9/what_were_the_negative_effects_that_reddit_admins/",
        "text": "[removed]",
        "created_utc": 1471959424,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't I see much Reddit screenshots circulating online? What makes Reddit's dynamic so different from Tumblr, Twitter and 4chan?",
        "author": "NeedToRegisterQuick",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4z61lu/why_dont_i_see_much_reddit_screenshots/",
        "text": "This is coming from my own observations mostly via my Facebook feed (and in general).\n\nI see a lot of Tumblr, Twitter and 4chan screenshots being shared but rarely the same for Reddit.\n\nPerhaps its Reddit's user interface? Or is it the community?",
        "created_utc": 1471952665,
        "upvote_ratio": ""
    },
    {
        "title": "Do most users on Reddit not actually read the submitted articles/new articles on Reddit? And if so, why?",
        "author": "KaiserCanton",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4z44tm/do_most_users_on_reddit_not_actually_read_the/",
        "text": "I only join Reddit about 7 to 8 months ago and one of the thing I see sometimes in the comments from posts on a news article is that, users in comment section will ask other users if they have read the article to a news story, or post comments like \"This is Reddit, we don't read the articles.\" or something along those lines.\n\nIf this is true than why is it that people on Reddit don't read the articles or news articles on Reddit?",
        "created_utc": 1471917572,
        "upvote_ratio": ""
    },
    {
        "title": "Do most Reddit users not actually read submitted? And if so why?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4z40sk/do_most_reddit_users_not_actually_read_submitted/",
        "text": "[deleted]",
        "created_utc": 1471916118,
        "upvote_ratio": ""
    },
    {
        "title": "Do posts really change points that fast?",
        "author": "DinomanVI",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4z2vtx/do_posts_really_change_points_that_fast/",
        "text": "[removed]",
        "created_utc": 1471901204,
        "upvote_ratio": ""
    },
    {
        "title": "Why does Reddit seem to facilitate monolithic hiveminds?",
        "author": "politicum",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4z2vo0/why_does_reddit_seem_to_facilitate_monolithic/",
        "text": "I suppose every subreddit is independent of each other, so in the end they're all different inherently... but so-called karma (which is more akin to retribution than justice usually) is the ironic (because Hindu karma doesn't work this way) pivot it seems that facilitate these practical fiefdoms. I find it unbelievable how anyone even would think this site is ideal for discussion, since it's full to the brim with positive feedback (an endless reinforcement of one's opinions)... it's fine when it comes to computer problems, video games, or any other hobby practically... but not much else, I assume, since no one is allowed to dissent at all cost. Some subreddits are really totalitarian hiveminds, but whoever can say otherwise?",
        "created_utc": 1471901145,
        "upvote_ratio": ""
    },
    {
        "title": "Why is reddit gradually getting more toxic, especially in the comments for the front page stuff?",
        "author": "smilinreap",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4yz81u/why_is_reddit_gradually_getting_more_toxic/",
        "text": "No matter what the post is, it can be cute animals, patriotism, act of kindness gif, or even a video of an accidental death, Reddit seems to be growing increasingly more toxic. I was curious as to whether anyone has a reason why the community is getting worse and worse. Go to the comments for anything on the front page, and the most upvoted comments will always be an direct insult, an insult attempting to be funny, or just pure harassment. I remember a few years back before I had an account, these toxic posters lurked a lot more and certainly weren't the main source of upvotes. The upvotes were more of a, \"This is a fair point, relates highly to OP's post\". Now the upvotes are purely based on whether the reader liked/disliked said opinion. Also if anyone has a site like Reddit but slightly more moderated i'd love to give it a shot. I really enjoy reddit, but now I can't even read the comments and discussions for current news/viral videos because all I will read is insults, sexual jokes, or some other unrelated comment.\n\nEdited in* Thanks for the responses, I have discovered the defaults have changed to be a little more toxic (in my opinion, not factual), and the subreddits I originally joined while small that have grown are also gaining toxicity rather fast (as to where there originally was none) as the subreddits grow. This does not seem to be true for hobby subreddits, and after making changes to my subscriptions reddit is once again rather pleasent to surf the front page. \n\n*In short* Changing my subscriptions filtered out a large amount of toxicity.",
        "created_utc": 1471846797,
        "upvote_ratio": ""
    },
    {
        "title": "How much leeway should mods have in deleting non rule breaking posts?",
        "author": "informat2",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4yvng0/how_much_leeway_should_mods_have_in_deleting_non/",
        "text": "[removed]",
        "created_utc": 1471796741,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way to make all new posts from all your subreddits appear?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4ytojy/is_there_a_way_to_make_all_new_posts_from_all/",
        "text": "[removed]",
        "created_utc": 1471763916,
        "upvote_ratio": ""
    },
    {
        "title": "I just heard of a sub reddit called \"watchpeopledie.\" WTF. I refuse to look into it personally, but I'm wondering why that sort of thing is allowed on Reddit, and is there any question regarding the legality of what they are watching?",
        "author": "a_whiteroombyawindow",
        "url": "https://www.reddit.com/r/TheoryOfReddit/comments/4yrate/i_just_heard_of_a_sub_reddit_called/",
        "text": "[removed]",
        "created_utc": 1471728585,
        "upvote_ratio": ""
    }
]