[
    {
        "title": "Who are the most important younger (under say 50) English language directors now working?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8l3a6l/who_are_the_most_important_younger_under_say_50/",
        "text": "[removed]",
        "created_utc": 1526928833,
        "upvote_ratio": ""
    },
    {
        "title": "I actually liked Prometheus (Discussion)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8l1kjt/i_actually_liked_prometheus_discussion/",
        "text": "[removed]",
        "created_utc": 1526915778,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (May 21, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8l148s/casual_discussion_thread_may_21_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/)\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1526912049,
        "upvote_ratio": ""
    },
    {
        "title": "I'm having a hard time getting interested in movies if its not of the premise",
        "author": "Canvaverbalist",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kzue2/im_having_a_hard_time_getting_interested_in/",
        "text": "I used to be a cinema fan - I'd watch any movie for any reason whatsoever. But now, it seems the premises play 99% of the role of getting me to watch it. \n\nAnd I mean that in \"the more over-the-top it is, the more I'm intrigued\" a la \"He's a time-traveler, but he's also a mute!\"\n\nbut also the other way around, if it's simple as fuck, it must be really good for it to gain traction on such a simple premise: \"They killed his dog.\" \n\nIt seems 99% of the time, I hear a movie is good, I read the premise and think: \"Wow, that's really not interesting\", then I'd watch that movie 2-3-5 years later and think: \"Holy shit that was actually really good, even though I'm not interested in crocheting\" \n\nThe thing is that it seems I don't trust any critic whatsoever these days, even my friends, so it gets harder for me to get interested in movies I'm not already interested in, does that make sense? \n",
        "created_utc": 1526899116,
        "upvote_ratio": ""
    },
    {
        "title": "Subconscious appeals of the zombie genre in movies and video games",
        "author": "cun2nn2n",
        "url": "https://www.youtube.com/watch?v=HAJuFL4GEMc",
        "text": "",
        "created_utc": 1526897296,
        "upvote_ratio": ""
    },
    {
        "title": "Albert Camus, the myth of Sisyphus, and the absurdist philosophy of Charlie Kaufman’s Synecdoche, New York",
        "author": "TVDL",
        "url": "https://www.youtube.com/watch?v=j1LZ9EOMqsY",
        "text": "",
        "created_utc": 1526892127,
        "upvote_ratio": ""
    },
    {
        "title": "Do I just not understand Lars Von Trier?",
        "author": "tha317",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kysv9/do_i_just_not_understand_lars_von_trier/",
        "text": "So this story starts a few years ago when a friend highly recommended Nymphomaniac to me. Up until then I had only heard of Lars's films but had never watched any (honestly, I didn't have much interest in his graphic films like the Anti-Christ at the time), and seeing as the word was this was to be his Magnum Opus, I decided to watch it. Needless to say, that was 5h25m of my life I'll never get back. I really didn't like it. I honestly thought the film had a lot of problems that I think even the most amateur of film makers would have avoided, let alone someone creating their Magnum Opus.\n\nFast forward to a few weeks ago, someone kept recommending Dancer in the Dark to me and I decided to give Lars another chance. And I have to say, if you set aside the fact that I don't think Lars knows how to direct a musical, I actually was into the first half of the film and was preparing myself for one heck of a ride. But in true Lars style, a little into the film, the train that was the plot, left the train tracks and I lost all my emotional investment in the film. I won't get into the plot details here in case someone still hasn't seen the film (I'll be more than happy to point out these plot points in the comments below if anybody is interested), but these were massive plot holes that really made me wonder if nobody else wondered the same thing. Are all his films like this? Honestly, the only saving grace in the entire film was Bjorks performance. She was the only thing that kept me going to the end of the film.\n\nHaving said that, I guess my question is, how does Lars have a following? I'm genuinely looking to understand his appeal. I mean I know I've only seen 2 of his films (3 if you count Nymphomaniac as 2 films), but how many does one need to see before they know? Alternatively, if you'd like to discuss Dancer in the Dark, and how a film can get away with such massive plot holes, there's that too.\n\n(Edited) Ok, so I'm adding my issues with the film to give more context. I can't comment on Nympho because I have forgotten most of it but I recently watched DitD so I'm going to focus on that. I already posted this below as a response to another comment but I'm posting this up here for others who are just reading this now. Here goes:\n\n(Spoilers for Dancer in the Dark)\n\nDitD is a film about a woman trying to make the best of her son, and who will do anything for her son, including die just to avoid stressing him so he won't go blind (No idea about the medical accuracy of this). I'm completely on board with that but if that's the case, did she really have to kill Bill just because he asked her to? Couldn't she have waited it out till the cops showed up and cleared the whole thing up? And that's even setting aside the fact that I don't believe her character had the strength to bludgeon someone to death. After that, she still kept his secret in court? Really? Your son, the one you've done everything for, is going to lose his mother and you're focused on keeping some guys secret you barely knew? Set that aside, her lawyer couldn't prove the money wasn't Bill's? The whole time she was in court, I kept waiting for someone to even look at Bill's bank statements but nobody did. Bill stated earlier in the film that his wife spent all his money, how hard would it be to check someone's bank statements? Especially when somebody's life's on the line? And then when her friends got her a new lawyer, and decided to pay the lawyer with the money for her son's operation. Firstly, what clinic would actually give out patient information to strangers? Secondly, what clinic would offer a full refund to a complete stranger without some sort of consent from the client? Thirdly, even if they managed to get the money for the lawyer, they couldn't have added a little more money to make it a little less obvious they weren't paying for the lawyer with her own money? I talked about this with my friend, and she said it's because they're poor, and I get that. But they didn't even remotely try to raise more money?\n\nThe film was tragic for me up until the moment she confronted Bill for stealing her money. Past that, it all just seemed unnecessary. I don't couldn't feel bad for her, because it just seemed like she wanted to go down that path. \n\nBut I don't know, am I being too hard? Am I reading too much into this film? Are all his films so loosely based on reality, and films that you should feel more and think less while watching?",
        "created_utc": 1526884457,
        "upvote_ratio": ""
    },
    {
        "title": "The Dream's (深圳梦, 2017) trailer",
        "author": "Jerryphuong",
        "url": "https://www.youtube.com/attribution_link?a=sNaWk4Q9pYM&amp;u=%2Fwatch%3Fv%3D08BP1To8_4o%26feature%3Dshare",
        "text": "",
        "created_utc": 1526842067,
        "upvote_ratio": ""
    },
    {
        "title": "Infinity War illustrates a really common problem with War movies in general.",
        "author": "SketchyHippopotamus",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ktsl3/infinity_war_illustrates_a_really_common_problem/",
        "text": "Spoilers for Infinity War and LOTR: The Twin Towers\n\nEdit: Just to be clear I love both the Lord of The Rings and Infinity War, \n\nIn most War Movies, battles, particularly formation battles (i.e. The Battle of the Bastards, The Mummy 2, Lionheart, Wonder Woman, and basically all the battle in Lotr), make no. goddamn. sense.\n\nThey display not only a disinterest in, but almost an antipathy to sound tactics. And I think how boring the Wakanda battle was a direct result of this disinterest.\n\nThis isn't a nit-picky tirade either, let me emphasize this, I understand that sometimes the realistic thing is not always the best cinematic chioce. But when tactics are completely eschewed in favor of choreography heavy flourish (Individuals charging headlong into enemy alone into enemy formations), another thing goes with it. Any sense of consequence for any part of the battle that doesn't directly involve our protagonists.\n\nShowing at least semi realistic tactics means that events and choices happening in one part of the of the battle have consequence the ripple across the whole field. If lines didn't immediately disintegrate into one on one pairings where all cooperation immediately ceases, then a failure from one part of the battlefield would require a reaction from another, (plug up the hole, get higher on the hill) or barring that a coming sense of dread as people desperately fighting for their lives realize they're defensive position has fallen apart.\n\nIn movies, Soldiers charge seperately, ahead of and lagging behind their friends (that way they can let 5 spears try to stab them before backup comes instead of just 2) ironically movies usually depict the actual consequences pretty realistically, half your men die for no discernible advantage. When movie commanders (Like T'Challa) don't use basic military sense that they must have been told, simple things like keeping your soldiers together so that they don't get stabbed in the side or charging in unison so your combined weight bowls your opponents over, and then movie soldiers simply follow those orders, despite being pointlessly suicidal, it means that when people do die because of those decisions, I don't care. Neither the commanders nor the troops themselves seem worried about the needless death, so why would I?\n\nSince I don't want my example to lock people out b/c of spoilers I'm going to user LOTR as an example, but I'll do the same thing to Infinity War at the bottom.\n\nLORD OF THE RINGS\n\nI love LOTR, it is one of my favorite trilogy, I think is a unique and brilliant achievement, but I've known since about the 2nd time I saw that movie at the age of 10 that the battle of Minas Tirith made no sense. The lack of identifiable sense in the battles made it harder for anything that wasn't happening to the fellowship interesting.\n\nThere is one exception though. The battle of Helm's Deep. Widely considered one of the best battles in film history what made it so tense and gripping was not only did we know losing would have consequences for the civilian population, but that every part of the siege relied on every other part keeping the Urukhai back, they used tactics. Would Helm's Deep be up to snuff for a historian of military tactics, of course not, but that's not what they're for, they're there to illustrate choice and consequence, key to any action scene, at a massive scale. Any breach is a danger to everyone. No action, by either Mook, Red Shirt, or Protagonist, in Helm's Deepwas disposable (in fact the fate of the most disposable mook had in fact the greatest consequence)\n\nINFINITY WAR\n\n[This video about infinity war](https://www.youtube.com/watch?v=5jKQUDtppM0) points out that that whole battle lacked consequence. I want to imagine a better version that makes intuitive sense if the heroes actually wanted to win. Instead of charging half a mile down the and breaking apart to fight an enemy that vastly out numbers you, he parked closer and surrounded the spot he was going to open in the shield while the heroes kept the large numbers that tried to go through the shield at the side anyway at bay. If we actually thought that enemies getting past the mooks was Dangerous, think about how significant those blades would have felt if they meant the enemy was now poring in behind the infantry? how much relief you would feel if Wanda's appearance allowed the wakandan's to reform their defense?  These are visual things that wouldn't be hard to implement if they were built into your scene from the beginning. Choreography is beautiful, but it's only impactful in an action scene if it has stake. 300 pairs of choreographed dances does not have stakes. Humans working together to protect their fragile spark of life has stakes.",
        "created_utc": 1526834842,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of May 20, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ktk7n/what_have_you_been_watching_week_of_may_20_2018/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1526832652,
        "upvote_ratio": ""
    },
    {
        "title": "Im starting a blog all about music for film (soundtracks)- What, in your opinion, is the significance of music in film?",
        "author": "[deleted]",
        "url": "https://allegromediamusic.wordpress.com",
        "text": "[deleted]",
        "created_utc": 1526817774,
        "upvote_ratio": ""
    },
    {
        "title": "Transcend Learning - Trying to combine poetry and film, thoughts?",
        "author": "FantasticAnalysis9",
        "url": "https://www.youtube.com/watch?v=BtS0z4J0UWE&amp;t=2333s",
        "text": "",
        "created_utc": 1526813175,
        "upvote_ratio": ""
    },
    {
        "title": "Who is your favorite classic journeyman director?",
        "author": "bogart_on_gin",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kqk4w/who_is_your_favorite_classic_journeyman_director/",
        "text": "[removed]",
        "created_utc": 1526791189,
        "upvote_ratio": ""
    },
    {
        "title": "One-Star Votes and the MCU (Update)",
        "author": "PapaJacky",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kqdyt/onestar_votes_and_the_mcu_update/",
        "text": "So, about three months ago, [I made a thread](https://www.reddit.com/r/TrueFilm/comments/7z1yyh/onestar_votes_on_imdb_and_the_mcu/) comparing the amount of one-star votes on IMDB between the MCU films to demonstrate the fact that *Black Panther* was being vote-bombed (or trolled) more than any other MCU film. One caveat I noted was that that comparison was done a week into *Black Panther's* release so it might even out a bit. So now I'm back to redo it to see the extent of which it remains true.\n\n---\n**Phase One**\n---\n* \"Iron Man 1\" - 6283 votes, 0.8% of total\n* \"Iron Man 2\" - 5704 votes, 0.9% of total\n* \"Hulk 1\" - 3646 votes, 1.0% of total\n* \"Thor 1\" - 6369 votes, 1.0% of total\n* \"Captain America 1\" - 8032 votes, 1.3% of total\n* \"Avengers 1\" - 16211 votes, 1.5% of total\n\n---\n**Phase Two**\n---\n* \"Ant-man 1\" - 3594 votes, 0.8% of total\n* \"Captain America 2\" - 5650 votes, 0.9% of total\n* \"Thor 2\" - 5060 votes, 1.0% of total\n* \"GOTG 1\" - 8113 votes, 1.0% of total\n* \"Iron Man 3\" - 9090 votes, 1.4% of total\n* \"Avengers 2\" - 8808 votes, 1.5% of total\n\n---\n**Phase Three**\n---\n* \"GOTG 2\" - 3093 votes, 0.8% of total\n* \"Dr. Strange 1\" - 3198 votes, 0.8% of total\n* \"Thor 3\" - 4177 votes, 1.2% of total\n* \"Spider-man 1\" - 4939 votes, 1.5% of total\n* \"Captain America 3\" - 8472 votes, 1.7% of total\n* \"Avengers 3\" - 5935 votes, 1.8% of total\n* \"Black Panther 1\" - 11991 votes, 4.0% of total\n\n---\n\nHere are the numbers for the 5 random \"baseline\" films I picked at the time:\n\n* \"Oldboy\" - 6576 votes, 1.5% of total\n* \"Lars and the Real Girl\" - 1195 votes, 0.9% of total\n* \"The Grey\" - 3867 votes, 1.8% of total\n* \"Brazil\" - 2708 votes, 1.6% of total\n* \"Detachment\" - 416 votes, 0.6% of total\n\n---\nHere are the DCEU films: \n\n* \"Justice League\" - 6976 votes, 2.8% of total\n* \"Wonder Woman\" - 8297 votes, 2.0% of total\n* \"Suicide Squad\" - 18420 votes, 3.9% of total\n* \"BvS\" - 19989 votes, 3.8% of total\n* \"Man of Steel\" - 11563 votes, 1.9% of total \n\n---\n\nSo to sum it up, *Black Panther's* proportion of one-star votes has gone down but is still the highest in the MCU and even a tad higher than the films of the DCEU. Thus it is suffice to conclude that a lot of people tried to vote-bomb *Black Panther*.\n\nFun and interesting fact, even though there are a tad more votes for *Infinity War* than *Black Panther*, 49% of *Infinity War* votes were 10 stars. In comparison, *Black Panther's* votes were more distributed, with 80% of voters giving it votes between 7 to 10 stars, with about 20% of votes distributed at each of those four stars. ",
        "created_utc": 1526788987,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Mark Cousins' Story of Film?",
        "author": "Young_Neil_Postman",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kphu7/thoughts_on_mark_cousins_story_of_film/",
        "text": "I'm wondering how much value this film series has \\- particularly in terms of recommending it as an entry way for people beginning to be interested in film \\(younger friends of mine, perhaps even some people who've wandered in here from other subs\\). I've watched the first episode and am generally impressed \\- but my knowledge of the extreme early beginnings of cinema is slim, so I'm not really able to do much in the way of verification. Also, I'd love to hear more general thoughts on it and its grander mission. Since it's apparently not been discussed here yet, so I figure I'd put it to y'all:\n\n***What are your thoughts on the series?*** \n\nSpecifically in reference to its act of defining film history \\(how accurate and appropriate and all it is\\) as well as whether or not it is a useful entry point into film study. ",
        "created_utc": 1526778343,
        "upvote_ratio": ""
    },
    {
        "title": "Trapeze Walker in Chaplin's The Circus",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kpg23/trapeze_walker_in_chaplins_the_circus/",
        "text": "i was revisiting this film the other day. Near the end, the trapeze walker just disappears. Which forces Chaplin to do his act. However, this disappearance  is never explained.\n\nThe ring master never gets angry at him. Which goes against all his past actions. The tramp still views the trapeze walker as having a better future. Even though the tramp was the one who showed up and worked every day. While he disappeared and shirked responsibility. After it was over the girl also seemed to not care about the danger this disappearance put her friend the tramp in.\n\nThis is the only part of the movie that i have issue with. Though, i'm sure that I'm over thinking it to a degree. Can anyone explain to me, what i'm not getting from these scenes?",
        "created_utc": 1526777794,
        "upvote_ratio": ""
    },
    {
        "title": "Am I missing something about Dogville?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kp3fe/am_i_missing_something_about_dogville/",
        "text": "[deleted]",
        "created_utc": 1526773978,
        "upvote_ratio": ""
    },
    {
        "title": "If Christopher Nolan was so keen on showing us humanity needs to \"transcend that simple barrier\" of \"self\" and think of us as a species, then why did he put an American flag here!?",
        "author": "karpawhat",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8koj6r/if_christopher_nolan_was_so_keen_on_showing_us/",
        "text": "[removed]",
        "created_utc": 1526768150,
        "upvote_ratio": ""
    },
    {
        "title": "Movies about a dystopian future taken over by Islam?",
        "author": "LogPRB",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ko8jo/movies_about_a_dystopian_future_taken_over_by/",
        "text": "[removed]",
        "created_utc": 1526765267,
        "upvote_ratio": ""
    },
    {
        "title": "When/where are the showings for the 70mm \"unrestored\" version of 2001: A Space Odyssey that Nolan showed at Cannes?",
        "author": "NahUrBuenoMikey",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ko5lo/whenwhere_are_the_showings_for_the_70mm/",
        "text": "[removed]",
        "created_utc": 1526764449,
        "upvote_ratio": ""
    },
    {
        "title": "Revisiting James Cameron AVATAR and the mark it left on the film industry.",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kmpvc/revisiting_james_cameron_avatar_and_the_mark_it/",
        "text": "Once again if you want the article with all the gifs, videos, and pictures click the link below. \nhttps://myfilmera.wordpress.com/2018/05/19/revisiting-james-camerons-avatar/\n\nNine years ago, in 2009, the self-proclaimed King of the World unleashed the blue cat alien people, better known as the Na’vi, to the world. Somehow, the world took to these creatures to the tune of nearly 2.8 billion dollars at the box office. Miraculously, James Cameron had done it again. In 1997, his previous film, Titanic, had broken all manner of previously unheard of box office records at the time. It took 12 years and the man himself to dethrone his own movie from the top spot, repeating history. Only this time Avatar wasn’t just a movie, it was a revolutionary technological breakthrough (much of what was developed for it is widely used in CGI-laden films today), and James Cameron’s decision to design it as a 3D spectacle from top to bottom created a seismic shift in the landscape of cinema.\n\nOne would think this runaway success would mean the immediate fast-tracking of multiple sequels. Alas, it was not meant to be. Cameron had better things to do, such as diving to the bottom of the Mariana Trench. Eventually he came back to his biggest success and for the last several years has been developing not one, not two, not three, but four Avatar sequels, with a total production budget of one billion dollars (for the time being). James Cameron is if nothing else a big believer in the phrase “Go big or go home.” But how has Avatar held up all these years?\n\nTaking place in the 22nd century, Avatar tells the story of Jake Sully, a disabled marine en route to the alien extrasolar paradise moon of Pandora, a lush and lavish world filled with unique fauna and flora not found anywhere on Earth. Most importantly, it houses the alien race of the Na’vi, an indigenous people far less technologically advanced than their would-be human conquerors. Jake comes to replace his recently murdered twin brother on a science project that entails transferring his consciousness into an Avatar body, a lab-grown Na’vi body that houses both Na’vi and his dead brother’s DNA (that’s why he comes into the picture). The purpose of these Avatars is to establish a diplomatic relationship with the Pandora natives and to eventually convince them to move their habitat elsewhere as its sitting on top of a vast resource of a mineral greatly valuable to humanity, known as Unobtanium. Anyway, you get the picture. Jake makes friends with the natives, particularly the badass, virtually-Amazon warrior Neytiri.\n\nThis sounds like a story seen multiple times, except not quite. One of Avatar’s most unique quirks is that it’s essentially an alien invasion story, however this time around the humans are the ones doing the invading, and the events unfold from the perspective of the aliens. The real-world parallels of a military superpower occupying the lands of a vastly underpowered nation aren’t subtle, and aren’t meant to be either (I think we can all see where Cameron is going with this). Avatar wears its anti-militaristic tinge on its sleeve, as does its pro-environmental messaging. The Na’vi live essentially in an idyllic paradise, living as one with Mother Nature (who by the way has an actual name and in fact seems to be a somewhat sentient being running deep through the roots of the planet…there’s actually quite a bit of story in the picture), that is until the money-grubbing conquerors come to take away their land, their resources, and wreck this precious balance without a single care. Again, it paints its ideas with broad strokes. The movie quickly submerges you into Pandora, making you feel as if you’re stepping into Jake Sully’s shoes, so that you yourself are making this journey and going on his adventures, either alongside him or as him. The aforementioned 3D effect obviously heightened this effect greatly when the film was tearing up the box office, but in fact the entire movie is crafted as pure cinema escapism. Great care has been put into the presentation of the world and the creatures that inhabit it, with gorgeous vistas and establishing shots that take the time to make Pandora seem like a real place. And it’s not just the world, but the Na’vi culture itself. Jake has to go through several rites of passage to become “One of the People”, including a still exhilarating scene involving mounting an alien dragon (a “Banshee”) and making it his own. This “First Flight” sequence is among the most gorgeous sequences in the movie, accompanied by a wonderful score from dearly missed composer James Horner, who tragically died a few years ago. His work on Avatar is fantastic and does much to elevate several scenes in the film.\n\nCameron’s panache for incredible action set pieces is on full display during the last 30 minutes of the movie, where a spectacular War sequence takes place after tensions come to a head. In the air, you have hundreds of banshee-riders engaging with helicopters and airships. On the ground, a company of mecha-wielding mercenaries face off against a horde of Na'Vi cavalry riding Alien horse-like beings. It's truly epic in scale and probably the most ambitious action sequence Cameron has ever made, and is just as amazing to watch unfold today as it was nine years ago.\n\n\n\nWhile it’s true Avatar never had particularly amazing writing, as a complete movie experience it’s still as exciting to watch as it has always been, 3D or 2D. It had been a while since the last time I spent some time with Avatar, and honestly once again the Extended Edition’s three hour run-time seemed to fly-by.\n\nAs Roger Ebert once put it:\n\n“It takes a hell of a lot of nerve for a man to stand up at the Oscarcast and proclaim himself King of the World. James Cameron just got re-elected.”\n\nLooking forward to the upcoming Avatar Cinematic Universe.",
        "created_utc": 1526751025,
        "upvote_ratio": ""
    },
    {
        "title": "What crew members in a movie do you look for besides directors/actors?",
        "author": "seaneihm",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kk72z/what_crew_members_in_a_movie_do_you_look_for/",
        "text": "So obviously most people like to follow or have favorite directors/actors, which they use to find other good movies.\n\nBut are there any other members that you have favorites of that you follow, and why? Favorite screenwriters? Producers? Casting directors? Special effects supervisors? Even with different directors, can you still see their individual contributions?",
        "created_utc": 1526721742,
        "upvote_ratio": ""
    },
    {
        "title": "YouTube",
        "author": "taraddworthyddd",
        "url": "https://youtu.be/_yPKZJ1wpsw",
        "text": "",
        "created_utc": 1526718032,
        "upvote_ratio": ""
    },
    {
        "title": "How Barry Jenkins was influenced by Asian directors and film.",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8khgix/how_barry_jenkins_was_influenced_by_asian/",
        "text": "For those who want to see the article with all the pics and gifs included.\nhttps://myfilmera.wordpress.com/2018/05/17/film-frame-friday-moonlight/\n\nMoonlight, directed by Barry Jenkins reached critical acclaim to the point of winning  Best Picture at the Oscars, but what makes this film special is the beautiful cinematography. A native of Miami, Florida Jenkins used his home city's unique lighting and weather to bring serenity to his film. The use of water and the natural hues of blue gives Moonlight a serenity unlike any other. One thing I noticed upon watching this film twice is how Jenkin was influenced by Wong Kar-wai and Edward Yang. The use of up-close face shots, conservative tampering with the natural environment, and letting two characters have intimate dialog without little distractions. The way Barry Jenkins films the youth in this film can be compared to YI YI or A Brighter Summer Day.  For example Jenkins and Yang both frame their main character with a sense of loneliness. Even when they share scenes with other characters there is a sense of sadness and even alienation. Moonlight is not the first nor last film to do this, but the style is so strong it demands attention. Letting the scene play out by itself without trying to change the environment provides stellar shots. I want to mention the dialog between characters is shot in a natural way, focusing even the smallest of details. Smoking a cigarette, eating food, or even driving in a car is such a mundane thing; yet all these directors make it look like the coolest thing ever. I want to mention the dialog between characters is shot in a natural way, focusing even the smallest of details. The similarities between the directors and films is one of the reasons why I love Moonlight so much, and why I praise the scenes. I highly encourage you to watch these films and see if you can spot not only the likeness, but what makes them visual appealing.\n\n",
        "created_utc": 1526686546,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the greatest \"long\" movies ever made?",
        "author": "CGM2004",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kh505/what_are_some_of_the_greatest_long_movies_ever/",
        "text": "I recently finished watching A Brighter Summer Day \\(which totals just under four hours in length\\) and it got me wondering what some of the greatest \"abnormally long\" movies were. First off, how do we define \"abnormally long?\" I suppose that anything over three hours could count, but I'm more thinking towards movies that are upwards of four hours and longer. Some that I've already seen that immediately came to my mind were\n\n* A Brighter Summer Day\n* Lawrence of Arabia \n* Godfather 1&amp;2\n* The Deer Hunter\n* Schindler's List\n* Barry Lyndon\n* Andrei Rublev \n* Gone With the Wind\n\nSome that I've always wanted to see\n\n* Norte, The End of History\n* Shoah\n* Satantango\n* Once Upon a Time in America\n* Fanny and Alexander\n* \\`Heaven's Gate\n* YiYi\n\nAny thoughts?",
        "created_utc": 1526683385,
        "upvote_ratio": ""
    },
    {
        "title": "How many films can a large video rental store have on display?",
        "author": "TraditionalBisquit",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kghfj/how_many_films_can_a_large_video_rental_store/",
        "text": "[Netflix film library in the US currently covers 4000 movies](https://flixable.com/genre/movies/) , a portion of which is content which hasn't even been released on home video, such as live stand-up comedy and made-for-television documentaries. I'm fairly certain that a well-equipped video rental store can have a significantly larger, and most importantly *more comprehensive* selection — Netflix prioritizes titles with a wide commercial appeal and as a result availability of classical, \"art\", foreign  and independent releases is tremendously poor: currently there seemingly [are only two films from the silent film era](https://flixable.com/genre/movies/?min-rating=0&amp;min-year=1920&amp;max-year=2018&amp;order=year&amp;page=101) and around 50 releases prior to 1980.\n\nStreaming rights are becoming increasingly decentralized and large studios will likely move to their own exclusive services, [as Disney already has](https://en.wikipedia.org/wiki/Disney_streaming_service). Most of the providers, such as Hulu, do not operate outside of the US. \n\n---\n\n\n\nAre you aware of a great video rental store still standing? Do you have a historical estimate to offer?",
        "created_utc": 1526677320,
        "upvote_ratio": ""
    },
    {
        "title": "Loving (2016) was a departure from Jeff Nichols’ usual works. But it was a work of humanistic sincerity, absolutely in line with the philosophy of his earlier films Take Shelter (2011), Mud (2012), and Midnight Special (2016)",
        "author": "robotfunkychicken",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ke080/loving_2016_was_a_departure_from_jeff_nichols/",
        "text": "When, a year or so ago, I saw Jeff Nichols Palme D’Or nominated Loving (2016) it seemed like an odd fit for the director. Not in the sense that it didn’t deserve a nomination; of course it did. But more in the fact that it seemed so at odds with his past repertoire. The film, the story of the interracial couple who successfully got the circumstances of their marriage legalised by the Supreme Court, is rooted deeply in its own truth and in the past. Something that Nichols’ past releases have not been. His works have consistently featured science-fiction or fantasy elements (some more than others, naturally) and on my first viewing, seemed nothing like the romantic, socially-conscious narrative of Loving. It’s a work rooted in objective fact, in events that happened, with a wider context of history that the vast majority of the population should be aware of already. Why would this director of such fantastical and fictional figments of his imagination be drawn to this, I wondered?\n\nAt its core, Take Shelter is a film about anxiety. Curtis, played blindingly well by Nichols’ regular Michael Shannon, is a man crippled by the anxiety of turning into his paranoid schizophrenic mother. It is a testament to his character indeed, that when experiencing his anxiety, and seeing his life start to crumble around him he is not paralysed. He acts and keeps a definite agency throughout the film.\n\nThis is a noticeable trend throughout Nichols’ screenplays. The film has so much more drama and tension because Curtis tries so hard to resolve it, not simply because he is subjected to such personal and terrifying anxieties. His proactive, often frantic momentum in the film shows us just how much he fears losing his family. It is telling that the emotional catharsis of Take Shelter arrives by the mere of opening of a door. It’s through Curtis’ simple decision to act, and the action itself that is the film’s most dramatic moment. It’s true, the most thrilling action is character.\n\nMental illness is a truly individual suffering; a lonely experience that is often left painfully short of explanation when mere words are used. Curtis, without a doubt, is a man of action not words. As his family becomes increasingly perplexed and worried by his behaviour it strikes us that they seem like completely reasonable and rational steps to him. It speaks volumes of the coherence with which Curtis’ character is written that while we see from the outside that his actions are hard to explain and causing anguish, we completely, unequivocally understand the thought processes that have led to them. Moreover, our understanding comes from a place of sympathy.\n\nMuch of the enjoyment this film has to offer comes from its apocalyptic tone and narrative. The scale of the devastation Curtis fears is huge. The momentous, grand beauty of the film however, is in the intimacy of it. Take Shelter is about one man, and the fear of losing one’s family. Curtis’ whole world is his family, and to him this is what the apocalypse is. This is the greatest fear. And so the universal - the destruction of Earth - is made intimate and personal.\n\nMud (2012) is at once worlds apart and so very similar to Take Shelter. It has a fantastical, fairy-tale tone to its scenes featuring Mcconaughy’s eponymous rogue, and it’s this fantasticality that would initially appear to be its shared similarity. However, that isn’t what the film’s really about. Mud is both a coming-of-age film about the pains of adolescence and the different paths we take through life, and also a film about the end of an age; of a way of life ending before it’s time. The backwater Arkansas area in which the two boys live is changing as they do, and the lives their fathers led are ending.\n\nFathers play a significant role in the film. Their sins, actions, absences and a lot of what they do not say is given emphasis enough that their influence on the sons of the film is as affecting as Curtis’ actions in Take Shelter. This fascination with fathers is something consistently littering Nichols’ films. Midnight Special and Loving both feature fathers working hard for their children, while suffering from huge, almost otherworldly pressures. Likewise with Take Shelter, the impossible and improbable is exactly what they’re trying to achieve for their families.\n\nBalanced in Mud is its grounded, realist approach to action and drama at home. It is understated and un-stylised, presented with Nichols’ natural emotive instincts but never melodramatically. The dreamy, romantic fantasy peeks through only when Ellis and Neckbone are travelling to Mud’s island; a world apart from their troubles at home and school where dreamy atmosphere and child-like wonder takes a back seat for responsibility, stress and social pressures. Contrasted, these become a clear parallel to Take Shelter’s narrative structure, of apocalypse and family drama.\n\nMoving on again, to Midnight Special, which bears more similarity with Take Shelter than Mud, both thematically and in its action and supernatural focus. The film contains many elements of science fiction. Nichols himself has said that the films Close Encounters of the Third Kind and John Carpenter’s Starman were in his mind while writing and making the film.\n\nIt would have been easy for Midnight Special to get lost in surface concerns like plot and world-building and spectacle, but it remains closely personal at all times. We are intimate with our 4 main characters, very rarely straying from their perspective. Their relationship with each other, and particularly between father and son, is at the forefront of the film. Michael Shannon displays such a warmth towards Alton, the intense love that fathers feel for their children, but also conveys so well the fear that he feels towards him. Is this fear because of Alton’s powers? Perhaps it’s a more general fear, of how we can provide for and protect our children, when they so often seem to simultaneously eclipse us and still be so vulnerable. Kirsten Dunst’s performance is easily on a par with Shannon’s. Her unconditional love for Alton is obvious, and the final scene of her standing alone in a field is so devastating because she’s given us this understanding so clearly.\n\nWhat connects Midnight Special, and Mud and Take Shelter is their absolute sincerity. Nichols’ films all have a gentle, warm probity about them, as do his characters. Their genuine decency shines through them in action rather than in words.\nBecause of, or maybe causing this is Nichols’ writing. He wrote the screenplays for each of his films, And as we’ve seen they’re all about family, relationships, love, connectedness. They are about how these things can overcome whatever misfortune, or struggle, or action is put in their way.\n\nThis brings us on to Loving. Which, of course is about exactly those things: about family, about love and a struggle for that to prevail over industrialised racism, bigotry, cultural racism. Now, having written this piece, it makes complete sense that this should be a film written and directed by Nichols. Richard Loving embodies entirely the genuine, decent, loving father (figure) that his films contain. A man so uncomplicated, so of action instead of words that, when given the opportunity for a grand speech to the key judge who will decide their case, simply says “tell her I love my wife.” And that, for Richard Loving and Jeff Nichols both, is all that needs to be said.\nRuth Negga, too, embodies the mothers of his past films, in her resolute, uncompromising and beautiful strength. Her Mildred is a quiet store of great patience, work and love, celebrating those qualities that shine through in Jessica Chastain’s Samantha and Kirsten Dunst’s Sarah.\n\nI was quick to judge Loving when it came out. I was quick to assume that it was different from the film I expected. With my own preconceived notions about what a sci-fi, a fantasy drama, and a social realist drama film is I couldn’t connect them. But what I see now, and what I will continue to embrace about film, is that it’s not the genre, or the expectation, or the style of a film that makes it what it is. What makes a film, and what connects us with great cinema - with all cinema - is the people that inhabit them. These wonderful, strange creatures written into existence and given life by performance. They can show us parts of ourselves we would rather not see, and can challenge us because of it. Or they can embody that which we most hope to achieve. In either case, our empathy and understanding of other people is what drives our connection to the movies.\n\nEDIT: this is an excerpt from a recent article I wrote at www.filmosophy.co.uk and I’d be remiss not to plug it here, in case you wanted a more in depth read. I felt this post was already long enough as it is.",
        "created_utc": 1526657139,
        "upvote_ratio": ""
    },
    {
        "title": "Streaming Services: Are they going to be responsible for the death of cinema? An Opinion",
        "author": "desicinephiles",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kdzi0/streaming_services_are_they_going_to_be/",
        "text": "There has been a fight that has been brewing underneath the surface ever since people realized that there has been a major pivot in the ways movies were being produced. To an outsider, its all the same, well more or less. There are movies being made and people are watching them. It is perhaps the medium which has brought about a paradigm shift in the way movies are being produced and the future of the movies is under scrutiny. That worries me and often seems like a over exaggeration, especially when I still crave the texture of last years Dunkirk, shot entirely on film, meant to be projected in a theatre, with its expansive frames, which could not be absorbed on a smaller screen by any measure. Then there are filmmakers like Paul Thomas Anderson who are still very much using the medium of film to create cinema that is meant to be watched and absorbed in a theatre. But the truth is that a bulk of the audience don’t care about what medium the film was shot on or the platform they consume it on and even people like us, who are genuinely interested and opinionated sometimes don’t care where a good story comes from. And here the discussion is not going to be what constitutes a film because any number of pages cannot contain the very fluid definition of this art form. The core of the article is going to be the ongoing debate how the content being created for these new media platforms be received, reviewed and even applauded, if deserved.\n\n[Here we attempt to present our opinion as cinephiles and establish where we stand on the issue](https://www.desicinephiles.com/editors-pick/streaming-services-are-they-going-to-be-responsible-for-the-death-of-cinema-an-opinion)",
        "created_utc": 1526656988,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (May 18, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kdhem/casual_discussion_thread_may_18_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1526652862,
        "upvote_ratio": ""
    },
    {
        "title": "What films had great potential but fell short in their execution?",
        "author": "HairyDavid",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kd9hc/what_films_had_great_potential_but_fell_short_in/",
        "text": "First of all, this is a great sub.  I've never had a bad experience here, even throughout my lurking or under now-dead usernames from years ago.  I don't know how this place stays troll-free, but hooray that it does.\n\nNow, I just had a thought that I've honestly been dwelling on for a year or more, in my spare time.  Roger Ebert once said that studios should remake mediocre movies, versus good ones.  And... that makes perfect sense.  There's a lot of movies where the concept is really good, but the execution fell flat to me.  Some examples-\n\nThe Intern by Nancy Meyers.  This movie is about an old-school, old guy played by Robert De Niro who, out of boredom and loneliness decides to become a, wait for it... intern at a company owned by a young woman.  Along the way there's culture clashes with his millennial coworkers, but eventually everyone learns to appreciate each other's positive traits.\n\nNow, this isn't an Ed Wood picture, it's just distinctly average.  Basic, as the kids would say.\n\nI think there's a ton of promise in the concept though, about how society tends to disregard the elderly after a certain age, about generation gaps, about traditional masculinity versus the millennial \"man child\" syndrome.  You could have also easily made the younger characters different races, ethnicities, religions or sexualities in order to really play up the contrast.  \n\nI think there was similar untapped potential in films like The Internship and believe it or not, Hot Tub Time Machine.  I was wondering what other films some of the folks here think could have been good to great with some more time or effort.",
        "created_utc": 1526650978,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of Lars Von Trier?",
        "author": "MadSox231",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kd9f7/what_do_you_think_of_lars_von_trier/",
        "text": "Lars Von Trier is famous for his very controversial movies which have very horrifying scenes that terrify and disgust audiences. Recently, his new film \" The House That Jack Built \" caused a walkout at Cannes Film Festival. Do you think the provocative cinema that he creates  is bad and in his movies Lars Von Trier is just trying to be edgy and \"anti\\-Hollywood\"? Personally I love his movies, everything he does is so original and has a purpose. While I really enjoy his movies\\(Ex: Antichrist and Dancer in The Dark \\) I find his editing really bad and annoying, which is probably the only criticism I'd give him. How about you, do you enjoy his movies?\n\nEdit: Grammar ",
        "created_utc": 1526650962,
        "upvote_ratio": ""
    },
    {
        "title": "Deadpool 2 A Spoiler Free Review (Almost!)",
        "author": "snehwriter",
        "url": "https://moviereviewsmini.blogspot.in/2018/05/deadpool-2-2018.html",
        "text": "",
        "created_utc": 1526634005,
        "upvote_ratio": ""
    },
    {
        "title": "Why The Greatest Showman Sucks!!! &amp; How I Would Fix It - The Flick Fix Show",
        "author": "theapuw",
        "url": "https://www.youtube.com/watch?v=Luv8b_mLbdk&amp;t=2s",
        "text": "",
        "created_utc": 1526629625,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of Takeshi Kitano as a Filmmaker?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8kb7xx/what_do_you_think_of_takeshi_kitano_as_a_filmmaker/",
        "text": "I just want to know what TrueFilm thinks of Takeshi Kitano as a filmmaker. Personally, i have gotten into him a few months ago and I love all the work Ive seen from him (especially Hana-Bi and Kikujiro) and hes slowly becoming one of my favourite directors. I also find his stand ups pretty funny despite him being from Japan, and hes also a pretty good actor, which is impressive especially when he also directs the film. So I want to know what you guys think of him?",
        "created_utc": 1526626618,
        "upvote_ratio": ""
    },
    {
        "title": "2018 Cannes Film Festival barometer?",
        "author": "SecretAnywhere",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8k8ug2/2018_cannes_film_festival_barometer/",
        "text": "[Preface: Maybe this type of post doesn't conform to rules 1 &amp; 2 but I felt like surely many people would be interested so it's best to submit it as a self-post rather than in the casual discussion thread?]\n\nLast month I posted the [lineup(s)](https://www.reddit.com/r/TrueFilm/comments/8bqcr7/2018_cannes_film_festival_lineup_announced/). The festival opened last week and the awards will be given on saturday. So, there are only 2 days left and I have barely heard anything about it this year. \n\nI feel like the media coverage has been gradually decreasing in recent years and that was even more the case (for me at least) with this edition. Is it because the selection simply wasn't very good? (If so, what might explain this?) Or is it because the critics aren't focusing on the good 'hidden gems'? \n\nI saw many papers about the \"politics'' aspects of the festival (sexism, post-Weinstein \"era\", parity, diversity...) which is nice I guess, except we could talk about all these issues when discussing the films themselves I think, when it applies (whereas in my opinion they felt obliged to re-affirm their principles etc... which is boring: we already had these important discussions since this autumn, the \"voices\" have been \"voiced\", the people who care to listen have heard already, finally. Now there are some actual steps to be taken in order to change things, but it won't magically happen in a minute.  I was frustrated this week because whenever I stumbled upon an article about Cannes, it was to point out the lack of parity. Well yes, I agree that's unfornate but I know that already, we've been talking about this for years and I thought the Weinstein scandal had allowed this fact to be recognized already. The articles about the films themselves were overshadowed by all this).\n\nSo, **which films presented in Cannes this year were the most critically acclaimed?**  I can't seem to find a good \"barometer\" type of board  summing up what the different selections had to offer (and who might win a prize in 2 days). \n\nWere you underwhelmed or are you excited about a newcoming filmmaker? To go back to my earlier point, it seems to me that there are some films focusing on gender identity (womanhood, trans identity, homosexuality, and so also masculinity...) and they might not be as good as I hope, but we don't even hear about them. It's like all the critics and their bosses in the newspapers and television channels are avoiding them because they prefer to talk about the  Terry Gilliam or Lars Von Trier \"controversies\"... I don't care! Please talk about the young directors, talk about the african or asian filmmakers! They were part of the lineup I saw last month and I haven't heard about their films this week! I'm frustrated. Where on the internet am I supposed to find what I'm looking for? Shouldn't have to be that difficult to track down, I just want a global view of what is worth keeping an eye on in the next months. ",
        "created_utc": 1526600709,
        "upvote_ratio": ""
    },
    {
        "title": "Movie Trailer 12345",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=20VUDnKZvwU",
        "text": "[deleted]",
        "created_utc": 1526585627,
        "upvote_ratio": ""
    },
    {
        "title": "Movie Trailer 12345",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=20VUDnKZvwU",
        "text": "[deleted]",
        "created_utc": 1526585027,
        "upvote_ratio": ""
    },
    {
        "title": "Movie Trailer 12345",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=20VUDnKZvwU",
        "text": "[deleted]",
        "created_utc": 1526584427,
        "upvote_ratio": ""
    },
    {
        "title": "Movie Trailer 12345",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=20VUDnKZvwU",
        "text": "[deleted]",
        "created_utc": 1526583830,
        "upvote_ratio": ""
    },
    {
        "title": "Special Effects in The Lord of the Rings: The Essence of Movie Magic",
        "author": "FilmRadar",
        "url": "https://youtu.be/p6M8Yem5j0s",
        "text": "",
        "created_utc": 1526577731,
        "upvote_ratio": ""
    },
    {
        "title": "Once Upon a Time in the West at 50: how Ennio Morricone's music powered a classic",
        "author": "Angushibby",
        "url": "https://www.scotsman.com/read-this/once-upon-a-time-in-the-west-at-50-how-ennio-morricones-music-powered-a-classic/",
        "text": "",
        "created_utc": 1526574977,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations for obscure whodunit’s/twist films",
        "author": "godfather17",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8k2sxu/recommendations_for_obscure_whodunitstwist_films/",
        "text": "[removed]",
        "created_utc": 1526547812,
        "upvote_ratio": ""
    },
    {
        "title": "What would the reaction to “Carrie” be if it was made today considering school shootings?",
        "author": "teawithwho",
        "url": "https://www.reddit.com/r/movies/comments/8k1j0b/what_would_the_reaction_to_carrie_be_if_it_was/",
        "text": "",
        "created_utc": 1526536705,
        "upvote_ratio": ""
    },
    {
        "title": "Sunny Deol Height, Weight, Age, Wife, Family, Wiki, Biography, Profile.",
        "author": "143rajput",
        "url": "https://geetworld.com/sunny-deol-height-weight-age/",
        "text": "",
        "created_utc": 1526534275,
        "upvote_ratio": ""
    },
    {
        "title": "What would the reaction be to “Carrie” if it was made today?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8k1mrp/what_would_the_reaction_be_to_carrie_if_it_was/",
        "text": "[deleted]",
        "created_utc": 1526533469,
        "upvote_ratio": ""
    },
    {
        "title": "Béla Tarr | Transcending the Void",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=p_7yXg_ZgyQ",
        "text": "[deleted]",
        "created_utc": 1526526286,
        "upvote_ratio": ""
    },
    {
        "title": "I think Kingdom of Heaven is truly an underrated (almost) masterpiece.",
        "author": "ZeeTilms",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8k0uan/i_think_kingdom_of_heaven_is_truly_an_underrated/",
        "text": "[removed]",
        "created_utc": 1526525647,
        "upvote_ratio": ""
    },
    {
        "title": "Films with 14-year-old protagonists?",
        "author": "Governor_Humphries",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jzcgw/films_with_14yearold_protagonists/",
        "text": "I was having this discussion with a friend earlier. It seems like 14 years old is the uncanny valley of relatability. Younger kids prefer heroes who are pre-puberty, and post-puberty kids and adults prefer older teenagers. Directors probably prefer older teenagers, too.\n\nThe only two films my buddy and I were able to think of were Harry Potter and the Goblet of Fire--which happened by default due to the one-film-per-year nature of that series--and True Grit 2010.\n\nThe Parent Trap 1961 comes close. The twins in that film are \"nearly fourteen\".\n\nThe Parent Trap and True Grit both do a good job of portraying the childish/adult dichotomy of someone that age. Harry Potter, less so.\n\nAre there any others?",
        "created_utc": 1526511693,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (May 16, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jv8lx/casual_discussion_thread_may_16_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1526480050,
        "upvote_ratio": ""
    },
    {
        "title": "How to get up to date?",
        "author": "imyomum",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jv3h9/how_to_get_up_to_date/",
        "text": "[removed]",
        "created_utc": 1526478928,
        "upvote_ratio": ""
    },
    {
        "title": "Rediscovering Boogie Nights",
        "author": "HairyDavid",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ju573/rediscovering_boogie_nights/",
        "text": "A Twitter-to-Wiki-hole led me to start reading up on Boogie Nights, by Paul Thomas Anderson.  I'd seen it once, as have many of you, maybe around 2000-2001 on home video.  At the time, I was in my late teens and I think the dark nature of the movie sort of depressed me, and I left it alone for awhile.\n\nNow I'm sort of reading up about it again.  I found an oral history on [Grantland](http://grantland.com/features/boogie-nights/).  For all the easy jokes people make about Dirk Diggler's prosthetic penis and \"uh huh huh... porn,\" it really is a fascinating story in a fascinating era in a fascinating setting.  \n\nThe \"Golden Age of Porn,\" where mainstream celebrities saw porn in actual movie theaters, seems so unreal now.  \n\nThe actual profession of porn is also unreal.  Sex is an incredibly intimate act, at least usually, and here are people that have it and film it for profit, and maybe very very rarely, art.  The idea of sort of a seedy, mini-Hollywood is interesting.  \n\nAnd personally, I just like both southern California as a setting as well as the late-70s, early-80s era (also the era one of my other favorite movies is set in, City Of God.)\n\nI was wondering what experiences people had, what books or scholarly (but not stuffy) articles there were on Boogie Nights, as well as whether there are other interesting looks at porn.  I actually think a film, book or documentary set in the 2000s-internet age would be really interesting.  As I understand it, the money is kind of disappearing from the industry, on account of the fact that there's so many options and bootlegging is so common.  It's a common meme, \"nobody pays for porn.\"  \n\nI've seen the documentary Hot Girls Wanted, but it didn't really have the scale or scope of Boogie Nights, as well as seeming a little moralizing.  ",
        "created_utc": 1526470050,
        "upvote_ratio": ""
    },
    {
        "title": "What makes great film?",
        "author": "AManIsBusy",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jtyzw/what_makes_great_film/",
        "text": "How do you define great film? Are you open-minded to any single thing that tickles your fancy? Do you have a single vision for what great film is? Or are you maybe somewhere in the middle, where you can appreciate a variety of film to some degree, but you have strong opinions as to what makes it truly 'great'.\n\nI admit, I was not a person that took film very seriously up until last year or so. There were a few high quality TV shows that I started watching, and I became hooked. I had found an entirely new type of entertainment. I can enjoy and appreciate just about anything, but there are definitely specifics that I've begun to hone in on as traits of 'great film'. I'm also going to go out on a limb and say a 10 hour to 30 hour drama is always better than a 2 hour drama, 100% of the time, all other things being equal. That is to say that high quality TV shows have completely eclipsed movies in my mind. Movies can't compete in terms of depth.\n\nWithout further ado, I'll post my list below, and in the comments, perhaps you all can share your lists and your theories as well.\n\n----\n\n- Something great; I want to watch characters that are powerful or want to be powerful, not characters that mope about and make fun of their shittiness. I don't think comedy and drama mix well, not if we're discussing shows that we can take seriously. I also don't want to see a loser win. I want to see a winner win. This mostly applies to characters, but some shows have other aspects of power or greatness of importance. Westworld talks about existential threats of AI. Mr Robot talks about technocratic multinational corporations, geopolitics, and organized crime, not to mention all of the existential issues that rational people face with the modern world. Those are deep and interesting topics, and they approach them in a real and honest way. To contrast, take Black Mirror. I really can't take that show seriously when that film universe plays by its own rules. It mind seem realistic to some, but it just comes off as preachy and intellectual masturbation to me. Also, to contrast with 'great', dumb characters are extremely annoying to me. They can only exist in shows where they are foils to other characters that actually are really smart and great. Otherwise, it's just too insufferable.\n\n- Something dark. This is closely tied to something great. What could be great without being at least a little dark? To be dark, the show accepts that the world isn't safe, the world isn't fair, losers don't win, morals aren't always clear in application (or even in existential basis, as in the case of True Detective). If you want a happy ending, you have to earn it yourself. With that background set, you see real scheming emerge. The characters can actually use the real, legit human weaknesses around them to their advantage because the show admits that they exist. The protagonists themselves also have real human weaknesses. They are not great by default, like a superhero. They have to earn it.\n\n- Non-verbal communication. As mentioned above, I want a show that uses dialogue to complement the storytelling, not dominate it. If there's a character that's thinking about something, I don't want him to just tell someone else what he's thinking, as a way of educating the audience. I would like to feel like I'm in that scene with him, and I wouldn't get the opportunity to simply ask the dude what he's thinking about if I were. Not to mention, he wouldn't give me an honest, introspective answer either, if it were real life. I want to have to put my actual thinking cap on to figure out what's going on inside their head. Then, as the events of the show unfold, I see what they were thinking or planning.\n\n- Multiple lead characters and a true feeling of a 'universe' for the show. This is not an easy rule to apply. Some of my favorites only seem to have a couple leads, and they live semi-isolated lives from the rest of the characters in the story (e.g. Rust and Marty in True Detective). However, these characters still interact with their world in a lot of different ways. They have affairs, girlfriends, wives. They go to the country bar. They meet and infiltrate a redneck gang. They travel around and meet locals in various locations in Louisiana. This still feels like a universe, even though the antagonist isn't as well developed as someone like Stuart Strange, the head of the East India Company in Taboo. In contrast, I think most cop/detective shows tend to stick to just the job of the cop. There's no interesting back story, no larger universe, nothing the cop does in his spare time, and the jobs are very serial -- one after the other, none more important than the other. In general, I'm kind of down on that genre, but there are exceptions.\n\n- People matter, not titles or groups. I want the story to be focused on people, not institutions or characters that are cookie cutter representations of institutions, such as in Homeland, Boardwalk Empire, or even House of Cards. Also, as such, a show that is in the future (such as Star Trek or The Expanse) isn't any more interesting because the institutions are futuristic. I still care about the characters the most, and at least in the case of Star Trek, the characters are extremely flat and boring. Westworld is futuristic, but it talks about interesting problems (such as where human desires and technology collide) and brings it back home with its characters. Star Trek has episode after episode of gang fights, except instead of gangs, they're weird-looking aliens. I already know about gang fights. Star Trek has nothing interesting to say about things, other than its utopian government and constitution, which rarely gets challenged as an idea on the show anyway.\n\n- Actual world situations. There are several tropes, such as \"the world is ending\" (The Walking Dead), \"we're the only one's left!\" (The Leftovers), \"we're lost/stuck in space!\" (Ascension), that give the writers too much leeway. Because these situations don't happen in real life, there are no established rules for how the systems work. Thus, writers either rely on tropes or make up their own rules, and then as viewers, we're supposed to take home a pre-packaged moral-of-the-story that really can't be confirmed or denied. This is the case of a show being too character-based. In such a situation, the writers often make the characters too simple, as if by having the characters represent greed or courage or humility, they are basing it in reality. No, 'reality' would be all of the characters containing bits and pieces of several qualities; they are people, not concepts. Also, by the way, this is my big gripe with Black Mirror. Every single episode is a different trope where the writers have 100% leeway to describe the story however they wish. A good story is hard to steer, as natural conclusions have to be arrived at, and characters cannot be changed overnight. Black Mirror gets to change its characters and arrive at any conclusions it wants to.\n\n- Nothing anti-scientific. I don't want supernatural B.S. clouding up the show. Stranger Things is an example of a show that really kills my interest because its suspense is based upon occult and mystery. (This really goes for all horror and suspense show of this type too... I'm not really interested because if it were me, I'd simply grab a shotgun, defend myself, and not stress about it). In contrast, shows like Game of Thrones and Taboo have occult elements in the show, but they don't dominate the plot. In Taboo, it's almost a stylistic choice that allows the viewer to see it through a supernatural or scientific lens. In Game of Thrones, you can interpret the religious components as just being part of a story that is told 2nd or 3rd hand instead of witnessed directly. On the other hand, the dragons and ice king are completely magical. To me, they make the show jump the shark when it's otherwise so amazing in its historical accuracy and references. I forgive the show for it to some degree, since perfection is hard to find.\n\n----\n\nLooking at that list, these are all ambitious goals. I can see why most don't meet them, even the award-winning shows. It requires good writing, good filming, and good acting. It also requires good planning, because it's trying to take movie concepts and apply them to the serial format, without it developing too many tropes that develop in serial formats.",
        "created_utc": 1526468067,
        "upvote_ratio": ""
    },
    {
        "title": "what the fuck happened to Sidney Hall?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jtavr/what_the_fuck_happened_to_sidney_hall/",
        "text": "[deleted]",
        "created_utc": 1526459147,
        "upvote_ratio": ""
    },
    {
        "title": "Is Suspension of Disbelief always required?",
        "author": "MickandBensPodcast",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jswzo/is_suspension_of_disbelief_always_required/",
        "text": "Hi I was recently watching Avengers Infinity War,  which I realise is not common a movie for this subreddit to discuss but one thing that struck me is the serendipity of all of the various storylines linking together at the right time. It's outlined below :\n\nhttps://youtu.be/rv73iZLmO7M\n I realise that suspension of disbelief is usually required for sci-fi films or fantastic films but do you feel that, generally speaking, the suspension of disbelief should not be required of an audience and that certain linear indiscretions or plot holes should be called out by people who notice them.",
        "created_utc": 1526453872,
        "upvote_ratio": ""
    },
    {
        "title": "Is the suspension of disbelief always required?",
        "author": "MickandBensPodcast",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jsqh7/is_the_suspension_of_disbelief_always_required/",
        "text": "[removed]",
        "created_utc": 1526451509,
        "upvote_ratio": ""
    },
    {
        "title": "films like My Winnipeg ?",
        "author": "joaquinbear",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jr7cw/films_like_my_winnipeg/",
        "text": "those who’ve seen My Winnipeg, and i’d imagine even on this /r/ that’s but a few, do you know of any other films even remotely like this one? Obviously Guy Madden has directed other films and i’m gonna be checking those out asap, but i’d just love it if i could find even one other director, nah one movie! with such an odd blend of styles and such wacky story material... thanks :)) ",
        "created_utc": 1526435499,
        "upvote_ratio": ""
    },
    {
        "title": "What living filmmaker is the closest to Stanley Kubrick right now?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jpr2y/what_living_filmmaker_is_the_closest_to_stanley/",
        "text": "[deleted]",
        "created_utc": 1526422914,
        "upvote_ratio": ""
    },
    {
        "title": "What living filmmaker is the closest to Stanley Kubrick right now?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jpohi/what_living_filmmaker_is_the_closest_to_stanley/",
        "text": "[removed]",
        "created_utc": 1526422306,
        "upvote_ratio": ""
    },
    {
        "title": "What are some \"good\" films you didn't like?",
        "author": "lesliebogart",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jp0mt/what_are_some_good_films_you_didnt_like/",
        "text": "[removed]",
        "created_utc": 1526417174,
        "upvote_ratio": ""
    },
    {
        "title": "Anglo-American Neoliberal Horror Film List",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8joa19/angloamerican_neoliberal_horror_film_list/",
        "text": "[deleted]",
        "created_utc": 1526411620,
        "upvote_ratio": ""
    },
    {
        "title": "Actors and Acting",
        "author": "mumubird",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jnuw8/actors_and_acting/",
        "text": "I've rarely seen any posts about actors or acting on here. In general it seems that acting is not discussed very often by film critics or academia. Discussion of actors seems to be mainly left to the boulevard.  \nSome questions that come to mind would be: By what criteria do you judge good acting? Can a film be great with poor acting? Can a film become great only through acting? How is modern-day acting different from 50 or 100 years ago? To what degree can the director influence and mold an actor? Why do many highly regarded films have no-name actors? Who would take the lead in a Sight &amp; Sound poll of actors?\n",
        "created_utc": 1526408577,
        "upvote_ratio": ""
    },
    {
        "title": "I'm trying to get into Akira Kurosawa's work. Which movie should I start with? I have already seen Seven Samurai and loved it!",
        "author": "amaanster",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jmjkn/im_trying_to_get_into_akira_kurosawas_work_which/",
        "text": "[removed]",
        "created_utc": 1526398779,
        "upvote_ratio": ""
    },
    {
        "title": "Movie Rating Systems are Broken",
        "author": "SoldierOfShoop",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jmf20/movie_rating_systems_are_broken/",
        "text": "TL;DR is at the bottom.\n\nBasically, I run a review site and often run into a problem when it comes to rating systems. I chose to rate films, books etc out of 10 because it offers a wider spectrum than, say, out of five stars. But I often find myself rating a movie that is nothing special, the most recent Ghost in the Shell \\(2017\\) as an example, an 8/10 because I enjoyed it a whole lot, but give a film like Blade Runner 2049 the same rating despite the fact that on a directorial, musical, visual and narrative perspective BR is objectively superior.\n\nSimilarly, with slightly older classic movies that are arguably objectively 'way better' than current mass\\-appeal blockbusters, I would much rather watch Infinity War than Shawshank \\(this is not a good example but is nothing more than just that; an example\\). So, in this case, does this mean I should rate IW higher because subjectively I enjoyed it more? Or, even though I would choose IW over Shawshank any day of the week, should I acknowledge that regardless of how much I enjoyed IW it is objectively a 'worse' \\(I use the term loosely\\) film experience than Shawshank? \n\nIsn't it all personal preference anyway?? It's hard because there are a lot of films that fall somewhere inbetween 'good' and 'bad' in a number of complicated ways, like ones which everyone can agree are quite 'bad', but are still enjoyed by most anyway \\(Starship Troopers\\), ones that everyone can acknowledge are really 'good' and impressive but no one really enjoys them \\(I experienced this when a group of friends and I went to see Lawrence of Arabia recently\\), and many others. How the hell do you rate these types of films? Sometimes I have to make it clear on my site that if the overall rating I give to a film doesn't seem to reflect the tone of the review, it's because the rating is purely based on my enjoyment of it, and, for example, though I can acknowledge that Ghost in the Shell \\(2017\\) has many, many flaws, I'm a sucker for those type of visuals and sound design utilised throughout, so ENJOYED it a hell of a lot, ergo the high rating.\n\nSeeing as a lot of my opinions of films don't seem to match up with the mainstream media's \\(I hated Black Panther and Guardians of the Galaxy 2 equally, and thought Ready Player One was the worst film I've seen in years, but also really love the Transformers franchise despite its flaws, it's a nostalgia thing, okay?\\) am I supposed to just become a lone wolf reviewer who doesn't take anyone else's ratings or opinions into account and just rate films entirely subjectively, or should I instead purely examine films on a technical level rather than how fun I find it to actually watch them?\n\nIt's somewhere in the middle, but in an age where media hype and cult following skew the movie rating system even more than it already is, how are we supposed to believe anything anyone says about movies?\n\nTL;DR \\- How can we be expected to rate movies or listen to others' ratings of them in any way when a massive amount of enjoyment of a particular movie is personal preference, regardless of how technically, narratively, or otherwise 'good' that film may be?",
        "created_utc": 1526397806,
        "upvote_ratio": ""
    },
    {
        "title": "Mulholland Drive (2001) and Nocturnal Animals (2016)",
        "author": "goodizer",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jm2pz/mulholland_drive_2001_and_nocturnal_animals_2016/",
        "text": "I love Nocturnal Animals and I absolutely love Mulholland Drive. After several revisits for the two masterpieces i observed some similarities regarding plenty of things.\n\nThe main theme of both movies is regret (we knew that revenge is the ultimate theme of NA at the end though). Diane is overwhelmed with regret after she killed her lover that she killed herself because she couldn't deal with it. Susan is filled with regret because of the choices she's been making all over her past 19 years, the regret turned into hope and eventually she lost it when Edward didn't show up in the end (the revenge theme).\n\nThe non linear storytelling is of good service for both movies. At the end of MD Diane flashbacks several moments from which we know how she felt and why she's feeling like this now. Susan flashbacks too so we know what led to the depressing life she has right now. \n\nDoes anyone see other similarities in those two masterpieces?",
        "created_utc": 1526395155,
        "upvote_ratio": ""
    },
    {
        "title": "Stanley Kubrick's Napoleon : the best movie never made",
        "author": "sohowsyrgirls",
        "url": "https://vimeo.com/168100466",
        "text": "",
        "created_utc": 1526385905,
        "upvote_ratio": ""
    },
    {
        "title": "How Avengers: Infinity War has more hidden depth than the main premise of the film The Memento",
        "author": "Foolness",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jkpj6/how_avengers_infinity_war_has_more_hidden_depth/",
        "text": "&gt; A man juggles searching for his wife's murderer and keeping his short-term memory loss from being an obstacle. \n\nThis is the description of Memento in the imdb page. A film many praise for it's depth.\n\nWhile Avengers obviously does not focus the lens on the same dilemma, seen from another perspective - I'd argue it presents the same issues towards one of the character: Bruce Banner.\n\nHence I hope this post finally addresses the criticism for Superhero movies not fitting in with the criteria for a true film because as one user writes:\n\n&gt; You don't learn anything about yourself or society by watching these movies, they don't have an overall deeper meaning to them and it's really hard to even consider them art when they're just there for money making purposes.\n\n**Here's how the Avengers copied The Memento:**\n\nInstead of one person's perspective being reversed, the Avengers reversed the entire order of the Major Arcana.\n\n**Original:**\n\nNone (0 or 22)\tThe Fool\n1\tThe Magician\n2\tThe High Priestess\n3\tThe Empress\n4\tThe Emperor\n5\tThe Hierophant\n6\tThe Lovers\n7\tThe Chariot\n8\tStrength\n9\tThe Hermit\n10\tWheel of Fortune\n11\tJustice\n12\tThe Hanged Man\n13\tDeath\n14\tTemperance\n15\tThe Devil\n16\tThe Tower\n17\tThe Star\n18\tThe Moon\n19\tThe Sun\n20\tJudgement\n21\tThe World\n\n**Avengers: Infinity War**\n\n1. World\n\nUnlike most films the World card meaning is immediately presented to the audience as they begun the movie:\n\n&gt; The World represents an ending to a cycle of life, a pause in life before the next big cycle\n\nWhat one can learn from this, as a film, is that life is a cycle and sometimes lessons of hope can, if not must, immediately start after a disastrous cycle.\n\nFor disasters, often times major disasters are the ones that unite hero and villain towards one cause. That is the true genius behind the main antagonist's plan.\n\nIt is not the act of wanting to cut half of the universe' population that is of merit: it is the fact that a disaster unites people more than it divides them.\n\nIn my country the Philippines, we see this phenomenon in a dictator-like entity like Duterte. \n\nAn entity who accomplishes half of his world-view ends up being seen as a necessary evil compared to his opposition who promises a whole of nothing and therefore gains massive support compared to the preachers who promises the absolute whole of their world-view.\n\nWhile it is possible to dwelve more on this subject, it is only the first arcana so I leave you with one possible version of the question the Avengers asks our society:\n\nWould our world be better with a Hitler who started and succeeded as a dictator but held back as he was just conquering the world? \n\n(That is would Hitler be any more evil than an America who promises democracy to the whole world if he conquers and kills and tortures people but after his success: Releases the Jews, takes care of the family of all the war victims he destroyed and in general is only half as evil as he really was?)\n\nThis leads to the second Arcana:\n\n2. Judgement\n\nNormally what Thanos does can be simulated by mercy or lack of foresight (if you want to be Machiavellian) but following the premise of whether a half-way dictator might benefit the planet more than an absolutist savior - the film then asks us, what was the real reason Thor survived?\n\nWhat was the real reason Loki survived so that he may come back to kill Thanos? (albeit this was executed immediately as opposed to the more formulaic Game of Thrones idea of needing someone to grow up first or evolve as a human assassin)\n\nMost importantly, why does the one true hope for the Gods sent to warn the others when he could have been there to delay and slow down the inevitable?\n\nThus the film shows us Judgement. What is the right decision when the world has come to an end?\n\nDo we, as a society, choose to go back to the Christ-like sacrifice of the Cross and wish that our savior would come back from the End Times to Judge our destruction?\n\nor\n\nDo we save Jesus this time rather than wishing for Jesus to come and save us by being the judge of our own society's scriptures and choosing the savior we want rather than the one prophesied to us?\n\nThis is where Memento ends and simply promises us to repeat our Judgements.\n\nAvengers however asks of our society: Who should we send as a messenger to other worlds?\n\nShould we send the greatest hope we have in the hopes that the hope might one day grow stronger against the inevitable like the Hulk?\n\nor should we turn the Hulk into a martyr and send the one \"we as a viewer of stories\" want to send? (Much like the fictional saviors of our beloved films?)\n\nThis wouldn't be as deep a question if it weren't the end times and the next tarot card being:\n\n3. The Sun\n\nIn wikipedia, the Sun tarot is said to represent Optimism but one other word jumps out: Assurance\n\nIf the world or a country was ending, what was the assured thing to do versus the optimistic thing to do?\n\nThrough this \"sending back of the Hulk\" the movie leads us to the question:\n\nWhat can assure our future at what moment in time?\n\nUsing nuclear weapons or disbanding nuclear weapons?\n\nThe movie opts for the answer: First try out the weapon (let the Hulk attack) and then learn from the lesson and try disabling the weapons (sending the Hulk back with the risk that he may lose his powers but at a greater chance of being able to warn the next world because Banner can figure things out including how to return to becoming the Hulk where as the Hulk can't.)\n\nThus the lesson here is that optimism is sometimes a choice we must make but in order to make the assured choice, sometimes we must make a different more weaker choice. (or at least as it would appear to us initially)\n\n4. The Moon\n\n&gt; According to Waite's The Pictorial Key to the Tarot, \"The card represents life of the imagination apart from life of the spirit... The dog and wolf are the fears of the natural mind in the presence of that place of exit, when there is only reflected light to guide it... The intellectual light is a reflection and beyond it is the unknown mystery which it cannot reveal.\" Additionally, \"It illuminates our animal nature\" and according to Waite, \"the message is 'Peace, be still; and it may be that there shall come a calm upon the animal nature, while the abyss beneath shall cease from giving up a form.'\"\n\nThe whole sequence of Tony and Strange and Pepper Potts represent this. It's too personal and symbolic to associate without pictures but for the most part just imagine the worry of a lover who fears for her other lover being sent to a War Zone \"at the moment of their tranquility\" by some grand stranger with authority over the universe they exist.\n\nToo scene-centric but basically Tony was living the imagined life but he would find out (though he knew deep down) that being a hero would tear apart this imagined life but still he sought to be \"part of the imagined life\" for just this one moment.\n\n5. The Star\n\nAgain too scene-specific but this encompasses both the Peter-Bus scene and his whole \"saving Strange while not saving him because he got hit\" thing.\n\nIt pretty much tells the audience - \"Wake up. Life is happening again.\"\n\n6. The Tower\n\nAs wikipedia says: Normally this is followed by the devil but since this is the reverse, the spaceship scene came before we get introduced to the devil. \n\nSimple scene shifting that has ramifications only if and when you value fictional New York's destruction.\n\nIf you do, it asks our society: Would you leave the comforts of your home to head towards a desolate space like Africa if you think it would save the world?\n\nPeter was all-yes while Tony was all-no (see the Moon) but it would be Tony who would have a suit ready for Peter because not only assurance trumps optimism and experience trumps youth but unlike the tarot card, the Tower moves as it has already suddenly appeared - not because it appears \"after\" a sudden disruptive event.\n\nSeen from the view of our world, it begs the question: \"Will you enter the hole of suffering during times of war and will you do it knowing you can be gunned down by a machine gun, jailed for breaking the law and all these other revolution inducing things or will you just stay as a hero? A hero praised for saving the territory he protects but unwilling to become the villain the world needs?\"\n\n7. The Devil\n\nBasically the entire sequences right after all involves heroes and villains being seduced in one way or another. Again it requires scene for scene and my memory is vague on the details but basically every one of the hero was being seduced one way or the other. If not by the villains but by their lovers.\n\n8. Temperance\n\nCap tolerating his return\n\nBanner's expression and descent to meeting Black Widow before and after.\n\nVision and Scarlet Witch.\n\nThe entire Vision-Scarlet Witch fight scene can be equated to the virtue Temperance where they had to held out despite the fact that had they made the right decisions or not been hit in the wrong spot - both Vision and Scarlet Witch could have handled their opponents but instead they had to be saved by Cap and even then Temperance rewards Temperance.\n\nRather than safety -  they have to be patient in handling the leave no man behind rule and the Scarlet Witch must prioritize her feelings over the world rule that must be decided by patiently waiting on a plane and hoping Wakanda has an alternative way to save everybody.\n\n9. Death\n\nSince death in Tarot does not mean death - this is not about the ones who died but centers around Vision and Scarlet Witch and Bucky who must give up everything and return to \"basic\" which was to start a new life - only it's not a new beginning but a calling to drop everything and become one with the greater need.\n\n10. The Hanged Man\n\nBasically everyone had this dilemma too.\n\nThanos was seeking the stones.\nGamora's sister and Gamora were in trouble and were seeking a way to rectify the mistakes/futile missions of the others.\nThor was basically Odin in this movie which the card is supposed to represent.\n\nIt's at this point that my movie memory is vague and my fingers are getting tired of typing so there's many of these comparisons and the questions it asks our society that are missing but many of them are obvious dilemmas by the characters such as would you kill your lover and what happens when you fail to kill your lover? Would you stay idle after you betrayed your clan? etc. etc.\n\n11. Strength\nWiki:\n\n&gt; The key characters are that of a woman and a lion, with the woman looking calm and gentle, yet dominant over the lion.\n\nBasically Thanos and Gamora scene where Gamora threw the cup.\n\nQuestion for society: Who rules who in society? The frustrated angry underling or the bureaucrat who can sleep well at night?\n\nKey lesson: Both are suffering. The bureaucrat wants to lord over a population that is still \"Gamora\" while Gamora lashes out and wants to be free of Thanos' clutches...or at the very least infuriate him long enough to think of a way to revolt.\n\n12. Wheel of Fortune\n\nThe entire movie but it is after these scenes where things become a rush. Each character was addressing their own way of getting their way.\n\nQuestion for society: How would you run your life after the world changes you?\n\nCause if it can change the heroes' course based on what ship they were in or what tasks they failed to do - your real world events can certainly change you.\n\nDo you go back as with Dr. Strange or do you go forward as with Tony Stark to face Thanos?\n\n13. Hermit\n\nSo many symbolisms here. Red Skull (or at least I think that was Red Skull) is the obvious one.\n\nThanos becomes this.\n\nThis basically leads to the development of Thanos as a relatable character although it really asks little of our society.\n\nThe question was pretty much spelled out by the movie: Would you sacrifice your most valuable to acquire something...that's of less value.\n\nIt's a short sequence that rivals the depth of The Prestige and other Nolan films but because people don't care for Gamora it mostly falls flat.\n\n14. Justice\n\nA central theme in the entire movie but none more so than the barrier conversation in Wakanda where each side was trying to avenge the other side/protect the other side.\n\nBasically the same questions in any war movie: Who is right? Might is right so prepare for battle - the question being: Do you let the enemies in by lowering the barriers or do you let them break the walls and circle around you?\n\nA simple question cause we know the outcome but not an easy one in real life cause we are naturally risk-averse people who would rather our conquerors circle around us until it is too late. \n\nCue the existential dilemma of Wakanda's shields during an event where the entire planet is at stake. \n\n15. Chariot\n\nEveryone must decide and part of what makes the latter half of the action scenes worthwhile. You even get some villain being ran over and Scarlet Witch \"where was this chick?\" scene.\n\nLessons for society: Decisions must be made during events of mass chaos.\n\nQuestion: Will you leave your lover just cause you want to fight when you can probably save both you and him if you just kept working on the solution? The eternal frontlines versus inventor/spy question dilemma. \n\n16. The Lovers\n\nThe obvious is Vision and Scarlet Witch but one underrated character is the scene between Hulk and Banner. \n\nWhen Banner accepts the Hulk isn't agreeing with him - that was the time he could shed his distractions and defeat the enemy easily.\n\nQuestions for society: When your mind is in an argument with your loved one, can you do as Bruce did and not break down?\n\nThis entire movie was partly about Thanos but it began and ended with Banner and the Hulk. \n\nCompared to even the Ang Lee Hulk movie, this was the most existential a Hulk movie has ever been.\n\nIt asks and begs a man: How much do you care?\n\nBanner could have just been on the sidelines.\nBanner could have had a shouting match with Widow.\nBanner could have snapped at the Wakanda surgeon when she correct him.\n\nInfinity War is a Banner movie without the title.\n\nFew films could be as deep as Infinity War if it mainly focuses on Banner's perspective. He is Charlie Kaufman-esque in his dilemma. His Anomalisa is the fate of the entire world. \n\nHis joker is actually going after the entire universe and he is not his own Batman. Even his friends are not making light of it (except Tony early on) cause the entire world is at stake.\n\n17. The Hierophant\n\nThanos and his underling is basically this the entire movie.\n\nIn this case, Thanos' scenes became an entire Pope-like sequence once he acquired the Infinity Stones.\n\nThe lessons or the depth of the film lies in how he dismantled each hero.\n\nIt was as if he was blessing them all with his brand of Justice but most importantly the key take away for society is the last Thor sequence.\n\n\"You should have gone for the head.\"\n\nThis symbolizes Thor's mistake of being like many entities in the world who went against the Church but did not attempt something as ludicrous as Guy Fawkes did.\n\nIn the end, this led to half of society dead and half of society looking around.\n\nThis parallels the atheist versus theist movement where the atheist will be the ones who are left searching while the theist teleports to Heaven and are saved from the sufferings of this universe. \n\nAs a scene, it's nothing that hasn't been shown before in storytelling but where this is unique is that the Pope or in this case Thanos only smiles at the rising sun which is unique if you really create parallels between Thanos and cult leaders.\n\nIt's just not something that is often shown in film: the madness of a cult leader. It's not just evil or stubbornness or sticking to dogma that defines these people - it's how they just want to get things done at the end of the day.\n\nIt's very hard to capture in film. A face of a serial madman just wanting to smile at the end cause he is right. That \"it's all in a good days' work\" smile. \n\nIt's something very Zen. It's something very... unique. Almost Citizen Kane-like in it's execution of success.\n\nAs a society, it begs us to consider: At the end of the day, is this the same kind of smile we want after we've achieved our dreams or have retired from our dreams?\n\nIs this the same smile that Hitler would have?\n\nThose faces we so often associate with evil can sometimes - in a brief space of time - reveal to us many things about ourselves. \n\nFor you see the Hierophant as a card is not a card that asks us what we want, but of who we are if we know we are blessed.\n\nAs a society, the film does not intend to ask: What if we were Thanos?\n\nInstead it asks: What was the point of all this?\n\nWhat is the point of the Pope?\nWhat is the point of the atheist?\nWhat is the point of rebellions and society rebuilding?\n\nWhy? \n\nHad Infinity Wars ended here (without focus on the vanishing heroes) it would not have been a popular film but it could be considered the first Superhero Werner Herzog film which is testament to its hidden depth.\n\n18. The Emperor\n\nOne would think the above explanation would fit for the Emperor instead of the Hierophant but instead this is \"The Prestige\" of the film.\n\nAll the while the film disguises itself as a story about someone conquering the world but in reality it was a story about a guy who just wanted to spread his belief. \n\nIn society, it begs the question: \"What was the point of you assuming the throne?\"\n\nDid you just want to become president?\nDid you just want to become the CEO?\nDid you just want to leave a chaotic world behind?\n\n19. The Empress\n\nTo supplement the above - the Empress asks the questions, what happens after you've ruled?\n\nThe Empress in this movie is the last few words. Don't remember them. I think something about how he will be back?\n\nThe Empress card is all about implications. In this case, it is one last lesson for society:\n\nHow would you watch Marvel films from here on out knowing the implications of this movie?\n\nIt's more of a wink to the viewer rather than a scene though but few films leave a viewer asking, how will I watch x type of films from here on?\n\nFinally: The High Priestess = Post-credits scene. Kinda spoiler-ish but that's the point of the scene.\n\nMagician =  Dr. Strange's real intent. I believe there is a youtube video of that already.\n\nThe Fool aka the True Ending of Avengers\n\nLike I said, this film is really all about Bruce Banner. From his journey as the end of his becoming the Hulk to his acceptance of becoming the Fool. It is a character study not different from Thor: Ragnarok but this time with the ramifications of his sanity. \n\nSee: Just like there is a truefilm behind a film, Bruce Banner is the true hero (the true person you should be keeping notes on) throughout this movie.\n\nIt is a tale so rarely done in mainstream films where a genius, a savior, a guy who is everything one should want for a hero. \n\nSacrifices. \n\nReturns to his friends.\n\nOnly to find out that where the world, his society, has become different: he has taken a step back.\n\nHe has taken a step back because he has gotten older.\n\nHe has taken a step back because he is injured.\n\nHe has lost everything including being able to hug the person he wants.\n\nHe is the soldier who has returned to a war questioning its meaning only to find out that a new war has begun in place of the war he was fighting for. (Like the War on Poverty/Mentally Ill/Racism/Internet Bullying after coming from the Cold War)\n\nBruce Banner asks us: \"How can I be happy and live forward in this hour where everything and everyone has already changed?\"\n\nSo Bruce becomes the Fool. Bruce dons the armor. \n\nHe becomes what the only friend who made fun of him early in the movie was.\n\nHe becomes the Iron Fool.\n\nHis reward? That is up to the viewer to decipher especially cause remember: Infinity War did not end on a good note.",
        "created_utc": 1526382457,
        "upvote_ratio": ""
    },
    {
        "title": "Black Beauty (1994) a film by Caroline Thompson",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jieu8/black_beauty_1994_a_film_by_caroline_thompson/",
        "text": "[deleted]",
        "created_utc": 1526354298,
        "upvote_ratio": ""
    },
    {
        "title": "An Inquiry About the Mainstream Adaptability of Call of Cthulhu",
        "author": "ThePickleHawk",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jhqn6/an_inquiry_about_the_mainstream_adaptability_of/",
        "text": "It is often said that Lovecraft's works (namely, Call of Cthulhu) are unadaptable due to their nature and content. However, this has been proven to be not entirely true. There was an independent adaptation of \"Call\" some years ago done in the style of a 1920s silent movie that effectively captured the feelings that the story is supposed to invoke. \n\nHowever, that was just an indie thing. With today's audience preferences for big explosions at a constant pace and current studio trends, is it truly possible for a big studio to faithfully adapt \"Call of Cthulhu\" in a big budget manner and still be successful with a mainstream audience? \n\nI truly have doubts that a big studio could pull it off and be successful if they were going for accuracy. In the story, Cthulhu himself only really appears at the climax. This would translate to a lot of buildup (that I think could build truly spectacular atmosphere and suspense/tension), world building, and then, maybe, tops, 10 minutes of screentime if the scene was stretched out slightly. Studio temptations to make Cthulhu appear onscreen throughout the movie and as a giant rampaging CG Godzilla clone aside, audiences themselves would probably go in expecting a monster movie and leave disappointed that he was only there in the end and was never presented as another threat when he WAS there, instead being shown as a cosmic force beyond human comprehension with no possible way to stop. They'd be expecting a giant fight and never really get it. It would probably be a box office bomb after word of that disappointment spreads. \n\nDo you think it's possible to be faithful, mainstream, and still successful?\n",
        "created_utc": 1526348216,
        "upvote_ratio": ""
    },
    {
        "title": "How to get into old films",
        "author": "astrosoil",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jgxf7/how_to_get_into_old_films/",
        "text": "I have been enjoying movies for many years now and have been consistently watching modern movies with the occasional few from the early 20th century. Recently, I found that I want to really understand the history of film in order to inform myself of the giants that the movies today stand on. \n\nI can't help but feel extremely overwhelmed by the vast and rich history of film. To tackle this I created a sort of \"plan\" on achieving this goal below, and I'm wondering if you guys have any additional specific recommendations for any of these points.\n\n&gt; 1. Read *Film History* by Kristin Thompson. (And I found a ton of books in a Google search but I just decided to go with this one. Perhaps there are better books?)\n&gt; 2. Is the Crash Course Film History series on YouTube any good for people who actually know film history? It's probably a good place to start, I suppose...\n&gt; 3. Watch a **ton** of movies, based on some Letterboxd lists (there's plenty under this search query: https://letterboxd.com/search/lists/history+of+film/).\n&gt; 4. Look into some documentaries about famous directors (Kubrick, Tarkovsky, etc.), and some that are recommended on [this thread](https://www.reddit.com/r/TrueFilm/comments/2ywmsx/looking_for_some_documentaries_on_the_history_of/).\n\nHow did you guys move from watching and enjoying modern movies to looking into film from the past? For example, should I watch movies in chronological order of release, go by director, etc.? I would also like to learn as much about international film as I can as well, since a lot of books tend to be a little focused on just America or Europe. Perhaps it's just best to dive right into the movies, but I guess I also want a bit of an academic approach to it as well -- through books or documentaries.\n\nEdit: oh lol I found [this thread](https://www.reddit.com/r/TrueFilm/comments/8j1cod/finding_a_guide_book/) which was posted recently, but I guess if you guys have any other things to say I'd appreciate it.",
        "created_utc": 1526340789,
        "upvote_ratio": ""
    },
    {
        "title": "LucReviews: Bates Motel (1987)",
        "author": "LucReviews",
        "url": "https://www.youtube.com/watch?v=mV7p4WjkBdA",
        "text": "",
        "created_utc": 1526335433,
        "upvote_ratio": ""
    },
    {
        "title": "Actually good quilty coming of age/teens films",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jcpy5/actually_good_quilty_coming_of_ageteens_films/",
        "text": "[removed]",
        "created_utc": 1526308453,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (May 14, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8jckhs/casual_discussion_thread_may_14_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/)\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1526307263,
        "upvote_ratio": ""
    },
    {
        "title": "The House That Jack Built (2018) | Official Trailer | Lars von Trier",
        "author": "KlevisCana",
        "url": "https://www.youtube.com/watch?v=8NrZsLVzdHM",
        "text": "",
        "created_utc": 1526305158,
        "upvote_ratio": ""
    },
    {
        "title": "President of the USA Donald Trump on Citizen Kane. Great review.",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=aeQOJZ-QzBk",
        "text": "[deleted]",
        "created_utc": 1526297280,
        "upvote_ratio": ""
    },
    {
        "title": "Synecdoche, New York still haunts me to this day.",
        "author": "ShinbrigGoku",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ja609/synecdoche_new_york_still_haunts_me_to_this_day/",
        "text": "Hey y'all,\n\nSo something I've noticed, personally is that even though I've seen this movie roughly 3-4 years ago (give or take), it is still embedded in my mind. I consider myself an aspiring writer, and this movie hits me on such a personal level where a guy spends SO much time trying to develop the \"perfect\" play, but doesn't have the time for his family, girlfriends, etc. Eventually, it never gets released and he dies. I'd say four years ago, I did have a fear of death but now I've accepted it. But man, does the movie make you reflect on what you've done in your life. I don't think it's just the theme of death but one scene that REALLY struck a nerve with me was when his daughter died hating on him. I admit I don't have the best relationship with someone in my family, but it would devastate me if they died hating me or never forgiving me.\n\nCredit to where credit is due, something I will say about this film is just how unique this film is. Really, I can't think of another movie that's similar to this.\n\nOverall, is anybody else still disturb by this movie?",
        "created_utc": 1526278976,
        "upvote_ratio": ""
    },
    {
        "title": "Question about 'Never Let Me Go'?",
        "author": "stwstrk",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ja35q/question_about_never_let_me_go/",
        "text": "I just watched it today and I liked it, but there's some stuff that I was never able to get that were:\n\n* What did the whole Ruth and porn magazines thing even meant? Why was she looking at them and why did Kathy and Tommy talked and put it against her all the time?\n* Why did Kathy kiss Ruth while she was telling her she'd never get with Tommy? She also brought up the magazines thing",
        "created_utc": 1526277902,
        "upvote_ratio": ""
    },
    {
        "title": "Oliver Stone's Alexander",
        "author": "shallowblue",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8j8ady/oliver_stones_alexander/",
        "text": "I have watched this movie now a number of times and am trying to reconcile the 16&amp;#37; Rotten Tomatoes rating with the fact that I actually really enjoyed it.  The recreation of the Battle of Gaugamela is simply the most accurate depiction of an ancient battle ever filmed.  Babylon is brought to stunning life, especially the scene overlooking the city at night from the balcony.  Alexander's speeches before battle and to the dying Hephaestion are beautifully inspiring.  The movie is exceptionally faithful to the historical sources, right down to the dialogue.  I think it was made unnecessarily confusing by the scrambled timeline and would have been far more effective with a standard start to finish chronology \\- especially since Alexander's story dovetails remarkably with Hero's Journey.  The soundtrack by Vangelis had some exceptional moments but some laughably lame ones too.  Some bad overacting by Colin Farrell marred some scenes, especially between Alexander and his mother.  They should have shown the drunken burning of Persepolis to give a more balance portrait for Alexander too.  Overall I think these obvious howlers impaired what could have been a truly epic film but if you manage to ignore them then what's left is a real historical immersion and a feast for the senses.     ",
        "created_utc": 1526258099,
        "upvote_ratio": ""
    },
    {
        "title": "Where Melancholia Fails",
        "author": "lifesizedgundam",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8j82kg/where_melancholia_fails/",
        "text": "I originally watched Lars von Trier’s Melancholia for the first time earlier this year. I didn’t enjoy it. I watched it again for the second time in an attempt to maybe get a better understanding of the film, with the possible hope that my opinion on it would change. It didn’t. I recently watched it again for a third time, this time so I could understand fully what I dislike about the film and why. \n\nIt should be noted that I have not seen any other Lars von Trier films and know very little about his style and his work except that he was one of the originators of the Dogme 95 manifesto. His film The Idiots is currently on my Must Watch list.\n\nNow I want to begin with the common criticisms I’ve heard about Melancholia from others. Among other things, the most common complaints I’ve heard are that the film’s use of handheld camera feels amateurish and distracting and the slow pacing tends to bore along with the lack of significantly exciting events. I disagree with these as I find that they are what make the film what it is. The handheld camerawork is done to evoke a documentary style from narrative which helps ground the realism of the subject matter of the film (depression) and contrast the essentially science fiction nature of the story. I found it to be the most interesting aspect of the film as it seemed almost like a documented drama about a woman and her strained relations with her family and associates and how this strain is fed by and wears on her clinical depression, creating a sort of hellish loop of hopelessness. Justine’s depression makes it hard for her loved ones to deal with her which in turn feeds the depression which culminates in her lashing out which wears on her loved ones again. This is particularly realistic and the handheld camera adds to that effect. \n\nThe slow pacing is also something I took no issue with, though some didn’t seem to appreciate it as much. I found that the film’s pacing mirrored its subject and in that sense actively reflected just what it meant to. This cannot be considered a failure in my view as it was the intention. Things moved at a realistic pace. The wedding reception portion of the film naturally moved at the pace of what a wedding reception would and having half of the movie be this way allowed us as the audience to grab a deeper understanding of Justine’s emotional states and how they conflicted with the general overall feeling of happiness that a wedding reception is supposed to encompass. Likewise, the second half seems to be a meandering among the days as Justine’s sister Claire deals with Justine’s overbearing depressive state and the overwhelming anxiety she feels as she frets over an incoming apocalypse event. There are no dramatic sequences of action or betrayal that seek to affect or manipulate audience emotions. Events begin, unravel as they would, and then end, just as they would in real life. This is not what I would consider a weakness of the film.\n\nNow what I do consider one of the film’s weaknesses is a product of the second half of the film denoted as “CLAIRE”, focusing on the events after Justine’s wedding, leading up to the fateful collision between Melancholia and Earth. At the beginning of the film we’re treated to 8 minutes of surreal, evocative, slow motion imagery set to Wagner (I’ll talk more on this later). Part of these images is a sequence depicting a rather large planet (Melancholia) slowly colliding with the Earth. In the second part of the film the characters talk of Melancholia’s passage around the Earth, highlighting the dramatic irony. They don’t know they’re all about to die. We do. There is nothing wrong with this, however, Claire’s husband’s joyous talks of the never before seen spectacle of the planet’s passing and his dismissive attitude towards his wife’s fears seem to be the main crux of this second half and this is where this part fails. All throughout, Claire is seen fretting and worrying about the perceived threat to her existence, there is even a point where she’s given a relief of hope and no longer believes in her incoming demise, only to be seen fretting and worrying again later. My issue here is that we already know they’re going to die, so the hour the characters spend going back and forth, unsure of their death seems so arbitrary. It seems to me that the second half would’ve been much better if the characters too knew of their incoming deaths and this half of the movie were spent focusing on how the individual characters spend their last moments.\n\nA very minor aspect of film which nonetheless rubs me the wrong way is the faux sophistication that pervades the film. The repeated use of Wagner, the scene of Justine switching the pages of the paintings in the books, the setting taking place in the castle. They all seem to do nothing particular for the story except add a sense of petty sophistication in an effort to add a veneer of upper classness and intellectuality, as if the film were too afraid of its subject and were desperate to be taken seriously. Other films use intertextuality and allusion in similar ways, such as in It Follows where one of the characters spends the film reading Dostoevsky along with a reading of TS Eliot, and in various Godard films. However it’s here in Melancholia where these things seem to be done to such a degree where they don’t seem to add any general purpose aside from von Trier going “Look how educated I am!” And it’s effect is personally very grating.\n\nFinally I’d like to address my biggest issue with the film which is that it left a negative impression. Not in that it left me with sour emotions but that it did little for my expectations of the film. With every film, I believe one goes in with certain expectations, regardless of whether one has viewed a trailer or seen a scene prior to viewing. Just the title of a film alone gives expectation to it. That said, I believe that people should walk into a film expecting as little as possible, that is, they shouldn’t tack on layers of expectations towards what they want a film to do for them or what it should be. A viewer should be ready to accept the film on its own terms because that’s how they’ll get the most out of the experience. I’ve found that the best films I’ve seen reveal more to them than I previously expected of them, whether it be hidden intellectual depths, innovative technical work, impressive acting or novelty in narrative storytelling. Melancholia, however, revealed very little. Everything about it seemed so trite and underwhelming. The performances and visual effects were well done but did not leave any positive lasting impression as a viewing experience. The most I can say for it is that in its aim to be a film that captures melancholy, it does that to an extent. But even then, it doesn’t go so far as to make a significant mark and by the end it feels rather dull.\n\nWhat did you all think of it? Do any of you disagree with any or all of the points I made? Why? What Lars von Trier film, if any, would you recommend I see next?",
        "created_utc": 1526255961,
        "upvote_ratio": ""
    },
    {
        "title": "What films change style or form (live action, stop motion, anime, etc.) during or throughout their runtime, and why?",
        "author": "tophersturn",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8j6o05/what_films_change_style_or_form_live_action_stop/",
        "text": "I was wondering what films have been made that take advantage of multiple different styles of filmmaking, and why would a director decide or not decide to use this?\n\nThe other day I watched Kill Bill Vol. 1 which is mainly live action, but has a whole anime sequence. Similarly, James and the Giant Peach moves from live action to animation (stop motion, iirc) while The Lego Movie goes from 3D animation to live action.\n\nIn Kill Bill, Tarantino partially used it for homage, as the whole movie appears to be a love letter to Asian cinema in all its forms. The other two movies mentioned use the technique as the protagonist move from one world to another. This seems like a pretty obvious use since the changing style literally shows the character has moved from one world to another.\n\nDoes anybody have other examples of this being done, and what made it effective or ineffective?",
        "created_utc": 1526242957,
        "upvote_ratio": ""
    },
    {
        "title": "I explored the themes of dehumanization within the Kubrick film \"Full Metal Jacket\". My ideas refered to the direct relations and infered points throughout the film but was there anything that I was missing and what was your thought's on Kubrick's interpretation on Vietnam?",
        "author": "ThisGuyJoey",
        "url": "https://www.youtube.com/edit?o=U&amp;video_id=giQfqJ8_AWo",
        "text": "",
        "created_utc": 1526240329,
        "upvote_ratio": ""
    },
    {
        "title": "Rape-revenge in film: A case study of the critically acclaimed \"Revenge\" (2017) and the extremely maligned \"I Spit on Your Grave\" (2010), and the question of when is a film feminist.",
        "author": "TrumanB-12",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8j6bad/raperevenge_in_film_a_case_study_of_the/",
        "text": "So today I had the pleasure of watching Coralie Fargeat's debut rape-revenge action thriller Revenge. As tends to be the case with this genre, it's a film that is by design predictable in its story, characters, and progression. For this reason, it's not a genre I particularly enjoy, as it often gets trapped by its own rules. The set up follows a simple two-act structure:\n\n- attractive woman is headed to an isolated location populated by overly lecherous men, where she gets raped and left for dead\n- woman survives and goes on a killing spree\n\nIt's an intrinsically exploitative genre (which is not *necessarily* a bad thing imo). In the past, films like I Spit on Your Grave have been called out specifically for this reason. Roger Ebert famously gave both the original and remake a thumbs [down](https://www.rogerebert.com/reviews/i-spit-on-your-grave-2010). \n\nNow I haven't seen the original, but I have seen the 2010 remake, which I’m not a fan of, not because I find it morally reprehensible, but because I think it’s neither stylistically, nor narratively, nor thematically interesting. This choice is not without reason, however: its swampy-slick aesthetic is murky, desaturated, grey, and impersonal. It does not seek to be noticed, more so to provide an oppressively grim background to the events of the film. The score is sparse, the generic screechy sort, with the occasional deep drum beat to indicate you are watching an intense moment. Per low-budget grindhouse customs, the villains are poor, Southern rednecks. Even the sheriff who is meant to be a guardian of the law is corrupt. Our protagonist Jennifer has come to a place where the seclusion she desires is ultimately what enables her horrible ordeal. This is not a happy place. \n\nBy contrast, Revenge is far more cinematic, stylistically arresting, and for lack of better word: “rich”. Not simply in its cinematography, but also in it’s setting and production design. The guys wear expensive, branded clothes, Richard’s desert home is luxurious-filled with art, state-of-the-art interior design, and an enormous outdoor pool. Though the location is undisclosed, it was filmed in Morocco. This is not simply just any desert however: luscious grassy plains set against snow-capped mountains in the horizon. Sure, the desert heat plays a prominent part, but this is a beautiful natural landscape. There is lots of color in the picture: blues, pinks, greens, and plenty of flashy camera-work and editing. Going here on holiday isn’t a bad idea. It has an overwhelming filmic beauty which sometimes overshadows its subject matter. \n\nThe other area where the films significantly differ are the rape scenes themselves. The former film is far grislier. Jennifer is psychologically and physically tortured for ten minutes in an excruciatingly long exercise in male power (this is the most effective part of the film), and this is briefly separated from the rape, which lasts roughly fifteen minutes. It’s harrowing, ugly, and doesn’t shy away from the monstrosity of the act. In Revenge, Jen’s (oh hey look they share names, what a coincidence!) rape lasts for less than a minute “on-screen” (it takes place largely behind closed doors. While on the surface this might seem less exploitative, to me it only cheapens Jen’s experience. It relies on the audience having previous “knowledge” about the trauma of rape. It’s not something that will stick with you for the rest of the film. Jennifer’s ordeal, however, drills itself into your brain so when you think of rape, you’ll think of her brutalized, flailing body pressed down into the mud. The intensity of ISoYG’s first act matches it’s second, unlike that of Revenge.\n\n\nBelieve it or not, my problem isn’t with Revenge itself, but rather the critical response it’s getting. Revenge is being hailed as some sort of revelatory film, one that successfully utilizes and subverts genre conventions, alongside a thrilling, bloody experience, as a means of female empowerment. The film itself audio-visually impressive, and has some nice symbolism, but to me it seems it’s critical praise is more a function of the circumstances around the film is being released, more so than the creative choices inside the film itself. Reading the reviews, praise of the technical elements seems almost secondary; added on in a nice little paragraph at the end to bowtie the rest of the prose. I Spit on Your Grave’s creative elements were completely overlooked when the film came out, and it was dismissed as complete trash, despite arguably having its own case to bring to the table.\n\nOnto the critics:\n\nMichael Ordoña LA Times review to me is a good indicator of the sort of responses ISoYG got back in 2010. It wasn’t an empowering feminist film, simply exploitation trash designed to shock. The reviews I’ve found for the film are short and dismissive. They describe the plot and then the author sums up their thoughts within a few sentences.\n\n*“There's no suspense during the many long stalking sequences because we know what's going to happen when either beautiful soon-to-be-rape-victim or horrible soon-to-be-revenge-victims are being pursued. That's the problem (one, anyway) of making a film with nothing more than a premise. That's it, that's the whole movie. Oops, spoiler alert.”*\n*“Sure, some folks get their jollies from seeing a woman extensively brutalized, presumably justifying their voyeurism by then enjoying watching men suffer tortures that are, to say the least, unlikely. But for most, there will be no adrenaline rush from fear or thrill, or vicarious release from seeing tormentors tormented; one leaves feeling sad. Sad that this is what \"entertainment\" has come to.”*\n\nPerhaps it’s a good idea to look at the response Revenge is getting? Well, let me just say the length of the reviews has tripled, and they’re filled with praise and examination. Christy Lemire wrote the following for RogerEbert.com (I apologize for how much I’ve included here, it’s essential for me to drive my point home):\n\n*“Revenge” is the film we need right now, from a filmmaker we need right now: French writer/director Coralie Fargeat, who makes her stunning feature debut with a rape-revenge fantasy that’s as brutal as it is thrilling.\nNow, you may be thinking to yourself: I really don’t want to watch a gory, graphic movie about a woman being raped and then seeking bloody revenge against her abusers. In the midst of the #MeToo and #TimesUp movements—which have inspired and empowered so many women to discuss the sexual harassment and assault they’ve survived—the idea of exploring this kind of disturbing, emotionally complex territory cinematically might seem like too much to bear. And I get that. To be honest, I was kind of dreading seeing “Revenge” myself, even though it already had earned strong reviews and word of mouth.*\n\n*Turns out, now is precisely the time for this film. It’s intense and often excruciating to watch, but it’s also extremely satisfying as it allows us to live vicariously through a woman who delivers payback and then some to the men who viewed her as disposable. Fargeat displays a masterful balance of tone and pacing, as well as a super-stylish visual flair and a heightened ear for sound design. “Revenge” is shocking but not gratuitously so; surprisingly, it ends up becoming a feel-good tale of a woman enduring a series of horrific abuses and triumphantly coming into her own at the end.*\n\n*But one of the most impressive feats of all is the way Fargeat subverts and co-opts the male gaze, turning it into something that’s both playful and fierce. The sexy and scantily clad Matilda Lutz initially looks like an irresistible piece of eye candy, and Fargeat knows you’re thinking that. She toys with your expectations of how a woman who looks like Lutz is normally photographed in a film like this before ultimately celebrating her character for the warrior she becomes.”*\n\nI would post more snippets of reviews, but this is already too much and contains the essential points for which the film is being praised so heavily. I’m seeing a lot of praise for Revenge’s feminist elements, though in all the reviews I’ve read, I’ve failed to find either A) Any justification for it being feminist, or B) Any characteristics it doesn’t already share with ISoYG. If anything, I’d argue Revenge is the less feminist of the two because it’s far too confident in it’s subject matter as a justification for Jen’s revenge. Yes, rape is bad, and yes being impaled on a tree and left to die in the middle of the desert is bad, however in terms of sheer terror, it’s the inferior film. Jennifer’s beatdown makes her rise more remarkable, yet simultaneously reminding of the horrors she experienced. \n\nThe other phrase I keep seeing is something along the lines of “subversion of the male gaze.” Once more, I am lost here. Let’s contrast the two films again: in ISoYG Jennifer wears a hoodie and pajama bottoms and doesn’t put on makeup. She came to the cabin to write her book and be alone. Revenge’s Jen is perpetually done-up in a bikini, one night performs a very suggestive dance, and the camera certainly leers at her assets. Lemire claims this is self-aware, and this might be, but I don’t see the subversion here. Jen goes from bikini socialite to bikini Rambo. Jennifer on the other hand goes from lazy Saturday to an unflattering tank-top and jeans. \nFurthermore, Revenge’s grand exterior yet again proved a handicap when it comes to its own display of violence. It’s an extremely bloody film, though outside of the scene where Stan tries to pull a glass shard out of his foot (a set-up which I found rather unlikely in its context), the blood has little impact. It’s a quite vapid showing, one more style than substance, like something out of a Tarantino film. I Spit on Your Grave is significantly less bloody, however substantially gorier. There is graphic dismemberment, eye-gouging, and acid-bathing…among other things. It’s successful in showing that violence begets violence. \n\nOne last point I’ll bring up are the deaths. ISoYG got a lot of flack for it’s detailed, Saw-like approach to how Jennifer exacts her revenge. She brings about as much torture and suffering as possible, seeking to inflict the same kind of pain she was forced to endure. Critics took this as exploitative torture-porn. In Revenge, the three deaths occur from 1) A stab wound to the eyes, 2) A shotgun, 3) A shotgun. As previously mentioned, there is lots of blood, and the glass shard scene was quite nasty, however these deaths to me do not scream female rage. The following reviewer (and almost all others) seems to think otherwise:\n\n*“That said, the sun-scorched backdrop facilitates tension. Revenge’s landscape is as harsh as the assault on Jen’s body and as unforgiving as her retribution. Fargeat and her crew seem to revel in the grisliness, making foot gashes, abdominal puncture wounds, and waterlogged corpses look as nauseatingly lifelike as possible. She’s enjoying herself, and it doesn’t take much philosophizing to figure out why. With Revenge, Fargeat has waved a blistering middle finger at rape culture and rape culture’s enablers. Revenge isn’t hers alone. It’s womanhood’s, too.” – Andy Crump, Pastemagazine*\n\nCan you see the dissonance here? \n\nAll in all, Revenge is the more technically accomplished film, the more “pleasurable” to watch. It’s got plenty of flash and flair. I Spit on Your Grave is quite ugly by comparison…but isn’t rape itself ugly? Many war films come under fire for glorifying war with overly stylization, so why isn’t Revenge getting the same criticism. \nI will leave you here with questions:\n-\tWhat makes a film “feminist”?\n-\tWhen can it be said that a film glorifies something? \n-\tShould a film’s presentation match its emotional severity?\n",
        "created_utc": 1526240062,
        "upvote_ratio": ""
    },
    {
        "title": "Full Metal Jacket: Portraying Dehumanization",
        "author": "ThisGuyJoey",
        "url": "https://www.youtube.com/watch?v=giQfqJ8_AWo",
        "text": "",
        "created_utc": 1526228438,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of May 13, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8j4u2e/what_have_you_been_watching_week_of_may_13_2018/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1526227857,
        "upvote_ratio": ""
    },
    {
        "title": "Question: Why Do Wild West Saloons Have Ragtime Music In Films?",
        "author": "hailrazers",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8j26n9/question_why_do_wild_west_saloons_have_ragtime/",
        "text": "[removed]",
        "created_utc": 1526194442,
        "upvote_ratio": ""
    },
    {
        "title": "What elements of storytelling make a movie be called manipulative?",
        "author": "Rajatbhat",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8j1vuc/what_elements_of_storytelling_make_a_movie_be/",
        "text": "I know that cinema and storytelling in general is very emotionally in nature. I am, here in this question, mainly emphasizing on films or TV shows dealing with loss(of someone close), and coming to terms with it,(this makes an enormous list of works of fictions, on so many medium) like **Reign over me**, **Rectify** , **The Leftovers**(book and TV series), about characters with illness(**Still Alice**, **Amour, **My Left Foot**), so many tearjerkers(**The Notebook** right off the top of my head) \"Guy Cry\" movies-**The Shawshank Redemption**, **Saving Private Ryan**.\n\n\nI have read people say, some of the films did not earn the emotional response from its audience, or something said in a similar way. So what is it that differentiates TV series like Rectify, The Leftovers from Reign over Me(obviously apart from the length;  and I know comparing these is criminal but still just taking into account the emotional quotient and how characters do the inner psychological heavy-lifting with their surrounding); films like My Left Foot, , Amour (rated very high on Metacritic, RT and a bunch of other similar sites) to Still Alice, Dallas Buyers club.\n\n\n* Does making the story slow, maybe meditative like Solaris(old one)help?\n \n* Or also maybe fleshing out other characters, taking into account their thought processes, actions and POV? \n\n* Maybe a sharp, smart screenplay, or a unique structure, narrative. \n\n* Perhaps  stories about the non-fictional  ones( the King’s speech, Dallas Buyers Club) make the characters more relatable, grounded, maybe more grayer in nature? \n\n* The general tone, color palette, length, pacing can also be held into account.\n\nI feel like I may have answered my own question, but the question remains. What made some of the works of fiction more loved (by public and/or critics)? And how to differentiate?\n\n\nI have seen Still Alice, Dallas Buyers Club, The King’s Speech, Reign Over Me, The Shawshank Redemption , The TV shows Rectify and The Leftovers\n\n\nAnd have not seen but certainly plan to see Saving Private Ryan, Amour, My Left foot\n\n\nI haven’t read many books to come up with any good examples, sorry for that. Feel free to suggest me anything- books, movies, and TV series.\n\n\nI know this may seem like a somewhat unevenly written, long question, but I think I have clearly written everything that makes up my problem.\n\n\nFor the record, I am no expert at all in movie/TV (or any other fiction media) criticism. I am just very interested keen to learn about these. So pardon me if I sound like a pseudo-intellectual.\n\n\nAnd apologies\n\n* if my English is bad, the grammar is unbearable and the punctuation errors are a nightmare. But I am trying\n\n* for posting in the wrong subreddit, if I have. You can suggest another one where it might be appropriate, maybe /r/suggestmeabook, r/TrueFilm, r/television, r/filmtheory Or somewhere else",
        "created_utc": 1526189874,
        "upvote_ratio": ""
    },
    {
        "title": "Exploring the Underwhelming of Inherent Vice (2014)",
        "author": "jarjartwinks",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8j1k4c/exploring_the_underwhelming_of_inherent_vice_2014/",
        "text": "I am mainly interested in other's thoughts here. But I am wondering if a reason this film is (was) often under-appreciated because of the acting that we have come to expect from a PTA film. Coming off of There Will Be Blood and The Master, great performances were often the thing in PTA films (I think in a way this can be said of Punch-Drunk Love, but of course I think that film has more going on). Inherent Vice offers what could be described as surface level performances - though I still contend they are great! \n\nOf course with Boogie Nights it is still quintessentially a character piece. We identify with Dirk Diggler on an emotional level, and relationally this makes it easier to identify with the supporting cast. Here Joaquin is playing a pretty bumbling detective with no real emotional drive. My personal opinion is where there is a drive - specifically Owen Wilson and Jena Malone's arc - the performances are such trash that we cannot help but be disillusioned here. Owen Wilson admitted to not reading the book, giving some half assed response of PTA creating such a dynamic character in the script, why bother? At any rate, the Coy/Hope dynamic in the book - a kind of heart and soul, familiar story line just did not adapt well on screen. \n\nBut the film really does a good job of creating a culture and vibe for us to pry in on. It weaves an interesting narrative of SoCal history, housing issues, etc. But the kind of identification of character usually associated with PTA films is a bit askew here. Brolin's character is great, it's just he's a periphery. And when we get him, well we are bombarded with so many other characters it just shakes up how to identify, which I think goes back to Doc. Joaquin played this in a particular way. In a very Joaquin way. \n\nI am rambling at this point. I guess I am just wondering: is the reason this film is not higher on the PTA appreciation list because of the over saturation of characters and the kind of... superficiality of Doc as a protagonist, especially in comparison to how we are used to characters being presented in PTA films... \n\n",
        "created_utc": 1526185574,
        "upvote_ratio": ""
    },
    {
        "title": "Finding a guide book",
        "author": "slipshodblood",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8j1cod/finding_a_guide_book/",
        "text": "I am very interested in cinema history. I have a loose knowledge, having seen some but certainly not all of the \"greats\" and I am missing a lot of them. I have not seen any of The Godfather movies, Apocalypse Now, 2001: A Space Odyssey etc. I am looking for a book that has an at least sort of comprehensive list of necessary films to cinema history. I would enjoy one with particularly artsy entries, examples being like Naked Lunch, Brazil or The Lobster. I am also very interested in foreign cinema, specifically Japanese, so if there is a book that you know of that meets all or any of these categories I would appreciate it greatly if you would suggest it to me!",
        "created_utc": 1526183163,
        "upvote_ratio": ""
    },
    {
        "title": "Superhero Movies and the Problem with Them",
        "author": "kidneybean34",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8j0mrk/superhero_movies_and_the_problem_with_them/",
        "text": "I'm honestly getting sick and tired of seeing the same old super hero movies time and time again. I just watched Black Panther and once again, it was the exact same story and arc as every other Marvel movie created. I know this problem has probably been addressed on here and other places thousands of times but I just want to put my two cents in because I feel very passionately about this topic. \n\nThere's nothing inherently wrong with a classic good vs bad story but there is when it brings nothing new or original to the table and copies the same, overused formula that every other film of its kind does. Superhero movies are extremely guilty of this. Every superhero movie follows the same formula and has the same resolution with a big final fight in the end. They're all very predictable and tiresome. Sure, superhero movies are enjoyable but it's getting to the point where there are so many of them that it's not really worth it to go see it in a theatre anymore. And really, that's all these movies are, enjoyable. Only for a short amount of time and then you pretty much forget about them the next day. You don't learn anything about yourself or society by watching these movies, they don't have an overall deeper meaning to them and it's really hard to even consider them art when they're just there for money making purposes. \n\nNow, yes as someone who is super into movies, it makes me really excited and happy to see everything Marvel has achieved. They are such an enormously successful franchise and it's unbelievable. They've made so much money and have dedicated fans. They've created a formula that works and you have to hand it to them. But, that's not to say it isn't problematic. \n\nIt's not just Marvel either. I can't think of one superhero film from any franchise or company that actually can be compared to other films that are works of art (this might sound harsh but it's just my opinion. Obviously all movies are art but these ones are art in such a different way. It's not comparable). Some people will think of The Dark Knight as the one stand alone superhero movie that is different than others but is it really? Yes, it had some excellent scenes and Heath Ledger's Joker is perfect in every way. But the formula of the movie is the same as every other and it is predictable when you get down to it. I just wish there would be a superhero movie that could be compared to movies like Boogie Nights, Eternal Sunshine of the Spotless Mind, The Godfather, One Flew Over the Cuckoo's Nest, Juno, Her, Ladybird, Children of Men, No Country for Old Men, The Third Man, Train to Busan, Get Out, A Clockwork Orange, Inside Out, La La Land, Whiplash, The Sting, I could go ON. Basically, I wish someone would make a super hero movie where they actually took it seriously and treated it like something more than just an action movie to make money. \n\nObviously, not everyone has to make movies to make some statement art piece or whatever but it would be nice to see a superhero movie taken seriously or at least for these recycled movies not to be so highly rated. It's just something that bothers me. Not that I can really fix it but, oh well. That's just my opinion. A Little bit of a rant. ",
        "created_utc": 1526175576,
        "upvote_ratio": ""
    },
    {
        "title": "Complete list of French new wave relevant films?",
        "author": "lucak_desu",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8izugw/complete_list_of_french_new_wave_relevant_films/",
        "text": "[removed]",
        "created_utc": 1526167866,
        "upvote_ratio": ""
    },
    {
        "title": "One of the most important youtube \"movie reviews\". Really tackles the issue of the majority of them.",
        "author": "[deleted]",
        "url": "https://youtu.be/UhSJp34wOeo",
        "text": "[deleted]",
        "created_utc": 1526160380,
        "upvote_ratio": ""
    },
    {
        "title": "Raazi(2018)",
        "author": "sagar7854",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8iy1dr/raazi2018/",
        "text": "**Minor spoilers**\n\nWe often laud our soldiers who have died trying to protect our Nation from enemies.Poems and songs are written.Laurels are given.Deservedly so.However,what about the people who are unnamed(and will probably remain so),but still served a pivotal role in protecting the Nation..and maybe even died doing so? 'Raazi' tells the story of one such character,\n\nAmong other things,the central purpose of 'Raazi' is to outline the sacrifices spies make.As one character complaints in a rather vicious manner,\"Na rishton ki qadar hai..Na jaan ki\"(you neither care for relationships nor life) The Nation comes first for these people.So much so,that even some personal relationships need to be sacrificed(atleast in this movie's case) \n\nIt is very,very rare to find an Indian movie that doesn't callously demean the 'enemy'.Usually,the audience is just supposed to hate the other side.Our side is always the best and the people involved think the same.Manipulative music,spoon-feeding the audience,cliched dialogues and extremely one-sided narrations usually plague Bollywood's attempts at patriotic movies.'Raazi' steers clear of all these issues.On the contrary,this movie demands an attentive viewing.The viewer is expected to remember certain details.The movie is buoyed by a taut screenplay and a brilliant central performance.Interestingly,this movie respects the patriotism on both sides.Neither side is made out to be a villain or a Hero.All characters are trying to do what's best for their country(ies)\n\n\nI am delighted that such a movie has come out of India.There are some minor plot holes,but they don't affect the movie in any important way.Kudos to Meghna Gulzar for trusting the audience with such a screenplay and Kudos for bringing such a story to the public.\n\nP.S.: There is something for Breaking Bad fans here too.I also got Homeland vibes from some scenes.",
        "created_utc": 1526150744,
        "upvote_ratio": ""
    },
    {
        "title": "Raazi(2018)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ixpop/raazi2018/",
        "text": "[deleted]",
        "created_utc": 1526147795,
        "upvote_ratio": ""
    },
    {
        "title": "The Escape (2017) (post-discussion) review",
        "author": "CRISPR",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ivlc3/the_escape_2017_postdiscussion_review/",
        "text": "Warning: if you did not watch it and planning to, did not read this.\n\n**The Escape** (director: Dominic Savage) is a drama about a housewife (Gemma Arterton) in a modern urban British family (middle class or upper middle class). She is married to a confident masculine charismatic and busy husband (Dominic Cooper) whose confidence indicates to him being a small business owner, but rather squalid conditions points to a middle class job for hire. \n\nConfronted by mundane everyday duties of a mother and a wife, she snaps and \"escapes\" to Paris, where she has a one night stand with a local aging _bon vivant_ (Jalil Lespert).  In the morning she feels regret and guilt, wonders helplessly around busy streets of Paris only to be picked up by a stranger, a wise charming wealthy lady (Marthe Keller). They are having a conversation about choices and self-realization in the morning. Subsequently, the housewife meets her husband in Paris (it is not clear if this is a dream or reality) and they embrace. The movie ends with her wondering alone at an undisclosed location, looking content with her life, listening to the voices of children playing in the park (it is not clear if these are her children or unrelated kids)\n\nIt is worth noting that Ms. Arterton apparently already tried portraying a bourgeois housewife in Gemma Bovery, a rather tepidly received comedic post-modernistic take on French canon-lit (now that I wrote this, I remembered that I saw it and enjoyed it very much)\n\nCinematographic style chosen by Mr. Savage in this movie is abundant with close-ups of main characters and trivial surroundings of their house: LEGO toys spread entropically on the floor by energetic children and their (parents, not children) sexual routine (as ever, absolutely unnecessarily represented in too many details). Narration is straightforward, linear. Both main actors are a good cast and do their job adequately, conveying engaging and realistic drama of their characters. Ms. Keller is an excellent choice, while I can't really say much about the performance of Mr. Lespert. \n\nOne of the subjects that one can't avoid while discussing family drama is the subject of freedom and obligations. Marriage as an institute is sexual, social and often economic restriction on partners and drama in such circumstances is inevitable. \n\nFrom the other hand one has to realize the importance of social class to which the protagonists belong both in this movie and Flaubert's famous novel. Numerous attempts have been made in the past to transfer this archetypal plot to a lower class setting and they ended up shifting dramatically towards the obligations part of the drama, obligations morally winning, of course.\n\nIn a bourgeois setting, obligations are voluntary and there is always a workaround. The rich can hire people to replace many of the motherly duties and attract a number of willing candidates for sexual satisfaction. That's why it boils down mainly to the analysis of the liberty of the action of breaking from the routine of married life in pursuit of \"something else\". \n\nIn this regard authors mostly focus on pursuit itself, the importance of it, on the point left in the past (\"normal\" marriage) rather the point of arrival. It is clear that there is nowhere to arrive. \n\nAnother aspect is focus on the family. Normal families have more interesting lives. They have a lot of friends, they socialize a lot. That's what my Jewish friends do, for example. That's what other Mediterranean cultures do. None of this is happening to this family. The husband is obviously enjoying his life, being endowed with looks, charisma, energy and male optimism. His work is engaging, important, fulfilling. The wife has none of it and the result of this seemed very predictable. That glaring and obvious observation undermines significantly the zing of the movie and makes the whole drama less engaging. \n\nIt looks like she could have left to Paris with her friends (like Mrs. Soprano did) with the amicable consent from her husband without all the drama and have a nice break. It looks like they could afford it and social mores of Western world allow it. At the risk of resembling the padishah who was amused by the hunger among his subjects and was wondering why they simply did not eat pilaf, I am asking \"why didn't she?\" What was preventing her? Her own internal self-restrictions? Was the family not wealthy enough? No friends (seriously, where are \"friends\"?)? The movie does not give answers to this and many other questions, which is not a bad thing.\n\nGoing back to the style, the close-ups really work. Ms Arterton has that insane empty look in her eyes, a thousand yards stare that reminded me of Isabelle Huppert; the look of ultimate dehumanizing disconnect. \n\n(unfortunately, I have to leave this review half-baked, maybe I will continue in the comments, if I have time)\n\n ",
        "created_utc": 1526126527,
        "upvote_ratio": ""
    },
    {
        "title": "New French Extremity,Greek Weird Wave and Nuevo Cine Mexicano.",
        "author": "LiftedDemon",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8itefh/new_french_extremitygreek_weird_wave_and_nuevo/",
        "text": " This post's objective is more about trying to discover new things about these three movements that I'm trying to explore more these past times. The one I'm more used to consume and hear about\\(maybe cause it's the most famous one\\) is the New French Extremity,which I have seen many movies already\\(Martyrs,In My Skin,Inside,Irréversible,etc\\) but still have some other \"classics\" to look at,like Frontier\\(s\\) for example.The Greek Weird Wave is a movement I've been very interested at but have seen absolutely nothing other than some reviews. I have seen very few of Nuevo Cine Mexicano,maybe cause it's the most recent one. Do u guys have something to say about these three topics,or maybe some films to recommend?",
        "created_utc": 1526094747,
        "upvote_ratio": ""
    },
    {
        "title": "A Vesak Story (2018) **Give your insights on this little masterpiece**",
        "author": "[deleted]",
        "url": "https://youtu.be/s-OADdpZHMo",
        "text": "[deleted]",
        "created_utc": 1526078861,
        "upvote_ratio": ""
    },
    {
        "title": "What are the BEST queer films?",
        "author": "AlejandroJodorowsky",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8iou28/what_are_the_best_queer_films/",
        "text": "[removed]",
        "created_utc": 1526054118,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (May 11, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8io2gq/casual_discussion_thread_may_11_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1526048085,
        "upvote_ratio": ""
    },
    {
        "title": "Spoiler, Thanos as a victim, Human predicament in the avengers :infinity war",
        "author": "Elinorabrook",
        "url": "https://elinorabrook.wordpress.com/2018/04/30/thanos-as-a-victim-human-predicament-in-avengers-infinity-war/",
        "text": "",
        "created_utc": 1526046607,
        "upvote_ratio": ""
    },
    {
        "title": "Quandary (2018) - The Film",
        "author": "mangochiller",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8imp5u/quandary_2018_the_film/",
        "text": "[removed]",
        "created_utc": 1526034626,
        "upvote_ratio": ""
    },
    {
        "title": "Do other film cultures have variations of the American movie \"speech\"? (That is when Patton, Matthew Mcconaughey or any coach, Aragorn, etc addresses the \"troops\" with a rousing speech)",
        "author": "braininabox",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ilkes/do_other_film_cultures_have_variations_of_the/",
        "text": "Is this more of an American concept that one individual gives a rousing speech that everyone listens to and is motivated by?\n\n\nBill Pullman in Independence Day.\n\nWe Are Marshall.\n\n\"Today is not that day!!\"\n\nBlue faced Mel Gibson: \"Who are you without freedom?\"\n\nThis is the kind of American feeling I feel is parodized and sensualized in the Wolf of Wall Street, when Leo capitalizes on his employees need for rousing speeches, and delivers a doozy of a peptalk to the groundfloor employees- then bringing in strippers and confetti and marching bands to top it off.\n\nWe love these inspirational speeches so much, we even made a movie about a British one and gave it a Best Picture Oscar.\n\nBut do European, Asian, and other film cultures have a similar story element?  Examples, comparisons, contrasts, etc would be welcome!\n",
        "created_utc": 1526018720,
        "upvote_ratio": ""
    }
]