[
    {
        "title": "A conversation about god, polio and the best of all worlds",
        "author": "semaj912",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4bvytl/a_conversation_about_god_polio_and_the_best_of/",
        "text": "Hi r/TrueAtheism, long time lurker first time poster here.\nI'm recently joined a discussion with someone from r/debateachristian about how god can allow terrible diseases to exist while doing nothing. \n\nI'm currently in a conversation with a christian about polio and the best of all possible worlds. My contention is that we have all but eradicated polio and thus improved the state of our own world, making it better than the one first created by god. I have argued that god could have stepped in at any point in our history and eradicated polio but did not, thus meaning he either did not or could not do so. \n\nThe rebuttal is that we have no way of knowing what our world would look like if polio never existed or if god had stepped in and removed it and so cannot make this claim (they draw the distinction between comparing world history and world states to make this rebuttal), the world may have been much worse. Furthermore the world we are living in must be the best possible world because god is by definition perfect and therefore can only create the best possible world for us.\n\nI hope I haven't mischaracterised their argument, if you want to check you can dig it up [here](https://www.reddit.com/r/DebateAChristian/comments/495lny/when_babies_are_dying_painful_deaths_in_the_er_a/d0qhbth) but it's pretty long by this point \n\nAnyway I'm getting pretty fatigued by the conversation now so was just wondering if you had any input, how should I approach dismantling their argument? Am I actually in the wrong here? I'd appreciate any input I can get.\nThanks",
        "created_utc": 1458902514,
        "upvote_ratio": ""
    },
    {
        "title": "Help me with rebuttals to this conversation...",
        "author": "justcurious1234567",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4brlrd/help_me_with_rebuttals_to_this_conversation/",
        "text": "The other day at work, 2 colleagues and I got into a discussion about free will, choice and Gods plan. My stance is that the idea of a Devine plan spits in the idea of free will. Basically the conversation went as such..\nMe- If God is all knowing.. Therefore he knows everything that could ever happen and ever will happen. He knows the exact life choices I will make to the very end, including those that will send me to hell.\n\nCoworkers- God doesn't care about that. He doesn't care about your choices. That's on you, you can't put that on him!\n\nMe- I'm not putting anything on him. I'm just saying that with the paradigm that he knows everything, he knows every little thing I will do and every choice I ever will make before I'm even born. He knows before I'm born that I will go to hell. So essentially, I was created by God to just go to hell. If you take everything out in between then it is just birth, then hell.\n\nCoworkers- It all come down to faith. You have to have faith in what God wants for you. God wants everyone in heaven and he doesn't care about the choices you make in between. Those choice are yours. \n\nMe- yes, and that's all well and good but if he knows everything then he knows I will make those choices even before I do.\n\n\nIt was if they were dancing around the logic and it struck me as odd that they couldn't understand the point I was making or were just choosing to ignore it. Anyways, if any one here has a better way to present to idea that would be awesome to hear.",
        "created_utc": 1458827208,
        "upvote_ratio": ""
    },
    {
        "title": "How can I resist the urge to seek out religion?",
        "author": "Novantico",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4bmcqu/how_can_i_resist_the_urge_to_seek_out_religion/",
        "text": "**EDIT** So I've received a good amount of input from people, most of which was at the very least food for thought, and as good as outright helpful. I'm thankful for it all. As I noted at the bottom, I cross-posted this. I'd like to share some interesting bits about it before I go on and list out some of the things that have been suggested to me (through both subreddits)\n\n/r/TrueAtheism's thread has 54 comments total, and the post itself has 23 upvotes.\n/r/Atheism's thread has 26 comments total, and the post itself has 0 upvotes.\n\nI'll leave it to all of you to make conclusions about that.\n\n**Now, here are some of the suggestions I've received that I've added to a list of things to check out:**\n(in no particular order)\n\n1. Tao Te Ching\n2. Existentialist Philosophy, specifically people like Camus and Sartre\n3. Unitarian Universalism (suggested/mentioned by several of you)\n4. Quakerism (one or two of you)\n5. Buddhism/go to Buddhist temple (a few of you)\n6. Atheistic Paganism\n7. Meditation (a few of you)\n\nSo once again, I'd like to thank everyone for your comments, reassurances, explanations and the like. I'm not abandoning the thread, so if there's more comments to come, I welcome them ;)\n\n----------------------------------------\nHi there. \n\nI've considered myself an atheist since I was about 15 years old. A Weak Atheist, if I want to be more specific (not sure, but err on the side of no god(s)).\n\nSomewhere between occasionally and regularly I deal with depression, and sometimes anxiety. When I'm on a long term downswing, as I've been since like September, I sort of fall back on stupid old feelings. I start wanting to seek out religion in some fashion, but I don't just hop on board. I'll try to avoid looking into the main religions of common Christian denominations and whatnot, but I'll gravitate towards reading about things like Buddhism and Deism. I know how I usually feel about it, and so I try to fight it, and I try to satiate the urge by just doing research, reading debates, etc. I've also picked up watching the Atheist Experience (which is great, btw) to sort of \"reverse brainwash\" myself, to stay the fuck away from it.\n\nYet even still, I get these feelings/urge to move towards religion, probably because of that feeling of comfort and community that can come from being a part of something like that. The way people can be so much kinder to you when you're sharing an experience like it is astounding. It's bullshit, but it's great. Like, when my parents will still churchgoers (they're still a bit religious - hypocritically so like most Catholics, but they are), we went through a rough patch where we were broke as shit due to my dad becoming unemployed. The goddamn mayor of the town himself dropped of a bundle of food that was gathered by the church to help our family. The gesture was undeniably kind, despite and underlying religious motivator. And it helped us.\n\nThat's the kind of thing I guess I miss. I don't know how to find it elsewhere, and I don't know what to do about it. \n\n**TL;DR:** Wanting to fall back on old feelings of comfort, community, pseudo-solace, and don't know how to seek it elsewhere or resist it well and seeking advice and thoughts on it.\n\n*I'm going to post this on both /r/TrueAtheism and the main /r/Atheism subreddit for as much input as I can receive. Hopefully this isn't breaking some kind of rule.*",
        "created_utc": 1458738052,
        "upvote_ratio": ""
    },
    {
        "title": "Scholarly papers on the lack of evidence for God",
        "author": "igottaquestionhelpme",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4bj9j8/scholarly_papers_on_the_lack_of_evidence_for_god/",
        "text": "I'm working on a paper on whether there is enough evidence for people to believe in the existence of God or not.  Can any of you point me to some scholarly journal articles that would defend the assertion that there is not enough evidence for God's existence?  ",
        "created_utc": 1458678900,
        "upvote_ratio": ""
    },
    {
        "title": "Family is Catholic, doesn't know that I'm atheist and I plan on getting married in a non-Catholic wedding.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4bf1i6/family_is_catholic_doesnt_know_that_im_atheist/",
        "text": "[deleted]",
        "created_utc": 1458604999,
        "upvote_ratio": ""
    },
    {
        "title": "Is here avail high purity",
        "author": "summergoatpills",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4bcl0w/is_here_avail_high_purity/",
        "text": "[removed]",
        "created_utc": 1458572246,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist's moral foundation?",
        "author": "Ghandi255",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4bbj9r/atheists_moral_foundation/",
        "text": "Hello TrueAtheism!\n\nSo, I am a theist, born and raised and still am. But ever since hearing Steve Harvey's \"Where is your moral barometer?\" Quote this question has nagged at me.\n\nWhere does an atheist derive their morals, ethics, and principles from?\n\nI don't agree with the notion that atheists can't be moral, I have atheist friends that are upstanding, good, altruistic people. Infact their kindness is greater than a lot of theists I know. But I do have some questions, and Reddit seemed like a good platform for the questions.\n\n  1.Are morals based on an individual's thoughts, or are they chosen democratically?\n\n  2.If democratically, are they chosen by a small group of philosophers? Or the general public?\n\n  3.Are morals based on the general norms of the society and culture? Or what happens to be most logical to the person/populace?\n\n  4.As evolved creatures with superior intelligence, is it our duty to create principles with which to live by?\n\n  5.If it helps someone get ahead, such as cheating on a test, or lying at work, what makes it wrong?\n\n  6.As an atheist, where do your personal morals derive from?\n\nThis is in no way meant to be inflammatory, I am just trying to get a different perspective on something that I find is very ambiguous to me. \n\nIf you have any questions for me, I'd be more than happy to answer them. Thanks!\n\n\n\nEDIT: I'd like to thank all of you for your insightful comments, they've given me a lot to think about.\n\nMy personal definition of morals would be \"a set of rules an individual lives by that dictate behavior.\" Religion establishes quite a bit of rules for someone to live by. If the definition of morals is different than mine, than in retrospect my title should've been \"where do you get your *rules* from?\"\n\nI don't believe being religious makes you a good person. A nice atheist is much better than a mean theist.\n\nIf you all must know I'm LDS, yes, one of *those* people, crazy as a dingbat. I like to believe my religion has a lot more rules, a lot more doctrine on morality and it establishes more principles on which to rely on.\n\nI avoided stating my religion because of the negative stigma it holds, but I imagine for a discussion like this it needs to be said.\n\nAlso, I apologize for asking a question that has been asked a lot. I used the search function (my first mistake) and couldn't find anything. I didn't go to /r/debateanatheist because I didn't want to pointlessly argue, or even rationally debate. My question was in the pursuit of knowledge, and was meant for me to learn. I was looking for an answer, and not strictly discussion.\n\n\n\n\n##I would once again like to thank everyone for your civility. Beliefs of any kind are a touchy subject, and it makes me immensely happy to see that I can still have a good discussion with people, even if we don't agree on everything. ",
        "created_utc": 1458550263,
        "upvote_ratio": ""
    },
    {
        "title": "Speaking with God",
        "author": "xcmiles",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4baibb/speaking_with_god/",
        "text": "Several people I know claim that they have personally spoke to god in the audible fashion and that is how they know he is real. This has usually been brought up in response to my arguments against god along with some more fantastical claims such as family members saying they have witnessed a person floating while aiding in an exorcism. I was wondering how you guys usually respond to claims that people speak with God.",
        "created_utc": 1458527118,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Literature: Coming from a Christian",
        "author": "KALBandtheBuffalo",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b7ui7/question_about_literature_coming_from_a_christian/",
        "text": "Hello r/TrueAtheism! I would like to preface my question by stating I am a Christian. I am a frequent visitor of this sub and greatly appreciate/enjoy reading all that you offer. My question: \n\nWhat authors/books would you recommend to a practicing Christian? I am looking for a profound argument against the Christian religion. Hit me with all the literature you can think of. \n\nSadly I have dug myself into a sort of 'hole,' reading primarily books advocating the Christian faith. Understand I am not struggling with faith, I only wish to understand the atheist's point of view better than I do, currently. I would be happy answering any questions you have about why I am doing this. Especially if the question I posed is unclear. Thank you!",
        "created_utc": 1458486184,
        "upvote_ratio": ""
    },
    {
        "title": "As atheists, what is your source of peace and hope?",
        "author": "blackashe",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b7aap/as_atheists_what_is_your_source_of_peace_and_hope/",
        "text": "[removed]",
        "created_utc": 1458476290,
        "upvote_ratio": ""
    },
    {
        "title": "Presuppositionalist theists favourite question is \"Could you be wrong about everything you know?\". I think I've got a great answer to this approach.",
        "author": "markyf",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b79kg/presuppositionalist_theists_favourite_question_is/",
        "text": "They think you're caught on the horns of a dilemma now. If you answer 'yes' then they claim you've no right to question them as you have no knowledge at all. If you say 'no', then you are making a claim to knowledge and they think they have successfully shifted the burden of proof.\n\nWhat I do is answer 'no' and my evidence is that I know I am not their God. If they accept that answer, then I have proved that I have at least one piece of certain knowledge. If they do not accept that answer , then they are saying that I could be wrong and that I might be their God. This means they cannot claim infallible revelation from their God, as it might be me and I'm not certain about my answers, so their God is not all knowing. \n\nSince presupps are really out to proselytize and not debate, they usually just go away in a hissy fit at this point. ",
        "created_utc": 1458475763,
        "upvote_ratio": ""
    },
    {
        "title": "How would you respond to \"you can't judge God by human standards\"?",
        "author": "charliebeanz",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b6ify/how_would_you_respond_to_you_cant_judge_god_by/",
        "text": "Would you say that you can't judge him by his own standards since you don't know what they are? Or would you say you'd judge him by the standards that he uses to judge humans as per the Bible? Or would you say that you can only judge him by human standards since that's what you are? \n\nHow would you answer this sentence if you were speaking to a Christian friend or family member?",
        "created_utc": 1458451383,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any bible prophecies that are utterly wrong?",
        "author": "nandoschickenwings93",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b639q/are_there_any_bible_prophecies_that_are_utterly/",
        "text": "Hi, agnost here, I asked a question in christianity about who created god. The answers they gave were that he's outside of time, and also stemming from that therefore he knows the future. So basically I was thinking that if he knows the future and put that future that he apparently knows in the bible, and the bible got it wrong, then wouldn't that disprove the bible? So are there any prophecies that are just plain wrong, backed up with evidence ofcourse. I'm asking here because I heard about this sub from some poster there that said it was better than /atheism.",
        "created_utc": 1458443067,
        "upvote_ratio": ""
    },
    {
        "title": "Logical Premise of Non-Heterosexuality",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b4wa0/logical_premise_of_nonheterosexuality/",
        "text": "[deleted]",
        "created_utc": 1458423401,
        "upvote_ratio": ""
    },
    {
        "title": "Taking on the \"Objective Standard\"",
        "author": "bjlmag",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b44i6/taking_on_the_objective_standard/",
        "text": "The \"objective standard\" is one of the most famous cop-outs that theists use to end discussion when they can't defend whatever original points they were trying to make. It's been brought up endlessly on the various debate subs and I'd like to discuss here some better ways to take it on in the instances when one is generous enough to engage. \n\nFirst, I'd recommend *against* offering up scenarios like \"If God is moral, why did he do (this obviously wicked thing)?\" because any specific question about God's (obvious to us) wickedness will simply get replies based on blatant special pleading. Theists go through all kinds of acrobatics to justify the cruel actions of God, and no matter how wicked it may seem, any action carried out by him will be justified in their eyes because \"God brought you into this world; He can take you out\". It really is that simple to them. I sympathize as an ex-Christian because it's hard to see how horribly broken that thinking is when you've been raised with it, which is why we have to be careful bringing it up. From our perspective, asking them questions about morality like that are basically just baiting so we can stomp their special pleading into the dust for fun, but it isn't actually very helpful to someone infected with the \"faith virus\". \n\nThere are much better ways to confront the \"objective standard\". Primarily, simply ask them to demonstrate it. This will often be met with silence or some astonishing dance moves that attempt to steer the discussion away from answering the question. u/HermesTheMessenger made a great point about this with [this comment] (https://www.reddit.com/r/atheism/comments/49cb5v/two_christians_argue_child_slavery_is_moral/d0qpuzc) in a different thread. The very nature of the \"objective\" vs. \"subjective\" standard, in the theist's mind, is a false dichotomy between what is essentially \"morality\" vs. \"animals slaughtering each other\". \n\nI've encountered this point in many discussions. Theists that don't understand actual ideas around secular morality assume that any idea of morality without their individual interpretation of God is the bare-bones version of dog-eat-dog morality based on nothing other than sheer animal instinct and procreation. Clearly this isn't correct because we're self-aware, social creatures, but we have to confront it. Fortunately, this becomes easy when we use their logic against them. If we strip all forms of thinking and society away, of course we're reduced to pure animal instinct and procreation. The thing that many theists don't think about, though, is the fact that this exact thinking applies just as soundly to them as well. Stripping away all thinking and social abilities would strip away religion just as much as anything else, leaving anyone arguing any point on the same level. From here, it is difficult to continue to justify any morality at all, so this argument reduces both sides to absurdity just as effectively. \n\nRemember that the theist has the burden of proof. The person claiming to understand the \"objective standard\" has the task of demonstrating the standard, how it applies to us non-subjectively, and showing us how we can interpret it. Since every single religious person in the world has their own individual interpretation of this \"objective standard\", this is usually where the topic changes or the discussion simply ends. \n\nWhat other methods have you used to tackle the claims of \"objective standards\"? Please critique my post as well; it can only improve the discussion for the future. ",
        "created_utc": 1458411355,
        "upvote_ratio": ""
    },
    {
        "title": "Need Some Advice On Religious &amp; Superstitious People",
        "author": "Darth_Sin",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b35cx/need_some_advice_on_religious_superstitious_people/",
        "text": "Greetings. I have been having this issue that I would like some advice on. \n\nSee, there's this thing that I do where I tend to not take religious people very seriously. Its like there's something that makes me go \"That person believes in superstitious bullshit. Ha ha ha.\" in my head and I don't take religious people, even religious liberals, very seriously. \n\nEver since I became an atheist six years ago, I have seen religion as a form of superstitious nonsense. I see it in the same way I see feng shui, astrology, tarot cards, etc. The thing is, I tend to see people who believe in astrology or numerology or feng shui or creationists as comical and I end up making fun of them, either in my mind or out loud. As a result, I tend to not take them seriously.\n\nThe issue here is that there are many religious people, especially religious liberals and even feng shui and tarot card believers who are very nice and kind people. So I sometimes feel bad for viewing them as comical and I try to respect them. But then I start thinking to myself \"Why do I need to respect something that merits no respect such as superstitious nonsense ?\"\n\nNow my mind is in a mess trying to figure this out. I see the religious and the superstitious as comedic jokes but then I feel bad for thinking that way because some of them are nice and kind. So I try to respect them for their beliefs but those beliefs don't merit any respect to begin with. \n\nAny help on this matter would be greatly appreciated. ",
        "created_utc": 1458395427,
        "upvote_ratio": ""
    },
    {
        "title": "Struggling to deal with father's death and Catholic family",
        "author": "puritycontrol",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b211p/struggling_to_deal_with_fathers_death_and/",
        "text": "My dad died four months ago, and it's been pretty difficult. I got married not even three weeks before he died, and started a new and demanding job exactly one month before he passed. My husband and I finished buying our first condo in December (that almost fell through and I found out while I was sitting at the hospital with my father's body), and I had an almost total hysterectomy in January (2 weeks before dad's birthday). Needless to say, I have been through a lot of challenging adult-y ordeals all in a few months. On top of it, I live far away from my family, so none of them live where I do. And for what it's worth, I just recently started attending a grief group for people around my age, all of whom are dealing with loss, but it meets only once a month. I've been holding it together pretty well, outwardly, but every day inside my head is very hard.\n\nMy family is extremely Catholic. My dad, while he was very religious, would still get into conversations with me and while I know he wished I was still Catholic, he didn't give me a hard time. One poignant moment was a couple of years ago, he and I were driving in the southwest of the US on a little road trip, and he got very emotional and asked me what I thought happens when we die, because I think he was very worried for my mortal soul (or perhaps struggling with his own faith? He wasn't born a Catholic but converted to marry my mom). I said I didn't know, but what was important is that we lived our lives well and did things that made us happy.\n\nIt was very hard to get through the Catholic rituals for his death. He requested that I would do a decade of the rosary in Japanese (I studied it in college but forgot a lot, so luckily I had Google), which I obliged. He also requested that I play \"Ave Maria\" on the piano (his instrument, too. I also played it at my maternal grandfather's funeral, which is where I know my dad got the idea). I couldn't do the piano because that was too hard emotionally, but I did do the eulogy. I was very proud of it. I made people laugh, I made them cry. I had people ask me for a copy of it. And in it, I shared that I wasn't religious, but my dad was, and his faith was so important to him. I shared the story about our drive and what he said to me. It was well received, and even my mom only made the tiniest passive-aggressive comment about wishing that I hadn't said I'm not religious in front of 400+ people. \n\nBut it's been hard. So, so hard. My family has their faith to rely on and I don't. I get messages from people telling me they're praying for me. My mom and sister make comments about dad being up in heaven, being free of pain and hanging out with our other dead family members. I wouldn't say that I'm a hardcore, dyed-in-the-wool atheist, because I am open to the idea that there could be something more that I don't yet know or understand, but it's certainly not enough for me to develop a dogma and ritual over. And, it's hard for me to logically accept what I was taught for so many years through religious education. \n\nYet, in spite of this, I am seeking. I am vainly trying to find some sort of confirmation, some sort of answer, something that tells me that when I held my dad's hand as he died and looked him right in the eyes as his heart stopped beating that that wasn't the last time I'd ever see him. I want to believe that, so bad. Any sort of thing out of the ordinary, I am vainly interpreting as a message from beyond. My three-year-old niece's bedroom door would be discovered open in the morning by my sister, starting from the night after she sang \"Twinkle, Twinkle, Little Star\" over the phone to him. My dad's best friend received a real-time \"Share My Location\" request from my dad after he died, from the border of Canada 2400 miles away. The thermostat in my mom's house fluctuates, just as she told my dad to do as a way to communicate with her from beyond. All of these silly little coincidences that have probable logical reasons behind him, but still, I seek them.\n\nI guess I am just seeking some advice and support from people in a similar situation. Some words of wisdom to help get through this. I would be really grateful to get some insight from those who have been through this before, as I hope you can tell me something or share with me an idea that I have not yet considered.",
        "created_utc": 1458366697,
        "upvote_ratio": ""
    },
    {
        "title": "With the coming of \"holy\" week upon us...",
        "author": "sillybob86",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b1vkw/with_the_coming_of_holy_week_upon_us/",
        "text": "If that dont get your attention I dont know what will!!! :)\n\nI have been decidedly, unashamedly atheist agnostic for a year now, Easter is my one year anniversary of freedom so to speak.. I realize the temptation to possibly equate my question with this time/anniversary but this has been a recurring thing.\n\nI honestly find myself having some inexplicable, inward drive to go back to mass. Go back to the rosary, go back.... At times it all just feels so much apart of me that I at times want to run off to a monastery and live a contemplative life.. funny noggin i know.\n\nIm not under any sort of real duress or anything. I am confident in my education and career path, but the desire at times seems stronger than simply wanting to go to a restaurant that i have not been to in months, or listen to a song that i have not heard in years.\n\nIt just seems sort of weird. If i had just left, I would of equated this to \"learning to do without, separation pains\" things that i would expect to get weaker and dissipate with time.  However this doesn't seem to yet?\n\nIm just wondering what your experiences have been, thoughts, ideas are.\n\nFor what its worth, for the time I was religious I dont recollect that any so called \"prayers\" were ever answered.",
        "created_utc": 1458363295,
        "upvote_ratio": ""
    },
    {
        "title": "Weighing God, a logical look into atheism, agnosticism and theism.",
        "author": "devi83",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4b06as/weighing_god_a_logical_look_into_atheism/",
        "text": "[Weighing God](http://imgur.com/5NYiCxO)    \nThis is my personal opinion on the logic behind atheism, agnostic, and theism mindsets. I have attempted to use the [Philosophy of Logic](https://en.wikipedia.org/wiki/Philosophy_of_logic) to carefully consider these ideals, and explained how they may or may not fall into logical fallacy.\nBefore commenting or downvoting this post please consider what the sidebar says: *A subreddit dedicated to insightful articles and thoughtful, balanced discussion about everything to do with atheism, theism, deism and religion.\nPlease read entire posts before voting or commenting, follow reddiquette, and leave a comment for reasoning behind a downvote.*\n\n--------------------------------\nI am going to use\n[stipulative definitions. This is definitions used for the purpose of making the argument](https://en.wikipedia.org/wiki/Stipulative_definition) (thank you /u/IrkedAtheist and TrottingTortoise for the help) for the following three terms: Atheist, agnostic, theist. I know (now) that these are not the dictionary definition of them, but for my post, and the logic that follows, these are the definitions I am using. If you don't like that just replace the words atheist/agnostic/theist  with black/grey/white for the rest of the post.\n     \n**Atheist** - Does not believe in any god      \n**Agnostic** - undecided      \n**Theist** - believes in at least one god      \n\nWhen deciding what to believe one generally uses logic. I shouldn't flip a coin to decide if I will believe in god (should I?), no, I reason out all the evidence I have gathered in my mind, or through intelligent conversation and debate with others. When using logic, one should be aware of logical fallacies, errors in reasoning that will undermine the logic of your argument.      \n\nThe atheist is 100% certain that God does not exist (else you are agnostic). How can someone be 100% certain of something? They must have all the available information at hand. You cannot be 100% certain with only partial evidence. It has to be unanimous to be 100%. So for someone to claim atheism they must be claiming they are omniscient (all-knowing), else they are not unanimous, not 100% certain. That is the logical claim of being an atheist. Well if an atheist has 100% of the knowledge there is, why do we continually make new discoveries and innovations? Should we instead simply ask our local friendly atheist to divulge the omniscient information they are privy to whenever we want to know something. Are atheist omniscient? I cannot answer that question because I myself am neither atheist nor omniscient.\n      \nHere is a logical fallacy that atheism and theism mindsets commonly fall into:       \n\n* *[Argumentum ex Silentio](http://utminers.utep.edu/omwilliamson/ENGL1311/fallacies.htm)* (Argument from Silence). The fallacy that if available sources remain silent or current knowledge and evidence can prove nothing about a given subject or question this fact in itself proves something about the truth of the matter. E.g., \"Science can tell us nothing about God. That proves God doesn't exist.\" Or \"Science admits it can tell us nothing about God, so you can't deny that God exists!\" Often misused in the American justice system, where, contrary to the 5th Amendment,  remaining silent or \"taking the Fifth\" is often falsely portrayed as proof of guilt. E.g., \"Mr. Hixel has no alibi for the evening of January 15th. This proves that he was in fact in room 331 at the Smuggler's Inn, murdering his wife with a hatchet!\" In today's America, choosing to remain silent in the face of a police officer's questions can make one guilty enough to be arrested or even shot.      \n\n*I am going to make one big assumption for the rest of this in regards to God: In order to be considered a god, one must be all-powerful.*\n \nIf a god exist and chooses to remain silent, this god still exist. It is Argumentum ex Silentio to argue that because we have not found evidence of any god, that no god exist.\nKnowing that, one could argue that theist also falls under the Argumentum ex Silentio logical fallacy and that agnosticism is the correct logical conclusion. This would be true, except the universe has weighed this scale in favor of theism:    \n  \nIf God does not exist, there can be no way we can prove it, short of having acquired all knowledge in the universe. Even then, an all-powerful god by definition would still be able to remain out of sight if it willed itself to, else it would not be all-powerful. So logically there are no grounds by which one can claim atheism without the Argumentum ex Silentio fallacy. i.e. there will always be a reasonable argument against that mindset.       \n\nIf God does exist, then by definition **an all-powerful god can give knowing of the truth to individuals and groups of people**. No one can know that god doesn't exist if there is no god*, but someone can know if god exists if god does indeed exist, and this god wills it so. **According to logic and reason.*       \n\nSo it seems the scale is tipped in favor of theism however slightly. This weight alone is telling. Not evidence yet, but certainly it says something about the nature of the universe, the universe that developed the very logic we use in philosophy. It is saying that the idea of God existing is heavier than the idea no god existing. But for now, if you are not one of those privileged by God to know, then agnosticism is a good logical grounds to stand upon. There is no logically sound ground for atheism. Theism has sound ground, if you are privileged by God to know the truth, but you also have to be careful when you try to \"prove\" it to others. **God's revealed truth to you is not sufficient evidence for another person**, or for a jury, and shouldn't be argued as such.      \n\nNow another argument for atheist against the existence of a god is \"[The Problem of Evil](https://en.wikipedia.org/wiki/Problem_of_evil)\". Atheist arguing this say if there is an omnibenevolent god (all-good), then why does evil exist. This leads us to another logical fallacy, which is the:\n\n* *[Non Sequitur](http://utminers.utep.edu/omwilliamson/ENGL1311/fallacies.htm)*: The fallacy of offering reasons or conclusions that have no logical connection to the argument at hand (e.g. “The reason I flunked your course is because the government is printing purple five-dollar bills! Purple!”). (See also Red Herring.) **Occasionally involves the breathtaking arrogance of claiming to have special knowledge of why God, fate or the Universe is doing certain things.** E.g., \"This week's earthquake was obviously meant to punish those people for their great wickedness.\"      \n\nThe reason why the argument of evil is a Non Sequitur logical fallacy is because the atheist claims to have special knowledge that it should know why a god should or should not do something, that if it doesn't do it the way the atheist thinks is best, that it isn't really a god, or that a god cannot exist because something else that seems to contradict it exist.     \n\n**Summary/TLDR**: (in [Socratic method](https://en.wikipedia.org/wiki/Socratic_method) form)       \nIf you are atheist, are you all-knowing?     \nIs god a \"god of the gaps\" and hiding in the information you don't know?       \nIf you are theist, are you all knowing?        \nAre you using faith to believe in a god?         \nHow can one person know for a surety and claim for or against the existence of a god?\n\nClearly unless God exist and has given you special revelation, **agnosticism is the most logically sound claim**.",
        "created_utc": 1458334273,
        "upvote_ratio": ""
    },
    {
        "title": "Big question",
        "author": "TheSithMaster17",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4aznit/big_question/",
        "text": "So over the last year in the summer time, I have been looking for alot of answers. I don't just listen to one person and believe them. I like to find both sides of the argument to be safe and smart. I came across alot of people who claim to have left the church system because they claim Jesus showed them it's evil. They all have Seperate YouTube accounts and claim Jesus or the holy spirit speak to them through a voice. One says it's not their thoughts or a hallucination because there wife heard the same things. Another claims that after prayering for three days and doing nothing else he heard Jesus and Satan speak to him and now he has lost his drug addiction and hears Jesus speak to him about things everyday. He even has a wife and kids who have had the same experinces as him. They all claim to have been able to stop sinning and having prayers answered with an audible voice. One even stated he was given a parable one day. Another pwrson even losts messegs they receive from jesus everyday. I'm not like you guys who are all probably experts In this stuff and hopefully you can clear thing up. What are they hearing and what's the logical explanation for this thing? I find it hard to believe they are all crazy since two of them have testimonies that revolve around them watching another guy preach on YouTube and having convictions to pray. Hopefully you guys can help me come to a conclusion.",
        "created_utc": 1458326801,
        "upvote_ratio": ""
    },
    {
        "title": "What is the atheistic position on Spirituality and how that differs from religion",
        "author": "Suthr19",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ayi43/what_is_the_atheistic_position_on_spirituality/",
        "text": "As stated above, I would like a civil discussion on how atheists view spirituality; do you view it in the same manner as theism, deism, or pantheism? Meaning, do you consider it nonsensical superstition that has no evidence to back its claims? I myself am a secularist/anti theist, so I don't believe in forcing spirituality or anything of the sort on others. In summary, how is spirituality viewed by atheists?\n\nEdit; \nTo me, spirituality means an individual's quest for truth and understanding of the universe, our place in the universe, and how consciousness relates to the \"human experience\". A big inspiration of mine is Alan Watts, if that gives any perspective on my views.\nAre there any atheists that believe that transcendent experiences are possible? Whether it's possible through meditation, psychedelic drug usage (DMT, Psilocybin, shrooms), or OBE?\nI now find myself researching many topics that many skeptics consider bullshit (Astral Projection, chakras, sacred geometry, consciousness). It's all interesting, and I would like to hear the many individual voices of atheists to sort of get a picture for what the view is on these subjects. ",
        "created_utc": 1458311001,
        "upvote_ratio": ""
    },
    {
        "title": "Responses to \"Anachronistic\" argument?",
        "author": "bjlmag",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4aufoy/responses_to_anachronistic_argument/",
        "text": "In a discussion with someone about the validity of Biblical claims I brought up the view that much of the NT is self-contradictory, absurd, and not written by direct witnesses. I made the claim that it doesn't count as a valid historical account of actual events that really happened. The response was:\n\n&gt;You've applied (modern) criteria for historicity to non-modern documentation. So you're holding these documents to standards that they could never have achieved because they didn't exist when the document was written. This is called anachronism. In historical writing, the most common type of anachronism is the adoption of the political, social or cultural concerns and assumptions of one era to interpret or evaluate the events and actions of another. The anachronistic application of present-day perspectives to comment on the historical past is sometimes described as presentism. Empiricist historians, working in the traditions established by Leopold von Ranke in the 19th century, regard this as a great error, and a trap to be avoided.[16] Arthur Marwick has argued that \"a grasp of the fact that past societies are very different from our own, and ... very difficult to get to know\" is an essential and fundamental skill of the professional historian; and that \"anachronism is still one of the most obvious faults when the unqualified (those expert in other disciplines, perhaps) attempt to do history\".[17] Anachronism in academic writing is considered at best embarrassing, as in early-20th-century scholarship's use of Translatio imperii, first formulated in the 12th century, to interpret 10th-century literature. Genuine errors will usually be acknowledged in a subsequent erratum.\n\nThis seems broken but I'm having trouble finding a good way to word a response without just saying \"that's absurd\" to his replies. He's essentially claiming that we don't need modern criteria (like verifiable evidence or even congruency) because \"that's not how they did it back then...oral tradition is excellent\". Any help?\n\n",
        "created_utc": 1458239317,
        "upvote_ratio": ""
    },
    {
        "title": "The Logic Behind a Young Earth - Episode 3!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4auej9/the_logic_behind_a_young_earth_episode_3/",
        "text": "[deleted]",
        "created_utc": 1458238908,
        "upvote_ratio": ""
    },
    {
        "title": "What reasons in specific would the early churches and people who pushed for Christianity have had for doing so?",
        "author": "kooboiswag",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4attl3/what_reasons_in_specific_would_the_early_churches/",
        "text": "Basically I'm still on the fence on whether I believe in Christianity or not. The main block I've come to at this point is that I know so little about what went down back in the day during the origins of Christianity. A lot of Christians tell me that Jesus must have been resurrected, because what other reasons would they have to give their lives, unless they were insane, or just plain liars. But that is not convincing enough for me, because I could just see that the Christians really did believe, for whatever reason, and gave their lives for this belief. I think what I'm really hoping to understand is why this is not a sound argument and convincing to you guys? It sounds somewhat reasonable to me that maybe they really did witness something incredible, which lead them to make incredible changes in their lives, all the way to death. \n\nWould they have had other good reasons to push Christianity forward, besides it being real? Any reasons that would lead them to personal gain, if it was really just a hoax? I'm really sorry if this question is just all over the place, but I would really like a point in the right direction to certain sources I could look into or anything. I'm very lost. Thank you in advance!",
        "created_utc": 1458231181,
        "upvote_ratio": ""
    },
    {
        "title": "Ex-christians: Weird relationship with prayer",
        "author": "strfkrs",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4arbn6/exchristians_weird_relationship_with_prayer/",
        "text": "To those of us that used to believe in God:\n\nDo you ever catch yourself \"praying\"? I'll be the first to admit the only reason I didn't convert sooner than I did is because I was one of those Christians that was scared of going to Hell. I also really only \"prayed\" when I needed help with something, near the end at least. Up until recently I'd catch myself praying whenever I had a problem and I'd feel incredibly guilty and scold myself for choosing to only practice Christianity when I needed something. It's not that I believed during those times, it's more that I just thought if I prayed, on the OFF chance there was a God, he'd be listening and help.\n\nI realize that sounds incredibly stupid and it is, hence why I stopped believing before starting high school.\n\nAnyways, I remember praying being a really positive experience for me. It was my time of reflection, and my time to \"talk\" to someone. As silly as that sounds. Just simply thinking to myself doesn't have the same therapeutic effect. Can anyone else relate? Has anyone found a substitute that works for them?",
        "created_utc": 1458185720,
        "upvote_ratio": ""
    },
    {
        "title": "My GF wants me to stop believing in God or it's over.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4aocdk/my_gf_wants_me_to_stop_believing_in_god_or_its/",
        "text": "[deleted]",
        "created_utc": 1458142574,
        "upvote_ratio": ""
    },
    {
        "title": "How can even somewhat serious religious upbringing not be considered abusive?",
        "author": "TormundGianstbane",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4anvb1/how_can_even_somewhat_serious_religious/",
        "text": "So I've been trying to become less polarizing and angry sounding when talking religion in general, but this is one I cannot get my head around.\n\nMy family are all atheists, save for my aunt (by marriage) who's a fairly fundamentalist Christian. She's attempting to raise her children along the same way. My younger cousin, when over for Christmas dinner, responded to a comment about telling a lie with something along the lines of \"if you lie to people, you'll suffer eventually!\" (He's about 8). \n\nThis sparked a debate when I told him that it might not *literally* mean if you tell a lie you'll suffer in a pit of fire for eternity. My aunt chastised me for trying to raise her children, all that jazz you see all the time.\n\nMy question is that how can this *not* be considered child abuse? She is willfully filling her children's heads with thoughts that they'll be abused and tortured for an eternity. Imagine if I told my young child that if they lied to me about stealing candy or something, Mr. Bob from two blocks over would kidnap him and peel off his skin with a knife. *Yet this is no less gruesome or untrue than what my aunt tells her children.*\n\nIf this were in any context outside of religion, it would be grounds for the Children's Aid Society to remove my children. Can an atheist make me an argument that it's not abusive?",
        "created_utc": 1458136083,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to locate a story I saw on /r/trueAtheism",
        "author": "disc910",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4amg0l/trying_to_locate_a_story_i_saw_on_rtrueatheism/",
        "text": "[removed]",
        "created_utc": 1458106569,
        "upvote_ratio": ""
    },
    {
        "title": "Did any1 else do this",
        "author": "TheNextNinjaYT",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4agxfw/did_any1_else_do_this/",
        "text": "[removed]",
        "created_utc": 1458015794,
        "upvote_ratio": ""
    },
    {
        "title": "Diffusing God works in mysterious ways argument ?",
        "author": "clan1741",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ags6r/diffusing_god_works_in_mysterious_ways_argument/",
        "text": "What are some clever ways to diffusing this argument that kills further discussion ? What sort of questions one can ask that can lead to an absurd answer / reductio ad absurdum ? Usually this comes up when theist is unable to answer questions about immorality in bible or problem of evil.",
        "created_utc": 1458013218,
        "upvote_ratio": ""
    },
    {
        "title": "Diffusing God works in mysterious ways argument ?",
        "author": "clan1741",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ag4uz/diffusing_god_works_in_mysterious_ways_argument/",
        "text": "[removed]",
        "created_utc": 1458003629,
        "upvote_ratio": ""
    },
    {
        "title": "How do I argue that people did not have the capabilities to make dinosaurs in biblical times?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4adg6g/how_do_i_argue_that_people_did_not_have_the/",
        "text": "[deleted]",
        "created_utc": 1457968128,
        "upvote_ratio": ""
    },
    {
        "title": "Responses to God has rights over us argument.",
        "author": "99pathsoflife",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ac7p8/responses_to_god_has_rights_over_us_argument/",
        "text": "[removed]",
        "created_utc": 1457942106,
        "upvote_ratio": ""
    },
    {
        "title": "Dillahunty, Ozymandias, Malpass, Floyd FP, and Linford on Presuppositionalism",
        "author": "prof_linford",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4aa05x/dillahunty_ozymandias_malpass_floyd_fp_and/",
        "text": "[removed]",
        "created_utc": 1457902938,
        "upvote_ratio": ""
    },
    {
        "title": "You share a cab ride with an acquaintance. They (a religious person) ask you about your faith. You have only about a mile to go before you part ways, and you'd like to leave the cab amicably. What do you tell them?",
        "author": "Meikami",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4a8r2s/you_share_a_cab_ride_with_an_acquaintance_they_a/",
        "text": "Asking for a friend. \n\nSeriously though, I've had this come up a number of times. I’ve built myself a rough \"elevator pitch\" that I use as an attempt to get across what I believe (or, rather, don't) in a that might allow the other person to understand me – and atheism as a label - a little bit better. I usually smile and straight out say I'm an atheist, and if their initial reaction is surprise or alarm (it happens), I might delve into it a little bit by explaining that I don't believe in any gods, I don't believe in an afterlife, and I don't believe in souls. Given enough time I might mention that having just this one life means I should probably make the most of it and try to be a good person, and to be empathetic and kind to others, since it's their only shot at life too. My hope is that a little bit of context might make that one person's impression of \"the A word\" soften just a little. \n\nIf their initial reaction was more neutral or not surprised at all, I'd probably just leave it at \"oh, I'm an atheist\" and move on to other conversations. \n\n\nI'm curious what other atheists might say in those same situations. ",
        "created_utc": 1457884197,
        "upvote_ratio": ""
    },
    {
        "title": "What's wrong with this site?",
        "author": "JunDoRahhe",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4a8ib3/whats_wrong_with_this_site/",
        "text": "[removed]",
        "created_utc": 1457879755,
        "upvote_ratio": ""
    },
    {
        "title": "A third of all Russians believe the Sun revolves around the Earth.",
        "author": "lalana89",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4a69sx/a_third_of_all_russians_believe_the_sun_revolves/",
        "text": "[removed]",
        "created_utc": 1457829335,
        "upvote_ratio": ""
    },
    {
        "title": "The Logic Behind a Young Earth - Episode 2",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4a5bir/the_logic_behind_a_young_earth_episode_2/",
        "text": "[deleted]",
        "created_utc": 1457814023,
        "upvote_ratio": ""
    },
    {
        "title": "I am participating in a debate concerning whether or not evolution and \"intelligent design\" should both be taught as fact in schools:",
        "author": "Ekaterian50",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4a09d3/i_am_participating_in_a_debate_concerning_whether/",
        "text": "[removed]",
        "created_utc": 1457723909,
        "upvote_ratio": ""
    },
    {
        "title": "I am a former fundamentalist young Earth creationist. Ask me any question and I'll respond as my former Christian self.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/49vz7i/i_am_a_former_fundamentalist_young_earth/",
        "text": "[deleted]",
        "created_utc": 1457650534,
        "upvote_ratio": ""
    },
    {
        "title": "[Discussion] Could membership to a voluntary social group (like a religion) provide some kind of insurance against punishment for breaking secular rules?",
        "author": "duggtodeath",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/49uw52/discussion_could_membership_to_a_voluntary_social/",
        "text": "So this story about the Duggar family popped up on my frontpage. Josh is out of \"rehab\" while his sisters are selling a new reality series. Indeed, the Duggar molestation case has the added complexity of the perpetrator's youth at the time, the general passage of time, and statute of limitations in that state. I get it. But Josh is out of \"rehab\" and may enter the public spotlight again.\n\nThe one thing I wonder is: can a religious person's reputation ever truly be tarnished? Had an atheist committed the same offense, would the \"court of public opinion\" shrug it's collective shoulders in response after said non-believer emerged from \"rehab\"?\n\nWe see other examples of prominent religious men in a seat of power in their community (respected family, clergy, TV show host, etc.) do something that society at large finds reprehensible (molestation, cheating, scams, infidelity, etc). Does society give certain people a kind of free pass or do-over to people of faith? Or am I discounting incidents where the non-religious broke the same rules and got away with \"Meh\" as the social response?\n\nAnd further, could membership to something like the Catholic clergy, or just any church or mosque kind of be an insurance against future transgressions? I mean, those believers have to forgive me, I'm part of their in-group. Could that be an unconscious benefit?\n\nYou should share your thoughts.",
        "created_utc": 1457636570,
        "upvote_ratio": ""
    },
    {
        "title": "Former young earth creationist here offering to answer any questions you might have about it. I was a YEC for over 23 years and will be answering your questions in an upcoming video. AMA!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/49tv5f/former_young_earth_creationist_here_offering_to/",
        "text": "[removed]",
        "created_utc": 1457623501,
        "upvote_ratio": ""
    },
    {
        "title": "Violence Is Inherent In Faiths Based on Scriptures",
        "author": "Lee_Burvine",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/49rehx/violence_is_inherent_in_faiths_based_on_scriptures/",
        "text": "ISIS is begging for war and the USA is very probably going to give it to them. Particularly if it elects a conservative President this fall.\n\nPersonally, I'm more concerned with the deeper problem of why ISIS wants this conflict than I am with the dubious merits of the war itself. On the surface they clearly hope to consolidate their power within an Arab Muslim world that’s united behind an all out holy war with the West. But that power is not desired as an end to itself. It's power for a purpose.\n\nThey wish to establish a world-wide Islamic Caliphate. They have already said as much.\n\nAnd here is, I think, the key to understanding all of this. They almost certainly believe this scripturally directed organization they're fighting for would bring harmony and something rather paradisaical into being for all mankind.\n\nIn other words, they're ultimately good-intentioned. Imagine that.\n\nThis cuts to the very heart of what's wrong with most religions, particularly the Abrahamic ones. They have perverted the entire concept of goodness, rendering it only in terms of duty to the God of scripture. Why should any person with Jewish or Christian beliefs be surprised then at something like the November 2015 massacre in the Bataclan Theater in Paris? After all, they too measure good ultimately by its accordance with a book in which a monster God murders the entire population of the earth (but for an incestuous handful), drowning pregnant mothers and little children and babes in arms.\n\nReligiously motivated attacks and provocations, like mass beheadings and immolations, are all in effect just copycat murders. God kills those who do not worship and obey Him. The Book tells us so. Why shouldn't we do the same?\n\nUntil the Torah, the Bible, the Qur'an and all similar writings are universally recognized as mythology and not as the final arbiter of moral truths, we will have this religious violence. Mainly because the text-based religions in particular have within them no mechanism for the resolution of extra-textual disagreements.\n\nIf you and I disagree over the weight of a gold coin I'm offering in payment for a cow, we have a simple solution to our conflict. We weigh the coin. We submit to the genuine authority of empirical evidence. There is no comparable solution available when opposing scriptures come into conflict. There is only one way to settle matters. Violence.\n\nFor this reason violence is inherent to all faith-based systems grounded in holy books. When you divorce truth from evidence and claim your own particular text as the ultimate epistemic authority, you’ve left no other path open to settle matters with unbelievers. Like those who stand in the way of the universal peace your Caliphate would bring.\n\nUnbelievers must be cast out or killed, lest their doubt lead to social turmoil and poison the well of faith. And all of us, every single one of us, is from some religious perspective an unbeliever. Thus we all deserve to die. So say the books. So say the gods.\n\nAnd all who listen to them.",
        "created_utc": 1457575074,
        "upvote_ratio": ""
    },
    {
        "title": "How is \"Intelligent design\" not an oxymoron? Why doesn't the assumption of intelligent design not apply to the creator?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/49mogv/how_is_intelligent_design_not_an_oxymoron_why/",
        "text": "[removed]",
        "created_utc": 1457501665,
        "upvote_ratio": ""
    },
    {
        "title": "From an atheist's perspective, the story of Mary and Jesus is incredibly tragic.",
        "author": "hellomireaux",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/49fk3e/from_an_atheists_perspective_the_story_of_mary/",
        "text": "Teenage girl gets pregnant and decides to go with the ultimate Hail-Mary (pun intended) of explanations.  It works - her new husband believes that the kid is the son of god, and the kid grows up thinking the same.  She goes 33 years thinking she's pulled the greatest con of all time, and then the poor kid is arrested and executed because he took her story and ran with it.  \n\n\n\nOf course, this is assuming that we're talking about historical characters and that the Bible is an accurate account of the events.  Just a little food for thought.  ",
        "created_utc": 1457394709,
        "upvote_ratio": ""
    },
    {
        "title": "I feel like millennials are becoming more religious, like it's the cool thing to do.",
        "author": "ZadocPaet",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/49b4i9/i_feel_like_millennials_are_becoming_more/",
        "text": "I am a younger Gen Xer. Most people who I know and grew up with don't believe in god or religion. The very idea to us is just preposterous. My generation is known for being a bit rebellious, too. So is a lot of our music. Leaving god behind was an easy way to rebel against society. \n\nI am newly back in college. I went when I was young, had a kid, and then dropped out. Now I am back full-time. I am usually the old guy in class. \n\nA lot of my professors welcome group discussion. Group participation is a big trend in education these days. Like they're trying to mirror social media in a classroom setting. \n\nI am really surprised by the number of people who are outspokenly religious. A lot of them call it \"spiritual,\" but it always involves a higher power of some kind, either borrowed from a mainstream religion or a creation of their own mind. \n\nThis is a pretty stark contrast to when I was in college the first time, where a lot of people I interacted with were admittedly atheist. It was common. I say I don't believe in religion now and I get weird looks. \n\nThe other thing too that strikes me as funny is the number of young white guys who have converted to Islam and are outspokenly Muslim. It's like becoming Muslim is the new in-road to joining the counter-culture. \n\nFinally, it doesn't seem to me like this generation is very rebellious. They're somewhat anti-establishment, but they don't want to not be a part of it. They want to join it in order to change it. I wonder if that has something to do with why they seem more religious to me. \n\nI want to stress that a lot of these religious people would describe themselves as \"non-religious\" even though they have very highly developed religious beliefs. Again, IMO, their way of joining the counter-culture. \n\nThat said, this is purely anecdotal. I was just wondering if anyone else noticed the same thing. \n",
        "created_utc": 1457327846,
        "upvote_ratio": ""
    },
    {
        "title": "feel like millennials are becoming more religious, like it's the cool thing to do",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/49b4eb/feel_like_millennials_are_becoming_more_religious/",
        "text": "[deleted]",
        "created_utc": 1457327798,
        "upvote_ratio": ""
    },
    {
        "title": "A shower thought on the argument that life without God has no meaning - an infinite regress",
        "author": "true_unbeliever",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4924ay/a_shower_thought_on_the_argument_that_life/",
        "text": "So I was thinking about the infinite regress counter argument against the cosmological argument and how it can also be applied to the statement that life without God has no meaning or purpose.  If that is true then God does not have a purpose or a higher God gave him a purpose.\n\nThe theist counter arguments are ~~obvious~~ obviously expected, but I thought it was a novel twist on the infinite regress.",
        "created_utc": 1457177838,
        "upvote_ratio": ""
    },
    {
        "title": "Opinion on Christian private schools?",
        "author": "Zenithoid",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4914wg/opinion_on_christian_private_schools/",
        "text": "I go to 1. The people are better than at public schools, but they're pretty narrow minded. They aren't dumb, but they come to conclusions to quickly. They're politics don't bother me, but I hate that they have to associate conservatism with christianity. The science there is total shit tho. It's weird how they have a mostly logical look at everything except religion and science. ",
        "created_utc": 1457153825,
        "upvote_ratio": ""
    },
    {
        "title": "Just read a book that was, ultimately, about someone finding their faith. Rather enjoyed it... Not sure how I feel about that",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4913kf/just_read_a_book_that_was_ultimately_about/",
        "text": "[removed]",
        "created_utc": 1457153115,
        "upvote_ratio": ""
    },
    {
        "title": "Opinion on youth groups?",
        "author": "Zenithoid",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4913g4/opinion_on_youth_groups/",
        "text": "[removed]",
        "created_utc": 1457153042,
        "upvote_ratio": ""
    },
    {
        "title": "Sick Non-fiction reading for all my friends &lt;3&lt;3",
        "author": "westborobaptistlover",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/490m1w/sick_nonfiction_reading_for_all_my_friends_33/",
        "text": "[removed]",
        "created_utc": 1457144485,
        "upvote_ratio": ""
    },
    {
        "title": "I'm so tired of hearing good ol' Christians say stuff like \"We should just bomb the entire middle east and kill them all\" or \"If people are poor it's because they're not trying\".",
        "author": "Gibsonfan159",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4901wg/im_so_tired_of_hearing_good_ol_christians_say/",
        "text": "I'm not sure that I've ever heard a so-called christian not say things that are the *exact opposite* of the teachings of Christ. This is why it's so hard to show anyone religious person any respect. But I am in a southern baptist area, so it might be an exception.",
        "created_utc": 1457135709,
        "upvote_ratio": ""
    },
    {
        "title": "Former Christians: What was your 'deconversion' process like?",
        "author": "jday03",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48vzwv/former_christians_what_was_your_deconversion/",
        "text": "I am currently a Christian person that is questioning and thinking about atheism... \nAnd logically it makes sense but... there remains this emotional void that I feel. It is like I want there to be a meaning to life, I want for God to exist, and I want to have the feeling of a relationship with God, etc. I want the joys I once felt at times, even though it wasnt perfect joy or anything and I still had problems. \n\nMy question is this: What was your life as a Christian? What was your 'deconversion' process like, and how is your life now? What is it like to be an atheist? \nIs there a way to stop this feeling of complete voidness of purpose I feel? \n\nFeel free to answer as many/ as few as you want. I have other questions, but these are the most important for me right now...\nI have my own logical reasons for Atheism at the moment, but the actual emotional bond I have with the church/ god is what im concerned about.\n\n\n\n---\nEDIT: Hey guys... Thanks so much for spending time to write your responses! You guys are really helping me to appreciate atheistic (or non religious) ways of life and such... I think that ive partly made too much of a division between religious and atheistic people, to the extent that I accepted in part the demonization of non Christian beliefs and am now seeing how everyone can be really loving and awesome apart from religious belief. I n\n\nThis year, more than others, I have really began to see how many atheists are just as sincere as my Christian friends. Sure, there are some who are in your face and stuff, but some Christians are the same way. Theres some atheistic people in my life that are just amazing people that have a lot of love for people... Helps to break the boundaries that were sometimes created by religious ideas. I am really encouraged to see such love from all of the people here... Really gives me a lot to think about. \n\n Thank you guys for being really loving, accepting, and chill. ",
        "created_utc": 1457068557,
        "upvote_ratio": ""
    },
    {
        "title": "Are Atheists Abusing Their Right to Free Speech?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48v7w7/are_atheists_abusing_their_right_to_free_speech/",
        "text": "[deleted]",
        "created_utc": 1457056395,
        "upvote_ratio": ""
    },
    {
        "title": "Why do some Christians claim that the Old Testament is outdated and yet believe what is written in Genesis?",
        "author": "cubanunicorn",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48usb2/why_do_some_christians_claim_that_the_old/",
        "text": "[removed]",
        "created_utc": 1457049914,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on this article about a nanny who said in court that ‘Allah ordered’ her to sever four-year-old’s head",
        "author": "pseudonym1066",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48rxhd/thoughts_on_this_article_about_a_nanny_who_said/",
        "text": "[removed]",
        "created_utc": 1457011001,
        "upvote_ratio": ""
    },
    {
        "title": "Spirituality and atheism",
        "author": "1tepa1",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48rx1p/spirituality_and_atheism/",
        "text": "Spirituality and atheism are not incompatible.\nHow many of you are spiritual? I am not talking about any crystal new age hippy type of spirituality, but simply inquiring to your own experience of being. Turning attention inwards and playing around, trying to discover something.\n\nI was suprised when I saw this video from Sam Harris where he says that the sense of the localised self that exists behind the eyes, inside the head is an illusion, it can be broken through. This is was also my experience.\n\nAfter that just pure experience remains, there is no separated entity (feeling of self) inside our field of experience that somehow is the observer and the controller of the rest. That separated feeling of self is also an observeable experience withing consciousness, just like all feelings, but that feeling when believed can alter the way all things are perceived.\n\nI would like to hear about your opinion on the matter and of course those of us with experience with this type of a shift in perception can tell about their experience.\n\nHere is the video from Sam Harris\nhttps://www.youtube.com/watch?v=fajfkO_X0l0",
        "created_utc": 1457010750,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] Most Hurtful Thing Said to You",
        "author": "Amaldabullosa",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48pfrs/question_most_hurtful_thing_said_to_you/",
        "text": "[removed]",
        "created_utc": 1456966524,
        "upvote_ratio": ""
    },
    {
        "title": "Some religious people are like Jackal and Hyde.",
        "author": "windlep7",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48oh0f/some_religious_people_are_like_jackal_and_hyde/",
        "text": "Something I've noticed for a while is my dad is like Jekyll and Hyde. Normally he's this mild mannered, soft spoken and extremely friendly man. A few friends have told me how nice he is. But as soon as Christianity comes into it, this darkness seems to come over him and he turns into this angry person.  He started ranting tonight about how evil man is and how they'll deserve it when God finally destroys the world in the apocalypse.  It's scary how much he changes.\n\nHe knows I'm an atheist but thinks I still believe deep down and one day ill realise and come back into the fold. Ironically, the effect Christianity has on him is one of the reasons I'll never go back (besides the fact it's all nonsense).\n\nEdit: Sorry, I can't spell, I meant Jekyll! :-/",
        "created_utc": 1456954357,
        "upvote_ratio": ""
    },
    {
        "title": "Question Everything but the Bible…",
        "author": "KingAdeto",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48n49v/question_everything_but_the_bible/",
        "text": "As a closet atheist, I have to put a lot of effort in to suppress what I say. Recently, I heard a Christian say, “You should question everything, just don’t question God and the bible.” \n\nI’m having trouble coping with this statement., I want to scream and logically disembowel it, yet I cannot due to the damage it would do in my life. \n\nAre there any religiously unbiased responses to say? \n",
        "created_utc": 1456939163,
        "upvote_ratio": ""
    },
    {
        "title": "You are God and God does not exist.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48hthu/you_are_god_and_god_does_not_exist/",
        "text": "[removed]",
        "created_utc": 1456856565,
        "upvote_ratio": ""
    },
    {
        "title": "Oxford University Press is offering 60% off for book orders, just for today. Get some! Feel free to recommend books in comments.",
        "author": "ericdoes",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48eald/oxford_university_press_is_offering_60_off_for/",
        "text": "[removed]",
        "created_utc": 1456803205,
        "upvote_ratio": ""
    },
    {
        "title": "Citation for Clarence Thomas quote on death penalty?",
        "author": "quarksurfer",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/48da45/citation_for_clarence_thomas_quote_on_death/",
        "text": "[removed]",
        "created_utc": 1456788984,
        "upvote_ratio": ""
    },
    {
        "title": "Help with an argument with my teacher?",
        "author": "Lungero",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/485z5s/help_with_an_argument_with_my_teacher/",
        "text": "I attend a christian school and am somewhat of a loudmouthed atheist when it comes to my theology courses. I recently submitted an assignment discussing where Christians have a hard time seeing god, and my point was science. I said that evolution doesn't guarantee human existence so therefore humans cannot have a religious purpose, that there are genes that hint spirituality is in our gene pool so it is beneficial for survival, etc. But I'm a bit stumped with how to respond to the following:\n\n\"If the human brain is nothing more than the product of evolution, along with the genes that construct it, then it follows that every idea that stems from it is used to enhance the survival of the organism.   However, the problem lies in trusting those ideas.  After all the mind only has to create thoughts that enhance survival it doesn’t have to have the ability to actually know if those thoughts are true.  So the question remains can we trust the mind to actually understand what is true or can we only rely on it’s ability to create thoughts and illusions that help us survive?  Well, if the latter is true then even the naturalist is hooped since they believe that their thoughts are true.   In fact, the irony is in the question since the question stems from the mind and if you said yes to the former half of the question you would be declaring a truth statement.    I believe that my thoughts are a good reflection of reality just as you do but we both must agree that our brains are not merely organs with the sole ability to produce ideas that enhance survival, rather by neccessity we must accept the premise that the brain is capable of knowing what is true.   One could argue that the VMAT-2, AKA the “God gene” is a physical component that enables our brain to seek after that which we call God however it’s doesn’t follow that the gene is tricking us.  Rather the gene could be a component that helps in seeking God like a gene for the eye could enable it to see.    Finally, epigentics allows us to see that certain genes are turned on and off by our lifestyles.  This means that VMAT-2 could have a higher probabilty of being turned on by those who are religious compared to those that aren’t.   Considering how religious people have been since evolving into humans it is no wonder why we see their genes being affected this way and seeing certain gene responding to such powerful behaviour.   \n\nOne could also reverse this statement and say that those who don’t believe are merely because they don’t have the VMAT-2 gene.  This reduces all choice to nothing and you (which I know you’re not) would be a determinist.  Science can tell us the physical components of being human but it can’t get at the essential questions: “What makes us different than the animals?  What is my meaning? Who am I? Who are we?  Why is there evil in the world? Etc… These are human question solely taken on by our species and they demand answers.  Science tells us these are irrelevant and illusionary questions.  Most people in the world would disagree with that statement.  Which means you must create a story that answers those questions.  Ironically, so do the few scientists that call themselves purely naturalists, as they believe in non material things to give their life meaning-love, justice, goodness,beauty, etc.. \"\n\nI know how to argue against \"God put VMAT-2 there\", but I cant really argue about the mind...I feel like what he is saying is dead wrong, that not all thoughts are just for survival and therefore untrue, I know that, but I cant scientifically explain it and he is the science teacher. Im not a determinist, I'm a compatablist: I believe we have limited free will, but even if it was 100% deterministic I still think we are no less free, so I do have a hard time arguing on behalf of how the mind works. I'm still in high school, and my main interests are philosophy, literature and history, so I've never been great at science. Any help is nice. This is not for marks, me and my teacher have these discussions often so you're not just doing my homework :)\n\nCheers! ",
        "created_utc": 1456696210,
        "upvote_ratio": ""
    },
    {
        "title": "How do you handle miracle claims?",
        "author": "ChrisBabyYea",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/482d34/how_do_you_handle_miracle_claims/",
        "text": "[removed]",
        "created_utc": 1456669057,
        "upvote_ratio": ""
    },
    {
        "title": "How do you react to pseudoreligious beliefs?",
        "author": "hellomireaux",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/480rcf/how_do_you_react_to_pseudoreligious_beliefs/",
        "text": "I sometimes encounter people who reference astrology, tarot, crystals, etc. in conversation as something of significance.  My general reaction is to simply listen and nod, remaining politely neutral on the surface while suppressing my true discomfort.  A recent example: my friend was convinced that her dreams and recent tarot reading were confirmation of a failed relationship.  How do you handle these kinds of things?",
        "created_utc": 1456644412,
        "upvote_ratio": ""
    },
    {
        "title": "New Atheists should accept philosophy as a valid and useful discipline.",
        "author": "William_1",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47xzmt/new_atheists_should_accept_philosophy_as_a_valid/",
        "text": "In this post, I will argue that members of the New Atheist movement should accept philosophy as a valuable discipline, since doing so will help them advance their stated goals, both logically and polemically.\n\nCommentators have noted that the New Atheist movement is distinct from previous versions of atheism in at least two ways. First, it maintains that being religious in the absence of evidence for God's existence is irrational and a moral defect. Second, it maintains that religion has overall negative effects on the world, like religious wars and the 9/11 attacks.\n\n\nBoth of these claims presuppose a moral standard, some way of distinguishing between what is morally good and bad. However, generally speaking, the New Atheists have not put much effort into a defending a substantial theory of morality. Philosophy can help the New Atheists accomplish this by identifying and arguing for a moral standard and integrating it into a coherent overall worldview.\n\nIn addition to helping the New Atheists maintain their central claims logically, philosophy can help them polemically as well. One of the main concerns Christians have about atheism is that atheism is inconsistent with having a principled moral code that can guide their decisions in life. Philosophy can provide such a moral code by applying a moral standard thoughtfully to the difficult moral dilemmas we face in life, thereby enabling the New Atheists to meet this criticism of atheism.\n\nIn conclusion, philosophy can help the New Atheists meet logical criticisms of atheism and persuade Christians that atheism is not inconsistent with morality. New Atheists should accept philosophy as a valid and useful discipline.",
        "created_utc": 1456606975,
        "upvote_ratio": ""
    },
    {
        "title": "If Christianity were true, why are Christians so unhappy?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47vyfa/if_christianity_were_true_why_are_christians_so/",
        "text": "[deleted]",
        "created_utc": 1456589905,
        "upvote_ratio": ""
    },
    {
        "title": "Free will doesn't even exist subjectively",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47o2r1/free_will_doesnt_even_exist_subjectively/",
        "text": "[deleted]",
        "created_utc": 1456473696,
        "upvote_ratio": ""
    },
    {
        "title": "Probably getting kicked out as soon as I tell my family I'm atheist. Do I tell them or not?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47mg26/probably_getting_kicked_out_as_soon_as_i_tell_my/",
        "text": "[deleted]",
        "created_utc": 1456446661,
        "upvote_ratio": ""
    },
    {
        "title": "Very recent atheist convert seeking books that are not so...abrasive",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47kg0n/very_recent_atheist_convert_seeking_books_that/",
        "text": "[deleted]",
        "created_utc": 1456424769,
        "upvote_ratio": ""
    },
    {
        "title": "\"Who needs a valid argument when you have God?\"",
        "author": "MicooForYou",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47kb6z/who_needs_a_valid_argument_when_you_have_god/",
        "text": "I am a freshman at a Catholic University, and this semester I decided to take a Logic class. There is a seminary in association with the university so regular undergrads will often times have classes along with seminarians. Because all seminarians are Philosophy Majors, my Logic class with filled them. So today, while we were taking a break midway through class, I hear one seminarian say, \"Who needs a valid argument when you have God?\" I don't think he was even joking when he said it. \n\nI guess my reason for posting this was to bring up a certain point regarding blind faith and irrationality being a possible trait of religion in general. I believe that if people have a good reason for believing and practicing some religion (happiness and joy, purpose, allows them to do good in the world, etc.) and they don't go out of their way to hurt others, let them do what they want. Kind of a libertarian philosophy, but I always have this conflicting notion that their happiness should not matter in terms of truth. Should we allow people to have child-like, blind faith which makes them happy, but distorts their world view, or should we condemn them for what they believe simply for the sake of truth that they will not have the ability to even think about when they are dead? They have this one life, why not just let them be happy? Not sure, its up for discussion.\n\nEdit: I have read everyone's responses so far and it is nice to see such a cool discussion on these things. I just want to add something that I literally just learned about in my Ethics class and I think it is related to this thread. We started talking about Kant's moral theory of Deontology and my professor gave us one of Kant's arguments against Utilitarianism saying this:\n\n1. All organs are best adapted to their specific purpose.\n2. The defining capacity of a rational being is REASON.\n3. If happiness is the ultimate end for human beings, then reason would be the best adapted to achieve happiness.\n4. But reason is not best adapted to achieve happiness (\"Ignorance is bliss\").\n5. Therefore, happiness is not the ultimate end for human beings.",
        "created_utc": 1456423560,
        "upvote_ratio": ""
    },
    {
        "title": "I no longer believe. Why do I keep praying?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47gy4y/i_no_longer_believe_why_do_i_keep_praying/",
        "text": "[deleted]",
        "created_utc": 1456370392,
        "upvote_ratio": ""
    },
    {
        "title": "Cosmological argument for atheism",
        "author": "Aoea",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47dv4h/cosmological_argument_for_atheism/",
        "text": "So I read some William Lane Craig and was intrigued by his main weapon - the Kalam cosmological argument, which is:\n\n1) Everything that begins to exist has a cause.\n\n2) The Universe began to exist.\n\n3) Therefore, the Universe has a cause.\n\nI do buy it. In fact, I found a way to strengthen it into a cosmological argument *for atheism*. Here it is: \n\n1) Everything that exists has an external cause of its existence.\n\n2) The Universe exists.\n\n3) Therefore, by 1 and 2, the Universe has an external cause of its existence.\n\n4) A necessary being does not have an external cause of its existence. \n\n5) Therefore, by 1 and 4, a necessary being does not exist.\n\n6) Therefore, by 3 and 5, the external cause of the existence of the Universe is not a necessary being.\n\n7) Therefore, by 6, the expression “the necessary being that is the cause of the existence of the Universe” does not refer to anything - i.e. God does not exist.\n\nSo what may be the cause of the existence of the Universe? Certainly it can't be an *entity*, like a conscious being or some primordial field etc, because the Universe includes all entities. But the cause can be logical in nature, i.e. a certain *state of affairs* (ascribable truth value), not entity (ascribable existence). A natural and parsimonious candidate is *there not being anything at all*, i.e. absolute absence of anything. Then something can come from nothing *but only if there is nothing at all*. It's just a reverse of annihilation - \"disnihilation\" - and the logical cause of it happening is absence of anything. So it follows that (unless Universe self-annihilates) it can only happen once, preventing things from randomly popping into existence out of nothing, in accordance with common sense.\n\nYour thoughts?\n",
        "created_utc": 1456336538,
        "upvote_ratio": ""
    },
    {
        "title": "Frustration on Bernie Sanders' Secularism, regarding the New York Times and a small national discussion.",
        "author": "arthurktripp",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47dhh5/frustration_on_bernie_sanders_secularism/",
        "text": "Good morning -- Just read a [NYT article](http://www.nytimes.com/2016/02/25/us/politics/bernie-sanders-jewish.html) about the Jewish American community's reaction to Sanders' secularism. It's pretty brief, but the main takeaways are:\n\n* Some Jewish leaders don't like that he \"leaves religion in the background\"\n\n* Some Jewish leaders don't mind very much\n\n* There is still some anti-semitism in middle America, and \"he knows what he's up against.\"\n\nWhile I do find it interesting, and important, to stay plugged in to religious influence on the American voter, one thought stayed with me through the whole article: *this article would have been far more accurate, though very nearly the same, by focusing on his secularism.*\n\nThe only quote from Sanders himself is,\n&gt; “What my spirituality is about is that we’re all in this together and it’s not a good thing to believe that as human beings we can turn our backs on the suffering of other people. ... This is not Judaism.”\n\nCorrect. It is not Judaism; it's secular humanism. And it's atheism without using that word. How is Bernie Sanders' cultural background and family history half as important as his world view? I understand that this has to do with the 20th century history of genocide, zionism, America's foreign policy, etc. But the article cites a Gallup poll that says 92% of Americans would vote for a Jewish president, while only 58% would vote for an atheist (the article does not mention the latter stat, though it seems pretty relevant). \n\nWith this in mind, the article becomes a piece about a religious community's opinions on a man who's parents were part of that community. If Tom Cruise's daughter runs for president in 40 years, are we going to read articles about David Miscavige's opinion on her relationship to the church?\n\nI'm sure I'm not alone in wishing that we could see some national discussion about Sanders' relationship to atheism: why it's political suicide to use that word; why it is important, in a world of scientific inquiry and progress, to have secular leadership; how does a person develop and adhere to morality without a god's instruction? I'm sure we all know these answers, but the lack of discussion on a national level leaves atheists as the least-trusted group of people in the US. There is so much to talk about, especially in the context of a presidential election, but the media is missing the opportunity in favor of non-issues.\n\nThanks for letting me vent. I'm interested in reading your opinions, mainstream articles that address this, etc. etc. etc.",
        "created_utc": 1456332267,
        "upvote_ratio": ""
    },
    {
        "title": "Need help explaining morality and self accountability to spouse.",
        "author": "djsanchez2",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47athh/need_help_explaining_morality_and_self/",
        "text": "I was having a conversation with my wife and I suck at being able to articulate concepts, so maybe you guys can help out with an easier to understand version.  \n\n\nWe were at Costco the other day and I had a $35 case of drinks in the bottom of the cart, the girl finishes scanning our things on the belt and begins to check us out. At which point I ask if she scanned the case under the cart, she hadn't, so she thanks me and scans  it making the total jump higher. So my wife takes the opportunity to delve into my honesty, and questions how I can be so absolutely honest all the time. (This is a common theme of our 10yr+ relationship and one of the reasons she looks up to me as a partner btw.)  \n\n\nThis is the part where I need help, as I know why, but have difficulty expressing it to my satisfaction. I told her since I lack an ultimate authority to answer to I only have myself to answer to. I try to hold myself to a high standard and honesty means a great deal to me. Her response kind of ruffled my feathers a bit, \"well then it should be easy to not feel guilty if you only have yourself to answer to right\"? This is precisely WHY it is so important for me to be honest, I have to answer to myself and have to deal with self reflection and shame. It just gets a bit jumbled from there, do any of you guys feel the same? Can you possibly assist in explaining this feeling? \n\n\nFor the record, she wasn't saying I should steal the item, she was trying to make a point that taking advantage of some one else's mistake, when it is to your benefit, is kind of a moral grey area. Then using that to question how I navigate those grey areas.\n\n**EDIT** \n\nThanks for all the replies fellas. I have a better grasp on how to convey the emotion that drives me to be the type of person that I am. \n\nOne other small thing, my wife questions such things because she is on her path to atheism. It is slow going, but since we got together, she has gone from full blown raised catholic, schooled catholic (K-12), to ex-catholic, to buddhist, to agnostic. So she is making the journey and recently denounced mainstream religion and their practices. Very recently she had had a lot of tough questions such as the one in this thread. I feel she is grasping at the step, but is going to need a lot of help to over come some of the more deeply rooted side effects of her indoctrination.\n\nTo the people who called her a bad person, shame on you. Did you gloss over the part where I said my honesty is something she admires, and she looks up to? Many other people in my life are more than deserving of those judgements,  but not my wife. ",
        "created_utc": 1456288514,
        "upvote_ratio": ""
    },
    {
        "title": "What was the motivation of the early church to embellish the teachings of Jesus with miracles?",
        "author": "niqnaqs",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47a8vi/what_was_the_motivation_of_the_early_church_to/",
        "text": "I just read a thread on this sub about how it's pretty widely believed that Jesus was a real person/teacher, but that the early church added stories about him performing miracles and the like. What would have been the motivation to add this?",
        "created_utc": 1456280421,
        "upvote_ratio": ""
    },
    {
        "title": "Is the authenticity of the Torah questionable",
        "author": "g-ali",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/47a401/is_the_authenticity_of_the_torah_questionable/",
        "text": "I was having an open conversation with a friend of mine about the authenticity of the first five books of the Torah since there was a fire that caused the Torah to be rewritten. He claims that the translations of Dead Sea Scrolls 95% of the were translatable with 5% minor errors that don't change the meaning of the text. I'd like to hear your thoughts to have a better understanding. ",
        "created_utc": 1456278496,
        "upvote_ratio": ""
    },
    {
        "title": "Did a historical Jesus exist?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/477y7i/did_a_historical_jesus_exist/",
        "text": "[deleted]",
        "created_utc": 1456251622,
        "upvote_ratio": ""
    },
    {
        "title": "How would you answer these contentions?",
        "author": "Rattional",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/477iqi/how_would_you_answer_these_contentions/",
        "text": "[removed]",
        "created_utc": 1456246891,
        "upvote_ratio": ""
    },
    {
        "title": "Two men that I commute with talk every day how America doesn't obey God's commands anymore, and how they one day will take up arms and violently overthrow the government and anyone who opposes their political views. Do I report them?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/474okd/two_men_that_i_commute_with_talk_every_day_how/",
        "text": "[deleted]",
        "created_utc": 1456197674,
        "upvote_ratio": ""
    },
    {
        "title": "How can we solve this issue in our relationship?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46zdfn/how_can_we_solve_this_issue_in_our_relationship/",
        "text": "[deleted]",
        "created_utc": 1456118322,
        "upvote_ratio": ""
    },
    {
        "title": "A friend of mine kind of came up with this adaptation of the cosmological argument. Are there any fallacies being committed. My untrained eye sees possible fallacies but I'm not sure.",
        "author": "TheOtherCollin",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46z5v1/a_friend_of_mine_kind_of_came_up_with_this/",
        "text": "A Cosmological Argument for the Existence of God (the God of Deism)\r\n\r\n1 - The principle of cause and effect applies universally to all material things.\r\n\r\n1-1 - Some will say that the principle of cause and effect may not actually apply to the universe as a whole because of the idea that time is a property of the universe.  Essentially this concept of time being a property of the universe leads to the idea that there was no “before the Big Bang” because the beginning of the universe brought about time, and events cannot occur without time in which they can occur.  This seemingly leaves no room for a cause of the universe leading to the suggestion that the universe simply is.  In response to this, there is the following.  According to General Relativity, as an observer nears the Big Bang, time begins to slow down due to the density of the universe and the resulting gravity’s effect on time; once you reach the point of the very beginning, the singularity, time is at a standstill:  there is no time.  This presents a problem for the universe beginning.  Time would have to begin immediately after the singularity began expansion.  The fact that events require time means that the event of the Big Bang at the point of the singularity would have to have some time present, otherwise, it simply could not occur.  If time is solely a property of the universe, this isn’t possible.  If time exists independent of the universe and in the universe in two separate ways or independent of the universe but the universe can bend it, this would allow for the Big Bang’s occurrence; it would also leave time for a cause.\r\n\r\n1-2 - Some will say that the principle of cause and effect may not actually apply to the universe as a whole because of the idea that space is a property of the universe, and a cause would require space to even exist.  The problem with this is that, for the stuff of the Big Bang singularity to exist in any meaningful way, especially if the universe is infinite in size, it must occupy some space.  This results in a necessity for some fundamental form of space, giving room for the cause.  However, if the cause is immaterial, then it need not any space; yes, one could argue that an immaterial cause should not even be considered due to the fact that immaterial things cannot ever be verified, but that seems not to matter if it comes out to be necessary for the universe’s existence.\r\n\r\n1-3 - There is no reason to assume that the principle of cause and effect doesn’t apply to all material things.  It applies to everything we observe (including virtual particles which are likely and simply the result of vacuum activity rather than being causeless).  It matters not whether it be creatio ex materia (creation from material) or creatio ex nihilo (creation from nothing).  There is no reason to assume that the universe does not have room for a cause of some sort, regardless of the form and nature of said cause.\r\n\r\n2 - The universe exists and is material.\r\n\r\n2-1 - The only true opposition to this is that of solipsism, but for the sake of almost anything ever (from daily life to the depths of science) with the exception of some questions in metaphysics and epistemology, we assume the universe does exist in some meaningful way beyond our minds, beyond our perception.  There is no true way of verifying this, but saying that the universe does exists and basing everything else off of that produces consistent, practical, meaningful, predictable results.  Assuming its opposite, which is the idea that the universe doesn’t exist in any meaningful way beyond our minds, does nothing for us.  We have to at least act like the universe exists meaningfully even if we take the position of hard solipsism because, without such acting, nothing could be really be done and be considered meaningful.\r\n\r\n3 - Therefore, the universe has a cause of its existence and beginning.\r\n\r\n3-1 - This conclusion follows from premises 1 and 2.\r\n\r\n4 - This cause is an immaterial entity of some sort.\r\n\r\n4-1 - This premise arises from the necessity of a first cause (because there is no reason to assume the lack thereof) and the fact that all material things require a cause.  The immaterial nature of this cause of the universe prevents a causal infinite regress, which would be impossible because there is no way to get to the current state of existence if there were an infinite number of causes and effects preceding it; reality would have had to deal with an infinite amount of things before getting to the current status of all things.\r\n\r\n4-2 - Something that arises here is the idea that, because of some sort of time independence, time would stretch back into the past eternally resulting in an infinite regress.  There is nothing entirely incoherent about past eternity without anything occurring.  Once the cause of the universe acted, the chain of events began; prior to, there would have been a static state in which this first cause did nothing, and there was, thus, no causal chain of events.  In this static state, time is alike to numbers.  An infinite amount of numbers below zero all exist without some necessity for the others whereas any part of a causal chain requires its predecessor to be present.  This allows for past eternal time and not an infinite regress of causes.\r\n\r\n5 - This cause qualifies as a Deistic God.\r\n\r\n5-1 - The God of Deism is simply a deity that set the universe into motion, created it, etc.  After such creation, this deity simply doesn’t interfere with or intervene in the universe, which is both what the argument presents as a cause and what we see in the universe (because there is no evidence suggesting the “hand of God working in the universe”).\r\n\r\n6 - Therefore, God (the God of Deism, Nature’s God, Divine Providence, the Supreme Being, etc.) exists.\r\n\r\n6-1 - The term “exists” is used rather than “existed” (which would be used by Pandeists) because of Occam’s Razor; to say that God merged with and became that which it created assumes something more than the position of pure Deism (which simply takes the “exists” stance).  This leads to the concluded God being that of Deism rather than of Pandeism or Panendeism, which is right there with its cousin Pandeism.\n\n*EDIT:*  Formatting.  Also, I realized I didn't use a question mark in the title of the post, so that's dumb of me.\n\n*EDIT:*  Honestly, as I look at this argument, I see potential issues but I don't know for sure, so I thought I'd let the community here pick it apart and confirm or deny my suspicions.  I'm still fairly ignorant of how logic, logical fallacies, science, philosophy, etc. all work despite my pretending that I do.  I thought it time to be honest with myself and admit my ignorance and that others are far more skilled at this art of analyzing arguments than I am.",
        "created_utc": 1456115063,
        "upvote_ratio": ""
    },
    {
        "title": "{Premise} Humanities collective knowledge is a Higher Power than man.",
        "author": "RMFN",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46ymu8/premise_humanities_collective_knowledge_is_a/",
        "text": "Original post: https://www.reddit.com/r/C_S_T/comments/46ykx7/premise_humanities_collective_knowledge_is_a/\n\nAlso please visit /r/C_S_T.\n\nIsaac Newton said: \"If I have seen further, it is by standing on the shoulders of giants.\" He relied on the work of centuries of thinkers to compile what theories he did. He tapped into the collective knowledge and was able to build and contribute to it. The idea of the U.S. Constitution being a living document applies to knowledge itself. The body of human knowledge evolves and comes to a better understanding of itself though centuries of work. Apply evolution to information. Information has evolved its medium to make itself more accessible to the human organism. Song based mythology used the rhythmic linguistic connections to forge a story remembered on a chain so that every detail could remain the same for millennium. Oral tradition is actually a very effective means of information transmission. The written language though is more permanent. Even language written down can survive the death of all who speak it. The written word is a way to lock in meaning into time. Through books song based mythologies became obsolete and slowly absorbed and taken over by a scribe priest class. This locked out the average person because books when written by hand were so rare and valuable they were locked away for the experts use only. The printing press though made it far easier to store information across the human population. It allowed for literacy on a mass scale for the first time in history and with it a scientific revolution. Being able to access our ancestor’s knowledge is a power we can use to make ourselves better. Now there is no excuse to waste time modern age of the screen makes all human knowledge accessible. The same tool that can set you free will be used to enslave you.\n\nAlcoholics Anonymous requires its members to acquiesce to a higher power. Well what does that mean? What is a higher power? Is a god who has no effect on an individuals life a higher power? Is the Christian God really a fiction to distract people away from the real gods? People imagine gods to be a man in the sky. But, why have only one god you cannot see when there are gods you can see eager to be worshipped.\n\nThe modern Idea of the Christian God is very different from what people once thought gods was. Plotinus thought of the principal of the One which all of existence is originated. \"The 'concept' of the One is not, properly speaking, a concept at all, since it is never explicitly defined by Plotinus, yet it is nevertheless the foundation and grandest expression of his philosophy. Plotinus does make it clear that no words can do justice to the power of the One; even the name, 'the One,' is inadequate, for naming already implies discursive knowledge, and since discursive knowledge divides or separates its objects in order to make them intelligible, the One cannot be known through the process of discursive reasoning (Ennead VI.9.4). Knowledge of the One is achieved through the experience of its 'power' (dunamis) and its nature, which is to provide a 'foundation' (arkhe) and location (topos) for all existents (VI.9.6). The 'power' of the One is not a power in the sense of physical or even mental action; the power of the One, as Plotinus speaks of it, is to be understood as the only adequate description of the 'manifestation' of a supreme principle that, by its very nature, transcends all predication and discursive understanding. This 'power,' then, is capable of being experienced, or known, only through contemplation (theoria), or the purely intellectual 'vision' of the source of all things. The One transcends all beings, and is not itself a being, precisely because all beings owe their existence and subsistence to their eternal contemplation of the dynamic manifestation(s) of the One. The One can be said to be the 'source' of all existents only insofar as every existent naturally and (therefore) imperfectly contemplates the various aspects of the One, as they are extended throughout the cosmos, in the form of either sensible or intelligible objects or existents. The perfect contemplation of the One, however, must not be understood as a return to a primal source; for the One is not, strictly speaking, a source or a cause, but rather the eternally present possibility -- or active making-possible -- of all existence, of Being (V.2.1).\n\nHow does that view compare to the modern Baptist image of the man in the sky?\n\nI would argue there is a higher power that humans can access. What is it you ask? It is our ancestor’s works. In the technological age we not only have our countries libraries we have the worlds. We are able to read any book read (almost) any scientific journal. We are able to access media on every subject. We are able to access the work of billions of minds. We can in real time tap into the collective consciousness. Bettering yourself by using knowledge of other people’s works is gaining power. Is it not?\n\nThe collective human knowledge confined in the medium of the internet has reached a stage that it is arguably more alive than ever. Knowledge is alive and it takes the role of a symbiotic parasite to the human organism. It seeds in an individual in the hope to spread. Dawkins brilliant work on mimetics demonstrates how a good idea will survive because it is better fit to survive. Truth will survive because it can be proven. What is a parasite but life propagation through a host? We are the host and we live in a symbiotic relationship with knowledge both bettering each other. Without it there is no humanity and without us there is no propagation.\n\nKnowledge really is a god in that it is a higher power humans in the real world can interact with. I don’t live in the dark ages. I do not have to pray to a demon god. I have GOD at my fingertips.\n",
        "created_utc": 1456107186,
        "upvote_ratio": ""
    },
    {
        "title": "Fear of Doubt?",
        "author": "KingAdeto",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46x6ic/fear_of_doubt/",
        "text": "Something happened a week ago that had a deep impact on me. \n\nI was having a conversation with someone about their biggest fear. goes as follows:\n\n~~__~~\n\nSister: \"I guess my biggest fear is thinking about infinity.\"\n\nKingAdeto: \"Why?\"\n\nSister: \"When I think about infinity, I think about how insignificant we are. **This causes me to doubt and question God. I know you're not supposed to do that.**\"\n\nKingadeto: \"If an authority cannot withstand criticism, then that authority is not a viable authority.\"\n\n~~__~~\n\nThe text I bolded made me realize my previous mindset. A few years ago whenever I saw a click bait article titled \"Proof God doesn't Exist,\" I wanted to click it so bad. No matter how much I wanted to click it, I never did. I didn't click it due to my fear of the unknown, fear of rejection, fear of loss, and fear of meaninglessness. I didn't click it due to my fear of hell. \n\nHave any of you shared this experience? For years and years I tried to trust in a god. One day a quote came unexpectedly to me through a video. I didn't have a choice to click on it. I listened. I cracked. All that fear of the unknown was broken. The fear of the unknown became a passion for knowledge, it became a passion to think, a passion to realize that I was wrong.\n\n",
        "created_utc": 1456087515,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism and education",
        "author": "UraniumWolf_235",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46qv62/atheism_and_education/",
        "text": "Well hello there fellow redditors,\nWhat I'm about to say I think is, in a way, quite obvious but a bit uncomforting to most people on here. This has gotten a bit longer than I originally intended but I think and hope it helps clarify the point.\n\nIt's this thing that I just can't seem to get rid of the feeling that religious beliefs and scientific education are reversely proportional to each other. I'm not sure it's true but I've sure made the experience that people with a rather low grade of education are more open to misunderstand what might be empirical evidence to  higher educated people. This especially covers physics.\n\nJust recently I encountered some people who were, let's say \"very sceptical\" of nearly everything agencies like ESA or NASA publish on YouTube or their respective websites. For Example: There was this guy who was convinced the space shuttle's main tank can't be accounted for by calculations as to where it will land after it is detached. Concluding from that that there can't be something like the ISS and basically that it's all a fake. Now that just sounds even crazier now that I'm writing it here. Anyways, another user who was in space program for quite some time and I then tried to convince him that it's very well possible to calculate where the tank will land.\n\nIt took us quite some explaining though (I mainly tought him about precession and mass moment of inertia). Finally after we had answered all his questions he accepted that it is possible and thanked us for helping him understand. \n\nNow the thing I'm getting at is that it is much easier for me to look at some footage of e.g. space shuttles and say \"Yeah,it's totally logical it does that.\" rather than \"What is that stuff coming from the side of it? And why is it leaving the frame so fast? That's totally weird.\" Just for the background: I'm a senior student of mechanical engineering and am currently taking my studium generale in astronomy.\n\nSo what I realized is: If you are able to explain some things scientifically, you are at a much much lower risk of being mislead to false connections and, in the end, false accusations and assumptions. I think this also applies to religion, or beliefs in general. Just as a rainbow is surprising until you learn about refraction. \n\nDo you feel the same way? Or have you made similar encounters? Do you think belief is knowledge dependant?\n\nI'm hoping we can get a neat little discussion about this :)  ",
        "created_utc": 1455987278,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] Have any of you noticed that your Christian \"friends\" will invite you to church all the time, but they never want to do anything social? Like, they never want to actually get to know me as a person?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46lj9p/question_have_any_of_you_noticed_that_your/",
        "text": "[deleted]",
        "created_utc": 1455900776,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any studies showing that religious people are also more suggestible?",
        "author": "shortstroll",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46k8d8/are_there_any_studies_showing_that_religious/",
        "text": "My understanding is that some people are more likely to fall under hypnosis than others because they are more suggestible. Has anyone investigated this quality among religious people, especially in evangelical christians?",
        "created_utc": 1455881966,
        "upvote_ratio": ""
    },
    {
        "title": "Recently deconverted, but I have a couple of questions",
        "author": "CANT_TRUST_JIJ",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46iiqf/recently_deconverted_but_i_have_a_couple_of/",
        "text": "[removed]",
        "created_utc": 1455850152,
        "upvote_ratio": ""
    },
    {
        "title": "Wednesday night bible study",
        "author": "damattmissile",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46h67o/wednesday_night_bible_study/",
        "text": "I grew up southern baptist and started seriously doubting in my late teens and that became honest unbelief by the time I was 22. I'm now 25 and to make a long story short I have been working as a personal care assistant for a young man with mild autism for the past 1.5 years and am required by the family to bring him to church on Wednesday nights. The family believes me to be a baptist because we all went to the same church years ago and I cannot let them know of my unbelief or I'd surely be fired (I know it's illegal to fire based on religious belief but they would just make up a different reason.)\n\nSo over all this time I've become used to the biblical ear beating (or discussion as they call it) that he and I get every wednesday and am friendly with the people that go there. I don't speak up very often because I don't want to out myself as an atheist but every now and then I chime in to see how they answer a question that I know can't be answered by the Book. I wonder why I do this? I can't truly believe that it will change their minds but I just can't help but raise questions sometimes because I so fervently disagree with christianity (baptist especially.) Maybe I just want to cast a little doubt in their minds and help relieve some of their \"angry god\" anxieties or maybe I'm showing them that life is grey and not black and white.\n\nLast night they were talking about hell and I said that I really have a tough time with the concept of hell because it seems like the most unfair thing imaginable. Infinite punishment for finite wrongs some of which are quite trivial like going to hell because of premarital sex. I used their belief that everything happens according to gods will to show them that it wasn't 'us' who condemn ourselves to hell but god who does. Any set of circumstances that leads a person to sin or hell ultimately comes from god because he is the master of all. I said that since god is all powerful and all knowing and all present he knew that this form of creation would cause undue suffering of mankind (rape, murder, stravation, crib death, etc.) He knew this and would be able to accomplish his \"plan\" (using their language) without suffering if he wanted but instead chose not to.\n\nThey were talking about free will when they said that man condemns himself to hell and not god because he chose not to believe. I pointed out that it isn't really a choice and illustrated my point by saying what if you owned a business and one day a man comes in and says that I have the \"choice\" to pay him 10 percent every month or he would come burn down my business and kill me. It's not a true choice when it boils down to doing what I say or facing punishment; just like god says accept him or burn in hell. A confession signed at gunpoint is inadmissible in court because it was made under duress and the same thing goes with gods choice that he offers us. Also we don't have free will because if everything that happens is according to his will than we are just his puppets. We are just his puppets that he watches dance and suffer all in the name of his \"glory.\" I didn't say that last part out loud lol.\n\nI didn't say this at church but why does God want glory so much? Is his ego so fragile that he needs reassurance of his abilities constantly? Why would such an enlightened being be so insecure that he gets angry if he isn't told how awesome he is constantly and not just regular angry but angry enough to eternally torture you for not agknowledging him and then tell you that it's your fault? That's pretty petty to me. If that's how God is then god is a petulant child.\n\nAfter I said these things I could see them doubting their beliefs a little bit until they just fell back on the old well he's god and I'm not and who am I to question his methods and he is all good and blah blah blah. It felt good to maybe throw a monkey wrench into their worldview because I believe that world view causes a lot of suffering. Also, they didn't ask if I didn't believe they just believed that I'm \"struggling.\" So I don't know if what I did was good or even smart but I'm happy I got the words out and I hope it makes that one guy think maybe his parents aren't going to hell after all.",
        "created_utc": 1455831977,
        "upvote_ratio": ""
    },
    {
        "title": "Dealing with anger phases",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46gzv6/dealing_with_anger_phases/",
        "text": "[deleted]",
        "created_utc": 1455829873,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism = Minimal Non-theism",
        "author": "cbmgreatone",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46gozq/atheism_minimal_nontheism/",
        "text": "I've borrowed the tactic associated with this thread's title from some of the principles articulated in Richard Carrier's \"On the Historicity of Jesus.\"\n\nCarrier starts by defining what it means to defend the historicity of Jesus in a minimal way and defines that hypothesis as \"H.\" He then goes on to define minimal mythicism as simply \"not H.\" In this way he takes the onus off of himself to really forward much of a counter hypothesis, and I found his handling of setting out the terminology for the ensuing discussion very succinct and well argued.\n\nThis led me to a topic I've wrestled with for a long time: how we define \"atheism.\" One of the most persistent tactics that religious people use to superficially weaken atheist arguments is to attribute to atheism its own hypothesis. It is easier to argue for the strength of one's own hypothesis relative to another one than it is to argue for one's own hypothesis without being able to simultaneously attack their opponent's hypothesis.\n\nYou see this manifest itself in several ways. One such example are two popular memes that you'll find all over the internet. The first is used to caricaturize Christianity (how much this meme really is a caricature is very much up for debate, but I digress). It reads as follows:\n\n\"Christianity:  The belief that a cosmic Jewish zombie who was his own father can make you live forever if you symbolically eat his flesh and telepathically tell him you accept him as your master, so he can remove an evil force from your soul that is present in humanity because a rib-woman was convinced by a talking snake to eat from a magical tree...\nYeah, Christianity makes perfect sense.\"\n\nAnd then there's the one about Atheism:\n\"The belief that there was nothing and nothing happened to nothing and then nothing magically exploded for no reason creating everything and then a bunch of everything magically rearranged itself for no reason what so ever into self-replicating bits which then turned into dinosaurs.\nAtheism, makes perfect sense...\"\n\nThere's already a gigantic fallacy here. First, there are a good number of Christians for whom the above description is absolutely not unfairly characterizing their beliefs, minus the fact that they'd take umbrage with terms like \"zombie\" even when technically correct in a sense.\n\nSecond, I'm not aware of any atheist who believes anything like the account of the second meme.\n\nLastly, and perhaps most perniciously, is the idea that an atheist has any hypothesis to defend whatsoever. Why isn't it simply the case that an atheist's position is simply \"Not C?\" Or that their hypothesis has no actual content of its own other than that the Christian hypothesis is not a worthy one?\n\nWhen a Christian evaluates the strength of the claims of Hinduism for example, they have their counter hypothesis laid out already. Your explanation is wrong because my explanation is better. They aren't simply forwarding the hypothesis of \"Not H.\" They are also forwarding the hypothesis \"C.\" Thus they imagine that the only way to forward the hypothesis of \"Not H,\" is to have hypothesis \"C\" at the ready. It doesn't compute with them that when an atheist doesn't accept Christianity that it is only that they are forwarding a hypothesis of \"Not C\" and that they are not also forwarding their own hypothesis \"A.\"\n\nWhen I think of atheism as minimal non-theism, I'm saying that an atheist never has to actually render his/her own hypothesis, only to affirm that he has not accepted any available hypothesis. There are simultaneously a large number of atheists who wish to define \"atheism\" as minimal non-theism and a large number of agnostics who believe that minimal non-theism is their domain.\n\nI gravitate toward the idea that minimal non-theism constitutes atheism, but how do we begrudge agnostics for claiming the same? Moreover, how do we show them that by claiming this real estate, they unwittingly straw man our position in the same way that religious people do?\n\nTL;DR- for me being minimally non-theistic is to be an atheist, but we're in a phase of the discussion that neither Christians nor agnostics accept minimal non-theism as a definition of atheism. It derails conversation because nobody can agree on basic terminology prior to engaging in debate. What can we even do about this? Besides write long, pedantic posts on reddit?",
        "created_utc": 1455826220,
        "upvote_ratio": ""
    },
    {
        "title": "Religious cosmology",
        "author": "sillybob86",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46gnf9/religious_cosmology/",
        "text": "To illustrate the way in which I would like to approach this question.  A basic interpretative technique i was always taught was history. So for example, if a Mormon came up to me and said \"Jesus predicts mormonism in this verse\" One way I could negate that assertion is i could look through 2000 years or so of religious interpretation of _____.   In other-words, i would of bought into the concept that \"gods true interpretation\" has always been present in observable/recorded religious history.  I wouldn't of used a clearly modern and potentially secular source when I was a christian, speaking to other Christians, because the other Christians when they heard \"Secular\" turn off the mind...\n\nSO within the concept of trying to investigate this in a way that a religious person would agree with\n\nDo we have any religious  precedent for the flat earthers, geocentrism, etc ?  Did clement say \"Thus we understand that god made the earth flat, as a plate\" I know with Galileo their was an issue, but telling a Presbyterian \"ah-ha, see the church(Catholic) taught some wrong cosmology\" would be a waste because ya know- the whole protestant vs catholic thingy. But a Presbyterian would respect the early church fathers,  Calvin, reformers, puritans, etc.\n\nI of course see some clearly anti- religious pages that propose the bible teaches - flat earth, and or an impenetrable dome covering the earth, etc.. but  showing that to a christian would shut their mind off.\n\nModern scholars of course know that the books of Moses had many authors and so forth, but tell that to the average christian and congrats, they wont listen.",
        "created_utc": 1455825691,
        "upvote_ratio": ""
    },
    {
        "title": "No death in Genesis? Unsustainable.",
        "author": "Rationalizationer",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46fiuz/no_death_in_genesis_unsustainable/",
        "text": "I had a thought today, I'm sure it's not an original thought, others have surely thought this too, but here it is.\n\nIf the God of Genesis truly created an earth without death, how would this be sustainable if Adam and Eve never \"sinned\"?  Would this go on forever?  Billions upon billions of people living with innumerable animals and plants on earth forever, until there physically would be no more room.\n\nWhat would be food once all plant life is eaten?  Why were plants required for food initially?  Why was any food required for beings that could not die?  \n\nI know this isn't a \"checkmate creationists\" thought, and I also know the Genesis story isn't thought of as fact by most people here.  It's just the more I think about it, the more it should be obvious that the Genesis story is myth, not fact, and I felt like sharing.  ",
        "created_utc": 1455812575,
        "upvote_ratio": ""
    },
    {
        "title": "My weekly atheist podcast covers many subjects and sometimes its even good. Not this time, but sometimes.",
        "author": "Triplej840",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46d3o1/my_weekly_atheist_podcast_covers_many_subjects/",
        "text": "[removed]",
        "created_utc": 1455771280,
        "upvote_ratio": ""
    },
    {
        "title": "Is believing in determinism/no free will while teaching personal responsibility hypocritical?",
        "author": "AverageMidget",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46alt5/is_believing_in_determinismno_free_will_while/",
        "text": "Of a materialistic worldview, we are all products of our environment. Carried out to its logical conclusion, no one can be held accountable for their actions, because they are simply a culmination of countless experiences now acting according to what it's learned. My issue is, is it then hypocritical to teach people that we are personally responsible for our actions? While teaching personal responsibilty will indefinitely lead to positive results, is it still factually incorrect and hypocritical to teach/believe? Is it comparable to teaching the existence of God in order to reinforce moral behavior?",
        "created_utc": 1455738795,
        "upvote_ratio": ""
    },
    {
        "title": "Questions of Interpretation: The Bible and the American constitution.",
        "author": "drkesi88",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/46a83t/questions_of_interpretation_the_bible_and_the/",
        "text": "[removed]",
        "created_utc": 1455734718,
        "upvote_ratio": ""
    },
    {
        "title": "A mockery in progress",
        "author": "studentech",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/469yaf/a_mockery_in_progress/",
        "text": "[removed]",
        "created_utc": 1455731596,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with people saying that atheists are dishonest, insane, or irrational?",
        "author": "William_1",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/469olj/how_do_you_deal_with_people_saying_that_atheists/",
        "text": "I see this come up once in a while on internet forums, and it happened again today. I find it insulting, albeit not as insulting as I might find it if I thought it was a plausible accusation.\n\nRelatedly, I've seen people on Facebook claim that atheists are automatically immoral because they don't obey God. That one does actually get me angry, because they are impugning my moral status just because I don't believe in God.\n\nYou don't usually see this sort of thing from educated people, it's mostly laymen on the internet and presuppositionalists.",
        "created_utc": 1455728625,
        "upvote_ratio": ""
    }
]