[
    {
        "title": "Small victory celebration",
        "author": "pinkiepickles",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7tlasz/small_victory_celebration/",
        "text": "I was driving with my husband last night and saw a FFRF billboard down the road from my house. I live in Georgia so it’s a fairly religious and fairly conservative area. I was just so excited to see it I had to share. I’ve always felt that Georgia (especially the Metro Atlanta area) was just a little more forward thinking than other southern states. I’m so glad that we are headed in the right direction. Have you ever seen a FFRF billboard in an unexpected area?",
        "created_utc": 1517157970,
        "upvote_ratio": ""
    },
    {
        "title": "[/r/ Atheism permanently banned me for this post, their user base got destroyed, maybe you guys are smarter] I'm an atheist but after years of research I'm starting to think we need religion to sedate the masses. Let's have a discussion.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7tkag6/r_atheism_permanently_banned_me_for_this_post/",
        "text": "[removed]",
        "created_utc": 1517146912,
        "upvote_ratio": ""
    },
    {
        "title": "If you did believe in prayer, what would you ask of 'god'? (x-post from r/AtheistDefenseLeague)",
        "author": "stockboy-14604",
        "url": "https://www.reddit.com/r/AtheistDefenseLeague/comments/7sps8d/if_you_did_believe_in_prayer_what_would_you_ask/",
        "text": "",
        "created_utc": 1517087276,
        "upvote_ratio": ""
    },
    {
        "title": "Xtianity: Alive and well in America?",
        "author": "BrautanGud",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7t6bbd/xtianity_alive_and_well_in_america/",
        "text": "The libertarian \"Patriot Post\" ran an article that seemed to refuse the acceptance of America's continuing secularization. They purport that those leaving the congregations were \"lukewarm\" Xtians in the first place. \n\n\"Again, those leaving our churches are either not that religious anyway, or they’re growing weary of hearing Democrat Party talking points during Sunday services.\"\n\nThe writer suggests politicizing church services has alienated their members. In reality the role of science/technology in our society has done more to push believers to question mythology and have a higher degree of confidence in reason and rational thought.\n\nhttps://patriotpost.us/articles/53724-christianity-is-alive-and-well-in-america\n",
        "created_utc": 1516989540,
        "upvote_ratio": ""
    },
    {
        "title": "How long did it take you to finally stop believing/stop feeling the fear of hell?",
        "author": "Kapitaczec",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7t2tcg/how_long_did_it_take_you_to_finally_stop/",
        "text": "I think im on the path to losing faith, I'm still scared though i'm wrong and will burn. I'm wondering if this feeling will ever go away?  I don't know if God is real, I want to believe because of hope but also because i'm scared if I'm wrong I will go to hell. I've been living a life recently that would send me to hell, I've experienced a lot in my life, I have major depression, social anxiety and all so I act in a way that will help me improve which I feel requires me to be selfish and seek pleasure. I've been happier this way, I've been happier when I don't worry about hell but there's still a part of me that thinks im a bad person especially because I've done things that even non christians think is wrong such as stealing(as in going to a self checkout, it doesn't work so I say fuck it and walk out LOL)  or sleeping with prostitutes or using drugs. Basically doing things for myself and putting myself before others in most situations because I've tried so hard to do the opposite and I get taken advantage of or not taken seriously. But then again, although I feel like I need help, I know the Christian God if I listened to most American Christians would send me to hell for feeling trapped like this which makes me fear hell but also makes me question why God would send me to eternal suffering for things I do because I feel like I HAVE to live in an almost wreckless and selfish way in order to make it through life because there's just not enough evidence to make me think there's hope at the end. \n\nI don't know if what i'm saying right now makes sense or if i'm typing all over the place because I don't even understand my own thought process at the moment but to put it shortly I wanted to see if I went down this path if I'd ever stop believing to a point where I don't feel like i'm a bad person. ",
        "created_utc": 1516948490,
        "upvote_ratio": ""
    },
    {
        "title": "21 years old, and recently rediscovered my faith after having an atheist teenage phase. I like listening and reading Richard Dawkins and Christopher Hitchens tho.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7szoi3/21_years_old_and_recently_rediscovered_my_faith/",
        "text": "[deleted]",
        "created_utc": 1516917032,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the idiot savant representation of atheists so popular on TV?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7srwge/why_is_the_idiot_savant_representation_of/",
        "text": "[deleted]",
        "created_utc": 1516840267,
        "upvote_ratio": ""
    },
    {
        "title": "Robot Heaven - Saturday Morning Breakfast Cereal",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7sowfa/robot_heaven_saturday_morning_breakfast_cereal/",
        "text": "[removed]",
        "created_utc": 1516816390,
        "upvote_ratio": ""
    },
    {
        "title": "Edward Feser (Catholic) debates Arif Ahmed (Atheist) on evidence for God",
        "author": "Dice08",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7sl5fu/edward_feser_catholic_debates_arif_ahmed_atheist/",
        "text": "[removed]",
        "created_utc": 1516773534,
        "upvote_ratio": ""
    },
    {
        "title": "Is this a fair statement",
        "author": "uw-dummy",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7sjzcf/is_this_a_fair_statement/",
        "text": "[removed]",
        "created_utc": 1516761352,
        "upvote_ratio": ""
    },
    {
        "title": "It bothers me alot that we dont know what happened before the big bang",
        "author": "uw-dummy",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7sfswf/it_bothers_me_alot_that_we_dont_know_what/",
        "text": "i heard a quote ages ago that said that being an athetit requires alot of faith, and it does, it requires immense faith in the unknown and science.\n\nbut anyway .... :c. are there any scientific explanations for what happened before the big bang?\n\nother than god of the gaps explanation SOMEONE please easy my brain PLEASE.",
        "created_utc": 1516726794,
        "upvote_ratio": ""
    },
    {
        "title": "Spartacus died in 71 BC and we know he was a real person",
        "author": "moon-worshiper",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7s7px1/spartacus_died_in_71_bc_and_we_know_he_was_a_real/",
        "text": "[removed]",
        "created_utc": 1516645158,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think a moral AI is programmable? If so, what does that say about us humans?",
        "author": "trytrytired",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7s45ab/do_you_think_a_moral_ai_is_programmable_if_so/",
        "text": "[removed]",
        "created_utc": 1516605394,
        "upvote_ratio": ""
    },
    {
        "title": "Not an Atheist, and Afraid of Death, Believing in God because I'm terrified of dying and there being no justice after this life.",
        "author": "BernieSandersgirl101",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7rz9pu/not_an_atheist_and_afraid_of_death_believing_in/",
        "text": "You guys are brave. You see death and say \"You know what, there's no life after death, and we have to accept that\", while we religious people shrink in fear of death and hope and believe in an afterlife.  I'm scared of lying in a grave, for forever, I know that it will be just like sleeping, but imagining it to be forever is frightening even though in my logical side, I know that I won't even be aware of it. I'm also scared of the unjust fact that good people live terrible lives while bad people prosper, and the thought of an afterlife where good and bad people get what they deserve comforts me.\n\nCan anyone help me out with this one?!",
        "created_utc": 1516557988,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many religious people (especially Christians and Muslims) mock you for being a virgin or intentionally abstaining? How can they attack you for this while claiming to be devout in their religion (which often forbids sex outside marriage esp fornication and encourages virginity)?",
        "author": "QuakerPlayer",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7rxwth/why_do_so_many_religious_people_especially/",
        "text": "Because its vulgar, I'll post a link.\n\nhttps://www.reddit.com/r/exchristian/comments/7ru4x5/doesnt_it_piss_you_off_when_christians_mock_you/\n\nI cannot understand this double standard. Why do so many religious people-especially Christians of the current generation and many Muslims from the MidEast- hate gays,people dabbling in the occult, etc yet they always find someway to justify sinful sex (especially fornication), even attacking others for being virgins or intentionally choosing abstinence?\n\nI mean its just makes my head explode that ISIS goes around raping little girls including Muslim females despite the fact the Quran forbids rape as one of the worst sins (and one worthy of being executed)! I could never understand how Christians can be so self-righteous despite the fact they're doing sexual acts that will prevent them from entering the Kingdom of Heaven according to the New Testament and even get stoned to death as commanded in the Old Testament's Deuteronomy and Leviticus?!\n\nCan anyone explain this insane troll logic religious people have when it comes to sex (in particular the act of fornication) and why they love to bash virgins and chaste people (despite the fact their religions praises such attitudes to sexuality)?",
        "created_utc": 1516544370,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists, what do you personally believe explains the rise of Christianity? Conspiracy? Mass hallucination?",
        "author": "DavidvonR",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7rwg0z/atheists_what_do_you_personally_believe_explains/",
        "text": "Was it a conspiracy on the part of the disciples?\nLegends that grew over time?\nMass hallucination?\nWere the disciples fooled by an impostor or evil twin?\nMaybe Jesus didn't die?\n\nWhat do you find compelling?",
        "created_utc": 1516519942,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists, if the resurrection of Jesus hypothetically did happen, what historical evidence should we expect to find?",
        "author": "DavidvonR",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7rvgzk/atheists_if_the_resurrection_of_jesus/",
        "text": "Hypothetically, the resurrection, if it did happen, was a public event for which there were allegedly eyewitnesses, right? And they would have left a historical record of it, right? \n\nWhat would we expect to find if it actually did happen? And how does this compare to the evidence that we do have? ",
        "created_utc": 1516506623,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think this song hits home with you in regards of atheism?",
        "author": "Dobokdude",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7r69tx/do_you_think_this_song_hits_home_with_you_in/",
        "text": "[removed]",
        "created_utc": 1516240337,
        "upvote_ratio": ""
    },
    {
        "title": "Neutral texts on Atheism vs Theism",
        "author": "dthangel",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7r3obk/neutral_texts_on_atheism_vs_theism/",
        "text": "To make a long story short, I live in a \"mixed\" household in the fact that I'm an atheist, and my wife is a sunday school teacher. We made an agreement when we had children, that they would be raised \"in religion\" but if they ever chose to step away after the age of 13, they'd be allowed. I came to atheism through self discovery in my younger years, and I believe it's best for people to be exposed to both \"sides\" of an issue to determine their own beliefs. I didn't want to \"indoctrinate\" my children, regardless of my own personal beliefs. \n\nThat being said, my eldest son has now asked to step away from the church, which is his right, however this is a transition, since it will impact his social circle. In my desire to ensure he doesn't snap too hard to the other side, and become \"one of those atheist\" that are intolerant, I'm looking for some assistance.\n\nDoes anyone have any recommendations on books, articles, blogs, videos that approach the atheism/theism debate or transition from a balanced approach. I absolutely don't want to shove \"god is not real\" down his throat, but want to help him understand his own questions, so that he can better come to his personal answers. I want to temper anything that might make him intolerant of his theistic friends/relatives. \n\nWhile I plan to help him every step of the way, having additional support material would be helpful, so that he's not limited to the knowledge and understanding provided by our family bubble.\n\n",
        "created_utc": 1516218378,
        "upvote_ratio": ""
    },
    {
        "title": "The true demographic of human nature that holds a fixation of our obsessive desire for knowledge",
        "author": "tylertrinity",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7r383h/the_true_demographic_of_human_nature_that_holds_a/",
        "text": "[removed]",
        "created_utc": 1516214945,
        "upvote_ratio": ""
    },
    {
        "title": "How do you label arguments for the existence of God as weak?",
        "author": "Curious_Pouya",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7r2jt7/how_do_you_label_arguments_for_the_existence_of/",
        "text": "Hi, I once asked another question on this subreddit and got very good answers which helped my understanding. So here is this question:\nI have never seen any compelling argument for the existence of God. There is always one or more premises in them that is not necessarily true.  But I always hear that atheists say arguments for existence of God are bad, weak and/or even ridiculous. I wonder how you come to such conclusions?\n\np.s.: I am an agnostic atheist myself.",
        "created_utc": 1516209650,
        "upvote_ratio": ""
    },
    {
        "title": "What is your take on gnostic atheism?",
        "author": "Dobokdude",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7qy05h/what_is_your_take_on_gnostic_atheism/",
        "text": "Hi everyone! So before reading this post you may want to look at this past one:https://www.reddit.com/r/TrueAtheism/comments/7g8y5c/what_is_your_take_regarding_dealing_with_ones/\n\n\n\n\nSo as an agnostic(or agnostic atheist, whatever I don't care for semantics), I find that since I'm as agnostic as you can get I find myself opposed to any gnostic atheism or antitheism. \n\n\n\n\nThe reasons as to why is similar to religion. The promotion of absolute certainty and dogma that requires thinking within what I call a \"small box.\"\n\n\n\n\nYes technically there's no evidence of Gods or an afterlife. But such things might exist. When I assert this point a common response is \"why aren't you agnostic towards magic pink unicorns?\" Good question. Here's my answer:\n\n\n\n\nThe reason why my agnosticism doesn't apply to unicorns or the Flying Spaghetti Monster and so on is because IT'S A BASELESS ASSUMPTION. As an agnostic, I have no certainty regarding whether or not there are gods or spirits. I lack belief, but only due to my belief that our knowledge is not at/might never be at the point to determine whether such things exist.\n\n\n\nGoing back to the baseless assumption point let's look at the definition of supernatural:\n\n\n\n&gt;(of a manifestation or event)attributed to some force beyond scientific understanding or the laws of nature.\n\n\n\nThis is the problem with saying supernatural things do or do not exist(this is by no means an excuse to just assume that their are and put all your eggs in one basket). The very nature of supernatural things(if they exist) would mean they aren't observable via how we observe various phenomenons like an ecosystem or solar rotation.\n\n\n\nSo while I acknowledge current evidence linking consciousness depending heavily entirely on the brain, I don't rule out the possibilities of souls. Such things existing is one thing, but how they operate via what mechanisms and such is an entirely different matter.\n\n\n\nI'm not agnostic tiwards Yahweh, Allah, Ra, Krisnah or Thor because they not only are assumptions that a deity certainly exist,  but assume various things about that deity( why it created man, what upsets it, etc). \n\n\n\n\n\nThe basic idea of something beyond this plain of existence whatever it may be, I'm agnostic to that and that only and both the religious and gnostic atheists claiming certainty I find to be both mistaken.\n\n\n\n\nDo share your thoughts, this is meant to start civil discussion, this is NOT trolling.",
        "created_utc": 1516158243,
        "upvote_ratio": ""
    },
    {
        "title": "Sorry more Presuppositionists talk.",
        "author": "plasticpony256",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7qhkf3/sorry_more_presuppositionists_talk/",
        "text": "I don't know if I'm allowed to link a previous post on PA so I didn't but I think you can find it via my profile.\n\nPreviously I was looking for a way to combat the claim, often made by PA's, that atheists can not justify or validate the use of logic or reason without pressuposing an imaginary friend. And I would like to report to y'all a few of my discoveries. \n\nLogic is, for the most part, simply mathematics. It's universally accepted that 2+2=4. However PA would like to impress upon us that the answer 4 can not be fully understood, appreciated and not hold any value of truth unless the truth of 4 is revealed to us by an imaginary friend, which we apparently know already exists, but can not truly \"know\" until we are reawakened by the imaginary magic of this imaginary friend. (Got that?) Calculating mathematics is as innate to our species as swimming is to fish. \n\nSo in the most rudimentary way I can validate my use of logic by simply calculating the total number of Pressup's trolling an atheist themed Facebook page. \n\nI'm no expert on evolution but...\n\nHuman behavior is founded, in a few ways but not all, in evolution. Most of our behaviors are focused on survival. One particular behavior, religious belief, appears to be a byproduct of other innate traits, i.e. agency detection, pattern recognition, and intentionality. While yes there are a great many factors, not just evolution, that influence our behavior. It is compelling to speculate that religiosity might very well be of evolutionary origin. \n\nThe word presuppose is interchangeable with the words; :require, necessitate, imply, entail, mean, involve, assume and :presume, take it for granted, take it as read, suppose, surmise, think, accept, consider. \nSo when a PA asserts that an atheist must presuppose a god; you can consider that, think about it, suppose it might be possible, or surmise what's being implied. Presuppose is not, however, interchangeable with the word fact. The PA doesn't claim that his imaginary friend does in fact exist and because he doesn't make that claim you don't have to use his definition of pressupose, i.e., require, necessitate, accept or take it for granted. \n\nPA's like to claim that our senses are not reliable and what we \"know\" about the world could be mistaken and because of the unreliability we can not, also, be certain of what we know. While this is partially true it is also mostly false. Our senses are pretty dumb. In fact our senses only sense the world around us. They don't do any thinking, they don't interpret any information, all they do is collect data and our brains do all the rest. So how then is it possible for, practically, every human being to know that the color red is red. Surely if our visual senses are lying to us (atheists) then color would be arbitrary and everyone would be seeing a different colour than red. This, again, is made possible by evolution. So how do we know that a red, hot stove is actually red and hot. First we see the red glow, of the stove and then we feel, with our skin, its heat. Since we possess an innate understanding of heat and an innate understanding of what something looks like when it's really hot, red hot, we validate our senses with intuitive knowledge. And this is one of the most rudimentary methods to validate our sensory experience. But the PA goes onto say, how can you be certain of your experience with the red hot stove. Well then touch the god-damn stove. Now, except for masochists, you're experiencing pain. And if pain is not enough of a validation then look at your charred fingers. At the beginning of this, very long, paragraph I put the word know in quotations this is because the words know and knowledge have different definitions than what are commonly used.\n\nTo the PA knowledge is equivalent to the phrase \"the word of god\" which can be further interchanged with this phrase, \"knowledge is god and god is knowledge\"\nSo John 1 1-3 can be literally translated as, \"In the beginning there was knowledge and the knowledge was with god.\" Love can exchanged with knowledge also. Because can you really love someone if you're completely ignorant of their existence. So when the PA questions your certainty of knowledge what he really is imparting is that you can't be certain of any knowledge except the knowledge revealed to you by his god. And as I said earlier, that their claim is partially true about the certainty of knowledge, no one can be absolutely certain of any knowledge. \n\nThat's all for now. \n",
        "created_utc": 1515993715,
        "upvote_ratio": ""
    },
    {
        "title": "I think we make a mistake telling creationists it takes \"Millions of Years\"",
        "author": "stockboy-14604",
        "url": "https://www.reddit.com/r/AtheistDefenseLeague/comments/7penw0/i_think_we_make_a_mistake_telling_creationists_it/",
        "text": "",
        "created_utc": 1515863904,
        "upvote_ratio": ""
    },
    {
        "title": "You shouldn't need faith to see god.",
        "author": "stockboy-14604",
        "url": "https://www.reddit.com/r/AtheistDefenseLeague/comments/7pkpx4/you_shouldnt_need_faith_to_see_god/",
        "text": "",
        "created_utc": 1515854961,
        "upvote_ratio": ""
    },
    {
        "title": "As an agnostic, I have created this vague description of what a god (in the creator sense) would be like. Thoughts?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7pitg0/as_an_agnostic_i_have_created_this_vague/",
        "text": "[deleted]",
        "created_utc": 1515619031,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for an \"online church\"",
        "author": "jtown8673877158",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ovlup/looking_for_an_online_church/",
        "text": "(crossposted in a few other subs)\n\nHello,\n\nI'm looking for an \"online church\" of sorts.  One of my plans for 2018 was going to be to join a local church near where I live, because I think it's one of the pillars of life and civilization that shouldn't be neglected.  However, due to a few (private) reasons, I decided I just don't want to join an in-person one right now.  So I'd like to find an online, anonymous church of sorts.\n\nHowever, I'm not Christian; I don't believe the things about Jesus's divinity and the trinity and how sin works that you're supposed to believe.  I don't want to \"be converted\".  But I do think being part of a church is important.  Maybe that means the \"church\" I find needs to be one that isn't Christian, but instead Unitarian Universalist or Secular Humanist or something else.  I don't want to intrude on places where actual Christians go and expect others to be Christian or at least intentionally on a path of becoming Christian.\n\nSo, I'm looking for recommendations for online churches or church-like organizations.\n\nThank you in advance for any leads, and a (continued) happy new year to anyone reading this.",
        "created_utc": 1515380768,
        "upvote_ratio": ""
    },
    {
        "title": "My (not?) interesting story",
        "author": "ViensDuTrys",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7otlty/my_not_interesting_story/",
        "text": "hey. I was raised in religious family, we have been going to church on almost every Sunday, there were prayers in our family during Christmas and so on.. But I never really believed in god. When i started becoming a full minded person, I mean in my 15-16’s, I was really interested in science, in astronomy, human biology and many more things. I fully unterstood that humans and our world and everything is pure matter, which we can measure, picture and in which we can find a lot of physical constants. I became to a point, where I just could’t believe in any of the gods which we have here on our planet. Now I’m 24 years old and I recently had a discussion with my mother about all these religion related things. She told me that she is disappointed in that concern, that i don’t have any faith and that she hopes that I will overthink my words once again. But it goes everytime like this with religious people. Or is it just for me? They just seem to not understand that there are people who have absolutely other beliefs. Why is it so hard for them to understand non-religious person? I mean, even if I have absolutely no understanding of how could I believe in such a thing as god, I still can understand why other people can do this. And I hope the same feedback from them. My mother took one example, that in my opinion, is absolutely nonsense. She told me: “if I become sick and there would be no treatment for me, would even then wouldn’t pray god for help?” and my answer was something like this: “no, because I can NOT do that. Just like you could NOT develop an app, because you do not know how to do it. In the same way I don’t know how to believe in god, it’s just sounds so unnatural for me”. Then she told me nothing. I didn’t knew how to react and I also said nothing, perhaps I didn’t wanted to break a conflict. It is just a brainstorm post, I don’t ask you guys for any tips or anything, I just wanted to tell it to somebody and maybe hear your opinion if I done it correctly or not.. Idk, I’m new in reddit, I saw these brainstorm posts in other subreddits, I don’t know if it’s a common thing here.",
        "created_utc": 1515361517,
        "upvote_ratio": ""
    },
    {
        "title": "What is the point of anything in life?",
        "author": "SteelMicrowave",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7oeoy6/what_is_the_point_of_anything_in_life/",
        "text": "[removed]",
        "created_utc": 1515189663,
        "upvote_ratio": ""
    },
    {
        "title": "Should I expect a lawsuit if I refuse to provide print services to religious organizations?",
        "author": "LordMonichromicorn",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7odjck/should_i_expect_a_lawsuit_if_i_refuse_to_provide/",
        "text": "I manage a print company. Every day we have to print religious materials. Some of these materials use false promises, fear, and shame as tools for promotion, money collection, and recruitment. I regret the part I play in propagating these dishonest organizations.\n\nIn the coming months I am starting my own print company. If my company policy is to refuse to print religious materials of any kind, should I expect a lawsuit?\n\nI live in the southern United States in a metropolitan area.",
        "created_utc": 1515180026,
        "upvote_ratio": ""
    },
    {
        "title": "religion and mental health",
        "author": "AJPML",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ocg65/religion_and_mental_health/",
        "text": "[removed]",
        "created_utc": 1515171013,
        "upvote_ratio": ""
    },
    {
        "title": "Irrational Thoughts After Atheism",
        "author": "montebious",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7obq9m/irrational_thoughts_after_atheism/",
        "text": "God I hope this makes sense. \n\nAfter a few months of a concrete feeling of *I’m an atheist*, I often catch myself thinking rather irrationally. I remember watching a debate or something awhile ago, to which a Creationist tries to contradict the Atheist by asking him how he copes with crises or hopelessness. This always bugged me. I could usually debate the Creationist in my head fairly quick, but I really didn’t have a firm response. I felt hypocritical in many respects.\n\nHopelessness is something I feel is particularly difficult to confront now, be it family death, studying for an exam, being sick. I find myself crossing my fingers or pleading with “The Universe” to favor a positive outcome. Who am I talking to? The universe. Is the universe... a *U*niverse (a higher power)? Is the universe God? I feel as though religion is stuck in my brain like a parasite. God is fiction, though I now pray to time, or, am I simply pleading with *statistics*,.. though, again, who the fuck am I banking on? I concluded that this is irrational. And fuck all if this proves Christianity, but I sure as hell don’t have a reasonable way to deal with this. Yeah, I suppose you can explain this easily with biology/neurology... but his doesn’t give me non-unsettling feeling of how to go about my life.\n\nConsidering these events are so unexpected. Family death is another considerable event. Since atheism a close family member had died. I remember confronting myself while also feeling stubborn. There is no Heaven, so stop telling his dead body to rest in peace! He is atoms that are now in different places, different formations, and lifeless. What the fuck, okay? What is he then, just existing now as “thoughts” in the minds of people that will eventually die as well? Yes. Then why am I asking the universe that he is doing okay?\n\nMeanwhile, I find myself rather irrational when dealing with luck. This doesn’t bother me, since I know it’s fake, but it’s fun in a way to rely on. Taking an exam, for example, when I am completely, utterly fucked. I cross my fingers, toes, I wear lucky socks, I jokingly pray to whoever that the exams went missing so we don’t have to take them. This bothered me initially, but I can most easily explain it as it is “fun,” which is still very much irrational. \n\nWhat is your experience? Apologies if this is poorly composed.",
        "created_utc": 1515164734,
        "upvote_ratio": ""
    },
    {
        "title": "After losing religion, what did you find was the meaning of life? What do you guys live for and use to motivate you to try?",
        "author": "Fleetfox17",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7o7iq3/after_losing_religion_what_did_you_find_was_the/",
        "text": "Hey everyone, hoping this will spur some good discussion and hopefully give me some advice if not help me out. I probably have a  somewhat similar story to lots of people on here. Grew up as a son of immigrants to a very religious mother and Catholic myself. I always went to Church and Sunday School and prayed and read my Bible every night like a good boy, religion and God was my reason for being. I wasn't ultra religious, but God was always in the back of my mind as my reason for existence, and my reason for getting up in the morning and slogging through the boredom and daily annoyances that life can bring.\n\nAfter I went away to college I lost religion sometime during my Sophomore year. I, like probably most here realized religion was just a failed explanation for humanities reason to exist, but for a long time it did a good job for me and for many other people, giving them a reason to live. After graduating college I've struggled mightily with finding a reason to keep grinding through life. Sometimes I wish I would have never learned about Science and could go back to believing in God but I know that can't be undone.\n\nSo my question to you guys is what drives you to succeed and push through the hard times of life now that you can't rely on religion? I'm assuming it is a somewhat common struggle, to find meaning and worth in the modern world. Just wondering if you guys could give some pointers. Thanks to anyone reading and appreciate any comments!",
        "created_utc": 1515114404,
        "upvote_ratio": ""
    },
    {
        "title": "Do you want an atheist or secular state?",
        "author": "BeatriceBernardo",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7o43w7/do_you_want_an_atheist_or_secular_state/",
        "text": "I was reading https://www.reddit.com/r/TrueAtheism/comments/7nwcky/does_anyone_experience_guilt_over_the_political/ when I learned that there's a difference between [state atheism](https://en.wikipedia.org/wiki/State_atheism) and a  [secular state](https://en.wikipedia.org/wiki/Secular_state)\n\nI'm curious as to know:\n\n1. which government do your prefer,\n\n2. why?\n\n3. how would you try to convince someone else to prefer your preference?\n\n******************\n\nedit: Wow, the answer is surprisingly homogeneous. Interesting.\n\n\n\n\n",
        "created_utc": 1515083484,
        "upvote_ratio": ""
    },
    {
        "title": "A problem with the atheist community",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7nyiqx/a_problem_with_the_atheist_community/",
        "text": "[deleted]",
        "created_utc": 1515020505,
        "upvote_ratio": ""
    },
    {
        "title": "Do any of you have interests/education/professional experience with theology? From Sensus Deitatis to Presuppositionalism, fun for all!",
        "author": "HydeParkerPen",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7nwi2n/do_any_of_you_have_interestseducationprofessional/",
        "text": "[removed]",
        "created_utc": 1515003622,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone experience guilt over the political associations of atheism? (USSR, Poland, etc.)",
        "author": "whitewall1861",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7nwcky/does_anyone_experience_guilt_over_the_political/",
        "text": "Hello,\n\nI'm from a secular, non-religious background and I've never had religion imposed on me. I am from Europe but have spent time in the US and find its religious culture never not-interesting. I'm not really sure where I stand at the moment. I've read up a lot on comparative religion, biblical archaeology, evolution, cosmology and the usual stuff associated with theism-to-atheism transitions. I would call myself an atheist in public however a number of things have prevented me from doing so. Yes definitions should stand alone apart from their associations, but I'm interested if others have had similar experiences.\n\nThrough my interest in history, I have read a lot on the anti-religious persecutions of the Communist states of the 20th century. The USSR is the most obvious - not just in the Stalin period but throughout its entire existence, policies of [promoting atheism and trying to eliminate religious belief](https://en.wikipedia.org/wiki/Soviet_anti-religious_legislation), right down to effectively banning Christmas in favour of New Year celebrations. In Poland, atheism is now permanently associated with the communist dictatorship. Pope John Paul II is revered as their greatest national hero and he is credited with leading the collapse of the regime in Poland and other states. This doesn't excuse his or other Catholic bishops' roles in the child abuse scandal, for example, but in Poland and Eastern Europe at that time, a moral choice between supporting the Catholic Church or supporting atheistic Marxism should be obvious.\n\nRight now, the main opposition left-wing/progressive party in my country is led by a group of far-left socialists and lifelong communist fellow travellers. Whilst I do not think they would initiate anti-religious persecutions (they are all sympathisers with the Islamic Republic of Iran, for one thing), they are all atheists themselves. So I find myself agreeming more with and hoping for the conservative parties, led mainly by Christians, to win. This adds to a sense of anxiety that we are on the \"wrong side of history\". If Martin Luther King's \"arc of the moral universe\" does bend towards justice, I fear atheism and secularism have more often been on the side of injustice on a large scale.\n\nDoes anyone else get this kind of uncertainty? Are any of you from former communist states and feel a kind of guilt-by-association or a desire not to discuss God or religion with believers as a result?\n\nThank you for your replies. I post this in a constructive spirit and will try to reply to as many responses as I can.\n",
        "created_utc": 1515002357,
        "upvote_ratio": ""
    },
    {
        "title": "How well known were the biblical stories of creation and prophets during Muhammad’s time?",
        "author": "jesushatedbacon",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7numed/how_well_known_were_the_biblical_stories_of/",
        "text": "Good morning /r/trueatheism.\n\nI was having a discussion with a friend and they raised a point I had not previously thought about. He asked “How is it possible that an illiterate person was able to remember the biblical stories with such accuracy?”\n\nIs there any text or video I can be referred to regarding this topic? I tried googling but nothing really relevant came up. Was Muhammad actually illiterate? Some biblical stories are mentioned in the Quran with great details that I would think an illiterate person would have a hard time remembering. \n\nI really had no answer to that question so any link would help to find out more on this.\n\nThanks my dudes",
        "created_utc": 1514986023,
        "upvote_ratio": ""
    },
    {
        "title": "I don't know how to react when a friend asks for prayers.",
        "author": "NoeJose",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7nic74/i_dont_know_how_to_react_when_a_friend_asks_for/",
        "text": "A friend who I've known since before preschool is in critical condition after a suicide attempt. I'm heartbroken for his family and want to offer my support, but I am an atheist. I'm not at all spiritual, I believe no higher power exists, and I certainly don't pray. Obviously I am not going to say that to my friend's parents when they are only hoping their son will pull through, God or no. I'm really not even sure what I'm asking, but any advice would be appreciated.",
        "created_utc": 1514848012,
        "upvote_ratio": ""
    },
    {
        "title": "What can we do to stop the negative image of atheism",
        "author": "gorypineapple",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ni0wi/what_can_we_do_to_stop_the_negative_image_of/",
        "text": "[removed]",
        "created_utc": 1514844785,
        "upvote_ratio": ""
    },
    {
        "title": "What is love?",
        "author": "ALONE2LONG",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ngnbe/what_is_love/",
        "text": "Baby don't hurt me\n\nDon't hurt me\n\nNo more...\n\nNow that I have stolen what would have been the top comment to any subreddit if asked that question, lets get serious.\n\n&amp;nbsp;\n\nWhen I a was a believer it was a gift from god. Along with all other metaphysical notions like universal truths, justice,goodness, beauty, right/wrong, etc. Those along with consciousness and whatever amount of free will a person had were all either attributes of god, his virtues, or a characteristic of our soul.\n\n&amp;nbsp;\n\nWithout a creator or some other ultimate existence outside the physical realm, all these things we aspire to and dream up as the goals and values of human life are just bullshit in our brain. There is no \"love\" that humans participate in that isn't just a story in our head that we collectively tell ourselves and each other is a real thing. There is no beauty beyond what we impulsively find attractive. No right or wrong beyond what we have agreed to in our communities. \n\n&amp;nbsp;\n\nSo why do search and strive from such lofty goals? Why do we seek love or to do good?  What are those things even? Are we just biologically compelled to see these things without reason? Do we have a choice ? Why are we so miserable when we don't seek or find love? Why do we feel bad about doing things that are wrong?\n\n&amp;nbsp;\n\nBig spiral off there, so back to the original question.  Without there being a higher truth or source or standard of good in the universe, what is love? and how do you cope with the fact that our highest driving motivation is likely just dopamine, norepinephrine, and phenylethylamine, and not some mystical magical experience. It just seems bleak and forced.",
        "created_utc": 1514831341,
        "upvote_ratio": ""
    },
    {
        "title": "A Non-Religious Argument For the Situational Morality Of Killing",
        "author": "NC71",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7nb7yi/a_nonreligious_argument_for_the_situational/",
        "text": "[removed]",
        "created_utc": 1514756701,
        "upvote_ratio": ""
    },
    {
        "title": "A Study of Spirituality, Mindfulness, and Humor and How it Relates to Your Work",
        "author": "DocHolidayPhD",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7nasno/a_study_of_spirituality_mindfulness_and_humor_and/",
        "text": "[removed]",
        "created_utc": 1514752204,
        "upvote_ratio": ""
    },
    {
        "title": "If religion is really a symptom of poor education and relies entirely on child indoctrination, how do you explain what's going on in China right now?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7n0yjz/if_religion_is_really_a_symptom_of_poor_education/",
        "text": "[deleted]",
        "created_utc": 1514630327,
        "upvote_ratio": ""
    },
    {
        "title": "Fellow agnostics/atheists, how do you go about your family relationships when they are religious and you aren't?",
        "author": "Dobokdude",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7myecw/fellow_agnosticsatheists_how_do_you_go_about_your/",
        "text": "[removed]",
        "created_utc": 1514595026,
        "upvote_ratio": ""
    },
    {
        "title": "Real Book of Revelation for the 21st century",
        "author": "Proxyminers",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7mvc8y/real_book_of_revelation_for_the_21st_century/",
        "text": "[removed]",
        "created_utc": 1514565556,
        "upvote_ratio": ""
    },
    {
        "title": "đồng hồ nam cao cấp chính hãng adriatica",
        "author": "donghonamdep",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7mtspf/đồng_hồ_nam_cao_cấp_chính_hãng_adriatica/",
        "text": "[removed]",
        "created_utc": 1514546627,
        "upvote_ratio": ""
    },
    {
        "title": "Occupations and religion",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7mn1bo/occupations_and_religion/",
        "text": "[deleted]",
        "created_utc": 1514473062,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people believe there job is protect by religion.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7mmzao/why_do_people_believe_there_job_is_protect_by/",
        "text": "[deleted]",
        "created_utc": 1514472432,
        "upvote_ratio": ""
    },
    {
        "title": "Any good books on atheism in 2017?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7mi0xx/any_good_books_on_atheism_in_2017/",
        "text": "[deleted]",
        "created_utc": 1514410977,
        "upvote_ratio": ""
    },
    {
        "title": "Hallo, please for support, every penny is important for me, or maybe you can borrow me (4850$) for one year or little more ? Happy new year ! 🎈",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7me3ir/hallo_please_for_support_every_penny_is_important/",
        "text": "[removed]",
        "created_utc": 1514367496,
        "upvote_ratio": ""
    },
    {
        "title": "I tried debating with a picketer at my college once",
        "author": "T4blespoon",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7majy3/i_tried_debating_with_a_picketer_at_my_college/",
        "text": "He has some religious shit up on a sign and it was a kid who had no idea what it even meant. Anyway' after talking with him for a while, a fireman AND a professor there came up to join the conversation, and WERE ON HIS SIDE. I was of course arguing for the atheist side of the argument, but they were all ganging up on me. Literally, it was 3 vs 1. Are there really that many people who still believe that bs?",
        "created_utc": 1514324561,
        "upvote_ratio": ""
    },
    {
        "title": "The Outsider",
        "author": "reversethecurse20",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ma07u/the_outsider/",
        "text": "I feel like no matter what I go on to do in my life I will never be accepted by my family, because I am atheist.... I thought after my mom left the Jehovah's Witnesses that things would change. I thought we would actually be able to have a normal relationship. She and my grandparents think my husband and I are unhappy, and that there is something wrong with us because we don't believe in god, and don't feel the need to be apart of any religious groups. I can't be open with her. I can't be myself around her, and it breaks my heart, because she is the only parent I have left. I have tried to tell myself that it doesn't bother me.... When I first stopped wanting to be apart of anything to do with religion, I decided to detach myself from my feelings for her, especially when  she was a Jehovah's Witness. It is custom for them to shun their children if they leave. I didn't want to get hurt. Then when I turned 17 she left the cult. I thought that our relationship would improve, and that she would stop getting involved in toxic relationships. Unfortunately, I was wrong. I have begged her to get help.... I don't know what to do. I don't know how to handle what I am feeling right now, because I have lied to myself about how hurt I am for years. How do you all deal with the alienation? How do you deal with knowing that your family thinks you are \"sick\" because you are an atheist?",
        "created_utc": 1514319167,
        "upvote_ratio": ""
    },
    {
        "title": "True atheism: the news that the 'bible' is Old Jewish Fables is spreading",
        "author": "moon-worshiper",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7m9gl1/true_atheism_the_news_that_the_bible_is_old/",
        "text": "[removed]",
        "created_utc": 1514313789,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with debating a friend",
        "author": "throwaway59063",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7m8cau/need_help_with_debating_a_friend/",
        "text": "Hello,\n\nSo recently I've been asked by a muslim friend of mine to debate his religion with him. Under normal circumstances I would gladly have accepted, but I know he's very touchy about his faith, and I don't want to jeopardize our relationship over an ultimately irrelevant debate. So I wanted to ask the people who have had similar experiences some questions:\n\n* Do you think it would be best if I defused the situation or excused myself from that debate? I feel that would be somewhat intellectually dishonest so I'm hesitant to do so...\n\n* What are good places to look for information on the Qu'ran and Islam? Most of the debates I've watched or been a part of before were with Christians, so I feel my knowledge of Islam is insufficient.\n\n* Are there any particularly notable debates to watch on Islam? \n\nThanks in advance for your answers!\n\n\n\n**UPDATE**: I had a lengthy (and awkward) talk with my friend which made me realize that what he heralded as a \"debate\" was really meant to be a proselytizing session. I told him quite clearly that I had no interest in that, and that I'd rather not debate to avoid hurting our friendship. He then dropped the subject. Thank you all for your advice! I'll try and keep you updated if this springs up again.",
        "created_utc": 1514302333,
        "upvote_ratio": ""
    },
    {
        "title": "Explanation for miraculous healing?",
        "author": "Liluokalani",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7m4a7n/explanation_for_miraculous_healing/",
        "text": "I am a recent atheist (I came from YEC). I pretty much think that the Bible is very disjointed and not consistent at all. The god portrayed in the Bible has multiple personalities which do not mesh well with one another. I am firmly set in my new opinion. Someone that I am closely related to posted this on Facebook.\n\n\"It was the end of October, and MS symptoms began to rear their ugly head once again, this time being the most severe in that the number of areas of my body being affected was more than one. It was crippling. Upon a long awaited trip to visit with my neurologist, I was fearing the worst news: A relapse was imminent. I had gone almost 2 years relapse free and was preparing myself to find I was in a full blown relapse. The disappointment was imminent, or so i thought.\n\nThe neurologist began his exam on my eyes, and on my reflexes to find the left side of my body wasn't responding normally to reflex points when stimulated. This was cause for concern, so he ordered a series of MRI's to be completed. While getting the MRI of my spine, I began praying. The MRI tech forgot to turn the fan on inside the MRI tube, and the prayer began in such a way as to cool myself off. What it turned into was something even I didn't expect.\n\nI began thanking Jesus for loving me enough to die for me. I began thanking Him for the sacrifices made a long, long time ago for this very moment. I began telling him that no matter the results of this MRI, I would never stop loving him or praising him. Moments later, I had closed my eyes in an attempt to shut the sound of the MRI camera out, and was given the most beautiful picture of an angel and who God really was.\n\nI was a little girl sitting on God's lap staring at the most magnificent, majestic angel. I leaned my head in and rested it on God's chest and asked him, \"Did you remove those bear claws so they won't hurt me anymore?\" God answered with a smile saying, \"Yes, my child, they are gone. All gone.\" Just then the MRI ended.\n\nA couple days later I received a call from my neurologist. He was checking in to see how I was feeling. He then told me that he had an opportunity to take a look at one of the MRI studies that was completed. He was a bit taken aback when the MRI was normal. I asked him if it was normal for me, in that I had a chronic condition and nothing new was showing. He assured me it was no different than any person NOT diagnosed with MS. The only thing I could muster out was a tearful, \"Thank you, Jesus.\"\n\nReturning to see him 2 weeks later, revealed that every MRI and test performed on me showed everything normal, or in medical terms, \"No evidence of disease. Normal MRI.\" This wasn't medicine, as I haven't taken a medication for MS since 2014. This didn't make sense, on a scientific level. Which leads me to the point of this post.\nChristmas time is a time of Hope. The world was awaiting the Savior to be born because of Hope. The world was awaiting the resurrection of that same Savior because of Hope. The last 4 years haven't been easy because of the horrific mess that chronic disease wreaked on my body, and often times the Hope I had in Jesus was challenged. I wasn't free of doubt, or worry, or frustration. There were definite peaks, but a whole lot valleys. Without my hope in Him, I wouldn't have made it through. May Jesus also be your hope this season.\nThe picture attached to this post is an artist's rendition of what I saw in my head that day in the MRI tube. Words cannot convey the emotion tied to this painting.\"\n\nSo to me, coming from my heavily indoctrinated background, this definitely seems like some sort of grand 'healing miracle.' Even if it was, however, I am still completely convinced of the errancy of the Bible. \n\nSo I am wondering if any of you have any other possible explanations? ",
        "created_utc": 1514244362,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism doesn't require abandoning faith",
        "author": "Oliver_DeNom",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7m237g/atheism_doesnt_require_abandoning_faith/",
        "text": "There are many things I profess faith in, it's just that the ontological existence of God isn't one of them. In spite of ample evidence, I still have faith in the goodness of human beings. I still have hope that the future will be better than the past, and that I've got some role to play in making that happen, even though that's an unreasonable assumption. I believe we can heal our intractable divides, and that a vast majority of people on the internet are not in fact assholes, but kind, generous, and thoughtful.\n\nI have an irrational faith in love and relationships. Even though I'd never say it it loud, I actually believe that love will one day transform the world. My stupid optimism just won't quit in spite of failure, suffering, and the apparent indifference the universe has toward our well being. \n\nFaith is a really important part of my life. It gives me purpose, it helps me believe in impossible things like ending war and solving hunger. It pushes me to give other people a chance and love unconditionally. It allows me to feel happiness in a world filled with a lot of hate, suffering, and despair.\n\nThe existence of god is really a very superficial and unnecessary question to waste ones faith on. It's so often used to manipulate people into causing harm and enriching the greedy, that any good it might do is quickly swallowed up in the worst of human impulses. And really, what would it even matter? A god, so called, wouldn't be much to behold if it actually cared more about belief than your actions. The only practical use for pushing the idea that there's an angry father in the sky watching your every move, is to promote the kind of fear and control that my personal faith just can't believe in.\n\nSo merry secular christmas. There's no reason to hide the faith we have, and not spread hope just because there's no god threatening us if we don't. Take the Christ out of christmas, but never remove the love.",
        "created_utc": 1514218627,
        "upvote_ratio": ""
    },
    {
        "title": "The Unicorn in the King James Version, and the apologetics paradox about \"divine\" translation not being divine",
        "author": "moon-worshiper",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7lwhf4/the_unicorn_in_the_king_james_version_and_the/",
        "text": "If you are familiar with the unicorn in the 'bible' issue, there are the apologetics that it is only in the King James Version, that it actually was referring to a rhinoceros, that it is from the Hebrew for \"wild beast\", and that it was a reference to a species of wild cattle that went extinct in the 1600's.  \n  \nThe problem with these apologetics is they make no rational sense, no matter how much you twist the apologetics around. The passages where the unicorn is referenced has references to cattle in general, so why call out one type of cattle as special? Replacing the passages with \"rhinoceros\" makes no sense, plus there is no evidence of rhinoceros in the Israel area. The fact the word \"unicorn\" is a Latin translation of the Hebrew word for \"one horned beast\" doesn't answer any question, since no mammals have one horn except the rhinoceros and narwhale. There have been no fossils found of a one-horned cow.  \n  \nTo top it off, the 'bible' is supposed to always be translated by 'divine' guidance. The unicorn example is just more evidence how ridiculous this precept is. It is either a series of screwy mistranslations, which proves translation is not a 'divine' process, or it is confirming the 'bible' is filled with ridiculous nonsense. It is one or the other, you can't have both. Why can't these people just admit the 'bible' is a collection of Old Jewish Fables?   \n  \n  \n\"Saint\" James verses followed by the standard apologetics \"reasons\":  \n  \nDaniel 8:5 And as I was considering, behold, an he goat came from the west on the face of the whole earth, and touched not the ground: and the goat had a notable horn between his eyes.  \n  \nNumbers 23:22 God brought them out of Egypt; he hath as it were the strength of an unicorn.  \n  \nNumbers 24:8 God brought him forth out of Egypt; he hath as it were the strength of an unicorn: he shall eat up the nations his enemies, and shall break their bones, and pierce them through with his arrows.  \n  \nDeuteronomy 33:17 His glory is like the firstling of his bullock, and his horns are like the horns of unicorns: with them he shall push the people together to the ends of the earth: and they are the ten thousands of Ephraim, and they are the thousands of Manasseh.  \n  \nJob 39:9 Will the unicorn be willing to serve thee, or abide by thy crib?  \n  \nJob 39:10 Canst thou bind the unicorn with his band in the furrow? or will he harrow the valleys after thee?  \n  \nPsalm 22:21 Save me from the lion's mouth: for thou hast heard me from the horns of the unicorns.  \n  \nPsalm 29:6 He maketh them also to skip like a calf; Lebanon and Sirion like a young unicorn.  \n  \nPsalm 92:10 But my horn shalt thou exalt like the horn of an unicorn: I shall be anointed with fresh oil.  \n  \nIsaiah 34:7 And the unicorns shall come down with them, and the bullocks with the bulls; and their land shall be soaked with blood, and their dust made fat with fatness.  \n  \n&gt;&gt; In several passages (Numbers 23:22, 24:8; Deuteronomy 33:17; Job 39:9-10; Psalm 22:21, 29:6; Isaiah 34:7), the King James Version of the Bible mentions a unicorn. The original Hebrew is the word re’em which was translated monokeros in the Septuagint and unicornis in the Latin Vulgate. Later versions use the phrase “wild ox.” The original Hebrew word basically means “beast with a horn.” One possible interpretation is the rhinoceros. But since the Hebrew tow’apaha in Numbers 23:22 refers to more than one horn, it’s likely the translators of the Septuagint used creative license to infer a wild and powerful, but recognizable animal for their versions.\nThe re’em is believed to refer to aurochs or urus, large cattle which roamed Europe and Asia in ancient times. Aurochs stood over six feet tall and were the ancestors of domestic cattle. They became extinct in the 1600s. In the Bible, the “wild ox” usually refers to someone with great power. In Numbers 23:22 and 24:8, God compares His own strength to that of a wild ox. In Psalm 22:21, David imagines his enemies as wild oxen. The bull represented several different deities including Baal, Moloch, and the Egyptian Apis. The Israelites tried to adopt these beliefs when they made the golden calf.\nWhether the re’em refers to a rhinocerous, or an auroch, or some other horned animal, the image is the same—that of an untamable, ferocious, powerful, wild animal. What we do know is that the Bible is not referring to the mythological “unicorn,” the horse-with-a-horn creature of fairy tales and fantasy literature. It is highly unlikely that the KJV translators believed in the mythological unicorn. Rather, they simply used the Latin term that described a “beast with a horn.”",
        "created_utc": 1514138409,
        "upvote_ratio": ""
    },
    {
        "title": "How did you deal with feelings of guilt/alienation?",
        "author": "xolgaen",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7lty6s/how_did_you_deal_with_feelings_of_guiltalienation/",
        "text": "I'm an 18 year old female, born in a Muslim country to Muslim parents. I started digging deeper into religion a couple of months ago and I ended up realizing that well its bullshit. \n\nI came out to my parents yesterday and they were actually pretty chill about it, they preached a little, had a short debate with dad then they resorted to the \"As you like, we'll pray for you\" \"Remember all the things that god gave you\"...etc. not sure why but it felt kind of like guilt tripping because I ended up feeling really guilty and alienated after the confrontation, even though I know that by logic and reason, there's nothing that proves the existence of god.  \n\nTL;DR: All in all, my question is, if you're a religious turned atheist, how did you cope with feelings of guilt/alienation/isolation (if you had any) when you first converted to atheism? \n\nEDIT: Reading the comments and knowing that other people felt the same way at some point is somehow comforting, thank you all for the advice, they were quite helpful. ",
        "created_utc": 1514100226,
        "upvote_ratio": ""
    },
    {
        "title": "I need help with a counter-apologetic regarding the source of morals ...",
        "author": "barenaked_nudity",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7lfts8/i_need_help_with_a_counterapologetic_regarding/",
        "text": "We've either been in a conversation with a believer, or heard one, and invariably the morals question is raised: \"If you don't believe in God, where do you get your morals?\"\n\nAnd we've either given or heard a lot of the same answers, but there's one that I want to explore which kind of throws the ball back into their court, and that answer is: \"Same place you do.\"\n\nThe purpose is to approach the answer by pointing out something we're BOTH doing (or not) that has no religious context at all. It needs to be:\n\n(A) A decision that most people make, i.e. not something exclusive to political, cultural, or historical figures, fictional characters, or contrived thought experiments;\n\n(B) A decision common to both atheists and believers, having nothing to do with their beliefs;\n\n(C) Something important, not frivolous;\n\n(D) Something firmly rooted in the practical, secular world, having no mention in or connection to sacred texts.\n\nI have one, but it's not very good, so help me replace it. The question is raised ... \"If you don't believe in God, where do you get your morals?\"\n\n\"Same place as you do: our desire to live, and thrive, and build the kind of life we choose for ourselves. We're all faced with a number of decisions daily, and morality guides us to make the right ones, but we're not making those decisions based on our respective metaphysics.\n\n\"For example ...\" (and this is all I can come up with) \"... neither of us play with our cell phones while driving. You don't avoid doing so because of something in scripture, any more than I do on the advice of a famous scientist or skeptic. We're both rational enough to know that driving while paying attention to our phone can cause a collision, injury to ourselves or others, and even result in death.\"\n\nFrom there I can get to \"religion isn't stopping you from murdering people; your respect for human life does,\" and so on, but I need a more compelling launching pad than a distracted driving PSA.\n\nAny ideas? ",
        "created_utc": 1513926163,
        "upvote_ratio": ""
    },
    {
        "title": "Slavery and child trafficking is from the 'bible'",
        "author": "moon-worshiper",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ld7ue/slavery_and_child_trafficking_is_from_the_bible/",
        "text": "There are specific instructions, rules, and practices for slavery and child trafficking in multiple passages in the 'bible'. There are even instructions about how to sell your daughter into slavery. These passages are literal and simple, no analogies or metaphors. There are even shekel amounts called out.  \n  \nThe irony of the Old Jewish Fables book having instructions for slavery and child trafficking is that it is supposed to be some justification of jews being made slaves by the Egyptians. There isn't a shred of evidence the jews were ever slaves of the Egyptians. So the rationale that jews could have slaves because they were made slaves of the Egyptians falls apart.  \n  \nThese are just some of the passages. The slavery concept extends into the new testament, with \"being slaves of god\". The slavery in Europe which began to be practiced in the Americas, followed the slavery of jews by Hitler, followed by the slavery of ISIS, are all founded on the instructions from the 'bible', why it's never seen as wrong by the practitioners.  \n  \n&gt;Exodus 21  \n1\"Now these are the ordinances which you are to set before them.  2\"If you buy a Hebrew slave, he shall serve for six years; but on the seventh he shall go out as a free man without payment. 3\"If he comes alone, he shall go out alone; if he is the husband of a wife, then his wife shall go out with him. 4\"If his master gives him a wife, and she bears him sons or daughters, the wife and her children shall belong to her master, and he shall go out alone.…\n5\"But if the slave plainly says, 'I love my master, my wife and my children; I will not go out as a free man,'…6 then his master shall bring him to God, then he shall bring him to the door or the doorpost. And his master shall pierce his ear with an awl; and he shall serve him permanently. 7 \"If a man sells his daughter as a female slave, she is not to go free as the male slaves do. 8 \"If she is displeasing in the eyes of her master who designated her for himself, then he shall let her be redeemed. He does not have authority to sell her to a foreign people because of his unfairness to her.…\n9\"If he designates her for his son, he shall deal with her according to the custom of daughters. 10\"If he takes to himself another woman, he may not reduce her food, her clothing, or her conjugal rights. 11\"If he will not do these three things for her, then she shall go out for nothing, without payment of money. 12\"He who strikes a man so that he dies shall surely be put to death. 13\"But if he did not lie in wait for him, but God let him fall into his hand, then I will appoint you a place to which he may flee.…\n  \n&gt;Leviticus 25  \n43 'You shall not rule over him with severity, but are to revere your God. 44 As for your male and female slaves whom you may have-- you may acquire male and female slaves from the pagan nations that are around you. 45 Then, too, it is out of the sons of the sojourners who live as aliens among you that you may gain acquisition, and out of their families who are with you, whom they will have produced in your land; they also may become your possession. 46'You may even bequeath them to your sons after you, to receive as a possession; you can use them as permanent slaves. But in respect to your countrymen, the sons of Israel, you shall not rule with severity over one another.",
        "created_utc": 1513897305,
        "upvote_ratio": ""
    },
    {
        "title": "10 reasons",
        "author": "THEDOMEOFGOD",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7lcnxe/10_reasons/",
        "text": "[removed]",
        "created_utc": 1513892243,
        "upvote_ratio": ""
    },
    {
        "title": "Empty Vessel",
        "author": "THEDOMEOFGOD",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ky9g7/empty_vessel/",
        "text": "[removed]",
        "created_utc": 1513736099,
        "upvote_ratio": ""
    },
    {
        "title": "Is it true that being agnostic is more logical/open-minded than being atheist?",
        "author": "Zetronix22",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kxoag/is_it_true_that_being_agnostic_is_more/",
        "text": "Atheist: a person who disbelieves or lacks belief in the existence of God or gods.\nBelieve: accept (something) as true; feel sure of the truth of.\nAntonym of believe: disbelieve. \nWe can also change the definition of \"believe\" to \"disbelieve\" by changing a single word....\"True\" to \"false\".\"a person who accepts something as false.\" \nAtheists are basically asserting that God doesn't exist. Agnostics say they don't know. They don't have a disbelieve or believe in God. The truth is...Nobody knows if God exists or doesn't exist. There's no evidence or proof to dismiss the existence of \"God\". So, saying that God doesn't exist is wrong in itself. It might or might not be true and from our current stance it's illogical to assert that God doesn't exist since it's a complete gamble. Being agnostic seems like the most logical/reasonable stance to have as far as \"God\" goes. ",
        "created_utc": 1513730487,
        "upvote_ratio": ""
    },
    {
        "title": "Former Christians: Has Christianity blinded us to the possibility of a god?",
        "author": "doosjoos",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kxads/former_christians_has_christianity_blinded_us_to/",
        "text": "I recently finished Thomas Paine's \"The Age of Reason\" in which he makes the following comment on Christianity:\n\n&gt; Of all the systems of religion that ever were invented, there is none more derogatory to the Almighty, more unedifying to man, more repugnant to reason, and more contradictory in itself, than this thing called Christianity. Too absurd for belief, too impossible to convince, and too inconsistent for practice, it renders the heart torpid, or produces only atheists and fanatics.\n\nThe next section is a promotion of Deism.\n\n&gt; The only religion that has not been invented, and that has in it every evidence of divine originality, is pure and simple Deism.\n\nFor those of us who were Christians, is it possible that we are blinded to other possibilities about \"god\" because of the ways of thinking that Christianity taught us?\n\nEDIT: To clarify, I'm an atheist and I'm not necessarily arguing for a theistic position. I just heard Thomas Paine claim that Christianity produces atheists, and that this is bad, and I was wondering if there was any merit to the claim.",
        "created_utc": 1513726839,
        "upvote_ratio": ""
    },
    {
        "title": "Please bear with me I have a few sciencey questions",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kx19z/please_bear_with_me_i_have_a_few_sciencey/",
        "text": "[deleted]",
        "created_utc": 1513724476,
        "upvote_ratio": ""
    },
    {
        "title": "Is it time for Atheists (and others?) to create a viable alternative to the \"Christmas\" holiday?",
        "author": "Holiday2011",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kum42/is_it_time_for_atheists_and_others_to_create_a/",
        "text": "Christmas is an attractive holiday to many, including a lot of atheists, but the problem remains with the name \"Christ\"mas... as well as its close association with Christianity. \n\nBefore I get the typical onslaught of *\"BUT CHRISTMAS ISN'T A CHRISTIAN HOLIDAY\"*..... I get that many people celebrate \"Christmas\" without religiosity involved, but that's not the point.... they are still celebrating a Christian Religious holy day, just without any of the Christian religious stuff. It'd be like me celebrating Eid-Al-Adha and saying it's \"a secular holiday\" just because I happen not to honor the religious bits and just do it for the purpose of good food and family time. It's ridiculous, and the Muslims and Jews of the world know just how ridiculous it is when Atheists in the West say the same thing about Christmas.\n\nSo I know the Pagan precedents to Christmas have contributed a lot to it, and many point to the fact that Christmas has pagan origins....... well, why not separate off these bits and add some other Atheist/Secular traditions and call it something else? Have it on December 21 instead, properly on the Solstice? Then the 40%+ of NON-CHRISTIANS across America and the Western World can finally celebrate joyfully a late-December holiday without paying tithe to Jesus fucking Christ and his intolerant minions.",
        "created_utc": 1513703380,
        "upvote_ratio": ""
    },
    {
        "title": "If we don’t know what happened before the Big Bang, why don’t atheists believe in a creator?",
        "author": "uw-dummy",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kubvw/if_we_dont_know_what_happened_before_the_big_bang/",
        "text": "[removed]",
        "created_utc": 1513700901,
        "upvote_ratio": ""
    },
    {
        "title": "If we don’t know what happened before the Big Bang, why don’t atheists believe in a creator?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kuads/if_we_dont_know_what_happened_before_the_big_bang/",
        "text": "[removed]",
        "created_utc": 1513700530,
        "upvote_ratio": ""
    },
    {
        "title": "what if allah is real and just fucking with us",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ktsqv/what_if_allah_is_real_and_just_fucking_with_us/",
        "text": "[deleted]",
        "created_utc": 1513696006,
        "upvote_ratio": ""
    },
    {
        "title": "How did something (the universe) come from nothing + debunk the kalam cosmological argument",
        "author": "uw-dummy",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kqhth/how_did_something_the_universe_come_from_nothing/",
        "text": "Whatever begins to exist has a cause;\n\nThe universe began to exist;\n\nTherefore:\n\nThe universe has a cause.\n\nFrom the conclusion of the initial syllogism, he appends a further premise and conclusion based upon ontological analysis of the properties of the cause:[4]\n\nThe universe has a cause;\n\nIf the universe has a cause, then an uncaused, personal Creator of the universe exists who sans the universe is beginningless, changeless, immaterial, timeless, spaceless and enormously powerful;\n\nTherefore:\n\nAn uncaused, personal Creator of the universe exists, who sans the universe is beginningless, changeless, immaterial, timeless, spaceless and enormously powerful.",
        "created_utc": 1513653310,
        "upvote_ratio": ""
    },
    {
        "title": "I want historical reasons why Mo (police be upon him) created Islam",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kjvv8/i_want_historical_reasons_why_mo_police_be_upon/",
        "text": "[removed]",
        "created_utc": 1513584129,
        "upvote_ratio": ""
    },
    {
        "title": "What happens during/after conversion? Trapped in religion",
        "author": "TimeLessBoy",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7khao7/what_happens_duringafter_conversion_trapped_in/",
        "text": "My mom always responds like this: \"It's my faith, I can't explain it. No words can describe the love I experience from God.\"\n\nIt feels like there's some turning point where there's just complete ignorance to anything that speaks bad about God.\n\nAlso, how on earth is it possible for a person to believe certain stories written in the Bible that are just... impossible. Is indoctrination that strong?\n\nI feel so trapped. My past (childhood) tells me to believe in God otherwise I'll end up in hell. There is so much fear. If I ever abandon the religion and church I attend, my family will probably just... abandon me aswell. Someone help me, what do I do. I'm 19.\n\n\"You should attend church because you are baptized.\" Guess who chose to get me baptized, well... not me.\n\nExcuse my non-perfect English, it's not my native language.",
        "created_utc": 1513553635,
        "upvote_ratio": ""
    },
    {
        "title": "\"If god ...\" and \"Why god ...\"",
        "author": "moon-worshiper",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kfh91/if_god_and_why_god/",
        "text": "Starting a question like this is backward logic since it starts with the assumption there is a 'god'. To form these questions more usefully, start expressing them as \"If the evolved English word \"god\" ...\" and \"Why the evolved English word \"god\" ...\".  Even better, start them with \"If the imagined concept of the evolved English word \"god\" ... \" and \"Why the imagined concept of the evolved English word \"god\" ... \".  \n  \nDoing this will be restore rational logic to the interrogative while possibly answering the question before it is asked. Don't start questions with assumed conclusions, first.",
        "created_utc": 1513536013,
        "upvote_ratio": ""
    },
    {
        "title": "Agnosticism or Atheism?",
        "author": "Mallhead",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kfcky/agnosticism_or_atheism/",
        "text": "I believe most of us we will agree that the burden of proof lies with whoever is making a positive assertion. It is usually combined with the “Sagan standard”: “Extraordinary claims require extraordinary evidence” or “The weight of evidence for an extraordinary claim must be proportioned to its strangeness”.  \n\nWhat are we supposed to make of statements that are not supported by evidence? A problematic response is the “Hitchens's razor” (\"What can be asserted without evidence can be dismissed without evidence\") interpreted to mean: claims without evidence *should be considered false*. I think the most appropriate interpretation of the quote is simply: claims without evidence *don't deserve to be accepted*. There is a subtle difference here. Claims without evidence could be the existence of magic, primal spirits, unicorns, the spaghetti monster… but also claims about the validity of [string theory](https://en.wikipedia.org/wiki/String_theory) (e.g. [Lawrence Krauss believes that it shouldn’t be even called a theory]( https://www.youtube.com/watch?v=IPi38DZCyiQ&amp;feature=youtu.be&amp;t=4165) but a hypothesis since there is no way to test it) or the existence of [multiverses]( https://en.wikipedia.org/wiki/Multiverse) ([maybe multiverses are a different case?]( http://bigthink.com/paul-ratner/scientists-find-what-could-be-the-first-proof-of-parallel-universes)). Should all these claims be treated in the same manner? Probably not. Claims of the second category differ from the first in the sense that they are related to hypotheses or theoretical frameworks which aim to expand our scientific knowledge (but nevertheless there is not enough empirical evidence to justify or falsify them). Thus, maybe a useful distinction is the following:  \n\n**1)**\tClaims not supported by evidence, completely incompatible with our scientific understanding of the Cosmos    \n**2)**\tClaims not supported by evidence, related to (untestable) hypotheses or theoretical frameworks which aim to expand our scientific understanding of the world  \n\nClaims such as “the spaghetti monster exists” or “magic is real” belong in the first category. There is no evidence to justify the belief that these claims are true. However, absence of evidence does not mean non existence. Nevertheless we have good reasons not to believe in these ideas (since they also contradict our scientific understanding of the universe). Thus, the most reasonable move is to consider such claims false (meaning that *most likely* they are not true).  \n\nClaims such as “[gravitons](https://en.wikipedia.org/wiki/Graviton) exist” or “string theory is valid” belong in the second category. Nowadays there is no evidence to justify the belief that these claims are true. In my opinion the most reasonable response regarding these types of claims is to take an agnostic view. We don’t know if gravitons exist and maybe we will never know. Maybe scientists will find a way to test some of these hypotheses (thus rendering them scientific), maybe not. The important thing is to keep trying to discover ways to test them.  \n\nIn my opinion Christian God, Osiris,… fall in the first category I mentioned above. I can’t disprove the existence of e.g. the Christian God but I have good reasons not to believe in him and I consider the claim “The Christian God exists” false (meaning that *most likely* the Christian God does not exist).  \n\nWhat could be said however for a deistic God? [Here]( https://www.youtube.com/watch?v=gH9UvnrARf8&amp;feature=youtu.be&amp;t=3600) is Krauss referring to such a deity. The discovery of such a non-interventional God will mean to (former) atheists the same thing that the discovery of gravitons will mean (if they exist): it will just expand humanity’s worldview but probably it will not change anything else in the way former atheists - then deists live their lives.  \n\nAs I’m writing this text I have [this article](http://www.patheos.com/blogs/daylightatheism/essays/a-much-greater-god/) in mind (written by an atheist). I quote some text from the article:  \n\n&gt;But just because the religions created by humans are false, it does not logically follow that there is no deity at all. What if there is something out there, something that no one has discovered yet, something we have all overlooked simply because it is too vast and too unlike us? Beyond the savagery and the madness, beyond the fervent hopes and hot-headed delusions, beyond the pretenses and the postures – beyond the human-created religions that are above all else too small, viewing this world, this dust speck, this pale blue dot – or even one small local region of it – as the all-important stage on which the cosmic drama is played out, while the entire inconceivable vastness of the rest of the universe is simply a backdrop – beyond all this, could there be a much greater god? Could there be an entity “whose dreams are constellations”, as Robert Ingersoll put it [1], and whose individual flashing neurons are suns? When we look into the night sky, could we be viewing the latticework of thought on a scale beyond our comprehension? Could the entire universe be merely a fleeting idea in the mind of a being so vast we could not recognize it for what it is any more than an ant could recognize a skyscraper as the product of design?  \n \n…  \n\n&gt;This is the god of the cosmic microwave background radiation, of the universal expansion, of the vast star-forming nebulae and the cataclysmic explosions of stellar death, of the great walls of galaxies and the even more enormous voids. If cosmologists ever find a god, it will be this one, not the tiny god of Moses who thought that parting a miniscule amount of water on an insignificant planet so a single tribe could pass unhindered was a great miracle – that god is a child making sandcastles on the beach. This god, if it exists, would be large enough to fit the universe.  \n\nSo what can be said about the existence of such a deity (or deities)? There is no evidence to support its existence but is such a claim closer to the first or the second category I mentioned above? Is this God of “*the cosmic microwave background radiation, of the universal expansion, of the vast star-forming nebulae and the cataclysmic explosions of stellar death*” compatible with modern science?  \n\nAccording to the author:  \n\n&gt;The disadvantage of a god that is too vast for us to recognize is that we cannot recognize it. It is difficult even to imagine what would count as evidence for the existence of such a being, and in the absence of such evidence, logically we must go with the simpler explanation. I acknowledge the possibility that a greater god exists, but possibility is not the same as proof, and until truly convincing evidence turns up, I will and must remain an atheist.  \n\nIf:  \n\n* we had a well established mind-body theory that supported [multiple realizability]( https://en.wikipedia.org/wiki/Multiple_realizability) (([Functionalism]( https://en.wikipedia.org/wiki/Functionalism_(philosophy_of_mind)) according to which hardware implementation is irrelevant because only the functional level is important has its problems), showing that minds can exist out of biological brains and we could demonstrate it in the lab (could this be a semi-conscious “machine” which is based on different principles than today’s computers which are variants of the Turing machine (if indeed Functionalism is false))?  \n \n* we could find patterns at Cosmic level (Cosmic rays from other galaxies/galaxy clusters? Or gravitational waves?) resembling [neural activity patterns]( https://en.wikipedia.org/wiki/Neural_oscillation#Activity_patterns) indicating e.g. a similarity of some sort between neurons and galaxies and between neuron clusters and galaxy clusters (probably that’s a big leap of logic here).  \n\ncould this be some evidence in favor of the claim that “we are part of a being’s (call it God?) “brain”” where galaxies act as some sort of neurons and galaxy clusters act as neuron clusters? This would be a deistic God and we would be a part it. Of course more evidence would be required for such an “extraordinary claim”. And then there are other problems: the Universe is expanding, that means that God’s “brain” (if we call such a being God) is also expanding or part of God’s “brain” is also expanding (if we also consider multiverses)? God’s “brain” is slow (how long does it take for cosmic rays to reach from one galaxy to the other)? Or time moves much slower for such a being? What is the big bang from this perspective? And what is the role of black holes in such a “brain”? etc…  \n\n**Of course I’m making up stuff on the spot here** (not so well thought, and I don’t have a background in neurology or physics). I’m just trying to imagine “*what would count as evidence for the existence of such a being*”. If we had something like the things mentioned above then I would put such a claim (“we live in a being’s/God’s brain”) in the second category (and hold an agnostic position) since there would be some scientific background on the subject (but maybe not enough in order to support the existence of such an entity). I’m not sure what to think about such a claim now. I definitely can’t accept it as true. What is your opinion? One should reject such claims as false (*most likely* such a deistic God doesn’t exist)? One should remain agnostic? Or is there even a middle ground between them (If somebody holds a gun to your head and forces you to bet, you bet it doesn’t exist but you definitely don’t know)? Or is such a concept of a God too vague to be even talked about?  \n\nMaybe this discussion will also help some readers (and me) clarify the differences between  agnosticism, agnostic atheism, weak and strong atheism, local atheism and global atheism. \n\nEdit: some wording corrections\n",
        "created_utc": 1513534776,
        "upvote_ratio": ""
    },
    {
        "title": "I really enjoy religious chiors",
        "author": "Shaddleson",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7kbbpw/i_really_enjoy_religious_chiors/",
        "text": "[removed]",
        "created_utc": 1513477790,
        "upvote_ratio": ""
    },
    {
        "title": "European folks here....",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ka7l8/european_folks_here/",
        "text": "[deleted]",
        "created_utc": 1513465222,
        "upvote_ratio": ""
    },
    {
        "title": "The complete lack of anything. The pre-birth experience.",
        "author": "Don_Keebals",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7k9s7k/the_complete_lack_of_anything_the_prebirth/",
        "text": "[removed]",
        "created_utc": 1513460854,
        "upvote_ratio": ""
    },
    {
        "title": "A Study of Spirituality, Mindfulness, and Humor and How it Relates to Your Work",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7k8ka2/a_study_of_spirituality_mindfulness_and_humor_and/",
        "text": "[removed]",
        "created_utc": 1513448556,
        "upvote_ratio": ""
    },
    {
        "title": "Please debunk this",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7k67vk/please_debunk_this/",
        "text": "Gods morality is not defined by human terms.\n\nId say\n\n1. If gods mercy cant be defined by human terms then its not mercy\n\n2. It only works if there is undeniable truth there is a god\n\n3. An omnipotent good god should define his morality to us\n\n4. Then why do humans try to define him through books IN HUMAN LANGUAGE?\n\n5. GODS MORALITY HAS BEEN PRIVEN TO BE BAD COR SOCIETY \n\nGimme more please",
        "created_utc": 1513417278,
        "upvote_ratio": ""
    },
    {
        "title": "Where is the line between challenging religion and being a jerk?",
        "author": "Torin_3",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7jz4w1/where_is_the_line_between_challenging_religion/",
        "text": "I think it's good for secularists to discuss when and where it's appropriate to challenge religion. No sensible atheist wants people to start heckling a pastor in church while he's delivering a sermon, or making fun of an 85 year old lady who takes comfort in thinking she'll see her husband again. On the other hand, if your friend presents you with an argument for God and asks what you think, it's definitely appropriate to refute it.\n\nSo, what makes it right to challenge religion in some contexts (like on the internet), and not others? What do you think?",
        "created_utc": 1513337320,
        "upvote_ratio": ""
    },
    {
        "title": "A seldom-mentioned flaw in the 'human design'.",
        "author": "Ghosttwo",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7juxpk/a_seldommentioned_flaw_in_the_human_design/",
        "text": "[removed]",
        "created_utc": 1513287505,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the narrative in modern Western media and fictional works \"Christian vs Unbeliever\" (in particular Christian vs Atheist)? While the Protestant vs Catholic (and other infighting between Christians) is practically dead in mainstream media and pop-culture?",
        "author": "QuakerPlayer",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ju9xm/why_is_the_narrative_in_modern_western_media_and/",
        "text": "I notice a very common trend today in your morning news and works of fiction is the tendency to portray conflict as \"Christian vs Hindu\", the debate whether Buddhist meditation practises are compatible with Christianity,the infamous \"Muslims started it by invading Christian lands so the Crusades was justified!\", and of course the battle against secularism and atheists who support it. Basically movies, comics, and Fox News have basically have this thought that \"all are Christians regardless of denomination so long as they accept Christ and thus all are saved\" while condemning the false doctrines of the Sikhs or bashing Islam for being very violent and what not.\n\nEven pop cultural works sympathetic to non-Christians such as Kingdom of Heaven, Assassin's Creed, and Once Upon a Time in China starring Jet Li portray it as a black and white \"Christians want to wipe our religion out and we have to defend our statues of Zeus from being smashed\".\n\nNow I've had several debates and arguments with members reddit and I note not only do they typically bash unbelievers (especially Muslims) as savages with violent religions but they all seem to believe the above notion that Christianity is tolerant because they accept a variety of different subsects. The few times I've debated with people who bashed their former church often brings the criticism in the lines of \"Mormons claim they are the true church and all other churches are false which is why I left LDS. Because Catholics, Lutherans, etc all accept each other so long as they are Christian\". Not lying I had an argument with a member in /r/exmormon about the quoted topic. In other words you will only see the criticism towards fringe Christian groups for conflict  so bizarre and far from mainline Protestantism such as Mormonism and Jehovah's Witness.\n\nSo basically the popular perception is Mormons and Jehovahs (and similar small cult level groups) aside, Christianity is shown as a religion unified without conflict. With the way mainstream news make it out, they portray as though Christians were always united in doctrines and so much of the current outrage is because Hindus can't stand Christians converting the local populace or converts from Buddhism fail to understand that Christianity forbids syncretism, etc.\n\nSo I'm inspired to create this post because I wish to discuss it. As someone who came from a traditionalist Catholic with a Quaker dad, I will outright state I came from an abusive family and I saw the frequent \"Protestant vs Catholic\" conflict. My family tended to shun Protestants and avoided them because they are a \"bad influence\" and they often threw away KJV Bibles or Protestant literature we received in the mailbox by preachers or donated to me from my school. In fact my family even tried to ban me from watching casual tv and movies such as Friends and The Walking Dead to avoid seeing the immorality of mainline Protestants. If I even played as a Protestant faction in a PC game such as Europa Universalis I got chewed out by my grandpa.\n\nI'm even surprised my mom was allowed to marry my dad because my dad is a Quaker (hence my username \"QuakerPlayer\" because I'm now a full practising Quaker). \n\nIts even worse in the hometown my family came from ( a rural town in Poland) where not only is there casual contempt for Protestants that rude slurs are often thrown in public but there have been incidents of vandalism, assault, and even one dubious murder case (might not have been religiously motivated but the guilty certainly had a history of treating Protestants beneath them).\n\nDon't even get me started on atheists (at best you'll see open contempt, at worst outright murder on the spot).......\n\nSo I am curious why is the Protestant-Catholic and Catholic-Orthodox conflict practically a dead issue in your typical CNN and Fox News broadcast and most movies/tv shows/comics/literature with a religious (often Christian) theme? Even the theological debates with badmouthing gets ignored in academia and most modern historical fiction strangely ignore the Catholic-Protestant relationship (even stunningly accurate ones such as Gone With the Wind and Rose of Versailles). I even notice many history classes including college level ones ignore the conflict (especially within America) or at least minimize its important in light of more famous events such as World War II or (commonly) the Red Scare and how atheist Communists intended to conquer the world and destroy religion.\n\nWhy is this? I mean one quick look at wikipedia shows just how fucking vicious the conflict between Protestants and Catholics was including a major war in Europe that wiped out over 8 million people (close to World War 1's total death count) and expanded beyond Europe into places as remote as India practically being a pre-modern World War (the only thing preventing it was the exclusion of the direct involvement of the Americas). Not to mention a whole century or rape and pillage.\n\nSo I'm quite curious why the current narrative is like this? I can understanding mainstream media but you'd think historical works taking place post Martin Luther would have references towards the conflict! Instead I see far more fictional works making it \"Christian vs (INSERT GROUP)\"- especially atheists (which has been the bulk of conflict in Christian themed fiction aside from the Christian VS Muslim conflict which is the only thing mainstream movies have portrayed recently).",
        "created_utc": 1513282096,
        "upvote_ratio": ""
    },
    {
        "title": "It absolutely blows my mind the amount of things people just accept without thought or question",
        "author": "broadway_bro",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7jnjh7/it_absolutely_blows_my_mind_the_amount_of_things/",
        "text": "I don't understand. So many people just assume there's a god, assume Christianity is true, and when you say you don't believe and have An actual conversation with them it is extremely clear that they have never questioned their beliefs or come across anyone who challenged them on their beliefs. How is this possible? How do you just tacitly accept every claim put in front of you and never think in depth about it? \"I was just raised to be X way\" blows my mind when people say it, not even about religion but about anything. So just because your parents are one way means you must be? You're not an individual with your own unique sentience and rationality? \n\nI just don't get it.  ",
        "created_utc": 1513208645,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it that only in Europe can you be openly atheist?",
        "author": "trytrytired",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7jdtch/why_is_it_that_only_in_europe_can_you_be_openly/",
        "text": "Obviously in the Middle East there's no such thing as atheists, they just kill them. In America, being atheist makes you the embarrassing uncle that people are ashamed to acknowledge at family functions. In Europe, you can be atheist and own up to it without feeling all that shame.\n\nWhen is everyone else going to catch up on that and not shame atheists  (or kill them)?",
        "created_utc": 1513111550,
        "upvote_ratio": ""
    },
    {
        "title": "Simple argument against presuppositional apologetics?",
        "author": "plasticpony256",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7j70iz/simple_argument_against_presuppositional/",
        "text": "When I get the comment, \"Atheists can't justify their positions without pressuposing a Christian worldview or pressuposing a god, it really messes with my head. Is there any way to shut that stuff down quick and easily or do you really have to have a PhD in philosophy? ",
        "created_utc": 1513041181,
        "upvote_ratio": ""
    },
    {
        "title": "Should I confront my friend whose become too catholic",
        "author": "Kapitaczec",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7io3vc/should_i_confront_my_friend_whose_become_too/",
        "text": "So my best friend for years has recently gotten into catholicism. I think one of the reasons is because he takes pride in being part Spanish and they've always been known for catholicism. Anyways, it used to not really bug me, if we hung out on Sunday I would sometimes attend mass with him and his mother. But now he goes to mass on Sat, through the week, and even if he asks to hang out on Saturdays he wants to go to confession. I don't know what drove him to this because his parents aren't too catholic, his mom sorta is but didn't start going more till he did, his dad thinks it's bullshit etc. \n\nI would say it's fine but I noticed he's been a little less likely to hang out because it's \"late\" 7, he doesn't really stand up for himself, he's been showing signs of depression. He's also considering being a priest and even his friends and others wonder like how the hell do you come to that decision.\n\n I know he wants to be a good person but it gets kinda of annoying when it gets inthe way of plans. And maybe it's me being selfish but especially knowing the history of the catholic church, attending their masses etc I dislike it and don't see why someone would join a church that defends pedophiles and has a history of just making shit up more than protestants and all(in my opinion). Maybe I just dislike catholicism so much because for me even when he asked to hang out then went to Mexico with his church to help build some church shit, it kinda bugged me.  I get wanting to be a good person but I think my friend tries to hard and honestly I cannot support a friend who wants to become a Priest because he did want to be a doctor at first but seriously I feel like he's depressed and idk if its from religion or not because this type of dedication I've seen from Mormons but it makes more sense. I rarely ever see catholics actually following it.\n\nI will say he doesn't really force his religion on me but it's like when we hang out he'll be like \"oh im going to confession(or church) in an hour\" and then I gotta wait. But he doesnt like tell me this until I've already gotten to his house or whatever and he does that with his parents he'll make plans but not tell people probably out of fear of saying no. ",
        "created_utc": 1512841057,
        "upvote_ratio": ""
    },
    {
        "title": "Book recommendations?",
        "author": "Some_Guy_87",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7im57c/book_recommendations/",
        "text": "Hey everyone,\n\nshort history what lead me to this question: I've been an atheist for as long as I can think, pretty much growing up without any contact to religion, always considering it something that weak people need if life's not working out - you know, the typical \"today's opinion\" you could say.  \n  \nA bit more than a year ago, however, I started diving into the topic much more. At first, I only wanted to find out more about Islam, because I was starting to genuinely be scared of this religion and wanted to find out if its teaching actually are as concerning and political as it seemed.  \nDuring this time, I stumbled upon Nabeel Qureshi's \"No God but One\", which was actually the turning point for me: For the first time in my life, I started to question my own position regarding this topic. I'm criticizing people for blindly believing in a God, yet I believed in everything related to atheism just as blindly. It raised questions I could not answer, and answered things I couldn't.  \n  \nMore than one year later, I've watched several arguments between religious and atheistic people, read a lot of stuff about questions often raised, and am close to finishing the bible. During this time, I found Christianity specifically to have incredibly strong arguments. It's pretty much the only religion that has relatively recent historical events backing it up, meaning there's even a rational level at which you can look into its credibility. And honestly, up until this point I found most refutes of famous atheists to be incredibly weak. Even many famous people you see in TV shows and stuff have been incredibly disappointing for me with their arguments. Then again, I was immersed with Christian literature and views for more than a year now, which is why I'm opening this topic:  \n  \nAfter finishing the bible, I would like to read something from the counter position. From what I've heard, Dawkins is the usual recommendation regarding that, but honestly, I'm not expecting too much from his works. The arguments I've seen from him are too broad to be convincing for me. Additionally, I don't like it when people are condescending in their arguments. I don't want a dragon in the garage, I don't want spaghetti monsters. These kind of debates never go anywhere, and people will just stick to what they previously believe because their mindset is set on it. Sure, the \"dragon in the garage\" argument can seem quite strong to an atheist, but if a Christian refutes by questioning the basis of morale in the typical \"all by chance\" atheistic world view, it's probably just as convincing for believers. I want facts and arguments. Moreover, arguments that actually take the counter-position into consideration, rather than creating a bubble excluding any kind of supernatural first and throwing arguments around it.  \n  \n  \n**tl;dr / specifics:**  \n  \nLooking for book recommendations in English or German.  \n**What I don't want:**  \n- Dragon in the garage arguments  \n- Straw man arguments  \n- General 'You can't prove a supernatural existence' stuff  \n  \n**What I do want**:  \n- Overviews of evidence for evolution and similar \"how things came to be\" topics that refute the bible  \n- Specific arguments against claims from Christians\n- Neutral perspectives if possible, I strongly dislike authors that belittle others  \n  \nCan be several books covering both broad topics (first point doesn't even need to have any religious connection anyway), if there's a \"one fits all\", even better.  \n  \nThank you in advance!",
        "created_utc": 1512816506,
        "upvote_ratio": ""
    },
    {
        "title": "Religious stuff at \"secular\" schools",
        "author": "Copernicus111",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7igu5r/religious_stuff_at_secular_schools/",
        "text": " i don't know if it is the right place to post it and i am sorry for that. So i am a teen atheist but i live in an Ultra-Catholic country (you know, the kind of place where there is a cross hung in the Parliament and where people are surprised, or even terrified somebody is not Catholic, and money from public taxes is given to the Church), and i attend, by Anglo-Saxon terms, lower secondary school. Even when i was still a believer, it literally sent a shudder down my spine when i noticed, or even thought of, the amount of religious, pardon my French, bullshit i am forced to withstand every day. For example, (let's leave alone Religious Education lessons funded from public money) when we go on school trips, there is usually a priest from the local church accompaning us. Formally, he is only one of the teachers supervising the kids, but in reality neither he nor any other adults see anything wrong in taking us to masses, or organising pilgrimages to \"sacred places\". Thankfully, this doesn't happen that often, but i find it disturbing nonetheless, as officially public education in my country is secular. Also, there was a girl in in the other class who suffered from cancer for a year and eventually died some 2 weeks ago. Her classmates used to be granted exemption from classes to pray for her, (as if that could help in any way) and they went on her Catholic funeral without having to attend that day's lessons... i understand death of a person one used to see every day is an overwhelming experience, but come on, that is a PUBLIC educational institution funded from sweat and gasps of taxpayers, and they were allowed to leave their duty for a religious activity. Another thing is that priest mentioned above. Most people seem to like him for his immature jokes and so called \"socialbility\", but i find him a cynical, uneducated simpleton with only basic knowledge on his own religion (he once tried to persuade me Christians who reject the belief in Holy Trinity aren't Christians) and complete ignorance in other aspects, including complete inability of logical thinking and limited acquaintance with his (and mine) mother tongue. And yet he is tolerated by other teachers who are seemingly oblivious or indulgent of his unimaginable stupidity. For instance, last year at the school year closing ceremony, he made a speech longer than the principal's, and it was only the stupid cliche talking of the need of being together and happines and God, devoid of any actual worth. What do you think of it? Have you/do you faced anything like that?",
        "created_utc": 1512757192,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone get annoyed with all the white depictions of Jesus?",
        "author": "OrangeApple_",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ib2ja/does_anyone_get_annoyed_with_all_the_white/",
        "text": "I'm not a SJW or any of that sought, but when Christians (particularly devoted ones) show Jesus as a white man (Or other skin tones e.g black) it just irritates me. He originated in the Middle East, so shouldn't his skin tone be a dry olive brown? If you're going to be following a set of rules that are based off Jesus teachings shouldn't you first get his appearance right?\n\nEdit: (Sorry if this came across as slightly aggressive, it was not my intent for it to sound that way)",
        "created_utc": 1512694215,
        "upvote_ratio": ""
    },
    {
        "title": "Ed Feser (Catholic) debates Arif Ahmed (atheist) on two arguments for the existence of God",
        "author": "Dice08",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7hw609/ed_feser_catholic_debates_arif_ahmed_atheist_on/",
        "text": "[removed]",
        "created_utc": 1512540566,
        "upvote_ratio": ""
    },
    {
        "title": "Ed Feser (Catholic) debates Arif Ahmed (atheist) on two arguments for the existence of God",
        "author": "Dice08",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7hvymn/ed_feser_catholic_debates_arif_ahmed_atheist_on/",
        "text": "[removed]",
        "created_utc": 1512538038,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone please debunk this?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7httus/can_someone_please_debunk_this/",
        "text": "[deleted]",
        "created_utc": 1512516753,
        "upvote_ratio": ""
    },
    {
        "title": "Historical Roman View of Jewish Culture",
        "author": "moon-worshiper",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7hs2n1/historical_roman_view_of_jewish_culture/",
        "text": "[removed]",
        "created_utc": 1512501879,
        "upvote_ratio": ""
    },
    {
        "title": "Why does God/Jesus only 'cry\" with us, but not to do something more purposeful &amp; meaningful with His omnimax capabilities?",
        "author": "HopefulEunuch",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7hqd82/why_does_godjesus_only_cry_with_us_but_not_to_do/",
        "text": "To the hurting families, many Christians would console them with sayings like, \"He suffers with us; He is crying with us; He feels our pains, etc.\" and quote the shortest passage of the Gospel, \"And He wept\" - weeping to His best friend, Lazarus - although that wonderful miracle wouldn't happen (again) following to those families.\n\nEvery rational person who moves God from right brain (emotionalism) to the left brain (rationalism) would question back, \"Why does God/Jesus only 'cry\" with us, but not to do something more purposeful &amp; meaningful with His omnimax capabilities, like resurrecting the dead spouse, healing his terminal cancer completely, etc.? Why does He act so weak, like a toddler who is only able to cry?.\"\n\nComments?\n\nAnd what do you think about the Christian answers to that question?",
        "created_utc": 1512487697,
        "upvote_ratio": ""
    },
    {
        "title": "What is your take on Buddhist teachings?",
        "author": "Dobokdude",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7hnu5b/what_is_your_take_on_buddhist_teachings/",
        "text": "Hey everyone.  So first off I appreciate all the feedback I got in my last post, it really is appreciated:)\n\n\n\n\nSo what I wanted to ask your thoughts on Buddhism. I'm currently a Secular Buddhist, meaning I onky follow Buddhism from a philosophical as opposed to religious standpoint. While I know Buddhism has some supernatural stuff and some things many of you may not agree with, I find the basic teachings to be compatible with secular ideals.\n\n\n\n\n\nMost of you are aware that there is no evidence of any sort of afterlife. There could be, but by no means should one dedicate themselves to something that likely won't happen and may not be as great as it seems. Part of Buddhism is to free oneself from desires like the things we can't control (like how we will all die and what happens after is unknown)  as well as recognizing the impermanence of everything . Life is obviously impermanent (maybe death is, who knows), and that's why you encourage people to live it to the fullest as this is the only life we know we have.\n\n\n\n\nThere is also meditation. Now we all know about lrayer, and how studies have shown prayer doesn't have any effect on curing people and whatnot. The typical religious excuse is that the test will fail because you can't test God (nice cop out). [Compare that with studies like this](https://www.health.harvard.edu/blog/mindfulness-meditation-may-ease-anxiety-mental-stress-201401086967) showing the observable and testable positive effects meditation has on the mind and body.\n\n\n\n\nSo, what are your thoughts? \n\n",
        "created_utc": 1512454583,
        "upvote_ratio": ""
    },
    {
        "title": "Which religion do you think is the most internally consistent?",
        "author": "mandragara",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7hgu4l/which_religion_do_you_think_is_the_most/",
        "text": "We all know that, say, The Bible is very internally inconsistent. Ranging from the nature of God changing fundamentally across the New and Old Testament, to the number of soldiers in a particular battle changing.\n\nSo I've been wondering, which religion is the most internally consistent? I'm leaning towards basic Animism as it seems to make the fewest claims overall.",
        "created_utc": 1512388262,
        "upvote_ratio": ""
    },
    {
        "title": "\"Our scientific power has outrun our spiritual power, we have guided missiles and misguided men.\" –Martin Luther King Jr.",
        "author": "VoxTrigati",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7hezy9/our_scientific_power_has_outrun_our_spiritual/",
        "text": "[removed]",
        "created_utc": 1512361621,
        "upvote_ratio": ""
    },
    {
        "title": "(Serious)Young Agnostic/atheist here REALLY could use some advice from you guys...",
        "author": "Dobokdude",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7heygh/seriousyoung_agnosticatheist_here_really_could/",
        "text": "Hi everyone. So in this post, what I wanted to ask you is with being non-religious, and not being assured of an afterlife(place of paradise, place of torture, reincarnation, simulation, etc), how did you go about making the most of what could be your only life(I'm 17 BTW)?\n\n\n\n\n\nFirst let me properly clarify my position. I'm an agnostic. ? Yes technically I am agnostic atheist but I just call myself agnostic because I still am very much open to a higher power of some kind. I agree that there is no real observable evidence, but at the same time I truly wonder if there is no ''god'', how did the universe come into existence or if it always existed in a different form, by what catalyst did it come to how it exists now? So with that, I'm really only atheist in that I lack belief in gods, but remain rather open to their existence and thus just call myself an agnostic. I'm also a budding Secular Buddhist, adopting the beliefs of impermanence, learning to let go desires, and so on. I've been listening to some interesting and insightful podcasts by Noah Rasheta.\n\n\n\n\n\nWith that out of the way, let me summarize my religious upbringing: fairly lenient non denominational Christian household(My mom's now a Baptist.) where we attended church semi regularly. In my tweens to early teens, I got involved in church youth group activities(choir, field trips and assisting in the nursery). I then moved, went to a non denominational church and over time attended less and less. In the meantime as I did my own research, reading articles and watching Youtube vids I eventually deconverted from Christianity, seeing the contradictions and flaws in the teachings. I should also note I'm African American, for what i's worth since blacks seem to be disproportionately Christian.\n\n\n\n\nI should note I have NOT told my parents, for obvious reasons. My religious upbringing isn't strict(and my parents are seperated). Though my mom has gotten a bit more serious with taking herself to church(even watching it on the computer if she can't attend) and my dad is a bit old fashioned so he is religious himself. He told me once that you need God and all that.\n\n\n\nThis honestly has put me in a rough spot. I should note I'm not really close with my parents. Part of it is the constant fighting they did throughout me and my sister's childhood and the earlier verbal(and a bit physical) abuse from my dad I'm not gonna get into. I don't feel anger about this, moreso that a feel a general apathy towards them, though I still love them as my parents. \n\n\n\n\n\n\nThey press me into opening up with them but it just doesn't feel right. There's this bit of resentment if my mom tries to conversate with me, and it similarly happens with my dad. I feel bad about this, because there's no gurantee of any second chance in an afterlife scenario and my parents are relatively elderly to when I was born (Mom ~50, Dad ~60).\n\n\n\nThere are other aspects of my life that don't help. I'm autistic(Asperger's) and thus have struggled with social awkwardness and making friends.Throughout my life being a person with Asperger's syndrome,I can act awkward, say awkward things I display intense interest in unconventional things compared to others(martial arts and anime/cartoons). I may do socially inappropriate things when to me at the moment they seem like not a big deal( People with AS don't pick up well on social cues) Throughout the years I have never made lifelong friends ever really. One is because I have moved several times( about 5 over my life) but also because I could never be real friends with other kids and I did become best friends with someone for awhile but after some awkward inappropriate things I am not proud of, that kinda went out the window.\n\n\n\n\n\nThrough 7th and 8th grade I was really the person who just walked around alot by himslef who would occasionally be whispered about by others and didn't go to dances, games etc. In a way i had low self esteem(no thoughts of suicide) and due to my condition and having hardly any friends I was also more sensitive to things that other people would immediately shrug off, such as e seeing disinterested in talking to me and being upset at not being noticed. I would walk around my old neighborhood alot while i bet the kids from my school went to malls, swim parties, etc. I also didn't have the best grades since i could feel unmotivated since i would feel depressed.\n\n\n\n\n\nAs of now, I'm trying to do the best. I'm hoping with college things may get better, I may meet the close friends I've been hoping for, [especially since I'm trying to find community colleges with dorms](https://en.wikipedia.org/wiki/List_of_community_colleges_in_the_United_States_with_campus_housing). I'm also getting myself in better shape to help with martial arts(I do Judo and Kickboxing, and my studio is transitioning to a new and better building, hopefully to attract more customers and have more classes) and of course anime and the like provides a bit of an escape from this too. I apologize if this comes off as an incoherent rant but when you've left religion and are lonely like me, you ain't got much...",
        "created_utc": 1512361167,
        "upvote_ratio": ""
    },
    {
        "title": "Religious concern",
        "author": "awegash",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7h5csk/religious_concern/",
        "text": "[removed]",
        "created_utc": 1512249579,
        "upvote_ratio": ""
    }
]