[
    {
        "title": "What evidence would you require to believe in a god?",
        "author": "kimprobable",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c8o0w/what_evidence_would_you_require_to_believe_in_a/",
        "text": "I think about this question from time to time, just in case anyone should ever ask, and honestly, I feel like there's nothing that will make me recognize a being as a god.\n\nIf we found proof of a creator, I would find that very interesting, but it doesn't necessarily mean that being is worthy of worship. I tend to come at that thought from the point of humans creating life. If we created a self-aware being with our knowledge of science, that doesn't necessarily mean we are gods.\n\nIs there any sort of qualification a being could have that would cause you to regard it as a god?",
        "created_utc": 1436137056,
        "upvote_ratio": ""
    },
    {
        "title": "Near Death Experiences?",
        "author": "igottroubledthoughts",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c735r/near_death_experiences/",
        "text": "I just got into a car accident last night (yes, you still need to pay attention to where your car is going on the way to a barbecue) where (fortunately) nobody was seriously injured, but it could have been much worse if I hadn't realized the other car was about to hit me and moved my car a little more out of the way. I'm thankful that I wasn't hurt, but still a little shaken. \nAny others care to share their thoughts and feelings after near-death experiences or even after the realization that it could have happened? \n\nEDIT: HUGE CLARIFICATION: I did not have an NDE, I misunderstood the use of the phrase. My apologies.",
        "created_utc": 1436105314,
        "upvote_ratio": ""
    },
    {
        "title": "Do the gods have gods? Is it like a multi-level marketing pyramid?",
        "author": "NortySpock",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c61fp/do_the_gods_have_gods_is_it_like_a_multilevel/",
        "text": "It ended up as a plot point in the novella [*The God Engines*](http://smile.amazon.com/God-Engines-John-Scalzi-ebook/dp/B003RCJNXI/) by John Scalzi. I'd almost consider it borderline spoilers, but that's for you to decide. \n\nAnyways, that was a mind-bending part of the story to me. Are gods created by greater gods? Are they answerable to them? How high up or down does it go? Do higher gods get a percentage of the base followers, or is it higher gods count lesser gods only in terms of numbering the faithful, and not their lesser god's followers?\n\nAnyway, just more humorous ammo in the debates, in my opinion. But it seems like just one more thing the theists have to prove: \"Not only do you have to believe in a god, you have to prove that your god is the best god we could believe in, and is not a subsidiary god of a higher god. Unless there's a limit to gods, beyond which humans cannot ken.\"",
        "created_utc": 1436069142,
        "upvote_ratio": ""
    },
    {
        "title": "Are birth rates of Muslims compared to non muslims something to truly worry about?",
        "author": "ethernetcord",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c60hb/are_birth_rates_of_muslims_compared_to_non/",
        "text": "",
        "created_utc": 1436068461,
        "upvote_ratio": ""
    },
    {
        "title": "What are the best counter-apologetics resources?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c3z9a/what_are_the_best_counterapologetics_resources/",
        "text": "",
        "created_utc": 1436023807,
        "upvote_ratio": ""
    },
    {
        "title": "Christians are citing this event as evidence of the \"a crusade to destroy Christians and the Christian Church.\"",
        "author": "killing_buddhas",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c3r0c/christians_are_citing_this_event_as_evidence_of/",
        "text": "In Oregon, a Christian bakery's owners who refused to serve a lesbian couple published consumer complaints with the couple's home address and personal info, and went on the record in an interview with the FRC to say that their bakery would not serve gay weddings.\n\nA lot of Christians I know are spreading this story ([Hate Wins: Oregon State Issues Gag Order Against Opposing Gay Marriage - Breitbart](http://www.donotlink.com/fsjd)) around as an example of persecution. I personally thought that the fines were ridiculous, until I read [the actual court documents](http://www.oregon.gov/boli/SiteAssets/pages/press/Sweet%20Cakes%20FO.pdf), which neither Breitbart nor any of their cited sources actually link to.\n\nWhat do you think? What to say to counter this bullshit? I'm really at a loss. The level of hyperbole is insane here.",
        "created_utc": 1436018777,
        "upvote_ratio": ""
    },
    {
        "title": "Have any formal arguments been made from this?",
        "author": "goodtimes50",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c3ptx/have_any_formal_arguments_been_made_from_this/",
        "text": "A few days ago I came across an article that mentioned the concept of Doxastic Involuntarism (DI), which states that we cannot choose what we believe. Apparently this is the consensus position nowadays. This got me thinking. If it is true that we believe things involuntarily based only on evidence (however good or bad), that has some pretty obvious implications. \n\nThere's a lot to say about this, but it's the other side of the coin that really jumped out at me. If DI is not true, the implications are just as dire for Christianity it seems to me. Biblical Christianity requires Doxastic Voluntarism (DV) else the command to believe (1 John 3:23) is pointless. However, what this means is that evidence is not the basis for belief, obedience is. In the abstract, a chosen belief does not, by necessity, correspond with reality. If it does, it is by coincidence only. If an individual chooses a belief then they would be aware, if they thought about it and were honest with themselves, that they arrived at said belief by an act of will and thus there is no reason to assume it corresponds with reality. In other words, they would have to acknowledge that they have no reason to trust their belief and therefore they wouldn't **really** believe it. Belief by an act of will is not real belief.\n\nWith insufficient or ambiguous evidence, the only way any semblance of belief can be arrived at is through an act of will, but we've already seen that this falls apart. Since Christians maintain the necessity of faith, I'm going to assume ambiguous evidence for the existence of God and his self-revelation as a brute fact. That being the case, what is left for the Christian? If DV is true, their belief is not true belief since it need not correspond with reality and therefore cannot be trusted. If DI is true, then it is true by God's design and the very fact that the evidence is ambiguous is an indictment. \n\nFurther, if one sets their standard of evidence such that true belief can be arrived at under DI, and one is consistent, one must accept a whole host of other truth claims that have as good or better evidence. If a Christian accepts Christianity on evidence alone, they **must** open the floodgates and accept Joseph Smith's golden tablets, Jim Jones' miracles, Sathya Sai Baba's miracles, alien abduction stories, etc., etc.\n\nThere is much much more to unpack here, but hopefully this illustrates the dilemma. Thoughts?",
        "created_utc": 1436017960,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a question or set of questions we can ask our parents to find out how they will react to us coming out as atheists?",
        "author": "one_dorian",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c3n34/is_there_a_question_or_set_of_questions_we_can/",
        "text": "First off, a little back story. I'm 25 and mostly financially independent (I'm about to enter grad school and my parents will help me out with car work from time to time). Last night my dad was unfortunately ranting against the gay marriage ruling from this past week and was using the Bible as his source for why it's wrong. I mentioned \"there's a lot of bad stuff in the Bible\" and gave it's support of slavery as an example and my parents seemed confused, then gave the, \"there's an old testament and a new testament\" argument. The conversation sort of died off because no one wanted to get too heated. \n\nThey've heard me question things like this before. As a preteen I started wanting to get real serious about my Christianity. But of course the more I learned and read the Bible, the less it all made sense to me. When I was in high school I started considering myself \"deist\" and told them that, but since becoming atheist I've kept quiet about it because I know that that's always been a bad word to them. \n\nSo my issue is I want to tell them about my worldview. I want to be truthful and I'm tired of tip toeing around the subject. I know I'm not required to say anything but it just doesn't feel right concealing a large part of who I am to them. Thankfully I'm not risking becoming homeless or anything like that by telling them, but I also love them very much and don't want them to think differently about me or ruin my relationship with them. \n\nObviously a lot of us have to deal with this issue of \"coming out\" to our parents. The general consensus is if you're going to become homeless and disowned, it's best to keep to yourself and if they're open and understanding, to tell them the truth. The problem is many of our parents lie on a blurred line in between these two stances. So my question to you, /r/trueatheism is this: Is there a question or set of questions we can ask our parents to find out how they will react to us coming out as atheists?",
        "created_utc": 1436015958,
        "upvote_ratio": ""
    },
    {
        "title": "To Atheist: You may want to read this",
        "author": "Derocka",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c3ji8/to_atheist_you_may_want_to_read_this/",
        "text": "",
        "created_utc": 1436013038,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think religion deserves the same treatment as alcohol and smoking?",
        "author": "SparksMKII",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c3heq/do_you_think_religion_deserves_the_same_treatment/",
        "text": "Just a thought I had, what if we started treating religion in the same way as alcohol and smoking. Since these can be highly addictive drugs most countries have strict age laws in place to prevent younger people the harm untill they are mature enough to make their own decisions.\n\nIt's obvious religion has been and will likely continue to be a huge part of human history and society so we shouldn't ignore it in my opinion.  Do you think it would be beneficial to only start teaching religion when people are mature and then introduce them to a multitude of religions in a short timespan instead of introducing them to one specific brand of religion while they're still little children?",
        "created_utc": 1436011377,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a book on Islam to read in the summer.",
        "author": "PM_ME_UR_CRUSH",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c3303/looking_for_a_book_on_islam_to_read_in_the_summer/",
        "text": "I know a lot about Christian, because I lived in a (arguably formerly) culturally Christian country (Netherlands). But as the number of Muslims in my country is rising (and the debate that comes with it), I've found that I don't know anything about many aspects of Islam. Like...\n\nWhat exactly do they believe?\n\nHow was it formed?\n\nHow was the Quran formed?\n\nAnd the hadiths? And how seriously are the hadiths being taken?\n\nDid Muhammad exist?\n\nWhat kind of schism occured within Islam and what are their beliefs?\n\nSo I'm looking for a historically accurate, neutral and reputable book. Not something like Ibn Warraq's *Why I'm Not a Muslim*.",
        "created_utc": 1435997089,
        "upvote_ratio": ""
    },
    {
        "title": "Hello everyone! I'm back from the Christian mission trip I was sent on and feel that I owe you all an explanation.",
        "author": "metaformer",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c1d2d/hello_everyone_im_back_from_the_christian_mission/",
        "text": "Most of you have probably forgotten about me, so here's my [original post](https://www.reddit.com/r/TrueAtheism/comments/2r9mnz/my_parents_will_be_sending_me_on_another_mission/). It's kind of long, so **TL;DR: I was afraid of what would happen on the mission trip my church was sending me on, so I complained to you guys. You told me to go, so I didn't resist going, and here we are.** I want to start off by saying that I think I overreacted to the trip in my previous post. I'd go so far as to say that I'm embarrassed by my reaction because the trip was so good. Now, onto the trip.\n\nIncluding 2 days of travel, the mission trip took 12 days. I definitely agree with what many of you said in the above post - It was definitely more of a voluntouristic trip than a missionary trip. Most of the time was spent in the Christian camp we slept at, and all of the work projects revolved around improving it. The only person I met who wasn't a Christian was another high schooler, and that was only because they don't know what they want to do yet spiritually. As for the *missionary* aspect, the only classic missionary work we did was a vacation bible school, and even that was only for 2 hours out of 2 days.\n\nAll that isn't to say that I didn't have fun. I definitely did. The work wasn't so monotonous that I died of boredom, but it wasn't so hard that I overworked myself either. I was able to get along with every team member just fine, and the food was pretty good (probably because the kitchen staff was Ecuadorian). Some of the things we did were pretty epic, too. A wildfire broke out after a beekeeper in the nearby mountain fucked something up, so I got to hack some plants with a machete to keep it from spreading. We also got stuck in a town on our way to the jungle due to landslides, and I got to experience life in a hostel because of it. We never made it to the jungle, but we made it back to the camp... 6 hours away. Not to mention all of the typical camp-ish things - high ropes, rock walls, and ziplines. Finally, I brought back some pretty cool souvenirs such as an alpaca blanket, alpaca jacket, and a machete and butterfly knife. I got a lot of good pictures of the landscape as well.\n\nWhile the Christian aspect of the trip was definitely a large part of the experience, it did not play into the trip as much as I thought it would. One of the things I feared about the trip was that it would warp me in a negative way, but it actually was kind of fun. Ironically, I signed up for the worship team before the trip began (due to my musical talents, singing ability, and lack of interest in the other options). We had a worship session (3 songs) and 1-2 hour sermon every night. I learned that I've become numb enough to the faith to be able to sing without being shaken, but I'm still sensitive enough to be able to lead 30 devout followers in prayer without believing it myself. My cognitive dissonance only seems to materialize in church on Sundays nowadays. Overall, although their faith is wrong logically, I'm glad that I helped give everyone a spiritual experience. I reconciled the fact that I was lying to them by finding people I could be open about my (lack of) faith with who are on a similar path. I also thought of myself as a Deceiver rather than a Liar. The connotation made me feel better.\n\nNine of my peers were baptised. All 9 of them grew up in Christian homes, and 7/9 were actively pushed into the faith by their families prior to the trip. IE: 2/9 came to Christ through their own free will. That kind of makes me sad, but there's nothing I can do about it and all of them are happy with their decision. It would be a waste of time and energy to convince them that they're wrong.\n\nA big thing I learned from this trip is that while trickle-down economics may not work well, trickle-down religion does. Feel free to prove me wrong, but I don't think preaching about a lack of gods would work too well in a 3rd world country. Some of these people need God as an emotional crutch, and the lack of education as well as economic position of the residents will keep Christ, essentially the god of the poor and needy, as a popular belief to cling to. If eliminating religion is a goal, cutting the head off of the snake should suffocate the rest: Weeding it out of 1st world countries should be the top priority. Without support of wealthier theists, missions may become a thing of the past. No matter how anti-theists go about it, it will take a long time. My idea just seems efficient to me.\n\nEven bigger than that, I learned to pity some of the religious rather than berate them. The Christians I met had good intentions despite their worldview.\n\nOverall, I'm happy that I went to Ecuador, and I'm proud of the things I accomplished. If you're on the fence about a mission trip you're being made to go on/invited onto, take it. If you're under 18 like me, its practically free travel. Seize the opportunity.\n\nSince we're a discussion-based sub, what are your thoughts? Do you have any questions about the experience? Should I cross-post to /r/Christianity or a similar sub?\n\n**TL;DR: Was sent on a Christian mission trip to Ecuador as an atheist, had a good time. What do you think?**",
        "created_utc": 1435959005,
        "upvote_ratio": ""
    },
    {
        "title": "With Gay Marriage legalized in all 50 states, do you believe that churches should be fined/otherwise penalized for refusing to marry a couple based on sexuality?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c046q/with_gay_marriage_legalized_in_all_50_states_do/",
        "text": "Over the past few weeks, many of my religiously conservative friends and family have been worried that churches will be penalized for refusing to marry gay couples. I can't help thinking that they're right.\n\nThis week, bakers in Oregon were fined $135k for refusing to bake a wedding cake for a gay couple, i'd assume the same will soon be true for churches performing weddings.\n\nIf we were to interchange the word \"gay\" for \"black\" or \"interracial\" or any sort of other feature that is inherited and has no proven negative moral value to society; then I think many of you would agree with me that it is discriminatory to refuse such a marriage. \n\nJust as it is punishable to deny someone service on the basis of race regardless of a governmental or privately funded services, the same should hold true for homosexuality. \n\nI don't profess to know much legally, but I think the logic follows here. What do you think: **Are we to allow churches a choice of whom to marry, or drag American churches, kicking and screaming, into the modern world?**",
        "created_utc": 1435938180,
        "upvote_ratio": ""
    },
    {
        "title": "Disproof of Islam - feedback appreciated",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bzoch/disproof_of_islam_feedback_appreciated/",
        "text": "",
        "created_utc": 1435929743,
        "upvote_ratio": ""
    },
    {
        "title": "We often don't see Balance when we discuss Islam",
        "author": "Anandya",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bzju3/we_often_dont_see_balance_when_we_discuss_islam/",
        "text": "",
        "created_utc": 1435926878,
        "upvote_ratio": ""
    },
    {
        "title": "I feel rude, but theism doesn't have a leg to stand on.",
        "author": "sprawn",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bziw2/i_feel_rude_but_theism_doesnt_have_a_leg_to_stand/",
        "text": "When discussing these matters with theists, the clever ones seem to have one gambit: Flipping the burden of proof. Their arguments consists of various gambits, various tricks. They evade the questions with various emotional ploys, various methods claiming that they are somehow victims, other little ploys...\n\nThey have *nothing.* Either there *is* a \"super-nature\" or there is not. If there *is* a \"super-nature\" then for us to know about it, it *must* interact with nature *somewhere, somehow.* They claim they know the nature of this interaction, but all it is is a bunch of jiggery-pokery. Ask any hippy...\n\nThere is nature that we understand to a degree, nature we do not understand. The aspects of nature we do not understand can be divided into nature we do not yet understand and nature we will never understand. Claims about a \"super-nature\" are just non-sense. Either this \"super-nature\" and the various sentient, active beings who reside within this \"super-nature\" interacts with nature, or it does not. If it interacts with nature, then we should bring the tools of science to bear on it. If it does not interact with nature, *then it does not matter.*\n\nTheists will give you all kinds of BS about why they don't have to prove their supernatural claims, or why we should accept them as true until they are \"disproven.\" This is a very creative way of saying, \"I got nothing.\" They have nothing. It's a pig in a poke. At some point, the request for money will come. Money or sex, or both, that is. And somehow this will be \"the secret\" that somehow jim-jams the powers of super-nature. It's just a con-game! How can people not see this?\n\nWell it turns out that science *has studied con-games.*\n\nThere is no way around it. Religion is a con-game. I always have the same answer to religious people... Prove your super-nature, or shut-up. This is somehow thought of as \"rude.\" But I am not the one playing a con-game! And that's *exactly* the kind of trick con-artists use on their marks. Make the mark think that someone who is seeing through the con-game is being \"rude.\" There's nothing rude about it. If you believe supernatural claims on the basis of no evidence, *you are being conned.*\n\n**edit**: The discussion I would like to have is about engaging theists in such a way that is not insulting. I *can not* do it. But it is only because religions have rigged the game to make pointing out their lies seem \"rude.\" If someone you know keeps walking down the same dark alley and getting mugged every weekend, how is it \"rude\" to suggest that they find a different path? At the same time, I *would like* to hear a reasoned argument for faith, religion, gods, or super-nature, but I don't see how it is *even possible for a reasoned argument for these things to exist.* I have not seen anything that isn't pure balderdash within a sentence. The \"best\" arguments are from people like William Lane Craig, but his arguments are all just theatrical balderdash. He never offers anything resembling proof, just sophistry, equivocation, and cute tricks based on how words are defined. The arguments that ordinary people fall for are along the lines of: 1) Believe. 2) Don't believe anything or anyone that tells you not to believe. 3) Feels good, doesn't it? 4) What feels good? Something... something in your life feels good. 5) That's because you believe. Keep believing.",
        "created_utc": 1435926236,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking intelligent arguments on Islam",
        "author": "Derocka",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3by2ei/seeking_intelligent_arguments_on_islam/",
        "text": "",
        "created_utc": 1435891285,
        "upvote_ratio": ""
    },
    {
        "title": "Had a random person message me yesterday about still being able to be \"saved\"",
        "author": "Oriole_Alventa",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bt76a/had_a_random_person_message_me_yesterday_about/",
        "text": "",
        "created_utc": 1435792274,
        "upvote_ratio": ""
    },
    {
        "title": "Which Bible version does Exodus 21:10 say \"a man can marry an infinite amount of women without any limits to how many he can marry.\"",
        "author": "JustWonderingwhen",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bsfwk/which_bible_version_does_exodus_2110_say_a_man/",
        "text": "I see this as a common argument for poligamy in the bible but there is never a bible version attached and none of the versions I have found say anything like it. They all say \"If he marries another woman, he must not deprive the first one of her food, clothing and marital rights.\" or something similar. \n\nIs this a made up quote or is it in a version I am unaware of?",
        "created_utc": 1435780131,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for resources on the Documentary Hypothesis and Synoptic Problem",
        "author": "goodtimes50",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bqzxr/looking_for_resources_on_the_documentary/",
        "text": "I'm anticipating some conversations with some family members where the topic of scripture will come up. Naturally, the two topics in the title will probably end up being the focus. I'd like to find some resources that introduce these issues for the layman. If I point them to a bunch of overly academic stuff it'll likely not be very effective. Does anyone know of any youtube videos or articles that give a good overview?",
        "created_utc": 1435756590,
        "upvote_ratio": ""
    },
    {
        "title": "I am privileged to be able to be an atheist.",
        "author": "hypo-osmotic",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bqud7/i_am_privileged_to_be_able_to_be_an_atheist/",
        "text": "Something I've been thinking about a lot recently is that my life is good enough that I feel comfortable not being a part of a religion. I have a few of my own disadvantages, but at the end of the day I'm white, I'm able-bodied, and I live in a relatively politically stable country (not saying that you have to be those things to live a successful life, but I won't deny my privileges). It is fully within my own power to become happy and successful within my lifetime, so I'm able to live without a predefined purpose or the promise of heaven.\n\nBut there are people in the world that, no matter how hard they work, might not ever break free of their hardships. Maybe they live in a poverty-stricken nation, or they have a severe physical or mental handicap, or they can barely leave the house for fear of being killed by the people sworn to protect them. I can't fault them for believing in an afterlife that's better than their current life, or for believing that there's someone who rewards their struggles and punishes the people who hurt them.\n\nMegachurches that set themselves up in low-income neighborhoods profit from people's desire to secure a better life for themselves after death, and missionaries who travel to poverty-stricken areas of the world exploit people by telling them that everything will be alright as long as they do something as easy as believe.\n\nBut when it comes to the average religious person, I can't in good conscious look at them and think, \"I am an atheist because I am better than them.\" I am an atheist only because I can be, and maybe they cannot.",
        "created_utc": 1435753222,
        "upvote_ratio": ""
    },
    {
        "title": "The simple reason I'm an atheist, not a Christian, but open to other ideas of god.",
        "author": "ethernetcord",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bpbho/the_simple_reason_im_an_atheist_not_a_christian/",
        "text": "",
        "created_utc": 1435715325,
        "upvote_ratio": ""
    },
    {
        "title": "Help with simple refutation of creationist nonsense",
        "author": "AwesomePotato2",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bnoaq/help_with_simple_refutation_of_creationist/",
        "text": "Hi,\nI was recently forced to watch a lot of creationist nonsense about how radiometric dating is completely inaccurate, how macroevolution has never been observed and much more (never mind that they use it to 'prove' that their magical sky daddy did it). Is there a website or an article or a video with a simple and persuasive refutation of these arguments? Any help would be appreciated. ",
        "created_utc": 1435687093,
        "upvote_ratio": ""
    },
    {
        "title": "Suicidal teen.",
        "author": "ihatemeihateme",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bljxk/suicidal_teen/",
        "text": "Please help me. I don't know what to feel or think anymore.\n\nReligion is making me miserable. I have so many doubts. I have so many fears. I have so many questions,that I can seem to find the answer to. \n\nBut I can't-won't-leave my faith. I've been trying to think of my struggle as a god-given test,but part of me doesn't. \n\nYou might ask yourself why I am posting to this subreddit of all places,and not to whichever religion I belong to. \n\nThis isn't the first time I've had these feelings. I've tried posting to those aforementioned subreddit before and nobody cared enough to help,I guess. So I posted here instead,and frankly,was shocked by the amount of support and kindness I received. \n\nIn a way,I feel I belong here. But I know I shouldn't/don't? because technically,I can't. \n\nBut really, I don't have a clue what to think anymore. I just need someone to talk to about religion. I don't know if my input will be welcome in other subreddits,and so I turn to you guys. \n\nHelp me. Please. \n\n\n ",
        "created_utc": 1435640762,
        "upvote_ratio": ""
    },
    {
        "title": "I just had a little breakdown about death",
        "author": "FoldingUserFerrariic",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bl5pb/i_just_had_a_little_breakdown_about_death/",
        "text": "I'm young, 17, and I just feel like nothingness scares me...\n\nI've been an athiest for a long time, and I truly and honestly believe that I don't want to return to the time before I was born. To a point where I didn't exist...That scares me so badly. \n\nI don't really know what to do, I've accepted it and that's what's bothering me mainly. Other religions have their places of heaven and hell and all in between. Hell is better than nothingness, at least you're concious. I really just fear it beyond anything in the world. How do you guys deal with this?",
        "created_utc": 1435632774,
        "upvote_ratio": ""
    },
    {
        "title": "What response should one have to this sort of critique of same sex marriage.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bkdac/what_response_should_one_have_to_this_sort_of/",
        "text": "An ex teacher of mine just posted this on facebook. I wouldn't normally reply to something like this, but he has contact with so many people I feel as though someone should at least respond with something other than praise. There is so much i feel is wrong I don't know how to clearly and eloquently respond. \n\nHere is the brick of text from both facebook and his [website](http://bossecatholic.com/ssm/)\n\n&gt;So it’s been 3 days since the Supreme Court ruling on Friday and I have seen a plethora of posts on both sides of the issue. A big part of me wanted to avoid commenting on it myself (for reasons that may or may not come up later), but in everything I’ve seen and read, nobody has talked about the real reasons why this has happened, who caused it, or what the only feasible solution to it is. So because of that, I begrudgingly propose these many thoughts (none of which are original):\n\n&gt;Who are we to blame for this decision? Us. Our culture as a whole in general, yes, but also in particular, many of those who are so ardently against it: we Christians; and in a personal way, my fellow Catholics. All the talk this weekend has been about “redefining marriage”, like that’s something new. We’ve been redefining marriage for decades. It is our weakening of marriage that has led it to be in such a state that any real reason for not applying it to same sex couples has nearly vanished.\n\n&gt;What is marriage? Before getting straight to that, I’m going to first address the number one culprit that is ruining it. Prepare yourselves now, because if this post hasn’t alienated enough of you yet by my opposition to same sex “marriage”, this reason will; but I beg you to stick with me no matter how ridiculous the initial claim may seem. The problem, is contraception. Stay with me… Let’s follow a contraceptive mentality and the results of a contraceptive culture. Contraception removes the two things that since the beginning of humanity have gone together: sex and babies. Societies across the world have recognized this and therefore had a vested interest in creating a structure in order to provide a safe and healthy environment in which this can take place. Notice here, that this is not a religious argument. I am not talking about the Sacrament of Holy Matrimony, where Christ elevated marriage and revealed its mystical significance, origins, and purpose. I’m talking about a societal institution. Societies, by reason alone, have universally realized that children need a stable environment in which to grow up. Men and women running around procreating with abandon would have been noticed very early on to lead to some disastrous conclusions. By expecting people to marry in order to engage in such activities, it would first protect the women of the society, for where a poor excuse for a man can abandon a woman he has impregnated, she is much more committed, by choice or not, to the situation. It also protects any children. We can see that today; feel free to look up statistics of children that come from fatherless homes. So societies have always had a vested interest in marriage because it provided for stable families, which provided for stable and successful societies. State sanctioned marriage had no concern with whether or not two people were in love. It only had concern for its own well-being. As long as you stayed together, raised good productive members of society, they were happy.\n\n&gt;Up until the 1960’s, this remained the mentality of our culture. However with the invention of the pill and other contraceptive means, we started to be able to separate these two naturally coinciding things: sex and babies. This separation has led to a host of other problems (infidelity, promiscuity, increased sexual activity in young people, premarital sex, cohabitation, abortion, artificial conception, divorce, and yes, the acceptance of homosexual acts). Just in case someone doesn’t take those conclusions for granted, let me go into it a bit more. If I can dramatically reduce the chance of sex leading to babies, then the risk associated with an affair is much less, because whereas before I would have to worry about what would happen if a child resulted from this act of infidelity, I no longer have that issue. I am also less worried about having a child when I’m a teenager and before I can afford it or am mature enough to handle it, because sex doesn’t lead to babies. I can also not be careful and deliberate about whether potential partners will be a good mother or father; they can be just a one night stand. What else is abortion, but back up birth control? Somehow, inexplicably, sex led to a baby. That wasn’t supposed to happen, and since a baby isn’t convenient right now, I must kill it in order for my life to stay as planned.  Once sex and babies are separated, babies are no longer gifts from God that a couple can be blessed with anytime they engage in the marital act. Babies are planned for, budgeted, and expected. If I do not get one on my timeline, I will demand it, and take any means necessary to create one for myself, in a laboratory if necessary. Babies are something I have a right to, when I’m ready for one and when I want it. With contraception, marriage no longer has to be about raising a family. It is something I do for personal fulfillment and happiness. Maybe we’ll decide to have a baby, but marriage isn’t the first step to a family anymore, that’s secondary, it’s for my own personal satisfaction. When marriage is not about creating a safe and loving environment in which to raise children, children are no longer a hindrance to divorce. The marriage was never about them to begin with. If marriage was about my personal happiness, then once I’m no longer happy, divorce is only natural. And if sex doesn’t lead to babies, then why must sexual complementarity even be necessary? Yes it’s true that a male’s body only makes sense in light of a female, and a female’s only in light of the male. But that is a mentality that connects our bodies to our procreative abilities. When sex is removed from procreation, bodies are just tools to use in any way I want that gives me pleasure.\n\n&gt;So marriage was redefined Friday? I don’t think so. We’ve been eroding the meaning and purpose of marriage for decades. Gay “marriage” is just the latest result of it. It almost seems a necessary result. So first off, let’s take some responsibility. I say us because according to research, Catholics contracept in nearly the exact same percentages as non-Catholics and non-Christians. We are a part of the problem; we have contributed to all the results that come from contraception, and to a mentality where it’s difficult to figure out why sex same couples should not be able to be married. We can appeal to religious arguments and point out that engaging in homosexual behavior is a grave sin, but that will do little to convince non-Catholics. The point that should be made, and the reason I use quotes whenever referring to gay “marriage” is that it doesn’t make sense. From a mere etymological basis, marriage comes from the word “mother”, something incompatible with gay “marriage”, for no one can become a mother in a gay “marriage”, at least not without going outside of the couple themselves. It also doesn’t make sense on a societal basis. Governments grant marriage licenses because they have a vested interest in stable families. Children from stable families tend to do better in school, are less prone to criminal activity, require less government resources in order to pick up the slack from an absentee father, etc. All the interest government has in marriage is related to families. They therefore have (or should have) no concern with couples where that is a non-issue. Which brings be to my last question. Why would couples even want it? Why do you feel that your affection for each other needs validation by the U.S. government? On my wedding day, I did not care in the slightest that I was now married in the sight of the state of Kentucky or the United States of America. I was excited because I was now married in the sight of God; that my wife and I were now one flesh, in a union lasting the rest of our lives. I do not have my marriage license hanging on my wall, but our apostolic blessing. If it’s love we’re seeking, why do we need a bureaucratic method of governmental approval?\n\n&gt;My only thought is that while our minds reject the old stereotypes, our hearts still long for them. We’ve all grown up watching Disney films where the prince and princess live happily ever after. The church bells ring, and the rose petals fall from the steeple, and we see the idealized version of marriage. We don’t imagine them planning their budget to see if they can afford a child, or aborting one if it comes at an inconvenient time. They are the ideal. They are what marriage should be. So in a world where we have compromised or rationalized everything else away, we still want that moment. But the Church will never allow homosexual “marriages”, She can’t. And so realizing that, what is left but to settle for government approval, and put on all the trappings of Holy Matrimony and pretend. We tell ourselves it’s just as good when we know it’s not the same. That’s what makes me fearful of the next step. Domestic partnerships and same sex unions were not enough, we had to call it marriage. Will that facade soon fade away as well, and will churches start being prosecuted for not blessing these unions? It is not unheard of. http://www.huffingtonpost.com/2013/08/07/gay-couple-sue-church-of-england_n_3714609.html\n\n&gt;As I opened this post, I asked three questions: Why did this occur? Who caused it? And what can we do to fix it? I believe I’ve addressed the first two already, and the answer to the third is the inverse of the first two. In order to fix it we, Catholics and Christians, must start living the true meaning of marriage. Only if marriage regains its original meaning will the world be able to see that it makes no sense to legislate it, outside the constraints of supporting men and women in creating solid families, which benefits all of society.\n\n&gt;Final thoughts: I hope all of this has come across in the manner I intended. It is not an impetuous reaction, not homophobic or bigoted. Let us not let this drive us to hate, but love. True love. We must continue to reach out in dispassionate conversation with those with whom we disagree. We must continue to love those who are struggling with these desires. In a passage that is often quoted with this issue “Let he who is without sin cast the first stone”. No one should be throwing stones. But if we continue to read, Jesus also said, “therefore go, and sin no more”. Not throwing stones does not mean not calling sins sins. Jesus was clear that the woman caught in adultery had sinned, he just would not have her put to death for it. He came to take that on for her. That’s how we need to treat others. “Speak truth in love.” But remember love also speaks truth. If someone is doing something that is not good for them, being silent is far from loving. The more I love you, the more I will try to keep you from harm, even if we disagree on whether or not it’s harmful. We can no longer live in a live and let die society. So Catholics, reclaim your morality, be the fairy tale prince and princesses, be the ideal. Do not sterilize your love. Let your love be fruitful. Let true love win.\n",
        "created_utc": 1435618386,
        "upvote_ratio": ""
    },
    {
        "title": "Can we have a conversation about old testament rules?",
        "author": "I_Am_Not_Me_",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bjhg5/can_we_have_a_conversation_about_old_testament/",
        "text": "It's common knowledge that there are more than 10 commandments, but even the Jewish themselves say that they don't pertain to gentiles. They also say the same for the laws of the old testament, like eating shellfish, and all that weird stuff. So approaching it with intellectual honesty, is it fair to bring these things up to non Jews as something they fail to follow?\n\nMy thoughts are that it's the same God that gave them these rules, so even if they don't apply to them, they are still obeying the same author of these senseless laws.\n\nSecondly, if these laws don't pertain to gentiles, why are they in the bible at all?\n\nThoughts?",
        "created_utc": 1435604285,
        "upvote_ratio": ""
    },
    {
        "title": "Catholic Memes posted this. What do you think? Hate breeds hate.",
        "author": "DrDew",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bh2s3/catholic_memes_posted_this_what_do_you_think_hate/",
        "text": "http://imgur.com/gallery/r16OR3a/new  OK.  So a friend of mine likes Catholic Memes and I found this on their site.  I find it so extreme and offensive (of course people have the right to offend me, no problem), and I don't know how to rationally respond to such a picture equating the legality of gay marriage with a depiction of Satan.  SCOTUS ruled on the non-religious sanctioning of a legal right.  How would you compassionately respond to someone who equated gay marriage with Satan in a way that might slightly adjust their world view on the issue? http://imgur.com/gallery/r16OR3a/new",
        "created_utc": 1435550674,
        "upvote_ratio": ""
    },
    {
        "title": "Having major difficulty with this.",
        "author": "Alltruenews",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bgwji/having_major_difficulty_with_this/",
        "text": "I recently had a heart transplant and I'm doing great, but I have endured over 3 years of having faith in God and supernatural superstitions jammed down my throat. And these are people I really love! I politely smile but never agree to the insanity. Interestingly, most know that I'm atheist, however they like to use my transplant as an opportunity to illustrate the \"power of God.\" It's friggin' non-stop. Help!!!!",
        "created_utc": 1435546938,
        "upvote_ratio": ""
    },
    {
        "title": "Reminder: this is still the official stance of the Catholic Church on homosexuality and gay marriage",
        "author": "WastedP0tential",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3betj7/reminder_this_is_still_the_official_stance_of_the/",
        "text": "To be found here:\n\nhttp://www.vatican.va/roman_curia/congregations/cfaith/documents/rc_con_cfaith_doc_20030731_homosexual-unions_en.html\n\nNote this doesn't come from some radical fundie, fringe cult or WBC bigot, and isn't some outdated opinion from the Dark Age, as many Christians like to portray Christian doctrines they don't approve of anymore. It's from 2003, written by Joseph Ratzinger, approved by John Paul II.\n\nSome gems:\n\n\"There are absolutely no grounds for considering homosexual unions to be in any way similar or even remotely analogous to God's plan for marriage and family. Marriage is holy, while homosexual acts go against the natural moral law. Homosexual acts close the sexual act to the gift of life. They do not proceed from a genuine affective and sexual complementarity. Under no circumstances can they be approved.\"\n\n\"Sacred Scripture condemns homosexual acts as a serious depravity. This judgment of Scripture does not of course permit us to conclude that all those who suffer from this anomaly are personally responsible for it, but it does attest to the fact that homosexual acts are intrinsically disordered. This same moral judgment is found in many Christian writers of the first centuries and is unanimously accepted by Catholic Tradition.\"\n\n\"The homosexual inclination is however objectively disordered and homosexual practices are sins gravely contrary to chastity.\"\n\n\"Those who would move from tolerance to the legitimization of specific rights for cohabiting homosexual persons need to be reminded that the approval or legalization of evil is something far different from the toleration of evil. In those situations where homosexual unions have been legally recognized or have been given the legal status and rights belonging to marriage, clear and emphatic opposition is a duty. One must refrain from any kind of formal cooperation in the enactment or application of such gravely unjust laws.\"\n\n\"Allowing children to be adopted by persons living in such unions would actually mean doing violence to these children, in the sense that their condition of dependency would be used to place them in an environment that is not conducive to their full human development. This is gravely immoral.\"\n\n\"There are good reasons for holding that such unions are harmful to the proper development of human society, especially if their impact on society were to increase.\"\n\n\"If it is true that all Catholics are obliged to oppose the legal recognition of homosexual unions, Catholic politicians are obliged to do so in a particular way … When legislation in favour of the recognition of homosexual unions is proposed for the first time in a legislative assembly, the Catholic law-maker has a moral duty to express his opposition clearly and publicly and to vote against it. To vote in favour of a law so harmful to the common good is gravely immoral. When legislation in favour of the recognition of homosexual unions is already in force, the Catholic politician must oppose it in the ways that are possible for him and make his opposition known; it is his duty to witness to the truth. If it is not possible to repeal such a law completely, the Catholic politician, recalling the indications contained in the Encyclical Letter Evangelium vitae, could licitly support proposals aimed at limiting the harm done by such a law and at lessening its negative consequences at the level of general opinion and public morality.\"",
        "created_utc": 1435507253,
        "upvote_ratio": ""
    },
    {
        "title": "\"Hell is never mentioned in the Bible\"... Wut",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3behtn/hell_is_never_mentioned_in_the_bible_wut/",
        "text": "I saw someone say, for the first time ever, that \"The Bible never mentions Hell - there is no Hell in Christianity. And atheists certainly go to heaven cuz the Pope says so!\". This was said BY a Christian, and a rather devout one at that. She and a Facebook friend were in an argument over the recent marriage ruling (with her being on the Pro- side ), and I sat by, idly biting my tongue and trying my best not to intrude on their \"discussion\"\n\nWhat an odd situation to find myself in:\n... side with the girl who hopes to promote social progress at the cost of arbitrarily re-inventing the tenets of a 2000 year old religion, or stand in defense of the bigot who is actually reading his source material correctly?\n\nI suppose there is no real harm being done in picking and choosing passages from religious scripture, and re-interpreting or chucking out the evil bits. Folks who do this aren't our ideological enemies, and have been a driving force behind many of the recent social changes we've seen in American politics. Yet I can't help but be hugely embarrassed on their behalf whenever they go to such great lengths to adopt mutually exclusive beliefs in order to \"have their cake and eat it too\". \n\nHow is this *not* condoning deliberate self-deceit?  Liberals love to berate conservatives for trying to \"re-write history\", and yet we have an entire demographic of voters who seems to think that it's okay to ignore or deny uncomfortable truths and then whitewash them with flowery re-interpretations.  I suppose it's only human to want to ignore hurtful facts instead of coping with reality on its own terms. But it's not even possible for me, as an atheist, to have a one-on-one religious discussion with Christians anymore because they all seem to believe something vastly different. Different denominations don't even hold to the same core tenets anymore beyond \"stuff happened and Jesus died\".",
        "created_utc": 1435500189,
        "upvote_ratio": ""
    },
    {
        "title": "Those who grew up religious, do you struggle with a mixture of nostalgia and contempt towards church/religion?",
        "author": "Skwucky",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bdfuo/those_who_grew_up_religious_do_you_struggle_with/",
        "text": "Quick backstory: later teen years, I identified as agnostic if anything, but later on finally felt comfortable enough to be honest with myself and others that I was atheist and couldn't pretend to believe in something I was no longer convinced of. I have no dramatic falling out story with the last church I attended, though I did have many negative experiences with churches before. I just distanced myself from it gradually and attended less and less. Then I stopped going entirely since I became more and more uncomfortable with church in general as my beliefs changed. \n\nIn my mid twenties now and I still find myself nostalgic for a great deal of it. The community of people, the fact people who believed and worked could make work inside the church their full time job was awesome. Critique it all you want, but people who are able to put all their time into something they love rather than a 9 to 5 are a beautiful thing. I could never do that in a church even while I still attended. I can't fake it and I would be faking it if I tried. \n\nThat being said, there's many things about religion and churches I get frustrated and hate, as many people in this sub still do. I find myself equal parts hatred for religion, and nostalgia/longing for some of those experiences within churches that some of my old friends are still a part of. Are any of you in this boat? You find everything they believe to be ridiculous and often stupid, but envious of the community? Even though I'm definitely happier and healthier as an atheist, sometimes I wish I could go back because of the positive things I miss.",
        "created_utc": 1435465214,
        "upvote_ratio": ""
    },
    {
        "title": "Unbiased research into gays being able to raise happy and healthy children?",
        "author": "michigan85",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bcwwq/unbiased_research_into_gays_being_able_to_raise/",
        "text": "",
        "created_utc": 1435453098,
        "upvote_ratio": ""
    },
    {
        "title": "A review of my Church",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bceuv/a_review_of_my_church/",
        "text": "",
        "created_utc": 1435442566,
        "upvote_ratio": ""
    },
    {
        "title": "Fellow atheists, please stop bringing up shellfish",
        "author": "MrRykler",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bc6yb/fellow_atheists_please_stop_bringing_up_shellfish/",
        "text": "",
        "created_utc": 1435438204,
        "upvote_ratio": ""
    },
    {
        "title": "Dan Carlin has a discussion with Sam Harris on Common Sense",
        "author": "Pandemic21",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bbt0w/dan_carlin_has_a_discussion_with_sam_harris_on/",
        "text": "",
        "created_utc": 1435430679,
        "upvote_ratio": ""
    },
    {
        "title": "How would you cope?",
        "author": "mad_atheist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bbndu/how_would_you_cope/",
        "text": "\nI live in a theocratic country and I’ve been an atheist since I was 12. I can’t leave or apply for political asylum because of my family (they don’t want me dead over this as long as I don’t offend or trouble them or myself by voicing my opinions in public). Now years later the family is still fine, friends are not so good to be trusted with this secret , I can’t leave because of family (it’s complicated) and even if I wanted to , I don’t know how can I prove that my claim is eligible (BTW , Does anyone know anything about applying for asylum or its process?) . without risking deportation at all. The only way for me to leave since the economy is not so great, is education and that is going to take a looooooot of time. So with this not so clear background in mind, I need some advices.     \n\nI don’t think I can deal with this anymore. I simply can't live here anymore but I can't leave either. I’m interested in philosophy of religion but I can’t say anything or express myself , I can’t express my political opinions , obviously relationships are off the table here, I can't even wear the clothes that I like (who knew Fedora hats were Satanic!!). Only one of my friends (a nihilist) knows about this and he’s not interested in anything besides his work and frankly I don’t think he has anything to offer intellectually anymore. I need someone , I mean at least someone I can talk with. I’m bored ,tired and oppressed (still hopeful though), So what can I do? What would you do?\n\n     \n\n    \ntl;dr: atheist living in a theocratic country, can’t leave (complicated) and can't express myself in anyway here , its making me crazy , what to do?  \n\n",
        "created_utc": 1435427754,
        "upvote_ratio": ""
    },
    {
        "title": "Same Sex Marriage Decision and Rights",
        "author": "flubweet",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bbb6b/same_sex_marriage_decision_and_rights/",
        "text": "",
        "created_utc": 1435421243,
        "upvote_ratio": ""
    },
    {
        "title": "Let's all stop being being so damn respectful !",
        "author": "TheLighter",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3bagei/lets_all_stop_being_being_so_damn_respectful/",
        "text": "Yesterday saw 5 killings done around the globe (France, Tunisia, Syria, Kuwait, Somalia) with a death toll of over 225, including 200 civilians, all done in the name of Islam.\n\nWe had the usual \"this is not Islam\", this time not so much the \"Islam is a religion of peace\"; and on the other side the usual suspects (nationalist right wings) shout they hatred of any muslims and the danger of immigration, oblivious to the fact that most of the immigrants are actually try to flee from that very danger.\n\nBut I cannot find anyone \"normal\" raising the fact that *maybe* THIS is also islam ,and *maybe* we should rethink our approach to religions. All of them.\n\nI'm originally from France and remember that, at school, we had courses about the main 4 religions of France. The only time I learn about what Atheism really is was 15 years later, reading about it by myself. So what about starting small: adding the biggest religious opinion: atheism ? Teaching why some of us don't believe, what a meme (not an internet one) is, how religions prosper and feed on, etc. \nWhat about having political leader explain why they are atheists, instead of looking like they are sorry about it ?\n\nThe only reason this is not done is the respect that one HAS TO show toward religions. But the conclusion of the TED Talk done by R. Dawkins always haunt me in these situations: Let's all stop being being so damn respectful !",
        "created_utc": 1435396625,
        "upvote_ratio": ""
    },
    {
        "title": "Is God the greatest abortionist? Looking for a range of discussion and opinion.",
        "author": "GodSpeed_Lightning",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3b7gxz/is_god_the_greatest_abortionist_looking_for_a/",
        "text": "I had a small debate with theist friend when we went from the subject of birth control to her contention that I might have been a father without knowing it. What she was referring to was [fertilized eggs that don't implant in the uterine wall and thus don't result in pregnancy](http://www.livescience.com/43157-embryo-implant-signals-pregnancy.html). \n\nThe science is not exact, but I found two sources^[[1]](http://ask.metafilter.com/203529/What-of-fertilized-human-eggs-die)[[2]](http://www.whattoexpect.com/pregnancy/miscarriage/) that estimate an implantation rate of only 30 - 40 percent.\n\nMy point was that if God is the cause of all \"natural\" processes, and pro-lifers define life at conception, then God aborts more \"life\" than humans ever could.\n\nThe conversation between my friend and I played out like this (her words are in quotes, mine in italics):\n\n&gt; 1/4 of all pregnancies end in miscarriages but labeling God as an abortionist is completely sacrilegious and wrong. God is the author of life and therefore has the right to determine life and death. Abortionists are human and do not have the authority to choose life or death. Labeling miscarriage as abortion by God is disgusting.\n\n*So God is immune to his own moral code?*\n\n&gt; The fallacy in your argument is that God has to observe moral code. God is holy, perfect and righteous and does not need a moral code or compass or whatever to follow, God is God. Morals are rules created to follow the moraes (sp) of a group of people. God is the only being with the right to begin and end life. Also there is the point that man was created in God's image. God has the copyright for humanity and as it's creator oversees his creation.\n\n*Essentially God does whatever he wants, which includes in this case being totally culpable for actions that, if done by a person, would be totally culpable for? So taken to its logical extreme, if God kills an entire family for no reason other than \"he just feels like it,\" he has done no wrong, but if a person killed them, that person would be entirely responsible and doing something against God's human-defined moral code? Then again, we can go deeper and realize that God allows that person to murder a family after all because it is \"his will.\" I find it inconsistent that we exonerate what are clearly God's actions to be morally irrelevant yet apply harsh moral judgments to the same actions done by humans. This especially doesn't follow if God is a superset of humanity to begin with.*\n\n&gt; God does not allow people to murder. God gives people the choice to choose between right and wrong. God does not do evil. God has a firm hand on evil and allows it in his creation because he wanted his servants (people) to have the choice to server and obey. God gave man free will to obey his commands. God is a loving God and did not want unwilling servants to worship him.\n\n---\n\nThat's where I stopped debating and changed the subject since I know she could be hopelessly adamant. \n\nI know there are other examples of the Christian / theist God doing questionably moral things that Christians defend because it was \"God's will\" and it \"happened in scripture.\" Is it that certain theists can't isolate the idea the God is entirely arbitrary? An idea in itself? It seems like a variant of Epicurus' criticism on God, or the problem of evil:\n\n&gt; Is God willing to prevent evil, but not able? Then he is not omnipotent. Is he able, but not willing? Then he is malevolent. Is he both able and willing? Then whence cometh evil? Is he neither able nor willing? Then why call him God?\n\nWhen it comes to these \"natural miscarriages,\" I don't see how God isn't the culprit. He \"designed\" this \"natural\" process of which humans have virtually no control over. How is he not responsible, especially if some theists believe personhood begins at conception?\n\nI'm looking for someone to play devil's (God's?) advocate in this case, as well as provide other opinions on the matter before I can fully decide my own.",
        "created_utc": 1435335301,
        "upvote_ratio": ""
    },
    {
        "title": "If all atoms in your body were separated then reorganized exactly, would you still be you?",
        "author": "SquawksPopuli",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3b6263/if_all_atoms_in_your_body_were_separated_then/",
        "text": "I'm trying to rationalize this question. My thought is that it would be an exact copy of you, completely indistinguishable to an outside observer, but that a break in consciousness means that the original \"you\" is dead and there is now a new you, who of course does not know it's not the original you. But this conflicts with a belief that we are only our physical self with no \"soul,\" or rather consciousness external our physical form, so to speak. Just confused...",
        "created_utc": 1435302309,
        "upvote_ratio": ""
    },
    {
        "title": "Is anyone here knowledable on classical theism and have considered it false?",
        "author": "DwindlingFaith",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3b4ji1/is_anyone_here_knowledable_on_classical_theism/",
        "text": "Disclaimer: This may or may not come off as preachy and I'll try not to let it.\n\nI've been somewhat recently introduced to the concept of classical theism, followed by some of the writings of someone by the name of [Edward Fesser](http://edwardfeser.blogspot.com/2010/09/classical-theism.html) on the topic (it's a long read, though). I'm no philosophy major (or really all that learned on the topic), so all I really know about it is that it's rather different from the 'modern theism' that theistic debates are often centered around, though I personally can't tell you exactly how that is. It delves into concepts like 'divine simplicity' and rejects ideas of 'theistic personalism' (theists that conceives of God as essentially a person, just without human limitations).\n\nWhat I'm really looking for are the fellows among you guys that are already knowledgeable on the topic and still think it's false or at least haven't been convinced of it. I'd like to get your opinion on the matter, because I'm still not certain of its validity myself.",
        "created_utc": 1435271014,
        "upvote_ratio": ""
    },
    {
        "title": "Who is your favorite atheist character from a fictional series?",
        "author": "N8theGr8",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3b2pui/who_is_your_favorite_atheist_character_from_a/",
        "text": "I listen to a podcast called 'Geeks without God' (http://geekswithoutgod.com/ if you want to check it out) and they always ask their guests this question.  It got me thinking that I would like to hear from more people about who their favorite atheist character is and why, along with potentially learning about a new book, movie, or tv show to enjoy.\n\n**edit** ~~Guys, don't forget this subreddit has a 200 character requirement for comments.~~  We're here for discussion.  Try to expand on the topic a bit, instead of just saying a character's name.",
        "created_utc": 1435241844,
        "upvote_ratio": ""
    },
    {
        "title": "Famous Atheist Sayings",
        "author": "EricGorall",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3b14v0/famous_atheist_sayings/",
        "text": "",
        "created_utc": 1435201989,
        "upvote_ratio": ""
    },
    {
        "title": "Beginning to question my current \"religious orientation\".",
        "author": "findingmynewpath",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3az8ke/beginning_to_question_my_current_religious/",
        "text": "Hey all,\n\nI'm not going to delve into to much information for anonymity, but: \n\n*TL;DR:* I am starting to feel that I identify, now, more as an atheist than I have in the past and am experiencing overall confusing thoughts.\n\nMy story: I've been born and raised and proudly live in the South Eastern United States. I am married, have an infant child, and living the typical American life in the burbs. I'm in my mid twenties and have a lot going for me right now, which I feel may (?) be relevant toward this in my life.\n\nMy mother had me attending church every Sunday (at least as much as possible) while growing up. We went to multiple denominations of worship, of which I got a certain fulfillment that the one of others didn't provide, making me a more \"experienced\" Christian in terms of seeing different ways to live a Christian life. \n\nFast forward to post high school, I attend college and meet a girl at one of the campus's Christian organizations, we both hit it off and decide to one day where fancy clothes, get married, have a baby, etc. (I'll get back to this point in a second).\n\nWhile in college, I began studying physical sciences, engineering, and mathematics. Something flipped in my brain at some point and it was the first time that I questioned my faith, but not much came of it, as I ignored it ultimately and continued to my Christian life. This would happen multiple times as my education continued.\n\nFast forward to post college. Wife and I move to a city, find a great church, a very liberal, free thinking, all accepting church. We both really enjoy it there and are excited to be involved in this church. Fast forward a few months, we make a baby. Our church family embraces us and our new spawn amazingly. It is just a great place for us.\n\nHowever, a few months later, I began to doubt again. This time is started happening during a service, in which our pastor was preaching and I just thought \"This can't be real.\" From that point on I've been in a constant struggle between what I am (or am not)  in terms of religion.\n\nGive it a few more weeks, I feel I'm in an agnostic state of confusion. I want to identify, but really can't. The issue is, I don't know that I can tell my wife. She is means so much to me, but I know how much religion (mine and her's both) means to her. I think I could live my life putting up a face and never admitting my belief, if I am to one day believe I am an atheist. At the moment, I have no problem with my child being raised in going to church, definitely the church we go to, that will help him learn (on top of our teachings) how to not judge.\n\nI'm not really sure if I have a question or anything, but it does feel good to express my current thoughts.\n\nI'd love to discuss this with some people to help me, or maybe someone else in my position.\n\nThank you reading and any insight you can provide!",
        "created_utc": 1435169538,
        "upvote_ratio": ""
    },
    {
        "title": "My personal thoughts on the benefits religion",
        "author": "nathanv221",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ayweb/my_personal_thoughts_on_the_benefits_religion/",
        "text": "Last year I was fairly hard set in my belief that religion caused more problems than it fixed. I had one friend who is in a Christian group called intervarsity which isn't really a church, more of an extra bible study for people who actually want to live by the word of their lord. I decided to try going to one of the weekly groups to prove to myself that I can be open minded (stupid and vain, yeah I know) and I started off disagreeing with everything and getting into surprisingly interesting debates. Some of their beliefs (most of theirs anyway) are that the new testament over powers the old whenever they disagree (ex. Stone adulterers vs let he who is without sin cast the first stone) and while I still disagree with the many of their beliefs and they did not manage to convince me that the Bible was in any way the truth they did show me a number of the uses of religion.\n\nI know many of you may disagree with me on the following, but it is what I have found after befriending many of these people: \n\nI believe that religion does give a number of guidelines by which a person can live a fruitful life. I do not agree with all of them but many are good and would potentially not be a part of our culture if not for religion, such as being faithful to your spouse, taking a day for relaxation, etc. \n\n\nAnother benefit I found was the sense of community, a Christian can go anywhere in the US and most of the rest of the world, know nobody there and instantly be a part of a community of people who will look out for one another.\n\n\nThe third thing I found was that it provides a therapeutic outlet in which a person can have a definite answer on whether they have done something wrong and can then talk to somebody about it and feel forgiven.\n\nFourth, it gives a solid purpose for living. Most of us have had to find our own reasons or attempt to ignore the question altogether. While the journey to find your own answer is a great growing experience it is also a painful one, and while I wouldn't give it up, it would have been nice to have a book that could guide me on that path.\n\n\nThe last thing is prayer. I do not believe that god will answer a prayer, I do however believe that there is a placebo effect, and also it feels good to know that there is a group of people who are wishing you well in whatever hardship you are in. I believe that having that positive frame of mind should not be underestimated.\n\n\nThere are obviously a great many problems with religion, but most of this sub is already dedicated to pointing those out so I thought I would share some of the good things I think religion offers. I have shared these thoughts with a couple of my closer friends in that group but I would be interested in feedback on my thoughts from a group who holds the same beliefs as me.",
        "created_utc": 1435164252,
        "upvote_ratio": ""
    },
    {
        "title": "There is a \"why you believe in God\" askreddit and I just want to know what you think of the answers.",
        "author": "aclose78",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3axrx9/there_is_a_why_you_believe_in_god_askreddit_and_i/",
        "text": "I just really want to know what you people think. I'm not on the fence about it either. I wasn't before I found this out, but it puts in perspective that there's no-one to tell them otherwise. I found out a guy younger than I that I worked with has 2 months to live. Inoperable brain tumor. I can't take these claims of miraculous fortune seriously. I can't find the words for my disgust at these people who think that despite all the death in the world that their being spared is some kind of proof of God. I just don't like the tone of it. I continue to live so there's a God. There's nobody on the other side of that coin to tell them anything different.\n\nEdit: Evidently what I'm saying isn't quite clear, so at the core, what I'm saying is these people believe because it turned out ok for them. There isn't anybody on the other side of things (like people who died) to tell them the down side of what happened. It's basically saying that I'm here still so God. Dead people don't have a voice.",
        "created_utc": 1435141625,
        "upvote_ratio": ""
    },
    {
        "title": "\"Here is a solar system inside a galaxy, and one of the peculiarities of this solar system is that, at least on planet earth, it 'peoples' in the just the same way that an apple tree 'apples.'\"",
        "author": "proselitigator",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ax07s/here_is_a_solar_system_inside_a_galaxy_and_one_of/",
        "text": "",
        "created_utc": 1435120307,
        "upvote_ratio": ""
    },
    {
        "title": "On islamophobia...",
        "author": "SeismicAltop",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3awlm9/on_islamophobia/",
        "text": "I've really been thinking lately about islamophobia. There's been a lot of discussion going on about lately, so I'm going to state my view. Feel free to change my view, support it, I really just need some thoughtful commentary.  \n  \nI've been hanging around /r/socialism lately, and they really seem to think if you're against Islam, you're a racist. The article that got me thinking about this is [here](https://redflag.org.au/article/no-islam-not-race-yes-you-are-still-racist), and I have some major problems with it. First, it makes you assume that all Muslim people are Arabic. If anything, that's racist. I am against Islam just like I'm against Judaism, Christianity, Satanism, Scientology, and Catholicism. I find religion to be a force for evil on this world. And the thing is, each of those religions attracts people of ALL races. I'm against an Islamic White person just as I am against an Islamic Arabic person. And when I say against, I don't mean \"bash\" violently and physically as the article states. I believe in nonviolent forms of persuasion, and I believe in education. Just because you're against Islam doesn't mean you have to be violent. I would calmly debate a white person, black person, arabic person, it doesn't matter. Race is playing no role in my belief.  \n  \nSecond, the article makes it seem like there is an extra form of disagreement towards muslisms than there is christians or any western religion. I take religion at face value. I don't care if your book says \"be nice to everyone and make the world a better place\". If your chopping people's heads off and following Sharia Law, there is definitely something wrong going on. Now the main argument against that is, \"well that's just the radical few\". The truth is that the majority [support it](http://www.pewforum.org/2013/04/30/the-worlds-muslims-religion-politics-society-beliefs-about-sharia/). It's a worrisome situation when the majority of middle-eastern muslims believe that sharia law should be the law of the land. It's troubling when the majority of muslims believe that Charlie Hebdo should have been put on trial when he was making the comics. (Can't find this stat; It was around 60% that wanted him on trial I believe).  \n  \nThis is my argument. My disapproval of Islam is not based on race the same as my disapproval of Christianity is not based on race. Any thoughts?   ",
        "created_utc": 1435112195,
        "upvote_ratio": ""
    },
    {
        "title": "\"Preference falsification\" and \"weaponized sacredness\" - what people really believe vs what they say they really believe.",
        "author": "clupus",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3avza5/preference_falsification_and_weaponized/",
        "text": "&gt;Preference falsification is an information theory term for the tendency for people to express a public preference that is different from their private, interior preference. For various reasons, certain preferences may not be publicly acceptable to express; they may be punished by execution, or labor camps, or exile, or social exclusion, or at the very least suspicion and a risk of some of these things. \n\n&gt;When people do not express their true preferences, they are deprived of the opportunity to coordinate with each other to create a more preferable outcome for both. Preference falsification is not just a political phenomenon, but a product of our dual nature, experiencing ourselves on the one hand from the privileged first-person perspective, and on the other hand from the imagined perspective of others. Pretending to have different preferences than one really does may be necessary to maintain a sense of safety, social belonging, and status. \n\nhttp://www.ribbonfarm.com/2015/05/07/weaponized-sacredness/\n\n\\-   article  goes  on  at  great length  about the  ramifications  of this. \n\nWe should all be very familiar with this  phenomenon -  a great many people are really atheists,  but for reasons ranging from fear of disapproval to fear of death, don't feel that they can say so.\n\nBut  with  contemporary \"New  Atheism\" - or if you don't like that term, simply \"atheism over the last 15 years or so\" -  we're seeing much greater levels of recognition that many people are  really atheist, much greater openness about publically stating that one is atheist, and much higher levels of  \"coordinating with each other to create a more preferable outcome for both.\"",
        "created_utc": 1435100775,
        "upvote_ratio": ""
    },
    {
        "title": "What does the nonexistence of free will mean, with regard to creativity and new ideas?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3av00x/what_does_the_nonexistence_of_free_will_mean_with/",
        "text": "",
        "created_utc": 1435085522,
        "upvote_ratio": ""
    },
    {
        "title": "X-post from /r/french: Who are the contemporary French atheist in the line of Voltaire, Camus, Sartre, Hitchens, Dawkins, Harris and Kraus",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3auecp/xpost_from_rfrench_who_are_the_contemporary/",
        "text": "France has been a \"précurseur\" of Atheism (via Voltaire, Diderot  and later the existentialists Camus, Sartre) .  The word  ~~even stems from the  French \"athéisme\"~~\n\nI am trying to raise my kids so that they can make choices but also want to expose them to contemporary French atheist speakers. They are in their early teens so YouTube and alike works ;)  \n\nDo you have any suggestions?\n\nEdit:  As pointed out \"atheism\" is obviously stems from Greek \"atheos\" (what was i thinking ;)   \n\nNote i am an ex-pat in France with Kids who only speak French.",
        "created_utc": 1435076328,
        "upvote_ratio": ""
    },
    {
        "title": "Buddy poked r/Christianity with a stick and got banned. You can see why.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3atnvd/buddy_poked_rchristianity_with_a_stick_and_got/",
        "text": "",
        "created_utc": 1435062981,
        "upvote_ratio": ""
    },
    {
        "title": "I was beaten up and singled out this weekend for being an atheist.",
        "author": "IntellectualEuphoria",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3atgwj/i_was_beaten_up_and_singled_out_this_weekend_for/",
        "text": "",
        "created_utc": 1435058130,
        "upvote_ratio": ""
    },
    {
        "title": "Here is Practical Explanation about Next Life, Purpose of Human Life, philosophical/religious facts, theories etc.",
        "author": "awaooie1",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3atf8o/here_is_practical_explanation_about_next_life/",
        "text": "",
        "created_utc": 1435056816,
        "upvote_ratio": ""
    },
    {
        "title": "Were anybody else born an atheist?",
        "author": "ryanfranke",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3asuz7/were_anybody_else_born_an_atheist/",
        "text": "I never really believed in god since i was born. I never legitimately thought people *actually* believed any of that. I never had an awakening moment where i became an atheist, unlike some people. I'm wondering if anybody else feels this way.\n\nEDIT: Why the downvotes?\n\nEDIT2: I should've rephrased the title, \"Has anybody else always been an atheist?\"\n\nEDIT3: Thanks for all the comments. I can now conclude that most people have always questioned religious beliefs even when a child",
        "created_utc": 1435039660,
        "upvote_ratio": ""
    },
    {
        "title": "What works of art inspired by religion do you appreaciate even though you are not a follower?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3asryh/what_works_of_art_inspired_by_religion_do_you/",
        "text": "",
        "created_utc": 1435037495,
        "upvote_ratio": ""
    },
    {
        "title": "What is wrong with this argument?",
        "author": "TheOtherCollin",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ashnz/what_is_wrong_with_this_argument/",
        "text": "I am simply curious as to what is wrong with the following argument.  I think I may have found a couple things but I am not entirely sure about those points, so I just wanted to see what you all had as criticisms for it.\n\n---\n\nDefinition 1:  A potential, for the sake of this argument, refers to a logically possible (containing no inherent contradictions) occurrence.\n\n\nDefinition 2:  A set of potentials, again for the sake of this argument, refers to a collection of potentials relating to the same point or area in space and time or the lack thereof, just as long as the set refer to the same instance.\n\n \nDefinition 3:  Something that is necessary is something which would be absolutely required by reality, in that reality could be no other way, in that there is something incoherent about a reality without that necessary something.\n\n \nPremise 1:  If there are multiple potentials in a set of potentials, then no single potential within said set of potentials is necessary.\n\n \nPremise 1a:  If there are multiple potentials, then reality does not only have a single options to conform to.\n\n \nPremise 2:  The set of potentials that is the beginning of the universe contains multiple potentials.\n\n \nPremise 2a:  There are many non-contradictory models of possible universes and possible beginnings of the universe, even if they do not conform to what reality actually is; they still describe a possible way things could have occurred.  Possible entire universe models can be imagined that are entirely different from the one we know with different physical laws.  There are so many things regarding the nature of and beginning of the universe that could, in theory, have been different; therefore, the way the universe is now and how it began, are, by no means, necessarily as they are.\n\n \nConclusion 1:  The way the universe began is not a necessary way for the universe to begin, regardless of what it actually was.  (From premises 1 and 2)\n\n \nPremise 3:  For every set of potentials to narrow down and allow one of the potentials in the set to become a reality, there must be a causal or deciding factor (not necessarily a conscious deciding factor, though).\n\n \nPremise 3a:  There are no examples of possible but not necessary occurrences that occurred without something prior that caused the potential to become a reality out of a set of potentials; therefore, there is no reason to think that such a thing could occur.\n\n\nPremise 4:  If there is not an infinite regression of causal or deciding factors, there is an initial deciding factor.\n\n \nPremise 5:  There cannot be an infinite regression of prior deciding factors.\n\n \nPremise 5a:  There is nothing inherently wrong with infinite sequences in general, but infinite sequences of causes is where problems arise in that there cannot be a sequence of causes that goes backward forever because there would be no beginning; a beginning to a sequence of causes is necessary for anything to be caused at all.\n\n\nConclusion 2:  There is an initial cause for the beginning of the universe.  (From premises 4 and 5)\n\n\nPremise 6:  An initial cause for the beginning of the universe must not be something that is caused.\n\n\nPremise 6a:  Something that is caused cannot be the initial cause of all else but itself.\n\n\nConclusion 3:  The initial cause for the beginning of the universe is uncaused.  (From Conclusion 2 and Premise 6)\n\n\nPremise 7:  For something to qualify as uncaused, it must be necessarily existent or occurring.\n\n\nPremise 7a:  If an entity or occurrence is only possible rather than necessary, then there are other options, which then requires some deciding factor to play a role in the entity or occurrence's actualization, thus making it caused; however, a necessary entity or occurrence does not require a deciding factor, thus making it uncaused.\n\n\nConclusion 4:  The initial cause for the beginning of the universe is necessary.  (From Conclusion 3 and Premise 7)\n\n\nPremise 8:  Anything that is necessary, by definition, exists.\n\n\nConclusion 5:  There exists an initial cause for the beginning of the universe.\n\n\nPremise 9:  Anything, regardless of form, that is the absolute cause of all else (the universe) can be said to be a deity alike to that believed to exist by Deists and Deism.\n\n\nPremise 9a:  There is no requirement for a deity of Deism to be conscious, not conscious; it could have some non-binary option in the same category that is unimaginable to us.  If this deity exists, there is no way really to determine the state of consciousness or lack thereof that it possesses.\n\n\nConclusion 6:  There exists an entity that is the necessarily existent, uncaused cause of all other than itself (the universe), whether conscious, not conscious, or some non-binary option in the same category, that can be classified as a Deistic god.  (From Conclusions 2 through 5 and Premise 9)",
        "created_utc": 1435031215,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone else had problems with depersonalization after becoming Atheist?",
        "author": "koko_koala94",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ar2u9/has_anyone_else_had_problems_with/",
        "text": "So I have been feeling DPR for the past month or so, and I feel like it has totally consumed me. I am super grateful to live in a time period with the internet and to find out there is an online community of people who will understand what I am feeling and talking about. So after figuring out denationalization had its own word and looking it up for hours, these are the contributing factors I thought of to make me get here.\n\nThe first thing is growing up I had a rough child hood. My step dad was very harsh and I spent a lot of my time a lone with no T.V. or internet in an emotional state. The routine since I was a child was get in a huge argument with my dad over something dumb (not being dramatic, even other parents and mentors to my parents say my parents are too intense) then be sent to my room with nothing for days with no interactions and only my thoughts. I would think about how different my life would be if I had told my mom I didn't like my stepdad when they were still dating. When I was younger (12-18) I would often cut myself because I was angry with myself for \"being so stupid back then\" and \"not being able to for see what he would actually be like\". So basically during these years is when i developed my brain in a way where I was always thinking to myself about everything I did because I was my only company.\n\nNow during the above mentioned it was all chill dpr wise because I was very religious. I would pray during these times where it felt like I was talking to god, and I took most things in the bible to be true. I was active in my church and many people I admired were very religious too. Religion helped.\n\nSo now in this past year I have gotten really into history. Everyday I would be online watching a new documentary about some different historical person or event and I was super into it. But learning about all these people who lived their entire lives without any concept of the god I had was disheartening. I had always felt like it was convenient that everyone I knew was in the \"right\" religion and there was a good chance it was all fake but I never really confronted these thoughts and felt it was just chill to be Catholic.\n\nBut a couple of weeks ago I did confront these thoughts. I did a lot of research and came to officially call myself an atheist. At first it was exciting and I felt enlightened. I am now more driven than ever to learn things about the universe like science and how electricity works and how computers work. But after this exciting feeling faded I felt alone and uncomfortable. I began to question everything and my mind is consumed with thoughts of reality, self, time, \"destiny\", space, death like non stop. I am constantly thinking about multiple things at once. I feel like I rarely live in the moment but have internal dialogues about everything I do. I question everything to the point where things seem foreign to me. Like I feel like an alien or something watching these weird creatures called humans interacting with each other. The human face doesn't look familiar to me anymore, cars don't look familiar, societal structures etc. I think about how we are just the universe and different compounds and I feel like my skin and the air around it are one. I get this numb tingly feeling all over my body. I feel one with everything even though it at times feels foreign.\nBut sometimes when I go out and see people being happy and shit it makes me sad. Especially when I see old christian couples or mentors of mine that are christian. I feel like we are all just kidding ourselves about death and use culture and religion to preoccupy ourselves (terror management theory). I dont want to talk to any christian people about this because I dont want to force them into thinking this way.\n\nSome good things of this though are like I said I am like addicted to learning now about everything and also social settings are easier to handle now that I think none of this could be real or like it wont matter anyways because we'll all be dead someday.\nI am going to smoke less weed and hang out with people more. Exercise. I love knowing I am not the only one like this. Hopefully talking with some of you will help. I am constantly at odds with whether I wish I was still religious and never thought of these things living life in the moment or if I am happy to embrace these thoughts that feel like a sad enlightenment\n\nwould love to talk to some people who can relate",
        "created_utc": 1435005718,
        "upvote_ratio": ""
    },
    {
        "title": "Can you settle this debate I'm having with a friend?",
        "author": "FedoraSenpai420",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3aq64w/can_you_settle_this_debate_im_having_with_a_friend/",
        "text": "***FINAL UPDATE***^probably:\n\nThanks again to everyone who's commented, and thanks to the mods who didn't delete this post. Thanks to you, we've about settled the debate.\n\nNow that the debate is over, I can make this comment. Mine was heads, his was tails, and I've noticed a lot of people said that heads made the two terms mutually exclusive. The whole point of my definitions (heads) was to point out that they *weren't* exclusive, and that you could be agnostic and atheist. I'm not sure where people were getting the exclusive thing from, since some one who lacks belief in a god or gods (atheist^1) can still think that the possibility of knowledge of said god or gods is unknowable (agnostic^1) and maintain neutrality (agnostic^2) without outright making any claim. Maybe somebody can clarify.\n\nStill, this has been a great thread, and I hope it isn't deleted on the grounds that we have these definitions readily available elsewhere. It's interesting to see how so many people agree on the general idea, and still have so much disagreement on the details of these two words. Thanks again, everybody. \n\n**Now here's the original post:**\n\nFriend and I are having a debate on the definitions of atheist and agnostic, and whether or not they can be the same thing. We decided it would be settled by votes given by atheists and agnostics. We also both read and agreed that what's written below is an accurate representation of both sides. \n\n*I flipped a coin to decide whose idea goes first, to avoid any kind of bias.*\n\n* **Heads**\n\n^*Atheist*\n\n^1 Someone who either lacks belief in a god or gods, or makes the claim that there is no god or are no gods. \n\n^2 Catch-all term for anyone who isn't theist (believes in a god or gods).\n\n^*Agnostic*\n\n^1 Someone who claims/believes knowledge of god is unknown or unknowable. Makes claim as more of a theory on knowledge of god than the existence of god.\n\n^2 Some one who holds a middle and/or neutral stance on something.\n\n* **Tails**\n\n^*Atheist*\n\n^1 A person who makes the claim that no god or gods exist.\n\n^*Agnostic*\n\n^1 Some one who thinks a god or gods might exist.\n\n^2 Some one who holds a middle and/or neutral stance on something.",
        "created_utc": 1434991177,
        "upvote_ratio": ""
    },
    {
        "title": "Volunteer work",
        "author": "insert_disk_6",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3apogv/volunteer_work/",
        "text": "I've got about 3 hours per week, and I'd like to use it to make the world better.\n\nI'd like to start volunteering somewhere. Volunteering was never a big part of my life as a Christian, but now that I'm an atheist, it seems really important. Where do you guys volunteer? What lessons have you learned?\n\nI was thinking of helping at a local crisis center, but I'm not the kind of person that's gone through hell and back. I'm not sure how much I'd be able to help someone in the abysses of substance abuse or domestic violence.",
        "created_utc": 1434982689,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on The Zeitgeist Movement...",
        "author": "issue27",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3and25/thoughts_on_the_zeitgeist_movement/",
        "text": "",
        "created_utc": 1434926060,
        "upvote_ratio": ""
    },
    {
        "title": "I wanted to give you guys a HUGE thank you",
        "author": "Buddy813",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3amzcp/i_wanted_to_give_you_guys_a_huge_thank_you/",
        "text": "I suffer from severe anxiety and panic disorder. The biggest fear that gave me anxiety was being afraid to die. After reading atheist theories and arguments. I have only officially became an atheist, but oddly it has taken away my anxiety of death. Not sure how to explain how it made me feel better, but it did. That's at least one trigger that I shouldn't have to worry about again. Thank you guys so much for your insight and ideas!",
        "created_utc": 1434918814,
        "upvote_ratio": ""
    },
    {
        "title": "My SO's (19F) dad believes he saw a ghost/spirit.",
        "author": "PM_ME_UR_CRUSH",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ahyul/my_sos_19f_dad_believes_he_saw_a_ghostspirit/",
        "text": "",
        "created_utc": 1434795770,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a collection of rebuttals for WLC's arguments?",
        "author": "DawkinsBulldog313",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3aht03/is_there_a_collection_of_rebuttals_for_wlcs/",
        "text": "Hi,\nI'm sure someone has done it before me, does anyone have a link to a post which summarizes and refutes all of the usual WLC's arguments (ontological, moral, teleological, kalam, historical jesus)?",
        "created_utc": 1434789327,
        "upvote_ratio": ""
    },
    {
        "title": "Have we turned \"terrorism\" into meaning violence committed only by Muslims?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ahhqw/have_we_turned_terrorism_into_meaning_violence/",
        "text": "This post is mainly for American citizens; please read the article and my post to it's totality before commenting:\n\nhttps://firstlook.org/theintercept/2015/06/19/refusal-call-charleston-shootings-terrorism-shows-meaningless-propaganda-term/\n\nPretty fair argument by Greenwald regarding Western society's disposition towards the term \"terrorism\", shootings like Charleston would've meant a terror attack since it fits the criteria of McVeigh and the Unibomber. Yet now events such as this and Elliot Rodger - despite having manifestos clearly documenting their desire to kill others and their ideological beliefs for doing so - are not labeled terrorists. \n\nConversely, a random gunman in Copenhagen is immediately branded a terrorist attack because the shooter was Muslim; the mentally ill man in Canada is branded a terrorist and accused of being involved with Syria's branch of ISIS until further information revealed he was a mentally ill man who believed that he was possessed by the devil; Canada's government then admits that they made-up his connection to the Syrian terrorist group. \n\nIt seems that whenever there is terrorism, we begin this self-exalted self-worship about how they don't understand our rights, our privileges, our cultures, or whatnot and have marches championing democratic rights that actually have less legal power than they did 20 years ago; yet we ignore how our governments bomb their cities, how in the past our governments enforced sanctions that cause mass genocide, and how we launch wars for \"humanitarian reasons\" - because bombings and gunfire are now \"humanitarian\" in our culture and traditions - while our soldiers are always stationed to protect the oil fields and their oil is always traded on the US dollar. \n\nBut this is all \"liberal whining\", because the deaths of children in war, genocide, and putting despots in power while arguing the other side is somehow too dumb for democracy - ignoring the fact our government has ruthlessly destroyed all attempts at democracy flourishing in Latin America and the Middle East for the past 40 years - so that we can argue about how they hate our \"freedoms\" of which we no longer have thanks to the NDAA.\n\nWho are we trying to fool?\n\nThey hate us for our freedoms? Maybe we need to re-check history.\n\nThe list of times the United States has crushed the attempts of other countries from making a democracy:\n\nSyria 1949 \n\nIran 1953\n \nGuatemala 1954\n \nTibet 1955\n \nIndonesia 1958\n \nIraq 1960 \n\nDemocratic Republic of the Congo 1960 \n\nDominican Republic 1961 \n\nSouth Vietnam 1963 \n\nBrazil 1964 \n\nGhana 1966 \n\nChile 1970 \n\nArgentina 1976 \n\nAfghanistan 1979 \n\nTurkey 1980 \n\nPoland 1980 \n\nNicaragua 1989",
        "created_utc": 1434779265,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know how to deal with this?",
        "author": "Gammaquad",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ahh4x/does_anyone_know_how_to_deal_with_this/",
        "text": "Hi everyone! I'm new to this subreddit. I don't really know that many other atheists IRL. Getting back to the point of the post, I often find myself being forced to go to the temple by my parents (I come from a Hindu family). They are comfortable with me being an atheist (my father even had an atheist \"phase\") but they never seem to buy any arguments I give into getting out of going. I don't want to convert my family but I just want them to understand. Please help!",
        "created_utc": 1434778666,
        "upvote_ratio": ""
    },
    {
        "title": "An argument my mother likes to use",
        "author": "GrandRouge",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3agoz4/an_argument_my_mother_likes_to_use/",
        "text": "She's been a big fan of this incredibly nice and down to earth pastor where we used to live about a decade ago. One thing he told my mother when she was talking to him about doubt is that we are akin to a baby in a womb. We can tell that there are outside stimuli, but we have no idea what they are, and why they happen. God is the outside stimuli, and we can't even begin to comprehend the things he does.\n\nI usually respond to this by saying that as intelligent creatures, a god that does so many irrational and harmful things would want to try to appeal to us to make us understand, but she just says that we can't understand. It's her sticking her head in the sand, but how can I break her out of the loop of simply responding, \"We just can't ever possibly know?\"",
        "created_utc": 1434760544,
        "upvote_ratio": ""
    },
    {
        "title": "Nephew baptism..",
        "author": "guy495",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3agjqo/nephew_baptism/",
        "text": "First of all, sorry for my bad english.\n\nMy nephew's baptism is tommorow and ofcourse, I'm invited. So I wanted to ask your opinions, should I go or not?\n\nI really don't want to listen to that bulls*it in church but then again, it's going to be strange if I don't go because I would be the only one.\n\nWhat do you think? Go or not?",
        "created_utc": 1434757504,
        "upvote_ratio": ""
    },
    {
        "title": "Parting the Red Sea vs Picking everyone up and moving them. Which required more energy?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3afogy/parting_the_red_sea_vs_picking_everyone_up_and/",
        "text": "",
        "created_utc": 1434741933,
        "upvote_ratio": ""
    },
    {
        "title": "What is your favourite religious debate?",
        "author": "ihavetobelieve15",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3aeup2/what_is_your_favourite_religious_debate/",
        "text": "I'm just curious about which debates you think are the most interesting both in terms of arguments presented and oratory skills of the speakers. \n\nFor me, it's probably WLC vs Kagan on morality, because both speakers were quite good (and I can't help but smile at how WLC got schooled).",
        "created_utc": 1434728186,
        "upvote_ratio": ""
    },
    {
        "title": "My friend and I are debating",
        "author": "rexel325",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ae9u2/my_friend_and_i_are_debating/",
        "text": "My side is Atheism and his is Catholicism.\nI proposed a debate a few months ago and it still goes on to this day.\nI pointed out the usual holes in the Bible like why 7 days, no free will, knowing about the apple's location but not putting it far away from adam/eve, but he said an analogy:\n\nHe has a map that has contains an image of an island that continually drifts (so it's constantly moving) and is very far away. Within that island, there exists a treasure box that contains everything that you need. Since it's far away, people always go on a one way trip and never come back since they already have what they need.\n\nThe map is representing the Bible, the island is representing God, and the treasure box is representing the truths or answers. In order to go to the island, one must believe that the island exists and must follow the directions to go there. Examples of people who already went to the island are dead believers and since they believed and followed the Bible, they are currently in heaven/paradise with God.\n\nIt made a whole lot of my arguments void since I need to go to the treasure box to find the \"answers\" however I still pointed out that how come his map is the \"right\" one or the best one. His answer was partly intuition and mostly reasoning which is:\n\nWay back in the old days, when the Bible was being created specifically, he thinks that when the people back then saw the Bible, people must have been skeptic about the Bible but they wouldn't believe it if they hadn't witnessed what was written. What his point is that Catholicism wouldn't have spread if it wasn't convincingly true, the people would've thought the Bible would be nonsense and if it was just nonsense, why would it spread in the first place. However, I can say that to other religions as well but he replied with a new term to other religions. Some religions have \"cheats\", it's a cheat because it's  part of that religion which sort of translates as the \"selling point\" of a product. For example, corrupt politicians would bribe you so you would vote for them but a person who's dumb enough to sell their vote is already sold since they'll have money when they vote for this specific politician and they wouldn't vote for the other or even better ones since they wouldn't see any perks that they'll receive, just like religion, he used Islam's marriage laws in which men can marry more than one woman as the selling point of it and he chose Catholicism because it doesn't have a cheat and almost everything is reasonable since you have to go to the treasure box to find the answer to some questions/holes. We don't mean any offense towards Muslims though, what you do is your own thing.\n\nI told him that being in heaven is also a selling point but it was a weak point since almost every religion does that and might as well redundant as a \"selling point\".\nBy reasoning (at least I see it that way), he proved that something must've happened a long time ago that made them convinced and made them tell everybody they know and made a chain reaction.\n\nNow I'm stuck, I sort of am convinced it is flawless by reasoning, unless there's a fallacy and a fallacy's nature is to look right even though they're not. I now ask you people, is there something wrong here? How can I progress?\n\n\n\n\nUpdate: I told him about Catholicism also having cheats but he said that Catholicism's cheats are minimal or are very tiny compared to others (but then again, eternal salvation ._. ).\n\n\nI told him about Catholics forcing others to believe in their God was also a cheat but he told me that if a person who was forced to believe in this certain thing, he/she would just act like he/she believed in it but he/she would just ignore it if there was no actual risk of being killed. He told me about Hitler and the Jews and how Hitler threatened them but the Jews didn't really stop believing in their religion, they just moved out or something or rather die right there than grow old to believe in a different religion. However, I think there are people who actually tried to change but what his point is that forcing religion isn't really effective.\n\n\nI also told him about how people in the old days could have believed in anything and more or less thought like children in our present time but he said that every person will tally their beliefs and have a recap and decide what makes sense and what doesn't (I didn't ask why doesn't Catholicism pop up everywhere though, it didn't went through my mind back then).\n\n\nHe didn't accept \"Kissing Hank's Ass\" as a valid analogy because mainly, Hank is not a God. He kept saying that Hank is not omniscient nor omnipotent so it's bad comparison. I told him that it wasn't the point of the analogy, it was to show that the analogy is just as believable as religion but he still didn't accept it.\n\n\nI already told him about why God-helped-the-people-from-the-start-but-suddenly-disappear before I posted this thread but it would be void since it's in the treasure box. Now, I told him how unfair the treasure box can be but he just said that I shouldn't really mind the treasure box and we should just discuss the very start.\n\n\n(I told him about the conspiracy theories but he said that there are people who aren't sure that they actually happened/exist and I think he said his religion's evidence is much more authentic but he just wanted to move on to this topic) He said that we have trouble finding evidence now because they thought that people weren't going to ask for it since they believed it's just common sense to believe in this religion. He made an example on who my great-great-great-great...-grandfather is and how the people back then didn't think to record who he was and what he did because people didn't know who would ask. Of course it's not a perfect analogy but he clarified that if the information was just a bit more important (I couldn't really care less who my great-...-grandfather was).\n\n\nHe also said that the writers of the Bible must've witnessed God and at least wanted proof that He was actually the God. Therefore, they must have asked things for Him to do like control the elements or something to make them convinced. I know the Bible wasn't written on first hand accounts but I think he was referring to the author of one book since the Bible was just a collection of books so I didn't point it out. However, I asked what if the writer just thought of something to write and wrote a fictional book but he told me that since I don't have *observable evidence* for my great---grandfather, as well as for a dead politician who isn't that famous, how will we know the skull or the bones on his grave actually belonged to him. I told him that people can add layers of skin to show their faces when they were alive but he told me how will we know that that person did what he did and not someone else except follow what the history books tell. So he concluded that you just have to trust people.\n\n\nWe got cut off and was about to move on to --since God proved himself, what about the other Gods that proved themselves of other religions? And since this is from the very start, cheats don't matter and also because it wasn't about spreading anymore and it's now more on God proving Himself how illogical it would be to not follow what the *proven* God would say.\n\n\nI know for a fact that history books and the Bible are very different but he doesn't seem to see it that way, how can I convince him that they are? **Thanks for the number of replies though, it really helped me.**",
        "created_utc": 1434716840,
        "upvote_ratio": ""
    },
    {
        "title": "Best friend just converted",
        "author": "flexflair",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3adod6/best_friend_just_converted/",
        "text": "Ok so I'll make this short as I can. My best friend that grew up with me in a small town just converted. We became good friends over us both being atheists on a small town that would like to see us stoned. We've been best friends for the last 8 years and now he tells me last week he felt god and spilt believes in the New Testament. I'll be honest I don't know how to feel about this anymore I'm pretty let down since he was my only friend that was also atheist. I'd love to just say I just accept him but it's weird knowing how we always shrugged off mythology to how he just turned. ",
        "created_utc": 1434698321,
        "upvote_ratio": ""
    },
    {
        "title": "Argument from Experience - Is there a response to this that's worth my time writing out?",
        "author": "tmfaber",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3achik/argument_from_experience_is_there_a_response_to/",
        "text": "I'm wondering if there's an appropriate response I can give to the line of reasoning below, instead of walking away from the debate.  I told her that evidence would change my mind after she implied that nothing could change hers (she explains why below).\n\n\"I fear you see me as close-minded because of my response that I do not see anything that will change my mind.  I'm not sure how to respond to that for how can I say there is no God when I have experienced him in my life?  I can no more do that than say you don't exist.  That is how real God is to me.  I see His love, His mercy, His goodness, His \"fingerprint\" if you will in all of creation, in space, in the miracle of new life, in the cycle of life, in the seasons, the order of all things.  And I do believe it is possible for us to have a reasonable conversation about all these things, for in doing so we will both better understand how the other sees the world around us, and what we believe about it all.\"\n",
        "created_utc": 1434672042,
        "upvote_ratio": ""
    },
    {
        "title": "My latest Free Thinker's ANTHEM!! Please listen and share. Thanks!",
        "author": "moanakeikii",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3abrf4/my_latest_free_thinkers_anthem_please_listen_and/",
        "text": "",
        "created_utc": 1434659552,
        "upvote_ratio": ""
    },
    {
        "title": "This article about perfectionism and religion just made me sad",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3aanys/this_article_about_perfectionism_and_religion/",
        "text": "",
        "created_utc": 1434642332,
        "upvote_ratio": ""
    },
    {
        "title": "How do you respond to people who believe in paranormal activity, therefore supernatural powers.",
        "author": "crashd5",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a8voh/how_do_you_respond_to_people_who_believe_in/",
        "text": "I have a good friend who I otherwise think is rational that believes that he grew up in a haunted house. He recalls mugs levitating and then flying across rooms and countless memories of being tormented by ghosts who also tormented his siblings by their apparent account. He says the don't want to talk about it anymore. \n\nI feel strange discounting his experience, or trying to equate it with my own feelings of the divine before realizing that it was likely all wishful thinking. He claims to be actively wishing for these things to leave him alone, yet they did not. As a result, he clings to christianity partially at least because these apparitions are his proof of supernatural power. It seems different than people who wish to have experiences with God, therefore confirmation bias.  Is there a good way of addressing these claims?",
        "created_utc": 1434599259,
        "upvote_ratio": ""
    },
    {
        "title": "Humble request from a Christian",
        "author": "jf1354",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a8kl2/humble_request_from_a_christian/",
        "text": "I'm trying to get a Youtube channel revolving around politics, history, and philosophy started with my cousin and had the idea to do a weekly/bi-weekly review of a chapter from a well-known book on atheism. I wanted to start a dialogue with atheists through the channel and my cousin (himself an atheist) recommended this subreddit. Would this community be gracious enough to help us out? If so, what book would you recommend I read/review?\n\nEdit: Thanks for all the feedback! There are a lot of really good suggestions but the Demon-Haunted World seems like the most frequently suggested. Would r/trueatheism be OK with it if I posted my reviews here for discussion?\n\nEdit 2:  If anyone wants to check out our channel it's [here](https://www.youtube.com/channel/UCyuAKnN3g2fZ7_R9irgEUZQ) (I'm Joe the guy dressed like the Dude with a White Russian in the banner). Sorry for the shameless self-promotion but I will make sure to post a link on this subreddit for feedback when I read the first chapter/get my hands on the book. Thanks again for all the feedback!",
        "created_utc": 1434593250,
        "upvote_ratio": ""
    },
    {
        "title": "What is the point of life?",
        "author": "I_am_short_",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a858f/what_is_the_point_of_life/",
        "text": "I've been thinking about that recently after getting into a discussion with someone who said that you couldn't be ambitious if you're agnostic or athiest because you only care about material things and can only be greedy. To me that didn't make much sense because he's just defining ambition according to his own beliefs but it was a bit frustrating because I didn't know what to say. I consider myself agnostic leaning towards athiesm and he pointed out how agnostics aren't keeping their opinions to themselves it's just that they don't care, which I thought had some truth to it but is that such a bad thing? I felt pretty disappointed in myself for how I handled the situation. There were a lot of terms used I wasn't familiar with and I don't know if the points he made actually had any substance to it or if they just sounded nice. Anyways what are your thoughts on this? My parents used to say that you could never feel true happiness without God, any truth to that?",
        "created_utc": 1434585129,
        "upvote_ratio": ""
    },
    {
        "title": "Think explaining that you're an atheist is hard? Try explaining apatheism.",
        "author": "ZeusThunder369",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a7dwf/think_explaining_that_youre_an_atheist_is_hard/",
        "text": "*\"So, do you believe in God or not?\"* - Neither, I simply don't find any value in making a claim towards the existence of God one way or the other. Debating it doesn't make my life better, so why do it?\n\n*\"How can you not have an opinion about God!? You've never thought about it??\"* - I've thought about it as much as I have the existence of Santa Claus or Unicorns. More when I was younger, and not at all now that I'm older.\n\n*\"What if you were in a foxhole...(or any of those other gotcha type questions)\"* - It simply wouldn't occur to me to pray in the first place.\n\nAnd this cycle of questions pretty much repeats itself using different words until the person just gives up.\n\n\n",
        "created_utc": 1434572771,
        "upvote_ratio": ""
    },
    {
        "title": "On the ability to recognize inconsistency in others' beliefs but not ones own.",
        "author": "crediblehulk83",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a76ou/on_the_ability_to_recognize_inconsistency_in/",
        "text": "Today /r/Christianity there is a stickied discussion with Mormon users where people can ask them questions about their faith. \n\n[Here it is] (http://www.reddit.com/r/Christianity/comments/3a5ykv/ama_series_2015_the_church_of_jesus_christ_of/)\n\nThe mainstream Christians seem very capapable of recognizing and disassembling many of the problems with Mormon beliefs. What is  so interesting to me is how these people clearly have the will and ability to see how Mormon claims are so illogical, but not the teachings of Christianity as a whole. \n\nDoes anyone else notice this within the thread, or anywhere else for that matter?\n",
        "created_utc": 1434569708,
        "upvote_ratio": ""
    },
    {
        "title": "True atheists should never suffer for their lack of belief",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a42hb/true_atheists_should_never_suffer_for_their_lack/",
        "text": "It is surprising to me when I see atheists who stand up to organized religion in countries where they are killed for doing so. For example, there have been a few recent cases of atheist activists being killed/punished in muslim countries for revealing themselves as atheists. \n\nI do not understand why they would do this. In my life as an atheist, I simply pretend to be of the religion that most benefits me at the moment. In college I found that I benefited greatly from pretending to be a christian by going to a church, gaining a leadership position, and using this experience to sell myself to employers and get a job I would not have gotten otherwise. If I was in a muslim country, I would pretend to be a muslim. I do not understand why an atheist would suffer for their lack of belief. If I felt that my actions to get rid of religion would benefit me more than pretending to be of a religion, then I would act against religion. However, identifying as an atheist to employers/clients seems as if it would only hurt my business life so I just say I am a jew/christian/sphaghetti worshiper when I need to. \n\nI don't even buy that they did this for a better world. The reality is that we have maybe 100 years of life, and anytime before or after our lives may as well not exist. I can not think of a single reason that I would put myself through hardship in this life in the hope that the future will be better via my actions. Our best scientific theories point to extinction via nuclear war, asteroid, etc as almost a guarantee to end humanity. Everything that humanity works towards is doomed no matter what, that is reality. If you somehow believed humanity could overcome that, the laws of physics basically doom us to a heat death in billions of years anyways. To believe that humans can overcome this is to go against current scientific understanding, which is no different than believing in a higher power/religion. All we can do is enjoy the time we have by maximizing our pleasure in life.\n\nI feel that atheist activists who do not think they will see any immediate benefit in their lifetimes from their actions are not true atheists, but are instead replacing a belief in a higher power with a belief in humanity. They believe that humanity is something special that can warp the laws of physics to create a universal, eternal utopia. How is this any different from what any religion believes, besides that instead a god providing this then it is people? Am I the only one who cant understand why would a true atheist would give their life for atheism? \n\nTLDR; I feel that there needs to be a distinction between true atheists and what I would call humanity worshipers. ",
        "created_utc": 1434505761,
        "upvote_ratio": ""
    },
    {
        "title": "Help: fluoride debate! (or help redirect me!)",
        "author": "Cow_Bug",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a3qzr/help_fluoride_debate_or_help_redirect_me/",
        "text": "",
        "created_utc": 1434500014,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with religious arguments that end up in solipsism?",
        "author": "Drysaf",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a3j5m/how_do_you_deal_with_religious_arguments_that_end/",
        "text": "Personally, I just see it as someone pushing the button to nuclear fallout for the debate. They realize that they are losing the debate/argument, then they say \"well, we can't really prove anything.\" or \"well it's all relative\". \n\nI really resent these type of arguments, mostly because 8 out of 10 people who use these arguments (as a last resort, not something they say at the beginning) don't actually believe in said arguments. It just comes up to make the argument a \" wash\". If that's how they really felt, why did they bother with the argument in the first place? \nWhat are your thoughts on this? Did you ever experience this type of argument and how did you deal with it.",
        "created_utc": 1434496059,
        "upvote_ratio": ""
    },
    {
        "title": "In light of a recent comment about how atheism and depression may be related, I thought I would link a relevant study",
        "author": "wait_huh",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a3ek7/in_light_of_a_recent_comment_about_how_atheism/",
        "text": "",
        "created_utc": 1434493909,
        "upvote_ratio": ""
    },
    {
        "title": "The atheist doll gets the worst of it!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a21j4/the_atheist_doll_gets_the_worst_of_it/",
        "text": "",
        "created_utc": 1434473433,
        "upvote_ratio": ""
    },
    {
        "title": "How do you handle depression with an atheistic world view?",
        "author": "Valhalla_Bound",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a1vdt/how_do_you_handle_depression_with_an_atheistic/",
        "text": "This isn't one of the posts that pop up fairly frequently about fear of life having an end. It's related, but it's not quite that. \n\nI don't really fear death most days. I'm more comfortable with the fact that we have a finite end, as opposed to an infinite afterlife.\n\nBut on days where my battle with depression really hits it's lowest, my world views do nothing but magnify the situation. I think there is so much beauty in that we only have one life to live, that we have to make the most of it. And I think following your dreams is all well and good, but there are also bills to pay and hard realities that get in the way of our pursuit of happiness. So when I'm feeling my worst, I get really saddened by the fact that I feel like I'm wasting my one life. There's days where I feel like the world keeps kicking me down, and I don't know how to change the situation, and it just means another day I never get back. I used to take comfort in Christianity as a child, knowing that there was always going to be a bright end. Now I know better, and that you have to make your own bright end. Which isn't always as easy as people would make it out to be. Having the security blanket of Faith ripped off of me can sometimes have me feeling alone and helpless. When things are already going poorly, my atheism can compound my low mental state. \n\nDo any other athiests deal with any of this? Have you found a way to combat  it? I don't fear death, just a wasted life. It's got me really down right now. Discussion would be great.\n\nEdit: I've been get some really great responses from some truly caring people, but in the spirit of this subreddit I was also hoping to not make this all about me and start a discussion on if anyone has felt difficulties from an intersection of being depressed and being an atheist. I've got some of my own issues to sort out, and I'm greatly moved by the support here. I'm just also trying to initiate some dialogue about a niche issue within atheism, if that issue even exists at all.\n\nEdit 2: I wrote this yesterday when I was in a fairly emotional state. If in could change one thing about this post it would be the title. I put too much of my own emotions into the post. I don't think atheism is a world view, and I don't think it causes depression or is linked to it. There is depression and there is atheism, separate and distinct entities. I wanted to explore a possible crossroads of the two. I thank people greatly for their advice and support. This turned into a bigger thing than I thought it would, in a different way than I expected. I have plenty to reflect on, and steps to take to better myself and my life. Thanks.",
        "created_utc": 1434470792,
        "upvote_ratio": ""
    },
    {
        "title": "I am terrified of the thought of death. How do you guys deal with it?",
        "author": "Deathgoaway",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3a1els/i_am_terrified_of_the_thought_of_death_how_do_you/",
        "text": "I am 18 years old, and I've been an atheist since I was 14. Yet the fear of death has not struck me until a few months ago when my dog died. I missed him so much, and he was still young, joyous, care-free. The memories of him wandered from the way he would wag his tail to the fact that everything that made him him is now buried in the back yard. Probably doesn't even have a concept of what death is, and he is just gone, like that.\n\nThen there was another event that made me fear it even more. My grandfather lives alone now, and by that I mean there are no relatives living with him, just his caretakers and nurses. He used to live with his wife and sister in law. My grandmother died about 7 years ago, and my grandaunt about 3. Every month or so, we would visit him, stay over for a few hours and just keep him company before heading home. When we were about to leave, I went to his room to use his bathroom before the 1 hour ride home. I saw him on his bed, just crying. The caretaker did not seem to care about it, probably because it was normal already. I don't think he noticed me slip in and out of his bathroom.\n\nIt just really stuck with me, the idea of how lonely he must feel now.\n\nEvery now and then I have a really long shower after a tiring day, or twist and turn in my bed during a restless night and my thoughts wander to the future. I still have a lot of years still ahead of me, and it takes a while to make it to the end. Finishing college, getting a job, meeting a girl, settling down, having a family, and eventually maybe living alone, just like my grandfather. Live day after day the same way, and every now and then, on a weekend or maybe holiday, my children would visit me, along with their own children who don't even think much of me and think only of how long before they can go back home.\n\nThen, if i'm lucky, I'll just go to sleep, and never wake up. I'd be gone. Every memory, every feeling, every single failure and accomplishment I have ever done will be gone. Everything that Is still ahead of me will be gone. And I wont even realize it when it happens. I wont get to reflect on what I have done with my life, I wont get to see if it was worth it, I wont get to know that I've died.\n\nA friend of mine once asked why that is so terrifying, and I tried to put it in her perspective.\n\nI told her to imagine that she was a human that is slowly turning into a robot, Like, let's say you uploaded your brain into a machine. The first things, of your senses, to go are your sense of touch, taste and smell. Not only do you lose those senses, but you will not have the ability to comprehend it, or remember it. Not only could you not taste your favourite meal, but you wont get to reminisce it. Not only could you not feel the glow of the sun, but you wont remember how it made you feel. Temperature will be nothing but numbers on a screen to you. Everything from the lilacs in your garden to the smell of your morning shit. You would feel just as cozy and comfortable in a bed, garden or a landfill. \n\nThen after a while, your hardware deteriorates. You lose your sense of hearing, and all memories of sound. You will have the same concept of sound as that of a deaf person. The closest thing you know of melody is color. You won't remember the voice of those you love, you wont remember the sound of your alarm clock as you get out of bed, you won't remember the sound of the birds in the sky.\n\nThen finally, you lose your sense of sight. You forget what your own mother looked like, you forget what *you* look like. You forget what color is. At this point, your memories are nothing more than information. You know the names of your friends but you don't know much about them other than that. You can't comprehend what exactly a friend is, or what a human is.\n\nAnd finally, the last to go is the remnants of your memory. You forget what you are, you forget what existence is, and you forget what consciousness is. And one second later, you are no more, and you don't even realize it. You don't even get a chance to realize what just happened to you. And the scariest part about it is that all of that that I just explained, will happen in a fraction of a second.\n\nThat is what death is to me. And I am terrified of it.\n\n",
        "created_utc": 1434462967,
        "upvote_ratio": ""
    },
    {
        "title": "[Survey] Beliefs on supernatural and philosophical issues other than god-existence",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39z02y/survey_beliefs_on_supernatural_and_philosophical/",
        "text": "",
        "created_utc": 1434409011,
        "upvote_ratio": ""
    },
    {
        "title": "I came up with this quote a few minutes ago, I though /r/TrueAtheism would appreciate",
        "author": "IntellectualEuphoria",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39uq7s/i_came_up_with_this_quote_a_few_minutes_ago_i/",
        "text": "",
        "created_utc": 1434323675,
        "upvote_ratio": ""
    },
    {
        "title": "DNA: why doesn't it prove a higher power exists?",
        "author": "notmean",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39umzm/dna_why_doesnt_it_prove_a_higher_power_exists/",
        "text": "I'm having trouble figuring out why DNA doesn't prove that there's something out there.. I'm not advocating Christianity or God or Jesus or the Bible. I'm saying something, more human-like than a mere particle that gave rise to the DNA coding. How are we all made up this two-four billion lettered script that instructs every cell, makes us 99% similar to each other yet makes an individual an individual... how could that have rose from nothing? \n\nP.S. No derogatory comments on \"how I know nothing about science\".. I'm a biology major going to med school next year, I've taken every possible science class from intro to cell to evolution/ecology to immunology. Trust me, I've learned my fair share about it. ",
        "created_utc": 1434321933,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with existential and depressing thoughts?",
        "author": "amankinperc",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39tvee/how_do_you_deal_with_existential_and_depressing/",
        "text": "Occasionally I find my self fixed on certain depressing ideas that I think are related to my atheistic world view. Ideas like \"Living is just the act of filling your time with stimulation until you die,\" or \"humans will eventually go extinct and nothing any person did will matter.\" I don't think I would think of things like this if I subscribed to a religion. I'm curious if other atheists have experienced this and what kind of things they do to get out of this thought process. \n\nEdit: So many great replies. You guys are great. ",
        "created_utc": 1434307897,
        "upvote_ratio": ""
    },
    {
        "title": "How is a white person living as a black person any different than a male living as a female?",
        "author": "raraparooza",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39rgmi/how_is_a_white_person_living_as_a_black_person/",
        "text": "",
        "created_utc": 1434243949,
        "upvote_ratio": ""
    },
    {
        "title": "\"An Honest Liar\", a documentary about James Randi, is now available on Amazon Instant Video",
        "author": "MonkeyKing_",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39rceb/an_honest_liar_a_documentary_about_james_randi_is/",
        "text": "",
        "created_utc": 1434241350,
        "upvote_ratio": ""
    },
    {
        "title": "Argument of religion as a source of comfort",
        "author": "SC275",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39oqx4/argument_of_religion_as_a_source_of_comfort/",
        "text": "What do you say to people that are pro religion that argue the benefits of religion as providing a personal source of comfort in hard times and a source of hope?\n\nI argue that it is unethical to allow someone to believe because it seems to me to be a false hope rather than a real one. I argue to find a real hope rather than let yourself be deceived by a lie even though it makes you happy. Any comforts provided by religion can be substituted by finding comfort and hope in other things. Live a life led by what you know to be true and take no exceptions.\n\nAn argument to this is that believing provides an easy source of comfort and as long as you don't hurt anyone it's fine.\n\nI just can't come to terms in living a seeming delusion. I feel like those who believe are deluding themselves either knowingly or unknowingly. Any thoughts or counter arguments?",
        "created_utc": 1434183858,
        "upvote_ratio": ""
    },
    {
        "title": "Is it too soon the be an atheist?",
        "author": "Al_The_Killer",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39l09w/is_it_too_soon_the_be_an_atheist/",
        "text": "",
        "created_utc": 1434116699,
        "upvote_ratio": ""
    },
    {
        "title": "On Theodicy",
        "author": "CGRampage",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39jw2k/on_theodicy/",
        "text": "I wrote something in about twenty minutes regarding theodicy, or the problem of pain.\n\nLooking for some feedback on content (rhetoric, grammar, etc.).\n\nTheologians of every caliber have tackled the problem of evil, yet we come no closer to achieving a world where the notion of a benevolent god and human misery can coexist. Theodicy remains the greatest argument against god’s existence.\n\nConsider an omnipotent god – one who is able to Will anything he wishes, and is able to define the rules as he wishes, including (and especially) the laws of reason. It seems unlikely that such a deity would set up a paradigm in which human suffering would be allowed for a greater good. Such a god could just as easily conceive of a world in which there is no suffering whatsoever while still maintaining the freedom of the individuals he created. I will further elaborate when I discuss “free will and theodicy”.\n\nIt is then claimed that god does not will evil, but simply allows it. Assuming one allowed this, and although I do not consider myself a pure consequentialist, isn’t the end product the same? Evil still roams free, twisting the lives of those who bask in our shared existence. Whether or not god causes such evil or simply allows it, he has let maliciousness enter our existence. One must logically, however, reject that god can simply “allow” evil to continue its barely-mitigated reign. If all existence comes from an omnipotent god, then the good, the bad, and the evil must inevitably derive from such a being. If one, knowing everything one can know and having every power conceivable and inconceivable, created a universe in which evil existed, would one not be morally responsible for causing such an evil? Hitler did not directly kill eleven million people, yet he was the moral proprietor of such an act. Yet one would be morally dishonest if he suggested that Hitler did nothing wrong. If I stood idly by while witnessing a young boy drowning in a shallow pond, and I knew I would be able to save this boy, would I not be held morally accountable for my actions? It matters not if I pushed him in the pond, for I did nothing while his life was escaping him.\n\nSpeaking of actions: free will, some assert, is the basis for our problem of evil. Humans have no one to blame but themselves claim those who defend god despite this evil. Yet free will does not answer the question of evil. Most glaringly, this spits in the face of natural disasters, which are far from man-made (although some will ignorantly spout that homosexuality has caused countless earthquakes and hurricanes). There is also much evil that has little to do with human action, such as those who are suffering in famine and disease-ridden areas. “Yes,” my hypothetical religious opponent will argue, “but it is up to us as a species to work together to fix this.” Well this is hardly fair. Compared to god we are minuscule in power and intelligence. Could he not simply will a fix into being? Let us pretend that there is an individual who holds infinite power and infinite wisdom in our world. If he stands idly by while millions and millions of innocent people suffer by the nature of their very existence, would we regard this individual as being of the highest moral standard? What if he told us that all we needed was to work together to solve our problems? How immoral a character!\n\nGod works in mysterious ways, then. If this is so, how can we be certain that he has our best intentions at heart? How do we know what he wishes for us to do? Perhaps what we think is moral is actually completely misaligned from what he actually wishes for us to do. God works in mysterious ways, until he doesn’t.\nIt seems unlikely, then, that such a god exists and is, at the same time, benevolent, omnipotent, and omniscient. What seems quite more likely is that we have not yet discovered the mysteries of the cosmos and are clinging desperately to the myths of the infancy of humanity’s existence. Theodicy remains our closest friend in discovering Truth, and the strongest enemy in eliminating ignorance of the cosmos and of our existence.\n\nEdit: Format",
        "created_utc": 1434089856,
        "upvote_ratio": ""
    },
    {
        "title": "Republican Atheists in the USA",
        "author": "dogger6253",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39g25q/republican_atheists_in_the_usa/",
        "text": "I'm not too interested in everyone's politics, but I'm curious as to how atheist republicans feel about their party being so closely associated with Christianity and Christian values in the media. Would you still vote for a candidate that supported teacher-led prayer in public schools?    \n  \nIn my personal experience, many of the atheist republicans I talk with identify more as libertarians, yet register and vote republican. If this is you, why? Most of these libertarians value personal freedoms very highly, yet still vote for strongly conservative candidates. Maybe not directly linked to atheism, but I see a correlation of interest in matters pertaining to same-sex marriage, birth control, and sexual education. Do candidates who oppose these things on religious grounds still earn your vote because of their other policies?  \n  \nIf the political specifics are not appropriate, please feel free to ignore them and focus specifically on the question of how you feel about the perceived and often adopted connection between the republican party and Christianity, think FOX News pundits as an example here.",
        "created_utc": 1434031562,
        "upvote_ratio": ""
    },
    {
        "title": "Is the \"Jesus\" character of the New Testament actually based on a real person who existed historically, and if so, to what degree?",
        "author": "freeze4576",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39dxf7/is_the_jesus_character_of_the_new_testament/",
        "text": "My recollection of the previous times I've read about this is that most scholars do think he existed (perhaps the evidence is as strong as for Greek philosophers etc. existing?). However, obviously if we don't believe in the miracles and everything else, what is left? Did he still preach sermons as described biblically (or elsewhere, not that there is much else)? Was he just invented entirely? Is he an aggregation of similar figures in the time period? \n\n(Shamelessly stolen from /u/DeusExMentis in that other thread.)",
        "created_utc": 1433990300,
        "upvote_ratio": ""
    },
    {
        "title": "[META] I feel like this subreddit is turning into an advice subreddit more than a discussion forum about atheism",
        "author": "joak22",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/39cav6/meta_i_feel_like_this_subreddit_is_turning_into/",
        "text": "When I started lurking this sub about 3 years ago, it was full of discussion about the religion logic, discussion about afterlife, problem of evil, jesus life, etc. I loved coming here because it \"reinforced my atheism\", if I can say it like that. \n\nNow I feel like 80-90% of the posts are either advice posts like: how can I talk to my family, how do you deal with X, what can I do when..., etc. or blog posts with little discussion possible.\n\nI don't know, I wish we would have more specific discussion about religion rather than being atheist psychologists. Not that I don't mind helping people out (I like to give out advice), I just miss the times where we'd have discussion about paradise, morality, etc. What do you guys think?",
        "created_utc": 1433967498,
        "upvote_ratio": ""
    }
]