[
    {
        "title": "The secrets in Doom 2016 are ruining it for me.",
        "author": "BoilingCold",
        "url": "https://www.reddit.com/r/truegaming/comments/85rbs9/the_secrets_in_doom_2016_are_ruining_it_for_me/",
        "text": "I've finally got around to playing Doom 2016 and while I am loving the combat, the graphics, the enemy and map design I am finding that hunting for the many secret upgrades and collectibles is detracting greatly from the fun.\n\nAnd because the secrets give weapon &amp; suit upgrades I feel like I really want to try and find them all. It's slowing the game down and completely breaking my immersion.\n\n\nI had the same problem when I played Wolfenstein: The New Order. I ended up just using a guide to find the 'essential' weapon upgrades and then ignoring the rest, which improved the game immensely for me. That feels like less of an option in Doom since most of the secrets provide upgrades.\n\n\nDid anyone else have this problem with Doom? If so, did you find a solution? Does Wolfenstein 2 - The New Colossus have the same issue? Do you think there are games that do this better?",
        "created_utc": 1521537261,
        "upvote_ratio": ""
    },
    {
        "title": "I'm completing a study on gamer personality and avatars... and I'm curious - do you think gamers who are similar also like the same avatars?",
        "author": "_sarahdactyl_",
        "url": "https://www.reddit.com/r/truegaming/comments/85pvxm/im_completing_a_study_on_gamer_personality_and/",
        "text": "[removed]",
        "created_utc": 1521518416,
        "upvote_ratio": ""
    },
    {
        "title": "What game has the best lore you've ever seen/read?",
        "author": "ShogunMelon",
        "url": "https://www.reddit.com/r/truegaming/comments/85pu8g/what_game_has_the_best_lore_youve_ever_seenread/",
        "text": "[removed]",
        "created_utc": 1521517912,
        "upvote_ratio": ""
    },
    {
        "title": "Favorite video game health packs, first aid kits, potions, power-ups",
        "author": "ibieiniid",
        "url": "https://www.reddit.com/r/truegaming/comments/85pqih/favorite_video_game_health_packs_first_aid_kits/",
        "text": "[removed]",
        "created_utc": 1521516844,
        "upvote_ratio": ""
    },
    {
        "title": "Neverending backlog",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/85n05c/neverending_backlog/",
        "text": "[deleted]",
        "created_utc": 1521493111,
        "upvote_ratio": ""
    },
    {
        "title": "Enough of the \"games are half the price they were in the 90s!\" rhetoric.",
        "author": "DeusXVentus",
        "url": "https://www.reddit.com/r/truegaming/comments/85lc0y/enough_of_the_games_are_half_the_price_they_were/",
        "text": "[removed]",
        "created_utc": 1521480932,
        "upvote_ratio": ""
    },
    {
        "title": "Burnout Paradise Remastered Review - https://thereviewroomsb.blogspot.com/2018/03/BurnoutParadiseRemasteredReview.html",
        "author": "BatchelorSean",
        "url": "https://www.reddit.com/r/truegaming/comments/85jzbl/burnout_paradise_remastered_review/",
        "text": "[removed]",
        "created_utc": 1521470651,
        "upvote_ratio": ""
    },
    {
        "title": "What are the best and/or most overlooked open world crime games? Think GTA clones.",
        "author": "MAGGLEMCDONALD",
        "url": "https://www.reddit.com/r/truegaming/comments/85j6sq/what_are_the_best_andor_most_overlooked_open/",
        "text": "[removed]",
        "created_utc": 1521463579,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any examples of games where a band of evil rebels is trying to overthrow a righteous empire?",
        "author": "Odins-left-eye",
        "url": "https://www.reddit.com/r/truegaming/comments/85ixab/are_there_any_examples_of_games_where_a_band_of/",
        "text": "[removed]",
        "created_utc": 1521460945,
        "upvote_ratio": ""
    },
    {
        "title": "Everyone talks about quest markers vs no markers, but what about markers but no \"GPS\"?",
        "author": "mithrillion",
        "url": "https://www.reddit.com/r/truegaming/comments/85iwh9/everyone_talks_about_quest_markers_vs_no_markers/",
        "text": "It seems that having to discover locations yourself is an important source of enjoyment in classical RPGs, and quest markers are often blamed as the reason why newer open world games feel too streamlined and not memorable. Yet here I am wondering, why everyone focuses on the quest markers but no one talks about your character marker? Isn't it more realistic that NPCs can mark where you need to go exactly but you can't know where you are on the map for certain? To me, it is a much more engaging and challenging problem to locate yourself on a untracked map than figuring out where you need to go from vague descriptions.\n\nI remember in early DayZ many servers disable \"GPS\" or even maps by default, and every time you respawn, you have to walk about, look around and figure out where you are on the map using terrain, landmarks, compass, etc. This is quite difficult but really fun! This is much more enjoyable than trying to decipher a cryptic clue and debate about the difference between \"fifth hill on the right\" and \"fifth hill, on the right\". \n\nSo, what do you think of this \"detailed map, quest markers, no GPS\" approach versus the traditional \"vague map, no markers, GPS enabled\"? Do you think it is a viable and enjoyable alternative for \"hardcore\" RPG navigation?",
        "created_utc": 1521460696,
        "upvote_ratio": ""
    },
    {
        "title": "The idea of the \"Backlog\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/85i28b/the_idea_of_the_backlog/",
        "text": "I see a lot of posts every day on the PS4 sub from people asking \"How do I best go about clearing my backlog?\" or \"Anyone else with a huge backlog they're trying to get through?\".\n\nI used to have exactly that mindset. \"Oh, I have 7 games installed on my PS4 that I haven't finished yet. I will beat them one by one\".\n\nBut honestly, that just made things worse. More often than not, I would be playing a game that I wasn't really enjoying, and was just looking forward to playing that other game.\n\nNow I recently ditched the whole backlog thing and just booted up Skyrim, which has been installed on my PS4 since forever. And I'm enjoying that game so much. I can't wait to get home and play it. Once I dropped the whole \"I need to finish all my games\" mentality, I felt more relaxed about my gaming.\n\nWhat do you think about this?",
        "created_utc": 1521449798,
        "upvote_ratio": ""
    },
    {
        "title": "Inferiority In Modern Gaming",
        "author": "Sinisterres",
        "url": "https://www.reddit.com/r/truegaming/comments/85hry0/inferiority_in_modern_gaming/",
        "text": "A LOT has been said about the negative impact of elitism in gaming - how it can exclude a large part of the player base, but what about the opposite of that: inferiority.\n\nThere is nothing inherently wrong with being talented, having vision, intellect, and a large vocabulary but what about the opposite? Any stories to tell of gaming making some characters worse? \n\nWhat about the downward slide and circling down the drain. Have you ever rescued someone from a gaming career of no imagination, mediocrity, and shrinking vocabulary?\n\nCan inferiority gaming even be addressed, as per the Dunning-Kruger effect?",
        "created_utc": 1521445694,
        "upvote_ratio": ""
    },
    {
        "title": "Additive / Reductive Gaming",
        "author": "Sinisterres",
        "url": "https://www.reddit.com/r/truegaming/comments/85ho0w/additive_reductive_gaming/",
        "text": "[removed]",
        "created_utc": 1521443970,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else feel the new Kirby game plays a lot like Smash Bros?",
        "author": "TAG_Enigma",
        "url": "https://www.reddit.com/r/truegaming/comments/85fxhn/anyone_else_feel_the_new_kirby_game_plays_a_lot/",
        "text": "The combat control scheme is quite similar with tilts and aerial attacks. And the levels play out almost exactly like Smash Bros Melee Adventure mode.",
        "created_utc": 1521423441,
        "upvote_ratio": ""
    },
    {
        "title": "What are your favorite rpg's?",
        "author": "Mstevenr70",
        "url": "https://www.reddit.com/r/truegaming/comments/85esqo/what_are_your_favorite_rpgs/",
        "text": "[removed]",
        "created_utc": 1521412588,
        "upvote_ratio": ""
    },
    {
        "title": "So... Why are Yakuza 6 Reviews out over 1 month before it releases?",
        "author": "oridjinn",
        "url": "https://www.reddit.com/r/truegaming/comments/85ek7x/so_why_are_yakuza_6_reviews_out_over_1_month/",
        "text": "I do not mean Logistically. I know they sent them to reviewers 2-3 weeks ago. But why send them out for reviews and let reviews role out 1 month before launch?  \n\n\n",
        "created_utc": 1521410481,
        "upvote_ratio": ""
    },
    {
        "title": "Who/what are some boss fights that have really stuck with you, regardless of difficulty?",
        "author": "Leviafun365",
        "url": "https://www.reddit.com/r/truegaming/comments/85du0t/whowhat_are_some_boss_fights_that_have_really/",
        "text": "[removed]",
        "created_utc": 1521404113,
        "upvote_ratio": ""
    },
    {
        "title": "In defense of the 5th generation of consoles (Playstation 1/Nintendo 64)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/85ds3c/in_defense_of_the_5th_generation_of_consoles/",
        "text": "Often times I hear people criticize games from that era saying they haven't aged well and they're hard to pick up today. Though I think those things are subjective, I do have to admit there are many good points that back this general opinion: limited graphics, bad camera, designers haven't figured out 3D yet and the \"loading times\" in the PS1/Saturn (I'm not defending this one, it indeed sucked a lot)\n\nThe PS1 and N64 were a part of my teenage years though and I grew up with them. I did have a PS2, but I always thought PS1 had a better library personally. I'll make some points to why I think the PS1/N64 era was actually awesome\n\n**Variety**\n\nThere was no standard for how a 3D video game should be, so developers could test the waters rather freely. Of course, this meant we had A LOT of shovelware that generation, but it also meant every game felt kind of unique in its own way. Just compare the 16-bit era where 95% of the games were Mario-like platformers. \n\nIf we take the best games from the 32-bit era we have games like: Metal Gear Solid, Crash Bandicoot, Mario 64, Tomb Raider, Resident Evil, Final Fantasy VII, Goldeneye 007. Isn't it jarring that all of this games are very different from one another? Even the way the character moves are different: Lara Croft uses some very precision platforming, Mario can move freely and easily do all kinds of acrobatic jumps, Snake moves on a top-down 2D grid, Crash is a take on how a 2D platformer would look in 3D, we have tank controls in Resident Evil (**WHICH ARE NOT THAT BAD AND DON'T DESERVE ALL THE SHIT IT GETS**)\n\nWe would never get such a diverse catalog of games in any other era and they are all great games in their own right\n\nNowadays, we still have lots of great games but we got back to the 16-bit era problem that most games sort of share control schemes and mechanics. By the way, have you noticed that many franchise that started in the 32-bit era like Tomb Raider, Resident Evil, Final Fantasy, Metal Gear all play more or less the same nowadays? :P\n\n**Graphics**\n\nOk, I'm not gonna defend early graphics, they are ugly as shit. But I find it kind of hypocritical how can easily ignore this with 2D graphics, some even claiming that \"the 16-bit era had reached the perfection when it came to 2D art\". Sorry, but even back then this was not true. If anything, the PS1/Saturn had tons of great 2D games that blew Snes/Mega Drive graphics out of the water. I mean, PS1 had Castlevania: SotN, Metal Slug, Grand Theft Auto 2 and relatively faithful ports of 2D fighting games the Snes could never do no matter how many enhancement chips you can fit in the cartridge\n\nOk, about the 3D graphics, why is it so easy to overlook tiny-ass sprites in RPGs that have like a looping 2-frame standing animation and could barely show any emotion (though Square did pull of some great ones with what they had) yet we're so quick to criticize Cloud for being so blocky? Also, does anyone here really think Super Mario Bros looks all that good? No, but if we have an open mind and allow ourselves to immerse in those games we realize they've got a lot to offer and even enjoy the graphics for what they are. For some weird reason, I can go back to games like Zelda, Crash, Resident Evil and Metal Gear and still find them graphically appealing\n\n**It added a lot to gaming**\n\nModern games owe it all to that era. Afterall, it was where developers learned what worked and what didn't in 3D, we had lots of franchises that are popular even to this day like GTA, Resident Evil, Tomb Raider that were born at that time. Also, the dualshock which set the standard for how the controllers we use today was created at that time. We take a lot of this stuff for granted, but growing up with the PS1 seeing it all was very exciting. I find it ironic it's so easy to remember the NES achievements like putting Nintendo as a big player, control pad, licensing model, Mario/Zelda/Mega Man/Metroid; and yet we dismiss the 5th gen because games hadn't aged well. NES games aged horribly, the limited pallete make many games ugly, games were artificially hard and many were very confusing\n\n So, I think the same way we overlook the NES flaws for what it helped to achieve, we could maybe celebrate a little more what the PS1/N64/Saturn achieved as well :)\n\nTL;DR: PS1/N64/Saturn was very interesting, games were more diverse due to a lack of standard of how 3D games were supposed to be and yet many of them were great (and still hold up imo) and I think people are a little unfair and easily forget how much they contributed to gaming",
        "created_utc": 1521403656,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about the way beta testing has changed over the last 10 years?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/85cu4p/how_do_you_feel_about_the_way_beta_testing_has/",
        "text": "[removed]",
        "created_utc": 1521395638,
        "upvote_ratio": ""
    },
    {
        "title": "What games do you feel had an excellent hospital level? Im playing Left 4 Dead right now and after plating the hospital level it made me wonder what other games have a well done hospital set piece/scene. Something about an empty abandoned hospital really creeps me out.",
        "author": "IConsumePorn",
        "url": "https://www.reddit.com/r/truegaming/comments/85ctxa/what_games_do_you_feel_had_an_excellent_hospital/",
        "text": "[removed]",
        "created_utc": 1521395587,
        "upvote_ratio": ""
    },
    {
        "title": "Am I weird ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/85a9nb/am_i_weird/",
        "text": "[deleted]",
        "created_utc": 1521364895,
        "upvote_ratio": ""
    },
    {
        "title": "Depression &amp; Video Games",
        "author": "ClapThatTrap",
        "url": "https://www.reddit.com/r/truegaming/comments/859q4k/depression_video_games/",
        "text": "[removed]",
        "created_utc": 1521355073,
        "upvote_ratio": ""
    },
    {
        "title": "Casual pvp games on PC?",
        "author": "dm_me_gov_secrets",
        "url": "https://www.reddit.com/r/truegaming/comments/859kfl/casual_pvp_games_on_pc/",
        "text": "[removed]",
        "created_utc": 1521352618,
        "upvote_ratio": ""
    },
    {
        "title": "What are some games that give you a feeling of true exploration?",
        "author": "unknownantipatriot",
        "url": "https://www.reddit.com/r/truegaming/comments/856pkx/what_are_some_games_that_give_you_a_feeling_of/",
        "text": "[removed]",
        "created_utc": 1521321002,
        "upvote_ratio": ""
    },
    {
        "title": "Playstation 4 HDD (Hard Drive)",
        "author": "__n3v",
        "url": "https://www.reddit.com/r/truegaming/comments/856nia/playstation_4_hdd_hard_drive/",
        "text": "[removed]",
        "created_utc": 1521320438,
        "upvote_ratio": ""
    },
    {
        "title": "Do racing games have potential as e-sports?",
        "author": "45H2",
        "url": "https://www.reddit.com/r/truegaming/comments/855axm/do_racing_games_have_potential_as_esports/",
        "text": "Why is it that it is so rare to see people playing racing games in a tournament setting? I think throughout my life I have only ever seen one or two instances of racing games being played in a tournament setting. Is it something inherent in their design that makes them less viable?\n\nAlso, what racing games do you think have the most potential? There are two that come to my mind.\n\nThe first is WMMT, an arcade racer that focuses largely on blocking and car combat. Because of the catch-up system, the meta is centered around knowing how to overtake and how to prevent your opponent from doing the same.\n\nThe second is Trackmania. The game is pretty much the opposite of WMMT, with no car-on-car collision and instead focusing on getting a good lap time.\n\nI would like to hear your opinions.",
        "created_utc": 1521308424,
        "upvote_ratio": ""
    },
    {
        "title": "What games have aged poorly to you?",
        "author": "ShogunMelon",
        "url": "https://www.reddit.com/r/truegaming/comments/853e4k/what_games_have_aged_poorly_to_you/",
        "text": "[removed]",
        "created_utc": 1521289167,
        "upvote_ratio": ""
    },
    {
        "title": "Oppression in Video Games - Opinion",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/852rv6/oppression_in_video_games_opinion/",
        "text": "[deleted]",
        "created_utc": 1521279630,
        "upvote_ratio": ""
    },
    {
        "title": "Kirby star allies: why is $60 for an 8-hour game acceptable?",
        "author": "Animedingo",
        "url": "https://www.reddit.com/r/truegaming/comments/851awp/kirby_star_allies_why_is_60_for_an_8hour_game/",
        "text": "I'm going to keep this as spoiler-free as I can, with the exception that the game only lasts 8 hours. \n\nI downloaded the game last night, played it at lunch which was 9 p.m. Pacific time for me and I just beat it today.\n\nWhy is this acceptable? If this was any other game, it would have been ridiculed for having so little content.\n\nThe order 1886 was destroyed because it reported in at about 20 hours. \n\nDon't get me wrong, Kirby star allies is absolutely quality over quantity but this is the first console Kirby game in quite some time. Wouldn't you say that if the Kirby formula only allows for 8 hours of content, shouldn't it change? Or allow for a lower price point.",
        "created_utc": 1521258386,
        "upvote_ratio": ""
    },
    {
        "title": "Hottest new Vegas Casino Games on iTunes. Featuring online Craps",
        "author": "casinoevil99",
        "url": "https://www.reddit.com/r/truegaming/comments/8514hy/hottest_new_vegas_casino_games_on_itunes/",
        "text": "[removed]",
        "created_utc": 1521256469,
        "upvote_ratio": ""
    },
    {
        "title": "Hottest new Vegas Casino Games on iTunes. Featuring Online Craps",
        "author": "casinoevil99",
        "url": "https://www.reddit.com/r/truegaming/comments/850yab/hottest_new_vegas_casino_games_on_itunes/",
        "text": "[removed]",
        "created_utc": 1521254633,
        "upvote_ratio": ""
    },
    {
        "title": "Where Did MTB Freeride Go?",
        "author": "Hywood04",
        "url": "https://www.reddit.com/r/truegaming/comments/84zyj0/where_did_mtb_freeride_go/",
        "text": "[removed]",
        "created_utc": 1521244469,
        "upvote_ratio": ""
    },
    {
        "title": "My concerns and thoughts regarding the Division 2",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/truegaming/comments/84yk17/my_concerns_and_thoughts_regarding_the_division_2/",
        "text": "edit - plus, it is pretty common knowledge now that when Ubisoft releases a new gameplay video, it will be very likely that it will downgraded and trick us into buying the game. If such a thing will happen again, I will not lie ... I will be angry at myself for fallinf for it again even though I suspect that Ubisoft will probably do such an ethically shady thing again just to sell a few extra copies\n\nAfter a released [this post](https://www.reddit.com/r/truegaming/comments/843j9a/the_division_2_was_announced_recently_possible/) a while ago on this sub-reddit, I was later also exposed to some criticism from Division players about the announcement of the Division 2.\n\nEven though I expressed excitement for the game and hoping that it will be better than the first Division game, now I am expressing concern and contempt as well.\n\nIt took the Division at least [two years](https://www.youtube.com/watch?v=-zj9yiJ-DzQ) for it to be playable with just the right amount of polish and lack of glitches and problems and with just the right amount of content to make it worth playing.\n\nTwo years is actually quite a long time and it is incredibly lucky that despite the sheer criticism that the game released when it was launched for its buggy release *(my judgement that it was because of [the brand new engine that was never used for another game before](https://en.wikipedia.org/wiki/Snowdrop_(game_engine)) so it makes sense that it had a lot of bugs when it was launched and [Massive Entertainment](https://en.wikipedia.org/wiki/Massive_Entertainment) does not have that much experience developing games with open-world RPG mechanics combined with a semi-tactical third-person shooter elements from previous Tom Clancy games)*. It is incredibly lucky that Ubisoft still focused on the Division and still prioritised on fixing the Division as well and it is also very lucky that people even still played it and trusted Ubisoft enough that the game would actually be fixed *(me included and still play this game)*\n\nBut to be fair, the game just managed to be *just* the right amount of playability now and all of a sudden, they announced the Division 2. It seems that [what this guys says is right](https://www.youtube.com/watch?v=XuN1jnvHQXI) - contrary to Ubisoft's choice to continue to support another popular Tom Clancy *(Rainbow Six Siege)* and even said that [no sequel is planned](https://www.gamespot.com/articles/rainbow-six-siege-no-sequel-is-planned/1100-6456867/) in order to continue to support the game and put more content, it brings the question of why Ubisoft decided to suddenly develop Division 2.\n\nAfter all that time, after all the patience the first Division game playable and all the time taken to fix the games balance issues, glitches and so on and all of a sudden they want to move on with the sequel ... it feels like all that effort was done for nothing.\n\nI am probably going to look forward for the sequel and hoping that the game will be better but considering that I wanted to stick with the first Division game and stayed patient that Ubisoft eventually manages to make the game playable **which should have been done at launch by the way** and now we have the new Division to be marked on our calendars soon ... it just feels that those two years of patience [were all a waste](https://www.youtube.com/watch?v=yKXMQZ61Odo)",
        "created_utc": 1521232192,
        "upvote_ratio": ""
    },
    {
        "title": "Why were Battlestations Midway and Pacific so unpopular?",
        "author": "maltman1856",
        "url": "https://www.reddit.com/r/truegaming/comments/84y2aa/why_were_battlestations_midway_and_pacific_so/",
        "text": "The concept is fantastic.  You can either play RTS style or hop into any individual unit and command it directly.  I played it over a decade ago, but I remember the combat being decent and the strategy portion difficult to manage as you would fly a plane or command a destroyer and lapse on what the remainder of your units were doing.  Within the 5 minutes it would take to complete a few bombing runs you could possibly lose half your ship fleet.  The story was pretty poor, but the gameplay was a blast.  Were these games just not marketed well?  There are hardly any steam reviews and people generally didn't accept the game well.\n\nHas anybody else played them?  Is there a similar game that is rated better?  I have an itch for a game with the same gameplay concept.\n\n",
        "created_utc": 1521228155,
        "upvote_ratio": ""
    },
    {
        "title": "Small YouTube Gaming Channel",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/84xuzu/small_youtube_gaming_channel/",
        "text": "[removed]",
        "created_utc": 1521226575,
        "upvote_ratio": ""
    },
    {
        "title": "What’s one of your favorite games that everyone hated?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/84x9fy/whats_one_of_your_favorite_games_that_everyone/",
        "text": "[removed]",
        "created_utc": 1521221957,
        "upvote_ratio": ""
    },
    {
        "title": "In light of resent events, lets talk about boycotts.",
        "author": "OrickJagstone",
        "url": "https://www.reddit.com/r/truegaming/comments/84wpj8/in_light_of_resent_events_lets_talk_about_boycotts/",
        "text": "So I just read this article, \n\nhttp://www.ign.com/articles/2018/03/16/star-wars-battlefront-2-progression-system-overhaul-revealed-coming-next-week\n\njumped into the comments on reddit and was surprised to see something of a trend. A good deal of people felt that a complete boycott of everything EA creates was some kind of force for positive change in the market. I don't think it is at all and to explain why I think it would be best if we talked about boycotts in general first.\n\nWhat is a boycott? Well really it is the strongest tool in the consumers belt. It allows you to in a way force a company to make drastic steps to change something or risk major loss in profits. In a lot of ways a boycott is like a labor union strike. The workers all stop doing there jobs make a set of demands and refuse to work until that set of demands is met. Now the most important part of the labor strike is that the workers return to work after there demands are met. If they don't well there is a word for that and it's quitting, And why should any company care what the demands of someone quitting are?\n\nSo lets get back to game boycotts. So at this point I am going to voice a few of my own personal feelings about this Battlefront situation. I get that not everyone might agree that this is enough and I think that is fine so long as you agree that SOMETHING will be enough. That sort of hits my point on the head. Why does anyone EA included care what you think if you are simply not going to buy games any more? Speaking with your wallet is just as much about when you spend your money as it is when you do not. So if this update happens and the game still doesn't sell and people still hate on it I think the message to EA is two fold. One the game is a failure period, and such makes EA less inclined to make another Star Wars game, Two the efforts to change the game where not worth the time spent, that leads them to think any game broken in the future isn't worth trying to fix.\n\nI respect the fact that under the surface past all the corporate bullshit there is some real talent working at EA. I don't want EA to go away forever. I also don't want that talent going to waste making senseless cash grabs. I want EA to get back to work making the kinds of games I grew up loving. To do that I need to encourage them through not just telling them when they failed but also buying there stuff when they do right. I understand that to some gamers this might be to little too late or just simply not enough and that is totally fine. I can respect that point of view as long as somewhere inside that point of view there are reasonable limits. Something has to be good enough some actual demand must be present. If not you are just saying \"Keep making shitty games, keep tapping into players that buy shitty game, don't bother even trying to improve because you suck.\". I just feel like if nothing is good enough why even bother saying anything at all. ",
        "created_utc": 1521217572,
        "upvote_ratio": ""
    },
    {
        "title": "Do people understand that developers like Bungie are just brands at this point and a shell of its former self?",
        "author": "CageAndBale",
        "url": "https://www.reddit.com/r/truegaming/comments/84wbxc/do_people_understand_that_developers_like_bungie/",
        "text": "For example Bungie: most if not all the big creative leads have left many years ago and it's not the same studio anymore. Of course they make all these weird desicions and design directions. It's other leads if not suits doing half these things.\n\n My point is stop following studios and like the film industry, follow the directors and such. Popular example: hideo kojima\n\nAlso take into account the gaming sphere landscape has drastically changed in the past decade since halo and marathon were a thing.",
        "created_utc": 1521214626,
        "upvote_ratio": ""
    },
    {
        "title": "Academic survey on monster design in horror video games (everyone 18+ can take part)",
        "author": "-Z-e-N-",
        "url": "https://www.reddit.com/r/truegaming/comments/84vpc8/academic_survey_on_monster_design_in_horror_video/",
        "text": "[removed]",
        "created_utc": 1521209620,
        "upvote_ratio": ""
    },
    {
        "title": "Anything to be said in defense of non-racing games that have one or two racing levels?",
        "author": "FiniteRegress",
        "url": "https://www.reddit.com/r/truegaming/comments/84vlga/anything_to_be_said_in_defense_of_nonracing_games/",
        "text": "Maybe this is just me, but I get really frustrated when games that aren't all about racing feature a random race here or there. This thought came to mind when I was banging my head against the wall during the racing levels of the *Crash Bandicoot: Warped* remaster—levels which, frustation-wise, reminded me quite a bit of the Goron race in *Majora's Mask*.\n\nThe thing is, I don't have an issue with *racing games*: stuff like *Mario Kart*, for instance, I'll eat up. So I don't know if it's just that the *quality* of races in non-racing games is lackluster, or if it's the requirement to muster a totally different set of *skills* (racing skills) in games that don't really require these skills elsewhere... or something else entirely.\n\nWhat do you all think? Is this frustration relateable? Am I overreacting? What might the underlying problem be?\n\nEdit: Wow, glad to see I'm not alone here. The frustration is real.",
        "created_utc": 1521208699,
        "upvote_ratio": ""
    },
    {
        "title": "Transparency in videogames through convienence of life improvements",
        "author": "Klunky2",
        "url": "https://www.reddit.com/r/truegaming/comments/84vdc7/transparency_in_videogames_through_convienence_of/",
        "text": "I did have a hard time about thinking for a fitting title about this topic, it's something which is bugging me in most modern video games nowadays and is in older titles mostly absent.\n\nTo describe the quintessence of my statement just from the start: the absence of information is as much important as the presence of information, when it comes to designing an videogame.\n\nThere are certain game features which are implemented for the sake of convinience and are seen as common for most people today.\nI don't want to focus to much on specific examples it's much more the trend of getting more and more less subtle when the game is conveying informations to the player.\nWhat I don't mean when I speak of subtetly, is getting intentional vague, thats as much as artifical as telling player informations in an unnatural way.\n\nThere is a great pallete of feature which are count as standard, the most common example are symbols which are shown on the mini map, telling you the exact direction to a certain target. \n(even the minimap by itself is a popular feature to help the player orientate in the game world.)\n\nBut it goes even further, an much more simple example is a visual confirmation of obtaining all collectible items on a specific area. It's there for a valid reason, by telling players when they can stop searching the area for valuable mcguffins. \nSo... on first glimpse it's a little help, but its existence has a much higher impact on the general game flow and the mindset of the player as it seems.\n\nThe game becomes more predictable, more transparent. On the gameplay perspective it's a very little minor addidtion, but the information which is conveyed cannot be underestimated. You can get to the following conclusions just because of this tiny piece of binary information:\n\n- There are specific items to obtain in the area\n- You did/n't find every item on the area\n- You can exactly see which areas still do have items to find\n- You have probably to backtrack to that area at a certain point in the game to get the item/s\n\nIt changes your entire behavior how you approach a certain section or the whole game. It creates awareness and as such it's planting expactations in your mindset. If every game is behaving by the same rules/mechanics - and well, this tiny piece of information is, as I said pretty standard, then seeing your expactations getting confirmed every single time is... pretty boring after a while.\n\nAnd this is just a minimalistic example to show how underestimated something like just a little visual cue is. Most games like Assasin's Creed at example do have a entire bandwith of features which are there to help staying track of what you have to do and (sometimes) how to do it.\n\nAnother example:\n\nIt's pretty popular in most games today, to show you where you have to go to fulfill a specific objective. There is a symbol on the map or at worst case on the screen, which is telling you all the time where you have to go, even when you never visited that location before.\n\nWith that knowledge in background, many game developers aren't cautious anymore about giving you a description how you actually find the place. It's an inconsistency about the information the player already has and how the avatar of the player could possibly know. \nit's... completely unnatural and it's getting you more and more to point where don't have to think anything over, just follow the marker and everything else concludes itself. \nSo even if you don't like markers, they are optional and you turn them off, you're screwed, because the game is designed therefor.\n\nIt's simply convience, but the the wrong kind of convinience in my opinion, it does have its advantages but ultimately it makes the game so predictable to the point where you aren't bothered of getting to conclusions by your own thinking, the games does this for you.\n\nIt's really important to differentiate between mindless busywork, where design choices of convience can help and where it actually impacts the way how you experience the game. \n\nGames as Dark Souls are a positive example of keeping a game world interessting by telling and highlighting basically nothing, its even unclear when something resembles a quest which you are about to follow.\nAs such the gameworld has the potential to surprise you till the end, there is no formulaic structure or approach, at least no information about it where you have insight.\nEven these games have convenience in certain aspects, but they don't change you gameplay experience and that's positive in my opinion\n\nMost games don't handle its content like Dark souls and a big factor are these typical convinience of life improvements.\n\nOctopath traveller is also getting markers on the map which shows you where you have to go on the screen, that means you can point out in dungeons where all the optional content is located and can surely find your way through even more complex labybrinths if there are some in game.\nAlso there is quick-travel which could eliminate the entire ressource management aspect of an game, if its implemened poorly. So yeah those affect the approach to the game as well, it's not so simple like it seems. The implementation, just because wished by players has to be well thought over.\n\nhttps://www.polygon.com/2018/1/30/16951676/project-octopath-traveler-demo-feedback-nintendo-switch-rpg\n\n- What do you think? \n- Are there any QoL improvements, which aren't really \"improvements\" from a game-design perspective for you?\n- Do you remember some game moments, that would be totally different with the presence of common QoL-improvements?\n\n",
        "created_utc": 1521206552,
        "upvote_ratio": ""
    },
    {
        "title": "Transparancy of videogames by convenience of life improvements",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/84vawf/transparancy_of_videogames_by_convenience_of_life/",
        "text": "[deleted]",
        "created_utc": 1521205916,
        "upvote_ratio": ""
    },
    {
        "title": "Additive / Reductionist Gaming",
        "author": "Sinisterres",
        "url": "https://www.reddit.com/r/truegaming/comments/84twki/additive_reductionist_gaming/",
        "text": "[removed]",
        "created_utc": 1521188479,
        "upvote_ratio": ""
    },
    {
        "title": "Gaming laptop recommendation. Budget $1300.",
        "author": "saip009",
        "url": "https://www.reddit.com/r/truegaming/comments/84tcky/gaming_laptop_recommendation_budget_1300/",
        "text": "[removed]",
        "created_utc": 1521180537,
        "upvote_ratio": ""
    },
    {
        "title": "Am I the only one who has never played and doesn't want to play GTA?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/84rvpn/am_i_the_only_one_who_has_never_played_and_doesnt/",
        "text": "[deleted]",
        "created_utc": 1521164354,
        "upvote_ratio": ""
    },
    {
        "title": "Great story games on PS4 or Switch??",
        "author": "Wass3r10",
        "url": "https://www.reddit.com/r/truegaming/comments/84myhg/great_story_games_on_ps4_or_switch/",
        "text": "[removed]",
        "created_utc": 1521124921,
        "upvote_ratio": ""
    },
    {
        "title": "Maybe we were wrong to be against paid mods",
        "author": "zeddyzed",
        "url": "https://www.reddit.com/r/truegaming/comments/84letk/maybe_we_were_wrong_to_be_against_paid_mods/",
        "text": "I had a shower though earlier today.  \"It's so sad that fewer and fewer (ie. almost none) games offer formal modding support these days.  How can we encourage developers to include modding support?\"\n\n\nOf course, the go-to capitalist answer is money.\n\n\nLogically, mods and DLC / lootboxes are mutually exclusive features.  No one is going to pay for the special golden colored longsword + 2, if they can just open up the longsword data file and mod the color and stats themselves.\n\n\nSo when the community pushed back hard against paid mods, we basically sent ourselves down the present path of low-effort DLC and lootboxes.  (Because, there is no possible future where companies are not greedy and refuse the sweet sweet gold of microtransactions.)\n\n\nImagine if we had embraced paid mods instead, and it became common in the industry.  So home devs can sell their mods using the game as a platform, and the original publisher takes a cut.  Now the publishers can get their sweet sweet microtransaction rivers of gold, and they don't even have to do any work!  It must be a great deal for them, so I'm sure most will choose this path instead of lootboxes / trivial DLC.  (well, except for online multiplayer games.)\n\n\nAs a side effect, more and more games have better modding support, and this allows more and more home devs to produce content.  Of course, most of it will be bad, but due to sheer numbers there will always be cream that rises to the top.  So we'll be getting nickel and dimed for fan fixes to the game, fan expansion campaigns, totally new game types, improved texture packs, etc.\n\n\nIsn't that a much better reality than lootboxes / low-effort DLC, and virtually no games with formal modding support?",
        "created_utc": 1521109280,
        "upvote_ratio": ""
    },
    {
        "title": "Why doesn't the gaming industry regularly leak false info the avoid real leaks?",
        "author": "Very_legitimate",
        "url": "https://www.reddit.com/r/truegaming/comments/84kqaa/why_doesnt_the_gaming_industry_regularly_leak/",
        "text": "Leaks are so common now and it seems like the industry generally doesn't do much to fight it. Obviously I can't see all the internal happenings, and we have leaks and then we have \"leaks\" which are just marketing.\n\nBut it seems like if they really wanted to combat that stuff they would just regularly have different people pass bad information as leaks.\n\nThere could be some law in the US making this illegal, or it could be considered unethical by some, I'm not sure. But it seems like it would work and it's a pretty simple idea. So why do you all think they don't do it?",
        "created_utc": 1521099778,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any Games in which the Player can know things the Characters don't, and have this Information have an Impact on the Game? (Minor Persona 5 spoilers)",
        "author": "EmeraldJunkie",
        "url": "https://www.reddit.com/r/truegaming/comments/84g7gd/are_there_any_games_in_which_the_player_can_know/",
        "text": "[removed]",
        "created_utc": 1521055902,
        "upvote_ratio": ""
    },
    {
        "title": "need a new ''gaming chair'' or should I say comfortable ergonomic chair",
        "author": "goldmike777",
        "url": "https://www.reddit.com/r/truegaming/comments/84ezzy/need_a_new_gaming_chair_or_should_i_say/",
        "text": "[removed]",
        "created_utc": 1521046963,
        "upvote_ratio": ""
    },
    {
        "title": "Why does no one enjoy my games ?",
        "author": "MFigueired0",
        "url": "https://www.reddit.com/r/truegaming/comments/84ebi7/why_does_no_one_enjoy_my_games/",
        "text": "I created a game for Android and \"forced\" family and friends to install it and review for me, everyone looked super excited about it, so i posted it on the play store and asked my friends to share it with theyr friends. \nThe reviews were:  \"Awsome\" , \"Fantastic\" and the little constructive reviews i had, i attempted to learn what i could from it and fix the game. \n\nThe game was played like once or twice by each person for like 2 or 3 min.\n\nSo i thought maybe it was the concept that was just not appealing, and decided i would make another one. This one i would improve the graphics, so along the development i asked people for preferences on the looks of the game.\nAnd now instead of asking family and friends to review it, i invested some money to bring people to play it and review it. \n\nEven if all the reviews were awful i would still be happy i learned something.\nInstead people just download the game. Play it once for 2 or 3 min, and close it never to return. They didnt even bother writing \"boring\" , or \"Ugly\" or something\n\nTLDR: Do you usually review the games you play? If so what are the requirements for you to bother reviewing the game ?\n\n\nEDIT:\nThank you for the support and info provided ! Was really helpful, and i'm sorry for the initial frustration. I just was running out solutions without knowing the problem. ^^",
        "created_utc": 1521041932,
        "upvote_ratio": ""
    },
    {
        "title": "I can't tell if Divinity Original Sin (the first one) genuinely has terrible quest design or I'm just incredibly stupid.",
        "author": "GTR_Helix",
        "url": "https://www.reddit.com/r/truegaming/comments/84dpx1/i_cant_tell_if_divinity_original_sin_the_first/",
        "text": "[removed]",
        "created_utc": 1521037159,
        "upvote_ratio": ""
    },
    {
        "title": "Tell me, what is your Top 3 Dreamcast games?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/84d3cu/tell_me_what_is_your_top_3_dreamcast_games/",
        "text": "[removed]",
        "created_utc": 1521031537,
        "upvote_ratio": ""
    },
    {
        "title": "Additive vs Reductionist Gaming, Brains, Politics",
        "author": "Sinisterres",
        "url": "https://www.reddit.com/r/truegaming/comments/84byx1/additive_vs_reductionist_gaming_brains_politics/",
        "text": "[removed]",
        "created_utc": 1521018381,
        "upvote_ratio": ""
    },
    {
        "title": "Best games to play with Radeon HD7790",
        "author": "Fahad-Iqbal",
        "url": "https://www.reddit.com/r/truegaming/comments/84bt5q/best_games_to_play_with_radeon_hd7790/",
        "text": "[removed]",
        "created_utc": 1521016166,
        "upvote_ratio": ""
    },
    {
        "title": "Tell me, what is your Top 3 Dreamcast games ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/84b82c/tell_me_what_is_your_top_3_dreamcast_games/",
        "text": "[deleted]",
        "created_utc": 1521008224,
        "upvote_ratio": ""
    },
    {
        "title": "What are your thoughts on Quick Time Events/minigames with random button combos,etc?",
        "author": "AnokataX",
        "url": "https://www.reddit.com/r/truegaming/comments/84anu9/what_are_your_thoughts_on_quick_time/",
        "text": "Positive or negative?\n\nOverall I kinda...hate them? I was thinking of this. Thematically they often have 0 ties to the action being performed, and it feels like filler to make the gamer feel engaged. But to me, engaging gameplay shouldn't need random button inputs/timings to succeed. \n\nI think I don't mind if it's something logically tied to the action. Ex a fishing game where you need to tilt the control stick opposite the fish's movement makes sense that you're tugging the fish to you. But one where you \"hit A when the circle with A inside pops up to do higher damage/salvage for treasure\" feels much more random.\n\nAnyway if you like or dislike QTEs/minigames, can you give some examples too? I'm honestly interested in others thoughts. For me, I dislike a lot of the crafting minigames in Fantasy Life and the timing for specials/salvaging in Xenoblade, but I have enjoyed at least a bit of Monster Hunter Stories \"mash A to urge monster on to overcome the enemy monster\" and ones like Paper Mario's counter with A timings on opponents attacks.",
        "created_utc": 1521001676,
        "upvote_ratio": ""
    },
    {
        "title": "Death of game mechanics: \"Ask about\", why?",
        "author": "teosito",
        "url": "https://www.reddit.com/r/truegaming/comments/84ag7k/death_of_game_mechanics_ask_about_why/",
        "text": "I started to play \"The Magic Candle\" an old DOS game, and I found this dead mechanic, used a lot in old rpgs, like Fallout, but by the year 2000, no game uses it.\n\nFor those who don't know what it does, it allows you to ask a npc about certain information, not related to their conversation. An example: In the magic candle, you can ask about how to get in certain city to a npc that tells you to go to talk to another npc about certain information.\n\nThis allowed the player to gather information and, if he found what he thinks is a related to the topic npc, ask about it, making the world seem more connected.\n\nIn today's game, and their's huge world, it could make some quest really (subjectively) interesting, or have some \"hidden\" quests. These games could take this mechanics to new levels, having the player to make connections between pieces of informations, npcs that have secrets, and using this would make a good way to point the player to that npc.\n\nI'm not saying this mechanic is perfect, or it should be in the majority of games, as it has some really important cons.\n\nNeeding a notepad to write information would take a lot of people out of the immersion by doing two things: The player needs to stop playing to write down information. The other big thing is that it takes a lot of time and this is something unenjoyable for a big playerbase portion. \n\nShould this mechanic be reimplemented? or the quest log is strictly better? Could a mix between those two things be something good? Why did it disappear in the first place? Quest logs can't have all the blame\n\nSorry for my bad english, I shouldn't write a wall of text, but this one of the mechanics I miss most, and nobody ever talks about it.",
        "created_utc": 1520999654,
        "upvote_ratio": ""
    },
    {
        "title": "Why have online trading card games evolved so little from the original formula of Magic: The Gathering?",
        "author": "TheHeavyMetalNerd",
        "url": "https://www.reddit.com/r/truegaming/comments/849im1/why_have_online_trading_card_games_evolved_so/",
        "text": "As a life-long lover of TCGs I've been really hoping to see new and interesting types of online card games produced, however all of the major TCGs, with the exception of Gwent and MAYBE Clash Royale at a stretch, have mostly retained MTGs basic formula. (Gaining mana every turn, spending mana to play minions/cast spells, minions only having 2 stats of attack and health totals, deck building being limited by which 'class' or 'faction' you're playing as).\n\n(I'm not counting Yu-Gi-Oh!  or Pokemon since they're just online versions of physical TCGs and have little to no changes to the actual game.)\n\nI can understand Hearthstone being a derivative of MTG as it was the first major online CCG but it seems as if most online card games are content to be further derivatives of Hearthstone rather than try to create their own game. (Shadowverse, Eternal, Elder Scrolls: Legends) The only exception to this I can think of being Duelyst with the game taking place on a grid and introducing unit movement like a turn-based strategy game.\n\nThis especially disappointing to me as someone who never particularly enjoyed Magic: The Gathering in the first place. (Though I can appreciate how well designed and popular it is) Hearthstone showed that without the restrictions of physical paper and ink all sorts of new mechanics could be introduced (C'thun gaining buffs anywhere in the game, cards duplicating or producing other cards) but largely haven't been taken advantage of. \n\nIt's baffling to me that even with almost every single restriction that previously limited TCG design being lifted with the introduction of the ability to create games online, that card games have evolved so little. \n\n\n\n",
        "created_utc": 1520990486,
        "upvote_ratio": ""
    },
    {
        "title": "Prevent eye strain/fatigue from extended gaming sessions.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8498uq/prevent_eye_strainfatigue_from_extended_gaming/",
        "text": "[removed]",
        "created_utc": 1520987966,
        "upvote_ratio": ""
    },
    {
        "title": "Do games wherein the only difficulty barrier is yourself have a place in today's market and player base?",
        "author": "messem10",
        "url": "https://www.reddit.com/r/truegaming/comments/846x1k/do_games_wherein_the_only_difficulty_barrier_is/",
        "text": "With the release and semi-resurgence of rhythm-based games and puzzle games with little to no fanfare, I thought it would be interesting to get other's views on how viable these games could be.\n\nGames where the only barrier is yourself and are entirely skill-based can be cathartic, but we do not see many of them these days. These games are entirely self-paced and you can see your progress as you are able to surmount what you once thought was impossible.\n\nThat said, there are some modes in other games where you can have that sort of experience. A good example of this would be the time trials in racing games, but they are not the main draw to most players.",
        "created_utc": 1520968941,
        "upvote_ratio": ""
    },
    {
        "title": "Help with a school project",
        "author": "JacketW3ather",
        "url": "https://www.reddit.com/r/truegaming/comments/846fkq/help_with_a_school_project/",
        "text": "[removed]",
        "created_utc": 1520965434,
        "upvote_ratio": ""
    },
    {
        "title": "Graphics Card for HP DC7900 CMT",
        "author": "Fahad-Iqbal",
        "url": "https://www.reddit.com/r/truegaming/comments/84619h/graphics_card_for_hp_dc7900_cmt/",
        "text": "[removed]",
        "created_utc": 1520962491,
        "upvote_ratio": ""
    },
    {
        "title": "Have you/would you ever used/use a randomizer program to select what game you play next?",
        "author": "fabrar",
        "url": "https://www.reddit.com/r/truegaming/comments/845tao/have_youwould_you_ever_useduse_a_randomizer/",
        "text": "[removed]",
        "created_utc": 1520960874,
        "upvote_ratio": ""
    },
    {
        "title": "What are some video games that teach you something interesting or make you better at some real life activity",
        "author": "104abhay",
        "url": "https://www.reddit.com/r/truegaming/comments/844925/what_are_some_video_games_that_teach_you/",
        "text": "[removed]",
        "created_utc": 1520948813,
        "upvote_ratio": ""
    },
    {
        "title": "The Division 2 was announced recently. Possible ideas on how to make The Division 2 better. (This may also apply for any future open-world video game)",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/truegaming/comments/843j9a/the_division_2_was_announced_recently_possible/",
        "text": "[removed]",
        "created_utc": 1520941881,
        "upvote_ratio": ""
    },
    {
        "title": "Superbrothers: Sword &amp; Sworcery EP",
        "author": "Nedks",
        "url": "https://www.reddit.com/r/truegaming/comments/843blg/superbrothers_sword_sworcery_ep/",
        "text": "[removed]",
        "created_utc": 1520939346,
        "upvote_ratio": ""
    },
    {
        "title": "What constitutes a \"good battle system\"?",
        "author": "Firmament1",
        "url": "https://www.reddit.com/r/truegaming/comments/841u7p/what_constitutes_a_good_battle_system/",
        "text": "RPGs, Action games, Shooter games: Genres like these almost all revolve around combat. Certain games have been praised for their combat system. But what exactly makes a combat system good?\n\nThere are 2 main formats. Turn based, which is what it sounds like. It's not real-time, but each character has a turn to take whatever action they'd like. Action based. This is real-time. Depending on the games genre, you can select certain skills in the midst of battle, and use them. In shooter games, it can involve switching weapons.\n\nBut what makes each of these systems good, or bad? Is it because of the new ideas brought to the table? Or is it just about going back to the basics? What ideas work with each system? Which ideas don't, causing the battle systems to be clunky?\n\nTo give you all an example of what is considered a good battle system, let's take a look at Final Fantasy 13's Command Synergy. Despite this game being reviled in general, it's a commonly praised aspect. The general idea is that it's a real-time turn-based hybrid. Real-time, in the sense that you have to select your skills on the fly, but turn based in the sense that there is a menu that resembles that from a turn based system. You select one of the options on the menu (Auto battle, skills, Techniques, and items.), such as items, and then you select an option from that menu. To actually attack with skills or auto-battle though, there is an ATB gauge, which acts as an action point meter. The gauge fills up over time, and each skill takes up a certain number of segments of the gauge. You then select the skills that you want to use, and deplete the gauge entirely if you want (but you have to let it recharge). There are also certain roles, which act as this game's classes, and you can change these roles in game through \"Paradigm shift\". Meaning that you switch your party's current roles in battle. Say for example, Character A is an attacker, but after a paradigm shift, Character A is now a tank. It changes up the skills that you have, and introduces more strategy as opposed to just how you use your gauge. But what makes this system good necessarily? People claim that it's fast-paced or strategic, but there's definitely more to it than that.",
        "created_utc": 1520919580,
        "upvote_ratio": ""
    },
    {
        "title": "I just deleted all my competitive games... Feel empty and lost. (long vent post and open for discussion)",
        "author": "a2242364",
        "url": "https://www.reddit.com/r/truegaming/comments/8401ob/i_just_deleted_all_my_competitive_games_feel/",
        "text": "[removed]",
        "created_utc": 1520901008,
        "upvote_ratio": ""
    },
    {
        "title": "Stealth-ish Games: Do you kill or sneak by?",
        "author": "SunTzuGaming",
        "url": "https://www.reddit.com/r/truegaming/comments/83wst1/stealthish_games_do_you_kill_or_sneak_by/",
        "text": "When you play games that let you sneak by enemies or kill them, which do you pick? Do you decide before you start which way you’re going to go, do you alter level to level depending on how hard one way is compared to the other?\n\nI’ve been ticking old games off my backlog list, and many had this in common, here are mine:\n\n-\t**Deus Ex: Mankind Divided**  Kill only when needed really, except in one area as they were clearly the bad guys.\n-\t**Metro 2033 Redux**  Killed many, a couple packs of wanderers left alive.\n-\t**Metro Last Light Redux** Tried to kill as few as possible, also played on Ranger Hardcore so ever effin bullet counts, for real.\n-\t**Dishonored** Tried my best not to kill people. They’re usually just some guards doing their job right, they don’t know I was setup, you know? ;p\n",
        "created_utc": 1520876093,
        "upvote_ratio": ""
    },
    {
        "title": "Stupid Question: Is the profitability of games almost always going to lead a game down a certain genre?",
        "author": "Anansispider",
        "url": "https://www.reddit.com/r/truegaming/comments/83w5ot/stupid_question_is_the_profitability_of_games/",
        "text": "What I mean is this, take for example League of Legends/Paragon/DOTA 2. These games introduce a number of characters and lore ( or at least try to) to garner interest and  renewed reasons to play the game. You play all these characters in a MOBA genre, but the lore and  the focus on the character itself will almost always be in a MOBA setting.Probably because it would not be profitable to put these characters in a RPG, Visual Novel, etc, you can extract the most money by doing a MOBA. \n\nSimilarly - if you want to make a platformer per say, the big trend is in roguelikes as opposed to regular platformers, and you have to cater the game accordingly to fit that profitable genre. Instead of taking more \"creative\" liberties...\n\n\nWhat are your opinions on this subject? \n\nEDIT:  Is the game's potential profitability always going to be a massive influence on the genre/design of the game? ",
        "created_utc": 1520871424,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone remember information on what games were good being so isolated/hard to find before the common person had internet. Felt like a shot in the dark.",
        "author": "EatSleepAndFuck",
        "url": "https://www.reddit.com/r/truegaming/comments/83vmgs/does_anyone_remember_information_on_what_games/",
        "text": "For some reason I can remember seeing a full page ad in what was probably nickelodeon magazine for star wars jedi knight jedi academy, never made the leap to buy it and at that point there was no way to look further into it. Other than squinting at the box art through the glass case at walmart trying to determine if it would be fun.\n\nI remember in grade school buying a video game was such a shot in the dark, you couldn't just watch a youtube video of it being played and reviewed. If you were extremely lucky you happened to find a review of it in a magazine if you were subscribed to one like nintendo power but I never was, I'd rather spend the money on games right?\n\nInformation was not so freely accessible, it felt more like isolated pockets of information you would share with your friends that you guys learned the hard way. (I bought superman 64, widely considered one of the worst games of all time), but sometimes you struck gold, like my cousin has smash bros and it was cool, so i bought it. I can remember having that players choice banner on the box was a big deal, because you knew it was good.  There was such a risk going out on a limb, you might come out of it with a gem like mischief makers, you might end up with bluesbrothers 2000  \n\nOf course being a child probably added to the layer of difficulty, for the most part I would walk up to a glass case at walmart and stare at boxes to determine what would entertain me for possibly the next 6 months.  Getting something bad was a heart breaker.\n\nTraditional Advertising was a big source of info, I can remember being pumped just to see a pokemon commercial.\n\nEventually my parents subscribed to dial up internet, so I could take the phone line down into the computer and ask jeeves things like where do you find the HM cut? load the page, bookmark it/make it available offline and reconnect the phone.",
        "created_utc": 1520867212,
        "upvote_ratio": ""
    },
    {
        "title": "RAREST GLITCH IN THE WORLD..Fortnite Battle Royale (You can Send your Clips)",
        "author": "ElectronicStruggle",
        "url": "https://www.reddit.com/r/truegaming/comments/83tkt8/rarest_glitch_in_the_worldfortnite_battle_royale/",
        "text": "[removed]",
        "created_utc": 1520845208,
        "upvote_ratio": ""
    },
    {
        "title": "How To Download Red Dead Redemption 2 For Free For Pc Full Version 2018",
        "author": "ElectronicStruggle",
        "url": "https://www.reddit.com/r/truegaming/comments/83thsy/how_to_download_red_dead_redemption_2_for_free/",
        "text": "[removed]",
        "created_utc": 1520844059,
        "upvote_ratio": ""
    },
    {
        "title": "Can smart voted user generated content make future games more lively ?",
        "author": "Floppowerww2",
        "url": "https://www.reddit.com/r/truegaming/comments/83t6ii/can_smart_voted_user_generated_content_make/",
        "text": "Talking about solo games \n\nOne of the aspect that makes games feel empty is, sometimes, the redundancy of dialog and or content.\n\nFor example, if we have 10 NPCs in a town, and no voice acting, we can hope, maybe for 10 lines of dialog let say.\n\nIt is time consuming for a developer to write meaningful dialogs for npcs. \n\nNow, my idea, keeping in mind it is something hypothetical,  is to use the players/users/consumers  in order to create , on the fly, environmental  content to fill up the non-core game world.\n\nFor example, players could take control of an NPC, and act as an actor on scene. And it will be experienced by the players around the world. \n\nAnd a bit like reddit where the NEW tab is mainly curated by a small number of users before it hits the main tab, when a dialog is vetted and appreciated by enough \"beta testers\" players then it is populated to the main game (like a small update)\n\nBad content is voted out and users can also be banned from creating more (noy from playing).\n\nIt's not about using free work from modders,  it is only about adding a bit of dialog here and there (eventually, we could even imagine, that deep, very good, popular content being remunerated).\n\nThen on top of that, you sprinkle some dynamic parameters  :\n\n- I log into the \"content creation \" menu, I choose an NPC,  that blacksmith who is always saying the same old stuff. I choose some in game parameters (late evening, raining, doesn't like the player)  \n- I edit and add a new dialog tree (\"listen, boy, I don't like you, and i have to close shop and go home early, it is pouring,,,.)  \n- I upload it on the hub in game   \n- few days pass, my content is voted good, it then is added as a possible dialog in-game for the whole player base  \n\nAdding to that idea, mainly related to dialogs, we could even imagine users creating action for npcs, like paths or routine, that would render their lives more fully.\n\nWhat do you guys think ?\n\nCan the collective effort of a user base be useful to game content in quasi realtime manner, not like mods that you download and install voluntary manner....\n\nThank you ",
        "created_utc": 1520839624,
        "upvote_ratio": ""
    },
    {
        "title": "The Gameplay Formula in the Final Fantasy/Dragon Quest genre of RPG's: Too traditional, and too basic? Have any games in this genre revolutionized the gameplay, or is it getting stale?",
        "author": "Seakawn",
        "url": "https://www.reddit.com/r/truegaming/comments/83smg5/the_gameplay_formula_in_the_final_fantasydragon/",
        "text": "[removed]",
        "created_utc": 1520832184,
        "upvote_ratio": ""
    },
    {
        "title": "What has kept Battlerite's player retention so low?",
        "author": "Mycroft_",
        "url": "https://www.reddit.com/r/truegaming/comments/83rz2c/what_has_kept_battlerites_player_retention_so_low/",
        "text": "Battlerite was marketed as everything good about a moba, without anything bad that comes with a moba. It wasn't as time-consuming and cut a lot of the fluff that culminates into the climax of each match: the teamfights.\n\nIt was a quick, fast-paced battle arena akin to WOW's PVP systems that went F2P following its 1.0 release back in November. It reached its peak the same month topping off at around 44 thousand consecutive players.\n\nThe player base eventually hemorrhaged itself to a low of 1/4th its F2P peak at one point but has rebounded since following the end of an abnormally long preseason.\n\nThe question is in the title, this has just been a primer from someone who delved into the game during the F2P launch but hasn't touched it  since. \n\nAny numbers cited in my post can be found [here.](http://steamcharts.com/app/504370)\n\n",
        "created_utc": 1520824590,
        "upvote_ratio": ""
    },
    {
        "title": "Game recommendations? Or tips ahah",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/83r5y8/game_recommendations_or_tips_ahah/",
        "text": "[deleted]",
        "created_utc": 1520816425,
        "upvote_ratio": ""
    },
    {
        "title": "Prey is a great open world RPG, similar to Skyrim and things to copy",
        "author": "berlinbrown",
        "url": "https://www.reddit.com/r/truegaming/comments/83oeiq/prey_is_a_great_open_world_rpg_similar_to_skyrim/",
        "text": "Do you agree?\n\nWhen you think of Prey, it is more like a scifi thriller but really is a great open world RPG.  Why?\n\nIf you compare with Skyrim or Witcher, there are some common themes, you have to search for items, you have to build up your arsenal and skills.  I love the exploring, you really have to cautiously explore the entire station to get the right items.  Every item, every piece of trash could combine to your survival.  Skyrim has some similar elements but it really isn't necessary in say Skyrim or Witcher.  But in Prey you have to explore the whole open world and even in space you have to gather items.\n\n",
        "created_utc": 1520791761,
        "upvote_ratio": ""
    },
    {
        "title": "Are there and informative G4 Attack of the Show style shows on YouTube?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/83ny8f/are_there_and_informative_g4_attack_of_the_show/",
        "text": "[removed]",
        "created_utc": 1520787814,
        "upvote_ratio": ""
    },
    {
        "title": "What makes a Video game Sublime? - By Immanuel Kant",
        "author": "Gamedenker",
        "url": "https://www.reddit.com/r/truegaming/comments/83niz6/what_makes_a_video_game_sublime_by_immanuel_kant/",
        "text": "https://youtu.be/Wzj4h0R_ryQ\n\nIn this video, I'll explain what the ideas of the great philosopher Immanuel Kant can bring to video games and enrich them, especially his ideas on the Sublime.\n\nThe great philosopher Immanuel Kant produced an endless stream of deep ideas from his critique of reason to thoughts on metaphysics. One of his most overlooked ideas is the sublime.\n\nBefore we see how his ideas can affect video games let us first understand them. \nKant puts aesthetic experiences in two categories, the beautiful and the sublime. \nIn the English language, both words have a similar meaning, sublime would mean unparalleled; supreme or being of a high standard.\nBut this has nothing to do with Kant's definition of the sublime. kant means those rare experiences when we are in awe of something bigger than our small size in relation to our surroundings like violent storms, volcanos or being in the presence of huge mountains which seem to overwhelm us. \nIf our ability to intuit is overwhelmed by size or 'dynamical' - if our ability to will or resist is overwhelmed by force then we are in a state of sublime. \n\nThe million dollar question is: can there be a digital Erhabenheit? A sublime that has no existence in the real world, composed of algorithms and lines of codes.\nCould something that is purely abstract instill the pleasurable dread of the Erhabenheit in us?\nI think so, and Video games more than any other medium are capable of that.\nI don't see many video games take advantage of this feature in the human spirit.\nThe ones that do are rare, I still remember the moment I met the first giant in Shadow of the Colossus. It was a pure Erhabenheit moment. A mixture of a mathematical sublime because of the giant's size and a dynamic sublime made by the safe distance of the player who forgets all the algorithms, polygons and C++ codes behind it for a moment and sees a person struggling in an epic battle with a giant. \nFor some reason, I didn't get the same feeling when I climbed trico for the first time in the last guardian. The mathematical component of the sublime was present, the size but the dynamic one was missing, fearing the creature and seeing him as a threat.\nEdmund Burke the English philosopher puts another condition for the mathematical Sublime: the proportions of the big object must necessarily display its big size.\n\nLet's move to the dynamic Erhabenheit in games. There is one scene in Metal Gear Solid 5, right at the beginning of the game when snake can barely walk and we witness with him how atrocious terrorist acts where being done in the hospital against patients, doctors and nurses.\nOur natural reaction to terror, if we are in the spot in the real world is fear and trying to run for our lives, even from a safe distance, when we watch these atrocities on tv our reaction is anger, sorrow for the victims and resilience in the face of the attackers.\nBut in that scene from Metal Gear 5, our reaction is different, its pure dynamic sublime. It was pleasurable but not beautiful. \nI still remember how many critics praised the first hour in the game and Craig Miller called it the best hour in video Games history. \nNone of them called it beautiful or talked about any beauty in that scene, so what is it that they liked but couldn't put it into words? It's Kant's Dynamic sublime.\n\nWhat Do you think guys? Do you have good examples of the Erhabenheit (Sublime) feeling in games? ",
        "created_utc": 1520783918,
        "upvote_ratio": ""
    },
    {
        "title": "Why could Contra make the jump to the 32 bit era?",
        "author": "another1urker",
        "url": "https://www.reddit.com/r/truegaming/comments/83n7kb/why_could_contra_make_the_jump_to_the_32_bit_era/",
        "text": "I've always been puzzled by this. Many franchises made the leap. Metal Gear for one. So why not Contra?",
        "created_utc": 1520780761,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Cry of Fear game free?",
        "author": "Thomas982919",
        "url": "https://www.reddit.com/r/truegaming/comments/83n45z/why_is_cry_of_fear_game_free/",
        "text": "[removed]",
        "created_utc": 1520779795,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else dreads the game's ending?",
        "author": "Mattykitty",
        "url": "https://www.reddit.com/r/truegaming/comments/83n3al/anyone_else_dreads_the_games_ending/",
        "text": "I've noticed that in games I really like, ones that have a storyline or something approaching that, I would find myself taking very long breaks that could last for months once I'm more than halfway through the game. I just simply don't want to finish them, because then they will be over, and then I'll have to repeat the process of finding games I like all over again.\n\nThis is, of course, stupid, because if I'm not playing them then it's just like if I finished them and had no more content.\n\nDoes anyone else do this? What do you do to cope with it?\n\nI've been thinking I should replay games more, but every fiber of my being resist that. It's like we as humans feel like we're wasting our time if we're going through the same thing again.",
        "created_utc": 1520779527,
        "upvote_ratio": ""
    },
    {
        "title": "I have a problem where if i had two games with the same genre i watch a video why that other one suck and uninstall it.",
        "author": "mmmmoneyshot16",
        "url": "https://www.reddit.com/r/truegaming/comments/83m7sp/i_have_a_problem_where_if_i_had_two_games_with/",
        "text": "[removed]",
        "created_utc": 1520767853,
        "upvote_ratio": ""
    },
    {
        "title": "An example of somewhat shitty boss design.",
        "author": "ShogunMelon",
        "url": "https://www.reddit.com/r/truegaming/comments/83m3u2/an_example_of_somewhat_shitty_boss_design/",
        "text": "Alright, so as many of you know, Bloodborne is free on PlayStation Plus this month, alongside Ratchet and Clank 2016, and, if I recall correctly, Mighty Number 9 in the PS4 category. \n\nNow, I've enjoyed Bloodborne thus far, and still continue to do so. It reminds me a lot of Dark Souls III, although with a far more aggressive combat style. \nBUT I reached one section, one absolute cunt of a boss, who, despite being optional, is kinda unfair, despite the fact that mechanically, he should be easy to defeat. \n\nThe **Blood-Starved Beast**. This... *fucking thing*. Let us go through a rundown of his attack patterns:\n\n**In his first phase:** He attacks fairly slowly, although when he gets into a combo, he obliterates the hell out of any unprepared player. This is **not** a problem, this is a totally fine thing for a boss, after all, a boss should be about testing the player on everything they have learned, and all the skills they gained.\n\n**In his second phase:** The second phase is reached by knocking him down to 66% health, upon reaching that, he pauses, roars, and resumes attacking. However, now he is far more aggressive, and upon hitting the player, inflicts poison damage, which is appropriate for the area he is fought in, Old Yharnam, which is kinda like a Gothic Blighttown from Dark Souls.\n\nHowever, this is where the bullshit starts to seep in. The most obvious form of bullshit is one single attack it has. I like to call this the \"**Grab of Doom**.\"\n\nThe Grab of Doom is what it sounds like, a grab attack, that is essentially a death sentence, to any player who isn't on 100% health. And even then, a death sentence to most players on 100% health.\nNow the Grab attack usually will kill most players, BUT the few who survive, are almost immediately executed by the poison it infects you with. Only a lucky or prepared player will have Antidote equipped, and be able to successfully down it, AND heal quickly in the short time before the poison kills them/ the BSB completely shreds them with it's 6 or so swing combos respectively. \n\nThe **third phase**... oh dear lord: It's essentially the second phase on Crack Cocaine, activated upon the BSB reaching 33% health. Oh, except it gains, I think at least one additional combo, which is even more aggressive than many others. Oh, and now being near him gives you the poison debuff. \n\n**Essentially, Stage 3 is rape in boss battle form.**\n\nNow, my main problem with this boss fight, is the mixing of poison and aggression. Since on paper this boss is easy, and can be cheesed if you know what you are doing. However, if you are a player who hates cheesing, or are just plain unlucky, this boss fight is a cunt.\n\nThe mixing of aggression and poison simply doesn't work well, and aggressive boss you want to fight more aggressively, whilst being defensive, but when most of stage 2 and 3 require you to stay as far away from  this boss as possible, essentially punishing you for getting too close, it's just a shitshow.\n\nThe game should either use an aggressive boss without the poison, or a more defensive boss, WITH the poison. Using both just creates what is essentially, a mess of both trying to make you NOT attack, and trying to make you attack. \n\n\n**TL;DR** I really hate this boss. ",
        "created_utc": 1520766107,
        "upvote_ratio": ""
    },
    {
        "title": "Why is this sub so unwelcoming, even hostile?",
        "author": "TornadoCreator",
        "url": "https://www.reddit.com/r/truegaming/comments/83lcdd/why_is_this_sub_so_unwelcoming_even_hostile/",
        "text": "I ask this question because I want to be able to discuss gaming without the passive aggressive bullshit. After all, gaming is supposed to be fun...\n\nRecently, ie. the last few weeks; I've made a few threads and posted in others, yet I constantly see passive aggressive posts just ripping into people and both my and other posters posts are regularly downvoted. I actually think there's at least one pathetic sad-act following me around downvoting everything I post here, because some posts are at -1 within seconds of them being posted.\n\nNow sure, sometimes I post things that are controversial or negative, but disagreeing is SPECIFICALLY in the rules as being something you should not downvote for. \n\nThis post, which I've quoted below, is currently on -4 votes. Why? It's gaming related, it's a multi-paragraph post that furthered the discussion. It's not even particularly negative. So what the hell is people's problem?\n\n -----\n\n&gt; What can I say... I like collecting and displaying my game library. I treat them the way a book enthusiast treats their books. I have a big bookcase and my games are displayed, pride of place along the wall next to my computer and opposite my TV.\n\n&gt; I have around 400 games, which I think is a sensible sized collection. I'm not quite sure what's wrong with the people with 5,000+ games most of which they've never played; or people who have complete NES collections including all the crap and shovelware. Nah, mine is a curated collection and it brings me a lot of joy. I still have my old Master System and a small library of games for it (less than 20, just the stuff I had as a kid and a couple of gems I learned about later as an adult).\n\n&gt; I have (approximately):\n\n&gt; * 30 Wii U games and maybe 10 Wii games.\n&gt; * 15 Original Xbox and 25 Xbox 360 games.\n&gt; * About 15-20 each for Master System, Mega Drive, Saturn, &amp; Dreamcast.\n&gt; * Handhelds, I've 15 3DS or DS games, 10 GBA, 15 PSP, and 40 Vita games.\n&gt; * Sony is my go to, with approx 15 PSOne, 50 PS2 games, 75 PS3, and 60 PS4 games; and growing.\n&gt; * Old PC games, I've got about 15 on DVD, and 6 big box games.\n&gt; * Oh, I also own a Gamecube with the GBA player and I have 3 games for it.\n\n&gt; All together. That's; approx 500-520 games. OK, slightly more than I estimated, but still a reasonable amount. \n\n&gt; I was a Sega Kid, moved on to Xbox and PC, then on to PS3 and Wii U (as they had different libraries), and finally switched to PS4 and Vita more recently. I like that my hobby sticks around, like with my favourite films which I also collect on Blu-Ray. It feels less real if it's all digital, and it annoys me that some of my favourite PC games are games I can't physically touch as they've never had a physical release.\n\n ------\n\nClearly this forum has a problem with easily offended arseholes or just garden variety trolls who like to censor other people for no clear reason. I can't imagine why anyone would downvote that post, I could understand someone ignoring it or not necessarily finding it interesting.\n\nIf any moderators would like to weigh in, go ahead. How long until this thread gets downvoted to oblivion I wonder?\n",
        "created_utc": 1520752896,
        "upvote_ratio": ""
    },
    {
        "title": "Controversial material in games: Are there lines that shouldn't be crossed?",
        "author": "TheWinkAndTheGun",
        "url": "https://www.reddit.com/r/truegaming/comments/83klzf/controversial_material_in_games_are_there_lines/",
        "text": "The primary example I'm going to use is the case of the companion character Vette in Star Wars: The Old Republic. Vette is designed such that she's given to you as a \"slave.\" She has a shock collar on, which often comes up in conversations with her as an option \\(to shock her\\). In the context of who your character is, this makes a kind of sense; you are a sith, the embodiment of an evil, murderous, domination\\-based way of life. \n\nYou can choose to remove her shock collar and eventually romance her, or, if you want to stay true to the idea of being dark and evil, you can keep it on and shock her whenever the option comes up.\n\nStrangely, however, her companion quests eventually reached a cutoff point, where you either have to remove the collar, or you can meaninglessly refuse to remove it every time she asks, leading nowhere.\n\nI've heard \\(though never had it verified\\) that in an early version of the game, she would eventually \"break\" in the form of jumping out your ship's airlock. Back when companion deaths were possible. I don't know if this is true, but I can see why it would have brought up concerns over SWTOR's rating and PR. \n\nRegardless, the story ends up in a corner, with the dark possibilities for her character ultimately going nowhere. You're railroaded into either a dead end, or removing the shock collar.\n\nThis example stands out to me because it's one of the few cases I've seen in games where consistent base cruelty \\(shocking Vette\\), with an \\(almost\\) story arc to it is a consciously written and acted out \\(in voice acting\\) part of the game. Since then, I've never seen anything in a mainstream game that even touches on the concept of owning a \"slave\" in such a capacity.\n\nUnderstandably, this is considered taboo, but the question for me \\(which I pose to you\\) becomes: Why does the line get drawn at X and not Y? Why were the developers able to get away with writing in base cruelty, but couldn't write in even a cartoonish finale to that path in the story, where, for example, Vette's will is broken in an exaggerated manner, softened in the same way that cartoon deaths are softened. In the very same game, you have options to kill other characters numerous times \\(for the Sith Warrior, the one that gets Vette, you can kill \\- or indirectly cause the death of \\- something like 6 or 7 characters in cutscenes on the tutorial planet alone\\). And some of them die almost comically in the ways they confront you.\n\nDo you think there is material that should never be in a game? Why or why not?\n\nAdditional thought that may be worth consideration: Allowing a player to do X versus railroading them into it. In games like SWTOR and KOTOR, the darkest choices are always optional. Similarly, you have games like GTA5, which is notorious for the ability to have sex with a prostitute and then run them over; but at the same time, this is \\(to my knowledge\\) in no way encouraged or even suggested as an option. It's merely an existing path that can be taken in a flexible system. Arguably, this gives it more leeway than a game where the path is consciously scripted \\(such as SWTOR\\); or does it? \n\nWhat do you think?",
        "created_utc": 1520742741,
        "upvote_ratio": ""
    },
    {
        "title": "Nintendo Direct proved that Nintendo fans a mindless sheep who just repeatedly lose their shit over logo's.",
        "author": "TornadoCreator",
        "url": "https://www.reddit.com/r/truegaming/comments/83kcz8/nintendo_direct_proved_that_nintendo_fans_a/",
        "text": "[removed]",
        "created_utc": 1520739791,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't games' graphics settings give you numerical resolution settings?",
        "author": "legatostaccato",
        "url": "https://www.reddit.com/r/truegaming/comments/83k2oq/why_dont_games_graphics_settings_give_you/",
        "text": "[removed]",
        "created_utc": 1520736492,
        "upvote_ratio": ""
    },
    {
        "title": "Gabe Newell talking about Valve making games again.",
        "author": "TheDeadman_72",
        "url": "https://www.reddit.com/r/truegaming/comments/83k06k/gabe_newell_talking_about_valve_making_games_again/",
        "text": "I know this is not breaking news or anything, but PCGamer published an [article](https://www.pcgamer.com/gabe-newell-hooray-valves-going-to-start-shipping-games-again/)  talking about how Valve is going to make and publish games again. I don't want to talk about the quality or enjoyment of those games, but about something that Newell said.\n\n\"[...]because we thought that the strength of the PC is about its openness[...]\" He said that in response to the iPhone's 'closed, high margin ecosystem'.\nThat's great. I love this about my PC. About Windows and Steam. But he's also talking about shipping VR games. \n\nI feel like the openness of the PC and VR games are total opposites.\n\nThere are thousands of games (maybe billions at this point, but who's counting really) on steam. Everyone in my family can find a game on PC and understand and play it instantly. My mum is able to play some games on her 10-year-old laptop. She doesn't need a controller. A headset. Maybe she doesn't even need a keyboard. And I can log into the same steam account on my PC with 4 GTX TITAN XPs ® and Quadruple HeliX® Penta flops and find a game that I can enjoy. And if I can't afford the power bill anymore and have to settle for a budget graphics card, I can still enjoy the same game I played before. \n\nThat's what openness means to me. Everyone can enjoy it.\n\nThat's not what VR is. They're not making games for everyone anymore. \n\nThey want to make games for the 0.2% of PC users. They want their games (Artifact) to be on iPhones and Android.\n\nThat's what makes the most money. But is this what we need?\n\nValve used to innovate and use existing hardware to make their games stand out. I really want to see VR evolve and have a bigger audience, but that's exactly what they're not doing. \n\nWhat I'm getting from them now is, 'Buy our 800$ VR headset' (and also get a bigger flat) to play our new game.\n\n\nI don't want them to sell me a piece of overpriced goggles just to play HL3, just because they need to sell overpriced goggles. I want them to sell me HL3. (I'd rather have Portal3 tbh)\n\nThank you for reading this 400 word brainjuice that I did.\nI guess ¯\\\\\\_(ツ)_/¯\n\nEdit: Formatting.\n",
        "created_utc": 1520735753,
        "upvote_ratio": ""
    },
    {
        "title": "How do I deal with hostile multiplayer environments?",
        "author": "HellraiserMachina",
        "url": "https://www.reddit.com/r/truegaming/comments/83j9og/how_do_i_deal_with_hostile_multiplayer/",
        "text": "[removed]",
        "created_utc": 1520728012,
        "upvote_ratio": ""
    },
    {
        "title": "What's the point of an open world game if there are disincentives to exploration?",
        "author": "Melikepie004",
        "url": "https://www.reddit.com/r/truegaming/comments/83j1gn/whats_the_point_of_an_open_world_game_if_there/",
        "text": "I'm finally getting to the Witcher 3 and for a \"Masterpiece\", I am have some real issues with the way this game is structured. Just so it's out of the way, the presentation of the world, the voice acting, character design, sound design, animation, and overall feel of the world are fantastic. The side quest, for the most part, are very engaging. Controlling Geralt is a little clunky and the horse hard stopping at the sight of water is annoying but those aren't major issues. My main gripes with the game comes in the form of the \"open world.\" \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;The way the leveled areas are laid is not clear or intuitive. Vanilla WoW handled leveled areas better then this game. It's pretty annoying to run into groups of level 6's with a few level 14's sprinkled in with skulls next to their heads. I don't mind the \"Guarded Treasure\" bosses as much but I still feel it impedes my momentum running into multiple level 25's I know I won't even be able to touch for another 10 hours. Another way the levels in this game are off are in the way you collect quest. Literally one of the first quest I received in Velen was suggested level 23. I was level 5. That quest is still sitting in my log and I can't do shit with it along multiple other level 20+ quest I've collected since then. This issue also applies to loot and diagrams collected.\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Another issue I have with this game \"open world\" is the fact you can actually miss content by exploring and the game doesn't seem to register that you didn't follow it's orders to the letter. I made the mistake of swimming under and happening upon some buckthorn in the prologue section. I finished the quest and moved on. Next thing I know, some lady's telling me how I let her sister die and I have no idea what the fuck shes talking about. I haven't run into this yet, but there are multiple post on forums about quest actually breaking if you do something too soon. If the game gives the player an option to complete a quest differently then the game suggest, the game should at least recognize the players choice and maybe not punish the player for unknowing bypassing a part in a quest.\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;It could be my mistake for playing AC: Origins before this game and seeing all the ways the improved upon this style of open world , but that doesn't change that the Witcher 3 seems to actively work against the player if they decide to do something other then what's wanted from the game. It undercuts the entire purpose of an \"open world.\"",
        "created_utc": 1520725830,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding Super Smash Bros. and Items: Could Items be incorporated in a non-random way that lets them be used in competitive play?",
        "author": "TabulaRasa108",
        "url": "https://www.reddit.com/r/truegaming/comments/83isnv/regarding_super_smash_bros_and_items_could_items/",
        "text": "Okay, so, the Items in Smash Bros. are a very iconic element of the series and are one aspect of the SSB games that help them to stand out from other fighting games. But Items are also infamous for being banned in competitive Smash Bros. It's easy to understand why - Items introduce an element of randomness that can devalue skillful play and give one of the players an unfair advantage. But what if there was a way to make Items a viable component for competitive play?\n\nIf items could be incorporated in a way that eliminates the troublesome random nature that they're had in all previous Smash Bros. games, then players could plan out strategies around Items. For example, what if each player in a 1v1 match could select 7 different items to bring with them into a match that they can spawn in at any time? Each player would be able to see what items their opponent selects at the beginning of the match. Some items that have innate elements of randomness or that are overpowered would still be banned, but a number of items could be allowed in competitive matches. \n\nDo you guys think that this could work? Would there be a better method of incorporating Items into competitive Smash Bros.?",
        "created_utc": 1520723497,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else think Mortal Kombat has an underrated lore?",
        "author": "adamTHEman95",
        "url": "https://www.reddit.com/r/truegaming/comments/83i5w1/does_anyone_else_think_mortal_kombat_has_an/",
        "text": "I'm not sure if 'underrated' is the right word, but just under discussed compared to other games. I'm guessing this is due to being a fighting game. I love video game lore, I could watch shoddy cast videos of Elders scrolls and Fallout all day. Don't even get me started on Bioshock.\n\nMortal Kombats lore is amazing with all the different realms, and the tournaments. It's like the original tournament of survival(Dragon Ball Super). I wish there was more separate media, like a new movie or Netflix series. \n\nI do recognize that their are some inconsistencies and maybe a lack of depth, but the world building is there. I just think it's hard for fighting games to tell a compelling story that's why I wish there were more tie in media.",
        "created_utc": 1520717500,
        "upvote_ratio": ""
    },
    {
        "title": "What are some fun online party games like Cards Against Humanity, Town of Salem, Draw My Thing, Pokemon Showdown, Mindnight ETC?",
        "author": "sonicbrandyn",
        "url": "https://www.reddit.com/r/truegaming/comments/83hks4/what_are_some_fun_online_party_games_like_cards/",
        "text": "[removed]",
        "created_utc": 1520712123,
        "upvote_ratio": ""
    },
    {
        "title": "Company Retrospectives: Valve",
        "author": "Stop-Hanging-Djs",
        "url": "https://www.reddit.com/r/truegaming/comments/83gz2f/company_retrospectives_valve/",
        "text": "Valve's influence on gaming and pc gaming in particular is undeniably monumental. I know when I bring up them Steam comes to mind and while it's hard to talk about Valve without Steam I'd rather focus on them as a game developer. Or specifically as I put it in my last company retrospective thread, what the fuck happened Valve as game developers?\n\nTheir pedigree  contains landmark titles such as TF2, Half Life 1/2, Portal and Counter Strike but these days aside from small updates to Counter Strike and TF2 they're mostly dry when it comes to new releases. Is it because they're resting on their laurels with previous successes and their new income from Steam? Are they even really still interested in developing games or are they turning more into Konami oon that front? If had a choice to decide what direction to take Valve in the future, what would you do?",
        "created_utc": 1520706696,
        "upvote_ratio": ""
    },
    {
        "title": "Injustice 1: Gods Among Us",
        "author": "aggie_hero7",
        "url": "https://www.reddit.com/r/truegaming/comments/83gbuh/injustice_1_gods_among_us/",
        "text": "I picked up this game for PC last weekend for $5 . Now I had to buy an Xbox One Wireless PC receiver $30 to play it - but I beat story mode last night and really enjoyed the dialogue and plot. Good game. Had some laughs through it - I did find normal a little too easy and set it to hard about half way through.",
        "created_utc": 1520701019,
        "upvote_ratio": ""
    },
    {
        "title": "Why are video game scripts so hard to come by?",
        "author": "GorillaGravy",
        "url": "https://www.reddit.com/r/truegaming/comments/83fpqa/why_are_video_game_scripts_so_hard_to_come_by/",
        "text": "And by scripts I mean like dialogue/story scripts, not coding scripts.\n\nI read that GTA V's script was over 3000 pages long. There's an image out there of GTA III's script, which just looks like a some loose pages stuck together next to GTA IV's script which looks like a 1000+ page long tome.\n\nI've always been interested in video game writing. But actual copies of scripts are nigh impossible to find. Which is weird because movie scripts are so readily available online. Right now I could probably find the scripts to movies still in theaters quite easily.\n\nSo why do game companies keep their scripts under lock and key? As a fledgling writer I'd love to read some to understand the format. There's so much I don't know when it comes to form and how to include various player choices into the narrative.",
        "created_utc": 1520695001,
        "upvote_ratio": ""
    },
    {
        "title": "I just finished Ratchet and Clank PS4",
        "author": "RyanChesnut",
        "url": "https://www.reddit.com/r/truegaming/comments/83erwk/i_just_finished_ratchet_and_clank_ps4/",
        "text": "I was planning to purchase this game but thankfully Sony made it a free game for PS+ users and I absolutely loved it!\n\nI saw it get a bit of hate because it wasn't as good as the originals but this is actually my first proper experience in the Ratchet and Clank franchise, I was always a Spyro kid and never got round to playing it so I guess those complaints were something I've got no say in. The game is so smooth and the gameplay just feels fantastic, the guns are really cool, the graphics look really good too and I loved the character of Ratchet especially.\n\nIf you haven't played this game yet then definitely pick it up, you've got no excuse as it's free over here in the EU, not sure about the rest of the world though. I just wanted to share my thoughts because I just finished it and I cannot wait for my next play through, one of my favourite PS4 exclusives alongside Horizon.\n\nNow it's time to play Bioshock: Infinite for the first time!",
        "created_utc": 1520683409,
        "upvote_ratio": ""
    }
]