[
    {
        "title": "Atheism holds no position on Deism. A General discussion On What Atheism represents.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2vhbwo/atheism_holds_no_position_on_deism_a_general/",
        "text": "",
        "created_utc": 1423615504,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a universal expectation of good? How does the Problem of Evil affect non-believers?",
        "author": "atheocrat",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2vg486/is_there_a_universal_expectation_of_good_how_does/",
        "text": "I am interested in exploring the [Problem of Evil](http://en.wikipedia.org/wiki/Problem_of_evil) from the perspective of an atheist. The ethical question usually arises when discussing how a just god can allow evil things to happen in the world (we've all heard of [Epicurus' trilemma](http://en.wikipedia.org/wiki/Trilemma#Epicurus.27_trilemma)), and that obviously isn't a concern for those without a deity. But do we have some expectation that the universe is a good place (in any sense) and that evil is a phenomenon which needs to be explained?\n\n\nMy sense is that the struggle would be between a social agreement to create a peaceful environment, and that those who trespass on that agreement are \"doing evil\". I'm curious to hear your thoughts on the theodicy question, however.\n\n\nEdit: ~~What's with the downvotes? This seems like the kind of discussion that belongs here...~~",
        "created_utc": 1423595897,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why should I believe science if it keeps changing?\"",
        "author": "Brockbfball1563",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2vdz5o/why_should_i_believe_science_if_it_keeps_changing/",
        "text": "My Christian mother asked this question to me tonight and I had a bunch of things that I wanted to say, but couldn't really think of a way to say what I wanted respectfully. I was trying to think of a way to answer without even bringing religion into it if I could, but couldn't really think of what to say at that moment.\n\nBasically, and obviously, scientific discoveries and conclusions change over time. The original point that was brought up was that, when my parents were growing up, there were nine planets, but now there are only eight. Essentially, they think that since \"science changed its mind\" in this case, why should they believe anything that \"science\" says if it can just change its mind again about everything else?\n\nI tried finding a good response online, but couldn't really find what I was looking for. Again, I want to be respectful despite the fact that I think this is kind of a stupid reason to reject all scientific findings ever, but they actually have me kind of stumped on this one. I have a lot of scattered thoughts about this, but can't really seem to get everything straightened out. \n\nAll opinions are welcome. You can also feel free to provide some links to places online if it helps.",
        "created_utc": 1423545464,
        "upvote_ratio": ""
    },
    {
        "title": "Gripes that I have with common atheistic tendencies",
        "author": "She-wants-the-PhD",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2vdqse/gripes_that_i_have_with_common_atheistic/",
        "text": "Okay, so I am a recent deconvert from deism, but I have some issues with mainstream atheistic thought. \n\n1. Most atheists that I have encountered believe that the scientific method is the only way to determine truths about how the world works. Well, is the statement 1+1=2 falsifiable? If not, then it is *not* a scientific statement. Then what is it? How do we know if it is really true if we can't test it empirically? It is an idea that exists only in our minds and nothing more. The scientific method has no say on the matter, but virtually everyone accepts that such a statement is true. Why? Science certainly cannot have a say in the matter. On what basis can we justify these mathematical statements if they are unfalsifiable and have no empirical evidence? Surely such knowledge must come from things other than scientific inquiry. Indeed, this knowledge comes from the use of deductive logic and ideas. \n\n2. Most atheists that I have encountered tacitly agree with a deterministic view of causality. I believe that this is mainly a by-product of the inappropriately over-reaching tendency of modern scientific inquiry. Science can only address causal relationships between events. Thus, it ascribes a causal nature to observed events. If such a doctrine is applied to all of what exists, then one would have to say that the principle of causality is universal. This includes one's mind. Interestingly, if one's actions are entirely determined from previous and current states, then by definition, one has no control over one's actions. Therefore, any purpose or meaning that an agent has is ultimately given to them by causal laws under this scheme of thought. It is entirely impossible for such a person to make up their own meaning or purpose to life in this case. It boggles my mind that other atheists can hold deterministic views and still believe that they are somehow able to give their life and actions meaning or purpose independent of everything else. This is cognitive dissonance at its finest. Ironically, strict causal determinism renders causality to be god-like and all controlling. One could even go so far as to call causality itself god. I find it amusing that someone who calls themselves an atheist could think such a thing. Of course, the free will debate is a highly contentious issue in contemporary philosophy and it is far from being resolved. Personally, I am skeptical of the claim that a definite answer to the question of the existence of free will or determinism will ever be reached.\n\n3. If the mind has a purely physical basis, then why do we talk about ideas and the mind as being separate from the body? You can't perceive an idea or a thought. It doesn't exist as an object that you can see, feel, or objectively look at. You have to think it. You have to experience it. Neuroscience can look at states of the brain and see how they correlate to certain subjective thoughts, but it cannot determine what state the mind is actually in. It can't tell what I am thinking of in an objective way. To do this, it would be necessary for neuroscience to find a way to tell what it would be like to be another person and to look at another person's thoughts in an objective way. The mind would have to become an object that can be seen, either through instrumentation or otherwise. I am skeptical that science can ever do this. As a result of these statements, I conclude that the mind exists apart from, yet is influenced by, the physical world.\n\n4. ~~Related to point #3. I argue that the mind is infinite. I can imagine an infinite number of possible mental states. For example, I can think of an infinite set of numbers and I could think of any single particular one. How can the mind have a physical basis (which is finite), if it's possible states are infinite?~~\n\n5. Heavily related to points #1 and #2. Solution to the Is-ought problem and G. E. Moore's open question argument. I have yet to hear convincing solutions to these problems other than the claim that moral knowledge can be innate and intrinsic to the human mind and separate from scientific knowledge and the natural world. Of course, such a claim is not generally accepted by the majority of atheists because they subscribe to a naturalistic worldview and would not even consider it. Scientific morality just doesn't cut it for me. Of course, another solution is the position of moral skepticism, but no one seems to discuss this point of view very much, as it is often frowned upon in moral discussion.\n\nThese points being said, I am in no way arguing for theism. I will stay an agnostic atheist. Although I think that deities are possible, I am not convinced of such things. I principally argue for the dualistic nature between ideas/logic and material objects. Of course, there may be other atheists who have thoughts similar to my own, but I'm guessing that I am in the minority. I don't see anything wrong with being an atheist, dualist, and believing in the possibility of free will existing all at the same time.\n\nEdit: Point #4 is silly. Disregard it.",
        "created_utc": 1423540823,
        "upvote_ratio": ""
    },
    {
        "title": "I'm atheist, and got married today. I've never felt so uncomfortable in my life!",
        "author": "wrestlechick",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2vcm4n/im_atheist_and_got_married_today_ive_never_felt/",
        "text": "I got married today via court house, It was Just me, my now husband and our son there. We are both atheist, but the guy still read from the bible, and did prayer. During prayer my husband looked down and still said 'amen\" not to be rude. All I did was glance around the room, trying not to laugh, for some odd reason, I had the urge too. I repeated the words the guy doing the honors asked me to repeat... I don't think I understood maybe half of what he was even saying, I asked him to repeat something once, so avoid being rude and asking what he said over and over again, I just guessed. \n\nAs atheist, I really didn't want to do all that to be honest. I felt very uncomfortable and awkward, my now husband gritted his teeth  and dealt with it. I love my husband and I am glad we finally sealed the deal after 6 years of being together. We really didn't want a wedding for many reasons, so we went to the court house instead. \n\nno advice needed just wanted to share. \n\nbut what is the most uncomfortable situation you have ever been in dealing with religion?\n\n",
        "created_utc": 1423521055,
        "upvote_ratio": ""
    },
    {
        "title": "There is *NO* place in Mormonism for liberal belief. John Dehlin, \"Mormon Stories Podcast\" host, probably going to get excommunicated.",
        "author": "AnotherClosetAtheist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2vbssl/there_is_no_place_in_mormonism_for_liberal_belief/",
        "text": "",
        "created_utc": 1423508338,
        "upvote_ratio": ""
    },
    {
        "title": "I think I am going back to being religious.",
        "author": "wibblywob",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2vbsrw/i_think_i_am_going_back_to_being_religious/",
        "text": "I'm a young man who was raised in a Catholic family and went through the whole religious upbringing, when I left for university I stopped practicing religion. I recently have been getting back into spirituality and meditation and found myself becoming religious once again. I have a very scientific education, was studying math at one of the best universities in the world, and enjoy reading about psychology and philosophy in my free time. Feel free to challenge my views and ask me any questions.",
        "created_utc": 1423508331,
        "upvote_ratio": ""
    },
    {
        "title": "[XPOST] CMV: Accommodations offered on the basis of Religion discriminate against atheists.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2vbl8v/xpost_cmv_accommodations_offered_on_the_basis_of/",
        "text": "",
        "created_utc": 1423505020,
        "upvote_ratio": ""
    },
    {
        "title": "Ask me any question and I will respond as my former Christian fundamentalist self.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2vadg1/ask_me_any_question_and_i_will_respond_as_my/",
        "text": "This is the third time I've done this and it seems to get plenty of attention each time. I'm a former fundamentalist Christian turned atheist. My father is a doctor of Christian teaching and an ordained minister. I have been coached to have all the answers. I should also mention that I'm drinking. That will probably become more apparent as the night progresses. Anything I don't answer tonight, I'll answer tomorrow. As away.",
        "created_utc": 1423477399,
        "upvote_ratio": ""
    },
    {
        "title": "I think atheists have been arguing against the \"fine tuning\" argument in the wrong way. Here is my own response.",
        "author": "JSmurfington",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2v8ikm/i_think_atheists_have_been_arguing_against_the/",
        "text": "I have watched many debates where atheists are asked what the most powerful argument for theism is.  I believe that the fine tuning argument, the argument that the universe is so perfectly tuned that a higher power must be involved, is the correct answer to this question.\n\nNow, please hear me out.  I think that this argument is complete bunk.  But in terms of fallacious arguments, I think this one reigns supreme in terms of how it can seemingly remain reasonable despite sound rebuttals, especially to an uncritical audience of theists.\n\nIt really frustrates me when I see atheists respond to this argument.  They usually buy into the theists premise and then start talking about probability, or about how if one physical constant were changed maybe we would just have a different type of universe, to which the theist responds how in that type of universe, every atom would be spaced out too much to even form heavier elements than hydrogen, and so on.\n\nI think this line of response totally misses the point.  I don’t think atheists should accept the original premise of fine tuning.  It is a nonsensical hypothetical, akin to asking, “what if instead of 2+2=4, all math remains the same and now 2+2=5”.\n\nWhat on earth does it mean to “change one physical constant of the universe”?  On a scientific, physics based level, what does that even mean?  Can such a universe exist?  Could there be a universe where everything is the same, but Planck’s constant is 1% smaller?  Could any other physical constant, such as the charge of a proton, be different while everything else remains the same?  I don’t think we can answer that question, but I feel like such a universe would not be consistent with what we know about science.  We are bound by this universe, and cannot logically begin to propose understanding of a universe governed by an entirely different set of fundamental physical laws.  What would a universe look like with a different Planck’s constant?  The only answer is that we cannot and do not know.\n\nTake two simultaneous equations that both depend on X and Y.  The fine tuning argument is basically saying, “now, imagine if X changed but Y stayed the same”.  That statement literally makes no sense.  X cannot change without Y changing in this system.  So when the theist states their knowledge of the hypothetical “untuned” universe where the universe has expanded into oblivion, it makes no sense.  They try to change the nature of the universe and then argue why \"life\" as we define it in our universe could not then exist.  It makes no sense.\n\nAt the very least, we should be able to respond that the entire premise is a nonsensical, nonstarter.  It really frustrates me when theists try to get away with this argument, and their atheist opponents let them do it.\n\nI would be very interested to hear everyone's thoughts on the matter.",
        "created_utc": 1423435016,
        "upvote_ratio": ""
    },
    {
        "title": "The sad unraveling of Richard Dawkins; The once-lauded scientist and atheist has become a cautionary tale for aging intellectuals navigating social media.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2v8a1b/the_sad_unraveling_of_richard_dawkins_the/",
        "text": "",
        "created_utc": 1423430877,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist Groups for More Mature Atheists?",
        "author": "BallsJefferson",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2v4eb2/atheist_groups_for_more_mature_atheists/",
        "text": "Does anyone know of any good groups, organizations or \"clubs\" of any sort that are for more mature atheists? I've been to a few, but they just seem like whiny circlejerks from people who just sit around and complain about Christianity and think that insulting people and bitching about oppression that we don't really face is really the core of living without religious dogma. Not that /r/Atheism isn't funny to watch sometimes, but I'd really like to be a part of a group that takes personal development and a quest for knowledge seriously. I live in South Florida, but if there are groups out of my area I would still love to hear more about them.                                         ",
        "created_utc": 1423340235,
        "upvote_ratio": ""
    },
    {
        "title": "In response to the Pastor looking for honest questions for atheist, here are Bible versus I find problematic and a list of 125 questions.",
        "author": "XSLAPPINBABIESX",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2v36v9/in_response_to_the_pastor_looking_for_honest/",
        "text": "Questions *FROM* atheists\n\nThanks everyone for your kind words\n\n**God Condones Slavery**\n\n\n   However, you may purchase male or female slaves from among the foreigners who live among you.  You may also purchase the children of such resident foreigners, including those who have been born in your land.  You may treat them as your property, passing them on to your children as a permanent inheritance.  You may treat your slaves like this, but the people of Israel, your relatives, must never be treated this way.   (Leviticus 25:44-47 NLT)\n\n   These are the regulations you must present to Israel.  If you buy a Hebrew slave, he may serve for no more than six years.  Set him free in the seventh year, and he will owe you nothing for his freedom.  If he was single when he became your slave, he shall leave single.  But if he was married before he became a slave, then his wife must be freed with him.  If his master gave him a wife while he was a slave and they had sons or daughters, then only the man will be free in the seventh year, but his wife and children will still belong to his master.  But the slave must declare, 'I love my master, my wife, and my children.  I don't want to go free.' If he does this, his master must present him before God.  Then his master must take him to the door or doorpost and publicly pierc his ear with an awl.  After that, the slave will serve the master for life.  *When a man sells his daughter as a slave,* she will not be freed at the end of six years as the men are.  If she does not please the man who bought her, he may allow her to be bought back again.  But he is not allowed to sell her to foreigners, since he is the one who broke the contract with her.  And if the slave girl's owner arranges for her to marry his son, he may no longer treat her as a slave girl, but he must treat her as his daughter.  If he himself marries her and then takes another wife, he may not reduce her food or clothing or fail to sleep with her as his wife.  If he fails in any of these three ways, she may leave as a free woman without making any payment.  (Exodus 21:1-11 NLT)\n\n   When a man strikes his male or female slave with a rod so hard that the slave dies under his hand, he shall be punished.  If,' however, the salve survives for a day or two, he is not to be punished, since the slave is his own property.   (Exodus 21:20-21 NAB)\n\n   Slaves, obey your earthly masters with deep respect and fear.  Seve them sincerely as you would serve Christ.  (Ephesians 6:5 NLT)\n\nChristians who are slaves should give their masters full respect so that the name of God and his teaching will not be shamed.  If your master is a Christian, that is no excuse for being disrespectful.  You should work all the harder because you are helping another believer by your efforts.  Teach these truths, Timothy, and encourage everyone everyone to obey them.    (1 Timothy 6:1-2 NLT)\n\nSlaves, in reverent fear of God submit yourselves to your masters, not only to those who are good and considerate, but also to those who are harsh.  For it is commendable if someone bears up under the pain of unjust suffering because they are conscious of God.  But how is it to your credit if you receive a beating for doing wrong and endure it?  But if you suffer for doing good and you endure it, this is commendable before God.   (1 Peter 2:18-20)\n\n\n**God Condones Rape and Sex Slavery**\n\n\nAs you approach a town to attack it, first offer its people terms for peace.  If they accept your terms and open the gates to you, then all the people inside will serve you in forced labor.  But if they refuse to make peace and prepare to fight, you must attack the town.  When the LORD your God hands it over to you, kill every man in the town.  But you may keep for yourselves all the women, children, livestock, and other plunder.  You may enjoy the spoils of your enemies that the LORD your God has given you. (Deuteronomy 20:10-14)\n\nIf a man is caught in the act of raping a young woman who is not engaged, he must pay fifty pieces of silver to her father.  Then he must marry the young woman because he violated her, and he will never be allowed to divorce her.  (Deuteronomy 22:28-29 NLT)\n\nWhen you go out to war against your enemies and the LORD, your God, delivers them into your hand, so that you take captives, if you see a comely woman among the captives and become so enamored of her that you wish to have her as wife, you may take her home to your house.  But before she may live there, she must shave her head and pare her nails and lay aside her captive's garb.  After she has mourned her father and mother for a full month, you may have relations with her, and you shall be her husband and she shall be your wife.  However, if later on you lose your liking for her, you shall give her her freedom, if she wishes it; but you shall not sell her or enslave her, since she was married to you under compulsion.  (Deuteronomy 21:10-14 NAB)\n\nThey must be dividing the spoils they took: there must be a damsel or two for each man, Spoils of dyed cloth as Sisera's spoil, an ornate shawl or two for me in the spoil.   (Judges 5:30 NAB)\n\nLo, a day shall come for the Lord when the spoils shall be divided in your midst.  And I will gather all the nations against Jerusalem for battle: the city shall be taken, houses plundered, women ravished; half of the city shall go into exile, but the rest of the people shall not be removed from the city.\n(Zechariah 14:1-2 NAB)\n\nWhen a man sells his daughter as a slave, she will not be freed at the end of six years as the men are.  If she does not please the man who bought her, he may allow her to be bought back again.  But he is not allowed to sell her to foreigners, since he is the one who broke the contract with her.  And if the slave girl's owner arranges for her to marry his son, he may no longer treat her as a slave girl, but he must treat her as his daughter.  If he himself marries her and then takes another wife, he may not reduce her food or clothing or fail to sleep with her as his wife.  If he fails in any of these three ways, she may leave as a free woman without making any payment.   (Exodus 21:7-11 NLT)\n\nSo kill all the boys and all the women who have had intercourse with a man.  Only the young girls who are virgins may live; you may keep them for yourselves.    (Numbers 31:17-18)\n\n\n**Human Sacrifice**\n\n\nTake your son, your only son – yes, Isaac, whom you love so much – and go to the land of Moriah.  Sacrifice him there as a burnt offering on one of the mountains, which I will point out to you.\n(Genesis 22:1-18)\n\nthe Lord said \"Consecrate to me every first-born that opens the womb among Israelites, both man and beast, for it belongs to me.  (Exodus 13:2)\n\nAt the LORD's command, a man of God from Judah went to Bethel, and he arrived there just as Jeroboam was approaching the altar to offer a sacrifice.  Then at the LORD's command, he shouted, \"O altar, altar!  This is what the LORD says: A child named Josiah will be born into the dynasty of David.  On you he will sacrifice the priests from the pagan shrines who come here to burn incense, and human bones will be burned on you.\"  (1 Kings 13:1-2 NLT)\n\n\"At that time the Spirit of the LORD came upon Jephthah, and he went throughout the land of Gilead and Manasseh, including Mizpah in Gilead, and led an army against the Ammonites.  And Jephthah made a vow to the LORD. He said, \"If you give me victory over the Ammonites, I will give to the LORD the first thing coming out of my house to greet me when I return in triumph.  I will sacrifice it as a burnt offering.\"   So Jephthah led his army against the Ammonites, and the LORD gave him victory.  He thoroughly defeated the Ammonites from Aroer to an area near Minnith – twenty towns – and as far away as Abel-keramim. Thus Israel subdued the Ammonites.  When Jephthah returned home to Mizpah, his daughter – his only child – ran out to meet him, playing on a tambourine and dancing for joy.  When he saw her, he tore his clothes in anguish.  \"My daughter!\" he cried out.  \"My heart is breaking!  What a tragedy that you came out to greet me. For I have made a vow to the LORD and cannot take it back.\"  And she said, \"Father, you have made a promise to the LORD.  You must do to me what you have promised, for the LORD has given you a great victory over your enemies, the Ammonites.  But first let me go up and roam in the hills and weep with my friends for two months, because I will die a virgin.\"  \"You may go,\" Jephthah said. And he let her go away for two months.  She and her friends went into the hills and wept because she would never have children.  When she returned home, her father kept his vow, and she died a virgin.  So it has become a custom in Israel for young Israelite women to go away for four days each year to lament the fate of Jephthah's daughter.\"   (Judges 11:29-40 NLT)\n\n\n\n**God Enforces Capital Punishment For Many Crimes, Some Victimless**\n\n\n1.\tKill People Who Don't Listen to Priests.   (Deuteronomy 17:12)\n2.\tKill Witches.  (Exodus 22:17)\n3.\tKill Homosexuals.  (Leviticus 20:13)\n4.\tKill Fortunetellers.   (Leviticus 20:27)\n5.\tDeath for Hitting Dad.   (Exodus 21:15)\n6.\tDeath for Cursing Parents.  (Proverbs 20:20)  (Leviticus 20:9)\n7.\tDeath for Adultery.   (Leviticus 20:10)\n8.\tDeath for Fornication.  (Leviticus 21:9)\n9.\tDeath to Followers of Other Religions.   (Exodus 22:20)\n10.\tKill Nonbelievers.  (2 Chronicles 15:12-13)\n11.\tKill False Prophets.  (Zechariah 13:3)\n12.\tKill the Entire Town if One Person Worships Another God.  (Deuteronomy 13:13-19)\n13.\tKill Women Who Are Not Virgins On Their Wedding Night.  (Deuteronomy  22:20-21)\n14.\tKill Followers of Other Religions. (Deuteronomy 13:7-12) (Deuteronomy 17:2-5)\n15.\tDeath for Blasphemy. (Leviticus 24:10-16)\n16.\tKill False Prophets.  (Deuteronomy 13:1-5) (Deuteronomy 18:20-22)\n17.\tInfidels and Gays (me and Connor) are worthy of death (Romans 1:24-32)\n18.\tKill Anyone who Approaches the Tabernacle.  (Numbers 1:48-51)\n19.\tKill People for Working on the Sabbath.  (Exodus 31:12-15)\n20.\tStone stubborn and rebellious children   (Deuteronomy 21:18-21)\n\n\n\n**God Kills for Stupid Reasons**\n\n\nFrom there Elisha went up to Bethel.  While he was on his way, some small boys came out of the city and jeered at him.  \"Go up baldhead,\" they shouted, \"go up baldhead!\"  The prophet turned and saw them, and he cursed them in the name of the Lord.  Then two shebears came out of the woods and tore forty two of the children to pieces.  (2 Kings 2:23-24 NAB)\n\nAnd he smote of the men of Beth-shemesh, because they had looked into the ark of Jehovah, he smote of the people seventy men, `and' fifty thousand men; and the people mourned, because Jehovah had smitten the people with a great slaughter.  And the men of Beth-shemesh said, Who is able to stand before Jehovah, this holy God? and to whom shall he go up from us?   (1 Samuel 6:19-20 ASV)\n\nMeanwhile, the LORD instructed one of the group of prophets to say to another man, \"Strike me!\"  But the man refused to strike the prophet.  Then the prophet told him, \"Because you have not obeyed the voice of the LORD, a lion will kill you as soon as you leave me.\"  And sure enough, when he had gone, a lion attacked and killed him.  (1 Kings 20:35-36 NLT)\n\nThe ark of God was placed on a new cart and taken away from the house of Abinadab on the hill.  Uzzah and Ahio, sons of Abinadab guided the cart, with Ahio walking before it, while David and all the Israelites made merry before the Lord with all their strength, with singing and with citharas, harps, tambourines, sistrums, and cymbals.  When they came to the threshing floor of Nodan, Uzzah reached out his hand to the ark of God to steady it, for the oxen were making it tip.  But the Lord was angry with Uzzah; God struck him on that spot, and he died there before God.  (2 Samuel 6:3-7 NAB)\n\nNow Nadab and Abihu, the sons of Aaron, took their respective firepans, and after putting fire in them, placed incense on it and offered strange fire before the LORD, which He had not commanded them.  And fire came out from the presence of the LORD and consumed them, and they died before the LORD.  (Leviticus 10:1)\n\nThen Judah said to Onan, \"Go in to your brother's wife, and perform your duty as a brother-in-law to her, and raise up offspring for your brother.\"  Onan knew that the offspring would not be his; so when he went in to his brother's wife, he wasted his seed on the ground in order not to give offspring to his brother.  But what he did was displeasing in the sight of the LORD; so He took his life also \n(Genesis 38:8-10)\n\n[After God had hardened Pharoah’s heart, interfering with his free will to let the Hebrews gos]\nAnd that night at midnight, the Lord struck down all the firstborn sons in the land of Egypt, from the firstborn son of Pharaoh, who sat on his throne, to the firstborn son of the prisoner in the dungeon…\n(Exodus 12:29)\n\nWhen Abigail arrived home, she found that Nabal was throwing a big party and was celebrating like a king. He was very drunk, so she didn’t tell him anything about her meeting with David until dawn the next day.  In the morning when Nabal was sober, his wife told him what had happened. As a result he had a stroke, and he lay paralyzed on his bed like a stone. About ten days later, the Lord struck him, and he died.  (1 Samuel 25:36-38)\n\n\n**God Kills Children**\n\nMake ready to slaughter his sons for the guilt of their fathers; Lest they rise and posses the earth, and fill the breadth of the world with tyrants.   (Isaiah 14:21)\n\nThis I heard the Lord say to the other men, \"Follow him through the city and kill everyone whoe forehead is not marked.  Show no mercy; have no pity! Kill them all - old and young, girls and women and little children.  But do not touch anyone with the mark.  Begin your task right here at the Temple.\"  So they began by killing the seventy leaders.  \"Defile the Temple!\" the Lord commanded. \"Fill its courtyards with the bodies of those you kill! Go!\" So they went throughout the city and did as they were told.   (Ezekial 9:5-7)\n\nAnd at midnight the Lord killed all the firstborn sons in the land of Egypt, from the firstborn son of Pharaoh, who sat on the throne, to the firstborn son of the captive in the dungeon.  Even the firstborn of their livestock were killed.  Pharaoh and his officals and all the people of Egypt woke up during the night, and loud wailing was hear throughout the land of Egypt.  There was not a single house where someone had not died.  (Exodus 12:29-30)\n\nIf even then you remain hostile toward me and refure to obey, I will inflict you with seven more disasters for your sins.  I will release wild animals that will kill your children and destroy your cattle, so your numbers will dwindle and your roads will be deserted.   (Leviticus 26:21-22)\n\nAnyone who is captured will be run through with a sword.  Their little children will be dashed to death right before their eyes.  Their homes will be sacked and their wives raped by the attacking hordes.  For I will stir up the Medes against Babylon, and no amount of silver or gold will buy them off.  The attacking armies will shoot down the young people with arrows.  They will have no mercy on helpless babies and will show no compassion for the children.    (Isaiah 13:15-18)\n\nCursed be he who does the Lord's work remissly, cursed he who holds back his sword from blood (Jeremiah 48:10)\n\n\n\n**Misogyny in the Bible**\n\n\nA woman must quietly receive instruction with entire submissiveness.  But I do not allow a woman to teach or exercise authority over a man, but to remain quiet.   (1 Timothy 2:11-12)\n\nHusbands, in the same way be considerate as you live with your wives, and treat them with respect as the weaker partner and as heirs with you of the gracious gift of life, so that nothing will hinder your prayers.  (1 Peter 3:7)\n\nThe women are to keep silent in the churches; for they are not permitted to speak, but are to subject themselves, just as the Law also says.  (1 Corinthians 14:34)\n\nWives, be subject to your husbands, as is fitting in the Lord.  (Colossians 3:18)\n\nAlso the daughter of any priest, if she profanes herself by harlotry, she profanes her father; she shall be burned with fire.  (Leviticus 21:9)\n\nBut if this charge is true, that the girl was not found a virgin, then they shall bring out the girl to the doorway of her father’s house, and the men of her city shall stone her to death because she has committed an act of folly in Israel, by playing the harlot in her father’s house; thus you shall purge the evil from among you.   (Deut. 22:20-21).\n\nAnd likewise also the men, leaving the natural use of the woman, burned in their lust one toward another; men with men working that which is unseemly, and receiving in themselves that recompence of their error which was meet.   (Romans 1:27)\n\nFor among them are those who enter into households and captivate weak women weighed down with sins, led on by various impulses, always learning and never able to come to the knowledge of the truth.  (2 Timothy 3:7)\n\nSo that they may encourage the young women to love their husbands, to love their children, to be sensible, pure, workers at home, kind, being subject to their own husbands, so that the word of God will not be dishonored   (Titus 2:4-5)\n\nFor a person between the ages of five and twenty, set the value of a male at twenty shekels and of a female at ten shekels.    (Leviticus 27:5)\n\nWhenever a woman has her menstrual period, she will be ceremonially unclean for seven days.  Anyone who touches her during that time will be unclean until evening.  Anything on which the woman lies or sits during the time of her period will be unclean.    (Leviticus 15:19-20) \n\nThen Judah said to Onan, \"Go in to your brother's wife, and perform your duty as a brother-in-law to her, and raise up offspring for your brother.\"  Onan knew that the offspring would not be his; so when he went in to his brother's wife, he wasted his seed on the ground in order not to give offspring to his brother.  But what he did was displeasing in the sight of the LORD; so He took his life also (Genesis 38:8)\n\n\n**Contradictions**\n\n\n1.\tIs Christ equal with God?\n         Yes – (John 10:30/ Phil 2:6)\n\tNo – (John 14:28/ Matt 24:36)\n\tJesus – “Why do you call me good? No one is good except God” (Mark 10:18 &amp; Luke 18:19)\n\n2.\tElijah went up to heaven.    (2 Kings 2:11)\n      None but Christ ever ascended into heaven   (John - 3:13)         \n \n3.\tThose that seek me early shall find me.   (Proverbs 8:17)      \nThen shall they call upon me but I will not answer; they shall seek me early, but shall not find me.      (Proverbs 1:28)\n\n4.\tGod is not a man, that he should lie.   (Numbers 23:19)\nAnd if the prophet be deceived when he hath spoken a thing, I theLord have deceived that prophet.    (Ezekiel 24:9)\n\n5.\tTherefore Michal, the daughter of Saul, had no child unto the day of her death.\n(II Samuel 6:23)\nThe five sons of Michal, the daughter of Saul. (II Samuel 21:8)\n\n6.\tLet your light so shine before men, that they may see your good works.   (Matthew 5:16)\nTake heed that ye do not your alms before men, to be seen of them.   (Matthew 6:1)\n\n7.\tFor by grace are ye saved through faith...not of works.   (Ephesians 2:8-9)\nYe see then how that by works a man is justified, and not by faith only.  (James 2:24)\n\n8.\tGod is not a man, that he should lie: neither the son of man, that he should repent.    (Numbers 23:19)\nAnd the Lord repented of the evil which he thought to do unto his people.   (Exodus 32:14)\n\n9.\tThe son shall not bear the iniquity of the father.    (Ezekiel 18:20)\nI the lord thy God am a jealous God, visiting the iniquity of the fathers upon the children unto the third and fourth generation.      (Exodus 20:5)\n\n10.\tHow blessed is the man who finds wisdom And the man who gains understanding\n(Proverbs 3:13)\nBecause in much wisdom there is much grief, and increasing knowledge results in increasing pain.   (Ecclesiastes 1:18)\n\n11.\tThe Lord is good to all  (Psalm 145:6)\nI make Peace and create evil.  I the Lord do all these things  (Isaiah 45:7)\nFor I, the Lord, do not change…   (Malachi 3:6)\n\n\n12.\tThe Lord is a man of war; the LORD is his name  (Exodus 15:3)\nNow the God of peace be with you all.  Amen.  (Romans 15:33)\n\n13.\tThe LORD is compassionate and gracious, Slow to anger and abounding in loving kindness.  (Psalm 103:8)\nSubmit to God's royal son, or He will become angry, and you will be destroyed in the midst of all your activities, for His anger flares up in an instant…(Psalm 2:12)\nWhen God heard, He was filled with wrath and greatly abhorred Israel  (Psalm 78:59)\n…Uzzah reached out and took hold of the ark of God, because the oxen stumbled.  The LORD's anger burned against Uzzah because of his irreverent act; therefore God struck him down, and he died there beside the ark of God.. (2 Samuel 6:6-7)\n\n14.\tWhosoever shall say Thou fool, shall be in danger of hellfire.     (Matthew 5:22)\n[Jesus said] Ye fools and blind.     (Matthew 23:17)\nAnd He [Jesus] said to them, \"O foolish men…” (Luke 24:25)\n\n15.\tfor I am merciful, saith the Lord, and I will not keep anger\n forever.   (Jeremiah 3:12)\nYe have kindled a fire in mine anger, which shall burn forever.  (Jeremiah 17:4)\n\n16.\tGod cannot be tempted with evil, neither tempteth he an man  (James 1:13)\nAnd it came to pass after these things, that God did tempt Abraham  (Genesis 22:1)\n\n17.\tAnd God saw everything that he made, and behold it was very good  (Genesis 1:31)\nThe LORD regretted that he had made human beings on the earth, and his heart was deeply troubled.  (Genesis 6:6)\n\n18.\tWith God all things are possible.   (Matthew 29:26)\nAnd the Lord was with Judah, and he drove out the inhabitants of the mountain; but could not drive out the inhabitants of the valley, because they had chariots of iron  (Judges 1:19)\n\n19.\tAnd through Him everyone who believes is freed from all things, from which you could not                   be freed through the Law of Moses.  (Acts 13:39)\nBut whoever blasphemes against the Holy Spirit never has forgiveness, but is guilty of an eternal sin  (Mark 3:29)\n\n20.\tJesus curses a fig tree for not having fruit (he should have known they weren’t in season)\nIt withers immediately, the disciples were amazed and comment on it (Matthew 21-19-20)\nThey didn’t noticed it had withered until they saw it the next morning (Mark 11:20)\n\n21.\tand He instructed them that they should take nothing for their journey, except a mere staff, no bread, no bag, no money in their belt  (Mark 6:8)\nDo not acquire gold, or silver, or copper for your money belts, or a bag for your journey, or even two coats, or sandals, or a staff...  (Matthew 10:10)\n\n\n\n**Numerical Contradictions**\n\n\n1.\tWhen did Ahaziah son of Jehoram begin his reign in Judah?\na.\tIn the eleventh year of Joram the son of Ahab began Ahaziah to reign over Judah. \n(II Kings 9:29)\nb.\tIn the twelfth year of Joram the son of Ahab king of Israel did Ahaziah the son of Jehoram king   of Judah began to reign.\"   (II Kings  8:25)\n\n2.\tHow old was Jehoiachin when he began to reign?\na.\tJehoiachin was eight years old when he began to reign.  (II Chronicles 36:9)\nb.\tJehoiachin was eighteen years old when he began to reign.  (II Kings 24:8)\n\n3.\tHow long did Jotham reign in Jerusalem?\na.\tSixteen years.   (II Kings  15:33)\nb.\tAt least twenty years.  (II Kings 15:30)\n\n4.\tHow old was Ahaziah when he began to reign?\na.\tTwenty two years old.  (II Kings  8:26)\nb.\tForty two years old.   (II Chroncles 22:2)\n\n5.\tHow much gold was brought to Solomon from Ophir?\na.\t420 talents of gold.  (I Kings 9:28)\nb.\t450 talents of gold. 2Ch 8:18\n\n6.\tHow many stalls did Solomon have for his horses?\na.\t4,000 stalls. (II Chronicles  9:25)\nb.\t40,000 stalls.  (I Kings 4:26)\n\n7.\tHow long did Gad tell David he was to suffer famine?\na.\tThree years.   (I Chronicles 21:11-12)\nb.\tSeven years.    (II Samuel 24:13)\n\n8.\tHow many horsemen did David take with him from Hadadezer?\na.\t700 horsemen.   (II Samuel 8:4)\nb.\t7,000 horsemen.  (I Chroncles 18:4)\n\n9.\tHow many valiant Israelite men drew the sword?  How many in Judah according to Joab?\na.\t800,000 Israelites and 500,000 from Judah  (II Samuel 24:9)\nb.\t1,100,000 Israelites and 472,000 from Judah (1 Chronicles 21:5)\n\n10.\tThe Temple contained how many baths?\na.\t40,000   (I Kings 4:26\nb.\t4,000    (II Chronicles 9:25)\n\n\n\n\n**Contradictions in the Gospels**\n\n\n1.\tHow many generations were there between Abraham to David?  \nfourteen generations   (Matthew 1:17)\nthirteen generations  (Matthew 1:2)\n\n2.\tWho approached Jesus about the Centurian’s sick slave?  \nThe Centurion approached Jesus, asking  for help for a sick servant.  (Matthew 8:5-7)\nThe Centurion did not approach Jesus.  He sent friends and elders of the Jews. (Luke 7:3 &amp; 7:6) \n\n3.\tWas the synagogue official’s daughter dying or already dead?\nJairus approached Jesus for help, because his daughter was dying.  (Luke 8:41-42)\nHe asked for help, saying his daughter was already dead.  (Matthew 9:18)\n\n4.\tWhen was Christ crucified?\nThe third hour (Mark 15:25)\nAfter the sixth hour  (John 19:14)\n\n5.\tHow many of the thieves crucified with Christ mocked him?\nBoth thieves mocked Christ  (Matthew 27:44 &amp; Mark 15:32)\nOnly one theif mocked Christ    (Luke 23:39-40)\n\n6.\tWhen did Satan enter Judas?\nWhile at the last super  (John 13:27)\nBefore the last supper  (Luke 22:3)\n\n7.\tHow many women came to the tomb of Jesus?  \nOnly one woman went, Mary Magdalene.  (John 20:1)\nMary Magdalene and the \"other Mary\" (Jesus’ mother) went. (Matthew 28:1)\nMary Magdalene, Mary mother of James and Salome  (Mark 16:1)\n\n8.\tHow many angels were at the tomb?\nTwo angels  (John 20:11)\nOne angel  (Mark 16:5)\n\n9.\tWhen did the temple veil tear?\nBefore Jesus died  (Luke 23:45-46)\nAfter Jesus died  (Matthew 27:50-51 &amp; Mark 15:37-38)\n\n10.\tHow did Judas die?\nHe hanged himself (Mark 27:5)\nHe fell headlong, he burst open in the middle and his intestines gushed out  (Acts 1:18)\n\n11.\tSigns?\nSighing deeply in His spirit, He said, \"Why does this generation seek for a sign? Truly I say to you, no sign will be given to this generation.\"\nA large crowd followed Him, because they saw the signs which He was performing on those who were sick.  (John 6:2)\n\n\n**Miscellaneous**\n\n\nAnd the king said to her, \"What is the matter with you?\" And she answered, \"This woman said to me, 'Give your son that we may eat him today, and we will eat my son tomorrow.' \"So we boiled my son and ate him; and I said to her on the next day, 'Give your son, that we may eat him’, but she has hidden her son    (2 Kings 6:28-29)\n\nThe siege and terrible distress of the enemy's attack will be so severe that you will eat the flesh of your own sons and daughters, whom the Lord your God has given you.  (Deuteronomy 28:53)\n\n[Lot, a righteous man, offers his daughters to a mob of rapists]\nLook, I have two virgin daughters. Let me bring them out to you, and you can do with them as you wish. But please, leave these men alone, for they are my guests and are under my protection.  (Genesis 19:8)\n\nLot went up from Zoar, and stayed in the mountains, and his two daughters with him; for he was afraid to stay in Zoar; and he stayed in a cave, he and his two daughters.  Then the firstborn said to the younger, \"Our father is old, and there is not a man on earth to come in to us after the manner of the earth. \"Come, let us make our father drink wine, and let us lie with him that we may preserve our family through our father. So they made their father drink wine that night. And the first-born went in and lay with her father, and he was not aware of it when she lay down or when she arose.  And it came to be on the next day that the first-born said to the younger, “See, I lay with my father last night. Let us make him drink wine tonight as well, and you go in and lie with him, so that we keep the seed of our father.” So they made their father drink wine that night as well. And the younger arose and lay with him, and he was not aware of it when she lay down or when she arose. Thus both the daughters of Lot became pregnant by their father. (Genesis 19:30-36)\n\nIf two men, a man and his countryman, are struggling together, and the wife of one comes near to deliver her husband from the hand of the one who is striking him, and puts out her hand and seizes his genitals, then you shall cut off her hand; you shall not show pity.  \n(Deuteronomy 25:12)\n\nIf a man's testicles are crushed or his penis is cut off, he may not be admitted to the assembly of the LORD.  (Deuteronomy 23:1)\n\n**God Deceives**\n\n-\tSo God will cause them to be greatly deceived, and they will believe these lies.  Then they will be condemned for enjoying evil rather than believing the truth  (II Thess 2:11-12)\n-\tNow therefore, behold, the LORD has put a deceiving spirit in the mouth of all these your prophets; and the LORD has proclaimed disaster against you (I Kings 22:23 &amp; 2 Chron 18:22)\n-\tO LORD, You have deceived me and I was deceived   (Jeremiah 20:7)\n-\tAnd if a prophet is deceived into giving a message, it is because I, the Lord, have deceived that prophet…  (Ezekiel 14:9)\n\nGod is not the author of confusion.\n      - I Corinthians 24:33\n\n\n**Questions**\n\n\n1.\tIf God is so perfect, then why did he create such an imperfect world and allow suffering?\n2.\tSome suffering is caused by evil people, but what about suffering caused by disasters? \n3.\t(Isaiah 45:7) Why did god create evil (KJV) or disaster/calamity? (NIV/NAS)?\n4.\tWhy are children born with terminal diseases and die a short and miserable life?\n5.\tHow do these terrible things fit in God’s “divine plan?”\n6.\tIf God’s plan is so perfect why did he have to start over?  (purge the earth with the flood)\n7.\tWhat good is free will if we are punished for using it?\n8.\tWould you rather have free will and risk hell, or not have it and be guaranteed heaven?\n9.\tIf sin is the result of free will, and there’s no sin in heaven, is there no free will in heaven?\n10.\tWhat will we do for eternity in heaven?  Praise God? Sounds boring, not paradise\n11.\tIf God created us, and it’s our nature to sin, why does he condemn us for how he made us?\n12.\tWhy not create us without desire to sin and give us free will to be good how we choose?\n13.\tWhy did God not create humans who could appreciate good without comparing it to evil?\n14.\tCan God commit an evil act?\n15.\tWhy wouldn’t God give us free will but also give us a nature that doesn’t allow us to do evil?\n16.\tIf we can commit evil, and God can’t commit evil, do we have more free will than God?\n17.\tDoes God do good by choice or because his natures forbids him from acting otherwise?\n18.\tCan God really be called “good” if he can’t chose evil?\n19.\tGod doesn’t want robots, but does God consider himself a robot because he can’t do evil?\n20.\tGod basically tells us “love me or I’ll torture you forever” how is this “unconditional love?”\n21.\tHow can someone enjoy heaven if they know a loved one is burning in hell?\n22.\tWhat is the point of hell? To teach us a lesson?\n23.\t Punishment is used to correct unwanted behavior, but if it’s eternal what can it teach us?\n24.\tWhy not sentence sinners to a time period in hell based on the degree of their crimes?\n25.\tWhy not just let their souls die and not receive reward in heaven?  Why the torture at all?\n26.\tWhy do we have to pay for our sins when we die If Jesus paid for our sins on the cross?\n27.\tWhy did Jesus have to die?  Specifically why did he have to be brutally tortured? \n28.\tIf God loves us and is all powerful why not just forgive us?  Why does he require blood?\n29.\tWhy was Jesus’ death on the cross the only way our sins could be forgiven?\n30.\tCould God not come up with another way to forgive us?\n31.\tIf Jesus only died temporarily and knew beforehand that he would spend eternity reigning with God, can his actions really be called a sacrifice?\n32.\tIs it fair to say that God “gave” us his son if He took him back into heaven to be with him?\n33.\tIf God and Jesus are the same being, did God sacrifice Himself?\n34.\tWho was Jesus sacrificed to?  To God? God sacrificed himself to himself to appease himself?\n35.\tJesus/God “saved” us, but if God created hell doesn’t that mean he saved us from himself?\n36.\tIf God is omnipotent, why does he not just show himself to everyone?\n37.\tIf he did reveal himself to us, wouldn’t we still have the free will to reject him if we wanted?\n38.\tWhy won’t Jesus prove his divinity and resurrection by appearing to us as he did to Thomas?\n39.\tWhy does Jesus say, “Bring my enemies and kill them in front of me” in Luke 19:27?\n40.\tHow do we discern God’s plan for us other than just a gut feeling?  How can we be sure?\n41.\tDoes God allow Satan to exist to weed out His weak children?\n42.\tDoes God answer the relatively trivial prayers of Americans and ignore world hunger?\n43.\tHow can we trust the Bible?  How do we know it’s divinely inspired?  Who wrote it?\n44.\tWhat would be our fate be if we never found the Dead Sea scrolls?\n45.\tHow do we know for sure that the copies of copies of copies of the originals are accurate?\n46.\tIf the scriptures were written after decades of oral tradition, is there any exaggeration?\n47.\tHow can we trust that the scriptures were translated with 100% accuracy?\n48.\tHow can we trust that the translators didn’t let their biases affect their translation?\n49.\tHow do we know which Bible version is closest to the original without the original?\n50.\tDo we have to read the scriptures in the original Ancient Hebrew?\n51.\tWhy would God have his book written in a language he knew would die out?\n52.\tIf God can create a man from dirt, why not create a perfect, complete book from more dirt?\n53.\tIf God can create the world from nothing, why does he need fallible man to write his book?\n54.\tIf God created trillions of stars, why not create billions of perfect books to distribute?\n55.\tWhy are there more than 33,000 different Christian denominations worldwide?\n56.\tHow can so many smart people read the same book and interpret it so drastically different?\n57.\tHow do we know which interpretation is the “right” one?  Which version?  KJV? NIV?\n58.\tIf the Bible is so open to interpretation, how can we trust any interpretation?\n59.\tWhy is God’s divinely inspired “inerrant” word so ambiguous and confusing?\n60.\tWhy is there such a need for Christian apologetics?  Why does God need an interpreter?\n61.\tWhy didn’t God give a clear, unambiguous message that all of his children could agree with?\n62.\tIf our souls are on the line, why is God making Himself and His word so hard to understand?\n63.\tIf it’s my fault for not receiving the message, why didn’t he fix my perception when I asked?\n64.\tIf slavery is objectively wrong why was “Don’t own people” not a commandment? \n65.\tIf rape is objectively wrong why was “Don’t rape people” not a commandment?\n66.\tIf babies are innocent, wouldn’t that mean abortion doctors send a lot of souls to heaven?\n67.\tIf abortion is wrong, why does God command soldiers to kill babies and woman (pregnant?)\n68.\tWhy does God break his own commandment “Though shalt not kill?” (a lot)\n69.\tIs God above his own rules?  Why can’t he be a perfect example?  Is God above morality?\n70.\tIs it fair to say I “reject” God if I don’t believe he exists? Do you “reject” Zeus? \n71.\tWhy did Jesus perform petty miracles? (Water to wine, cursing a fig tree)\n72.\tWhy didn’t Jesus perform spectacular miracles that would have compelled a nation?\n73.\tWhy didn’t Jesus end world hunger by turning deserts into fertile soil for crops?\n74.\tWhy didn’t Jesus warn us about disease?  A simple “wash your hands” would have helped\n75.\tWhy didn’t Jesus establish a hospital and prove his divinity by sharing health knowledge?\n76.\tSure he raised Lazarus from the dead, but wouldn’t these miracles have saved more lives?\n77.\tPeople in the Bible believed because they saw Jesus first hand, how can we believe it?\n78.\tHow can we trust the supposed eye witness testimonies and hearsay? (not trusted in courts)\n79.\tWhy should we believe the stories of the Bible over the Quran?\n80.\tIf you get sick do you seek medicine and surgery based on science or do you just pray?\n81.\tIf you would do both, which one do you think has a bigger influence on your recovery?\n82.\tIf prayer has more impact, why waste time and money on human medicine?\n83.\tIs prayer by itself not enough to heal?\n84.\tIf prayer heals the sick (James 5:15) why do Christians die at the same rate as other people?\n85.\tMost Americans are rich by worldly standards, how can they get to heaven? (Matt 19:24)\n86.\tIf God made the Earth to support human life, why is 70% covered in undrinkable water?\n87.\tWhy did God create the Earth to need the sun instead of making Earth self-sufficient?\n88.\tIf the universe is fine tuned for human life, why is the vast majority of space hostile to life?\n89.\tIf God is perfect, how can he create something as imperfect as man?\n90.\tWhy do Christians accept science when it suites them and reject what’s uncomfortable?\n91.\tHow many Christians who reject evolution have made an honest attempt to understand it? \n92.\tWhat would you say to Christians (like the pope and Francis Collins) who accept evolution?\n93.\tIs it fair to accuse evolutionists of having an agenda when Christians have similar motives?\n94.\tIn the Garden of Eden, why did God create a talking snake to tempt Eve? Setup to fail?\n95.\tWhy don’t snakes talk today?  Why did God let the snake talk then? Why make it crafty?\n96.\tIs it fair to call evolution a “Fairy Tale” when Genesis literally has magic and talking animals?\n97.\tWhy was God angry at his children’s attempt to be closer to Him with the Tower of Babel?\n98.\tWhy disrupt the unity of his children by mixing their languages, creating opposing factions?\n99.\tInstead of setting the stage for war, why not just tell them to stop? Send an angel?\n100.\tWhy the flood?  Why not just zap the bad people and spare the innocent children?\n101.\tHow did the carnivores eat anything without causing other species to go extinct?\n102.\tImagine that God does not exist, what would do you think the world be like?\n103.\tHow does that world you imagined differ from the world we see?\n104.\tIf we are expected to take things on faith, how can we discredit faith of other religions?\n105.\tIf faith is your answer, how would you reach someone with an equal but opposing faith?\n106.\tDo you think Muslims are deluded when they believe strongly enough to martyr?\n107.\tDo you think they view you as deluded for following Jesus instead of Muhammad? \n108.\tHow do you know which one of you, if any, is right?\n109.\tIs your faith more valid than that of the Muslim’s?\n110.\tIf you were born in the Middle East, do you think you would be a Muslim?\n111.\tIf not, how are you different than the millions who are brought up to believe it?\n112.\tIs it wrong for a Muslim to teach his child his beliefs and isolated her from others views?\n113.\tIs it fair to isolate a child deep in one religion and insulate her from other opinions?\n114.\tDo you consider this indoctrination? Why or why not?  Good or bad thing? Why?\n115.\tIf children are too young to hold political views, how can they hold religious views?\n116.\tIf a young child hears the gospel, doesn’t believe and dies, do they go to hell?\n117.\tIf they are too young to understand what they deny, how can they truthfully believe?\n118.\t“God’s ways are above our ways” why doesn’t he at least try to help us understand?\n119.\tIf God is so much higher than us, how can anyone truly understand what God wants?\n120.\tAre we not worthy enough to question God and ask for evidence?\n121.\tWhy does God give us powerful, curious brains and tell us not to use them? (Prov 3:5)\n122.\tWhy is doubting so frowned upon? (James 1:5-8, Matt 14:31, Matt 21:21)\n123.\tWhy would God give us logic and reason and expect us not to apply it to Him?\n124.\tHow was the gospel expected to reach everyone on Earth before modern technology?\n125.\tWhat about the souls who died after Jesus who never had a chance to hear the gospel?",
        "created_utc": 1423315554,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist use comedy too often.",
        "author": "antantantantantant",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2v2lf9/atheist_use_comedy_too_often/",
        "text": "Why is it, that when I see atheist on Facebook or Twitter or Reddit or ect. I often see it more so using comedy to make fun of religion? Is there a good way we could be serious with our voice? I'm happy to hear all your opinions, it has just been bugging me lately that I see other atheist taking to funny memes to get their point across. When I see people talk about how they love God, it is serious and well put together, but then we come out and make a joke about it. What can we say to be outspoken but be logical, realistic, and serious about our \"religion\"?",
        "created_utc": 1423291993,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta] Can we talk about the growing amount of negativity in this sub?",
        "author": "telekinetic_turtle",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2v2hmj/meta_can_we_talk_about_the_growing_amount_of/",
        "text": "I wanna talk with you all about the increasing amount of polarization I've noticed in this subreddit. I think we can all agree that religion is silly and that the world could use less of it. However I am seeing more and more comments (in comparison to half a year or a year ago) that take a much more militant stance against theism. \n\nIt's not that I don't think religion is rage-inducing, because it totally is. But if we all sit here and jerk about just how STUPID theists are and how BACKWARDS they are, or how the best approach is to fight them rather than to work with them, all we are doing is making things worse for ourselves. We don't like it when theists demonize us and treat us as if we are simply idiots who fail to see the light, and when we receive that sort of treatment we immediately shut them out and don't listen to anything they have to say. Likewise, if our language turns hostile and our attitude is a combative one rather than one of understanding and community, then we won't make any progress. If theists come here, or talk to someone in real life with those attitudes, and see nothing but combativeness then that probably won't make them want to change their minds. See how much shit /r/atheism gets? It's because they are hostile douchebags and I'm scared of this sub following the same path.\n\nDon't get me wrong, the top comment to most things is usually well thought out and sensible, but I'm starting to see more upvotes go to comments that don't add anything to the discussion other than \"lel religion is stupid amirite.\"\n\nCheck out [this thread](http://www.np.reddit.com/r/TrueAtheism/comments/2v1ndm/i_need_your_help_christian_pastor_wants_honest/) where as of this post, the top comment is \"Do atheists get to respond to his inevitable fallacy-ridden answers?\" which adds pretty much nothing to the discussion other than to jab at the pastor who is going out of their way to reach out to us. Or check out [this](http://www.np.reddit.com/r/TrueAtheism/comments/2uz3ed/pope_francis_endorsing_violence_again_this_time/), a largely upvoted post with a sensationalist title. While this sort of unnecessary combativeness isn't AS prevalent as I'm making it out to be, I do feel like I'm seeing it become more prevalent (usually about a third of the way down the comments section of posts). \n\nI'd like to hear what you all think. I'm not here to fight with you all, but it is a concern of mine I thought I could share and get your opinions on.",
        "created_utc": 1423288942,
        "upvote_ratio": ""
    },
    {
        "title": "Isn't being agnostic more logical than being atheist?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2v2hkn/isnt_being_agnostic_more_logical_than_being/",
        "text": "Please don't downvote, I'm just saying because it seems that believing more in the principles of agnosticism is more logical. A God/extraterrestrial/divine cannot be proven the same way as it cannot be proven to NOT be true. So isn't the best outlet going with acknowledging the fact that either could be true, neither agreeing or disagreeing with either?",
        "created_utc": 1423288900,
        "upvote_ratio": ""
    },
    {
        "title": "I need your help. Christian pastor wants honest questions from atheists.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2v1ndm/i_need_your_help_christian_pastor_wants_honest/",
        "text": "My dad is a Christian and his pastor wants to address the reason atheists don't believe by answering any and all questions we can pose about their faith. I am sure I can come up with a decent list on my own but one does not get this opportunity often and I would love to have your minds involved. Please share with me any questions I could give him. Thank you!\n\n\n**EDIT:** For those questioning why I would even participate in this: Yes, he will simply be taking the questions, carefully formulating a defense to them, and presenting them to his congregation as a sermon. No this is not optimal but I cannot change this. If I choose not to participate, he will still preach this sermon but will instead be cherry-picking easy questions from the web to make his perfect case against atheism. The least I can do is throw him some real, honest, challenging questions that he might struggle with giving a convincing answer to.\n\n**EDIT:** I have made a [google document](https://docs.google.com/document/d/15lDe494dAl3afDYRNkLkg62hjgL4iaJX4TCBMgBV6fo/edit?usp=sharing) to send to him, feel free to use it if you want and thank you for your help.",
        "created_utc": 1423270454,
        "upvote_ratio": ""
    },
    {
        "title": "Islam is Not my Race - A Rant From an Ex-Muslim",
        "author": "LondonLurker1990",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uzier/islam_is_not_my_race_a_rant_from_an_exmuslim/",
        "text": "Hi TrueAtheism, I'm a long-time lurker who'd like to share some of her views on Islam and \"racism\" from the perspective of an atheist from a Muslim country.\n\nI grew up in Pakistan but me and  my family moved to the UK 14 years ago when I was 10. My family were never very religious by Pakistani standards and these days mainly pay \"lip-service\" to Islam in the same way that many natives to the UK pay \"lip-service\" to Christianity. I can't remember when I really stopped believing, it was a gradual process but by the time I was 18 I was a pretty convinced atheist and very critical of Islam when in appropriate company.\n\nI've noticed a common trend when people here in the UK criticise Islam and Muslims: they are branded as \"racist\". I want to be very clear: \n\n**Islam is not a race, it is a chosen system of beliefs.** \n\nI find the assumption that Islam is somehow part of my race personally offensive. The violent, sexist, homophobic, anti-atheist, anti-science beliefs of Islam have nothing to do with me, don't use my nationality or the colour of my skin as a defense for your nonsense. To say that criticising Islam is racist to Pakistani people is akin to saying criticising the Nazis is racist to Germans (perhaps a bit extreme, but you get my point).\n\nEvery time there's a protest or talk against Islam I'm saddened to see so many people jump to its defense on this account. I think the people who do this are like most Muslims: kind-hearted but mis-guided. This is no coincidence, most Imams are expert manipulators by trade and have sucessfully manipulated many of those who should be Islams most vocal critics into being its biggest defenders. They have sucessfully manipulated those who hate intolerance to defend a belief system that is built on intolerance. \n\nImagine Islam was not a religion but an ultra-conservative, sexist, homophobic, anti-Semitic political group. Who would ever use words like \"Islamophobic\" or \"racist\" to describe its critics? No, it would be the most hated political group in the country.\n\nI don't advocate hate against Muslims. As I said, most are good people who have been misled by a poison culture and I think a mix of kindness with harsh truths can be better than harsh truths alone. I also understand that religion can have a very deep meaning for many people, beyond that of other beliefs. Despite this, the framing of Islam as a race is incorrect, insulting and (ironically) racist. Please don't be discouraged by those who would use this childish defense.\n\nTLDR: Islam is not a race, it is a chosen belief. The criticism of Islam is **not** racist.\n",
        "created_utc": 1423232861,
        "upvote_ratio": ""
    },
    {
        "title": "Pope Francis endorsing violence again: this time against children",
        "author": "therationalparent",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uz3ed/pope_francis_endorsing_violence_again_this_time/",
        "text": "",
        "created_utc": 1423220640,
        "upvote_ratio": ""
    },
    {
        "title": "Family is Close to Finding Out I'm Atheist",
        "author": "tallguybarista",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uyt0d/family_is_close_to_finding_out_im_atheist/",
        "text": "You can see my original thread here: http://www.reddit.com/r/TrueAtheism/comments/2ui100/strongly_considering_abandoning_christianity/\n\nOkay, so I'd definitely say I identify as atheist now, even though I'm still formulating my view on many things. \n\nIn case you haven't read the previous thread, here's a synopsis (fail:wrote synapse): I've been doubting for a while, but am now officially rejecting Christianity. Parents and all of extended family and friends network are hardcore Christians. The plan was to keep the question at bay for as long as possible, but it doesn't seem like it's going to work. Here's why: I have an atheist girlfriend. The folks don't like it, and they are expecting me to try bringing her to church and maybe converting her. If she rejects, they tell me that I should break up with her to minimize heartache and be fair to the girl. Problem: girlfriend and I are both atheists. \n\nSo I'm at an impasse. I don't want to address this question yet. I'm not ready to. However, they are expecting me to bring her to church and see what she thinks, as my parents are waiting to know what her response will be and whether or not I should continue seeing her. Not only that, they are also suspicious of me having sex with her, or maybe just getting frisky, before marriage. Which has already happened. My mom is calling me a lot more than usual and is reminding me more and more to \"remain clean\" (virgin) so that I don't lose my \"blessings.\" She is also being very emotional towards me lately. Dad is also asking me (which is huge, because he usually remains distant) about it. \n\nI'm trying to dodge the question and duck and cover much as I can, but it's gonna happen, and soon. I don't know how to approach it. Of all people, my dad would probably be the easiest person to engage, but that's just the lesser evil.\n\nIf my parents find out, they will be emotionally destroyed. They will cry a LOT. If they found out I've also had sex with my girlfriend, they will cry and be angry. \n\nI could list all the terrible things that are guaranteed to happen if they find out, but I'm sure y'all could imagine. I'd rather hold off, but, doesn't look like that's gonna work. Lying is also making me miserable. \n\nAny advice? I know the basics: don't identify as atheist, don't argue back with them, try to be meek and quiet about it, and in all ways, try to avoid continuing or inflaming the conflict.\n\nAny other advice? It's possible they might kick me out of the house. What should I do in that case?",
        "created_utc": 1423210008,
        "upvote_ratio": ""
    },
    {
        "title": "What is conscience? Is it an evolved cognitive trait or just a theological concept?",
        "author": "plasticpony256",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uxpcy/what_is_conscience_is_it_an_evolved_cognitive/",
        "text": "I have been searching far and wide for some document, some reference that describes conscience as an evolved trait of human cognition. So far I have not been able to find anything that clearly states it is something we evolved with. However searching the web I find a lot of spiritual, religious and theological references to conscience and so I'm wondering if conscience is simply a fancy word used by theists to make moral judgements seemingly explainable by science. ",
        "created_utc": 1423185527,
        "upvote_ratio": ""
    },
    {
        "title": "What is conscience? An evolved trait or a theological concept.",
        "author": "plasticpony256",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uxb3u/what_is_conscience_an_evolved_trait_or_a/",
        "text": "",
        "created_utc": 1423178464,
        "upvote_ratio": ""
    },
    {
        "title": "The Pope will speak at a joint session of Congress",
        "author": "Schnectadyslim",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uwqel/the_pope_will_speak_at_a_joint_session_of_congress/",
        "text": "",
        "created_utc": 1423168514,
        "upvote_ratio": ""
    },
    {
        "title": "Little quote from Spinoza, Theological-Political Treatsie [1677]",
        "author": "koedybharper",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uvp3r/little_quote_from_spinoza_theologicalpolitical/",
        "text": "",
        "created_utc": 1423151446,
        "upvote_ratio": ""
    },
    {
        "title": "Would like responses / debunking of this piece by Wayne Dyer",
        "author": "x_entrik",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uvjot/would_like_responses_debunking_of_this_piece_by/",
        "text": "This is being forwarded around on Facebook and WhatsApp and I see a lot of my friends responding with \"great\", \"how true\" and so on.  Does anyone know of some link, meme or general snark which I can use in response to this ?\n\n&gt; This lovely parable is from \"Your Sacred Self\" by Dr. Wayne Dyer. regarding those who believe and those who don't believe in God ! Very interesting. It stimulates our lateral thinking\n\n&gt; In a mother’s womb were two babies.One asked the other: “Do you believe in life after delivery?”The other replied, “Why, of course. There has to be something after delivery. Maybe we are here to prepare ourselves for what we will be later.”\n\n&gt; “Nonsense” said the first. “There is no life after delivery. What kind of life would that be?”\n\n&gt; The second said, “I don’t know, but there will be more light than here. Maybe we will walk with our legs and eat from our mouths. Maybe we will have other senses that we can’t understand now.”\n\n&gt; The first replied, “That is absurd. Walking is impossible. And eating with our mouths? Ridiculous! The umbilical cord supplies nutrition and everything we need. But the umbilical cord is so short. Life after delivery is to be logically excluded.”\n\n&gt; The second insisted, “Well I think there is something and maybe it’s different than it is here. Maybe we won’t need this physical cord anymore.”\n\n&gt; The first replied, “Nonsense. And moreover if there is life, then why has no one has ever come back from there? Delivery is the end of life, and in the after-delivery there is nothing but darkness and silence and oblivion. It takes us nowhere.”\n\n&gt; “Well, I don’t know,” said the second, “but certainly we will meet Mother and she will take care of us.”\n\n&gt; The first replied “Mother? You actually believe in Mother? That’s laughable. If Mother exists then where is She now?”\n\n&gt; The second said, “She is all around us. We are surrounded by her. We are of Her. It is in Her that we live. Without Her this world would not and could not exist.”\n\n&gt; Said the first: “Well I don’t see Her, so it is only logical that She doesn’t exist.”\n\n&gt; To which the second replied, “Sometimes, when you’re in silence and you focus and you really listen, you can perceive Her presence, and you can hear Her loving voice, calling down from above.”\n\n\n\n\n",
        "created_utc": 1423148665,
        "upvote_ratio": ""
    },
    {
        "title": "Children are not our political pawns.",
        "author": "madcap462",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uvgfr/children_are_not_our_political_pawns/",
        "text": "With the recent news about Christians handing out promotional material in schools I have formed this opinion.\nI disagree with theists handing out literature as well as Satanists and atheists. My opinion is that if we are to say theists handing out literature promoting their beliefs is \"wrong\" we should take the \"high ground\" and not do the same. That being said, I wouldn't have a problem with handing out material about logical fallacies and critical thinking. If we have to become our \"enemy\" to defeat our \"enemy\" we have already lost. I also think that bombarding children with this stuff may turn them off completely to thinking about these ideas at all. The old \"if old people are doing it, it isn't cool\" mentality. Thoughts?",
        "created_utc": 1423146834,
        "upvote_ratio": ""
    },
    {
        "title": "Interview with a real muslim",
        "author": "-whinestein-",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uv1bu/interview_with_a_real_muslim/",
        "text": "",
        "created_utc": 1423135271,
        "upvote_ratio": ""
    },
    {
        "title": "Should I be upset with my school?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2utn1w/should_i_be_upset_with_my_school/",
        "text": "Hello! I am a Junior in an american public high school and I am trying to get ready to get a degree in biology. To do this I am taking all the science classes I can get my hands on. That being said this year was the first time there has ever been any mention on evolution in any of my classes.\n\nI love my teachers and wouldn't trade them for the world, but I feel cheated. Since I began high school I've taken biology, microbiology, genetics, and now a biology class in conjunction with a local university, and only now do I get even a hint of it!\n\nAgain, my teachers are some of the best people I know, and I know that they aren't just being lazy. I just don't know what to think about this and I would enjoy any input this community could share about how this is acceptable in a public school!",
        "created_utc": 1423100480,
        "upvote_ratio": ""
    },
    {
        "title": "Analysis of Christian beliefs. Infographic linked in text.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2utavv/analysis_of_christian_beliefs_infographic_linked/",
        "text": "[Here](http://info.stylee32.net/Religion/Why%20believe%20in%20God.jpg) is the infographic this post and following comments will discuss. To what extent do you agree with post? Is there anything mentioned within the infographic that you disagree with? Anything the infographic is missing that you feel needs to be added?",
        "created_utc": 1423094476,
        "upvote_ratio": ""
    },
    {
        "title": "God and the Devil are backwards",
        "author": "Shaniswara",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2utabg/god_and_the_devil_are_backwards/",
        "text": "",
        "created_utc": 1423094168,
        "upvote_ratio": ""
    },
    {
        "title": "How are the New Atheists not tools?",
        "author": "anarrespress",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ut3oy/how_are_the_new_atheists_not_tools/",
        "text": "I'm an atheist, and I identify with the atheism of philosophers like Bertrand Russell and anarchists like Emma Goldman. It seems to me that there is a long atheist tradition of critical thinking, outreach, and \"punching up,\" that is, critiquing the powerful. And I feel like New Atheism has nothing to do with this tradition. If New Atheists are really committed to their ideas and principles, why not engage in dialogue with Muslims? It seems New Atheist discourse is never directed towards Muslim audiences, but directed towards Western audiences, in a way that legitimizes Western governments---the same governments that ally themselves with monsters like King Abdullah of Saudi Arabia.\n\n**Edit:** To clarify, by New Atheists I mean people like Richard Dawkins, Christopher Hitches, and Sam Harris.",
        "created_utc": 1423090957,
        "upvote_ratio": ""
    },
    {
        "title": "God, the Father (An Origin Story)",
        "author": "bREAK000",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2useet/god_the_father_an_origin_story/",
        "text": "Below is a (complete) draft I wrote for my blog, however I don't think it is publishable for my audience. \n\nIt is a thought experiment. Please read it with the enlightened tone I meant it in, and not a harsh one as I think it can be easily misinterpreted, especially with the last sentences - which I kept only for strength of message.\n\n------\n\nOur fathers are people who we learn from, who show us the right way to live - but what happens when we transcend them or have their flaws revealed to us?\n\nOur superheroes topple. And how does one keep moving forward when before there was an objective and idol, and now there is none? \n\nI will create one.\n\nHe will be all knowing - where my mortal father failed to advise, He will have my answers.\n\nHe will be eternal - where my mortal father succumbed to sickness and age, He will live on to support me.\n\nHe will be beyond my understanding - where I transcended my mortal father, He will always be able to teach me something.\n\nHe will be sovereign - where my mortal father's justice failed, He will be perfectly lawful to all parties.\n\nHe will be unchanging - where my mortal father had inconsistencies, He will be my fortified rock and always dependable.\n\nNow that I have created my new Father, I will share him with all my brothers so that they may have what I have and share in the joy of His antithetical perfection.\n\nHe sounds great huh? Too bad it sounds like the scrounging of a man who couldn't understand his own mortal father's imperfection.\n\n-----\n\nEdit: as requested I am expanding the post to include a discussion topic, which is this:\n\nDiscuss the inevitability of the construct of a God inspired by man's failed mortal father. ",
        "created_utc": 1423079922,
        "upvote_ratio": ""
    },
    {
        "title": "This may be the most compelling argument that jesus is real AND is god.",
        "author": "HamOwl",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2us7hl/this_may_be_the_most_compelling_argument_that/",
        "text": "",
        "created_utc": 1423076841,
        "upvote_ratio": ""
    },
    {
        "title": "ATHEIST are retards",
        "author": "urmybitch997",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uoqzg/atheist_are_retards/",
        "text": "",
        "created_utc": 1423002419,
        "upvote_ratio": ""
    },
    {
        "title": "Islam is not a religion of peace.",
        "author": "Samesyo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uomye/islam_is_not_a_religion_of_peace/",
        "text": "1.) You will never have peace so long as there is a civil war within the religion.\n\n-Sunni and Shiite relations within Iraq. \n\n-Relations between Egypt, Syria, and Jordan. \n\n-Edit: Israel and Palestine conflict is not religiously fueled thank you u/King_saline_IV for the correction.\n\n2.) The Qur'an is said to be the spoken word of god; also Islam claims to be the last of the religions and the only true religion which by definition eliminates the idea of a \"moderate\" Muslim.\n\n-If the Qur'an is the absolute word of god, that would make the human interpretation a subjective matter. The jihadists think they are just as moderate as the non jihadists. \n\n-There are also passages in the Qur'an that explicitly say kill the infidel, and rid of the non Muslims.\n\n3.)The \"moderate\" Muslims of the west do not condemn Sharia. By survey hundreds of millions of moderate Muslims are for the oppression of women, the persecution of homosexuals, and a penalty for apostasy. \n\n-There are currently 1 billion fundamental followers of Islam in the world currently who may not be jihadists, but are perfectly okay with hate filled oppression. \n\n\nModerate Muslim is a term we need to get rid of, and Islam is not a religion of peace and deserves ridicule. ",
        "created_utc": 1423000637,
        "upvote_ratio": ""
    },
    {
        "title": "Recent deconvert looking for opinions on morality",
        "author": "She-wants-the-PhD",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uo9nm/recent_deconvert_looking_for_opinions_on_morality/",
        "text": "Hello all. I am a recent deconvert. First from generic theism and then from deism. If you would like to read my story, it is [here](http://www.reddit.com/r/thegreatproject/comments/2ulo5o/my_deconversion_from_generic_theism/). I finally ended up dropping my deistic beliefs because I found the deistic god to be an unfalsifiable and unhelpful idea. I have been having some issues with morality though. I would like some opinions of morality from an atheist perspective. My general feeling is that science tells us how things work, but morality is our way of acting out our human desires and goals on a general scale. \n\nAfter doing some research, I realize that I most closely identify as a secular humanist. I have heard atheists claim before that moral truths can't exist because they can't be falsified. I don't really see a problem with the fact that they can't be falsified though. I mean, I think moral statements are true because humans can relate to each other and we all have feelings. I think that there is a difference between believing in a god (unfalsifiable claim) and believing in morality (statement about what we feel is good). I guess what I am trying to say is I feel that it is good to help others and vice versa, because I relate to them and they can relate to me. I mean, as long as I try do good, then that's the best I can do. I'm not sure how to refine this view though. I'm not very good at explaining, so I apologize if this sounds dumb. ",
        "created_utc": 1422994910,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't we ever talk about the hundreds of millions of Muslim Conservatives?",
        "author": "touchmystuffIkillyou",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2unv4a/why_dont_we_ever_talk_about_the_hundreds_of/",
        "text": "I'd like to introduce you to my friend Bob.  Bob thinks you *must* believe in God to be a moral person.  He says drinking alcohol and prostitution are morally wrong.  In fact, he thinks *all* sex outside marriage is wrong.  Bob says \"no way\" on abortion, that's wrong.  But even worse than abortion?  Homosexuality.  Bob say's it's definitely wrong.   While Bob has mixed feelings about divorce, polygamy is OK.  Bob thinks that honor killings are OK sometimes - he understands why they happen.   \n\nBob isn't an extremist and he's certainly not a terrorist.  You might not even call him a fundamentalist.  Bob is just your average, run-of-the-mill ** Muslim Conservative**, and he represents about a billion Muslims world wide.  \n\nAnd just like my ornery uncle Mo, he doesn't really let his opinions fly until you get him alone, when the \"libtards\" have left the room.  \n\nEDIT: Expanded, by request.  The media conversation surrounding Muslims oversimplifies the Muslim dynamic by treating Muslims as either \"Extremists\" or \"Good Muslims\".  But the Muslim majority is made up of an overwhelmingly conservative base that makes U.S. conservatives look tame.  Liberal Muslims make up such a small percentage of the pie that to be considered a \"good, moderate Muslim\" gets conflated with being a \"non-extremist.\"    I think to better understand where Muslims really stand, we need more nuance labels and dissections to describe the distribution of their political and religious views and I ask for discussion on the subject.    ",
        "created_utc": 1422988656,
        "upvote_ratio": ""
    },
    {
        "title": "How to get atheists to volunteer for service work",
        "author": "brightonpeer",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ujvl7/how_to_get_atheists_to_volunteer_for_service_work/",
        "text": "My friend works at a secular non-profit community service organization and he recently told me that they are having a very hard time recruiting atheists/nontheists to volunteer for them. He asked me why I thought they were having this issue and what they could do to get atheists more involved in service work. I was surprised to hear this, since the organization is 100% nonreligious in nature. Anyone have any ideas what could be going on? What motivates you to do community service work?\n\nEdit: It is an international organization with locations all over the US and this is a problem at all locations. Unfortunately, I promised my friend I wouldn't give too many details about the org because he doesn't want them to be identified, so I have to respect that.",
        "created_utc": 1422907442,
        "upvote_ratio": ""
    },
    {
        "title": "Strongly considering abandoning Christianity. Please give insight.",
        "author": "tallguybarista",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ui100/strongly_considering_abandoning_christianity/",
        "text": "Hello everyone,\n\nBit of a background for me. I'm 20 years old, son of USSR immigrants who are both devout Christians. All of my siblings are devout Christians (although I speculate about one of my older brothers). I am the youngest. My adherence and involvement in Christianity is (was?) thorough and sure. All of my extended family is the same way. I'm sure you've all heard the story...\n\nAnyways, the good (bad?) stuff started three years ago. The last three years of my life have been incredibly depressing to say the least. While intellectually affirming the doctrines of Christianity, I felt very little emotional involvment in the ideology. Cussing was wrong, this I knew. However, I didn't feel bad about it (insert X things here: porn, dirty humor, not praying, etc). Essentially, I was a drone. \n \nThis was the status quo. Intellectual affirmation, but emotional detachment. In hindsight, that was always the case. It always felt like a charade; a parody, if you will, of what was supposed to happen genuinely... except the joke was on me, I now presume. \n\nBack story in short: Accepted Christ at 13. Baptized at 15. Left the local church 6 months later due to a division. Went to a different church for a few years and finally joined up membership there, literally a month ago (that is going to be a big problem). All of my family are young-Earth Creationists. I was, too. Watched Kent Hovind, refused evolution, etc... I'm sure you all have seen the likes. Everyone in my family is super sure they know the actual truth. \n\nThere was a problem, though. I fell in love. With science. Chemistry, specifically. I am now majoring in Pharmaceutical Chemistry. My educational path has somewhat guided me away from my faith, I think. First was the account of creation. It didn't take me long to absolutely reject a 6,000yo Earth. I absolutely do reject it. This division kind of led me to find ways to justify my faith in light of this new view. In comes John Lennox, the Christian apologist. Don't get me wrong, guy is incredibly intelligent. I respect him very much so, and I think some of his arguments in favor of theism and Christianity specifically are worth listening to. However, in the back of my mind was a lingering thought... if this is the ultimate truth, why is it necessary to break my back trying to accommodate it with modern rationality? Didn't seem right. Genesis certainly reads like a 6-day creation. Why the awkward interpretations trying to make billions of years fit in? Why is that even necessary? \n\nThat was my first huge straw, I suppose. It really stopped my faith dead in its tracks. The second straw was far more recent. As in a few days of thinking (this last week), but years and years of yearning. Why arbitrary rules? Certainly, I could justify no murder. Fidelity in marriage. Loving one another... If there is a God, certainly obedience and repentance for justification. However, there were other matters. Why not work on Sundays? Why can't we use foul language? Why no drinking? No pre-marital sex? Why keep ourselves \"separate\" from other people? These things never really made any sense to me. Despite my Christianity and supposed \"New nature,\" I wanted these things just as bad anyway. It hurt me. These things were supposed to set me free, but they felt like nothing more than a burden.\n\nMy first act of rebellion (in the sight of my parents, at least), is my girlfriend. First girlfriend ever, and she's an atheist. And she is the sweetest person I've ever met in my life. She cares for me, and I for her. I love spending time with her. I love talking to her. She makes me happy. But no, she's not a believer. I shouldn't be dating her, and God forbid I marry her eventually, or else my entire life will be ruined and my kids will be cursed. It hurts me. That train of thought hurts me. It doesn't make sense. Now of course, my parents are expecting me to bring her to church with me. They are praying that she come to Christ. They have no idea that I'm the problem. Not the slightest clue. Nobody in my family does. \n\nKeep in mind, my family and I are rather theologically inclined. This isn't just, \"Oh, well we're Christians.\" I'm talking systematic theology, pre/a-millenialism, Calvinism/Arminianism, etc. Heavily ingrained.\n\nI will still say this: the question is up in the air and I am not yet an atheist. However, I can officially say I am no longer convinced of my Christianity. \n\nHere's the problem at heart for in terms of practicality: This decision will hurt my parents and family more than my own death would, in all honestly. Maybe that's exaggerating a bit, because the nature of me dying and me deconverting are very different, but still. It would CRUSH my parents. You can't imagine. I can't imagine. They wouldn't disown me, I'm sure. It would be insane, however, the turmoil this would cause. My mom would cry. A lot. We already have a few non-Christian family members that she cries and prays for a lot. I'd become an outcast. Sure, my brothers and sisters would still treat me and love me in a similar way, but an underlying connection between all of us would be severed. For good. \n\nNot only that, the social effect would be astronomical. There is a massive community of us immigrants. Everyone would know. My parents would be ashamed. People would talk about them. I'd become a horror story of why people should major in sciences or engage in philosophy. I'd hate to do that to my parents. I don't give a shit what people think of me, just please tell me there is a way to leave my parents out of this (wishful thinking, I know).\n\nI'm confused beyond measure, but the one thing I can't do is force myself to believe. I just don't feel it anymore.\n\nI feel like my world is falling apart.\n\nEDIT: Told my girlfriend. She is incredibly supporting. Told her about all the things that might happen if my parents found out and she started crying. Oh my goodness, though. It feels so good to have someone know. It's ridiculous. I have never talked to anyone about this. Ever.",
        "created_utc": 1422867253,
        "upvote_ratio": ""
    },
    {
        "title": "explaining evolution",
        "author": "xplodingpeep",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uhw8o/explaining_evolution/",
        "text": "So, evolution makes sense to me. I looked at the evidence for it years ago, and haven't thought about it for a while, but I have a friend who oscillates between deism and Christianity, and he likes to talk about evidence. I don't want to be condescending, he's a smart guy, but his dad is a pastor, so I think he sometimes gets some interesting but bad argument from him. Where can I go to get good information that will counter this arguments that also will explain it in a non-confrontational way? I normally shy away from this kind of thing, but he is actually really reasonable, and if I show him evidence he does change his opinion. \n\n",
        "created_utc": 1422862805,
        "upvote_ratio": ""
    },
    {
        "title": "How dangerous is Islam really?",
        "author": "BAtrogit",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uhqfr/how_dangerous_is_islam_really/",
        "text": "I have for awhile agreed with Bill Maher and Sam Harris to an extent for awhile. On the topic of Islam at least. But now I'm reconsidering. But I don't know if I'm reconsidering because of the people around me constantly saying I am bigoted and racist, or if I am wrong. The way I've thought is, Islam as an institution is dangerous, but I don't judge any of the people. It is promoting these horrible atrocities, and maybe even directly causing them. I hate the racist criticism because I'm not criticizing a group of people, but a set of ideas. Then I quote the pole results that show it isn't a small group of Muslims, but actually a large majority. And I get the response that the polls are useless, opinion polls in general are not very useful. How do you all feel about that poll part? And about the Islam extremism results? And is Islam dangerous? ",
        "created_utc": 1422858356,
        "upvote_ratio": ""
    },
    {
        "title": "The Cosmological Argument",
        "author": "KEGEL_POWER",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uhgrd/the_cosmological_argument/",
        "text": "1. Everything that begins to exist has a cause.\n2. The universe began to exist.\n3. Therefore, the Universe had a cause.\n\nI understand that this argument is flawed in numerous ways, but I would like to focus on the first premise for this post. I've noticed something about statement (1) of the argument, something that I haven't heard any other atheist talk about before, and I would like you to tell me if I am wrong, or if my idea is more common than I thought.\n\nSuppose a theist claims that \"Everything that begins to exist has a cause.\" Stop. When have you ever seen something *come into existence*? The phrase \"everything that begins to exist\" assumes that we regularly observe things coming into existence, which is not true. The first premise has absolutely no basis at all.\n\nMatter/energy cannot be created or destroyed. Everything that we experience is simply a *rearrangement* of matter and/or energy. Except in the case of quantum mechanics, we never, *ever* experience things coming into existence. In fact, whenever we *do* experience things coming into existence (quantum mechanics), they have absolutely no discernible cause! \n\nIf all of this is true, then the first premise of the Cosmological Argument *is exactly the opposite* of reality: {Everything that begins to exist} has no cause whatsoever!\n\nPlease tell me if i'm wrong, I don't want to sound stupid if I use this argument in the future.",
        "created_utc": 1422852782,
        "upvote_ratio": ""
    },
    {
        "title": "Meaning of life",
        "author": "dwwidener",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ugvqo/meaning_of_life/",
        "text": "",
        "created_utc": 1422841697,
        "upvote_ratio": ""
    },
    {
        "title": "So why only one god....",
        "author": "ZapMePlease",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ug8zg/so_why_only_one_god/",
        "text": "This relates specifically to Christianity.  It relates even more specifically to the brand of Christianity expounded by apologists such as William Lane Craig.\n\nCraig uses his inductive arguments to 'prove' the existence of god.  I'm not going to go into his entire line of reasoning - most of you are probably pretty familiar with the Kalam Cosmological argument.\n\nSo he gets to where the cause of the universe has to be a personal cause - one that is not of time (atemporal) because, obviously, it had to precede (for lack of a better word) the creation of the universe.  It also had to be out of space (aspatial) as there was no universe in which it could have existed before it created our universe.\n\nSo why just one?  \n\nWhy - in this atemporal, aspatial state - can't there be an infinite number of gods - each with the same abilities as the Christian one - each off creating universes for it to reign supreme in? Or why can't this universe have been a collaboration of multiple aspatial, atemporal beings?  \n\nI'm familiar with Craig's arguments.  I've never heard him challenged on this before.  I'm not sure it even makes a difference to the argument itself but it does draw a line to some form of polytheism.\n\nAny ideas on this?\n\n",
        "created_utc": 1422829097,
        "upvote_ratio": ""
    },
    {
        "title": "So my friend thinks religion shouldn't be made fun of.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ufdrw/so_my_friend_thinks_religion_shouldnt_be_made_fun/",
        "text": "A debate my friend and I keep getting into is that religion should or shouldn't be respected or treated just like any other topic. He thinks that religion should be kept away from satire. He says \"why offend this many people who hold this topic so dearly in their hearts?\" I explained that anyone can be offended by anything. And if religion is given the power to not be able to be made fun of, it will hold power big enough to make any place look like Saudi Arabia. For me, I've heard this fallacy or idea a lot of times   in debates or just general discussions, but to be honest, I don't know why this point holds. Why is giving religion a pass from being mocked, criticized and be made fun of really that bad?\n\nTo be clear, my friends has no problem with religion being criticized as long as it's not insulting or seems like it's mocking religion. Basically, as long as it's in a serious manner and not comedic.\n\nIf there is a video or article talking more about this point, or if you can give some of your own arguments and elaborations, it would be awesome.",
        "created_utc": 1422814247,
        "upvote_ratio": ""
    },
    {
        "title": "I've always been curious, do you come from a religious background?",
        "author": "Crabaooke",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ufbzs/ive_always_been_curious_do_you_come_from_a/",
        "text": "http://strawpoll.me/3538271/r\n\nI'll start off. Religion has never been a part of my home or family life, so me being an atheist was never thought of as weird and I've never had to 'come out' to my parents or family. I've never been looked down upon because I don't believe in God (although I live in Canada which isn't as religious as the US). Just curious what other peoples background has been like.",
        "created_utc": 1422813404,
        "upvote_ratio": ""
    },
    {
        "title": "I was scared by something a close religious friend said to me today.",
        "author": "Saxon_man",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2uerf0/i_was_scared_by_something_a_close_religious/",
        "text": "Today I ended up having an hours-long discussion about faith with my oldest friend. More specifically it was about what he believes and why he believes it. \n\nFor the most part it was an enjoyable learning experience. He was open with me about his answers and he didn't take offence at my questions. Specifically this friend spent years studying science at university and is extremely intelligent, so i'm always interested in how he is able to balance both these beliefs. \n\nHis answers were well thought out, and he never contradicted himself. He could rationally explain himself very well, often taking the POV that many (most?) christians have not thought about/interpreted the Bible correctly and that these false assumptions and conclusions are where the conflicts between science and faith clash. He would back this up by explaining what the Bible says, why it's often interpreted falsely and how his interpretation works. \n\nBut I asked him if he has a reason to believe other then what he's been taught, or what he's read in the bible. \"Yes, god has spoken to me, on several occasions\" He replies. I don't mock this statement, that's what he believes and that's fine. I asked him how he knew it was god, and not a short circuit in his brain. His answer was fair and well reasoned, but what disturbed me was what followed. \n\nTo paraphrase my Friend:\n\"I Recognise the voice of god when I hear it. And I know what he tells me is 100% true. If he asked me to kill, I would. I don't believe he would ask me, but if he did I would. If he asked me to kill you, I would do it, and I wouldn't have any concerns that it would be the wrong thing to do.\"\n\nIt was said without threat, or aggression. He was NOT trying to scare me, just to demonstrate the strength of his conviction. I suspect he used me as the example because he didn't want to say it about a family member, and since I'm the next closest person to him using me it demonstrated his conviction. But I *was* scared. Not for me. Not even scared that he might one day hurt someone for god. It scared me because if he could, any religious person could. \n\nThis man who I love like a Brother. This man who I respect the intelligence and reasoning skills of. A man I look up to as a moral man, as a dependable and honest man. A man who's personal faith has always been to me an example of faith without blindness or faith with reason. In my mind If **this** man could kill because he hears a voice in his head say he should, then any person of faith is capable of the same thing. The vast majority of the world's population is a religious ticking time bomb. I'm not sure if I'll sleep tonight. \n\nEDIT: To clarify. I'm not surprised by the notion that Religious people might (or do) kill for God. I'm surprised that one of the most intelligent people I have ever known would to. I respected him and his reasoning skills as much as I respect some of the Atheists I follow online, he never told me any of his religious POV that seemed inconsistent or logically flawed, but now that he's said this- I don't know what to think anymore.  \n\nEDIT: I am not saying I draw the same conclusions as my friend. I don't. I'm still an Atheist because he provided absolutely no meaningful proof. But I gave him an opportunity to explain his belief and he offered a number of rationals I had not encountered before and many of them were sound logically. He didn't rely on Logical fallacy like 'No true scotsman' to prove his points, they were well reasoned. There were flaws in his argument, but He had given every angle some thought and deserved respect for that. I flat out disagree with anyone claiming it's impossible to have logic in faith, it just doesn't happen often - and it doesn't mean that recognising that makes u suddenly a theist, or 'on their side'.     \n\nEDIT: When I say he was well reasoned, I mean he didn't rely on logical fallacy. His reasoning was intellectually honest and therefore worth some examination. I've spoken to few Theists who can do this so It allowed me to have a long and detailed discussion, without anyone taking offence. See http://www.theaunicornist.com/2012/11/common-theistic-arguments-that-are.html or https://www.youtube.com/watch?v=8qb-h0sXkH4 if you need an idea of what I mean by Logical fallacy.  \n\nTL:DR: A friend with strong faith and strong science and reasoning knowledge told me he would kill me without hesitation or guilt, if he heard god tell him to do so. And Now I feel like every theist is a ticking bomb.      ",
        "created_utc": 1422801939,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Human Chromsome 2?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ueawb/question_about_human_chromsome_2/",
        "text": "",
        "created_utc": 1422786426,
        "upvote_ratio": ""
    },
    {
        "title": "a Question regarding the violent/nonviolent nature of religion.",
        "author": "sdiller",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2udw4i/a_question_regarding_the_violentnonviolent_nature/",
        "text": "After watching Sam Harris' [video](https://www.youtube.com/watch?v=kMFsO58hXVM)  concerning Islamic fundamentalism, I was thinking about the part where he says that we don't have to worry about Jainism extremism because Jainism is entirely a religion of peace. I know Sam Harris frequently explains that there is no way to make Islam a religion of peace because of its core principles. I was curious about Christianity. If we say that Christianity could be made into its most benign form, would it be something that we didn't have to worry about?",
        "created_utc": 1422771886,
        "upvote_ratio": ""
    },
    {
        "title": "Irreligious calendar.",
        "author": "Link9454",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2udu74/irreligious_calendar/",
        "text": "",
        "created_utc": 1422770509,
        "upvote_ratio": ""
    },
    {
        "title": "Had a very rough and sad day today. Have been excommunicated from family.",
        "author": "The_PhilanthRapist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2udndu/had_a_very_rough_and_sad_day_today_have_been/",
        "text": "To start with a brief introduction to myself, I was raised in the bible belt with a military/minister of a father and a school teacher of a mother, I was always brought up in church from an early age.\n\nWhen I was about 14, I started asking questions to my father about the legitimacy of the bible. I always thought that stories such as Noah's Ark and the story of Moses just didn't feel right. I started to feel like there was a huge disconnect between what I was taught of the bible and my modern life. I had trouble comprehending all of these fantasy situations in a modern world where this type of \"magic\" simply doesn't show up around you. My questions and skepticism were met with anger from my parents, which resulted in them treating me like I was defective or in need of some type of constant punishment. After a few years of this, I decided to keep quiet about my convictions, and giving a polite nod to their notions simply managed me to stay under the radar of their wrath.\n\nI moved to another state in order to get a fresh start and in the process and had a kid. It was something that I wasn't quite ready for but It has been a great experience for me being a dad. Having the child has awakened the beast in my family. I can't go a day without a text about a prayer, or my mother asking me if she can take my child to church when they visit. I want to keep my child out of church, especially when she is not old enough to make that decision for herself. I have been growing frustrated with my mother telling me that my atheism is simply a fad that I will grow out of, or a product of my \"rebellion.\" I have two brothers who are bible thumping clones of my father, and they are treated like the sons who turned out the way that they were supposed to, and rewarded for that.\n\nAny time any member of my family agrees to discuss religion with me, they immediately get angry the moment I make a point that doesn't coincide with their beliefs. My father has this line, \"you are not listening, you never listen.\" I feel that his version of listening is agreeing with him, I have tried to explain to them that debate should be open about any issue in life.\n\nHave any of you guys ever been treated with utmost hostility from your family upon telling them that you are an atheist? It saddens me to think that our bond as blood isn't as significant to them as their choice of religion. I was told by all of them today  that they are basically cutting their losses with me, which means eliminating their communication with me for the most part. They all told me that they were deeply hurt and betrayed by me, and basically used nothing but ad hominem attacks against me.\n\nI am honestly to the point that I might be fine to not speak to them anymore. Nothing has messed with my head more than being treated like I was defective my entire teenage life due to not readily accepting what was told to me without question.\n\nI was brought into the church at birth, and was never given an alternative viewpoint until I had the desire to search for myself. I know I chose the painful path with my family, but I feel like deep inside, my intellectual freedom was more sacred than harmony with them.\n\nI always find myself having trouble comprehending the value of faith as a virtue. Why should I be punished by them for not having faith? Why should I have faith? Why should they? Nothing in this world short of highly debatable and unlikely stories gives their cause any semblance of a solid base to accept it based on.\n\nHonestly any conversation or support will be very helpful.",
        "created_utc": 1422766041,
        "upvote_ratio": ""
    },
    {
        "title": "American views on atheism in daily life",
        "author": "hemayya",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2udjek/american_views_on_atheism_in_daily_life/",
        "text": "I'm from a Western European country, where (at least in the cities) mentioning that you don't believe in God is about as uncontroversial as saying you like or dislike a particular type of food or vacation destination.  Not everyone will agree with you, but few people will take offense or be surprised.  Atheism (or at least nonaffiliation with organized religion) is the majority position, and if anything it's religious people who may sometimes be made to feel like they have to defend themselves.\n\nI've been living in the US for several years now, but I still don't have a handle on how acceptable it is here to talk about these things.  I get the sense that at least in a professional setting, talk about religion is almost entirely off limits, although it is acceptable to discuss the more cultural aspects of religion, such as religious holidays and membership of a church.  People may make vague comments such as \"I'm not very religious\" (which doesn't necessarily imply atheism), but that's about as far as it goes. \n\nIn a social setting, with good friends, on the other hand, as far as I can tell it's quite acceptable to talk about religion, at least in situations where you can be pretty sure that none of those present are strong believers.\n\nBut what about the gray area in between?  I'd be curious to get some more color on how careful one needs to be in broaching this topic even in passing.\n\n(By way of background: I'm not an aggressive atheist.  I don't really spend a lot of time in my daily life thinking about atheism and I don't particularly find myself wanting to discuss the topic.  But sometimes it just comes up and I'm wondering how strictly it needs to be avoided.  It's probably also relevant to the question that I'm in New York City.)",
        "created_utc": 1422763520,
        "upvote_ratio": ""
    },
    {
        "title": "Sup guys, I'm looking for a certain philosopher but I don't remember what his name was.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2udirv/sup_guys_im_looking_for_a_certain_philosopher_but/",
        "text": "",
        "created_utc": 1422763132,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on an uncomfortable situation with a religious boss",
        "author": "thelittleboynextdoor",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2u89nl/thoughts_on_an_uncomfortable_situation_with_a/",
        "text": "I want to preface this by saying my boss is a genuinely good guy and doesn't deserve anything bad to happen to him. When I got the job, I knew he was very strong in his convictions because literally the first thing he said to me in my interview was, \"My name is _____, and christ is my savior.\" I did and have looked past it since then because living in the bible belt has given me the ability to do that. He doesn't know that I'm not religious.\n\nNow for context: I was in my office today and my boss and I were talking about some family issues I've been having. He was giving me advice and he started talking about god and miracles (like he normally does). He starts telling me that god has given me a strength that I can use to help my family and if I just accept that god has given me this ability that I will be able to use it to use it to its fullest strength. Just things like that. This is what made me uncomfortable: he then starts saying, \"I don't know where you stand with god, but he's working through you. That tells me you're allowing him to make these things happen.\" At this point, I don't know what to say. I just smile and say thank you. He repeats the whole, \"I don't know where you stand with god\" bit a couple more times and since I'm just smiling and nodding, he moves on.\n\nI felt like he was subtly asking about my beliefs, and it's just something I don't want to get into. I respect my boss a great deal and I don't want that to affect our work relationship. Has anyone else been in a situation like this or does anyone have advice for the next time this happens (because I'm sure it will).",
        "created_utc": 1422646936,
        "upvote_ratio": ""
    },
    {
        "title": "What are you views about Stephen Fry on God in this interview?",
        "author": "therationalparent",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2u7ypi/what_are_you_views_about_stephen_fry_on_god_in/",
        "text": "https://www.youtube.com/watch?v=-suvkwNYSQo \n\nPeople criticise people like Dawkins for being too aggressive, but it seems to me that Fry is going for the jugular here, and doing it with a [devout?] Catholic. Do you think this is a good way to promote atheism? And do you think his arguments are sound?",
        "created_utc": 1422641971,
        "upvote_ratio": ""
    },
    {
        "title": "Truly curious: why not just call your religion Science or Darwinism?",
        "author": "musicallymodernmaven",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2u6wd2/truly_curious_why_not_just_call_your_religion/",
        "text": "So many atheists I've spoken with are very up on the theory of evolution. As more of a Christian existentialist (because there really IS no term for what I actually am... a loving, Believing, doctrination-opposed human) with an incredibly open mind, I've been listening to Dawkins' The God Delusion (audible [dot] com) at the suggestion of a new atheist friend. I've also made it my personal business to seek out arguments on both ends, but I'm looking for only the most level-headed, non-evangelical arguments (Dawkins was an incredibly bad place to start). I've a rash of books I bought yesterday that I'm happy to list once I'm home, if anyone is interested, to suggest more or offer opinions on them.\n\ntl;dr - Dawkins and his little harpie are great and persuasive orators who are vehemently bent on \"proper Darwinian terms,\" as well as scientific fact. Anything that's provable. I get it! I love me some science. But this projected version of atheism teeters more toward theism, IMHO, because of how insistent they are on believing evolutionary science. Truly, evolution and science are also beliefs. One must choose to believe pretty much all things or basically be nihilist. Why not, then, call yourselves simply \"Scientist\" or \"Darwinian\"? That is your theos.\n\nEdit: (A response to a very nice commenter who asked about my beliefs and what I am trying to accomplish:)\n\"Not necessarily, though I appreciate your deduction and the fact that you didn't tear my little spiel apart. I am trying to learn. I consider myself more of a Christian existentialist, but you're right, I don't think \"Christian\" in the definition we find in the dictionary is appropriate for me. Perhaps I'm a deist. I am seeking for the proper definition on some level, but, at the same token, I don't feel like a definition is absolutely necessary. What I do believe in is tolerance, acceptance, love, good works, and that I have God looking out for and loving me, no matter what. To a certain extent, I feel that if I gave that up, I would find myself in crisis, yes. Life has dealt an unfair hand, and without anyone to love me, I'd give up on life. Since I believe everything happens for a reason and that the human body is proof of intelligent design, I choose to believe in God. ANYWHO. This got longer than I wanted, and fast, but I appreciate you taking the time to look through and find the actual issue.\"\nThis post is not a perfect argument. I do not find Dawkins and the woman speaking in the recorded version of his book to be pleasant to listen to. However, I've already purchased the audiobook, and I've got about 4 hours left to listen to as of this evening. I am trying to learn. Your focus on semantics and some seriously insulting responses are making it difficult for me to want to continue learning about your unbelief. If you aim to teach others about why atheism is superior, think about your approach, and I will examine mine, as well, moving forward.\n",
        "created_utc": 1422620805,
        "upvote_ratio": ""
    },
    {
        "title": "Do you want to know if your views in regard to the concept of God are logically consistant? Check this out.",
        "author": "juanker52",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2u5chj/do_you_want_to_know_if_your_views_in_regard_to/",
        "text": "Tonight I felt kinda philosophical so I ended up on a very good page called http://www.philosophyexperiments.com/ which many of you probably already know, and I found two tests that in my opinion are very interesting.\n\n\nBattleground God test: http://www.philosophyexperiments.com/god/Default.aspx\n\nIn this activity, you’ll be asked a series of questions about God and religion. In each case (apart from Question 1, where \"Don't Know\" is a possible answer), you need to answer either True or False. The aim of the activity is not to judge whether your answers are correct. Rather, our battleground is that of rational consistency. This means to get across without taking any hits, you are required to answer in a way that is rationally consistent. In other words, you have to avoid choosing answers that contradict each other. Also, if you answer in a way that is rationally consistent, but which has strange or unpalatable implications, you’ll be forced to bite a bullet - accept something many find unpalatable and would view as being a major problem.\n\n\nTalking with God test:\nhttp://www.philosophyexperiments.com/euthyphro/Default.aspx\n\nIn this test you'll be asked questions in regard to the nature of god (in a fairly humurous way) and in the end you will be told if the answers are logically consistant and how traditional your definition of god is.\n\n\nBonus: http://www.philosophyexperiments.com/wason/Default.aspx\nI really liked this one, it's goal is to check if you can logically predict the answers to soe questions.\n\n\n\nSo check them out if you want, and discuss your results and opinion in the comments. Sorry if this post is not appropiate for this subreddit, feel free to remove it if that's the case. Note that I am not affiliated with this website in any way.",
        "created_utc": 1422581191,
        "upvote_ratio": ""
    },
    {
        "title": "Your thoughts on \"evangelical\" atheism?",
        "author": "musical_bear",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2u4uxm/your_thoughts_on_evangelical_atheism/",
        "text": "Some quick context. I am an ex-fundamentalist Christian. As a Christian I always envied those who could spread the \"gospel\" but was never really able to do it myself. I chalked it up to just being shy.\n\nI've been an atheist for 3 years now. For those entire 3 years I've been extremely passionate / absorbed in my research of different beliefs, different religions, and Christianity from the unbiased perspective of an observer.\n\nI've seen my entire life flip on its head following my deconversion. My views on \"morality,\" life, and almost every \"big\" subject were completely reversed in my deconversion.\n\nWhen my eyes were finally opened to the secular world, It honestly felt like what Christianity had fooled me into thinking it had already given me - that I had been \"born again.\"\n\nThe irony keeps stacking here, but now, more than ever, I feel like I've found the \"good news\" and hope for opportunities to spread it. I get excited when I'm approached by evangelicals. I get excited when a group of people gets around to talking about religion and someone finally asks me: \"What do you think?\"\n\nThus far I only bring up my thoughts when specifically asked, but why? Why not do what Christians do and walk up to group doing a bible study in a coffee shop and ask if they would mind talking to you for a little bit? Just like when I was a Christian, I find myself thinking \"I have this incredible, life-changing news. Why aren't I actively spreading it?\"\n\nI know this varies from person to person, but I strongly feel that when I was a Christian, I would have appreciated someone polite and friendly coming up to me and introducing me to atheism. Part of why it took me so long to deconvert is because I don't think I had a meaningful conversation with a non-Christian for my entire Christian life. Sheltered ignorance.\n\nA couple of evangelical Christians approached me when I was alone in a coffee shop two nights ago and I found myself amazed at how I could use even the most basic counter-apologetics and they seemed to have never heard them before. They acted surprised when I told them about slavery and genocide and implied rape in the bible. These guys were university students and active evangelicals, and yet had never been exposed to anything other than Sunday morning Christianity, or perhaps the less common undecided individual. How easy it was to get them thinking differently encouraged me to think about how public I should be with my beliefs differently.\n\n\nSummary/TLDR Section:\n\nThis got longer than I wanted, but what are your thoughts on a more active, evangelical style of talking about atheism? Sometimes even the idea of spreading atheism is mocked, even by atheists. Do you guys agree? You can't force someone to think like a skeptic, true, but sometimes even people with good thinking skills just haven't been exposed to the right information. It happened with me and many of you, I'm sure. Thoughts on all of this? Thanks for the read, and time.\n ",
        "created_utc": 1422572593,
        "upvote_ratio": ""
    },
    {
        "title": "Came out on Facebook just now, kind of freaking out.",
        "author": "Mrmaybesomething9",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2u45ut/came_out_on_facebook_just_now_kind_of_freaking_out/",
        "text": "I've been an atheist for quite some time now, but I've kept it mostly under wraps because although I'm not financially supported by my parents, I know that them knowing would crush them. I know that most people would say it's better to be honest with who you are than spare feelings, but I just couldn't bring myself to do it. \n\nWell, long story short I've had a terrible day and something just snapped and I wrote out a paragraph about being an atheist. I thought about chickening out, but said screw it and hit post. Now I'm getting jittery and nearly shaking waiting to get the call from my parents (not to mention messages from concerned friends). I know I probably should have told them in person, but it's been done and the waiting is killing me. I guess since I know I won't get any congrats from the people on my Facebook I'm kind of hoping to at least get some words of encouragement here. It was literally the hardest thing I've ever had to say. \n\n**Update**\nThanks for the support guys! I would like to address just a few things real quick because I'm the type of person who can't stand when he's misunderstood. Firstly, I have about 15 Facebook friends and they are all either good friends or people who used to be very good friends so I'm not worried at all that anyone will stop talking to me. I'm still expecting the occasional fight for my soul message, but that's about it.\n\nOn that note, the reason for my distress might sound like not much to some people, but it has prevented me from telling anyone except two people for nearly a year now. Mainly as I stated, I can't stand thinking about my parents reaction and how heart breaking it must be for them. I did end up calling them before they saw it to tell them personally because, let's face it, it was a bitch move to let them find out on Facebook. They were too shocked to really say much, but I'm going over there tomorrow to talk it over with them and explain my reasons (although I plan to focus more on \"I'm still the same person blah blah blah...\" as I don't want to get into a debate about it with them. There would be no point in that.\n\nFinally, to the people saying something along the lines of \"why'd you even say anything?\" I suppose that's a fair question for some people. But for someone like me, who has spent his entire life deep in the belly of a religious family and social circle, it is definitely something that needs to be publicly stated. I am constantly hearing people talk religion to me, and just saying \"well, seeing as I don't believe...\" would be a weird as hell way to let them know. It was best to do it all in one, fell swoop and get it over with so everyone is on the same page. And I did it on Facebook because quite frankly it's the only social network I'm on and it's the only way I even communicate with half these people anymore.\n\nAs for replies, well, I didn't get any. Not one. I got a few likes from a few like-minded people, but otherwise it might as well have been invisible as far as response. Not at all what I was expecting. I figure I'll get a few messages at some point, maybe they don't want to acknowledge it cause \"if I can't see it it doesn't exist\"? Who knows.\n\nAnyways, thank you so much to everyone who had nice things to say or similar stories to tell! It feels great to be out with it. A little anxious about meeting my parents, but I'm more positive about it than I was the other day.\n\n**tl;dr** I came out. Freaking out waiting for response. Would really appreciation words of encouragement. ",
        "created_utc": 1422561313,
        "upvote_ratio": ""
    },
    {
        "title": "In Science class at a University level can you leave to pray?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2u2ce2/in_science_class_at_a_university_level_can_you/",
        "text": "",
        "created_utc": 1422521911,
        "upvote_ratio": ""
    },
    {
        "title": "When politicians say stuff like \"Man can't change climate\" are they talking from their strong 'faith' or just using 'god' as a scape goat to push an agenda.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2u0kxh/when_politicians_say_stuff_like_man_cant_change/",
        "text": "",
        "created_utc": 1422485305,
        "upvote_ratio": ""
    },
    {
        "title": "Why aren't more atheists also apatheists?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2u0f97/why_arent_more_atheists_also_apatheists/",
        "text": "",
        "created_utc": 1422482782,
        "upvote_ratio": ""
    },
    {
        "title": "I just found this, and wasn't sure if it has been posted. James Randi is to retire from JERF.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2u08y3/i_just_found_this_and_wasnt_sure_if_it_has_been/",
        "text": "",
        "created_utc": 1422480030,
        "upvote_ratio": ""
    },
    {
        "title": "Bobby Jindal threw a Prayer Revival to Launch his Run for President. It was a bust",
        "author": "repealcreationism",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2twabz/bobby_jindal_threw_a_prayer_revival_to_launch_his/",
        "text": "",
        "created_utc": 1422399903,
        "upvote_ratio": ""
    },
    {
        "title": "Disproving God(s) using the law of non-contradiction?",
        "author": "Almostcomatose",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tw4r2/disproving_gods_using_the_law_of_noncontradiction/",
        "text": "I always hear that you can't prove or disprove a god. If I were to define god as a married bachelor, wouldn't the law of non-contradiction prove that god to not exist? Or am I misunderstanding the law somehow? It would seem to me that the notion of being unable to disprove god would only apply to gods that are defined in such a way as to avoid logical contradiction. I've never really heard this argument before though and that makes me think maybe I am missing something? What does r/TrueAtheism think?",
        "created_utc": 1422397532,
        "upvote_ratio": ""
    },
    {
        "title": "Sorry for the resubmit, Throwaway Questions Regarding Religious Guilt and Sexuality Crossposted r/advice",
        "author": "anontossquestioning",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tw3so/sorry_for_the_resubmit_throwaway_questions/",
        "text": "I didn't know where else to go on reddit to post these questions as they are an intersection between sexuality, Christianity, and some potentially unpopular opinions that I didn't think those in other subreddits would be willing to confront.\n\nI have tried to be \"Christian\" during my adult life because I like the idea of Jesus. I've tried for a long time to just extract the morally acceptable parts of the bible, but I'm feeling more and more every day like this concept of a forgiving, loving, savior deity is inseparable from the problematic culture of Christianity, including other things that occur in the bible. I know about the argument that we cannot judge what is happening in the bible by today's standards, but if people are literally using this book to guide their lives now, how does that logic work?\n\nThere have been a lot of problematic biblical texts and ideas I've forgiven in my quest to follow Jesus, but I keep coming back to this: \"How do I reconcile my body with my faith?\" I am biologically female and identify as female gender wise but have always been a very sexual person. I need contact with my SO to feel \"in love\". Sexuality is just something super important to me. There are plenty of factors out there that oppress and discourage female sexuality and in my life I've worked to develop a healthy relationship with my body and my sexuality, but I cannot overcome the guilt and alienation caused by Christian morality. How can my body belong to me, how can I have a healthy relationship with my body, if it is something that will lead to sin? I feel guilty for experiencing the natural biological processes of my body.\n\nHow do I \"fix\" this dynamic that has been created? It is very likely that I will stop trying to be Christian because of these irreconcilable issues but I feel guilty for that as well. I feel brainwashed, as if I stay because I am actually afraid of damnation, even though I logically understand the fallacy of the concept.",
        "created_utc": 1422397113,
        "upvote_ratio": ""
    },
    {
        "title": "Throwaway Questions Regarding Religious Guilt and Sexuality",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tvthx/throwaway_questions_regarding_religious_guilt_and/",
        "text": "I am not coming here as an atheist-- I'll be up front about that. I didn't know where else to go on reddit to post these questions as they are an intersection between sexuality, Christianity, and some potentially unpopular opinions that I didn't think those in other subreddits would be willing to confront. \n\nI have tried to be \"Christian\" during my adult life because I like the idea of Jesus. I've tried for a long time to just extract the morally acceptable parts of the bible, but I'm feeling more and more every day like this concept of a forgiving, loving, savior deity is inseparable from the problematic culture of Christianity, including other things that occur in the bible. I know about the argument that we cannot judge what is happening in the bible by today's standards, but if people are literally using this book to guide their lives now, how does that logic work?\n\nThere have been a lot of problematic biblical texts and ideas I've forgiven in my quest to follow Jesus, but I keep coming back to this: \"How do I reconcile my body with my faith?\" I am biologically female and identify as female gender wise but have always been a very sexual person. I need contact with my SO to feel \"in love\". Sexuality is just something super important to me. There are plenty of factors out there that oppress and discourage female sexuality and in my life I've worked to develop a healthy relationship with my body and my sexuality, but I cannot overcome the guilt and alienation caused by Christian morality. \n\nHow can my body belong to me, how can I have a healthy relationship with my body, if it is something that will lead to sin? I feel guilty for experiencing the natural biological processes of my body. \n\nHow do I \"fix\" this dynamic that has been created? It is very likely that I will stop trying to be Christian because of these irreconcilable issues but I feel guilty for that as well. I feel brainwashed, as if I stay because I am actually afraid of damnation, even though I logically understand the fallacy of the concept. ",
        "created_utc": 1422392692,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists, why is the burden of proof on the Christian to provide evidence of God's existence, but the burden of proof is reversed when a woman accuses a man of rape?",
        "author": "reddithon",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tvt0t/atheists_why_is_the_burden_of_proof_on_the/",
        "text": "",
        "created_utc": 1422392498,
        "upvote_ratio": ""
    },
    {
        "title": "\"No, Astrobiology Has Not Made the Case for God\" by Lawrence M. Krauss",
        "author": "lampgate",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tuyr4/no_astrobiology_has_not_made_the_case_for_god_by/",
        "text": "",
        "created_utc": 1422379860,
        "upvote_ratio": ""
    },
    {
        "title": "Imagine, for a moment, that God and Satan are real, and that the Christian Bible is both an accurate portrayal of historical events and was directly inspired by God:",
        "author": "BigPoopBreakfast",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tutfq/imagine_for_a_moment_that_god_and_satan_are_real/",
        "text": "It would be fairly obvious reading through it that God was the bad guy, and was consistently using it to smear Satan.\n\nRight from the get-go, God creates humans and intentionally gives them intelligence and curiosity. Then, he deliberately denies them knowledge/enlightenment. Right from the get-go, not only is he pissing all over everything that we consider to be important in the modern age, he is obviously and deliberately setting humans up for failure. Then Satan comes along, and actually fucking tries to help bring them out of their ignorance. For going along with it, God punishes EVERY HUMAN FOREVER. Even though this book is written from God's perspective, and he gets to twist and manipulate the story any way he wants (he literally depicts Satan as a fucking snake!), he *still* ends up looking like the bad guy.\n\nShortly thereafter, God just up and kills almost everyone. It's okay, though -- you guys were totally acting like dicks and you had it coming.\n\nThen, God just fucks with everyone for a while. \"Hey you! Kill your son!\" or \"Heh, I wonder how many pointless and arbitrary rules I can get them to follow -- LOL that one just beat the other one to death for gathering firewood to keep his family warm on my special day\", or my personal favorite \"He raped you? Marry him LOL!!\".\n\nWe then get to see how petty, jealous, and insecure God is. Remember that significant other you had that was always going through your phone and would flip their shit when they had any inclination that you looked at, talked to, or thought about anyone of your preferred gender that did not happen to be them? Well, God takes that and runs with it by creating a list of the ten most important rules for us minions to follow, but then makes THE FIRST FUCKING FOUR all about him (which, unfortunately, bumped \"do not rape\" down to #11, so it didn't make the cut). Replace \"God\" with \"Dear Leader\", and the Ten Commandments is basically the North Korean legal code. Also of note -- this would have been a great time to let people know that slavery wasn't cool, but he was all \"Ehh, fuck it, they'll figure it out on their own after a few thousand years of virtually immeasurable suffering.\"\n\nAfter that, he sends his minions out on a reign of terror -- murdering, raping, and pillaging across the Middle East. Sure, this was just sort of how things were done back in those days, but an all-powerful God would clearly be smart enough to figure out a way to secure a home for his people with a whole lot less rape. The only rational explanation, then, is that he just gets off on all of the murder and rape, especially in light of all of the previous behavior.\n\nEventually, God does wise up. He realizes that all of this murder is creating a PR problem, and that people don't quite feel guilty enough to follow him. So, after some brainstorming he decides that Pablo Escobar's [plato o plomo](http://www.urbandictionary.com/define.php?term=silver%20or%20lead) was a great model to follow.\n\nJust like Pablo Escobar funding schools and feeding all of the poor people around him to increase loyalty, God sent down his PR consultant Jesus to feed poor people, heal sick people, and tell people to be nice to one another. While everyone's guard was down, it was easy to sneak in the message of \"all you have to do is be on my team, and you will be rewarded forever, but if you are on the other team, you will be tortured for all eternity.\" Note, however, that they never specify what they mean by Heaven and Hell -- one is just \"being with God\", which they vaguely make sound like it is the best, and the other is \"being without God and with Satan\", which they pitch like it is the worst type of torture imaginable. Well, of course you would fucking say that -- it's your book, and Satan is the competition! That is the oldest sales tactic in the book: \"Don't want to die in a horrible mass of twisted metal and fire? Buy Chevrolet, not Ford\".\n\nNow, the most obvious scenario in all of this is that the whole thing is a fabrication created by a combination of deluded and/or deliberately malicious humans, but I would submit that the true nightmare scenario for a Christian would be for the Bible to actually be true, because there is no way that God is not the villain in that book.",
        "created_utc": 1422377576,
        "upvote_ratio": ""
    },
    {
        "title": "The Big Three",
        "author": "TheLoudThoughts",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tuk5d/the_big_three/",
        "text": "It seems the only religions with complaints leveled against them are the Big Three (and then primarily Christianity) on this subreddit. As a pagan, I feel like you guys don't give us any love. In the interest of drumming up a little conversation about what you guys as atheists think of paganism, I ask you, why is that you focus most against the Big Three (for reasons other than their being the most popular religions in the world)? Why does paganism not pique your interests much? Is it simply not on your radar?",
        "created_utc": 1422373330,
        "upvote_ratio": ""
    },
    {
        "title": "The Big Three",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tuing/the_big_three/",
        "text": "",
        "created_utc": 1422372587,
        "upvote_ratio": ""
    },
    {
        "title": "It occurred to me - according to the Bible, in Jesus' time the world was only 4 thousand years old, and half of that time has passed again since then. Christians have been waiting for a third of the length of existence for the second coming.",
        "author": "letsgocrazy",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tucdr/it_occurred_to_me_according_to_the_bible_in_jesus/",
        "text": "I'm reading [Zealot by Reza Aslan](http://www.goodreads.com/book/show/17568801-zealot) and it talks a lot about how the \"kingdom of heaven\" was Jewish code for \"we're going to kick out the Romans and control our country again and have the theocracy we want\" - the book talks about Jesus often mentioning that that revolution was happening then and there, he was an instrument of it - and \"near\" was months and years, not centuries and millennia.\n\nMuch of Jesus' work has been ret-conned to seem more ethereal and abstract than it was - but it got me thinking - even to the truly devout, it's been 2000 years already. Half of the entire length of the universe to the Zealous at that time.\n\nThey have literally been waiting for one third of the entire history of creation for \"near\" - surely by this point they must be questioning whether the bus is actually coming.\n\n",
        "created_utc": 1422369299,
        "upvote_ratio": ""
    },
    {
        "title": "Days vs. \"Days\" in the Bible?",
        "author": "J0NNYquid",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tu694/days_vs_days_in_the_bible/",
        "text": "So I was recently watching a debate (sadly I can't remember which) and one of the points brought up by the person arguing against religion (perhaps it was Dawkins?) was how absurd it was to believe that the creation story in Genesis is in any way accurate.  Particularly the silliness that is believing the entire world was created in 7 days.   \n\nThe rebuttal to this was that when the Bible says 7 Days, it doesn't really mean \"Days\" as in one 24 hour period. \n\nHowever, what is the rationale behind the Sabbath then?  It's supposed to be the \"Day\" god rested, and is thus supposed to be kept holy?  What arguments have you heard in regards to, what appears to me, to be a big contradiction in logic?  I mean, keeping the Sabbath holy is one of the Ten Commandments.  How can \"Days\" mean one thing in the creation story, and another thing later on in the bible? \n\n\n\n",
        "created_utc": 1422365368,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not a victim, and I'm not perfect",
        "author": "pattch",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2trb83/im_not_a_victim_and_im_not_perfect/",
        "text": "Hey guys,\n\nI was raised christian and have since left the church/my family. I've had a very bumpy time with them and within the last year I have made the decision to stop talking with them. Although it's for the best for myself, and hopefully for them as well, part of me has always felt that I was victimized for having been raised with grave misconceptions about life and the world. \n\nThe longer I'm away from my parents, the more sane and stable I feel, and have been making a point to live in the moment as much as possible, instead of sitting around hoping for God to come down and save me. That kind of mindset really influenced a lot of decisions/actions I made growing up, and I think it's a bad pattern for myself.\n\nNow that I'm maturing a little more, I no longer feel adversarial towards my family or the church at large. I am not their victim, because I don't feel like I am the one who is forced to live their life on someone else's terms. I am the creator of my own fate, and I can live as I see fit, and whatever morality or lack thereof I attain is subject to no one's scrutiny but my own. \n\nFor the majority of my life I've also felt that I had to be as close to 'perfect' as possible, and whatever problems I encountered were not my fault, and that when I faltered it was evidence that I somehow wasn't actually capable of making my mind up about anything. In some sense, I hid and closed myself off to genuine connections to other people because I wouldn't be able to choose the 'better' path when in their company.\n\nPart of choosing my own set of morals, I think, involves being open to failures. If I am not allowed to fail, I'm not allowed to learn what is right and wrong for myself. And regardless of my perception of my failures, I am not a perfect human being, there is no such thing. It's perfectly fine to remain imperfect.\n\nSorry that this is really all over the place, I just needed a place to share my feelings about post-religious morality.",
        "created_utc": 1422304190,
        "upvote_ratio": ""
    },
    {
        "title": "How do people usually die?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tqfpu/how_do_people_usually_die/",
        "text": "",
        "created_utc": 1422290456,
        "upvote_ratio": ""
    },
    {
        "title": "With what questions do Christians struggle the most?",
        "author": "Litn1337",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tpzk2/with_what_questions_do_christians_struggle_the/",
        "text": "",
        "created_utc": 1422282060,
        "upvote_ratio": ""
    },
    {
        "title": "Religious Discrimination from a Potential Landlord",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2towie/religious_discrimination_from_a_potential_landlord/",
        "text": "I am attempting to rent a house, but upon contacting the landlord, he stated that he only wanted to rent to a \"God-fearing\" family.  \n\nHas anyone ever dealt with something like this?  It will be myself, a straight guy and two gay co-workers, and I don't really want to lie.  \n\nHowever; this is the perfect house, price, and location for us and I don't want to lose it.  Is it legal for this person to discriminate and not rent to us based on our religious affiliation?  I'm not even sure where I would start to research something like this.",
        "created_utc": 1422247651,
        "upvote_ratio": ""
    },
    {
        "title": "What are your thoughts on people who are pro-life and pro-capital punishment?",
        "author": "Samesyo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tnxxa/what_are_your_thoughts_on_people_who_are_prolife/",
        "text": "I find it sort of hypocritical to be both. Primarily I've seen this in the evangelicals. I understand the unborn fetus is not comparable in the sense that an established sentient person has committed a crime and the eye for an eye mentality only applies to that person. Where do pro-lifers draw the line in what is justified for capital punishment, and why do SOME (not all) feel the need that one is justifiable while the other is not. CMV",
        "created_utc": 1422229370,
        "upvote_ratio": ""
    },
    {
        "title": "What are you're thoughts on religious people who are pro-life and pro-capital punishment?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tnwp3/what_are_youre_thoughts_on_religious_people_who/",
        "text": "",
        "created_utc": 1422228764,
        "upvote_ratio": ""
    },
    {
        "title": "The humanist movement - What do you guys think of it?",
        "author": "SixFeetThunder",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tnc9l/the_humanist_movement_what_do_you_guys_think_of_it/",
        "text": "For those who are unaware: http://en.wikipedia.org/wiki/Humanism\n\nI really like the idea of connection to other humans using rationality and reason above all else. I think it takes the best parts of religion (a sense of community and love) and the best parts of secularism (rational thought and evidence-based decision making) and combines them to a lovely \"doctrine.\"",
        "created_utc": 1422219056,
        "upvote_ratio": ""
    },
    {
        "title": "Don't know the best way to respond to \"the more you read/research God then the more you continue to put God in a smaller box and make yourself bigger than Him.\"",
        "author": "BruceIsLoose",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tn0h0/dont_know_the_best_way_to_respond_to_the_more_you/",
        "text": "The title gives sums it up the comment that was made to me pretty well. I didn't know the best way to respond at that second and am still mulling over a \"better\" response to it. It didn't stump me but I felt I didn't respond as best as I could when I did. Basically my response was more or less \"yupp God gets smaller the more you learn.\"\n\nHow would you respond to this statement? Which direction would you use it to springboard yourself into a more solid point? \n\nEdit: Thank you all so much for your responses. ",
        "created_utc": 1422213486,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion: Does science, or can it ever really validate atheism?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tmv9p/discussion_does_science_or_can_it_ever_really/",
        "text": "Correct me if I'm wrong, but atheists *usually* attempt to refute religion by citing established scientific theories/discoveries/observations. The problem with that lies in the fact that such theories/discoveries/observations only disprove claims made by existing religions; so, for instance, if some \"prophet\" came up with a diety that accepts evolution and does not attempt to defy science in any way whatsoever, would science be able to disprove the exisence of such a deity?\nI'm an atheist, and I don't believe simply because logic doesn't allow me to: the usual \"why would suffering exist...\" stuff. However, I realize that the argument can go either way; There are people who **believe** *all that suffering, etc.* \"happens for a reason,\" and I'm sure they also believe that they have enough reason to do so, just like I believe that I have enough reason to not do so.\nI'm just curious; I tend to judge people who say stuff like \"I watched a physics documentary, and stuff didn't add up, so I became atheist,\" because that just seems sort of vague and poorly thought out, so I'd love to hear what people like that really think.",
        "created_utc": 1422210974,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think it's unreasonable for Christians to get mad when you say that some contents of the bible are un-logical or absurd?",
        "author": "FearlessClone",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tludy/do_you_think_its_unreasonable_for_christians_to/",
        "text": "A few days ago I was having an argument with a Christian on reddit, and all the way through the conversation I didn't insult him, but he was getting a little bit cocky and then I said that from a neutral standpoint some contents of the bible like talking snakes are absurd.\n\nHe ofcourse went  butthurt mode, saying that I am insulting  his religion, how this is very bad of me, that it's not good when I insult something he believes.. I deleted my comment because I panicked not to turn into an asshole.\n\n\nNow my question is, how are you supposed to argue with a christian if you can't say that walking on a water is completly stupid and impossible?\nThey always become mad and suddenly they are the 'victims of discrimination'\n\nJust pisses me off",
        "created_utc": 1422185136,
        "upvote_ratio": ""
    },
    {
        "title": "A fun debate question for Christians.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tlg70/a_fun_debate_question_for_christians/",
        "text": "I posed this question to my very religious father and he could not answer it, it stumped him. My very intelligent and atheist friend came up with the best answer but even so my point remained. \n\nThe prelude and question(s): You're a Christian who believes in heaven and hell right? (Most Christians are gonna say yes) Say you live your life in accordance with your religious teachings, by that standard you will go to heaven where you will live forever. But on Earth you have loved ones, and some of those loved ones have different religions or no religion at all. That means they will go to hell (or purgatory maybe) Is the place you're going to truly heaven if you know ones you love are being tortured for all eternity? \n\nThe best answer I've heard (atheist friend) was that heaven can be personal, and all your loved ones can be there. Ok, good answer but, the loved ones you see are your personal creations of them, and therefore aren't really your loved ones; they're rather personal simulations of them. \n\nAny input? ",
        "created_utc": 1422169499,
        "upvote_ratio": ""
    },
    {
        "title": "After years of debating, discussing, and arguing the factors of pro religion vs antitheism, I just wanted to ask one question that doesn't seem to get brought up much; Are there any atheists who are perfectly fine with a religious society even though they don't believe?",
        "author": "MartyStuartsNeck",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tkvdv/after_years_of_debating_discussing_and_arguing/",
        "text": "",
        "created_utc": 1422155430,
        "upvote_ratio": ""
    },
    {
        "title": "Homeschooling",
        "author": "gooddogisgood",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tjuig/homeschooling/",
        "text": "So I had a really fun morning. I was asked to be one of the judges for a Lego competition sponsored by the local division of a national construction association. The kids entered in their grade level (K-6th grades) and were asked to create something construction/building/tool related in 45 minutes. All of them had the same number of Legos, and they could choose 3 out of 4 additional materials (string, foil, paper, or a stone). As the kids finished, they would raise their hand, and a judge for their grade level would come and interview them about their project. Judging was based on creativity, full use of the materials, and verbal presentation of their project, among other criteria. \n\nThe winning kid from my grade level (4th grade) made the most amazing thing: a cat-shaped mobile vet clinic that would roam around with a string antenna that would detect homeless cats and dogs, take them in and care for them, and then adopt them out. One of the questions we asked was what they wanted to be when they grew up. This kid obviously wanted to be a vet. There were other cool projects, like several cranes, a wrecking ball, a guitar for a kid who wanted to be a country music star, a bridge or two, and a cruise ship. I was very impressed with the level of creativity among these 4th graders. \n\nThen I interviewed my last kid who was a shy, home-schooled girl. She made a bridge, using only a quarter of her Legos, and had some weird story about groups of people who were at war over money. But one person was a Christian who loved Jesus and convinced them they needed to come together on the bridge and share the money (there was a foil bag of money on the bridge). She had written on her form that she wanted to be a vet / missionary. I asked her why she wanted to be a vet. She said she really wanted to be a missionary, or \"whatever God tells me to be.\" \n\nAfter such a great morning of talking with kids, this was just so sad and disheartening for me. The parents were not allowed in the room during the competition, but I could just imagine her mother standing there with pride about her Jesus story. Seriously, fuck homeschooling and the unbelievable amount of brainwashing that must go on there. This girl couldn't have an original thought if she tried, based on what her parents must be drilling into her brain. The parents can't even let them go to public school for a decent education? I just hope she'll grow up and learn to think for herself and rebel against this kind of bullshit. How can parents think this is the best they can do for their children? I so wanted to plant a seed of doubt into this kid, but figured it's not my place and not the time. Is there anything I could/should have said to someone this age? I don't have kids myself so I never know about these things. ",
        "created_utc": 1422135541,
        "upvote_ratio": ""
    },
    {
        "title": "Why do religious people assume that atheists are the ones who \"always need to press their views on people\" When they are the clear majority?",
        "author": "Samesyo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tjs2k/why_do_religious_people_assume_that_atheists_are/",
        "text": "I just don't understand it. If I post a rebuttal to a religious comment on a public forum, i'm automatically the bad guy who is pressing my views on other people. Clearly they are the initiators, but anything I say is construed as forcing my (lack) of belief's on someone else.",
        "created_utc": 1422134333,
        "upvote_ratio": ""
    },
    {
        "title": "Dr. Grady McMurtry. How can I help my family see is not credible?",
        "author": "bentyl91",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tiuo2/dr_grady_mcmurtry_how_can_i_help_my_family_see_is/",
        "text": "For those of you who might not know, [Dr. Grady McMurtry](http://www.creationworldview.org/aboutus.asp) is a former \"evolutionist\" and current \"biblical scientific creationist\" who travels around giving presentations that attempts to use science to justify creationism and other biblical ideas. \n\nHe will be in my town at a local church this weekend giving talks on six topics over four days. My family is heavily pressuring me to go, partially because I've had an interest in science my whole life, I went to engineering school, and I'm sure due to my lack of church attendance my family is concerned about my salvation. I've sat through his presentations before and I honestly cannot stand listening to this man, and I would have a very hard time not banging my head against a wall. I know probably the best thing I could do is go to every presentation, take detailed notes of every claim he makes, and go through one by one finding reputable evidence that confirms or discredits each claim. I don't have the time nor the willpower to do this. \n\nI'm trying to think of some way I can make it clear to my family that this guy isn't credible. I know it's a long shot but I have a little hope because my parents at least aren't completely scientifically illiterate. My mom is a nurse practitioner with a master's degree and my dad, while not college educated, has been interested in science his whole life. I fear he knows just enough about science to listen to McMurtry's mumbo jumbo and think it makes sense and not spot the flaws. \n\nI've thought of saying something like \"What one man says, even if he's a scientist, is close to useless. Science is a collaborative enterprise and justification for belief comes with sufficient consensus among those who research a particular topic, and that consensus largely comes with repeatable experimental evidence. Almost everything he is saying goes against consensus, in no small part due to lack of sufficient evidence.\" I can see problems with this, namely that McMurtry isn't alone in his claims, so my family could say \"well there *is* a consensus among these guys over here.\" Also, I can see the conversation steering towards what constitutes sufficient evidence. \n\nDoes anyone have any advice or resources regarding this man and how I might be able to show how unreliable he is?",
        "created_utc": 1422117581,
        "upvote_ratio": ""
    },
    {
        "title": "The afterlife should still matter to atheists",
        "author": "MozartLink",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tgvs2/the_afterlife_should_still_matter_to_atheists/",
        "text": "",
        "created_utc": 1422062396,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone bring me up to speed on the gospels?",
        "author": "ZapMePlease",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tgkkf/can_someone_bring_me_up_to_speed_on_the_gospels/",
        "text": "I've been around here for a year and a half or so - been discussing the topic with people for a heck of a lot longer.  \n\nI understand that the OT is supposed to be the word of god.  But the gospels - well, they're attributed to the authors, right?  Whoever they might be.  \n\nSo why is it that christians quote things as if they're divine when they're the words of men? \n\nLike when a theist quotes 1 Peter 2:9 to justify something in the bible - how is that not just quoting some guy named Peter?   I get that they believe that Jesus is the son of god/god/what have you but how does that make the words of the apostles divine?\n\n",
        "created_utc": 1422056567,
        "upvote_ratio": ""
    },
    {
        "title": "Need advice on how to come out to my parents",
        "author": "Verus907",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tf34t/need_advice_on_how_to_come_out_to_my_parents/",
        "text": "I deconverted a few years ago and haven't told my conservative Christian parents. I know the usual advice is \"don't tell them until you are financially independent,\" but I'm getting ready to graduate from college, so that time is rapidly approaching. My parents are both Christian, but are kind and loving and I think there is no chance that they will become angry or violent and disown me. \n\nI've talked to my dad a bit about religion and told him I don't think the Bible is literally true and he agrees with me on that point. My dad is an apologetic and my understanding is that he really only believes in religion because not being able to see his parents and family again after he dies is too painful to accept, which is fine. My mom is much more devoted. She reads her Bible every day, volunteers at the church, and meets weekly with other moms for a prayer group. I'm most worried about her feeling like she failed as a parent and the impact on her social life in the church.\n\nI'm not planning on telling them soon, but I will have to at some point and I want to be prepared. Does anyone have experience with a similar situation? How do I bring it up? What do I say? Should I just bring it up casually or sit them down and talk to them? What are the main points I should discuss or bring up? My parents are evangelical christians if that helps at all.\n\nTL;DR: How should I approach coming out to my parents? Any advice is appreciated.\n\nEdit: This isn't something I feel compelled to do in the immediate future, it's just at some point I think it will come out and I just want to be ready. ",
        "created_utc": 1422032377,
        "upvote_ratio": ""
    },
    {
        "title": "My SO is sympathetic towards religion, because it helped a mentally ill relative. What are some good arguments against that?",
        "author": "monte_carlo_method",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2tdycu/my_so_is_sympathetic_towards_religion_because_it/",
        "text": "It's a recurring discussion that comes up now and then. Not a big issue, in fact we both enjoy talking about the subject. But I feel slightly uncomfortable with the fact that my arguments seems to have no lasting effect on her stand. \n\nShe argues that religion helped her dad cope with bipolar condition. I find it hard to come up with a good answer to that claim. Maybe it really does help her dad.  \n\nInterestingly, she opposes the use of psychopharmacy, on the grounds that it's \"unnatural\", that it prevents people from learning the truth about their own self and impends their ability to deal with mental problems. \n\nBeing an atheist and a rationally minded person, I obviously feel that psychopharmacy is just a tool designed to relief mentally ill people of their pain/suffering, and that stuffing mentally ill people with fairytales is not going to do them any good in the long run. \n\nAny thoughts? how would you approach such a discussion? \n",
        "created_utc": 1422002922,
        "upvote_ratio": ""
    },
    {
        "title": "Religion’s Dirty Dozen—12 Really Bad Religious Ideas That Have Made the World Worse",
        "author": "LemonHarangue",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2td1au/religions_dirty_dozen12_really_bad_religious/",
        "text": "",
        "created_utc": 1421981059,
        "upvote_ratio": ""
    },
    {
        "title": "Historical perspective: Those who attack others over religious beliefs are conceited &amp; cherry-pick Scripture to suit their needs (1688)",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2t9lbo/historical_perspective_those_who_attack_others/",
        "text": "Background: the letter (more of a booklet) was written by a father for his daughter as a guide on how to be a proper lady. In the section on how to be religious, he advises her never to attack others for different beliefs, though many will and think they are justified doing so (the letter was later published as a book when a publisher got their hands on a copy &amp; thought it was an excellent guide). Thought it was an interesting glimpse into religious opinions of the past.\n\nTried to keep formatting as close to the original as possible:\n\n\"It is not true Devotion, to put on an angry Zeal against those who may be of a differing Persuasion. Partiality to our selves makes us often mistake it for a Duty, to fall hard upon others in that case; and being push'd on with Self-conceit, we strike without mercy, believing that the Wounds we give are Meritorious, and that we are fighting God Almighty's Quarrel; when the truth is, we are only setting out our selves. Our Devotion too often breaketh out into that Shape which most agreeth with our particular Temper. The Cholerick [sic] grow into a hardned [sic] Severity against all who dissent from them, snatch at all the Texts of Scripture that suit with their Complexion; and because God's Wrath was some time kindled, they conclude, That Anger is a Divine Vertue [sic]; and are so far from imagining that their ill-natur'd Zeal requireth an Apology, that they value themselves upon it, &amp; triumph in it.\"\n\nSource: The lady's new-years gift, or, Advice to a daughter\n\nPublished 1688\n\nBy George Savile, Marquis of Halifax (1633-1695)\n",
        "created_utc": 1421909603,
        "upvote_ratio": ""
    },
    {
        "title": "When people mention bad atheists",
        "author": "SecularVirginian",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2t9k6p/when_people_mention_bad_atheists/",
        "text": "I don't understand why atheists try to come up with (excessively long) ways of describing how Stalin or Mao don't represent them.   For me it has always been this simple:\n\nIf you can compare me to an atheist who isn't a humanist, then I can compare you to a theist who isn't a Christian.\n\nEDIT:  My stance is that specific beliefs cause specific actions (ie jihad, celebacy, etc).  X person had beliefs that caused him to do something bad.  I very clearly don't hold those same beliefs.  Why would you then compare me? \n\nEDIT 2:  Feel free to replace humanist and christian as appropriate.  consequentialist/muslim works too.\n\nEDIT 3:  I generally will correct someone if they call Hitler an atheist, mainly because it bugs me.  I can explain to them why Stalin and Mao didn't do the things because of their atheism.  It is very simple to explain, but it takes a bit.  I like being able to nip all those \"bad atheists\" examples in the but with a single sentence, rather than dishing out dialogue after dialogue for each person they bring up.",
        "created_utc": 1421908801,
        "upvote_ratio": ""
    },
    {
        "title": "What do atheists think of religious aid organisations?",
        "author": "jaylife",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2t8h5q/what_do_atheists_think_of_religious_aid/",
        "text": "Hey everyone, so I assume if a lot of you were to donate money to a charity you'd try to find a non-religious one I assume? Correct me if I'm wrong. \n\nMore importantly though, what're your thoughts on working for one. My currently dilemma is that I love international aid work and most definitely the sector I want to get into it. However, there are so many religious organisations and it just conflicts with my atheist beliefs too much. Of course there are some who downplay the religious aspect and I can handle that. But there are some which have a \"How to get involved\" section and one suggestion was \"pray\". One of those moments where it actually got me angry.\n\nSo yea, just want to know what the opinions out there are in terms of religious charities/organisations, and also how you reckon I should approach the aid work issue?",
        "created_utc": 1421887662,
        "upvote_ratio": ""
    },
    {
        "title": "Middle East Eye - \"New Atheists rape and rescue fantasy\" discussion",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2t815d/middle_east_eye_new_atheists_rape_and_rescue/",
        "text": "I ran across this [article on middleeasteye.net](http://www.middleeasteye.net/columns/new-atheisms-islam-obsessed-rape-and-rescue-fantasy-804596123) and I'd like to hear your thoughts on it. I personally think that it's partly valid criticism, but he's making (and quoting) some ridiculous statements.",
        "created_utc": 1421880362,
        "upvote_ratio": ""
    },
    {
        "title": "MIDDLE EAST EYE - \"New Atheism's rape and rescue fantasy\", let's discuss",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2t7zsn/middle_east_eye_new_atheisms_rape_and_rescue/",
        "text": "",
        "created_utc": 1421879764,
        "upvote_ratio": ""
    },
    {
        "title": "Smart, Educated brother in law is deeply religious due to a \"personal spiritual experience\"",
        "author": "wren42",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2t6y1f/smart_educated_brother_in_law_is_deeply_religious/",
        "text": "Hi /r/trueatheism!  Looking to just process and discuss a bit. \n\nI grew up in a christian family, but it never really sat well with me.  i questioned a lot even as a little kid, and I gradually became agnostic, then full atheist over the years. \n\nI'm now an adult, and my family is vaguely aware of my non-religiosity, though I haven't \"come out\" as full atheist per se. \n\nWe have been talking a lot recently as a family, just getting to know each other more as we've had several weddings in the past year and are integrating these new people and personalities. \n\nNow, my family is all quite intelligent and educated, very intellectual about their faith.  Read lots of C.S. Lewis, discuss philosophy and the basis of logic/reason, theological debate, etc. \n\nMy sister's new husband is a bit different.  He's super smart -- Stanford educated engineer-- but less \"cultured\", in some ways.  Farm  raised, athlete, into hunting, hiking, and hard work.  Still, he's a very sincere and thoughtful person when you talk to him. \n\nI was thus surprised to learn how he came to faith. I just assumed he was raised with it, coming from a small town with conservative influences.  In fact, his parents didn't really encourage religion at all. \n\nHe claims it started with a spiritual experience in his high school days. \n\nDespite being a \"good kid\" and student early on, during his second year he started partying a lot, getting into jock culture, and generally being more selfish and dickish to people around him.  At some point, he got caught by his girlfriend \"kissing another girl\" and it turned into a scandal (the hometown cliche drama is rich in all this, I know).  \n\nHis parents found out about his drinking and troublemaking, and he was grounded a lost of a lot of face in the community. \n\nAll pretty mundane, but here's where his spiritual journey starts. \n\nHe claims that that night, lying in bed, he experienced a vision and a voice, calling him to transform his life and follow God.  \n\nThe next day, he went to youth group at the nearby church, and the Pastor started off by saying \"Someone is here today who was called by God to change his life.  Listen up, here's God's message for you.\"  And told the Christian story. \n\nFrom that day, he transformed, became 100% all in evangelical Christian, to the point that even his parents started to worry that he might end up hurting his career by going on a mission somewhere. \n\nNow, nothing in this story is particularly miraculous.  But the hardest thing about it is how utterly sincere and earnest this guy is.  He's smart, he's kind, he's honest.  And he states that while he totally understands how some might not believe, \"no rational person who had experienced what I heard and saw could not believe there was a God.\"  \n\nSo, what do *I* believe?  \n\nThat he is lying?\n\nThat he is irrational?\n\nThat he hallucinated?\n\nThat he created the memory in retro to explain his transformation, and in telling it came to believe it?\n\nThe last option seems the most likely, but it's hard to just tell someone they are making a memory up.  It undermines their entire personal narrative and indeed the basis of their personality. \n\nSo here's my question to you:\nHow do you deal with honest believers?  How do you deal with people who acknowledge the flaws in scripture, understand science, but accept God is real based on personal experience?\n\n\n**TL/DR:**\nSmart, educated guy honestly believes God spoke to him directly and changed his life.  \"No rational person could deny God if they shared my experience.\"  How do you approach this?",
        "created_utc": 1421863248,
        "upvote_ratio": ""
    }
]