[
    {
        "title": "what do you say",
        "author": "asdgaasfdga",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7h5bfs/what_do_you_say/",
        "text": "[removed]",
        "created_utc": 1512249201,
        "upvote_ratio": ""
    },
    {
        "title": "I'm here again",
        "author": "asgfdasfdgasgha",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7h5ax5/im_here_again/",
        "text": "[removed]",
        "created_utc": 1512249047,
        "upvote_ratio": ""
    },
    {
        "title": "I'm back",
        "author": "dumbpeoplehere",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7h5976/im_back/",
        "text": "[removed]",
        "created_utc": 1512248570,
        "upvote_ratio": ""
    },
    {
        "title": "What do folks here think of Robert Wright's new book, Why Buddhism is True?",
        "author": "abzurdleezane",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7h3p9n/what_do_folks_here_think_of_robert_wrights_new/",
        "text": "Best selling author Robert Wright is an award winning writer and commenter on evolution, game theory and spirituality. Coming from a Baptist back ground, Robert Wright has long examined where science, philosophy and psychology cross illuminate each other. Here he carefully explores these complex ideas regarding oneness, emptiness and usefulness of mindful meditation in reducing reactive responses to unconscious drives. An expert in no one particular field he crosses interdisciplinary lines to interview experts about their personal experience of meditation and related scientific findings. \n\nI personally adore his books and this new one on secular Buddhism via mindful Vipassana meditation I find to be just as carefully thought out and reasoned as *Nonzero* and *The Moral Animal*. I was attempting to summarize *Why Buddhism is True* when I ran across Robert Wright's [rebuttal](https://www.nytimes.com/2017/11/06/opinion/buddhism-western-philosophy.html) to a NYT book review by Adam Gopnik. I encourage you to read this article for a quick summary of his ideas and a taste treat of his writing style. Enjoy!\n\nEdit: Here is a 53 minute [video](http://meaningoflife.tv/videos/39341?in=01:43&amp;out=53:09) of Robert Wright discussing his meditation experience and understanding how it relates to human experience. True, its long but hey, its faster then reading the book!",
        "created_utc": 1512233645,
        "upvote_ratio": ""
    },
    {
        "title": "How has leaving behind religion effected you?",
        "author": "Hellowazup",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7h0rtr/how_has_leaving_behind_religion_effected_you/",
        "text": "For me it was getting over hell the fear of it was pushed into it us from an early age (Islam) it took so long for me to move past it but I'm 95 percent there. How did leaving behind religion change you and how are you feeling now?",
        "created_utc": 1512190929,
        "upvote_ratio": ""
    },
    {
        "title": "Winter solstice celebration ideas?",
        "author": "sobrien1313",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7gt1cs/winter_solstice_celebration_ideas/",
        "text": "My family and I have decided not to celebrate Christmas at all this season.  Although we started off Catholics my wife and I have not been for many years, (Nor have my three sons) but have always celebrated.   Anyone have any good ideas to celebrateon the 21st?",
        "created_utc": 1512107469,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] Where do you find religion is positioned within a modern society, does it still provide the accepted beliefs and mindset that make a good human with the life lessons that come with it, or is it more of a tool for finding closure that the followers seek?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7gsy9f/serious_where_do_you_find_religion_is_positioned/",
        "text": "[removed]",
        "created_utc": 1512106471,
        "upvote_ratio": ""
    },
    {
        "title": "What is your take regarding dealing with one's mortality as a secularist?",
        "author": "Dobokdude",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7g8y5c/what_is_your_take_regarding_dealing_with_ones/",
        "text": "Hello everyone. Today I'd like to discuss a recent video from Rationality Rules, a secular philosophy Youtube channel. This video is on the subject of howto deal with one's impending demise as a non-believer:https://www.youtube.com/watch?v=sMjj9_BICoE\n\n\n\n\nGreat video. Though I wouldn't say with certainty death is the end. As an agnostic I am open to the existence of gods and an afterlife(though I reject religion). Honestly an afterlife may not be good if a malevolent god decides to fuck us over, I mean if there s an afterlife why automatically assume it's a paradise? Ultimately I disagree with both the religious and fellow secularists.\n\n\n\n\nI was discussing the subject once with an acquaintence(a fellow agnositc/agnostic atheist) and I found his take on the subject to what I've come to feel the best view on the subject, I started by asking his take on mainstream atheism and then dealing with mortality when one leaves religion:\n\n\n\n\n&gt;Yeah...well, I do. I'm not religious by any stretch of the imagination, and at one time I was pretty militantly atheist. I was convinced that the world would be better off without any religion what so ever. The religious insist they know what lies after death. So do Atheists. They both blatantly ignore a simple fact: They don't know. The problem is that Atheism has adopted much of the arrogant certainty that religious do. In the end I realized that there's nothing to be gained in assuming you know anything with absolute certainty, because before you know it, something will come along and prove you wrong.\n\n\n\n\n&gt;The harsh truth of death is the unknown. It's what every human fears, deep down. Religion assuages those fears, Atheism stands in defiance of them (tries to at any rate). In short, when it comes to the nature of death, well, I'll quite Rick: I don't think about it. I accept that I don't know, that I won't know until I die, and I move on. I focus on my own strength, my own mind. I take cues from Eastern Religions and I meditate. I focus on the power of my soul. Now, whether it's Ki or Chi or Chakra or Holy Spirit, or just the delusions of my mind, when I meditate, I feel something. When I perform Tai Chi, I feel something. I never felt anything at church, listening to an old man tell me what to think and how to behave. When I meditate, I examine myself. I think about what character traits define me, what makes me who I am and which ones I like and don't like, how to fix what's broken and how to build up what could be stronger.\n\n\n\n\n&gt;And most importantly: I just don't think of death. When it comes for me, it'll either take me or pass me by. It's not my call, it's not my choice, and what lies on the other side is unknown. As Brom called it: the next great adventure.\n\n\n\n\nThoughts?",
        "created_utc": 1511915177,
        "upvote_ratio": ""
    },
    {
        "title": "Was I wrong about religion?",
        "author": "wherestruthat",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7g86mr/was_i_wrong_about_religion/",
        "text": "I don't want to be exposed to my friends, so just made this account.\n\nWhen I went to business school, I took a course in philosophy. My teacher was a really old man who believed in nothing but materialism. He was brilliant because he tried to cover every side he could of different arguments when it came to different beliefs people have/had. He was unbiased. \n\nSo, even though I didn't think much of what he said at the time when I was young and careless, it's creeping in on me now... many years later. Some nights, I lay sleepless. \n\nWhat he said was along those lines \"An argument in favor of God believers is that he created the universe. And it could be true. Who created the universe? We certainly did not.\"\n\nI know. This sounds cliche. But I started reading more recently, specifically scientific evidence, philosophy too, but much more science when it comes to the side of those who believe in God.\n\nI'm not please. I'm not pleased at all. I'm scared and confused. I can't accept it anymore that all of this is just a random event. I mean, the single trait I've prided myself with my whole life was being a logical thinker. And trust me, I know what the brilliant minds of our age (like Hawkins, Dyson and others) say. I've researched their work in depth (not like a professor, but I mean I spent more than 10 years learning this stuff, spending many months with actual \"scholars\") and I couldn't come to a good conclusion because of all the confusion, except one... They are looking at it from the same angle. We all are. God believers look at this from one angle, a single angle, and atheists are looking at it from the exact opposite angle. And while this is obvious, what was not very obvious to me is that there are just two angles, not multiple, but two. I thought the argument for atheism had multiple correct angles. But that's not right to me anymore. It's just two angles (and they can't be both correct, obviously). What's worse, is that I'm coming to a conclusion that this angle is never purely logical, for either side. Actually, a huge part of it is based on emotions or spirit (if you believe in that kind of thing) or psych or whatever you want to call it. This is very disturbing to me. Maybe not to most of you, but to me it's like an earthquake within.\n\nThere is much more. I want to talk. I want to let it out. This is the tip of the iceberg. But I really need to calm down a bit.\n\nWhat pops into my head most of the time (And I'm not exaggerating when I say this happens every time I wake up and a few times during the day EVERYDAY!) is this portion of my professors argument \"We certainly did not.\"\n\nCan this be true? Did anyone go through something similar?\n\n(Edited 1 day later below)\n\nEDIT:\n\nI'd like to thank everyone who had an input, but I'll have to end my reliance on this post for an answer (no matter how small that reliance was in the first place). To be honest, every single one of the responses I got here were things I already knew/thought about. And in all honesty, when I posted, I didn't have high hopes that I'll find anything new, but I just wanted to see if someone, anyone, could have gone through the same journey of research and seeking of wisdom that I'm going through and maybe came up with a different answer. Maybe that someone could've helped. In other words, I was searching for a person, not a comment. And I hope that what I'm about to say won't upset you guys, but it is indeed very difficult to go through this intense and long journey of truth seeking that I'm still going through and have the same stance about science and creation. My journey has by no means ended. But I think I'll be content with the answer I've been fighting against soon (which is the same situation when I posted yesterday). I have to put more of an effort, but this effort won't be on online forums. So thanks for your help. This has been short, but as I expected, this isn't the right place to look.\n\nOne more thing... I won't be able to reply to everyone. But since a few of you have been asking what I mean by \"numbers\" and when I said \"the number don't point towards random existence\", I'll give you one \n quote (For those interested... this is not the first quote I came across. I've come across a few similar quotes by scientists - which I dismissed - over the years.) But you'll have to excuse me because I won't be able to give all the quotes. They were more than one, but it's difficult to remember them all or remember where exactly I read them since my library has more than 20,000 books AND articles. So I apologize for that.\n\nWhat made me ask more questions was that the following quote (and other similar ones) was based on pure math. No philosophy or opinion. It might not be the most profound one I came across, but it was sufficient to make me ask even more. John Lennox (the one I quote) is a Mathematician. What he says about the conclusion another Mathematician (Roeger Penrose) came to is this... \n\n\"Creator’s aim’ must have been accurate to 1 part in 10 to the power of 10 to the power or 123, that is 1 followed by 10 to the 123rd power zeros\"\n\nFor those who don't realize what this number means... it means that the chance of the universe existing through a \"natural\" process approaches zero. You can get more information if you read Penrose's work of course, for those of you interested. But I can't go into further detail now. This has already wasted valuable time. \n\nAnyway, thanks.",
        "created_utc": 1511908719,
        "upvote_ratio": ""
    },
    {
        "title": "Expression",
        "author": "atheismuselessness",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7g7prm/expression/",
        "text": "[removed]",
        "created_utc": 1511905037,
        "upvote_ratio": ""
    },
    {
        "title": "Why?",
        "author": "atheismhipocracy",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7g3dpt/why/",
        "text": "[removed]",
        "created_utc": 1511866720,
        "upvote_ratio": ""
    },
    {
        "title": "How do you argue against classical theism?",
        "author": "GreatAP3",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7g2fj3/how_do_you_argue_against_classical_theism/",
        "text": "[removed]",
        "created_utc": 1511853683,
        "upvote_ratio": ""
    },
    {
        "title": "The loop",
        "author": "atheismfalsehood",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fz0k0/the_loop/",
        "text": "[removed]",
        "created_utc": 1511821102,
        "upvote_ratio": ""
    },
    {
        "title": "Religion ban",
        "author": "atheismwrong",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fyvg1/religion_ban/",
        "text": "[removed]",
        "created_utc": 1511819987,
        "upvote_ratio": ""
    },
    {
        "title": "Social bubble here",
        "author": "atheismnosense",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fy8l0/social_bubble_here/",
        "text": "[removed]",
        "created_utc": 1511815016,
        "upvote_ratio": ""
    },
    {
        "title": "Any fair treatment?",
        "author": "atheismisrandom",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fy2rl/any_fair_treatment/",
        "text": "[removed]",
        "created_utc": 1511813743,
        "upvote_ratio": ""
    },
    {
        "title": "What now?",
        "author": "dumbtyrantatheist",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fxtq9/what_now/",
        "text": "[removed]",
        "created_utc": 1511811809,
        "upvote_ratio": ""
    },
    {
        "title": "Hello",
        "author": "atheismequalstyranny",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fxo1v/hello/",
        "text": "[removed]",
        "created_utc": 1511810584,
        "upvote_ratio": ""
    },
    {
        "title": "Again????????????",
        "author": "atheismispuretyranny",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fxhc6/again/",
        "text": "[removed]",
        "created_utc": 1511809133,
        "upvote_ratio": ""
    },
    {
        "title": "Bible contradictions videos",
        "author": "SawTheLightOfReason",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fx8xq/bible_contradictions_videos/",
        "text": "[removed]",
        "created_utc": 1511807314,
        "upvote_ratio": ""
    },
    {
        "title": "How dumb",
        "author": "atheismisdumbest",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fx4sx/how_dumb/",
        "text": "[removed]",
        "created_utc": 1511806420,
        "upvote_ratio": ""
    },
    {
        "title": "There are people who GENUINELY believe in Satya Sai Baba?!",
        "author": "a_wet_sponge",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fv2q7/there_are_people_who_genuinely_believe_in_satya/",
        "text": "I just saw with my own eyes that there are apologetics defending SSB in one of his \"miracle\" [video](https://youtu.be/nHYUzwHnaCY). I'm ~~flattered~~ flabbergasted. I think I just saw the worst of human rationality. I've never seen a cult or con artist be so successful. I can still understand believing in supreme being like Yahweh, but this one is over my mind.\n\nThere is a pattern that I saw from his followers: Denial. This also exist in organized theists. Taking their herd's word for granted while being insanely skeptic beyond reason regarding other's criticism. You can see in the video comment words like:\n\n&gt; Say anything about him. You're all away from the truth.\n\n&gt; All your words are meaningless. He is the truth and will never be affected by your words.\n\n&gt; he is an incarnation of a divine love. Check it out properly saying anything sick about him. Forgive them Father. Those infidels don't know what they are doing.\n\nReplace SSB with Jesus, Muhammad, Moses, or any god. Do you see the pattern? It always make my blood boil when someone keeps saying that they've worshipped the true god/do the true deeds. Not even philosophers claim to have done it. **There should be a term for those ignorant \"argumets\"**.",
        "created_utc": 1511788450,
        "upvote_ratio": ""
    },
    {
        "title": "What Does This Mean?",
        "author": "insight2017",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fuooe/what_does_this_mean/",
        "text": "[removed]",
        "created_utc": 1511783881,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism is tyranny",
        "author": "Atheismtyranny",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fudnm/atheism_is_tyranny/",
        "text": "[removed]",
        "created_utc": 1511779773,
        "upvote_ratio": ""
    },
    {
        "title": "Proving my point!",
        "author": "tempaccjan",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7frszg/proving_my_point/",
        "text": "[removed]",
        "created_utc": 1511749058,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism is just dumb.",
        "author": "tempaccjan",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7frbs0/atheism_is_just_dumb/",
        "text": "[removed]",
        "created_utc": 1511744465,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism is just dumb",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fr7aa/atheism_is_just_dumb/",
        "text": "[removed]",
        "created_utc": 1511743245,
        "upvote_ratio": ""
    },
    {
        "title": "Moving the goalposts?",
        "author": "Borticus_Maximus",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fpt4f/moving_the_goalposts/",
        "text": "I’ve running into an increasing number of theists (primarily Christians) who say that just because a literal genesis didn’t happen doesn’t mean their god doesn’t exist or that genesis is just an allegory for evolution.",
        "created_utc": 1511730507,
        "upvote_ratio": ""
    },
    {
        "title": "What is your opinion on the thought that \"religion gave us art, atheism didn't\"?",
        "author": "CompositeOnReddit",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fmeah/what_is_your_opinion_on_the_thought_that_religion/",
        "text": "I encountered this argument on an online forum that posits that great artists, such as Dante Alighieri, Bach, and Dostoevsky were religious and they gave us great art pieces like the Divine Comedy, the St Matthew Passion, and Crime and Punishment, while on the other hand atheism has yielded nothing of artistic value, so even if religion was proven to be false, it would deserve to be preserved for the artistic value it yields. What's a good response to this argument?",
        "created_utc": 1511695982,
        "upvote_ratio": ""
    },
    {
        "title": "Some Christians don’t realize while their religious freedom is secured by the states, the rights of the homosexuals should also be protected",
        "author": "AdmitOneOnly",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7flyi3/some_christians_dont_realize_while_their/",
        "text": "*(I’m a Hongkonger who has never been to the states but has learnt about the trend after talking to a Christian colleague who has lived there for years.)*\n\nHarm principle, a political concept developed by John Stuart Mill, restricts the government from setting up laws that intervene with the lifestyles of the citizens. As long as an act doesn’t cause physical harm to the others, even if it offends some people or hurts some people’s feelings, one should be allowed to do it. This is the foundation for the liberty of the people. \n\nYet many Christians complain that there’s too much freedom in our time. One of their requests is that the states forbid homosexuality because it is a grievous sin, in their God’s opinion, which caused him to brutally wipe out Sodom &amp; Gomorrah in the Old Testament. Some others compare homosexuality to homicide and rape because they hold the belief that all sins are *equally* bad. \n\nWhat they don’t see is that while they judge the minority for sinning, their religion could also offend others significantly in many aspects. For instance, the teaching of sending non-Christians to a place with eternal fire to kids is often seen as child abuse for atheistic parents. Can these parents legitimately ask for a complete ban of Christianity in the states?\n\nChristians, in the ancient times, were once persecuted by the Romanian government until their religion was later legalized.  When their religious freedom ought to be protected, provided that they don’t cause any substantial harm to the others, what gives them the power to enact laws that limit the minority’s freedom of lifestyles paternalistically simply because of their judgments of what are immoral?\n\nWhile libertarianism is blamed for homosexuality which is believed to be the cause of the world coming to an end by a lot of modern Christians, countries that refuse this political idea are often accused of persecuting churches and believers or illegally limiting their rights. Christians should be consistent in concerning their rights and the rights of the minorities because, nevertheless, Jesus &amp; his disciples were once in the minority. Harm principle does not give rights to a particular group of people but to *all* citizens in a country. Any religious believer objecting liberalism ought to be prepared to abandon their right of freely visiting their churches. \n",
        "created_utc": 1511688837,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think it is possible to be plain agnostic?",
        "author": "Dobokdude",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fkyl4/do_you_think_it_is_possible_to_be_plain_agnostic/",
        "text": "Hey its my first time posting here!\n\n\n\nAnywho, the whole thing about belief being binary is a real clusterfuck. Semantics play a large part. Many atheists say atheism is a disbelief in Gods not a belief. But that doesn't make sense because that basically means you don't think god exists.\n\n\n\nAlso for belief being binary consider this scenario. Say you close your eyes, flip a coin and when it lands you cover it with your hand. You know there's only two options: heads or tails. But if you keep the coin covered you will never know. You don't think you landed on tails but you also don't think you landed heads either because you don't know.\n\n\n\n\nBut I wouldn't mind hearing your thoughts?",
        "created_utc": 1511674565,
        "upvote_ratio": ""
    },
    {
        "title": "My 5 year old keeps asking “ Who was the first Mom?” Please help me answer.",
        "author": "Universalsupporter",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7fdikj/my_5_year_old_keeps_asking_who_was_the_first_mom/",
        "text": "[removed]",
        "created_utc": 1511591339,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone eli5 how the double slit experiment does NOT prove God?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7f9b0k/can_someone_eli5_how_the_double_slit_experiment/",
        "text": "[removed]",
        "created_utc": 1511547989,
        "upvote_ratio": ""
    },
    {
        "title": "Does God resolve questions on the meaning of life?",
        "author": "hugejoel",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7f8msl/does_god_resolve_questions_on_the_meaning_of_life/",
        "text": "Christians criticize atheists because atheists are incapable of answering the question: what is the meaning of life? I've been giving that some thought, and I realized that all that religious people do is kick the can down the curb when it comes to that question. In fact, religion makes the question much harder to answer. Christians say, broadly, that the meaning of life is to praise God and act morally as Christ did.That might not be a perfect summary of what they think, but I'm pretty sure I'm not far off. But Christians believe that the reason one should derive meaning this way is that God has claimed that he will only accept them into his eternal kingdom if they do.\nBut then that demands the question: what is the meaning of life for a person in heaven?No longer is it possible that that meaning is to praise and honor God. Prayer and faith are both totally unnecessary in Heaven, since you can presumably have anything you want and you have absolute verification that God exists.\nSo, there must be some other meaning to that life that has yet to be described. That is to say, Christians hit the same bedrock of meaning that atheists do.\nAnd where atheists only have to contend with the seeming meaninglessness of our mortal lives, theists have to contend with the seeming meaninglessness of an eternal life.",
        "created_utc": 1511542020,
        "upvote_ratio": ""
    },
    {
        "title": "How do you respond to the \"that's how humans interpret it\" argument?",
        "author": "Sucubis",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7f8i7f/how_do_you_respond_to_the_thats_how_humans/",
        "text": "So I've found myself in a couple of discussions lately (with Muslims specifically) and when I bring up things like Female Genital Mutilation or killing non Muslims or Mohammed flying on a winged horse and splitting the moon, I am faced with a point along the lines of - \"The translation is bad\", \"That's just how humans interpret the text\", \"It's not to be taken literally\", etc. \n\nSame applies to being able to disprove the existence of leprechauns and unicorns just as much as god or Jesus doing miracles I get \"But what are leprechauns maybe people changed what they are and we interpret then wrong\" or \"Maybe Jesus was a scientist doing things simple people couldn't understand much like Thor for example calls what he does science but humans call it magic\"\n\nI'd love to hear your opinions and how you responde to that. \n\nEDIT: Thank you for all your responses, they make a lot of sense so believers might not like them :) ",
        "created_utc": 1511540853,
        "upvote_ratio": ""
    },
    {
        "title": "How many books have been preserved before the 7th century?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7f6daq/how_many_books_have_been_preserved_before_the_7th/",
        "text": "[removed]",
        "created_utc": 1511515389,
        "upvote_ratio": ""
    },
    {
        "title": "If Atheism was a diet, what would be in it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ez7dk/if_atheism_was_a_diet_what_would_be_in_it/",
        "text": "[removed]",
        "created_utc": 1511438513,
        "upvote_ratio": ""
    },
    {
        "title": "The utility of studying religion from a skeptical mindset",
        "author": "amankinperc",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ery90/the_utility_of_studying_religion_from_a_skeptical/",
        "text": "Is there utility in learning about and studying religion? What are the benefits and dangers of it? Do you think it's wrong to put more significance on historically sacred texts than secular literature?\n\nI think it's a healthy mental exercise to consider religion. The bible and other religious texts help me learn about human nature, history, art, culture, and many other topics. There are lessons to be learned from both the mundane stories as well as the most sensational unfalsifiable claims.",
        "created_utc": 1511366439,
        "upvote_ratio": ""
    },
    {
        "title": "7 REASONS WHY PEOPLE created GOD ? What are the reasons and circumstances that inspired some people to create this idea which led to establishing great civilizations across the world? http://www.thedarkmatter.me/2017/11/7-reasons-why-people-created-god.html",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7emxh4/7_reasons_why_people_created_god_what_are_the/",
        "text": "[removed]",
        "created_utc": 1511313028,
        "upvote_ratio": ""
    },
    {
        "title": "What Would Convince You In The Second Coming of God?",
        "author": "OmegaRed86",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7elxtb/what_would_convince_you_in_the_second_coming_of/",
        "text": "As Stan Lee would say, Hey True Believers. Boy do I have a fun scenario for you guys. \n\nAs you go about your rudimentary day, you come across a man who claims he is Jesus the one true son of God. He states that he is the second coming and wants you to follow him blindly in order to \"Save Your Soul\". \n\nOf course you will ride him off as a bat shit crazy lunatic and no doubt you will be annoyed at his persistent pestering. He asks you,\"Oh my little lost child, how can I convince you to embrace me as your Lord\"...... \n\nWhat would need to happen to completely change your nature of reality. ",
        "created_utc": 1511304356,
        "upvote_ratio": ""
    },
    {
        "title": "The existence of Jesus",
        "author": "definitelynot_stolen",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7elrdt/the_existence_of_jesus/",
        "text": "I always hear back and forth between people about whether or not Jesus existed. As an atheist, I personally believe that he existed as a person based on several eyewitness accounts from around the time Jesus was supposedly alive describing a man who said he was the savior. However I do not believe he performed \"miracles\" or was the son of God. What's the general atheist consensus on the existence of Jesus as a person?",
        "created_utc": 1511302852,
        "upvote_ratio": ""
    },
    {
        "title": "She won't \"shut up.\"",
        "author": "BrautanGud",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ef1ga/she_wont_shut_up/",
        "text": "[removed]",
        "created_utc": 1511237189,
        "upvote_ratio": ""
    },
    {
        "title": "[serious] Double Slit Experiment",
        "author": "Scaredaboutthetruth",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ecfos/serious_double_slit_experiment/",
        "text": "[removed]",
        "created_utc": 1511214024,
        "upvote_ratio": ""
    },
    {
        "title": "What is your political affiliation as an atheist?",
        "author": "capnobvi",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7eah87/what_is_your_political_affiliation_as_an_atheist/",
        "text": "First and foremost: I am aware that atheism is fully agnostic of political affiliation (well unless you politically support the religious right) - the reason I ask is that I spend a lot of my time thinking about atheism, reading about atheism, I am generally interested in atheism, secularism and humanism, but I’m often undereducated or uninterested in conversations about political theory, other than that I am in favor of a secular society. \n\nI am just curious about the political diversity of the atheist “community”- who’s a conservative? A liberal? A Democrat? A socialist? An anarchist? A capitalist? A libertarian? \n\nAny suggested reading?",
        "created_utc": 1511198858,
        "upvote_ratio": ""
    },
    {
        "title": "The fear of god.",
        "author": "PorkSnail",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7e4d9u/the_fear_of_god/",
        "text": "Do you think people know it's more powerful to be feared than loved? They talk up Gods love all the time, but no matter where you are believers will always put in punishment talk or needs for forgiveness. Why cant god just love all the time with absolutely no trace of repercussion what so ever? ",
        "created_utc": 1511133178,
        "upvote_ratio": ""
    },
    {
        "title": "New rule: This is not a sub for posting complaints about other subs.",
        "author": "nukefudge",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7dxggm/new_rule_this_is_not_a_sub_for_posting_complaints/",
        "text": "Hi all - as of now, a new rule has been added:\n\n-\n\n* This is not a sub for posting complaints about other subs.\n\n-\n\nTrueAtheism is not a sub that means to deal with other subs. Please keep such topics out of here.\n\n-\n\nThank you for your cooperation!",
        "created_utc": 1511055975,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of sub /r/atheism is?",
        "author": "a_wet_sponge",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7dtiec/what_kind_of_sub_ratheism_is/",
        "text": "[removed]",
        "created_utc": 1511018461,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of sub /r/atheism is exactly?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7dth7h/what_kind_of_sub_ratheism_is_exactly/",
        "text": "[removed]",
        "created_utc": 1511018128,
        "upvote_ratio": ""
    },
    {
        "title": "[meta?] I was banned from /r/atheism for 2 posts I made on LGBT issues and labelled a bigot. Are they right?",
        "author": "darthhayek",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7druav/meta_i_was_banned_from_ratheism_for_2_posts_i/",
        "text": "[removed]",
        "created_utc": 1510996100,
        "upvote_ratio": ""
    },
    {
        "title": "what are people here",
        "author": "k_h_k",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7dqdly/what_are_people_here/",
        "text": "i am a agnostic, do i belong here\n\nwhat is this sub for\n\n1)people who don't care about god\n\n2)people who are happy that everybody has their own opinion about god unless it doesn't hurt others\n\n3)people who have a more rational thinking towards human existence\n\n4)people who don't believe in god\n\n5)people who hate the existence of god\n\n6)people who hate theist people\n\n7)people who are like theist who want others to convert into their own religion(here into atheism)\n\n\n",
        "created_utc": 1510976326,
        "upvote_ratio": ""
    },
    {
        "title": "Is Theism or Atheism a Delusion?",
        "author": "Wowbagger8",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7dlpya/is_theism_or_atheism_a_delusion/",
        "text": "I came across this atheistic [response](http://rantswithintheundeadgod.blogspot.ca/2017/11/is-theism-or-atheism-delusion.html) to a YouTube video called [Is Atheism a Delusion?](https://www.youtube.com/watch?v=_Ii-bsrHB0o&amp;t=643s) by a Christian whose YouTube channel goes by the name \"Inspiring Philosophy.\" \n\nThe video argues that, contrary to what atheists say, theists are not deluded and they believe in God because of the \"overwhelming evidence.\" On the contrary, says the Youtuber, atheists are deluded because theism is \"natural,\" so atheists are swimming upstream, as it were, which shows that atheists stubbornly resist the mountain of evidence for theism, because they're angry at God or they secretly want to be God. Thus, atheism ends up being a sin. It's that sort of annoying Christian video.\n\nThe article dismantles the Youtube video, showing that it makes a number of dubious, confused arguments, despite the Christian's pretense of being rational and informed. \n\nBut the article also points out that secular humanists might be deluded, after all, in terms of the ecological damage our free, capitalistic and technoscientific way of life is doing to the planet. Economists may be deluding themselves if they follow their oversimplified models which say that growth can be sustained forever, and we consumers may be deluding ourselves if we're blind to the costs involved in bringing the many products to us from poor places elsewhere in the world.\n\nThe article argues that the average, \"childlike\" theist is very likely deluded, but that the average secular humanist might be just as short-sighted and deluded (possessed by a false belief and resistant to changing it in spite of a mountain of evidence, such as the evidence presented by environmentalists and climatologists). \n\nSo is it possible we're all deluded? Who are the truly enlightened ones? Do we have to delude ourselves to be happy? ",
        "created_utc": 1510932803,
        "upvote_ratio": ""
    },
    {
        "title": "How do you refute the following...",
        "author": "I_Am_Jacks_Scrotum",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7daels/how_do_you_refute_the_following/",
        "text": "The Atheist says to the Theist: There is no evidence for God, therefore God does not exist. \n\nThe Theist replies: Lack of evidence for a thing is insufficient to prove the non-existence of that thing. Simply because we have no evidence for the existence of God does not mean that it is *impossible* that God exists.\n\nThe Atheist: What kind of God are you talking about?\n\nThe Theist: I do not believe in an intercessionary deity. My belief in God consists entirely of the belief that the Universe did not begin spontaneously, but rather was nudged into being. That is the only thing that I believe God did. \n\n((Assume, for the sake of the argument, that this Theist is perfectly consistent in his worship of this God. That is, he may engage in prayer of thanks, of praise, or of worship -- because he believes that the creator of the universe is worthy of those things -- but he will not engage in prayer of petition or intercession, because he does not believe in an *active* deity.))\n\nThe Atheist: If you had said that you believed in the God of the Bible, we could easily end this argument, because there is evidence that it is impossible for that God to have operated as described, and no contradictory evidence other than the Bible itself. However, because of the way that you've defined the God that you believe in, you've made it very difficult for me to refute the existence of your God.\n\n",
        "created_utc": 1510811382,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to figure stuff out, possibly deconverting from Christianity, seeking advice and related experiences",
        "author": "ConnorJones9",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7d8tal/trying_to_figure_stuff_out_possibly_deconverting/",
        "text": "Hey there everybody, I'm new to reddit and I'm seeking some advice. I posted an abbreviated version of this on the atheism thread and I was referred to here. I didn't tell the whole story because I was in a hurry and was typing on my phone. With that wordy introduction, off we embark. From birth until about age 5, I went to a Christian daycare down the road from my house. I learned about Adam and Eve and the Great Flood, I heard all the Bible stories that children love to hear. I was told that God loves me and that I could talk to Him. My parents weren't very religious, so outside of daycare, I got no religion. I didn't go to church except for a handful of times. My 3rd and 4th grade years of school, over the summer I returned to this daycare due to my parents both working and needing me to be watched, so I heard more of what I already knew. When I was 10, we moved away and I didn't think much of it, I wasn't connected to religion but still identified as a Christian. At my new school, I made friends with my now best friend. Him and I hung out regularly and occasionally he would invite me to church, which I happily obliged. Over the summer leading up to our freshman year of high school, he had a party at his house and another one of our friends and myself were asking to stay the night. We would be allowed as long as we came to church with them the next day. We went and I enjoyed myself greatly and following service, I told my friend that I would like to start coming with them every Sunday, which I began doing. I started to see my life change and the qualities of my relationships improve as I began putting my Christianity into practice, strengthening my faith. For a long time, the Bible was my adviser on all things and I sought its counsel daily. I began praying and getting involved in the church service and I became deeply entrenched in church. I had always been slightly doubtful of some claims, but never was there any serious, faith-threatening doubt. My first tinge of doubt that I remember though came at my baptism. They asked me, \"Do you believe with your whole heart that Jesus is the Son of God?\", to which I said yes, but once the question was posed, I felt a hint of \"ehhhhh I don't really know about that.\" Nevertheless, I persisted. I should mention that my high school was 99% white, and the kids I went to high school with were almost all from conservative, Christian households. Diversity of thought was not commonplace. Regardless, I kept with the faith and it went mostly unchallenged until I got to college. My first semester of school, I was in a religion course where we examined the intersection between culture and religion. Nothing particularly riveting, but enough to pique my interest in religious studies, and once it was made known to me that there would be an Introduction to the New Testament course the following semester, I jumped on the opportunity. I became interested in apologetics as I felt my faith threatened, but it was not until I entered the New Testament course that I really felt the heat. It became clear to me that the Bible probably was not the inspired word of God, and it wasn't inerrant. In fact, there was a lot of stuff I had never even thought to ask about the Bible, like how it came to be what it is today. I was exposed to authorship concerns, doctrinal evolution, etc. Coincidentally, one of the men I went to church with was a former scholar and editor of Mercer University Press and used to work at Christian Theological Seminary. He was and is a well-read, intelligent man with a very interesting interpretation of the Bible. Him and I began discussing my classes and I would ask him questions. I see him and other scholars that I have met as the \"goal\" I suppose. People who, in the face of all logic and information available, are still faithful. People who have studied the origins and interpretations of Christianity and still believe. I am now in my sophomore year of college and I have felt doubt more tremendously than ever. Atheist and agnostic arguments are more compelling than the religious ones. I have become entirely convinced that evolution happens, the more I think about religion, the less legitimate it becomes to me. I am so entrenched in the faith, though, that it will be quite difficult for me to leave, even though church is no longer fulfilling and I feel a general lack of purpose. I am writing to see if anyone can relate to this or offer advice. I am scared to deconvert out of fear of eternal punishment (which is probably nonexistent), which I know sounds silly. If anyone made it through all of that, I commend you. I am open to any advice I can receive, just please do not be dismissive or rude. I appreciate you all, thank you.\n",
        "created_utc": 1510794342,
        "upvote_ratio": ""
    },
    {
        "title": "My mother is trying to convince me this is a quranic miracle. Help me debunk her.",
        "author": "Scaredaboutthetruth",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7d887n/my_mother_is_trying_to_convince_me_this_is_a/",
        "text": "[removed]",
        "created_utc": 1510788841,
        "upvote_ratio": ""
    },
    {
        "title": "What's up with Churches and taxes?",
        "author": "PorkSnail",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7d7pll/whats_up_with_churches_and_taxes/",
        "text": "[removed]",
        "created_utc": 1510784133,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist Stanford Biologist Robert Sapolsky Explains How Religious Beliefs Reduce Stress",
        "author": "sydrduke",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7d6psy/atheist_stanford_biologist_robert_sapolsky/",
        "text": "[removed]",
        "created_utc": 1510775738,
        "upvote_ratio": ""
    },
    {
        "title": "Do you believe there some form of life after death?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7d2w6g/do_you_believe_there_some_form_of_life_after_death/",
        "text": "[deleted]",
        "created_utc": 1510736620,
        "upvote_ratio": ""
    },
    {
        "title": "What's your own theory on what will happen after death?",
        "author": "Unicorncorn21",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7cxun3/whats_your_own_theory_on_what_will_happen_after/",
        "text": "[removed]",
        "created_utc": 1510685954,
        "upvote_ratio": ""
    },
    {
        "title": "XKCD's Attack on Rationalism",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7cvkcu/xkcds_attack_on_rationalism/",
        "text": "[deleted]",
        "created_utc": 1510665889,
        "upvote_ratio": ""
    },
    {
        "title": "Objectivism - an atheist philosophy?",
        "author": "BrautanGud",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ct5zq/objectivism_an_atheist_philosophy/",
        "text": "The current speaker of the US House of Representatives, Paul Ryan, once said he had to ultimately reject the philosophy of objectivism, developed by writer Ayn Rand. He read and was inspired by \"Atlas Shrugged\" for many years and stated Rand was the reason he sought out economics and policy and public service. \n\nBut he now says he no longer can connect with her \"atheist\" philosophy as she rejected religion and god in her worldview. She was also pro-abortion and I'm sure this grated on the mind of catholic Ryan.\n\nI am not a reader or study of philosophical theory but do have a cursory interest in it. I have not read either of Rand's two most notable works - Atlas Shrugged and The Fountainhead. But what I have read on Rand's life  and her objectivist philosophy leads me to think I would probably not relate to or appreciate her writings. \n\nObjectivism, for me, seems to be too self centered and unconcerned for the welfare of anyone but yourself. As a humanist her philosophy seems alien to me. No doubt she was a complex individual and I do find some agreement with her beliefs on such subjects as supernaturalism/mysticism, rational thought, keeping \"intelligent design\" out of public schools, and racism. On the other hand I disagree with her position on opposing taxation, public education, child labor laws, the minimum wage, and that laissez-faire capitalism is the most moral social framework.\n\nFor Ryan to say her philosophy is an atheistic worldview I believe is unfair. While she does reject religion for her philosophy to be  characterized as atheistic seems to imply that atheism is an umbrella term for many things totally irrelevant to the question of god.\n\nMore importantly Ryan's label seems to imply the selfishness of objectivism is a quality that only atheists can appreciate. His perception is misguided as far as I am concerned. \n\nI welcome input from everyone but especially those who have studied philosophy academically.  ",
        "created_utc": 1510633801,
        "upvote_ratio": ""
    },
    {
        "title": "This isn't a \"miraclr\" is it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7co3bv/this_isnt_a_miraclr_is_it/",
        "text": "[removed]",
        "created_utc": 1510589409,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of stories of people allegedly predicting their own death?",
        "author": "Knicka",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7cj0el/what_do_you_think_of_stories_of_people_allegedly/",
        "text": "[removed]",
        "created_utc": 1510529077,
        "upvote_ratio": ""
    },
    {
        "title": "\"God has a plan\"",
        "author": "definitelynot_stolen",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7chtyy/god_has_a_plan/",
        "text": "Every time somebody has a bad thing in their lives, Christians always say to the grieving people \"God has a plan for you/them. Don't worry.\" If God has a plan for everyone, what's his plan for stillborn babies? Miscarriages? Serial killers? And still more confusing, why are sinners bad if God himself already knew what they were going to do? Why does God blame humans for their actions when he planned that they would do that? This is why Christianity can't work. There's so many contradictions and so much hypocrisy in the religion. You can't say God knows what will happen in your life, and then blame people for the things they do. That's not how planning works.",
        "created_utc": 1510518115,
        "upvote_ratio": ""
    },
    {
        "title": "Do we need to take the arguments for God's existence seriously?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7cg30d/do_we_need_to_take_the_arguments_for_gods/",
        "text": "[deleted]",
        "created_utc": 1510501724,
        "upvote_ratio": ""
    },
    {
        "title": "Long time atheist be with a quick question",
        "author": "bigpappabagel",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7cfoep/long_time_atheist_be_with_a_quick_question/",
        "text": "Good morning everyone,\n\nI was watching the news and then started cleaning the house while the TV was on. Charles Stanley came on and his sermon was about blood of Christ and sin. \n\nIf God is so powerful, knowing, etc, then why is he so concerned about us admitting we are sinners? Shouldn't he already know that since we have a proven track record of coming up short (Eden, Sodom, killing Jesus, on and on and on)?\n\nCan anyone help me understand why christians and God are so concerned with sin and forgiveness? \n\nEdit: Thank you all for your answers and replies!",
        "created_utc": 1510497209,
        "upvote_ratio": ""
    },
    {
        "title": "Theist realizes prayer doesn`t actually work.",
        "author": "BrautanGud",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7c8ukv/theist_realizes_prayer_doesnt_actually_work/",
        "text": "So Jordan Ware admits that prayer alone really accomplishes nothing:\n\n\"Willing to act on behalf of others. Conservative writer Matt Walsh has written that those who criticize the offering of “thoughts and prayers” in the wake of a tragedy “don’t understand prayer” because “they need to clarify that prayer should be accompanied by action.” But obviously, we who pray do need to clarify that. Because the world is not seeing that action. The world is not seeing those changed hearts. Pope Francis has said, “You pray for the hungry. Then you feed them. That is how prayer works.” Since we do not see prayer “working” in this sense—since we do not see the hungry being fed or the victims of violence finding relief, can we say that our prayers are working? In this sense, the New York Daily News cover is telling the truth: God isn’t fixing this. Because throughout the Scriptures, and throughout Christian history, we see that God nearly always chooses to work through human beings. If God is going to fix this, it will only be through us.\"\n\nThis admission that saying prayers without actually doing something tangible is essentially admitting that it's a meaningless task. Right. So why not skip the prayer part and just be proactive by, in this case, speaking out about the gun violence and senseless loss of life beseiging our country? Take a stand. \"Thoughts and prayers\" are being called out for the useless waste of time they truly are. Even the religionists are starting to make this realization.\n\nhttps://www.self.com/story/thoughts-and-prayers-are-work",
        "created_utc": 1510412804,
        "upvote_ratio": ""
    },
    {
        "title": "Spiritual Arguments",
        "author": "AutisticThinker",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7c8oi3/spiritual_arguments/",
        "text": "Here \"spiritual\" refers to both supernatural and other paranormal phenomena.\n\nThere is no evidence that spiritual phenomena even exists at all. However spiritual people frequently use spiritual arguments and arguments involving spiritual entities. There are many who talk about \"spiritual health\", many who talk about \"spiritual warfare\" and many who talk about souls. Spiritual health and spiritual warfare are dependant on the existence of spiritual phenomena. There is no evidence that souls exist at all.\n\nThe main issue with spiritual arguments is that there is no known way to verify or falsify them. If you can't throw the factually incorrect statements out your statements can not be tested on how much they fit reality. For example I can claim to be a cat spiritually and you can claim that I'm spiritually a dog. So am I spiritually a cat, a dog or something else? There is no way to evaluate which species I belong to spiritually so we'd better simply drop this idea.",
        "created_utc": 1510410893,
        "upvote_ratio": ""
    },
    {
        "title": "what is the best university that has the highest godless popluation?",
        "author": "beyondlimits100",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7c76r5/what_is_the_best_university_that_has_the_highest/",
        "text": "[removed]",
        "created_utc": 1510386006,
        "upvote_ratio": ""
    },
    {
        "title": "INVADED: ELEMENTARY SCHOOLS UNDER ASSAULT",
        "author": "BrautanGud",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7c6x6u/invaded_elementary_schools_under_assault/",
        "text": "One of the realities of the US public school system is that, nationwide, all our elementary schools are a possible target by private religious organizations. Faith-based Kids Hope USA stated that praying for the students was the most \"effective\" aspect of their program. But it has been reported they are arranging and abusing contact with school children by promoting religious events.\n\nThese religious programs unfortunately are not always reported and often go unnoticed. Many local Xtian groups across America still deliver free bibles to the schools, for the children. \n\nThere needs to be one or more secular/atheist teachers or administrators at all these schools, ideally. Likewise all atheist parents should be concerned and proactive about their children's school activities.\n\nViolations of our First Amendment are a threat to our democracy. Traditional religious practices that do this can no longer expect to find favor with secular society. \n\nReport violations you encounter with the ACLU or FFRF.\n\nIf we can stem the flow of childhood indoctrination into religious mythology our society will move more quickly to a secular utopia.\n",
        "created_utc": 1510381741,
        "upvote_ratio": ""
    },
    {
        "title": "Seminary or University? [Help needed]",
        "author": "SchrodingersPriest",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7c6tqa/seminary_or_university_help_needed/",
        "text": "[removed]",
        "created_utc": 1510380332,
        "upvote_ratio": ""
    },
    {
        "title": "Sagan's The Demon-Haunted World",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7c6ece/sagans_the_demonhaunted_world/",
        "text": "[removed]",
        "created_utc": 1510374411,
        "upvote_ratio": ""
    },
    {
        "title": "How do I respond this argument?",
        "author": "Vortex_Gator",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7c2oth/how_do_i_respond_this_argument/",
        "text": "Somebody I know tends to say things along the lines of \"you can't just demand god comes and presents himself for you, you can't even demand the presence of the president\" and \"how do you know the president exists?, it's just faith\".\n\nHow am I supposed to respond to this?, he's essentially saying that it takes as much faith to believe other people and the police/courts (ie the \"accessible representatives\" of the president) and whatnot that the president exists and isn't just a lie in general, as it does to believe other people and prophets/preachers/religious institutions (ie the \"accessible representatives\" of god), that god exists and isn't just a lie/made up.\n\nAnother (maybe more important) aspect of the analogy is that expecting god to reveal himself is unreasonable, and shouldn't be necessary to believe in him.\n\nHow am I meant to respond to this?, I brought up TV and public appearances, but that could \"just be an actor\", not a necessary indication of an actual controller of the country, also \"you don't believe Rick and Morty or Dr Who just because they're on TV\", something about the arguement sounds wrong obviously, but I can't pin down what it is.\n\nEDIT: I forgot to mention that he's a Hare Krishna, not a Christian, so counter-arguements towards Christianity specific things won't be persuasive to him.",
        "created_utc": 1510336162,
        "upvote_ratio": ""
    },
    {
        "title": "Class discussion of Nietzsche and his work toward atheist philosophy.",
        "author": "Art3misAttack",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7c2nv6/class_discussion_of_nietzsche_and_his_work_toward/",
        "text": "I️ am currently enrolled in a 400 level class in a US university. This class happens to be about religion in German culture. My professor decided to spend a week talking about Nietzsche - great. Well, it turns out that he spun Nietzsche’s ideas so that my professor’s lecture was “Nietzsche as a Christian”. Long story short, my professor spent a week lecturing on how Nietzsche was a Christian, atheists and philosophers use him incorrectly, and how Nietzsche would be appalled by what happened to his “holy writings” in today’s society. \n\nI️ now have the ability to write a paper about Nietzsche in any format - but the professor obviously wants me to agree with him. \n\nCan anyone help me find sources proving Nietzsche and his works (outside of his essay “The Antichrist) were atheist? ",
        "created_utc": 1510335932,
        "upvote_ratio": ""
    },
    {
        "title": "Now that science is true, how do religious people cope with it? Do they accept it?",
        "author": "inTheSuburbanWar",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7c0v49/now_that_science_is_true_how_do_religious_people/",
        "text": "Or do they still believe things like God makes the rain or natural disaster is God's wrath and punishment for their sins and all those kinds of stuff? How is it even possible that, in this modern world, people still believe such thing?\n\nOr even to believe that a holy unit exists somewhere up there high above, do they know that such thing doesn't really exist but they still choose to \"force\" themselves to believe because their religions say so? Or do they actually genuinely trust that their God is real and is watching over them?\n\nAre there any natural scientists who have religious beliefs? If yes, how do they make sense of the fundamental conflict between their religion's view and their profession's view on nature?\n\nI grew up in a non-religious society and I personally have little exposure to religious people so I don't really comprehend what is going on inside their heads. A little bit of insight would help me understand such rationale of believing in something that is scientifically nonsensical.\n\n**EDIT:** yeah the wording was a bit problematic, what I meant was that science is not regarded as telling the truth about how the world works, it's of course been true since the world started.",
        "created_utc": 1510317921,
        "upvote_ratio": ""
    },
    {
        "title": "I will never understand this",
        "author": "igotgroped",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7bygor/i_will_never_understand_this/",
        "text": "\n\nWhy is there no christianphobia? judaismphobia? hinduismphobia?\n\nWhat is irrational about hating and fearing a religion that orders slavery, sex slavery, wife beating, pedophilia, stoning, homophobia and misogyny?\n\nWhy are exmuslims labelled as \"fake\" or \"jewish spies\" or \"never really muslims\" but never ex-christians?\n\nWhy don't exchristians get accussed of Christianphobia?\n\n\nThere is one cold, hard truth I've realized as a young exmuslim. No one, I repeat no one, gives a shit about us and what we suffer. Because being politically correct is more important. Life is unfair as fuck.",
        "created_utc": 1510283189,
        "upvote_ratio": ""
    },
    {
        "title": "How do i respond to this?",
        "author": "igotgroped",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7bwnd6/how_do_i_respond_to_this/",
        "text": "Muslims say slavery was ok because it was prisoners of war.\n\nMuslims say sex slavery was ok because the children born are free.\n\nObviously the Quran NOWHERE says the above two but hey, why not let them have the upper hand.\n\n\nNaturally sex slavery and slavery is immoral no matter when or where, esp since the Quran says its for all times and you cannot disbelieve or not judge in the scripture. So strictly speaking muslims against slavery is a sin.\n\nIt sickens me, but I want to know how to respond to these people?",
        "created_utc": 1510264439,
        "upvote_ratio": ""
    },
    {
        "title": "To me it feels like Lucifer is \"God\" and hes ordering his demons to scare you into worshiping him. Because you don't fully know whats what.",
        "author": "eevee8",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7bw30m/to_me_it_feels_like_lucifer_is_god_and_hes/",
        "text": "I read somewhere that Lucifer can disguise himself as something good. Do I just go by whatever any \"good\" person says? How do I know what decision to make if all I have to go on is blind faith? How do I know the bible isn't some trick? God want's people to praise him, follow him, believe, love, worship, ect... and in return you get something good in the afterlife. Sounds like a massive ego. No way of knowing what it is before hand. He never talks to anyone. I just. I want to believe that there is something. But the way my mind works won't let me. \nAny thoughts?",
        "created_utc": 1510259341,
        "upvote_ratio": ""
    },
    {
        "title": "My theist uncle gave me a book to read, how should I proceed?",
        "author": "scroopiedoopie",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7btv6x/my_theist_uncle_gave_me_a_book_to_read_how_should/",
        "text": "My theist uncle gave my mother (also an atheist) a book to give to me while he was visiting from out of town. The book is called 'Darwin on Trial', written in 1991 by a law professor. I don't want to waste my time with it.\n\nDoes anyone have any experience with this book? At a glance, it looks to be a  'creation-science' approach. Are there any opinions that you guys can offer me about how to proceed with this? I thought about responding to him and telling him that I just don't care to read it, but thanks anyways.",
        "created_utc": 1510240123,
        "upvote_ratio": ""
    },
    {
        "title": "Theists using non faith based arguments.",
        "author": "Borticus_Maximus",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7bn7k0/theists_using_non_faith_based_arguments/",
        "text": "If the believer of any religion is using non faith based methods (such as presupposition and scientific methods) to explain why their faith is correct. Then have they contradicted a tenet in their religion if it’s asking for only faith to believe and to convince others to convert to said religion?",
        "created_utc": 1510165163,
        "upvote_ratio": ""
    },
    {
        "title": "Is the 'bible' true? - Archaeology",
        "author": "moon-worshiper",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7bh5bv/is_the_bible_true_archaeology/",
        "text": "[removed]",
        "created_utc": 1510096807,
        "upvote_ratio": ""
    },
    {
        "title": "God's Plan, a level of satire only believers could believe",
        "author": "Proxyminers",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7bgix3/gods_plan_a_level_of_satire_only_believers_could/",
        "text": "So I came across Christopher Hitchens around April 2017.  I have listen to this man's debates and he was on a level I have never heard.  While he is a jerk in some previous rants/speeches/debates, the best speech I have heard is the Indifference speech.\n\n\nThere are a view versions of the indifference speech.  However, this YouTube clip is by far the best version I have found as it adds in more than just a logical approach towards the idea of a God's Plan proposed by many Creationist or Christians, but a bit of satire and humor that the other versions do not.\n\n\nhttps://m.youtube.com/watch?v=4ndNsE7dL5Q\n\n\nThe above link is for the God's Plan of Indifference.  I hope you enjoy it and discuss anything that you think is interesting from the clip of maybe the best debater we have seen up to today for atheism.  (There are some times the audio is not the best and I apologize for that, but I cannot find another version of this exact speech).",
        "created_utc": 1510091198,
        "upvote_ratio": ""
    },
    {
        "title": "The gunman who opened fire inside a church in Sutherland Springs, Texas, has been identified as Devin Kelly, an Antifa member and Friendly Atheist",
        "author": "ShatnerNiggerFaggot",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7bd4qn/the_gunman_who_opened_fire_inside_a_church_in/",
        "text": "[removed]",
        "created_utc": 1510061053,
        "upvote_ratio": ""
    },
    {
        "title": "[advice] I (a queer trans girl) am being asked by my work to ask for donations from customers that will go towards a catholic homeless shelter.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7bb6fa/advice_i_a_queer_trans_girl_am_being_asked_by_my/",
        "text": "[deleted]",
        "created_utc": 1510032809,
        "upvote_ratio": ""
    },
    {
        "title": "U.S. Atheist, be ready for the attacks after the shooting in Texas. We do not accept his ideology of violence towards theists.",
        "author": "Proxyminers",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7b6wdd/us_atheist_be_ready_for_the_attacks_after_the/",
        "text": "[removed]",
        "created_utc": 1509991498,
        "upvote_ratio": ""
    },
    {
        "title": "Wow....",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7b5xrx/wow/",
        "text": "[deleted]",
        "created_utc": 1509983151,
        "upvote_ratio": ""
    },
    {
        "title": "Pls tell me it wont happen",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7b5ww6/pls_tell_me_it_wont_happen/",
        "text": "[removed]",
        "created_utc": 1509982926,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any atheists who \"do not like to mess with fate\"?",
        "author": "trytrytired",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7b2z7z/are_there_any_atheists_who_do_not_like_to_mess/",
        "text": "This is not from the point of view that everything is predetermined by God. This is from point of view that everything is complete random chance so that if you intentionally try to steer the course toward a particular course of action then balance of probability suggests that you've probably royally screwed up something else that you hadn't intended.\n\nOr do you consider that whatever course of action you take, the sum total of the outcome has a net affect of zero so it doesn't matter what course of action you take?\n\nEither way, is it worth trying to change the outcome of something before it happens?\n\nEdit: Ok, in responses below, people keep giving scenarios that are not random like avoiding a train and not jumping into a fire.\n\nI am talking about actual random events like what gender your unborn child will be, what idiot you will bump into whom you might eventually want to marry, what college or university accepts you out of high school and what massive major company actually looks at your resume let alone considers giving you a job.\n\nMost of those things are events that you can work toward and contribute to but if you think that you can actually control 100% which company will call you back after a job interview or whether you have a son or a daughter (if you can even get pregnant at all) you are mistaken. Majority of these things are beyond our control and asserting that we just \"knew\" we were gonna get into Harvard, is disingenuous.",
        "created_utc": 1509943861,
        "upvote_ratio": ""
    },
    {
        "title": "Help me out with this my OCD is bugging me",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7aswwq/help_me_out_with_this_my_ocd_is_bugging_me/",
        "text": "[deleted]",
        "created_utc": 1509825621,
        "upvote_ratio": ""
    },
    {
        "title": "Famous non-Christian miracles?",
        "author": "Picards-Flute",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7ao2bv/famous_nonchristian_miracles/",
        "text": "I grew up Catholic learning about things like Lourdes, Fatima, and other such 'miracles'. I later used them as evdience to justify my belief in God... until I investigated them.\nAre there a lot of similar, non Christian examples of so called miracles from recent history ( past 200-300 years)?\n\nEDIT: Does anyone know about any apparition sites like the ones in Lourdes or Fatima? I'm sure there's some of Mohommad or Buddha or something.",
        "created_utc": 1509761415,
        "upvote_ratio": ""
    },
    {
        "title": "Trigger point for Atheist; when given credit to something that never did anything.",
        "author": "Proxyminers",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7alusg/trigger_point_for_atheist_when_given_credit_to/",
        "text": "I have been reading a few posts here on /r/TrueAtheism about attacks by atheist on theist.  After reviewing the posts and digesting the content.  I think giving credit to something other than who actually did something is one of many trigger points for atheists.\n\n\n**Example 1:**\n\n&gt; Thank (Blank) that we did not crash.\n\n\n**Example 2:**\n\n&gt;Thank (blank) that no one got hurt/died.\n\n\n**Example 3:**\n\n\n&gt; Thank (Blank) your surgery went well.  (Thank [Blank] your life was saved.)\n\n\nDo you see a common theme?  People give thanks to something they believe instead of the people who did the action.  Atheist seem to be very materialized/naturalized, which means they follow the idea that they or another living body are the interventionist.  I know this is a trigger point for me.  I know luck plays a part in some situations, but the majority of time it is someone else or something else that was the interventionist in most occasions.\n\n\nWhat should be said is as followed:\n\n\n&gt; Q1: Thank (you, the pilot, the driver, etc.) that we did not crash.\n\n\n&gt; Q2: Thankfully no one got hurt/died.\n\n\n&gt; Q3: Thank the surgeon/doctor your surgery went well.  (Thank the surgeon/doctor for saving your life.)\n\n\n*EDIT: The above post can be interpreted as someone literally believing that something did everything or a cultural norm of saying it as a statement.*",
        "created_utc": 1509738537,
        "upvote_ratio": ""
    },
    {
        "title": "Do the sana manuscripts prove Islam is a load of garbage?",
        "author": "notdumb1styear",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7aef4b/do_the_sana_manuscripts_prove_islam_is_a_load_of/",
        "text": "The palimpsest known as ‘DAM 0 1-27.1’ contains at least 38 Quran leaves. They were each written on parchment with an approximate size of 36.5 x 28.5 cm. Since on the majority of the leaves a primary text is visible and both texts contain parts of over 70 % of today’s Quran, the palimpsest must be a remnant of two, previously complete, yet different Qurans. ‘Folio 16r’2 below contains Surah 9:70-80 in the less visible primary writing and Surah 30:26-40 in the better visible secondary writing. The numbers on the right side of the image written in cursive type refer to the lines of the earlier, primary text. The normal ones identify the lines in the later, secondary text. \n\n Several words are missing within a paragraph leading to a different meaning:4\n\nSahih International translation: ‘… (if) they turn away, Allah will punish them with a painful punishment in this world and the Hereafter. And there will not be for them on earth (any protector or helper.)\n\nSana'a manuscript, ‘DAM 0 1-27.1’, translation: ‘… (if) they turn away, Allah will punish them in this world. And there will not be for them on earth (any protector or helper.)\n\nThe finishing letter, ‘Alif’, in ‘yatawallaw’, ‘they turn away’, found in today’s standard text of the Quran is missing in the early manuscript under discussion, as indicated by the empty box with a black frame above. Moreover, in the the verb ‘yu’addibhum’, ‘he (Allah) will punish them’, found on ‘Fol. 16r, Z.13’, is not explained with ‘adaban aliman’, ‘with a painful punishment’, as in the Standard Text (StT). There one finds ‘fi‘l-dunya wa-‘l-ahirati’, ‘in this world and in the Hereafter.’ The Sana'a manuscript contains only ‘in this world’ and therefore fits better with the end of the verse in both versions: ‘And there will not be for them on earth any protector or helper.’\n\nB. Words are different from today’s Quran:5\n\nThe shaded area above indicates uncertainty. Instead of the word ‘gahannnamu,’ ‘hell’, found in the Standard Text, the old manuscript version contains the synonym ‘l-naru’, ‘the fire’, found in the box with the interrupted frame. It is almost identical with a parallel text found in today’s Surah 24:57:\n\nThe word ‘yaqsimuna’ in the old manuscript, found in the box with the interrupted frame above, has been replaced by the different, yet synonymous, ‘yahlifuna’, ‘they swear,’ in today’s Quran. The words that follow, crossed with horizontal lines, have been reconstructed with certainty. Behind the ‘Kaf’ of ‘kalimat’, ‘(the) word’, a part of the manuscript is missing. The grey, shaded area indicates uncertainty about the original word. The room left on the parchment allows only for ‘(ka)limata ‘l kufri’, ‘(the) word (of) the disbelief’. The next line in the manuscript starts with ‘wahammu bima lam yanalu’. Therefore, the phrase ‘wakafaru baʿda is'lāmihim’, ‘and disbelieved after their (pretense of) Islam’,6 is only found in the today’s Standard Text. The three words missing in the text form used by the old manuscript are again indicated by the white box with the black frame.\n\nWhereas the secondary text of the examined palimpsest comes close to the content of today’s Quran, it is still not 100% identical. None of the numerous changes under discussion are mentioned in the Qirâ'ât literature that is concerned mostly with methods of pronunciation used in the recitations of the Qur'an. The changes are also different from those found in the collections of the Quran by Ibn Mas’ud, known primarily for the absence of Surah 1, 113 and 114, and Ubay bin Ka’b who listed two additional Surahs.7\n3. Questions of Muslims answered\n\n\n#***tl:dr, quran claims it has never been changed. we have found a quran with HUGE changes in it***\n\n\n\nApologetics:\n\nbut those were the Qurans that should have been burned!\n\n\nMe:\n\n\nSo you admit they were serious differences in the Qurans?\n\nEven if Mo (police be upon him) told Osman which Quran to burn and which to keep, then it still proves the Qurans have been changed/tampered with/duplicated.\n\n\nI need help refuting the last point.",
        "created_utc": 1509655272,
        "upvote_ratio": ""
    },
    {
        "title": "I NEED 10 VERSES FROM ATHEIST (BIBLE)",
        "author": "THEDOMEOFGOD",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7aa3ej/i_need_10_verses_from_atheist_bible/",
        "text": "[removed]",
        "created_utc": 1509609722,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism on the decline world wide",
        "author": "ObamasDeadMom",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/7a6of8/atheism_on_the_decline_world_wide/",
        "text": "[removed]",
        "created_utc": 1509571198,
        "upvote_ratio": ""
    },
    {
        "title": "The Methadone Manifesto",
        "author": "wakeem01",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/79qn2e/the_methadone_manifesto/",
        "text": "[removed]",
        "created_utc": 1509396733,
        "upvote_ratio": ""
    },
    {
        "title": "Animated Muhammad Documentary",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/79cpyx/animated_muhammad_documentary/",
        "text": "[removed]",
        "created_utc": 1509226119,
        "upvote_ratio": ""
    },
    {
        "title": "The Orville",
        "author": "dpjonestown",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/79cmuz/the_orville/",
        "text": "[removed]",
        "created_utc": 1509225167,
        "upvote_ratio": ""
    },
    {
        "title": "Animated Muhammad Documentary",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/79cl7r/animated_muhammad_documentary/",
        "text": "[removed]",
        "created_utc": 1509224661,
        "upvote_ratio": ""
    },
    {
        "title": "The real problem is not belief in God, but belief in religion",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/795ras/the_real_problem_is_not_belief_in_god_but_belief/",
        "text": "I don't really care if people believe in God and leave it at that. The problems really seem to come from people believing in God and also believing that God has told them how to live in the form of a book or religion. \n\nThe curious thing is that the two things are nearly always found together. There aren't a whole lot of people who just believe in God, and nothing else. The vast majority of people believe in God, *and* that he wrote the Bible, or he wrote the Quran, or he wrote the Book of Mormon, or he revealed himself in some such way. \n\nThis is a problem. People don't just believe in God and go about their business. They believe in God, *and* that God is on their side, *and* that they know the will of God, *and* that God wrote a book, *and* that society has to be ruled by God's dictates per his book, and so on. \n\nI only want people to be atheists insofar as it stops this problem. If people can just as easily become deists and thereby solve this problem, then that's fine by me. \n\n\n",
        "created_utc": 1509135386,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about virginity?",
        "author": "theThink42",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/792cmz/how_do_you_feel_about_virginity/",
        "text": "I feel like the concept of valuing virginity is mostly a religious one. As far as I can tell, it's just a social construct. Does anyone here hold any value to this \"purity\"? If so, I would be interested to know why.\n\nI thought of this when an agnostic friend of mine mentioned they valued their virginity. I said I didn't, and they asked my why. I said I couldn't see any reason too, and asked why they did. I was hoping to have an interesting discussion about the value of saving yourself, but they couldn't come up with a reason. I was disappointed by this, and wanted a more meaningful discussion on that topic.\n\nI can't see any good reason to save myself. I want someone to try to change my view because I feel that would help me reflect on myself, but any arguments I've seen have been weak. For example: It will mean more if your first time is with the most important person to you. This is a fair point, but it is impossible to tell who the right person would be to lose your virginity to. Other than this, most arguments have been religious bullshit or fear mongering, which I don't really see the point of anyway.\n\nConnected to this, why do you think churches value virginity? There doesn't seem to be any logical reason for god to hate sex. He would have had to create it, and it is necessary for survival.",
        "created_utc": 1509099460,
        "upvote_ratio": ""
    },
    {
        "title": "Big Bang. My thoughts of the subject to how it all happened.",
        "author": "Proxyminers",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/78rqvl/big_bang_my_thoughts_of_the_subject_to_how_it_all/",
        "text": "[removed]",
        "created_utc": 1508975080,
        "upvote_ratio": ""
    }
]