[
    {
        "title": "What’s the point of symbolism in film? (Pinocchio, Jodorowsky, etc)",
        "author": "aurochs",
        "url": "https://www.reddit.com/r/TrueFilm/comments/znjeh7/whats_the_point_of_symbolism_in_film_pinocchio/",
        "text": "In the director commentary for Holy Mountain, Jodorowsky points out that certain visuals appear because they are related to symbols from Tarot cards. For example, he has a character who wears a moon earring to associate that scene with the Moon card and its associated meanings- fear, illusion, etc.\n\nInitially I found this really inspiring- I started researching the Tarot and got really inspired by its visual system and storytelling potential.\n\n\"If my main character is the Fool, I’ll incorporate some of that imagery into their scenes, just like Jodorowsky. I’ll put a sun on his shirt and have him pick a white flower. No, maybe that’s too literal. There’s no reason I need to put that stuff in there.\"\n\nThen I watched Del Toro’s Pinocchio. In several scenes, Pinocchio is holding white flowers. I instantly thought of my own project but thought it was just coincidence. Then he uses a sun symbol as his signature to identify himself. Nope, Pinocchio is the Fool in a Tarot system and I see what Del Toro did there.\n\nMost viewers would not see any particular meaning in these symbols. A sun seems arbitrary — Why not have Pinocchio sign as a tree since he’s made of wood? The flowers could be any color, white, blue, yellow. Pinocchio is obviously a fool protagonist, why add the symbolic imagery.\n\nSo what is the point of me recognizing the symbols? Is it just an easter egg? A wink for the initiated?",
        "created_utc": 1671209939,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Counselor",
        "author": "Schlomo1964",
        "url": "https://www.reddit.com/r/TrueFilm/comments/znjcpl/the_counselor/",
        "text": "Ridley Scott's 2013 drug dealer drama was discussed here a couple of days ago.  An extended cut was available on Amazon Prime, so my wife and I watched it last night.\n\nIt is a disappointing film.  The plot is very simple:  a shipment of drugs is hidden in a truck that crosses the USA/Mexico border, heading north.  There are two couples behind this illegal activity:  an experienced drug dealer and his moll (Bardem &amp; Diaz) and an inexperienced lawyer (Fassbender) and his clueless fiancé (Cruz).  There's really only two other characters of importance:  a young man on a motorcycle and another drug smuggler (Pitt).  The truck is hijacked.  All these six characters face the ugly consequences of losing this expensive cargo.\n\nUnfortunately, Mr. McCarthy's screenplay manages to turn this simple story into an utterly bewildering narrative, complete with philosophical discussions and lengthy scenes quite peripheral to the main plot (such as buying an engagement ring).  For boasting a screenplay by a major American novelist, much of this film's dialogue fails to dazzle (there is, however, one clever reference to a great crime film by Lawrence Kasdan).\n\nRidley Scott is a fine director.  All directors make films that fail to fulfill their promise, perhaps because the material doesn't suit their strengths.  Perhaps that is what happened here.  Frankly, border country drug-smuggling dramas are pretty stale at this point (Soderbergh's *Traffic* came out twenty-two years ago).\n\nImagine what someone like Tarantino would have done with this cast!",
        "created_utc": 1671209806,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were Dr. Mann's last words (Interstellar)?",
        "author": "Walmartpancake",
        "url": "https://www.reddit.com/r/TrueFilm/comments/znjawp/what_were_dr_manns_last_words_interstellar/",
        "text": " I’ve rewatched Interstellar recently, and one thing has intrigued me while watching/after the movie. What was Dr. Mann’s (Matt Damon) last were and its meaning? For this topic, I am going to assume (and probably is) that Dr. Mann symbolizes mankind. His symbol and course of action in the movie of selfishness and self-preservation parallel with mankind’s aim in the movie: self-preservation and survival. Moreover, his name, which is honestly a giveaway, which is ‘Mann’ for mankind. \n\n Whit that in mind, let's look at the moment when Dr. Mann tries to board Endurance where the airlock depressurizes and blows up. Before the explosion, Dr. Mann has his speech to Dr. Brand saying, ‘This is not about my life or Cooper’s life. This is about all mankind. There is a moment…’. The audience as well as Dr. Brand and Cooper are not fully informed about Dr. Mann's last words. So, what was Dr. Mann trying to say? This was the question that ponders throughout my day. \n\n We also get the hint that Dr. Mann represents mankind by his last words where he set aside himself and talks about what his actions have to do with mankind. Moreover, what is interesting to point out is how the clash between Dr. Mann and the Endurance crew is ironic by how they are both aiming for self-preservation and survival. However, it can be said that Dr. Mann’s motive was partly due to isolation.\n\n So what were Dr. Mann’s last words? I couldn’t really wrap my head around but I’ve come to think of two. One is how this moment (Dr. Mann betraying the Endurance crew), he (humans) needs to sacrifice other humans to achieve one’s success, in this case, Mann boarding Endurance. This symbolizes how the success of mankind relies on astronauts like Mann, Cooper, and the previous astronauts who contributed to the expedition where lives were taken place. Another is how the Endurance crew just give up alongside plan A. This is because we know that Dr. Mann knows about the failure of plan A and how the equation is unsolvable. So, for him at least, trying to finish plan A was pointless for Dr. Mann. That is why it can be said that Dr. Mann was trying to say how this moment of betrayal shows the failure of plan A thus destroying the hopes of the Endurance crew. This can show how Dr. Mann includes ‘mankind’ in his little speech to Dr. Brand which would ultimately talk about the failure of plan A which is about saving mankind.\n\n Finally, one this to note is that for the transcript for Interstellar, Dr. Mann’s last words are, ‘Brand, I don’t know what Cooper’s told you, but I’m taking control of the Endurance, then we’ll talk about continuing the mission. This is not my survival, or Cooper’s - this is mankind’s- ’. Although very similar to what is said on screen, it shows how his dialogue represents mankind.\n\n Honestly, there are a lot of interpretations of Dr. Mann’s last words but there are some of my far-out speculations. I hope I can see some other interpretations or thoughts regarding Dr. Mann’s words,",
        "created_utc": 1671209671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Bladerunner (1982) About Nazis?",
        "author": "R_Morley",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zni1hx/is_bladerunner_1982_about_nazis/",
        "text": "TLDR— I was rewatching Bladerunner the other day, and I got to wondering: how much of the original source materials themes about Nazis translates to the film adaptation, given that it’s a “loose” adaptation. \n\nOk so, for those who do not know, Phillip K. Dick wrote Deckard in Do Androids Dream of Electric Sheep based off the SS officers memoirs and notes. While he was doing research for A Man In The High Castle, he became intrigued with how SS officers viewed Jews and communists. Essentially, what their own individual mindset was, and he built a villain protagonist off that. \n\nIn Bladerunner, Deckard clearly starts with little empathy towards replicants. They are non-human and he treats them as such, at least in the beginning. He positions humans, and by extension himself, as defined by empathy; a concept of the soul, contrasted with soulless replicants (at least that’s my take on empathy). This does mirror the book’s treatment of spirituality, which itself has some parallel’s to the concept of the “Aryan Soul” which Dick was interested in.\n\nBut to me, that’s where the similarities end. When the plot turns Bladerunner’s deckard into a person capable of feeling empathy towards replicants, it stops the film from exploring the book’s themes of a person who simply can’t feel that (or chooses not to).\n\nAt the same time however, there’s seems to be still be some relationship between his mindset and the source material. But I’m not sure it’s enough for the themes of the source to carry through to the film. \n\nWhat do you think?\n\nEDIT: LOL I posted this and got a captcha asking “you’re human right?” That’s too perfect",
        "created_utc": 1671206460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where I can find Rohmer's filmography?",
        "author": "loserwwwhale",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zngdkv/does_anyone_know_where_i_can_find_rohmers/",
        "text": " It used to be on Mubi and Qubit.tv but they took it out, and the movies have too few seeders to be downloaded by torrent. I wonder if anyone in this subreddit knows any other platform where the movies are available or maybe has one of those rare and miraculous Google Drive folders containing the entire filmography... \n\nIf i happen to find such thing i will share it as well :) Thank you",
        "created_utc": 1671202159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Review: “Hard Target” (1993) Is A Near-Perfect Action Movie",
        "author": "Cinemagotrailers",
        "url": "https://www.cgomovies.co.uk/2022/12/16/movie-review-hard-target-1993/",
        "text": "",
        "created_utc": 1671197143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guillermo del Toro's Pinocchio (2022) Review",
        "author": "AKA_The_Cinephile",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zndre3/guillermo_del_toros_pinocchio_2022_review/",
        "text": "Not gonna lie, this film was amazing!\n\nGuillermo del Toro's Pinocchio is a wonderful stop-motion reimagining of the classic tale of Pinocchio by Carlo Collodi.\n\nFirst and foremost, the film succeeds in capturing the playful and heart-warming tone which made the 1940s classic, Pinocchio, so memorable. This is an important element because this is often what Disney forgets when making live-adaptions of its classic animation films.\n\nSecondly, the stop-motion animation is breath-taking! Like many other stop-motion films, I find it difficult to find any faults because one cannot ignore the amount of time and hard work that goes into developing films of this medium. Everything appears so fluid and I applaud del Toro for choosing this medium as it makes me reminisce of the \"old-school nature\" of the animation in the 1940 film.\n\nUnlike the 1940s Pinocchio, this film leans into the Italian culture and situates the narrative within the World War II period, specifically during Benito Mussolini's reign. For those who are familiar with history, Italy was an ally of Nazi Germany, and Mussolini worked closely with Adolf Hitler. This was one of my favourite aspects of the film as it shares a perspective akin to Taika Waititi's Jojo Rabbit (2019). This film also reminds me of one of del Toro's greatest films Pan's Labyrinth (2006) which also blended fantasy with the World War II setting, while sharing it from a Spanish perspective.\n\nI loved Pinocchio’s (2022) character designs, and the voice acting was well performed, most notably from Ewan McGregor as Sebastian J. Cricket and Christoph Waltz as Count Volpe (one of the antagonists in the film). Let’s be honest, there are very few actors who can portray the antagonist of a film better than Mr Waltz.\n\nI also loved the film’s worldbuilding. All the unique additions to the Pinocchio’s story feel justified and “realistic” within this fantasy world. Without going into spoilers, they for example, explain Pinocchio’s unique appearance, how he came into existence, his deep and difficult relationship with Geppetto and so forth. Like many of his other films, del Toro does well in creating a believable fantasy world. With that in mind, I believe this film was great because it created a new fantastical world (while using the core elements of the 1940s classic), incorporated the World War II reality, and used an beautiful animation medium.\n\nOverall, Guillermo del Toro’s Pinocchio is definitely worth your time!\n\nYours truly,\n\nAka The Cinephile\n\nFINAL REVIEW: 8/10",
        "created_utc": 1671194449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Review for Avatar: The Way of Water. Let's Discuss!",
        "author": "MattStone1916",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zn9ubl/review_for_avatar_the_way_of_water_lets_discuss/",
        "text": "“So There It Was. We Were Water People Now.”\n\n\r  \nWelcome back into the media cycle, James Cameron. Sometimes divisive with critics but always pushing forward, Cameron has often dragged the cinema kicking and screaming into the age of digital wizardry. His contributions to the medium have been rewarded by audiences repeatedly, adored by a burgeoning demographic in the eighties and frequently breaking box office records since releasing Titanic in 1997. But lo! Avatar: The Way of Water may buck the trend – rather than gross the GDP of Suriname, the film may only gross the GDP of Belize – a pittance.\n\n\r  \nThe film follows the continuing lives of Jake Sully and Neytiri. When marines return to seek revenge and use Pandora as a second Earth, the couple must flee from their forest home and into the water of a coastal tribe. There, they must learn to adapt to their new home as Colonel Miles Quaritch, cloned and in an avatar body, searches for their whereabouts.\r  \nAvatar 2 is an impressively large and extraordinarily long film, but there is one constant which is unwaveringly distracting – the high frame rate. Talented filmmakers like Cameron, Ang Lee, and Peter Jackson, occasionally allow hubris to misguide them in their quest for innovation and cutting-edge superficialities. \n\n\r  \nTo this end, all three are desperately trying to incorporate a higher frame rate into their films, which is said to make look film more “realistic,” a supposition I’ve never understood. How does an artificially inflated frame rate, the most standardized metric in art, look more natural to viewers who are accustomed, throughout their entire lives, to the previous standard? I humbly speak for the film-going public when I answer, “it does not.”\n\n\r  \nAvatar 2 further innovates by switching between (perceived) twenty-four and forty-eight frames per second. Although audiences are gifted less high frame rate, the technique only further distracts, as the film schizophrenically cuts between expected motion and horribly smooth action. It’s also bound to greatly confuse those who notice the difference but aren’t in the loop as to why or how. If the practice, inconceivably, becomes the standard, I may never see another blockbuster. Death to high frame rates!\n\n\r  \nAny given viewer’s reaction to Avatar 2 will largely depend on their opinion pertaining to the state of filmmaking currently, relating to its trajectory since the release of the previous installment. Those pining for the days of practical effects and tangible sets having nothing to look forward to, but those accustomed to CGI spectacles will be comfortably pleased.\n\n\r  \nAvatar 2’s effects are not dated, bland, or indulgent; most of the CGI is beautifully textured and necessary for the film’s sweeping camerawork and general scope. The problem is that the underlying failures of computer-generated imagery are stalwart: the characters and objects are weightless, and the physics remain uncanny, even if the aesthetics are often breathtaking.\n\n \r  \nIn 2009, the ambition of rendering the majority of a live action film in a computer (one which looked magnitudes more convincing than even the most impressive CGI of the time) was daring enough to justify a tradeoff in verisimilitude. The first film became the highest grossing film of all time (no, not adjusted for inflation) because general audiences had never seen such expansive use of CGI outside of a Star Wars prequel.\n\n\r  \nNow…it’s all they know. Viewers will see CGI landscapes and effects in at least two trailers immediately preceding the film (Quantumania and Guardians of the Galaxy 3) which are just as colorful, creative, expansive, and busy. They might be cheaper, not as luxuriously rendered or detailed, but the novelty is long dead.\n\n\r  \nPre-armed with knowledge of the industry over a decade, and the alarming gap between the two films, it’s reasonable to assume Cameron would ration considerable time, energy, and attention to his script – he has not. Motivations, character development, and structure are still laughably childish and thin; despite the 195-minute runtime, the film is largely uneventful. Obviously, Cameron’s M.O. this time around is showing off the technological progress and giving audiences a 2001-esque peak into his imagined world, but it’s not creative or unique enough to warrant the length or simplicity.\n\n\r  \nFilling the void when spectacle fizzles is grating “character work” mostly centering around the offspring of our previous protagonists, Jake and Neytiri. The children are seen as outsiders to the new tribe and are challenged to fit in for the sake of peace and harmony, a plotline which derivatively borrows from the first film, itself an already-tired Dances with Wolves retread. \n\n\r  \nThis desolate, barren story soil could be given fresh nutrients with intriguing characters or complex dynamics; instead, Cameron bashes his audiences over the head with one of the most well-trodden and insipid themes of the modern age. It’s amusing: a character from a preceding Shazam trailer mockingly references the Fast and Furious films and their shallow fixation on “family,” which is followed by Avatar 2’s three-hour opus to the word. There’s probably some dystopian subtext to the recent fetishization of familial love, but the surface-level triteness alone signals a need for a new dead horse to brutalize.\n\n\r  \nAdditionally, the dialogue is laughably blunt, a painful mix of direct verbalizations of feelings and irrelevant, throwaway banter, all articulated by way of grade-school-curriculum diction. The first fifteen minutes are also dedicated to narrated exposition, so rushed and pandering that Rise of Skywalker is blushing in the corner. If, as some have said, the first Avatar gained no cultural traction because it simply lacked a story and characters worth remembering, Avatar 2 will suffer the same relative obscurity. I hope the international grosses are worth all the monosyllables. \n\n\r  \nThe performances are dutiful but unremarkable. Unlike the original, there’s seldom a scene with real humans in the film, so the motion capture is forced to do the heavy lifting. Actors become voice actors, and only Zoe Saldana musters genuine feeling without being seen. \r  \nTo be fair to Sam Worthington, Stephen Lang, Kate Winslet, and Cliff Curtis, the characterizations are too stiff and flat for any detailed emotion. Similarly, Jamie Flatters, Britain Dalton, Trinity Jo-Li Bliss, Jack Champion, Bailey Bass, Filip Geljo, and Duane Evans Jr. work admirably as the scuffling youngsters.\n\n\r  \nAvatar 2 is exactly what audiences hope it won’t be: a retelling of the original film in a different location, excruciatingly predictable and free of any character, thematic, or intellectual intrigue. Every story element and conservational ideal has been done before, and better.\n\n\r  \nHowever, this was also true of the original; it will be interesting to see if the technological promise and spectacle of the sequel are enough to lure audiences into theaters like they were a decade and change ago. Personally, the film evoked no particular emotion, but it did put me in the mood for Planet Earth. At least David Attenborough provides narration for subjects who can’t already talk. \n\n3/9",
        "created_utc": 1671179265,
        "upvote_ratio": 0.67
    },
    {
        "title": "More arthouse films like Paris, Texas",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1671177677,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Buddha worshiper",
        "author": "JosephBrown2000",
        "url": "https://vimeo.com/728703967",
        "text": "",
        "created_utc": 1671159343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casual Discussion Thread (December 16, 2022)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zn0m6q/casual_discussion_thread_december_16_2022/",
        "text": "General Discussion threads threads are meant for more casual chat; a  place to break most of the frontpage rules. Feel free to ask for  recommendations, lists, homework help; plug your site or video essay;  discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n**Follow us on:**\n\n* [Letterboxd](http://letterboxd.com/truefilmreddit/)\n* [Twitter](https://twitter.com/truefilmreddit)\n\nThe sidebar has a wealth of information, including the subreddit  rules, our killer wiki, all of our projects... If you're on a mobile  app, click the \"(i)\" button on our frontpage.\n\nSincerely,\n\nDavid",
        "created_utc": 1671148810,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Movies Were Made Without Computers",
        "author": "MileJonesJr",
        "url": "https://www.youtube.com/watch?v=GWOIGNedxMQ",
        "text": "",
        "created_utc": 1671122311,
        "upvote_ratio": 1.0
    },
    {
        "title": "TIL: the only truly good3D films are from the auteurs (Scott, Scorsese, Cameron)",
        "author": "BlackCosPlayBackPay",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zmpcmh/til_the_only_truly_good3d_films_are_from_the/",
        "text": "James Cameron is hyper-commited by making an entire franchise in 3D. \n\nScorsese dipped his toes and made something excellent with Hugo.\n\nRidley Scott apparently made Prometheus in 3D (my top 5 sci-fi) and now i have to find a way to see it. But he also wanted to do more i think and make the Martian in 3D as well unfortunately this didn't happen, it would have been more interesting i think to watch a really old actor (matt damon) acting by himself for 2hrs",
        "created_utc": 1671121804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should You Subscribe To The BFI Player? I made a video talking about my thoughts on this UK streaming service, let me know what you think?",
        "author": "shaneleeharrison",
        "url": "https://youtu.be/FLl9Bymp7ZM",
        "text": "[removed]",
        "created_utc": 1671106161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tilda Swinton plays two siblings again...",
        "author": "Reishi24",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zmiriw/tilda_swinton_plays_two_siblings_again/",
        "text": "First *Hail, Caesar!*, then *Okja*, and now *Pinocchio*. Apparently she also plays both mother and daughter in *The Eternal Daughter*. Did I miss any?   \n\n\nIs it because filmmakers trust her to bring nuance into each part of these \"doubles\", or is it some sort of typecasting where she's just come to be associated with unusual artistic practices like having the same person play two closely related roles? Any insight into any of these films, and her roles in them?",
        "created_utc": 1671103336,
        "upvote_ratio": 1.0
    },
    {
        "title": "What film changed your life?",
        "author": "rejahcsleoj",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zmg8im/what_film_changed_your_life/",
        "text": "[removed]",
        "created_utc": 1671093425,
        "upvote_ratio": 1.0
    },
    {
        "title": "What film changed your outlook on life for the good?",
        "author": "rejahcsleoj",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zmfzx9/what_film_changed_your_outlook_on_life_for_the/",
        "text": "",
        "created_utc": 1671092447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doesn't Guillermo del Toro's Pinocchio (2022) significantly alter the tone and message of the book?",
        "author": "Victorian_Poland_2",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zm6ia3/doesnt_guillermo_del_toros_pinocchio_2022/",
        "text": "I've just finished watching Guillermo del Toro's Pinocchio movie. I did enjoy myself, although I am not sure how much I like the animation technique.\n\nBut, there's something that bothers me. It has been a long time since I last saw the original Disney film (I am aware this film does not acknowledge it), and an even longer period of time since I read the original book. Indeed, I am not sure I have ever really read it, it may have just been an abridged version for kids.\n\nEither way, though, does this movie not omit a ton from the book? Does it not alter its message?\n\nFor example. I believe there was a scene of Pinocchio being hanged. I don't recall it being featured in the film.\n\nThe book's message was a warning to young kids that they must not disobey their elders. In this movie, Pinocchio never does anything wrong. The only time he disobeys his Papa is when he goes with Il Conte Volpe, but he does not do that out of malice of ill will. How is that consistent with the tone of the book, which was a warning not to misbehave?\n\nPlease don't be rude, I am, quite simply, curious if anybody else has noticed it, and whether I might be wrong.",
        "created_utc": 1671062594,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am DB Cooper",
        "author": "WitnessRealistic3015",
        "url": "/r/movies/comments/zm4dob/i_am_db_cooper/",
        "text": "",
        "created_utc": 1671057640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does Tokyo Story tower in popularity above all other Ozu films?",
        "author": "RopeGloomy4303",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zm2dvg/why_does_tokyo_story_tower_in_popularity_above/",
        "text": "First of all allow me to clarify that I really love Tokyo Story, I think it's easily one of the finest films Yasujiro Ozu ever released (though my personal favorite would be Floating Weeds). \n\nHowever, it has always puzzled me how it seems to receive far more attention than anything else he has released. I mean Late Spring, his second most voted film in IMDb literally has 45k less votes, and in polls it's always dozens of spots ahead of anything else, if not usually the only Ozu represented.\n\nThis is especially confusing since it's not at all different from Ozu's usual wheelhouse. Same themes, same budget, same genre, same cast, even same plot more or less... what does this movie do that's so unique in his filmography to merit all this attention?",
        "created_utc": 1671052406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every once in a while a film suffers from the \"THE interpretation\" fallacy.",
        "author": "toastypyro",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zlwlx3/every_once_in_a_while_a_film_suffers_from_the_the/",
        "text": "Has anyone noticed a very particular kind of online discourse that's really reduced some arthouse films this decade, where people here of one easy interpretation and then decide the movie is too simple or 'easy to get'? \n\nI heard Mother! mentioned in another thread and this is the one that even I fell victim to. I haven't seen Mother! yet. And I'm almost certain I would have by now if during its run, which I was hyped for, I read about the Bible interpretation, where all the events recreate the bible. The way people describe it is as if that's what the point of the movie is, so since we all easily get that, it's a dumb story. And without spoiling myself of anything (I plan to watch it finally), I can already tell there's no way that's how it works. I went to Catholic school and have gone over the Bible front to back, so I would definitely pick up on the parallels. But that isn't what film is. Theories like these are pushing the viewer to see film as a one-dimensional puzzle with an answer. To ignore every other aspect of a film--like why did Aronofsky frame it as a woman in a house, or choose all the ways the bible stories are filtered. I imagine Mother! doesn't look and feel like any of those bible animated stories I've seen as a kid. If there are inspirations to the basic structure or plot of a film, it still isn't a flat remake with nothing to say. It can in fact be incredibly little to the message or theme being told; maybe it was just used as a way to streamline the plot, or in this case, evoke stories that are a large part of the viewer-base's subconscious. \n\nA second film that falls into this is a favorite of mine: The Killing of a Sacred Deer. As soon as I see people write it off as \"just a retelling of a greek myth of Iphigenia\", I know they haven't actually engaged with the film at all. It doesn't even follow that original story. What about how we're following an upper crust family in the modern medical world? That the 'god' is Keoghan's creepy-dorkish kid? The entire Lanthimosian tone of the thing? They literally mention the myth in the movie, and this serves a specific purpose in hinting that one character actually knows this story so well they might be seeing what's happening around them as echoing it. And the big, central ethical choice given to the main character does come from a lot of myths of the Old Times. But that's about it for it's direct input into the story. When discussing why Killing of a Sacred Deer deeply impacts me, it has nothing to do with Iphigenia and all to do with... what's in the movie. But there's something tempting about an admittedly obtuse film being reduced down to 'oh it's a retelling of an old story.\" \n\nI don't think we should ever fall for this mistake, even when it randomly gets popularized in online reviews or threads about films. Allusion is a narrative device; it doesn't mean the work using it has nothing new to say. Have any other films been treated this way? I only ever think of these 2 as glaring examples.",
        "created_utc": 1671038235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watched Good Will Hunting for the first time, thought if it came out today it would not get nearly as much praise. In my opinion, for good reason.",
        "author": "Summer1Man",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zlst41/watched_good_will_hunting_for_the_first_time/",
        "text": "I watched Good Will Hunting for the first time, and while it has some good actor performances, as a movie it is really mediocre at best. For the first time, a movie over 8/10 on IMDb with some many votes surprised me this much. \n\nThe plot makes no sense, that is clear. I mean it is a movie but to state the obvious; you won't *learn* math with no education in any meaningful/ academic sense. Also, you won't get a job at the NSA with any such knowledge. Anyway, it is a movie but that is not all.\n\nCharacters are completely weird and out of this world. What are those therapists? Including Robin Williams's character. It's not the guys fault they wrote the character like that but it is edgy, cheesy and without direction all at once. \n\nSo what was his character arguing exactly? Let me try to sum it up; Go fail, but also don't fail even if you fail does that mean you've really failed? His roommate math professor wasn't any better. What does he want our genius to do? Work at a think thank? I mean he could get a college education but for some reason that is out of the question.\n\nSo, characters motivations are unclear at times and make no sense other times. Plot doesn't make any sense. Last but not least; why leave your friends without saying goodbye? What is the point of that? What is the point of being like \"bye losers, see you never\". You could just leave like a sane person.",
        "created_utc": 1671029117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know what happened to Marion E. Wong?",
        "author": "film_school_graduate",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zlhgyw/does_anyone_know_what_happened_to_marion_e_wong/",
        "text": "She was apparently a filmmaker in the early 1900s. She was awesome, she was a screenwriter, director, producer actor and costume designer that started her own production company. And it seemed promising, but she only made one movie that never made it to distribution and there's no information about her. She just vanished. What happened to her prodco, her film, her life? Does anyone know anything all I'm finding on google is basically this same info, but I'd love to learn more about her and why she was forgotten.",
        "created_utc": 1670992290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Films from 2010 onward that will have their revenge",
        "author": "BigWednesday10",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zlf0c1/films_from_2010_onward_that_will_have_their/",
        "text": "There are many films that are considered classics or among the greatest films of all time that received mediocre, polarizing or even downright hostile reviews such as Vertigo, Night of the Hunter, Intolerance, Peeping Tom, Gertrud, Bigger than Life, The Thing and more. \n\nIt usually takes time for such re evaluations to happen. So my question is, what are your picks for movies made since 2010 that received a mixed or downright negative reception that will eventually have their day or be reclaimed? You may be right, you may be wrong, but I’m looking forward to seeing what you defend and what you’re waiting on for your “I told you so” moment.\n\nAnd guys, please don’t pick a movie that actually got a lot of great reviews when it came out. I tried asking this question on another forum and I got a lot of movies with 80% or more on rottentomatoes, movies that are ranked fairly high on TheyShootPicturesDon’tThey 21st century list, etc. What I really want in regards to picks are movies that really not a whole lot of people are hailing or championing. Have it at friends.",
        "created_utc": 1670985313,
        "upvote_ratio": 1.0
    },
    {
        "title": "What a fun or interesting that you know about a film director?",
        "author": "dogmanstars",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zl6e8e/what_a_fun_or_interesting_that_you_know_about_a/",
        "text": "[removed]",
        "created_utc": 1670964270,
        "upvote_ratio": 1.0
    },
    {
        "title": "The use of non-professional actors in film and people's favorite performances by non-professional actors",
        "author": "cmrta4",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zkyz1m/the_use_of_nonprofessional_actors_in_film_and/",
        "text": "I recently watched Ken Loach's *Sorry We Missed You* and was really moved by Debbie Honeywood's performance. I was even more impressed after reading that it was her first role she had ever been cast in. \n\nIt got me thinking about the use of non-professional actors more broadly, and how the use of non-professional actors is common in films that center on working- and lower-class people, or people on the outskirts of society. Some examples that came to mind for me included Chloe Zhao's *Nomadland*, many of Sean Baker's films, Robert Bresson's films, some of Harmony Korine's stuff like *Gummo* and *KIDS*, and another one from Loach, *Kes*.     \n\nDo others have examples that run counter to this pattern? \n\nMore broadly, I'd also love to hear from others about their favorite performances by non-professional actors, or their favorite examples where a director uses non-professional actors in a really effective or impactful way.",
        "created_utc": 1670946815,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laal Singh Chaddha is a way better movie than Forrest Gump. Forrest Gump and Tom Hanks are trash!!!!",
        "author": "KuchKuchHottyHai",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zkoalp/laal_singh_chaddha_is_a_way_better_movie_than/",
        "text": "# 📷Those american idiots don't know anything about making movies, all the hollwood movies, those they all are bad and waste.\n\nForest Gump was lame derivative trash. I mean, seriously Tom Hanks couldn't act. And his lines were boring as hell. And like, it was hard to get into the story, there was just no heart to it.\n\nAnd then Lal Singh Chaddha, an indian reboot of the film improved on this originally dreary and dull concept so well. Aamir Khan is 10x the actor and the man Tom Hanks will be. When Tom saw Lal singh Chaddha he cried so hard in his hankerchief, and flew from America to say sorryes to Aamir and to fall at his feet.\n\nWATCH LAL SINGH CHADDHA ON NETFLIX, YOU WONT BE DISAPPOINTED, TOM HANKS IS A TERRIBLE ACTOR\n\nLal Chaddha singh made me cry and see the beauty in humanity. There was so much nuance and depth, and I love Laal's optisim in the face of difficulties and life challenges,\n\nIt made me tear up. It deserves 10,000 oscars and if you say no, you are chutiya",
        "created_utc": 1670911789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laal Singh Chaddha is a way better movie than Forrest Gump. Forrest Gump and Tom Hanks are trash!!!!",
        "author": "TMS456Calm",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zknwzs/laal_singh_chaddha_is_a_way_better_movie_than/",
        "text": "[removed]",
        "created_utc": 1670910596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lal Singh Chaddha was way better than Forest Gump",
        "author": "TMS456Calm",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zkmzp6/lal_singh_chaddha_was_way_better_than_forest_gump/",
        "text": "Forest Gump was lame derivative trash. I mean, seriously Tom Hanks couldn't act. And his lines were boring as hell. And like, it was hard to get into the story, there was just no heart to it.\n\nAnd then Lal Singh Chaddha, an indian reboot of the film improved on this originally dreary and dull concept so well. Aamir Khan is 10x the actor and the man Tom Hanks will be. When Tom saw Lal singh Chaddha he cried so hard in his hankerchief, and flew from America to say sorryes to Aamir and to fall at his feet.\n\nWATCH LAL SINGH CHADDHA ON NETFLIX, YOU WONT BE DISAPPOINTED, TOM HANKS IS A TERRIBLE ACTOR",
        "created_utc": 1670907824,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some cool little things you all look for when watching film?",
        "author": "ignitionanalytics",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zkalk2/what_are_some_cool_little_things_you_all_look_for/",
        "text": " \n\n* I know there are the signature director shots out there, the only ones I am familiar with would be the kubrick stare, nolan lone man shot, and the tarantino trunk shot.\n* I enjoy looking at cinematography the most out of all the aspects in film. Symmetry, aspect ratio, shot angles, shot distance, or just a simple shot with a beautiful setting.\n* Anything cool with actors/actresses, for instance Christian Bales body transformations from The Machinist to Vice.\n* Set Design???\n* Color patterns\n\nThose are my thoughts when it comes to looking for cool little patterns in film. Is there anything that you all would like to add? Whether it is more examples on what I said above, or anything I did not mention at all.",
        "created_utc": 1670877317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Signifigance of Dubrovnik, Pescara and Majorca in Rosemary's Baby",
        "author": "colorsinmybrain",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zk869i/signifigance_of_dubrovnik_pescara_and_majorca_in/",
        "text": "Is there any special significance of Dubrovnik, Pescara and Majorca in the film Rosemary's Baby?\n\nIn the film Mr. Castevet says  \"Perhaps. But I may stay on in Dubrovnik, or Pescara or maybe Mallorca. We shall see, we shall see\"\n\nI'm just curious why these 3 cities were chosen, specifically as the places Mr. Castevet wants to stay in.. \n\nI did a little research and there are some connections to both the devil and witches for some of these cities, so I'm guessing it might have something to do with that. But then again there are a lot of other cities that have this too. So I wonder why these 3 specific cities were chosen.\n\nThanks in advance.",
        "created_utc": 1670872037,
        "upvote_ratio": 1.0
    },
    {
        "title": "The recent resurgence in appreciation for Burton's Batman films isn't that far off from star wars prequel-nostalgia.",
        "author": "LordDenjikun",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zk73r8/the_recent_resurgence_in_appreciation_for_burtons/",
        "text": "[removed]",
        "created_utc": 1670869811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone heard of this movie? What's your analysis for it? Remembering Jim Thatcher. Quality seem low",
        "author": "NameYeAye01",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zk5j7k/anyone_heard_of_this_movie_whats_your_analysis/",
        "text": "So originally we are given the name Remembering Jeam Thatcher for our psychological course, and it's already a wrong name.  \n\nClosest thing we got Is Remembering Jim Thatcher which is this low budgeted 15 minute short. \n\nhttps://m.youtube.com/watch?v=avt1_VRBmKQ\n\nLet us know what you think of the quality of this movie. Looks crappy\n\nAnd considering other movies were Finding Nemo and Taken, we most probably got the wrong name but wanted to pick your lot brain. \n\nCan you think what we could had mistake the movie Remembering Jeam Thatcher for?",
        "created_utc": 1670866433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did D.W Griffith's Intolerance argument fail? What was he trying to accomplish or say?",
        "author": "ToDandy",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zk51m1/did_dw_griffiths_intolerance_argument_fail_what/",
        "text": " \n\nIn my latest video looking back at 1916 in Film (found here: [https://www.youtube.com/watch?v=X8Lkw-Hv2NU](https://www.youtube.com/watch?v=X8Lkw-Hv2NU&amp;t=19s)) I covered Intolerence in depth. In my analysis, I talked about how the film was made as a response to the controversial reception of Birth of a Nation. I call Intolerence one of the true masterpieces of the silent era, but also note that director D.W Griffith failed in making an argument for his case. My exact words being “like a poor high school debater that accidentally points out data to disprove his own side, so too does Intolerence seem to argue against Griffith”.\n\nBut I wanted to put this question out to this community as well. Did Intolerence fail in its messaging?\n\nMany have looked at Intolerence as addressing Griffith’s very specific concerns surrounding censorship. This is mostly due to the opening text addressing censorship and that when the movie first screen, it included pamphlets tackling issues in censorship. While I do think that issue was a hot topic for Griffith at that time (and continued to be through the first three decades of the medium) I’ve felt that Intolerance never really had the goal of addressing censorship at all. \n\nAfter Griffith was accused of being a racist and white supremacost, he thoroughly believed that it was the public that was being intolerant against *him* and not the other way around. Even today, I’ve seen some film historians argue that is was author of the Clansman and Birth of a Nation screenwriter, Thomas Dixon Jr, who was the true white supremacist believer and that Griffith had simply been drawn to the cinematic nature of source material. I personally find such a view preposterous as Griffith was largely drawing inspiration from the “experiences” of  his father who served as a confederate colonel in the civil war and lived through reconstruction. I believe that bigotry and racism was passed down generationally to D.W Griffith and informed on a lot of his distasteful choices in Birth of a Nation. \n\nIntolerance seems much more focused on the topic of fear, bigotry, and racial/religious divide. I find little to support the censorship claims beyond making a stretch. Religious Intolerence forms the major crux of two of the stories with class bigotry being a heavy factor in the third and a final biblical parallel being made in the fourth with the retelling of the crucifixion of Jesus Christ. The arguments of all four seem pretty universal. Hate is bad and can lead to disaster or great evil acts. It’s a theme repeated countless times through the years in many different stories and it is hardly revolutionary.\n\nBut how does this reconcile with Griffith’s claims that he was the one on the receiving end of public intolerance? The movie itself even addresses people so deep in their own biases that they fail to acknowledge them- this being where, in my opinion, Griffith shoots himself in the foot with his own argument.\n\nIn my video, I refer to Birth of a Nation, Intolerance, and Broken Blossoms as part of a D.W Griffith “Self-Examination Trilogy”. I think Intolerance was Griffith seeking out and trying to find an excuse while Blossoms carries some (half-hearted) acceptance. I think to fully understand Intolerance, we need to put D.W Griffith in the shoes of the victims of the story (even if the shoe most definitely DOESN’T fit). To him, he was telling his truth and was facing rejection for his perspective. That’s how he saw himself. But even with that in mind, by modern examination, Griffith doesn’t work as the victim as “his truth” is so factually off base that we can only put him in the camp with the villains of the stories. His insistence on personal opinion and subjective fact over known history and inclusivity makes him more similar to those in the four stories that commit acts of evil stemming from their own bigotry or delusion. \n\nThis is at least how I tried to reconcile his goals with what he actually delivered. Maybe I am way off base though and would love to hear what some of you think and how you reconcile the messages of Intolerance with Griffith’s goals. ",
        "created_utc": 1670865377,
        "upvote_ratio": 1.0
    },
    {
        "title": "history of romantic film",
        "author": "Gloomy-Ad1087",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zk1akm/history_of_romantic_film/",
        "text": "[removed]",
        "created_utc": 1670857018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trashy, realistic films",
        "author": "Tight-Ad-9683",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zk0qw8/trashy_realistic_films/",
        "text": "Hi everyone.   \nI'm working on a doc project and I'm looking for references -- kind of trashy but authentic films.   \nDoes anyone know any other films in the realm of Trash Humpers by Korine, Stranded in Canton by Eggleston, early but not too early Pedro Costa (In Vanda's Room, Colossal Youth), The Idiots by von Trier?   \nI'm looking for low fi, trashy, realistic films, not necessarily plot driven, but with pure feeling, authenticity, bad taste, homemade aesthetics: like mini dv footage, etc.?   \nIn more popular terms maybe the Joji - Glimpse of Us music video that went viral earlier this year.   \n\n\nNot genre films like The Blair Witch Project or anything like that where the style is a sort of plot device. \n\nThanks!",
        "created_utc": 1670855712,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cannot think of a worse sterilized, whitewashed and dumbed down piece of work than Villeneuve's interpretation of 'Dune'.",
        "author": "cheeze_whiz_shampoo",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zjztt4/i_cannot_think_of_a_worse_sterilized_whitewashed/",
        "text": "Many of you, I'm sure, would categorize the Dune story as no different than a Marvel film. If you've read the book I would genuinely be surprised if you held that opinion but if you haven't I would understand. Personally, I think it is an important book. Not a magnum opus for all coming time but a fun and challenging way for (especially) young people to engage with big, difficult topics.\n\nThe themes and discussion topics it offers up almost seem endless; religion and manipulation thereof, eugenics, class and caste, ecological engagement on the material and spiritual level, authoritarianism, slave mentalities, the subconscious, manifestations and concepts surrounding Divinity, despotism at all layers of society, corruption existing in the rich and poor, groupthink, hero worship, societal corruption coming not just from top-down but also down-up, genetics and the consequences of its manipulation (both good and bad!) along caste lines etc etc etc etc... You get the point. And those are just the ones I could rattle of off the top of my head.\n\nWhat I am saying is that the book offers A LOT to choose from when it comes to theme and exploration and DV chose *none* of it. He took a story overrunning with metaphor, ideas and questions and stripped it bare till literally nothing was left. The film he made was so bereft of content, soul or even simple ideas I couldn't believe it. This story was meant to inspire thought and questioning in young people and the only thing that film may have succeeded in was finally convincing people how awful brutalism is. (Joking, I think the aesthetics were on point, not a direction I personally liked but I truly respected his decision-making in that regard, it was a unique interpretation.) \n\nJust wanted to vent a little about this. It makes me sad that a piece like this, with so much for young people to engage with, is presented in such a intellectually and spiritually sterilized way.",
        "created_utc": 1670853510,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the Most Stereotypical Arthouse Film?",
        "author": "Aemond-One-Eye",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zjxjy8/what_is_the_most_stereotypical_arthouse_film/",
        "text": "I am interested in finding what people consider the archetype of the 'art' film. Not what you personally enjoy or believe has the most artistic merit, but which film most lives up to the common idea of what an 'art' film is. Perhaps it's six hours long, incomprehensibly surreal, difficult to follow, or uncomfortable in presentation. Maybe it's a non-English, morose, monochrome affair or maybe it's a po-faced smug indie made on a shoestring with untrained actors. Whatever it is, this film is what you think of when you think of the pedestrian stereotype.\n\nIf you had to pick one movie, what film do you think fulfils many of the most hackneyed prejudices about the arthouse film?",
        "created_utc": 1670847788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blue-Mima-Kirigo.",
        "author": "HotOwl5076",
        "url": "https://t.me/c/1715538640/14008",
        "text": "",
        "created_utc": 1670847442,
        "upvote_ratio": 1.0
    },
    {
        "title": "i need help finding a movie/tv show",
        "author": "iamthestormthatishe",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zjwz8j/i_need_help_finding_a_movietv_show/",
        "text": " \n\nSenors, i need your help. There is a movie or a show that i remember watching when i was young, but i dont remember the title or the plot. All in know is that it takes place in a desert type area, indicating it's post apocalyptical, I also remember mad max style buggies. But the most distinct feature is that it has character a who i think is the villain, that takes out people's eyeballs as some type of trophy. He did it with his hook or hook hand. The movie/show looked like it was from the late 70s, 80s , 90s or even early 2000s. I don't know from which country it was. That is all i know. I know that the information given is pretty vague but i hope you find it and i will be extremely grateful if you do.\n\nthanks in advance",
        "created_utc": 1670846284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tokyo Sonata - A uniquely Japanese Existential Crisis",
        "author": "Whosegettin",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zjv91e/tokyo_sonata_a_uniquely_japanese_existential/",
        "text": "At the heart of Tokyo Sonata, lies the “double life”, caused by bruised egos that have been built up by the ruthless Japanese Societal system. Throughout Tokyo Sonata, Kurosawa slowly pulls away layers of each of the family members’ second lives until finally, all that remains is a closet full of skeletons. This type of crisis is entirely relatable and makes the film universal at its base level, however, Tokyo Sonata also offers some great insights into what Japanese life looks like, which you don't get much of an opportunity to see if you don't live there. \n\n# Some uniquely Japanese issues that the film tackles are:\n\n**Social Hierarchial System:** Our focus is primarily on the father and his struggles, yet the film does an excellent job of building up narratives in the background. The mother and children's struggles take a ‘back-seat’, which is a great reflection of the social hierarchical system in japan, in which womens and childrens perspectives/opinions are pushed back as the man of the family takes the lead.\n\nThe family doesn't bother each other with their problems. Japan values consensus over conflict. so This plays on those social norms. Since Hierarchy, in fact, is explicitly built into almost every interaction in Japan.\n\n**Homelessness In Japan:** Homelessness in Japan is viewed and caused very differently from in western countries. Almost all homeless people are Middle-aged or older men, who have fallen victim to Japan’s extreme rigid social end economic structure. Homeless in Japan don't beg, do not interact with non-homeless, and are often very well-dressed. Many of these people previously had well-paying jobs and once a man leaves the labor force, it is extremely difficult to return. In Japan, a man is expected to be the sole provider for his family, so when they are shamed by unemployment can often be driven to self-exile as a way to avoid it. For the most part, homelessness isn't viewed as an important social issue in Japan, like it is in Western countries.\n\n# Characters Crisis\n\nWe see **Ryuhei**, the father, get laid off from his job, then struggle to face his wife and family with the news of his unemployment. Instead, he wakes up every morning, acting as if nothing has happened, and heads to “work”. Doing his best to maintain his appearance as the man of the family and the responsibilities that come with that. His future decisions are influenced by his internal anger and embarrassment and end up driving the rest of the family into their own eventual existential crisis.\n\n  \n**Megumi Sasaki** is a housewife whose work is largely ignored by her family, so in the third act, when she gets kidnapped, she becomes painfully aware of her problems so she acts irrationally to satisfy her unfulfilled life. At every opportunity Megumi has at escaping the kidnapper, she decides not to because she finally feels appreciated. She gets to use her driver's license, make love to a man, and also comfort him, but also receiving honesty, which she does not get from her husband.  \nThe older son, **Takashi**, is a typical teenager with plans for his own departure from the confines of his parent’s home. He goes for the most extreme thing he can think of to get away, to join the American Army.  \n**Kenji**, the youngest of the two, runs into trouble at school and secretly, behind the backs of his parent's disapproval, begins to take piano lessons. Later, once Ryuhei finds out about this, he gets abused and thrown down the stairs - leading to injury, but nothing major  \n\n\n# Conclusion\n\n  \nIn the end, the family still feels a need to maintain appearances in the face of their unhappiness. Their strict social roles are the source of much frustration. They don’t even tell each other what has happened in the final scene. Ultimately, Kurosawa does a great job of highlighting gendered dynamics and societal priorities in Japan that may provide the Western world some insight into what it’s actually like to live in Japan, while also highlighting something that many of us can relate to in this age of Existential Angst, the Existential Crisis.   \n\n\n&amp;#x200B;\n\n**Articles Referenced:**\n\n*Blumberg, D. and Blumberg, D. (2010) Kurosawa's 'Tokyo' sonata is truly a brilliant film, PopMatters. Available at: https://www.popmatters.com/126820-tokyo-sonata-2496181649.html.*\n\nMoore, A. (2017) *TAMPOPO: Cultural Guide*, *The Cinessential*. Available at: http://www.thecinessential.com/tampopo-cultural-guide.",
        "created_utc": 1670841410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Andrei tarkovsky's stalker and his faith",
        "author": "georgefurudo",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zjukh8/andrei_tarkovskys_stalker_and_his_faith/",
        "text": "I am not capable of going in-depth with the movie since I saw it for the 1st time yesterday, but while watching it I couldn't help but feel like all 3 characters represented 3 sides in tarkovsky's mind arguing with one another.   \n\n\nStalker is the person who wants to believe in god (In this case what is in the zone) and even feels like his life has more meaning while believing in it, so this is the reason it has color while the outside doesn't.   \n\n\nThe scientist represents the part of his mind that actually tries to deny it along with the writer who both have become more cynical in their lives because of what they have pursued and especially one line of the writer where he tells the other 2 that no one will appreciate you, and they want the same thing until they start complaining seemed to me like something tarkovsky has experienced and turned him more cynical because of that.   \n\n\nI also see stalker as the person who wants to bring those 2 closer to god by showing them the zone and in the end he doesn't go to get his wish because of what happened to porcupine and his hidden desire, and he was scared what might happen to him as well.  \n\n\nI should also say I didn't think much of this, and it was a random Idea that I just got after watching only once, and that I am not a religious person.",
        "created_utc": 1670839404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Once Upon a Time in America: Review and Interpretation",
        "author": "Mike_v_E",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zjtl37/once_upon_a_time_in_america_review_and/",
        "text": "# Once Upon A Time In America is a beautifully crafted film with a captivating story that is the pinnacle of escapism\n\n&amp;#x200B;\n\nThis film didn't only glue my eyes to the screen, it also managed to transport me into a whole different world and time period... a different story. The story and plot are one of the most captivating I've ever seen in a film, especially the first act where the main characters were still little boys. These boys were played by some great child actors that did a great job at giving these characters their own personalities and actually made me care for them. This act consists of the nostalgic memories of the childhood of the main character, Noodles. Sergio Leone crafted this film so incredibly well, that the childhood memories felt nostalgic for me too.  \n\n\nAround the second act we see how the boys grew up into young men. Although I prefered the first act, I still really liked the refreshment it brought into the film. It did this by not only having new actors play the characters we came to know, but also by changing the pacing of the action. The boys matured and so did the violence.  \n\n\nThroughout the film we also see an even older version of Noodles and certain other characters. This is where the plot becomes interesting. Some viewers think that the scenes with the older people are real and some people, including me, think that these scenes are part of Noodles' opium dreams.  \n\n\nThe film begins and ends with Noodles in an opium den. At the beginning of the film, right after Noodles reads that the boys got killed in the bank robbery, we see him laying down and smoking the opium. This is followed by the camera slowly zooming closer to his face. This indicates that we as the viewer enter his mind and everything after that is all happening in his head. In the final scene we see the opium den again, where we also see Noodles laying down again and smoking opium, with the final shot of the film being a focus shot of a smiling Noodles.  \n\n\nSo if the whole film is played in Noodles' opium dream, that means that everything we see up untill the point where Max and the boys get killed in the bank robbery is a memory, everything after that are just flashforwards and never happened. The older version of Noodles is just a way for him to deal with the events of his life, to reflect on his deeds and to forgive himself. The last scene in the opium den is possibly right before the first scene in the opium den, this is supported by the fact that Noodles wears the exact same clothing. In the last scene we see Noodles entering the opium den, while in the first scene we see him already laying down. This means that this whole film is a closed loop and goes full circle.  \n\n\nThe sequence at the beginning of the film, where we hear the telephone ring for a couple of minutes, seems like a strange decision from Sergio Leone. But I think placing the emphasis on the telephone ringing was really well done.  \n\n\nWhen Noodles is laying in the opium den he looks at the newspaper where he sees an article about the death of his friends. Immediately after that he starts hearing the telephone ring, which is heard throughout multiple scenes. We hear it ring through the scene where we see the bodies of Noodles' friends followed by the scene where Noodles is calling the police to tell on his friends. Showing us the cause after the effect, lets us know that Noodles feels guilty about the death of his friends. That one phone call was a very important moment for the main character of the story.  \n\n\nSo Sergio Leone's decision to place the emphasis on the phone call at the beginning of the film by letting us; hear the ringing, see what Noodles did and feel Noodles' guilt, is a very strong introduction to the main character of the film.  \n\n\nNoodles tried to save the life of his friend Max, by tipping off the police about the bank robbery he was going to commit. Unfortunately Max and the other boys got killed during that robbery, as seen in the newspaper in the opium den. It was never Noodles' intend to get any of his friends killed, but it still led to the men at the beginning of the film trying to kill him for being a rat. In one of the flashforwards an older Max asks Noodles to kill him, but Noodles doesn't do it. After that it looks like Max is committing suicide by going into the garbage truck, although we never actually see him do it. To me the stimulation of this specific opium dream indicates that Noodles deep down knows that he didn't kill Max by tipping off the police, but that Max is the reason that he eventually got himself killed because his plan was crazy.  \n\n\nMax being alive in the flashforward parts in the opium dream is foreshadowed in an earlier scene in the film where Max makes Noodles think that he drowned, followed by him eventually appearing alive on the boat. In both cases Noodles thinks Max is dead, followed by him being alive. I think this realization, the good memories he has and the fact that Noodles forgave himself for everything he has done in the past are the reasons why he is smiling in the final shot of the film.  \n\n\nHe forgave himself and is now ready to face the end of his life. An end that might be coming soon, because we are not entirely sure if the worker in the opium den actually woke him up or if that was also part of the opium dream. If it was part of the opium dream, that means that Noodles never killed the men that were trying to kill him for being a rat, which means they are still looking for him in the opium den.  \n\n\nIf they did woke him up, which I believe to be the case, he actually killed the men that were trying to kill him. This would mean he actually went to the train station, where he found the empty money case. The moment when we see the transition from Noodles as a young man to the older Noodles, would indicate that the opium was still in his body and blurred the lines between reality and the opium dream. Which means that everything after this scene would be the opium dream, instead of the earlier mentioned scene with him in the opium den.  \n\n\nThe captivating story and interesting plot are supported by gorgeous cinematography. The cinematography played a huge part in this film, especially in creating the nostalghia of the childhood of the boys. It achieved this nostalgic feeling by using a warmer color palette for some of the childhood scenes and a slightly cooler, more neutral, color palette for the other scenes. This was especially noticable in the beautiful first childhood memory where we see Deborah dancing in a room, that has a warm yellow color palette, creating a strong contrast between the childhood memories and the rest of the film.  \n\n\nThe scene where the boys walk inbetween buildings, with the Manhattan Bridge in the background, is one of the most beautiful scenes I have ever seen. That single shot of the Manhattan Bridge was the reason I decided to watch this film. The depth, aesthetics and mood that were created felt special. Shots like this created scenes that had me in awe, but luckily not all scenes tried to do that. This way the cinematography enhanced the story and plot, but never distracts from it, resulting in coherent visual storytelling.  \n\n\nAnother aspect I should mention are the gorgeous transitions throughout the film. My favorites are when Noodles is laying down in the opium den and the camera zooms in on the light next to him, then zooms out from a street light providing an overview of the dead bodies of Noodles' friends. We seamlessly transition into Noodles' opium dream. My other favorite transition is when an older Noodles is peeking through an opening in the wall and the camera zooms in on his eyes, which you can see slightly move like he is looking at something. The next shot is a beautiful scene where we can see a young Deborah dance in the room Noodles was looking at. Here we seamlessly transition into another memory of Noodles about his childhood, all within the same opium dream.  \n\n\nThe score by Ennio Morricone is just as beautiful as the cinematography. Just like the cinematography, it also played a huge part in creating the childhood nostalghia. Every single piece of music was exactly played when it supposed to during the film.\n\n&amp;#x200B;\n\nThe seemless combination of the cinematography, score, story and acting is the reason why this film succeeds in creating such a captivating film that, for me personally, is the pinnacle of escapism.\n\n&amp;#x200B;\n\n[Watch this review on Letterboxd](https://boxd.it/35oKev)",
        "created_utc": 1670836643,
        "upvote_ratio": 1.0
    },
    {
        "title": "--== Please share your thoughts on new star wars productions. ==--",
        "author": "TA888888888",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zjit68/please_share_your_thoughts_on_new_star_wars/",
        "text": " \n\nI am amazed at the detailed productions of recent star wars universe series. Namely:\n\nStar Wars: The Clone Wars tv series &amp; movie Star Wars: Clone Wars (2003 TV series)  \nStar Wars: The Clone Wars (2008 TV series)  \nStar Wars: The Bad Batch  \nThe Mandalorian s1; s2  \nThe Book of Boba Fett  \nAndor  \nAhsoka (TV series)\n\nThose series are perfect 10/10 productions. I am very impressed. Jaw dropping like... Please recommend other worth series.",
        "created_utc": 1670810033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone can be a critic, which is good but it can also be annoying",
        "author": "H-388",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zjg84i/anyone_can_be_a_critic_which_is_good_but_it_can/",
        "text": "im not saying we should have a degree to be a critic or that we should use big words to criticize a film but damn it ,many don't even know the difference between Plot, Story, Themes and execution, someone would say something like: \"oh this movie sucks because the plot was bad\", bad in what way? a plot is rarely good or bad, a plot merely serves as a vehicle for the themes of a story, are they saying that the execution of the story was bad but they confuse it with \"Plot\"? also they dont expand on what they mean and are not specific, same thing goes for the ones that confuse cinematography with pretty visuals, i had this guy tell me that Taxi driver and older films have bad cinematography because they look grainy and less cinematic like todays movies, i once didnt know these things and thats ok, we dont need to know everything,  im talking about the ones that are very toxic in their criticism and act all cocky trashing movies without understanding these things",
        "created_utc": 1670804667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casual Discussion Thread (December 12, 2022)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zjfgzb/casual_discussion_thread_december_12_2022/",
        "text": "General Discussion threads threads are meant for more casual chat; a  place to break most of the frontpage rules. Feel free to ask for  recommendations, lists, homework help; plug your site or video essay;  discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n**Follow us on:**\n\n* [Letterboxd](http://letterboxd.com/truefilmreddit/)\n* [Twitter](https://twitter.com/truefilmreddit)\n\nThe sidebar has a wealth of information, including the subreddit  rules, our killer wiki, all of our projects... If you're on a mobile  app, click the \"(i)\" button on our frontpage.\n\nSincerely,\n\nDavid",
        "created_utc": 1670803209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this type of shot Scorsese does all the time have a name?",
        "author": "dsgm1984",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zjdh6m/does_this_type_of_shot_scorsese_does_all_the_time/",
        "text": "[removed]",
        "created_utc": 1670799472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Un Prophète and Animal Kingdom: Coming of Age Cinema?",
        "author": "suckabagofdicks-768",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zj7lms/un_prophète_and_animal_kingdom_coming_of_age/",
        "text": "I recently rewatched both Un Prophète and Animal Kingdom. \n\nIt can be argued they’re both about an underdeveloped adult who is almost childlike in their behavior who then turns out to become a real adult, functioning in their own way in their particular environment. Can they as such be defined as a coming of age within the crime genre?\n\nI wanna see more of that.",
        "created_utc": 1670790927,
        "upvote_ratio": 1.0
    },
    {
        "title": "All About Lily Chou Chou should be more well known.",
        "author": "Grand_Keizer",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zj45j6/all_about_lily_chou_chou_should_be_more_well_known/",
        "text": "I don't know what it is about watching underground Japanese films from the late 90's and early 2000's late at night and into the next day. First there was Ritual, which spoke to the very fiber of my being. Then Cure, which unsettled me and made me doubt the fortitude of the human mind. And now, there's All About Lily Chou Chou, done by the same director who starred in Ritual, Shunji Iwai, which makes me doubt the goodness of youth.\n\nThis is one of THOSE movies where you're left speechless and have no choice but to sit through the end credits. I thought I knew what to expect going in, but this movie shattered those expectations and gave me something I'd never seen before.\n\nThe content of the film is so crushing and devastating that I almost wrote it off as simple misery porn for edgy teenagers. And I will say one criticism right now, and it's that the main character isn't much of a character. I know he's timid and weak, and unable to stand up for himself, but he still felt like too much a blank slate, with his only two defining traits being that he's obsessed with Lily Chou Chou, and he get's the shit kicked out of him, physically and emotionally.\n\nWhat convinced me otherwise is what's plain in the title: the music of Lily Chou Chou. She's able to channel the loneliness and despair that's felt by our characters, whether it's the tyrannical and hateful bully, the demure and beautiful piano player, or the broken and damaged fellow classmate. This movie certainly GOES there and has some truly horrifying sequences, disturbing not because of what they show, but what they imply. This music is the only escape from a cruel life where authority is derived from nihilistic hate, and all anyone can do is endure the pain that arises from it.\n\nThere's also the visual style to consider. Some movies use handheld cameras too accentuate a gritty and down to earth aesthetic, while others seek the most pristine resolution, lighting, and composition to create aesthetically beautiful images. Iwai and his cinematographer Noburu Shinoda (may he rest in peace) float between both aesthetics, sometimes to the extreme, shifting to found footage style cameras that exist in the world, and dreamlike sequences that play with seemingly no rhyme or reason, all the while, the movie is punctuated by onscreen text that speaks to the inner feelings of these characters. It's a wonderful achievement that created a visual style that I, for one, hadn't yet seen (I've seen this compared to Yi Yi and Fallen Angels, which I've yet to watch, I must admit).\n\nIt's no wonder that this movie connects with people the way it does. While many will find it obtuse, convoluted, and appalling, many others will connect to this story and the way that story is given life. In between moments of extreme cruelty are moments of serenity and peace, all too fleeting, but all to necessary to hang onto. I think I can relate to that. I think a lot of us can relate to that...",
        "created_utc": 1670785344,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Wicked City: Live Action vs Anime",
        "author": "Boop108",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zj1xko/the_wicked_city_live_action_vs_anime/",
        "text": " This article includes a lot of film stills. If you would like to see the illustrated version click here.\n\n[https://filmofileshideout.com/archives/the-wicked-city-live-action-vs-anime/](https://filmofileshideout.com/archives/the-wicked-city-live-action-vs-anime/)\n\nI watched the live-action version of *Wicked City* not knowing that an anime version preceded it. Knowing that the live-action version was based on an anime might have helped to explain why the live action version was so frenetic and absurd. The live action version is like a runaway freight train barreling ahead without any pauses or lulls. It may not be a good film but you wont get bored. A lot of heads get chopped off, a lot of blood gets splashed around, and a lot of cheap glowing animation zaps across the screen.\n\n*The Wicked City* live-action film is a category ll, Hong Kong horror movie. The genre is typified by lots of blue lights, lots of smoke, lots of the aforementioned animated laser zaps, and of course, lots of slimy, murderous monsters. Most of these films are too stingy with the blood and guts and spend too much time on dialogue, but *The Wicked City* is generous with its depravity, ensuring a fun ride.\n\n*The Wicked City* uses *Men In Black’*s premise. A race of aliens or mutants, called “raptors”, is secretly living amongst us here on Earth. They have magic powers and can change form. For reasons never made clear, these raptors occasionally go on killing sprees. That’s where the Antiraptor Bureau comes in. They are a secret agency charged with keeping humanity, or at least Hong Kong, safe.\n\nAdded to this premise are several subplots. We have the *Romeo and Juliet* angle, where one of the Antiraptor agents falls in love with a raptor. We also have a gay subplot/subtext where a morose, but handsome young agent pines for his partner, and lastly, we have a drug called “happiness” thrown in to the mix. \n\nThere are good raptors who want to keep the peace with humanity, and there are bad ones that want to get humans addicted to the “happiness” drug. If you get hooked, you can’t stop or you will evaporate. \n\nThe happiness subplot is a means of delivering a lot of heavy-handed social commentary about the misery inherent in capitalism. There is a lot of yelling about how humanity’s downfall is its love of money.  \n\nThere is also a whole Jesus thing going on too. Daishu, the leader of the raptors, is a sort of tortured soul. We know this because he uses the eyebrow method of acting employed by Elijah Wood. The principle behind eyebrow acting is pretty simple. Slant your eyebrows inward for anger or concern, and slant your eyebrows outward for sadness, empathy, love, and everything else. By the time *The Lord of the Rings* series was over, I wanted to hold that little hobbit down and shave his forehead clean.\n\nDaishu is played by none other than Tatsuya Nakadai, which was surprising to see. It’s a long way from starring in *Sword of Doom, Goyokin*, and *Three Outlaw Samurai*, to being magically crucified by a magnetic field in a Hong Kong schlock flick. Try saying \"Hong Kong schlock flick\" ten times fast. Daishu not only gets crucified, but he resurrects a few times. I’m not sure what the movie is trying to say, but I think there is a kind of “don’t hate us ‘cause we’re mutants” thing going on, a la *X-Men*.\n\nThere is even a scene where Daishu offers his blood to save a young woman. It would be a little more Christ-like if his blood was red, instead of black, and if it was offered in a golden chalice, instead of being spurted out of a torn vein and splashed onto a naked woman’s body, but the symbolism is still there.\n\nThe gay subtext is fun too. Picture Will Smith making moony eyes at Tommy Lee Jones, or maybe it’s more like Mercutio trying to keep Romeo away from Juliet. In *The Wicked City*, Mercutio is Ken, and he is trying to keep Romeo, who is Taki, from Juliet, who is Windy (that’s her name, Windy). Ken is half-raptor, Windy is full-raptor, and Taki (inexplicably pronounced *mushu* by the other characters) is a human.\n\nIn the all-out gonzo climax of the film, there is a scene where poor Ken is on the verge of death and his boss, who has been cruel to him throughout the film, finally takes pity on him. The boss looks down at the pathetic Ken and says, “Keep calm! You can regain your humanity! You’ve learned how to control yourself.” Ken’s boss doesn’t condone Ken’s “alternate lifestyle choice” to live as a “monster”, but the boss finally shows Ken some compassion. It’s very touching. Meanwhile, up in the sky, there is a man riding a jumbo jet like a surfboard, as he battles with a half-man, half-octopus.\n\nI don’t want to give everything away, but I want to mention my favorite raptor. She is a sex-obsessed creature who likes to turn into machines and then… well, it's hard to explain. At one point, she becomes a pinball machine and has sex with another raptor, who flips her flippers and rams himself into her coin slot. In another scene, she becomes an elevator and swallows up Ken and Taki, covering them in bio-goo and moaning in ecstasy. \n\nThere is plenty more I didn’t mention. The film is jam packed. Peter Mak made *The Wicked City* in 1992. The anime came out 5 years earlier, and was based on a manga by Hideyuki Kikuchi. The manga to anime to live-action pipeline doesn’t always produce potable movies, but Mak’s has enough crazy crap to keep you engaged.\n\n**The Anime** \n\nPeter Mak’s live action version of *The Wicked City* does not pair well with Yoshiaki Kawajiri’s anime version. I don’t think it would have made a difference which I saw first. Watching one makes it hard to watch the other. They are similar and so set up similar expectations, but the similarities are superficial and end up distracting from your ability to meet each film on its own terms.\n\nKawajiri’s anime is more coherent. Its visual style and graphic aesthetic unite it. Unlike many modern anime productions that foster a high level of realism, the drawings in Kawajiri’s *The Wicked City* are streamlined and cartoonish, similar to a comic book. Kawajiri uses this abbreviated style to create a bold, graphic, and colorful look. \n\nThe film’s aesthetic is reminiscent of *Blade Runner*, and of noir in general. Lots of shadows and smoky shafts of light. \n\n*The Wicked City* anime is a more successful film than its live-action counterpart. I expected the live-action version to be “so bad, it’s good”, but by the end, it was leaning toward actually being good. It was the same for the anime, but even more so. I expected pure pulp trash, and got something a little better.\n\nIn addition, the two films start out in similar ways, but after 20 minutes diverge almost completely. There is no “happiness” drug in the anime, nor any gay subtext. The anime is very decidedly hetero. The anime is far more sexual, which ends up being a mixed bag. Some of it adds to the body horror element and intensifies the whole tension between human and not human. However, some of it succumbs to typical anime objectification and misogyny. In the case of *The Wicked City,* it’s more like gynophobia than misogyny. Women’s bodies are repeatedly violated, mutilated, and often transformed into terrifying mutations. There is a woman who is half-human, half-spider with a vagina dentata that can not only chomp on your member, but spit out webbing as well.\n\nThe end of *The Wicked City* anime is pretty saccharine. It’s hard to sit through the mushy romantic music and all the tight shots of goo-goo eyes. Japanese culture has a high tolerance for flowery depictions of overblown love.\n\n*The Wicked City* was Kawajiri’s first film and took him only a year to complete. He would go on to make other anime such as *Ninja Scroll*, and *Vampire Hunter D: Bloodlust*.\n\n*The Wicked City* films are simply too different for comparison. Animated films deserve their own set of criteria separate and apart from live-action, but in today’s world, the two are increasingly merging through the use of CGI. Perhaps one of the reasons so many people disapprove of Marvel films is that the films bring live-action expectations to what is, in many ways, an animated film.\n\nAs the two are increasingly blended together, the visual union becomes almost seamless, but the acting, dialogue, and general content feel awkward with a live actor. Bringing comic book characters to life can expose their lack of depth.  \n\nIn the end, both *Wicked City* films are entertaining. All the special effects and explosions in the live-action version are intensified by their seeming to happen in the real world. The anime version is a further step removed from reality, but that enhances the artist’s ability to control the look and feel of the film. Both versions are pulpy and over-the-top, and they both end up with a mixed bag of excitement and stupidity.",
        "created_utc": 1670781803,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Have You Been Watching? (Week of (December 11, 2022)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zixhsi/what_have_you_been_watching_week_of_december_11/",
        "text": " Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1670774410,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's one film that once you start you must keep watching until the end?",
        "author": "thefirstchampster",
        "url": "https://www.reddit.com/r/TrueFilm/comments/ziwcwt/whats_one_film_that_once_you_start_you_must_keep/",
        "text": "Much like a classic album from the opening track that you just have to keep listening to until the record is over, what's that one film that from the opening minute you just know \"I have to watch this until it finishes\"? \n\nI could think of so many answers, and it probably changes all the time, but one that springs to mind is The Big Short. I love how McKay takes a seemingly boring topic and creates such an engaging, funny and stylish movie. There are some knock out performances (especially Bale and Carell), it never overstays it's welcome and pulls off the multiple characters stories with ease.   \nIf it's on, I'm watching till the end.",
        "created_utc": 1670772443,
        "upvote_ratio": 1.0
    },
    {
        "title": "Little Miss Sunshine (2006) is a breakdown of four major philosophical perspectives on how to live",
        "author": "MutatedGlowingToad",
        "url": "/r/FanTheories/comments/zhuz85/little_miss_sunshine_2006_is_a_breakdown_of_four/",
        "text": "",
        "created_utc": 1670769636,
        "upvote_ratio": 1.0
    },
    {
        "title": "MEN (2022)",
        "author": "themanwhosoldthworld",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zirfkk/men_2022/",
        "text": "it would have worked a lot more if it had the satirical approach on some women thinks ''all men are dogs'', ''men bad''.\nagain, it would have worked a lot more if it was suppose to be from just her perspective but not from Alex Garlands', and i'm wondering how he's living with the irony lol.\n\nbut..well i'm not even sure what the film itself tries to say. does it literally say, ''men bad''? or does it say, ''she thinks, men bad''?\n\nnevertheless, it's a really well shot film with some of the gorgeous shot of this year films. all the performances were good enough. and a solid first half.\n\noh another thing i forgot to mention, couple of times it reminded me of Jordan Peele's Get Out. it kinda is like Get Out, but with womem, men :3\neven the escape with the car scene...reminded me so about Get Out.",
        "created_utc": 1670764387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chantal Akerman's \"Jeanne Dielman\" (1975), the \"Greatest Film of All Time\" in Sight and Sound's new survey of 1,639 critics and experts — An online film group discussion on Monday December 19, open to everyone to join",
        "author": "darrenjyc",
        "url": "/r/PhilosophyEvents/comments/zhi1zz/film_discussion_jeanne_dielman_1975_just_voted/",
        "text": "",
        "created_utc": 1670763031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Eternal Sunshine of the Spotless Mind: do I just not get it?",
        "author": "StabnShoot",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zim55g/eternal_sunshine_of_the_spotless_mind_do_i_just/",
        "text": "Eternal Sunshine of the Spotless Mind has always been an uncontested classic as far as my experience goes, in the sense that I've never seen nor heard anyone give it anything but the highest praise.\n\nSo I finally sat down to watch it two months ago and found myself immensely disappointed. I did not like the film at all. Normally I wouldn't make a big deal out of it, since this isn't the first time that it's happened to me, however there are a bunch of reasons as to why in the case of this film I'm pretty sure I've just missed something completely. Let me explain.\n\nWhat I liked about it:\n\n1. The concept is creative and the film does a pretty good job at integrating the fantastical elements with the otherwise realistic context.\n\n2. The visuals get very impressive towards the end, when Joel begins losing his memories more and more.\n\n3. The performances are nothing special, but still pretty good.\n\n4. I liked the non-linear storytelling. \n\nWhat I didn't like about it:\n\n1. The characters are all very unlikeable. The main couple are a pair of assholes (and Clem is too unreasonable to make a \"both sides are wrong\" argument), and I want to slap every single person who works at the memory-erasure facility. This is my biggest gripe with the film as when it stops in its tracks to focus on the Kirsten Dunst character I'm like \"am I supposed to care about this woman who does weed and parties during a dangerous procedure?\"\n\n2. The tone is all over the place, not in a way that feels like the film is trying to bring some levity, but in a way that feels like its mocking me for even trying to be engaged in its storyline. I was especially appalled at that whole bit when Joel turns into a literal man-child.\n\n3. It really didn't feel like this story was worthy of a film. I know this is a veeery subjective opinion and to many, any story can be brought to the big screen, but I fail to find any of the drama in this film very interesting even without taking the former two points into account.\n\nWhy I think this film is a different case:\n\n1. I've gone through a break-up I regretted and I've bawled my eyes out at my fair share of romance films, so I don't believe this is a case of being unable to relate to the film or it not being my genre.\n\n2. Unlike some other acclaimed films I heavily dislike (ex. American History X, Requiem for a Dream) my problem isn't with how the film's themes were handled, but rather have more to do with separate parts of the film like the tone and the writing. So while I understand why others may like those other two I've mentioned, I've yet to understand the point of view of someone who doesn't have the same problems with Eternal Sunshine that I do.\n\nI'd very much like if someone could address my critiques of the film and explain why they and so many other people love it. I don't want to change my mind, just to understand a different point of view.",
        "created_utc": 1670751162,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are Your Opinions on the Deluge of Family Trauma Related Content in Films Recently?",
        "author": "IsaiahTrenton",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zim00i/what_are_your_opinions_on_the_deluge_of_family/",
        "text": "The past few years in cinema, especially 'children's films' have been pretty interesting. While the concept of a younger generation calling out the sins of the older generation is by no means new, it seems like we are getting A LOT of films about toxic families and unhealthy familial dynamics. Turning Red, Coco, Encanto, The Mitchells vs The Machines, Everything Everywhere All at Once, Strange World and others all have in common that they're basically fantastical adventures centering a deeply flawed family dynamic where basically the parents/grandparents end the film expressing regret and/or asking for forgiveness. I don't hate it but I'm also curious as to how others feel about it. In something like EEAO, I largely don't mind but I think it's low key hilarious how half of so called kids films today feel like therapy sessions. I think it's good that kids get films exploring this but damn it seems like a lot of them are doing now. In general fictional media definitely seems to be having a moment as it concerns unpacking destructive family dynamics. Is it really a newer trend or am I just now noticing it?",
        "created_utc": 1670750762,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are movies where a man (or multiple men) kill women in a badass or funny way? Any reccomendations?",
        "author": "zeldaKingOk",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zih46m/what_are_movies_where_a_man_or_multiple_men_kill/",
        "text": "I've spent all my life watching so many movies where...\n\n* ...a very badass woman kills lots of men in a funny way.\n* ...a very badass man kills lots of men.\n* ...a woman kills a woman in a tragic way.\n\nAnd of course, any movie scene where a woman is killed by a man, is portrayed as so sad and tragic...😭😭😭🎻🥀\n\nBut today I feel like I want to see some movies where women are merciless killed by men in a badass way. If the women are villains, even better! If they aren't villains, it's okay too. Remember that it's fiction! I don't condone this in real life.\n\nGive me some suggestions. Don't disappoint me!",
        "created_utc": 1670737846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why has there been this trend of auteurs making autobiographical films?",
        "author": "RopeGloomy4303",
        "url": "https://www.reddit.com/r/TrueFilm/comments/ziejse/why_has_there_been_this_trend_of_auteurs_making/",
        "text": "Now I am aware that autobiographical films have existed for a long time, with plenty of classic examples throught history like 81⁄2 or Almost Famous or All That Jazz to name but a few.\n\nBut in recent years it seems as do every auteur feels the need to expose their private life into the  screen. Kenneth Brannagh's Belfast, Paolo Sorrentino's Hand of God, Alfonso Cuarón's Roma, Pedro Almodóvar's Pain and Glory, Steven Spielberg's Fabelmans, Johanna Hogg's The Souvenir and Alejandro  González Iñárritu's Bardo just from the top of my head all came out in the past 5 years. \n\nAll very notable films by some of the most acclaimed filmmakers around, not to mention exposing deeply vulnerable and personal aspects of their lives such as the drug addiction, the death of one's parents, discovering one's sexual orientation, one's insecurities regarding their own talent, etc.\n\nWhy is this phenomenon going on? I find it rather strange. Is it related to how because of social media it's been more normalized to become open about your past and personal struggles? Or did the great success of Roma just inspire a domino effect?",
        "created_utc": 1670732172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it that very few films have cinematography in the style of liminal space?",
        "author": "CollarProfessional78",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zic3rw/why_is_it_that_very_few_films_have_cinematography/",
        "text": "One problem is that you need to display a subject as it's unfolding in a sequence.  liminal space photos often depict little pockets of ambiguous contexts that suggest the little frays of experiences; the atrophy constituents of a poignant full picture forever suspended in a nostalgic purgatory.  First of all, creating a story based on that kind of narrative sounds very challenging.  How could tell, or rather evoke a story with the language of esoteric dreams through erratic, non contextual, fever dream environments.  Basically the photography speaks to the gut fully and to the head elusively.  I think perhaps Eraserhead is the closest I've seen.    This kind of aesthetic to me is extraordinarily compelling, so why is it so nonexistent in the film medium?",
        "created_utc": 1670726816,
        "upvote_ratio": 1.0
    },
    {
        "title": "HFR OR NOT HFR AT CINEMA?",
        "author": "oksarada",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zi5t9z/hfr_or_not_hfr_at_cinema/",
        "text": "[removed]",
        "created_utc": 1670711666,
        "upvote_ratio": 1.0
    },
    {
        "title": "HFR or not HFR at cinema?",
        "author": "BackgroundType5830",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zi53do/hfr_or_not_hfr_at_cinema/",
        "text": "[removed]",
        "created_utc": 1670709958,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you go about analyzing a movie?",
        "author": "Ryclassic",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zhy0ee/how_do_you_go_about_analyzing_a_movie/",
        "text": "I have this problem where despite the fact I watched the movie and I know if I like or dislike, most of the times I cannot explain WHY, the reasons that led me to have this opinion.\n\nI want to change it and really understand why I like or not a movie. Have you ever experienced this? What do you do during and after watching the film? \n\nDo you write something or most of what you do is just stop for some minutes, re-play the movie on your mind analyzing it completely?",
        "created_utc": 1670693012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you ever seen Cannes award winner Nitram? Not many people did, and even fewer are willing to talk about it in depth. It dramatizes the 1996 Port Arthur Massacre and it is a character portrait of the perpetrator. It is a terrific film and I made an hour long video analyzing it. Have you seen it?",
        "author": "theOleRazDazzle",
        "url": "https://www.youtube.com/watch?v=RLhsy91JtiU&amp;t=272s",
        "text": "",
        "created_utc": 1670661442,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Futility of Searching for Deeper Meaning in American Psycho",
        "author": "MarxandCoke",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zhglug/the_futility_of_searching_for_deeper_meaning_in/",
        "text": "Some other recent posts and the responses to them have revealed, once again, how many of us look for more from some stories than they have to give: the illusive search for \"depth\" and \"meaning.\"\n\nThe book and the movie versions of *American Psycho* are straightforward satires of a deranged, self-absorbed American society that worships material consumption and fetishizes extreme violence. Some works are meant to be taken at face value and these are some of them. One of the strengths of both works is that they do not devote time to gleaning wisdom from or giving meaning to the violence and suffering in the story. They rightly dispense with the human impulse to add narrative and purpose to needless suffering and horrifying behavior; it's all senseless, which tracks closer to real life than many of us want to admit.\n\nThis is not to say there is no point in investigating the historical context of the story, which I think is very important to both the book and the movie. I happened to be around for that era; I remember it well. Crime rates were extremely high and getting worse every year. There was an endless stream of horrendously violent and sensational serial killings. (The equivalent today would be mass shootings.) It was also a superficial, wealth-obsessed, and callous time. Extreme portrayals of violence in media, art, and culture were fairly new, and, to the shock of many, they were often quite popular - celebrated even!\n\nThe book synthesizes all of this in a glossy, inventive, and totally tasteless manner. It is an aesthetic exercise of excess designed to elicit outrage rather than a philosophical one designed to encourage introspection. The book does this far more effectively than the movie because there are things you can do in print that would never be accepted on film. Regardless, I think this reading applies to both. They have more in common with De Palma's *Scarface* than *Taxi Driver* or *Persona*. While I think historical context is helpful, I don't really see how knowledge of Bret Easton Ellis' or Mary Herron's psyches would add much dimension to either work. They stand on their own.\n\n*American Psycho* and its ilk function more as mirrors than philosophical musings. They deal with a human capacity for violence and sadism that defies rationalization. Eighty years later, we still cannot really explain the thinking of much of the Nazi leadership beyond saying they were mad. We cannot explain the behavior of serial killers like Ted Bundy, William Bonin, and Dean Coryll who were not mentally ill in the classic sense like the schizophrenic Geoffrey Dahmer. We cannot explain the reasoning behind the Sandy Hook and 2017 Las Vegas massacres. Works like *American Psycho* rightfully confront us with such irrational cruelty without trying to justify it. They also, thankfully, don't try and justify and add trite depth to a victims' suffering or survival. The secretary Jean survives because Patrick Bateman arbitrarily choses not to kill her; that's it.\n\nMany works deserve deep contemplation. I do not think *American Psycho* is one of them. I would take the search for deeper meaning elsewhere. Perhaps most of you agree or maybe you do not. I'd be curious to hear your responses.",
        "created_utc": 1670639926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about \"MCAA\" Rights System/Disney securing out-of-copyright rights as mentioned in Rob Young's \"The Magic Box\".",
        "author": "TheRingshifter",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zhfxn7/question_about_mcaa_rights_systemdisney_securing/",
        "text": "I'm reading the book, and I just came across this: \n\n&gt;In the early 1960s, with the jewels of its former empire taking back control of their destiny, Britain reached a peak of parochialism, even as it grew more desperate to keep its end up on the world stage, while the US and the Soviet Union squared off. Even its own culture was coming under new ownership. Ever wondered why there were so few adaptations of classic English literature in that period? Hardly any Dickens since David Lean’s late-1940s *Great Expectations* and *Oliver Twist*, and Brian Desmond Hurst’s *Scrooge* (1951)? No George Eliot or Thackeray, precious little Walter Scott? That’s because of new gentleman’s agreement-type regulations, copied from the American MCAA, whereby once a production company had registered its list of desired out-of-copyright classics on the official record, they retained exclusive rights. That explains why it was Disney that secured the monopoly over some of the classic fairy tales and historical stories, such as *Treasure Island, Kidnapped* and *Alice in Wonderland.*\n\nIs this real? I can't come up with any information about this (not helped by the fact that any search term involving \"Disney\" and \"Copyright\" inevitably just brings up 1,000,000 copy pastes of \"OMG MICKEY MOUSE IS GONNA BE PUBLIC DOMAIN\" news stories). I can't even find the MCAA he references. Perhaps he means \"[MPAA](https://en.wikipedia.org/wiki/Motion_Picture_Association)\"?",
        "created_utc": 1670638026,
        "upvote_ratio": 1.0
    },
    {
        "title": "2022 sight and sound poll",
        "author": "greatcinephile",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zhcef7/2022_sight_and_sound_poll/",
        "text": "[removed]",
        "created_utc": 1670628651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we have examples of any producers having an outsized positive impact on a film?",
        "author": "ChicagoShadow",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zhadar/do_we_have_examples_of_any_producers_having_an/",
        "text": "[removed]",
        "created_utc": 1670623948,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the difference between subjective and restricted narration?",
        "author": "woahthrills",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zh7soa/whats_the_difference_between_subjective_and/",
        "text": "[removed]",
        "created_utc": 1670617704,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the difference between subjective narration and restricted narration?",
        "author": "woahthrills",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zh7rxg/whats_the_difference_between_subjective_narration/",
        "text": "[removed]",
        "created_utc": 1670617655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any modern depictions of “old Hollywood” that actually attempt to glamorize the era?",
        "author": "threewavyleaves",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zh79pu/are_there_any_modern_depictions_of_old_hollywood/",
        "text": "I recently read a comment on r/movies speculating that Babylon will be subversive in the way it seems to be intended to highlight the flaws in old Hollywood. \n\nThis made me realize that actually, almost every notable depiction of “Old Hollywood” from the late 90s onward has largely been concerned in highlighting the flaws or negative aspects of the era.\n\nFrom biopics like Judy and Blonde, to dramas, comedies and crime thrillers like Mank, Hail Caesar!, L.A Confidential and Hollywoodland, they’re all aimed at exploring the seedy underbelly of the industry.\n\nThe only film I can think of that buys into the glamour of the era is The Artist, released over a decade ago.\n\nAre there any other recent movies that legitimately glamorize this era, and is it even possible at this point for a film to be genuinely “subversive” due to a negative depiction of the studio system?",
        "created_utc": 1670616467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Actors you can't take your eyes off: Why or how?",
        "author": "hip-drahve",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zh1a36/actors_you_cant_take_your_eyes_off_why_or_how/",
        "text": "I've been thinking recently about the actors/actresses who completely command my attention whenever they're on screen and why that is. Do you think this is mostly a quality of the *performance*, a quality of the *performer*, or a largely facilitated by the writing and directing? Can it be learned (or taught), or is it innately held?\n\nA few of the performers who come to mind when I think of this are:\n\n* Actors: Brian Tyree Henry, Murray Bartlett, Steven Yeun, Sam Richardson, Anton Yelchin, Laurence Fishburne\n* Actresses: Rosa Salazar, Carrie Coon, Amber Midthunder, Toni Collette, Patti Harrison, Mia Goth\n\nLooking at the above list, I'm noticing that these are all handsome/beautiful people but who have a more unique, less generic or model-esque look to them. I'm faceblind, so maybe that's why performers like this stand out to me more - just a theory. Perhaps an attention-commanding performance is more about the viewer than the performer.\n\nWhat do you all think? Who are those performers who never fail to capture your attention?",
        "created_utc": 1670602383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big Time Gambling Boss (1968): a yakuza masterpiece",
        "author": "physics223",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgzivk/big_time_gambling_boss_1968_a_yakuza_masterpiece/",
        "text": "Over the past six months, I had been weighing whether to renew my NitroFlare premium account because I really wanted to watch **Big Time Gambling Boss.** This was because in 2009, Japanese film critics were asked to survey the 200 best Japanese films of all time. At the top were undisputed masterpieces, such as Ozu’s *Tokyo Story* and Kurosawa’s *Seven Samurai*. Even with the latest Sight and Sound list, these two were ranked highly. \n\nWhat made the top 200 Japanese film list interesting, however, were those in the lower ranks. These films were also excellent, just not as universally popular. Suzuki’s *Tokyo Drifter*, for instance, was a masterclass in style despite the time’s technological limitations, and it was ranked #71. \n\n**Big Time Gambling Boss** was ranked a little lower, at #75. However, two people whom I respect as auteurs in their respective fields laud the film as a masterpiece. Paul Schrader (*First Reformed*), for instance, described it as the richest and most complex yakuza film, while Yukio Mishima, on the other hand, described the film as a \"Greek tragedy of Japan.\" I also think that the film reflected his sensibilities, down to the seemingly inevitable ending. After all, he wrote *Patriotism*, where the protagonist also struggles with a dilemma between honor and survival: his works possess an atmosphere of inexorability, punctuated by episodes of violence.\n\nWith that said, I took the plunge yesterday, and renewed my account so that I could finally watch this film. I invited my dad to watch it with me, since we’re both fond of rich, complex, and historical films that revolve around human choices and human weaknesses. \n\nI have no regrets. \n\nThis film was released four years before Coppola’s *Godfather*, and yet had similar themes: it also features the struggle of the hero’s established values being corroded by capitalism and progress. This is a theme also similarly shared by *Giants and Toys*, a more darkly humorous and satirical film. In the face of money and self-enrichment, all traditional values are seemingly thrust aside. \n\nIf this were, however, a simple descent into corruption, a la *Babbitt*, it wouldn’t have been a masterpiece. Relevant is Mishima’s description of the film as a Greek tragedy of Japan. Nakai, the protagonist, always struggles to live by the values he has grown with: he defers to his senior and best friend, and to the leaders of the group. He stands by loyalty but is willing to be violent to protect the stability of the group. He is even initially unwilling to take the reins of the group because his best friend, Matsuda, was, to him, more deserving. \n\nThis decision, however, sparks a chain of events that is manipulated by a puppet-master who simply wishes to make money for himself. The protagonists are outsmarted every step of the way, until they are ultimately forced, because of their values, to turn on each other. It is an excellent commentary on the loss of traditional Japanese values for the sake of progress, commercialism, and capitalism. \n\nBecause Nakai is also an able fighter, however, he upends this manipulation, but like his close friends, ultimately has to pay the price for the sake of progress. \n\n**Big Time Gambling Boss**, similar to Giants and Toys, is a taut character drama ably led by Tomisaburo Wakayama. It rewards re-watching but is not a difficult to follow film. All the world over, traditional values such as chivalry and loyalty are being effaced by avarice and greed. The revolt, however, by Nakai, shows that at least a few people are not consumed by money. \n\nThe tone, cinematography, and acting is pitch-perfect, and the unraveling of the plot was excellently done. This is one of my favorites. \n\n10/10",
        "created_utc": 1670598052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interstellar (2014). No words to describe this masterpiece.",
        "author": "arkhemes02",
        "url": "https://v.redd.it/dkejofbouw4a1",
        "text": "",
        "created_utc": 1670590329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hitchcock and The Auteur Theory",
        "author": "Ok_Library_9396",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgvabs/hitchcock_and_the_auteur_theory/",
        "text": "[https://www.youtube.com/watch?v=\\_G-x9Z3RvXc&amp;t=285s](https://www.youtube.com/watch?v=_G-x9Z3RvXc&amp;t=285s)\n\nWhen the Auteur theory was first coined by Andrew Saris in the 1960s , one such filmmaker that was looked at as evidence for this theory was Alfred Hitchcock due to similar themes, characterisitc and tropes that pop up in his films. In this video I made I examined the Auteur Theory against Hitchcocks filmography discussing just this. I hope you enjoy.",
        "created_utc": 1670586767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mainstream movies will never be good again",
        "author": "willyyuck",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgpf72/mainstream_movies_will_never_be_good_again/",
        "text": "Popularity is determined by it's reach, the size of the applicable audience, and how consumable it is.\n\nI recently watched scarface and it reminded me why i watch movies. Now, there are so many types of movies and reasons for watching each genre and i love tons of different ones. The thought on my mind right now though is that i realized present day popular movies will never be able to be effective films in the sense of producing something that fuels questioning decisions and provides sufficient and realistic consequences to the characters. \n\nWhile movies are good for just turning on and getting a simple story or a couple laughs from, and for many movies, that being the purpose for them. But those types of movies are becoming far too common. With big budgets and all the technology in the world, mainstream movies are now turning out worse than ever. The industry is oversaturated with quickly written, poorly thought out, and passionless 2 hour plots that go nowhere and don't evoke any thoughts/feelings from the audience. The only goal is to sell. If there is something the movie is driving at it is almost always one dimensional. \n\nTake Scarface and compare it to the new Thor. Thor has humor (it's not good but that's the purpose at least). Okay so what else does it have. What depth do we get from what could have been an amazing villain? What did Jane do to get her powers. Yeah, nothing. It's a 2D video game. It goes one way, there's only one outcome and you only ever see one side. Now with Scarface, there is humor. But the use is sparing and in very tactful and tasteful ways, adding to and not removing from the tension or tone of the scene or film as a whole. The reason Scarface carries more impact with its humor is because of the push and pull of intensity and seriousness. If it were to take every situation as a joke then no weight would be lifted to increase later tension. If humor was the top of a graph and seriousness was the bottom, films should see movement of up and down. The level isn't what carries the impact, it's the changes in level that do.\n\nCreating an actual film, is hardly ever explored anymore. The industry is propelled by remakes and reboots trying to conjure the same success that they had in the past when they forget what made the great movies just that. It was passion. It was a vision. Now with big companies like Universal or Disney driving the market, the executives and decision makers only think in business. And never in terms of what's a great movie. For them it's what's a great way to make money. And a lot of the time nostalgia is the answer and that's why we're running out of original impactful films. Because they're not what make money. People nowadays are so intimidated by trying something new and questioning what they think that who's going to watch something that does just that. Something that causes you to think or feel in a way you haven't before.\n\nIt has come to the point where money doesn't push an idea or a vision. It pushes itself. Money has become the source of itself. With disney growing exponentially, there is almost nothing that can change the way the industry is headed. Even when movies released are terrible and do nothing to affect anyone long term or leave a lasting impression, that doesn't matter. Because you already saw it, and so did everyone else. They made their money and because they have it all they can push these films consistently that don't carry sustenance or quality and yet everyone will still see it. \n\nThis posts purpose started out as me wanting to talk about how R is the only way to create a movie with depth because of the need for realism and a possibility for any consequence, because without guidelines is the only way real life works. When a PG movie comes on and there's a chance something bad could happen, we as an audience know there are just some things that will not show up on that screen. But with R, being able to remove any filters creates scenarios for anything to happen and with no restraint on the story, which can allow for extremely impactful events to occur.\n\nHowever. When I started writing this I started to think. The Lion King, Mud, Interstellar, etc. At that point a realized it wasn't a problem of what the movie is allowed to do, but more so what the movie chooses to explore. While I still believe that R allows for more exploration and creative freedom.\n\nMy overall argument is that the most popular movies will never be good again. With money driving the projects instead of a vision; and with one dimensional ideas fueling the system instead of core, thoughtful questions, society is being brainwashed into what a good film is. And so, with people not going to movies to experience but rather to just watch, good film will without a doubt become extinct.",
        "created_utc": 1670568277,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am looking for a way to watch “It has to be Lived Once and Dreamed Twice” (2019)",
        "author": "Aspiringreject",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgpd0o/i_am_looking_for_a_way_to_watch_it_has_to_be/",
        "text": "[removed]",
        "created_utc": 1670568071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gary Oldman in True Romance (1993) and playing other ethnicities with authenticity.",
        "author": "MidnightTrainPassage",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zglz38/gary_oldman_in_true_romance_1993_and_playing/",
        "text": "Gary Oldman’s supporting role as the pimp Drexel is generally regarded as one of the best performances by a white actor playing a non-white character.\n\nNow, key to Drexel’s identity is that he has ethnic hang ups. He is of mixed race and Native American background but regards himself as firmly and purely African American and berates Christian Slater with the phrase “it ain’t white boy day.”\n\nOldman is basically unrecognisable in the role and it is on par with Heath Ledger’s portrayal of The Joker as character immersion.\n\nDo you think that such a role could be done these days or would it seem tone deaf in today’s cultural environment?",
        "created_utc": 1670557775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jonathan Demme's perception of queer people",
        "author": "mojito_sangria",
        "url": "/r/movies/comments/zgld3x/jonathan_demmes_perception_of_queer_people/",
        "text": "",
        "created_utc": 1670556077,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Carol for Another Christmas (also known as Carol for Another Christmas) 1964",
        "author": "schreist",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgjoga/a_carol_for_another_christmas_also_known_as_carol/",
        "text": "This films is packed with actors everyone recognizes:\nBritt Ekland, \nBen Gazzara, \nSterling Hayden, \nPat Hingle, \nSteve Lawrence, \nPercy Rodriguez, \nEva Marie Saint, \nPeter Sellers, \nRobert Shaw, \nJames Shigeta, \nBarbara Ann Teer\n\nAn intense variation on the traditional Christmas Carol. \nBrutal, in fact. Merciless in delivery. \n\nhttps://en.m.wikipedia.org/wiki/A_Carol_for_Another_Christmas",
        "created_utc": 1670551388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Misunderstanding authorial intent and who to blame for it",
        "author": "Disco_Cloud7",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgj4ug/misunderstanding_authorial_intent_and_who_to/",
        "text": "Recently I've been thinking about how films (or any artistic medium really) can have a text where the interpretation could be misunderstood. Instant examples for me would be films like American Psycho, where the film itself is a satire on the ridiculousness of capitalism's encouragement to acquire or maintain an elite lifestyle and yet some people view Patrick Bateman as an unironically cool character. This tends to happen with a lot of morally contemptible characters  like Travis Bickle in Taxi Driver, Tyler Durden in Fight Club and even TV characters like Tony Soprano and Homelander from The Boys. The central question I'm conflicted on is if it's the fault of the filmmakers and writers for not conveying how they wanted people to see these characters good enough, or if it's the fault of the viewer for not being knowledgeable enough about interpreting and examining media.",
        "created_utc": 1670550000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on Barry Lyndon?",
        "author": "FreshmenMan",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgh9c7/thoughts_on_barry_lyndon/",
        "text": "What are your thoughts on Barry Lyndon?\n\nBarry Lyndon is one beautiful movie, every scene feels like a Oil Painting and every shot feels like It could of been shot now. I fully believe Stanley Kubrick is just one of the best directors of all time.\n\nRyan O'Neal is good as Barry Lyndon, but it is clear that he is so out of his depth in a Kubrick film. But I think it works for Barry Lyndon. Barry is a Charlatan, A Scoundrel, A Pretty Boy who use his Good Looks and Wits to get where he is\n\nHowever Despite all this, Barry is still Human Look at The Final Duel, Lyndon had his life in Bullingdon hands and could have easily took him out, but instead chose to spare him. it offered both of them honor and respect. Lyndon redeemed himself and Bullingdon his dignity.\n\nHowever, his one act of kindness proved to be his downfall as Bullingdon instead chose base level wrath and vengeance. throwing that opportunity away. not to mention that despite taking out Lyndon he would not have his honor and dignity considering the circumstances of it.  It's ironic that after a lifetime of selfishly and disingenuously climbing his way up the social ladder all his life, the only noble, magnanimous act that Barry Lyndon performs ends up causing his downfall. Despite this, Barry regained. But other Irony is that Barry, while a scoundrel and loses the duel, gains back his honor. Lord Bullingdon who is meant to be the gentleman. gains back his birthright yet totally sacrifices his honor.\n\nWhat are your thoughts on Barry Lyndon?\n\nWhat do you think of Ryan O'Neal as Barry Lyndon?",
        "created_utc": 1670545530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the perfect combination of movie trailer and music exist? Have you ever thought about how important a song (or instrumental) is to the pacing of a movie trailer?",
        "author": "Djxgam1ng",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgh5dx/does_the_perfect_combination_of_movie_trailer_and/",
        "text": "What Movie Trailer and Song are a perfect marriage? What is your favorite movie trailer and music pairing? The song DOES NOT have to be an actual track but maybe an instrumental made just for the trailer?\n\nMovie trailers (and even video game trailers) are fascinating to me. It’s crazy how a trailer can cut and edit parts of a movie to make it look enticing, even if it’s a genre you initially have no interest in. \n\nOne of my favorites:\n\nMovie: Clockstoppers (circa 2002) \n\nSong: “First Date” by Blink 182 (the song is present in second half of the trailer)\n\nBonus Points if you have a link to trailer and or song as well. Remember, some trailers have music that isn’t necessarily a direct won’t, but they edit different beat patterns based on what you are seeing in the trailer at any given time.",
        "created_utc": 1670545287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to find Dogville",
        "author": "u99a",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zggg7h/where_to_find_dogville/",
        "text": "[removed]",
        "created_utc": 1670543742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you like \"Bottle Episode\" type movies?",
        "author": "frogger3344",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgfpdd/do_you_like_bottle_episode_type_movies/",
        "text": "[removed]",
        "created_utc": 1670542107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has Hollywood Entered New Avatar Era",
        "author": "Snap_Zoom",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgebjh/has_hollywood_entered_new_avatar_era/",
        "text": "The film “Looker” which was released in 1981 was the first time I had considered the use of Digital Avatars in film, which – back in the day, the term didn’t even exist. Written and directed by sci-fi legend Michael Crichton, the movie tells of a company buying the digital rights to models, but to scan the models they have to be perfect down the micro-millimeter. There is more to the movie but I will leave that for you to discover – the film is worth the watch.\n\nThe bottom line is that owning the rights to actors and creating digital characters is nothing new. And for directors like Alfred “actors are cattle” Hitchcock, not having to deal with actor egos would likely be a blessing.\n\nEasier said than done. The idea of seamlessly using digital actors is more of a wish than a reality. There are countless failed attempts. Star Wars episodes 7, 8, and 9 comes to mind. All of their attempts, including Young Leia, always had the Uncanny Valley feel. Scorsese tried with limited success in “The Irishman”.\n\nRecently a minor firestorm broke out when it was reported that Bruce Willis sold his “face” to a Russian deepfake company. His agent denied the story but the truth of it remains in question. And the idea that it might have happened – or could have happened might be the real story.\n\nAnd now this brings us to Harrison Ford and his Indiana Jones. When rumors swirled of an Indiana Jones reboot starring Chris Pratt, it was Pratt himself who debunked the rumor. But that didn’t stop Ford from stating unequivocally that he is the one and only Indiana Jones. No one will ever play Indiana but Ford – ever.\n\nIt seemed an odd statement at the time. But now we have the new trailer for Indiana Jones 5 and the Dial of Destiny that heavily features Indiana at multiple ages. The digital use is obvious but cleaner and more fluid. Does it avoid the Uncanny Valley? That remains to be seen but one thing is clear – reboots of film franchises are never going to be the same. Ford will forever be Indiana Jones. Another actor may step in to play out the movements of Indiana but the wrapper will always be that of Harrison Ford, ageless.\n\nNext up, Spielberg (who, for the first time, did not direct Indiana Jones 5) announced his next directorial effort, the “Untitled Frank Bullitt Project” starring Bradley Cooper. There is little information on the project other than it will continue the story of Steve McQueen’s character in the aptly titled “Bullitt”.\n\nSo what I now wonder – what if Bradley Cooper isn’t just playing Frank Bullitt.\n\nWhat if: Bradley Cooper is playing Bullitt as Steve McQueen?\n\nThis would answer the question of what about a standard cop procedural might interest Spielberg.\n\nA groundbreaking film starring a deceased movie star, reprising his most famous role, directed by a master of the craft.\n\nWill this happen? It’s just my speculation – a dream perhaps.\n\nBut if it does?\n\nIt would be legendary, groundbreaking, and most certainly the first major step in a new era of filmmaking.",
        "created_utc": 1670539202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pre ‘New Wave’ French Cinema",
        "author": "OpeningDealer1413",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zgdx7m/pre_new_wave_french_cinema/",
        "text": "As much as I am a huge fan of the French New Wave, recently I have been really diving into French cinema before Truffaut, Godard, Varda etc all came along. There is something so wonderful about a lot of it, even the simple poetry of the French language and a lot of the directors are so strong stylistically. Some of my favourites include, Boble Flambeur, Touchez pas au Grisbi, Les Amants, Lift to the Scaffold, La Regle de Jeu and La Grande Illusion. Within the next week I’m also getting the opportunity to watch both Les Enfants du Paradis and Casque D’or at the cinema which I’m very excited for. \n\nWhat are some more great pieces of pre New Wave French cinema?",
        "created_utc": 1670538367,
        "upvote_ratio": 1.0
    },
    {
        "title": "[LEFFEST 2022] Conversation with Michael Fassbender on Hunger and Bobby Sands",
        "author": "Tz4meti",
        "url": "https://www.youtube.com/watch?v=UEG9N7iRlX0",
        "text": "",
        "created_utc": 1670537408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wild Strawberries",
        "author": "ichthyander98",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zg8kxa/wild_strawberries/",
        "text": "[removed]",
        "created_utc": 1670527301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain to me exactly what the myth of redemptive violence is?",
        "author": "Bman2271",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zg6ipf/can_someone_explain_to_me_exactly_what_the_myth/",
        "text": "I know generally it’s about domination. That this chaotic, evil world can only be corrected through violence. Many people say superhero movies, fairy tales, and fantasies perpetuate this myth. \n\nI understand that violence is far too prevalent in cinema or even stories as a solutions to problems. But is there anything wrong with individual stories in and of themselves? Is it the over-saturation of such stories that’s the issue?  Cause many people who levy this criticism still enjoy these works of fiction.",
        "created_utc": 1670523041,
        "upvote_ratio": 1.0
    },
    {
        "title": "After Un Chien Andalou Came L'Age d'Or",
        "author": "Boop108",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zg6bb8/after_un_chien_andalou_came_lage_dor/",
        "text": " This article includes a lot of film stills. If you would like to see the illustrated version click here [https://filmofileshideout.com/archives/after-un-chien-andalou-came-lage-dor/](https://filmofileshideout.com/archives/after-un-chien-andalou-came-lage-dor/) \n\n[After Un Chien Andalou Came L'Age d'Or - Filmofile's Hideout](https://filmofileshideout.com/archives/after-un-chien-andalou-came-lage-dor/)L'Age d’Or is credited to Luis Buñuel and Salvador Dalí, but apparently it was mostly Buñuel’s production. Dalí was too busy becoming a hollow self-parody. \\[…\\]filmofileshideout.com**  \n\n\n*L'Age d’Or* is credited to Luis Buñuel and Salvador Dalí, but apparently it was mostly Buñuel’s production. Dalí was too busy becoming a hollow self-parody. Regardless, *L'Age d’Or* is the second collaboration between the two men. *Un Chien Andalou* was released in 1929, and although it was more intense and upsetting than *L'Age d’Or, Un Chien Andalou* caused far less trouble. Much to the confusion of Dalí and Buñuel, *Un Chien Andalou* was quite popular. *L'Age d'Or* came out only a year later, and was not only far less popular, but was also attacked by a variety of groups, including the fascist Ligue des Patriotes, as well as the French government.\n\n*L'Age d’Or* is less radical in its structure and presentation. There is a discernible narrative, semi-conventional dialogue, and some amount of linear logic to most of the imagery. The fact that *L'Age d’Or* couches its surrealism inside a slightly more conventional narrative provides the surreal images with a kind of straight-man. When someone is killed, it is not just another shock in a line of shocking imagery, it is more disruptive. We are lulled into the ordinary, and then smacked in the face with something bizarre or horrible.\n\nBoth films are disturbing, but *Un Chien Andalou’*s strength is in its completely radical treatment of the medium and a willingness to push imagery and editing to an extreme. *L’Age d’Or’*s strength lies in its ability to produce something unnerving. If *Un Chien Andalou* is a nightmare, then *L’Age d'Or* is more of a disturbing dream. We the audience watch the images surface, and we weave them into a narrative. \n\nFilms are well-fitted to representing dreams. We watch films in the dark and lose track of our corporal selves. We physically react to frightening or exciting images as if they are real. We attach our emotions to the characters, and we look for meaning behind the narrative. \n\n*L’Age d’Or* reminds us that we are observers. The film is full of images of people watching and staring. The characters often exhibit a sense of amazement and confusion, reflecting back what the audience feels.\n\nWatching *L’Age d’Or,* we blur the lines between reality and dream. Seeing is believing, and so the images feel real, but then they are eerily invaded by things that seem incongruous or shocking. Most of what we see in *L’Age d’Or* is technically possible. A man really could set a Christmas tree on fire and throw it out his window, but it is the shocking strangeness of such things that unnerves us and destabilizes our confidence in our normal lived experience.\n\n*L’Age d’Or* is primarily a socio-political film designed to attack bourgeois values. It targets religion, sexual mores, class, and government structures. The content of the message is important, but it’s the method of attack that is most interesting. Buñuel and Dalí do not rail against sexual repression or class oppression directly. They tear off the polite facade that society so carefully maintains, and reveal the violent and primitive forces at work underneath. It is not simply our individual subconscious that they reveal through dream images, but the collective societal sub-structure and unspoken ideologies that are revealed. \n\nIt is as if our culture had a waking life that we recognize and appreciate, but it also had a dream life where its values and motivations surface symbolically. Watching *L’Age d’Or,* we have the eerie sense that what looks like reality can be suddenly and randomly interrupted by the unexpected intrusion of deeper subconscious currents.\n\nThe fact that *Un Chien Andalou* did not cause what Buñuel and Dalí thought would be a violent outcry, and *L’Age d’Or* did, had less to do with the films and more to do with the audience. If the Ligue des Patriotes had not gone to see *L’Age d’Or* and then tried to tear down the theater, the film would have most likely run without incident. I can imagine Buñuel and Dalí were at least partially pleased to get the reaction they were looking for. The general public ended up being more savvy than they had anticipated, but you can always count on people who call themselves \"patriots'' to stage a violent outcry of ignorant indignation.",
        "created_utc": 1670522564,
        "upvote_ratio": 1.0
    },
    {
        "title": "My review of Park Chan-wook’s “Decision to Leave,” my favorite film of the year!",
        "author": "Femfilmrogue",
        "url": "http://femfilmrogues.blogspot.com/2022/12/decision-to-leave-dark-romantic-mystery.html",
        "text": "",
        "created_utc": 1670521732,
        "upvote_ratio": 1.0
    },
    {
        "title": "sight and sound in los angeles ??",
        "author": "switchkrook",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zg5g6g/sight_and_sound_in_los_angeles/",
        "text": "[removed]",
        "created_utc": 1670520596,
        "upvote_ratio": 1.0
    },
    {
        "title": "A different read on Bones and All",
        "author": "TheFugaP",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zg2c89/a_different_read_on_bones_and_all/",
        "text": "I watched the movie after reading some reviews on Rotten Tomatoes that described the film as meandering and tame. I was pleasantly surprised but also confused about why the reviews didn't talk about the film's main theme. I checked again today on some big-name sites like the Guardian and Rolling Stones and again found nothing. I can only conclude that my point of view is personal and not widely accepted so I'll try to get some feedback on this sub. \n\nTo me, the film's main theme is clearly generational trauma and abuse. Just the idea of a cannibal, as someone that phagocytizes his own, fits the picture. You add the genetic inheritance element and it's a perfect metaphor. All aspects of the theme are presented during the story: damaging the people around you (close or not), people avoiding you (the father), the incapacity of forming the relationship that you desire, not being able to change and feeling hopeless about it, trying to break the chain constructively (the protagonist) and destructively (the mother), feeling cursed, ecc..\n\nAll the interpersonal dynamics of the film fit the metaphor, the only thing that doesn't feel well integrated is the Sally subplot.\n\nLet me know what you think.",
        "created_utc": 1670513783,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think about films of Sadao Yamanaka? I honestly think his work is timeless like Ozu.",
        "author": "Georgamsel",
        "url": "https://youtu.be/pTf8QEReiUY",
        "text": "",
        "created_utc": 1670504668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alfred Hitchcok A Study of a Film Auteur",
        "author": "Ok_Library_9396",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zfj06y/alfred_hitchcok_a_study_of_a_film_auteur/",
        "text": "[removed]",
        "created_utc": 1670458536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casual Discussion Thread (December 08, 2022)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zfim9u/casual_discussion_thread_december_08_2022/",
        "text": "General Discussion threads threads are meant for more casual chat; a  place to break most of the frontpage rules. Feel free to ask for  recommendations, lists, homework help; plug your site or video essay;  discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n**Follow us on:**\n\n* [Letterboxd](http://letterboxd.com/truefilmreddit/)\n* [Twitter](https://twitter.com/truefilmreddit)\n\nThe sidebar has a wealth of information, including the subreddit  rules, our killer wiki, all of our projects... If you're on a mobile  app, click the \"(i)\" button on our frontpage.\n\nSincerely,\n\nDavid",
        "created_utc": 1670457610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rotten Tomatoes: Too Much Punning",
        "author": "nietzschespizza",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zfhb1u/rotten_tomatoes_too_much_punning/",
        "text": "A glance at RT’s reviews of Bullet Train reveals a plethora of bad train puns. I’ve noticed this before, but never where literally every featured writer resorts to it. (“Pitt keeps the movie from going off the rails,” for example, but there are many, many more.) \n\nAm I reading too much into this, or is it a sign that much of online film criticism is lazy, knee-jerk, &amp; more concerned with touting the supposed cleverness of the writer than it is with thoughtful analysis? \n\nThere needs to be a site that rates film critics by the same naval-gazing standards so often applied to the rating of films.",
        "created_utc": 1670454505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Great films that are minimal films",
        "author": "toastypyro",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zffvjv/great_films_that_are_minimal_films/",
        "text": "A quality of some films that I've been thinking of lately belongs to those that only use minimal productions and costs, yet come out as being as thoughtful, cinematic, or engaging as any big-budget movie. These usually involve one or a few locations, actors, and techniques, but show that some concepts require only that to be a complete package. They're inspiring for beginning filmmakers, countering the idea implanted in us that big spectacles or setups are necessary. What films best exemplify this high quality from low requirements, which brings the talent of direction to the forefront?\n\nI'm probably on this topic anew because of the S&amp;S poll, and the huge shift that is Jeanne Dielman shooting to the #1 spot. I would consider JD as one great example of a film that really didn't require much besides the conceptual contribution of Ackerman. It represents movements like feminism and independent art in part because no one thought to make a film like this or commit to it on this level beforehand. It doesn't view Jeanne like ethnographic or documentary footage would show the daily work of a domestic woman. The focus and control of time create a narrative experience which argues that at some level, only this cinematic presentation expresses the torture endured within a place considered so mundane. We can think in our heads \"they do chores all day\", but in our modern lives often forget what that really entails as our brains process out that which is routine or accepted. At 3.5 hours we expect an epic story, but in JD get an anti-epic, I'd even say anti-film that is scary to those who recognize it as a portrait of most of us in the 20th-21st century. Also, JD wouldn't hold such an esteem without great filmmaking; the compositions and environments are carefully controlled, and Seyrig is sustaining a nuanced performance for endless long shots. You can see what moments she is thinking and at what moments her mind has likely tapped out altogether in service of her labor.\n\nAnyway, besides sneaking in some personal takes on the Dielman discussion, there are more films I recommend:\n\nDogtooth by Yorgos Lanthimos - on a rewatch I loved the film even more, and part of it was honestly just the mastery elevating what on paper could be a limited-feeling low-budget story. A cast of 5 notable characters, locked in one home for almost the entire film, is so fleshed out by the writing and set design which suggests a complex world with history. The acting is already a standout trait that makes Lanthimos' films unique--awkward and robotic but with reasons behind it built by the world. There is an established visual style in the wide aspect ratio, cutting off people at multiple points to create a further inhuman feeling. The tone of the film is tightly controlled, from a discombobulating first act that throws you into this preexisting order, to the black comedy, to a dark intensity that keeps rising until it's too disturbing to even laugh at any more. Killing of a Sacred Deer shows how success and resources can bring about an even better, more polished version of one's brand (it's also in English so I'm not losing any subtleties in the performances), but I gave Dogtooth a 10/10 too because there isn't any way this story could be done better imo besides more expensive cameras, I guess. \n\nStranger by the Lake (2013) was also a very enjoyable thriller that felt like the filmmaker was maximizing a very limited set of tools. Shot at a beach and some woods around it, with only a couple non-famous actors doing more than lounging, it doesn't suggest a large production cost. But the bold choice to frame scenic natural shots with full male nudity--it's a nude beach/hookup spot--and even graphic gay sex sets up its unique tone and use of the classic thriller format to tell a queer story. Information about the crime being discovered is told with the placement of cars in a parking spot, or random items moved or missing from the beach. It was very impressive from a technical standpoint and is one of those that really makes you look out for its director.\n\nHopefully I'm getting at what I mean; here are some more favorites in this lane I want to shout out:\n\nClimax (Noe is established, but somehow the 'quickie' this production is described as is my favorite of his)\n\nEraserhead (most would not like their first production to be drawn out to 5 years, but this film is timeless and perfect at an unbelievable budget)\n\nTaste of Cherry, Pink Flamingos, Evil Dead, Elephant",
        "created_utc": 1670451368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Film &amp; TV Job Fair",
        "author": "cinecircleuk",
        "url": "https://www.reddit.com/r/TrueFilm/comments/zf87rt/film_tv_job_fair/",
        "text": "[removed]",
        "created_utc": 1670435762,
        "upvote_ratio": 1.0
    }
]