[
    {
        "title": "I'm not really sure",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/348ek0/im_not_really_sure/",
        "text": "There are a lot of classifications of religious or non-religious beliefs, but I'm pretty sure my views wouldn't fit them. If they do, please tell me. While science shoots down most of the Bible, it is one of the most intelligently written guides to moral right and wrong (though obviously outdated). I want to believe in a God, if not an omnipotent and mysterious one. The people who are talked about on these types of subreddits are idiots. I've been told that being truly religious is being able to decide what is litteral and what is metaphorical based on personal views. That In mind, I can't really justify doing the same. My strongest held belief is that all people should have free choice, and that it's wrong to tell them to change themselves. What is this? What am I?",
        "created_utc": 1430275898,
        "upvote_ratio": ""
    },
    {
        "title": "Guys I need help with this debate I'm having with someone on YouTube! Please help!! :D",
        "author": "GamingHatchElite",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/346qnv/guys_i_need_help_with_this_debate_im_having_with/",
        "text": "Hi everyone, I'm new to reddit, so I'm probably not going to have the right \"reddiquette\" (correct me on anything if I'm wrong lol) but I need a bit of help. I was having a debate with this religious guy on Youtube and me being stupid, decided to make a point that was completely correct in my opinion but I wasn't particularly knowledgeable on the subject so he replied to me in a way that I don't have any idea how to respond too without making myself look like a dumb ass.\n    Basically, I will explain how it all happened as simply as I possibly can:\n    He was arguing that I was crazy for thinking that something could just emerge from nothing and so I responded by saying that he should check out quantum fluctuations. He replied with this:\n     \"GamingHatchElite, quantum fluctuations require the laws of physics. So where did the laws of physics come from? Virtual particles require a vacuum, what exactly created this vacuum. They also require extreme temperature variations. If there was no material universe what cause the temperature variations. Also they've only ever been \"observed\" or noted in the presence of other particles. Where did these other particles come from? You must have a lot of faith as it takes more faith to believe in quantum fluctuation creating the universe than it does God. You must be a freaking retard.\"\n    I dunno how to respond really, because it is one of those types of arguments that could bounce back and forth continuously. This is the problem with these religious people, as soon as science can't explain something, they immediately respond by saying things like \"God did it then\". \n    Thanks for reading and I hope someone can help me out here lol.",
        "created_utc": 1430248356,
        "upvote_ratio": ""
    },
    {
        "title": "Why it's human nature to believe in god(s).",
        "author": "czah7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/346eg1/why_its_human_nature_to_believe_in_gods/",
        "text": "So this is spurred from something Richard Dawkins has said in many of his debates.  As expected, it more or less centers around evolution.  \n\nWe are wired to believe that there is AGENCY behind everything.\n\nThis is a good thing, it is probably why we made it as far as we did.  But, it also has led to religion, which many of us agree is not necessarily a good thing.\n\nLet's take a massive tornado as an example.  You are hiding in your house, and it rips everything apart.  You and your children appear to escape barely with your lives.  Everyone will have one of two reactions.  Being grateful or being angry.  But who are you angry at?  Who are you grateful towards?  We want to insert an agency to direct our emotions at.  \n\nThe evolutionary reason for this is because it has saved our lives to think this way.  When we were more primal and the water bubbled, or the grass moved, or the tree rustled, we needed to believe this was agency and not natural.  More often than not it was a natural occurrence, but the penalty for being wrong in that scenario is likely death.  So if we apply agency to these events most or all the time, it dramatically increases our chances of survival.\n\nI think most of us have known this on some levels.  And a lot of you probably know exactly the debate line he used here.  But I thought it was a good explanation.  It resonated with me.\n\nMany religious people will argue that the reason we appear to be predestined to believe in a God is because 1) A God exists, so it makes sense. And 2) God applied the trait to us.  The problem with that is it's like arguing that an apple is red because God wants it to be red.  Let's not consider the logical and scientific reasons why it's red...God made the apples, so that's why.   It's an a priori argument.  Meaning you started your argument with your belief already made, then structured it to fit.  Rather than letting the structure and conclusion determine your beliefs.\n\nThese scientific or logical reasons to explain why we feel one way or another isn't some major explanation as to why God doesn't exist, or some religion isn't true.  It's not a nail in the coffin or checkmate.  It doesn't by itself prove anything.  It's just another straw to throw on the pile.  Eventually that pile gets too heavy to carry.",
        "created_utc": 1430243201,
        "upvote_ratio": ""
    },
    {
        "title": "He converted to Islam in Hedayh office",
        "author": "mostafa28",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3457yp/he_converted_to_islam_in_hedayh_office/",
        "text": "",
        "created_utc": 1430222591,
        "upvote_ratio": ""
    },
    {
        "title": "Natural belief?",
        "author": "phc_me",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/343gtw/natural_belief/",
        "text": "So first excuse the rant I'll make a point in a Second. \n\nMy eight year old daughter told me today that my mother informer her I am possessed by the devil. While it doesn't surprise me, even though my mom and I have a good relationship, I didn't think that was exactly how the conversation went. \n\nAfter bringing this to my mom, she gets pretty defensive and asks if I would believe such a thing. I told her that I did. Maybe it wasn't so cut and dry, but my daughter walked away thinking her grandma thinks I'm possessed. \n\nTwenty minutes or so go by after we get off the phone. She calls back to tell me that she thinks she figured it out. According to mom, my daughter asked her why I don't believe in god.  Mom tells her she thinks the devil tricked me. This sounds good exactly like mom. Of course, she thinks that's ok, but telling her I'm possessed is harmful to a child. Ridiculous. \n\nDuring our second conversation she tells that my daughter has a \"natural belief\" and that we all have a \"natural belief in our creator\". Of course I refute that with we would all believe the same thing if that were true. \n\nSo.... Here we are. I'm more upset about this natural belief nonsense than I am about the possession nonsense. \n\nWhile I truly don't have a problem with my mom believing whatever she wants as it makes her happy, I have a real problem with her filling my kids' heads with her beliefs. I don't even fill their heads with my own beliefs. \n\nThe discussion I'd like is how do I go about filling my daughters in on my beliefs without pushing. I've always wanted to just give them the tools to make their own minds up. Maybe this is just growing pains of a sort.",
        "created_utc": 1430180706,
        "upvote_ratio": ""
    },
    {
        "title": "Religion and downvotes!",
        "author": "SteveBJobs",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/342oc5/religion_and_downvotes/",
        "text": "",
        "created_utc": 1430168036,
        "upvote_ratio": ""
    },
    {
        "title": "The British Humanist Association Twitter Campaign",
        "author": "think_damn_it",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/340jdq/the_british_humanist_association_twitter_campaign/",
        "text": "",
        "created_utc": 1430129064,
        "upvote_ratio": ""
    },
    {
        "title": "Help. Please?",
        "author": "turndownforhwat123",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3403fp/help_please/",
        "text": "Hey guys. I don't normally post/comment,but I'm feeling desperate enough for it. \n\nI need help. In the past six months my symptoms of panic,depression and anxiety have increased significantly. \n\nThe cause of it all is religion. Before you say anything else,understand that I cannot abandon it so easily. I was born into it,raised through childhood under it's influence and finally attended a private religious school for several years. \n\nBut it's driving me nuts. Literally nuts. I've been diagnosed with severe panic and anxiety disorder,OCD,and agoraphobia. I have already been institutionalized and fear it may happen again if I don't improve. \n\nI can't stop thinking about hellfire and death and judgement day. I can't stop thinking about those people already dammed and those destined for it and maybe me,or my family are among them.\n\nI just can't be open about such matters with my parents,friends,family-I feel like in some way I'd be betraying them. I can't tell them about the doubt I have. I don't want them to shut me out. \n\nBut what can I do? I could talk about this to my therapist(s),but even then it seems to intimate a topic of discussion. Besides,what insight could they possibly offer that would be exact or applicable?\n\nSorry if it sounds like I'm complaining. I just-I've tried other (religious) subreddits but nobody's even bothered to reply. \n\nEveryday I feel less in control and I am starting to think about harming myself and others. I just don't know what the fuck to do. \n\nAnd above all else,I need to emphasize that despite the above,I don't wish to leave this religion. I really don't. \n\nI just thought,there's sure to be some of you out there with stories like mine and maybe you could help? Anything,really-I just need advice. :(",
        "created_utc": 1430114572,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism, for some reason, doesn't settle well with me...",
        "author": "TheOtherCollin",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33z6ca/atheism_for_some_reason_doesnt_settle_well_with_me/",
        "text": "For quite some time, I have been an atheist, but I constantly feel like it isn't right not to believe in a God and follow a religion (and the one I have had in mind for quite some time is the Baha'i Faith), that there has to be something, and it bugs me.  I can explain away the issues with tons of religious arguments.  I can tell you why I am an atheist.  It just doesn't settle with me.  Deep down, I want there to be something more, but my conscious thought conflicts with this.  I am, almost uncontrollably, trying to find some excuse to believe; it bothers me that I have this internal conflict like this.\n\nDoes anyone have any advice to give me to be able to feel better about my atheism, to make it settle better with me?  I've pretty much been trying for a year and a half to two years, and I am obviously not getting anywhere.",
        "created_utc": 1430094984,
        "upvote_ratio": ""
    },
    {
        "title": "Christian willing to trade books with anyone on here.",
        "author": "grimgrefercma",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33z06o/christian_willing_to_trade_books_with_anyone_on/",
        "text": "I am a christian who feels strongly that I should at least understand the mindset or otherwise show respect to those who don't agree with me on the subject of religion. So, I have a proposition.\n I don't feel comfortable supporting people like Richard Dawkins or anything myself but if anyone on here is willing to send me a copy (I'll pm you my address) I will make a covenant with you to read any books you send as time allows that refute my faith in a god or christianity.\n If you would like and/or are willing to do the same, I can send you faith based books I find to be good evidence or otherwise are good representations of what and/or why I believe.",
        "created_utc": 1430091724,
        "upvote_ratio": ""
    },
    {
        "title": "Romania made religion non-mandatory in schools a while ago, and...",
        "author": "vesser99",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33yqg9/romania_made_religion_nonmandatory_in_schools_a/",
        "text": "...about 88% of students still choose to participate. Mind you, we're not talking about actual religion hystory, but of \"Orthodox education\". Now, from what I understand, a lot of the students are being pressured to continue taking religion classes by their teachers, priests or even parents, some of them even being threatened by previously mentioned authorities with \"an eternity in hell\", or even worse, the risk of being expelled. As an atheist student who abandoned the previously mandatory religion classes with few to none reprecusions, I was wondering what you guys think, since this is quite a problem here in Romania.",
        "created_utc": 1430086766,
        "upvote_ratio": ""
    },
    {
        "title": "Is belief without evidence irrational? Why?",
        "author": "ljn9",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33yph7/is_belief_without_evidence_irrational_why/",
        "text": "",
        "created_utc": 1430086263,
        "upvote_ratio": ""
    },
    {
        "title": "Credibility of \"Jesus On Trial\"",
        "author": "Lightningdrake99",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33xshe/credibility_of_jesus_on_trial/",
        "text": "",
        "created_utc": 1430070136,
        "upvote_ratio": ""
    },
    {
        "title": "I need someone to please help me understand what is going on, I'm a little bit desperate.",
        "author": "Throwway953",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33wbaf/i_need_someone_to_please_help_me_understand_what/",
        "text": "",
        "created_utc": 1430029332,
        "upvote_ratio": ""
    },
    {
        "title": "A reminder. That after all is said and done, after all the theological and cosmological arguments are made, God is still a terrible being. [Rant.]",
        "author": "darkhei_noam_chomsky",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33vzo3/a_reminder_that_after_all_is_said_and_done_after/",
        "text": "",
        "created_utc": 1430020660,
        "upvote_ratio": ""
    },
    {
        "title": "My strange matrix-esque theory about the universe. Long post",
        "author": "entropy321",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33vvr2/my_strange_matrixesque_theory_about_the_universe/",
        "text": "So i find myself in an awkward position when it comes to religious philosophy.  I identify as a Christian, so this post will be from that perspective. But I find myself frustrated with the majority of the members of the religion, that take the concept of God as a supreme unknowable force that shouldn't even be attempted to be explained or understood in a real metaphysical kind of way. I also find myself frustrated with the atheistic community that immediately dismisses me as delusional or nonintellectual for even considering the possibility of the existence of God. \n\nI really believe science and religion as we know it today can find a plausible coexistence, and that embracing one does not necessarily mean forsaking the other. I am also willing to admit that I may be completely out in left field here and have watched too many science fiction movies but I'm honestly curious as to what people's thoughts are about this proposed model\n\nIn modern human history we have developed technology that would have been incomprehensible to humans that lived just 100-200 years ago. In the past 50-100 years or so, that we have had modern communication technology, we have made enormous strides in computing technology. In all of human history 50-100 years is a drop in the bucket. I think it is reasonable to assume that a civilization that has had the same type of technology we now have, for thousands of years longer than we have, would have the ability to create a universe that is as complex as ours is in the same way we build semi-realistic small universes using computer simulation. \n\nI believe that the concept of God could be a race of intelligent beings that operate this universe under the banner of a common goal somewhat like a company does in this reality. It sounds cheesy but bear with me: God would be essentially like the founder and the angels would be the system admins. It is my speculation that this universe is but a fraction of what their universe actually is comprised of. I believe that this universe we find ourselves in, is a simulation that was designed to create \"artificial intelligence\" that can be imported into their universe through some means. The Bible talks about the concept of heaven and a \"new body\" what if this universe is a way of developing intelligence that fits in with the culture of that world to be integrated into these \"new bodies\" that they have created. The \"souls\" or intelligences that do not meet the requirements for integration into their world are simply deleted when they die or \"lost\" to use Christian terminology. \n\nI also believe that this simulation can be run from start to finish instantaneously and that certain events or circumstances can be altered to create alternate realities and that these alternate simulations can be seen side by side by the creators. In their timeline this universe has already been created and destroyed and they have already selected the intelligences they want to upload into their universe, we however still have to perceive whatever reality was ultimately chosen to be the final running of the simulation in the timeline that exists in this reality. \n\nI'm not going to sit here and say that I know for a fact this is how the universe works and I can prove it. But I really believe a model similar to this one can explain a lot of the disconnects between modern science and religion, but I'm curious if anybody in the skeptical community thinks this sounds even remotely plausible / reasonable.",
        "created_utc": 1430018068,
        "upvote_ratio": ""
    },
    {
        "title": "I can't decide what to believe. Very long post...",
        "author": "Invicta_Homo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33ue4g/i_cant_decide_what_to_believe_very_long_post/",
        "text": "I should probably give some background. I'm currently 22 years old and just out of college. For several years of my life, starting around age 18, I identified as atheist. Before that, I believed in my own personal God. I never believed in the Christian God. I believed that God gave humans the ability to reason and that the point of life is to discover truths of the universe and unify with God. I guess you could liken it some form of Unitarian Universalism or Deism? I'm not sure.  Anyways, I got away from that belief and started adopting apathetic and nihilistic attitudes. I eventually suffered a serious mental breakdown that started a couple years ago. I was struck with severe anxiety, depression, anhedonia and suicidal thoughts. This reached its peak about a month  ago I would say. Don't worry, I'm not actively suicidal anymore. I've moved beyond that mindset.\n\nIn response to my problems, I turned back to believing in God to get me through crisis. I found that it didn't really work and I eventually came to realize that only I have the ability to solve my mental issues. Only through proactive exercises have I been able to stabilize my thoughts. I still suffer greatly and it is difficult to find a context for my pain. So now, I still sometimes believe in God, but I don't believe that God helps me through my struggles. I just believe that God might be a goal that I am working towards. An understanding of spiritual and physical truths.\n\nOn the other hand, when I feel more mentally stable, I don't feel compelled to believe anymore. I still feel somewhat listless, but I feel freer. I've been reading the works of Nietzsche and I believe that it has helped soften my anxiety and depression somewhat by putting things in perspective for me. One thing that I really admire in Nietzsche's work is his insistence upon self-affirmation and that meaning is relative to the individual. At the very least, you must uphold yourself. I also admire his master/slave moral scheme. \n\nAlthough science has achieved largely objective knowledge, the values that people hold remain entirely subjective.  I think that this is the great challenge of modern society. How can a world in which all values are subject to individual interpretation hold itself together without turning back to arbitrary, universal,  and religious, value systems? If anything, the hegemony of Western civilization has largely been due to the uniting force that Christian values has had on people. Now that this uniting force is rapidly disintegrating from within, the West's influence is in decline. Will the world turn to chaos in the face of nihilism? Can new values be affirmed to uphold a higher mentality? Only time will tell I suppose...\n\nI would like to ask some questions regarding meaning and purpose in life. How do folks here approach meaning? Do you think that we can create our own meaning in our lives, roughly following an existential approach? Or should we not even endeavor to search for meaning in the first place? Is meaning an illusion? Is meaning itself logically impossible? I tend to now follow the Nietzschean philosophy of creating one's meaning through the revaluation of values. \n\n*****\n\nThe following consists of disjointed musings...\n\nTheistic Musings: Belief is the hope of things not seen. I have often felt that my life had a clear purpose. The purpose being to grow stronger as a person and overcome challenges. I have often felt that this was the true meaning of life. Of course, I have no evidence for such a claim, but it makes sense to me in a metaphysical sense. I've also been convinced on and off that there is an afterlife, and this afterlife is what I am striving for. I largely find this life to be thoroughly unsatisfying. Perhaps Socrates was wrong. Perhaps the examined life, rather than the unexamined life, is not worth living.\n\nDue to my mental instability, I have often been drawn to religion (and philosophy) to find a context for my suffering. To the mentally ill, life is like a prison. For them, if religion is true, the next life is all they have to hope for. Conversely, if however, religion is false, this life is the only thing that they have to fear. Perhaps you can see the dichotomy at play here? Struggling through illness without a blind faith of some sort becomes worse than meaningless. It becomes meaningfully awful. The great question to me is whether our lives have value. Whether the ill suffer to experience greater affects in the future life. Whether the weak struggle to eventually become strong. Whether the foolish can become enlightened. Whether the sad and anxious can become happy and content. What reason do we have to believe it is possible? What reason do we have to believe it isn't?\n\nAtheistic Musing: In those darkest of days, I came disturbingly close to ending my life. Since I have stood so close to the edge of life, I can now value the beauty of it. I can admire its full breadth with awe. When my life stood before me, I had a choice: to embrace it, or to end it. I chose to embrace it. I chose to affirm my life. I chose to create myself. And I chose to leave belief in God behind... Beauty does not require a God. Love does not require a God. Why then, does humanity require a God?\n\n*****\n\nAnd now, a couple quotes from Nietzsche for your consideration:\n\n&gt;Perhaps man will rise ever higher as soon as he ceases to flow out into a god.\n\n-The Gay Science\n\n&gt;He who has a \"Why?\" in life can tolerate almost any \"How?\".\n\n-Twilight of the Idols\n\n*****\n\nI see atheism as arising largely from the affirmation of the self. Nietzsche speaks of the \"will to power\" which I think addresses this idea. To an atheist, all things of importance come from the self. To a theist, all things of importance come from God. I feel that self-affirmation is superior due to it's liberating and strengthening ability.\n\nEven without God, I see the possibility for spirituality. The word 'spiritual' is so vague though. I see spirituality as the emotional aspect of life. The indescribable feelings that we have as humans that we can only assume others experience through empathy. Spirituality to me refers to that which is felt subjectively rather than seen objectively. Man's passions, his will, that is what is truly spiritual.\n\nSo now, I feel I am in limbo. One day I believe in objective purpose and God. The next, I am completely atheist. I can't decide what to believe. If one chooses God, one is pressured to perform to God's standards and one must properly identify those standards. If one chooses atheism, one is lost in a void of meaninglessness. Can you really create your own meaning, or was your meaning given to you all along? Or is the world just unintelligible and is knowledge impossible? Can you convince me either way? Also, I still have a deep set fear of the afterlife and God. Fear of punishment in the afterlife was actually the main motivator that prevented me from taking my own life a while back. If someone could try to convince me why this is illogical, I would appreciate it. Of course, at this point, I am heavily leaning toward atheism and a I firmly have my foot in the door. All I need to do now is walk in...\n\n",
        "created_utc": 1429987661,
        "upvote_ratio": ""
    },
    {
        "title": "Moral dilemma: humanism vs. moral nihilism",
        "author": "IBelieveInLogic",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33tspr/moral_dilemma_humanism_vs_moral_nihilism/",
        "text": "Since deconverting, I've noticed that on some issues my personal morals seem to be inconsistent, and sometimes bounce between something resembling humanism and moral nihilism.  In most situations, especially those that I consider rationally, I tend to favor humanistic values like honesty, compassion, and fairness.  For example, when it comes to political issues, I now tend to side with those who would give assistance to people who are poor or disadvantaged, whereas when I was a christian I felt that government shouldn't be taking money from rich people and giving it to poor people.  However, there are other situations where my initial reaction is different.  I don't feel any guilt about taking a few dollars from the group coffee collection at work if I want something from the vending machine.  It's a relatively small amount, and I no longer believe that I will be punished for bad actions.  \n\nThe other day, I returned some items I'd purchased at a retail chain.  It was a somewhat complicated transaction, and the customer service clerk accidentally gave me a gift card for the value of one item while also ordering me the same item in a different size.  The result is about $150 in my pocket that I shouldn't have.  Now, the rational side of me that believes humans need to work together for a better society thinks I should explain the situation and return the extra gift card, while the greedy side of me would prefer to hold on to the extra money -- it's not directly hurting any individuals, and nobody would ever know.\n\nI suspect that some of the conflict is due to the rural, conservative environment in which I grew up.  Individualism was almost a religion itself.  Anything resembling government interference was automatically considered bad, and almost anything an individual could do was considered acceptable (except for things like being gay or having sex outside marriage, of course).  I still feel like individuals deserve rights, and cases where individual rights conflict with the greater good of society are where I am conflicted.\n\nHas anybody else experienced similar conflicts?  How can I resolve a humanistic philosophy in general with ideas that individual rights are important?  Any advice in this particular case for what I should do? ",
        "created_utc": 1429976809,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling useless",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33tgug/feeling_useless/",
        "text": "I type this in this subreddit because other places might give me some supernatural bullshit. I am unemployed. I am a financial burden of society. I am self entitled and ignorant. I am not as appreciative of the things I have as I should be. Why should I keep existing? Sorry to put this question in your hands but I need help x)",
        "created_utc": 1429969417,
        "upvote_ratio": ""
    },
    {
        "title": "What would change your mind?",
        "author": "Igortheinvincible",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33sycy/what_would_change_your_mind/",
        "text": "I had a very interesting and friendly discussion with a friend the other day. He's a believer who was brought up in a very religious home, but is still very open minded about other perspectives as well as analyzing his own viewpoints. From what I could gather I'm the only person he's spoken to who challenges the existence of God, along with the supposed authority of the bible. \n\nAt one point he asked me what would sort of evidence would be needed for me to change my mind; what would convert me from an atheist (I consider myself a strong atheist, but philosophically speaking still technically an agnostic atheist) to a believer. Curiously, I was unable to come up with a single example. In every case I could come up with - God revealing himself to me, or somehow speaking to me - I always felt as if the more reasonable explanation would be that I had gone mad, or that I was temporarily delusional. Even if some sort of biblical passage would directly *lead us* to an amazing scientific discovery, rather than simply claim to predict it when believers try to retrofit it, I'm unsure if I would chalk this up to the divine; very probably not. \n\nIt all boils down to the fact that I find God to be such an *incredibly* unlikely concept, that I find other explanations to be more parsimonious and reasonable, such as personal insanity, in any scenario I can come up with. \n\nI still stand by this statement, but at the same time realize that this is very similar to when Ken Ham says that nothing whatsoever could change his mind. This is not something I'm comfortable with.\n\nWhat sort of new evidence should I - as a (supposedly) open-minded person, willing to adjust my views when given new evidence - deem sufficient for me to change my mind?\n\nThankful for any feedback. \n\n\nEDIT: Clarification, I'm taking mostly about the *christian* God. Whether or not the universe was created by a nebulous, hard-to-define supernatural being, is a different story. If the cosmological consensus suddenly changed, and the our universe somehow required a prime mover, I would accept that - depending on the evidence. ",
        "created_utc": 1429952020,
        "upvote_ratio": ""
    },
    {
        "title": "My best friend, that I've had for years, and has told me is christian, started talking about the illuminati today...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33secg/my_best_friend_that_ive_had_for_years_and_has/",
        "text": "I am not so sure how to go about posting this other than that I was fairly okay with his christianity. He never pushed it on me and I never pushed atheism back.\n\nBut suddenly today he decided to talk about illuminati and how it's the reason Paul Walker died etc.\n\nI wanted to tell him to shut up and go home. But I couldn't.\n\nReddit, have you found yourself in this odd position before? Having to deal with your best friend believing in such crazy nonsense and pushing it on you? What do I do?",
        "created_utc": 1429934854,
        "upvote_ratio": ""
    },
    {
        "title": "Are younger religions more dogmatic/zealous/close-minded than older religions?",
        "author": "Jtmoor",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33rjy5/are_younger_religions_more/",
        "text": "So I've often read on this sub and similar ones that younger religions, particularly Islam, commit more extreme acts and are less open-minded than older religions.  Many people give an example of how Christianity has changed over time to a more peaceful/tolerant religion (relatively speaking).  My question is, are there an theories or writings from sociology or anthropology that specifically address this?  I would like to learn more about this progression over centuries.  ",
        "created_utc": 1429916525,
        "upvote_ratio": ""
    },
    {
        "title": "Religiosity: the US now, verses 20+ years ago. Has there been a material increase or is it just a contemporary (mis)perception?",
        "author": "Fire_Mission_Bty",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33pdc2/religiosity_the_us_now_verses_20_years_ago_has/",
        "text": "The US appears to be portrayed as markedly more right-wing and especially conservatively Christian by the media, than I remember it being in ’92. Is this true? \n\nAnd if asked about my religion, should I expect to face open hostility unless I hide my atheism or deflect any questions about my church affiliation?\n\nPlease don’t misunderstand me; I have no intention of pushing my views on anyone but, I do have a bad habit of talking straight and telling the truth. Often without thinking, or regard to its (potential) consequence.\n\nSome back ground: My wife has finally conquered her fear of flying and so in May this year, I am returning to the States to visit family there, for the first time since ’92. In the 23 years preceding then, I had visited 10 times, all East Coast from NY to FL (expect one trip to Alaska in ’86) and mostly centred around my Uncle’s home in Columbia, SC. I still have some family in SC as well as friends that I made there, aged 5. The family has now spread to include NC &amp; AL as well. We arrive/depart through Atlanta, GA. So, I’ll have a lot of driving to do in those two weeks!\n",
        "created_utc": 1429878342,
        "upvote_ratio": ""
    },
    {
        "title": "Peter Boghossian's A Manual for Creating Atheists- Implementation",
        "author": "think_damn_it",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33p0q8/peter_boghossians_a_manual_for_creating_atheists/",
        "text": "Hello,\n\nThis is my first post to this subreddit after it was advocated in r/atheism.\n\nI'm a huge fan of the old favourites like Hitchens, and Harris, etc. \n\nI agree with Hitchens that we need to take an active role in diminishing the impact of religion in the world, but how do we go about doing this? We can't all be talented writers with a platform that people really listen to you from.\n\nPeter Boghossian presents an alternative; it turns the larger ideological battle in to more of a one on one dog fight (the war metaphor may not be  wholly appropriate but it will serve), by suggesting that trying to change the views of religious people in a one-person-one-idea-at-a-time way can be hugely powerful.\n\nFirstly I am wondering how many people have read Boghossian's book 'A Manual for Creating Atheists'? For those who have read it, how successful have you been in challenging views through the use of Boghossian's proposed methods?\n\nA second question that I would like to ask is; whether you have read Boghossian's book or not what do people (through actual experience or just considerations) think are good methods for challenging people's religious view, and supporting them to question their faith?\n\nIt would be hugely interesting to hear people's experiences in challenging religious views and all of the potential successes and failures that come along with this!\n\nIf a conversation builds up then I will share some of my own experiences.",
        "created_utc": 1429867749,
        "upvote_ratio": ""
    },
    {
        "title": "To the People of the Future...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33myyn/to_the_people_of_the_future/",
        "text": "",
        "created_utc": 1429822542,
        "upvote_ratio": ""
    },
    {
        "title": "Relationship help? How do i handle this situation?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33m7xu/relationship_help_how_do_i_handle_this_situation/",
        "text": "*EDIT: Situation resolved.  My brain already knew what to do, I just wanted to check with you guys, as I have never encountered such a situation.  After reading my own post, I knew.  I've spoken with my friend, I told her that I understand her frustration and that she should explain to him that religious and political discussions have no place in the workplace.  This dude is like 10-15 years older than us, he should know better.  Anyway, if he starts again when I'm near him, I will absolutely tell him it's not appropriate.  Thanks all!*\n\nI work in a STEM field.  I am an atheist, but probably more accurately an anti-theist.  I believe that religion does more harm than good.  **I don't voice these opinions as I believe that religion/lack of religion is something you keep to yourself - at least at work.**  There are, of course, exceptions.  Most of my colleagues are also atheists.  \nIn the last week, we've had more field work that usual.  We've started listening to comedy on our way to and from the field locations - George Carlin being a staple in the mix.  One co-worker of mine does not share the same \"keep it to yourself\" view and often rants and criticizes religion.  Another co-worker/friend of mine is religious - a Catholic.  She naturally gets angry/uncomfortable when this guy rants or when there's a comedy skit involving religion.  \n\nShe knows I'm an atheist and I know she's religious.  We don't talk about religion and we get along just fine.  We're pretty good friends.  Lately though, she's been texting me regarding the guy who is always blabbing.  I want to sympathize with her, but I just can't so I usually don't reply and we'll talk about something else.  \n\nThe latest text:\n&gt;I am so fucking sick of *guy-who-always-rants*'s fucking bigotry towards religion. This is why I've been so sensitive lately.\n\nI'm the type to want to comfort those in times of distress, but I can't this time.  I don't consider criticizing ridiculous and often harmful religious beliefs as bigotry.  I'd love to point out why I feel the way I do to her, but I know nothing good would come if it.\n\nHow do i handle this situation?  What would you do?",
        "created_utc": 1429810757,
        "upvote_ratio": ""
    },
    {
        "title": "Could it be considered ethical to pretend to be religious to further atheist goals?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33l1f3/could_it_be_considered_ethical_to_pretend_to_be/",
        "text": " There are so many people who want to do whatever they do in the name of some God or other. Should atheists allow their leadership to be abandoned to, in the view of atheists, a mixture of deluded people and con-men (maybe a few pervs too)? \n\nFor example, suppose I was an church leader in Africa and used  the position to try to discourage the appalling lynching of homosexuals that goes on. To do this I did some charlatan bullshit miracles/ busted some witch-doctors \"in the name of Christ\" if they were causing problems like saying raping a virgin cures AIDS etc. \n\nIf at heart, however, I was simply trying to stop violence from a position of influence, and didn't believe in any God, would I be doing wrong? If we don't have an absolute deity to punish us for anything, could an end like this justify the means? How many atheists in the end adopt a religion so that they can be *useful hypocrites*?",
        "created_utc": 1429789090,
        "upvote_ratio": ""
    },
    {
        "title": "Check out Dostoevsky \"The Grand Inquisitor\" 13 minute film adaptation",
        "author": "jpambros",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33komv/check_out_dostoevsky_the_grand_inquisitor_13/",
        "text": "",
        "created_utc": 1429777298,
        "upvote_ratio": ""
    },
    {
        "title": "My brother has started questioning his faith, and I feel I sorta need some place to discuss or get advice on this",
        "author": "AceStudios10",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33kb6k/my_brother_has_started_questioning_his_faith_and/",
        "text": "First a little background, I myself am an atheist, my mother is Catholic, my father is Anglican, and my brother has moved from Catholic to a sort of agnostic/atheist in between. My parents aren't at  all very religious (hell, they only go to church on Easter and Christmas, and sometimes not even then) and are fine with my choice to be atheist. My brother has started questioning the credibility and logic of the church, and says that atheism/agnosticism just \"makes sense\". \n\nHe seeked me out for questions/explanation after telling me (he hasn't to my knowledge told my parents yet) and I felt blank for answers or explanations. I want to know how to help him out in this time as some people have a hard time leaving their faith. I simplify put want to help my brother and be able to explain agnosticism and atheism well, as I gave him a short and simple explanation and I want to help him understand what choices he is making.\n\nTLDR: give me advice on how to explain atheism and agnosticism in a good way, and how to help my brother with his possibly difficult time loosing his faith.\n\nPS sorry any typos, I'm on my phone and autocorrect and be a b!tch\n\n",
        "created_utc": 1429766133,
        "upvote_ratio": ""
    },
    {
        "title": "Free will doesn't exist if you realize the entire universe is governed by equations with seemingly set number values.",
        "author": "Samesyo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33k86p/free_will_doesnt_exist_if_you_realize_the_entire/",
        "text": "",
        "created_utc": 1429764069,
        "upvote_ratio": ""
    },
    {
        "title": "Interview with the author of the study on Reddit (and r/Atheism) toxicity, Idibon's Ben Bell",
        "author": "BangsNaughtyBits",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33ivf3/interview_with_the_author_of_the_study_on_reddit/",
        "text": "   Thomas on the Atheistically Speaking podcast discusses method and assumptions of the recent Reddit toxicity study with an eye toward the Atheism sub-reddit with the author.\n\nhttp://atheisticallyspeaking.com/as129-reddit-toxicity/\n\nEdit: The author describes his methodology is some significant detail.  I believe it also revealed several significant issues with that methodology.\n\n   I suspect that rather than toxicity, what was being measured was rather the moderation or censorship (not meant strictly in it's normally perforative sense).  The stronger the control and the more limited scope of the subreddits in question seem to directly correlate to lower toxicity values.\n\n   Also, I suggest that as it does not seem blinded, there are numerous places that not merely bias but a directive bias could be introduced.\n\n   Toxic.  In this case, I'm not sure it means what the researcher means.\n\n   There would be a later release covering the data as it is related explicitly to r/atheism.\n\n!",
        "created_utc": 1429739181,
        "upvote_ratio": ""
    },
    {
        "title": "What Truly Scares me.",
        "author": "PopTartFantasy",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33ht7g/what_truly_scares_me/",
        "text": "",
        "created_utc": 1429722578,
        "upvote_ratio": ""
    },
    {
        "title": "I guess I have a yearning for some grand revelation and expected it from atheism.",
        "author": "NickelFish",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33gbkk/i_guess_i_have_a_yearning_for_some_grand/",
        "text": "",
        "created_utc": 1429689582,
        "upvote_ratio": ""
    },
    {
        "title": "Doing a project on Alcoholics Anonymous and atheism - looking for some research help",
        "author": "JediSK",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33fyav/doing_a_project_on_alcoholics_anonymous_and/",
        "text": "Hi everybody,\n\nI am doing a project on AA and how atheist/agnostic patients fare when going to them.\n\nAs you may or may not know, AA is a relatively religious or \"spiritual\" organization. It has [Twelve Steps](http://www.aa.org/assets/en_US/smf-121_en.pdf) outlining what their members follow, and you can see for yourself how heavily they use faith.\n\nAlso, their literature doesnt even pretend to acknowledge non-belief as an option to be spiritual. All they talk about is converting or giving into belief in order to be able to deal with alcoholism. This is a chapter from their [Big Book, titled \"We Agnostics\"](http://www.aa.org/assets/en_US/en_bigbook_chapt4.pdf). \n\nHere is an excerpt: \n\n*To one who feels he is an atheist or agnostic such an experience seems impossible, but to continue as he is means disaster, especially if he is an alcoholic of the hopeless variety. To be doomed to an alcoholic death or to live on a spiritual basis are not always easy alternatives to face.*\n...\n*If a mere code of morals or a better philosophy of life were sufficient to overcome alcoholism, many of us would have recovered long ago.*\n...\n*Lack of power, that was our dilemma. We had to find a power by which we could live, and it had to be a Power greater than ourselves. Obviously. But where and how were we to find this Power?*\n...\n*Well, that's exactly what this book is about. Its main object is to enable you to find a Power greater than yourself which will solve your problem. That means we have written a book which we believe to be spiritual as well as moral. And it means, of course, that we are going to talk about God. Here difficulty arises with agnostics. Many times we talk to a new man and watch his hope rise as we discuss his alcoholic problems and explain our fellowship. But his face falls when we speak of spiritual matters, especially when we mention God, for we have re-opened a subject which our man thought he had neatly evaded or entirely ignored.*\n\nI think you get the point. \n\nSo far there are several studies that I have come across but most suggest that either AA works, or helps convert folk to belief. \n\nOne suggests that [God belief appears to be relatively unimportant in deriving AA-related benefit, but atheist and agnostic clients are less likely to initiate and sustain AA attendance relative to spiritual and religious clients.](http://www-ncbi-nlm-nih-gov.proxy3.library.mcgill.ca/pubmed/12380849)\n\nAnother, that [forty percent of youth who entered treatment as agnostic or atheist identified themselves as spiritual or religious at discharge. Increased DSE was associated with greater likelihood of abstinence, increased prosocial behaviors, and reduced narcissistic behaviors.](http://www-ncbi-nlm-nih-gov.proxy3.library.mcgill.ca/pubmed/25525291)\n\nIt seems to me as if AA is not very accepting to non-religious folk and keeps trying to convert them. For people who doubt faith on logical, evidence-based grounds, and not mere anger or confusion, this doesnt seem like a good treatment option. \n\nI personally would not be able to attend AA successfully. \n\nIn any case, I was hoping you guys could help me out with research links (hopefully scientific studies) relating how AA (presumably poorly) accepts or deals with non-believers, and if there are better alternatives. \n\nThanks",
        "created_utc": 1429679107,
        "upvote_ratio": ""
    },
    {
        "title": "About the common survey question: \"How important is religion to you?\"",
        "author": "A3gis",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33fw1k/about_the_common_survey_question_how_important_is/",
        "text": "There's a picture of a survey on /r/atheism right now with this question on it, and the atheist who filled out the survey bubbled \"not important\". \n\nI feel like religion is very important to me, even though I don't follow one. I think it's absurd that according to some survey-makers, you shouldn't be both atheist and take yourself seriously.\n\nIs religion important in your lives? Have you made up your mind and stopped worrying about it, or do you constantly think about it? Is it even possible to be athiest and have religion play an important role in your life?",
        "created_utc": 1429677645,
        "upvote_ratio": ""
    },
    {
        "title": "How do you respond to people who claim that evidence for the truth of Christianity can be found in the existence of the gospels?",
        "author": "poacheismypseudonym",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33f4u9/how_do_you_respond_to_people_who_claim_that/",
        "text": "I had a very long conversation with an old friend today regarding the \"truthiness\" of Christianity. He argued that because the gospel accounts were written by multiple authors, this somehow added to their credibility. He went on to state that because many of Jesus' disciples were martyred after Jesus' supposed death and resurrection, we have reason to believe that their claims regarding Jesus' claims are true. \n\nMy response was a skeptical one. I said that many people martyr themselves for things that they think to be true, but my friend is quite convinced that this case is different. He went on to state that you cannot correlate the belief of the 9/11 hijackers for example, with the belief of the apostles, because the apostles had \"seen\" Jesus' resurrection. \n\nDespite my inquiry regarding these claims, he seemed extremely convinced that they were absolutely true. He admitted that the entire premise of his belief lie in whether or not this was true. I have to say that he was one of the most intellectual Christians I have met. He is very opposed to anti-evolution and anti-climate change rhetoric, so I was surprised by the relative open mindedness he displayed. Biblical studies is not something I have done much of, so I would like to here from you, what your assessments are regarding these claims.",
        "created_utc": 1429663216,
        "upvote_ratio": ""
    },
    {
        "title": "Don't want to come out yet, what should I say about going to church?",
        "author": "ninklo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33bbh6/dont_want_to_come_out_yet_what_should_i_say_about/",
        "text": "I'm pretty open about my atheism with my friends. Don't go to church anymore, but I'm graduating soon and therefore won't have school work as an excuse to not go to church. Any tips on avoiding church?\n\n(And for me it's not just Sunday church. My church has meetings every damn day, or so it sure feels like it. Especially the Friday night meetings. I'm sure they make it Friday night on purpose.)\n\n**EDIT** I mean coming out as an atheist, not as a gay.",
        "created_utc": 1429585746,
        "upvote_ratio": ""
    },
    {
        "title": "If you're tired of the atheism sub you probably prefer to avoid DebateReligion. If you're interested in the religious education / debates, check out this new sub. It may be a \"religious\" sub but it would be awful not to have any atheistic input if it takes off.",
        "author": "Eleven_ThirtySeven",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33b1n5/if_youre_tired_of_the_atheism_sub_you_probably/",
        "text": "",
        "created_utc": 1429580780,
        "upvote_ratio": ""
    },
    {
        "title": "The limit of f(x) = c/x as x approaches infinity is zero.",
        "author": "killing_buddhas",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3395ku/the_limit_of_fx_cx_as_x_approaches_infinity_is/",
        "text": "",
        "created_utc": 1429550315,
        "upvote_ratio": ""
    },
    {
        "title": "Coming Out The Closest (Help Please)",
        "author": "penskeracin1fan",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/338934/coming_out_the_closest_help_please/",
        "text": "Hello, to keep it short and sweet I will provide a background and my current situation. I am an 18 year old guy that lives in South Carolina. I was forced to go to church until the age of 15 or so, but my family slowly backtracked on going. My family HATES the church and the people in it (corrupt), but they every once in a while get the fever to go back. I see it as their hobby; the same way I view myself going to a concert. Well, Easter was a living hell for me. I came out of the closet after being pinned down and it didn't go well for my parents. They cried, asked why, and shook their heads in disbelief. They also refused to even give my side of it all any thought. I read on here how to and what to do when coming out and stuck to the \"I'm just confused\" thing, but I said the word \"Atheist\" which set them off. \n\nOver the past two weeks things died down (to a degree), but yesterday was the worst as my grandmother came over to ask if I was going to go in front of the church because of my High School graduation? I told her I would, but I didn't want a slideshow to be played (talk about some embarrassment). She then asked \"why I don't go to church?\" in front of my entire family. I then told her the way I feel (lost and trying to find my way back to it), but she just turned and left without a word. I love her very much and it killed me watching her leave like that. I have decided to put my family over my own beliefs once again, but in their eyes I am selfish and only see things \"my way\". Any words of encouragement on how to fix this until college in the fall would be MUCH appreciated.. Thank you for the time and I hope I can help someone else going through this same situation. \n\nBonus: A storm hit last night and we had to be quiet during the \"lord's work\". How is a destructing storm that hurts helpless people Godly in any way? I just shook my head in what is an never ending string of head shakes..\n\n\nUPDATE: I am so humbled by the amount of help, support, encouragement and love being shown toward me, and all the others on this post. You guys are truly keeping my head in the game for say. I'll just try to find a way to get through the next few weeks, months, or even years. One day soon I'll be free from this hell hole; Pun intended;)",
        "created_utc": 1429534831,
        "upvote_ratio": ""
    },
    {
        "title": "A politico.com article about how \"Corporate America\" invented \"Christian America\"",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/337lub/a_politicocom_article_about_how_corporate_america/",
        "text": "I thought this to be interesting enough to bring to your attention.  The use of religion by business interests to cover their greed seems like a hard sell, yet it seems to have worked over the long run, both for corporations and the rich.\n\n\nhttp://www.politico.com/magazine/story/2015/04/corporate-america-invented-religious-right-conservative-roosevelt-princeton-117030.html#.VTJnNYZHbCQ",
        "created_utc": 1429514697,
        "upvote_ratio": ""
    },
    {
        "title": "Just wanted to here people opinions on this matter",
        "author": "TheMisanthropy12",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3379u5/just_wanted_to_here_people_opinions_on_this_matter/",
        "text": "Morality has always been a complex issue that i have struggled with ever since i was a kid. Becoming an atheist has only served to complicate this problem. Religion makes it very easy to answer the hard questions that as human beings we must look introspectively to answer, whilst removing god from the equation makes these questions very unclear. My main question is then is: Is it possible for a sense of absolute morality to exist without the presence of god. By this i mean can actions be considered inherently good or evil without a inherent reason or justification. I understand as human beings we are not inherently good or evil, and that are own morality is not solely composed of singular actions but also takes into account things such as motivations etc...\nMy answer to this question as of late is yes, but i am starting to wonder if i hold that position because i simply want to believe that absolute morality exist because my entire sense of it would be skewed if it were arbitrary and solely based on the whims of society at the time, so i mainly just wanted to hear everyone else's opinons",
        "created_utc": 1429505468,
        "upvote_ratio": ""
    },
    {
        "title": "Despite deconverting and becoming an atheist, the one thing I still truly struggle with is how something as complex as a human being (or the human brain) could possibly come into existence without any kind of intentional creation whatsoever. What am I missing?",
        "author": "mayonnaise_man",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/337866/despite_deconverting_and_becoming_an_atheist_the/",
        "text": "Kind of like an analogy I recently heard: if you were walking outside and saw an iPhone laying on the ground, you wouldn't dig around it to study the dirt layers beneath it, among many other things, to figure out how it formed - you would automatically assume that somebody dropped it there, and that it was intentionally created by someone. But now consider the fact that humans are a thousand times more complex than iPhones. How do you cope with this thought?",
        "created_utc": 1429504364,
        "upvote_ratio": ""
    },
    {
        "title": "Don't we already know of physical laws which are both real and incompatible with the possibility of a creator?",
        "author": "waaiii",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/336rii/dont_we_already_know_of_physical_laws_which_are/",
        "text": "Here's my situation. I don't believe in any supernatural entities. During most of my life after I stopped believing, my reason was just \"*well, there's no evidence, so the default position is to not believe*\".\n\nBut I've been thinking (with my *very* limited knowledge of science) that some laws of physics imply that there can't be a divine creator.\n\nFor example, the fact that time is not an illusion, rather it's a physical *thing* subject to certain laws (the stronger the gravity at one point, the slower time runs there, because of how space-time is warped). If this is true (and apparently it is, it's even possible to measure the minuscule time differences between us here on Earth and the people at the ISS) and the Big Bang Theory is also true (again, everything we know indicates it is) and all the universe was once a single point of infinite density and gravity...doesn't that mean there was no time? So that means nothing can be eternal, because for something to be eternal you need the past to be infinite, and clearly it isn't.\n\nBesides, isn't there a physical law that states matter and energy can't be created or destroyed? So there was never a point at which stuff didn't exist. There was no creation (creation is impossible because of this law) and there was no beginning because a beginning requires time.\n\nAt the end of the day it seems to me that two things are true:\n\n1 - We *know* with certainty that there are certain aspects of nature that are incompatible with the possibility of a creation or creator, so gods are definitely ruled out. And...\n\n2 - It doesn't even make sense to ask how the universe came to be. We exist in a time frame. We can't think of universe \"before\" time. It's basically like trying to imagine the five-dimensional equivalent of a cube. It's just impossible. So why bother?\n\n\nAm I wrong? I've never seen any of those famous scientists bringing this up in a debate, yet it seems it would end the discussion immediately. So I suppose *something* must be wrong with the way I see stuff. Can anybody here with more knowledge of physics tell me if I'm thinking about this the wrong way?",
        "created_utc": 1429494595,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else find themselves trying to tread the middle ground around believers, agreeing with them just to avoid causing a stir?",
        "author": "MartyStuartsNeck",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/336q4c/anyone_else_find_themselves_trying_to_tread_the/",
        "text": "I live in the bible belt and the notion of someone not believing in God is pretty extreme, even more shocking than being gay. I'm a pretty staunch atheist but find that most of the time I just go along with any conversation about religion just to not startle (sp?) people. When people ask where I go to church I just say my work schedule interferes. If people ask if I go to church I usually just say I'm not much into going to church or that I worship in my own time (yea, worship the tv lol). I try to break it to them easy that I'm \"not all that religious\" instead of throwing the word atheist out there which is guaranteed to cause a stir or cause people to judge me falsely. Hell, sometimes I even go along with whatever they're preaching just for fun, sometimes even making points about faith they agree about just to gain their trust (That's pretty cruel, isn't it?). I find it's sometimes better to fight fire with fire and use their own book of beliefs to change their mind about things or to be more open minded, like not judging people or how we're \"all sinners\" and shouldn't throw stones.\n\nAnyway, anyone else just find themselves being a closet atheist on a daily basis and being ok with it? ",
        "created_utc": 1429493811,
        "upvote_ratio": ""
    },
    {
        "title": "Moving back in with my parents",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3361w6/moving_back_in_with_my_parents/",
        "text": "I'm graduating from college, and I don't have a job lined up just yet, so I'm going to be moving back in with my parents for a month or two while I sort things out. It'll likely be rent-free, as my two brothers are also living there for now out of convenience. I'm actually looking forward to it, since I haven't seen them much recently and I want to be able to spend time with them.\n\nThe only thing I'm worried about is the whole atheist thing. I haven't had much push back about it, but I do remember my dad telling my younger brother two years ago during an argument that if he wanted to live there, that he had to go to church with them.  \n\nI'm obviously going to talk to them about it before I move in and make sure that it isn't going to be an issue, but are there other things to bring up or consider besides the 'can I live here even though I don't believe in your god?' bit?\n\nI have a bit of money saved up, so I don't have to live with them if things won't work out.\n\nEDIT: The church thing was an example of something my parents had threatened. I'm fine with going to church, just worried about things potentially escalating.",
        "created_utc": 1429480773,
        "upvote_ratio": ""
    },
    {
        "title": "Letter to a Theist test subject...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3360nz/letter_to_a_theist_test_subject/",
        "text": "\nPlease note:- as a secular humanist when I engage with people in regular life, it is as equals, no matter what their religious belief. I do believe in social multi-culturalism. And I do believe countries like America, Australia &amp; Canada (and others) who's cultural identity includes immigrants best express that pluralistic ideal. When dealing with people in yours and their lives you need to be tolerant, understanding, compassionate and liberal.\n\nBUT I write the following based upon the engagement of ideas.\nBecause in the realm of Ideas the discussion of religion is a done deal with regards to a scientific world view.  Even if the odd occasional scientist holds religious views - but effectively as a practical functional world view - religious magical thinking is dead. No one data mines the torah or new testament or qu'ran for insights into psychology, or physics or mathematics.\n\nWith that preamble in mind I address my letter....\n\n\nDear Theist,\n\nDo not mistake our relationship when discussing your religion.\n\nThis is not a discussion between competing ideologies, an exposition of ideas to determine the veracity of one belief over an other.\n\nNo, this is we the scientists, with an unblinking eye, examining under a microscope an infectious virus.\n\nThe question is not, does Zeus, Odin, Allah, Yahweh, Jesus etc. exist. The question is why do people believe stupid things?\n\nThe question is not why do you have faith? The question is once culturally indoctrinated, when presented with ideas attacking that culture, why do you believe that strengthens your faith? Is then \"Religious Faith\" a controlling emotion for social identity and bonding? Inflamed when attacked?\n\nWhen asked about love, guilt, sex &amp; spirituality - it is with curiosity how you so readily allow natural human built instincts that you control and own, be co-opted into a religious framework that not only claims ownership but then sets itself as the sole gatekeeper to accessing you human nature. Do all social systems function like this to a lesser or greater degree? Is this an essential trait of all societies that hope to scale into massive human hives. Under the dissecting scalpel not your beliefs for they are just strings that tug at your heart strings, but the entire system that allows me to manipulate you like a marionette.\n\nWhen talking about evidence of your Savior/Prophet/Gods veracity, we don't expect proof - we are marking and identifying the chains of logical fallacies that bind you. As we listen to you talk in circles, it's the vulnerabilities into the human cognitive model into which bad ideas can insert themselves that we seek to identify.\n\n- Circular Reasoning or begging the question, check.\n- Special Pleading, check.\n- Appeal to Authority, check....\n- No true Scotsman, check...\n- etc.etc.etc.\n\nWhen we discuss morals, I'm not interested in the reasons you use to justify primitive beliefs, I'm questioning why is this cultural delivery mechanism so resilient to adopting evolved cultural norms. Why does Religion look like an insect trapped in Amber, a moment of tribal jurisprudence frozen in time and as useful as a paper weight in a digital age.\n\nWhy does one Western culture allow malignant strains of Religious Extremism to fester like a wound that threatens the whole, that in the end erupts into a social pus. While yet other Western cultures are able to more readily absorb the toxins and produce an ameliorated but weakened humanistic strain of a religion. What are the strands of Muhammad's/Joseph Smiths/Jesus's social DNA that can be saved, while those cancerous other need be excised from the cultural genome.\n\nAnd yes. We've even done experiments and tests on children to see how far beliefs can be taken.\n\n- Cruel social Experiments like the Santa Claus and the reward dynamic\n\n- The Easter Bunny and the incoherence test.\n\nWhy when the society tells children their carefully nurtured beliefs are not real, cruelly stripped from them, do they not follow a logical conclusion with respect to other cultural superstitions? Why do we who see it as a mercy for Santa Claus in not holding childish thoughts, not see it as a mercy for other beliefs \n\nEach of us holds a shoe box and within it all the other beliefs of every other religion, while the hands that hold the shoebox are our own. You believe you stand within just one more box, that of your deity for reality ends with it.\nMy shoe box contains all the self constraining religions with \"a priori\" beliefs, and I welcome all others to stand outside and help hold the box for we just do not know the vastness and nature of everything out side the box.\n\nWhy Study Religion? Why do we argue?\n\nUltimately we study it, not because it's a beautiful predator, that given free reign will extinguish a regions cultural biodiversity.\n\nWe study:-\n- To understand our own resilience to the infection.\n\n- How were we cured?\n\n- Why am I not infected?\n \n- Can I build resistance for it in my loved ones? Maybe by injecting them a few dead ones first?\n\n\nIt seems a hopeless task some days, its like curing a brain eating zombie virus.\n\nFor myself I guess hope drives me. \nTo see the one I love cured, to see those dull milky eyes regain their reason, and not remain that slavering, mindless shambling brain eating zombie she has become, so we can be together again once more.\n\n\nYours Ironically,\n\nNot the Closed Minded one.\n",
        "created_utc": 1429480110,
        "upvote_ratio": ""
    },
    {
        "title": "CBS \"Sunday Morning\" airs terrific segment on atheism in America and on \"the difficulties of coming out as an atheist whether it's due to skin color, geography, or just plain fear\"",
        "author": "mepper",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/335puh/cbs_sunday_morning_airs_terrific_segment_on/",
        "text": "The segment concentrated on \"the difficulties of coming out as an atheist whether it’s due to skin color, geography, or just plain fear.\" CBS gave us a much more accurate portrayal than what CNN gave us a few weeks ago.\n\nHemant's breakdown (from whom I took my post's headline): http://www.patheos.com/blogs/friendlyatheist/2015/04/19/cbs-sunday-morning-airs-terrific-segment-on-atheism-in-america/\n\nDirect link to video (10 minutes in duration): https://www.youtube.com/watch?v=IQsdmwCFUL4",
        "created_utc": 1429474623,
        "upvote_ratio": ""
    },
    {
        "title": "CBS \"Sunday Morning\" airs terrific segment on atheism in America and on \"on \"the difficulties of coming out as an atheist whether it's due to skin color, geography, or just plain fear\"",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/335ptb/cbs_sunday_morning_airs_terrific_segment_on/",
        "text": "The segment concentrated on \"the difficulties of coming out as an atheist whether it’s due to skin color, geography, or just plain fear.\" CBS gave us a much more accurate portrayal than what CNN gave us a few weeks ago.\n\nHemant's breakdown (from whom I took my post's headline): http://www.patheos.com/blogs/friendlyatheist/2015/04/19/cbs-sunday-morning-airs-terrific-segment-on-atheism-in-america/\n\nDirect link to video: https://www.youtube.com/watch?v=IQsdmwCFUL4",
        "created_utc": 1429474603,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists: In godlessness we trust (CBS)",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33530w/atheists_in_godlessness_we_trust_cbs/",
        "text": "",
        "created_utc": 1429463114,
        "upvote_ratio": ""
    },
    {
        "title": "How can anyone be an atheist if it is impossible to prove a negative. Essentially aren't all atheists taking their beliefs on faith?",
        "author": "slam7211",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/334s2w/how_can_anyone_be_an_atheist_if_it_is_impossible/",
        "text": "",
        "created_utc": 1429457175,
        "upvote_ratio": ""
    },
    {
        "title": "God as the human super-organism",
        "author": "BurninatorJT",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/33437o/god_as_the_human_superorganism/",
        "text": "I like thinking about plausible concepts of Gods that fit with my understanding of nature, and I've been thinking about the nature of our own consciousness lately. If our brains are simply a complex network of individual cells communicating with each other where our 'minds' are an emergent property of neural activity, is it possible that a type of consciousness emerges from individual communicating organisms? Perhaps every group, every tribe, every species has an emergent mind that exists for the self-interest of the group as a whole rather than for each individual.\n\nIf you look at a colony of ants, for example, they appear to behave with a common goal that doesn't favour an individual ant. They evolved communication through pheromones to survive better as a group than by themselves. You could argue that a sort of mind exists, an ant-God, where each ant acts as a neuron in the colony-brain.\n\nPerhaps every group of communicating humans has a collective God that emerges to further the goals of the group. These Gods are clearly only as powerful as the collective actions of the members of the group, and their goals are the same as the evolved goal of individual members: to survive. I would say the more advanced the level of communication, and complicated the network, the more advanced an emergent mind will be.\n\nThe history of man-made Gods seem to be an evolutionary story, where tribes of people who share a language develop a God in their competition against another tribe. A tribe or city-state that were more unified through a single God-concept tended to survive better, hence the Yahweh steamrolling effect of the past couple millennia.\n\nArtists talk about a muse, anthropologists talk about how ideas tend to emerge in clusters, where individuals with shared history and experiences come up with similar ideas even if they don't communicate with each other directly. I would argue that communication is the key here. It doesn't matter if it's between chemicals, cells, or animals: the collective triumphs in the universal quest for energy. Perhaps the singularity is our next stage of evolution, where the human super organism God thing becomes clearer and more powerful.\n\nObviously I realize that it's hard to argue something is truly there, but I guess you could say the same for our own consciousness. Just a thought... maybe I'm digging too much. Maybe that mushroom trip where I felt the presence of the Monkey God has got to my head! Hah! Anyone have any similar ideas?",
        "created_utc": 1429436393,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on an argument for God's existence.",
        "author": "Severianscloak",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/332trq/thoughts_on_an_argument_for_gods_existence/",
        "text": "I have been in a months long discussion with a theist friend.  He recently brought up an argument that I find interesting.  It feels wrong to me, but I can not pinpoint what feels wrong.  Any thoughts you have would be helpful.\n\nPremise 1: If there is a God, let God be defined as that upon which all beings depend for their being.\nPremise 2: All beings depend for their being upon Being itself.\nConclusion A: Therefore God is Being itself.\nPremise 3: Being itself is.\nConclusion B: Therefore God is.\n\nAs I said, the same argument can be made using synonyms for being such as reality or existence.\n\nAll other so-called arguments for the existence of God are actually arguments for certain qualities of God.",
        "created_utc": 1429401635,
        "upvote_ratio": ""
    },
    {
        "title": "As a thought experiment,are there any flaws with atheism?",
        "author": "Brand_New_Man",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/332o8r/as_a_thought_experimentare_there_any_flaws_with/",
        "text": "While some religions have flaws directly ingrained in text, such as claims of the earths age that have been proven to be incorrect. Surely a viewpoint on such a controversial matter can be left without some kind of flaw or flaws, please share your thoughts.",
        "created_utc": 1429398369,
        "upvote_ratio": ""
    },
    {
        "title": "Does what goes around comes back around?",
        "author": "wazzym",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/330qgp/does_what_goes_around_comes_back_around/",
        "text": "",
        "created_utc": 1429355700,
        "upvote_ratio": ""
    },
    {
        "title": "What Matters Most in Life?",
        "author": "wazzym",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/330li7/what_matters_most_in_life/",
        "text": "",
        "created_utc": 1429350145,
        "upvote_ratio": ""
    },
    {
        "title": "Been a few months... looking for advice with \"the fall\", please.",
        "author": "tallguybarista",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32zxrb/been_a_few_months_looking_for_advice_with_the/",
        "text": "So, it's been a few months since I've revealed my disbelief to my family. Things are going better than I expected, but still, it can get a little stressful.\n\nAnyways, I wanted to ask you guys about dealing with what my philosophy professor calls \"the fall.\" I feel really lost. Everything I thought I know has more or less been tossed out the window. It's not that my knowledge has changed, but finally embracing disbelief has made me realize that the majority of my political views and many of my personality characteristics that were rooted in Christianity are now baseless. Obviously, I don't want to panic. I know I need to take it slow and rethink issues. However, I still feel rather pathetic. Here I am, 20 years old, and suddenly I know absolute shit about my own political and social issue stances. Better late than never, right?\n\nHow do (did) you guys deal with this breakdown, so to speak? I feel lost. I don't really know what I think, and I hate that feeling. ",
        "created_utc": 1429329025,
        "upvote_ratio": ""
    },
    {
        "title": "The world's tragedies are our responsibility.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32wmna/the_worlds_tragedies_are_our_responsibility/",
        "text": "",
        "created_utc": 1429262494,
        "upvote_ratio": ""
    },
    {
        "title": "Does reddit annoy you with it's anti atheism?",
        "author": "Bwhitty23",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32w7xs/does_reddit_annoy_you_with_its_anti_atheism/",
        "text": "I usually don't care because I know it's just a circlejerk with no basis in reality. I browse /r/antiatheismwatch from time to time and I would say 90%+ is either from a harmless joke or unprovoked. I wasn't here for when reddit was a place for atheist to talk openly instead of being sectioned off to a few subs. Reddit now has obviously taken on general public and with that comes a lot more religious people. I have no problem with this blut when they get all pissy because you don't value their religion then we're the bad guy for not being nice. Ugh, the \"I'm an atheist but. . .\" people are just as annoying with the whole keep it on /r/atheism bullshit.\n\nEdit: to make it clear I just want to know if people are annoyed with reddit/general population that wants to rag on atheist but get mad when you bring up the most mild of religious criticism.\n\nEdit 2: don't take this as if I want atheism to be exempt from challenges. I just want to know if you are annoyed by the anti atheism a person could see on reddit or general public.",
        "created_utc": 1429249536,
        "upvote_ratio": ""
    },
    {
        "title": "Islamic Extremism and Islamophobia",
        "author": "Gnometard",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32vppz/islamic_extremism_and_islamophobia/",
        "text": "I am an anti-theist. I really don't like any religion and I feel they do, and have done, far more bad than good for the world (at least for the last few hundred years or so) \n\nHowever, I'm noticing a trend among my local atheists and many more around the US with being afraid to criticize Islam. I don't see much of any other religious extremists killing people. I see plenty of christians saying some really stupid things, but typically they seem to be all bark and no bite. \n\n\nWhy is it that every time I discuss the horrors of radical Islam,  I am immediately bombarded with comments and replies about how christians do bad things and that everything is islamophobic?\n\nWhere am I missing the equal terror and death caused by other religions?\n\nWhat is happening with all of these Islam apologists? \n\nIt seems to me a lot of it is due to being bombarded with bigoted messages from the Far-Right in the US causing plenty to be afraid to be in that category. What are your thoughts reddit? ",
        "created_utc": 1429238290,
        "upvote_ratio": ""
    },
    {
        "title": "Outspoken or \"evangelical\" atheists, what motivates you?",
        "author": "dewarr",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32vllz/outspoken_or_evangelical_atheists_what_motivates/",
        "text": "Non-atheist friend was wondering this. I am fairly private about my beliefs and as such feel any attempted explanation would be hampered by this fact. Plus, I thought it might serve as an interesting topic of discussion.",
        "created_utc": 1429236157,
        "upvote_ratio": ""
    },
    {
        "title": "Is atheism an academic pursuit?",
        "author": "No_Nrg",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32uf2u/is_atheism_an_academic_pursuit/",
        "text": "In a recent post the question was asked, \"Are you an academic? Or do you just want to argue with random religious people?\" The rwas, \"Not an academic. I want to continue to learn and develop my own ability to express myself.\" I don't believe being an academic strictly means that you are in academia, but instead it reflects your approach to gaining understanding.\n\n&amp;nbsp;\n\nI find this to be a dichotomy. I would like to posit that it be called the Passionate/Academic Dichotomy. But that makes it seem like you can't be passionate about what you are academically involved in. Feel free to make suggestions regarding the name of this dichotomy. Moving on.\n\n&amp;nbsp;\n\nIn my opinion atheism should be first about reason, logic, and conclude with by establishing your ethical understanding of **EVERYTHING**. Passion may or may not have a place in atheism, but it surely must follow the academic pursuit of understanding the philosophy you are claiming you are using for moral and ethical decision making and judgment. \n\n&amp;nbsp;\n\nI use the word passion because it is the only thing I can conceive of at the moment that would make one interested in an idea while not being academically in pursuit of furthering their understanding of that idea. \n\n&amp;nbsp;\n\nThe thing is that passion is exactly what guides theists. At no point, no matter how studied they become, will they be guided by logic first and passion second. It simply is not possible for a theist to be logical first and passionate second. It is possible with science because we understand that science is based on empiricism, it is normative, and it is value neutral. \n\n&amp;nbsp;\n\nBasically theism and atheism closely fall into the Art v. Science dichotomy, where science is guided by, as I said previously, empiricism, normative assumptions, and it is value neutral, while art is subjective, time-driven, and contextual. In the same sense agnostics may be considered an amalgamation of the two, relieving the participant of feeling as if they have fallen into one-dimensional thinking.  \n\n&amp;nbsp;\n\nSo, my point is that atheism should be looked at from a philosophical point of view, as it were to be a school of thought, a study of the understanding of what we know and free of being constrained by values and passion. Values should arise from ethics that arise from logical and academic pursuits of atheist understandings.  \n\n&amp;nbsp;\n\nWe only call it atheism because there is theism. Without theism we would just call it science and philosophy. And we come to this understanding because we are academically in pursuit of this understanding. \n\n&amp;nbsp;\n\nPlease comment with any criticisms or ideas that you may have. ",
        "created_utc": 1429215224,
        "upvote_ratio": ""
    },
    {
        "title": "We are the Secular Student Alliance and it is Ask an Atheist Day! Ask Us Anything! (cross-post)",
        "author": "spaceghoti",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32u4lm/we_are_the_secular_student_alliance_and_it_is_ask/",
        "text": "http://www.reddit.com/r/atheism/comments/32txbe/we_are_the_secular_student_alliance_and_it_is_ask/\n\nSince participation is invited, I am not making this an np link.",
        "created_utc": 1429210614,
        "upvote_ratio": ""
    },
    {
        "title": "There is an AMA with the SSA in /r/atheism if you're interested.",
        "author": "jij",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32tzpu/there_is_an_ama_with_the_ssa_in_ratheism_if_youre/",
        "text": "",
        "created_utc": 1429208556,
        "upvote_ratio": ""
    },
    {
        "title": "Apparently it's National Ask-an-Atheist Day... and since I had several requests: I am an atheist Biblical scholar, AMA.",
        "author": "koine_lingua",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32tr7r/apparently_its_national_askanatheist_day_and/",
        "text": "Hey there! Apparently National Ask-an-Atheist Day exists. Don't know too much about what usually goes on in that regard, but... on Reddit, I created /r/AcademicBiblical and am a frequent contributor to /r/AskHistorians, and I get PMs pretty much daily asking about various aspects of early Judaism and Christianity (asking for book/article recommendations, my opinion on a specific issue, etc.); so I figured this could be a nice place to consolidate this. :D\n\nI'm currently working on revising a few different articles that have been accepted to major academic journals; but my bigger project right now is that I've been writing a complete from-scratch sort of New Skeptic's Annotated Bible. I'm producing my own translation for this, and all the commentary is being based on the best academic research. (You can find out a bit more about it [here](http://www.reddit.com/r/TrueAtheism/comments/2n0pso/ive_begun_writing_a_new_vastlyimproved_skeptics/).)\n\nIn terms of questions I can answer: I'm familiar with most issues involving early Judaism and Christianity, though my main focus is on the New Testament and its world. So fire away!",
        "created_utc": 1429204951,
        "upvote_ratio": ""
    },
    {
        "title": "Have a good chance to ask Frank Turek a question tonight",
        "author": "jlawrence124",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32t2o4/have_a_good_chance_to_ask_frank_turek_a_question/",
        "text": "Hey guys, I have a pretty good chance to ask Frank Turek a question tonight at a debate that is happening at my university.  I wanted to run this question by you and see if this is a good thing to say.\n\n\"If human beings are fallible and God can reveal his word directly to human beings much like he did to the authors of the bible, how do you know that revelations to those fallible human beings about God’s character or revelations to yourself are true and accurate?\"\n\n**UPDATE:** So, I ended up going with my question (I know I suck I'm sorry) because my phone was dead as fuck and I couldn't pull up Reddit.  However, I do have a video of my question above and man did he sidestep the shit out of it, to the point where I didn't even understand what he was saying (which in my opinion was good for the crowd to hear).  Didn't get all of his answer but they have an HD video of the debate the apologetics group will likely upload soon.  A friend of me sent a video of my question [here](https://vid.me/GZlW) (disclaimer: I do not endorse vertical video). \n\nAlso, Shermer really didn't do that great in this debate.  About 90% of the audience was on Turek's side because the apologetics group did absolutely no promotion on campus about the debate so it was stacked with churchgoers. At one point Shermer actually started pretty much shouting at the crowd about gay marriage saying that \"YOU'LL BE ON MY SIDE IN 5 YEARS, YOU'RE WRONG.\"  That went about as well as you'd expect. \n\nAnyway **tl;dr** \nShermer didn't do great, audience was nearly all Christian, question actually went well. \n\n ",
        "created_utc": 1429193970,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists who had to be a juror in court, how did you get out of swearing on a bible?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32rgwf/atheists_who_had_to_be_a_juror_in_court_how_did/",
        "text": "",
        "created_utc": 1429153093,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting history of the Victorian era sexual ideals that brought us circumcision",
        "author": "hellosexynerds",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32r953/interesting_history_of_the_victorian_era_sexual/",
        "text": "",
        "created_utc": 1429149180,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting history of the Victorian era sexual ideals that brought us circumcision",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32r7um/interesting_history_of_the_victorian_era_sexual/",
        "text": "",
        "created_utc": 1429148554,
        "upvote_ratio": ""
    },
    {
        "title": "Searching",
        "author": "aroundthewatercooler",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32r3fe/searching/",
        "text": "I really have found Bart Erhmans books fascinating. Can anyone recommend similar authors? I love the historical aspect of Christianity. It turns my world upside down from what I had always been taught (the bible is absolutely perfect). Now I have info to back up it isn't. Any other suggestions on this same concept.",
        "created_utc": 1429146349,
        "upvote_ratio": ""
    },
    {
        "title": "Searching",
        "author": "aroundthewatercooler",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32r1j0/searching/",
        "text": "",
        "created_utc": 1429145398,
        "upvote_ratio": ""
    },
    {
        "title": "Testing claims of religious certainty",
        "author": "sirloinreddit",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32qrld/testing_claims_of_religious_certainty/",
        "text": "(Posted in debateanatheist and someone suggested I post here)\n\nWhat are the flaws in this thought experiment?\nI participate in a forum for discussing religious beliefs (because it's funny) and have noticed that many in the forum profess certainty that their beliefs are true. I've always been intrigued by people who claim certainty regarding religious beliefs because 1) I don't think it is possible to be certain about religious beliefs, and 2) I don't understand why so many religious people appear to feel a need to profess certainty. In an effort to test whether the people in the forum claiming certainty about the truthfulness of a religious belief were actually certain, I proposed the following thought experiment (largely influenced by an example in a Bayesian Statistics textbook):\nScenario 1: In a bag you put ten red marbles, and only ten red marbles. You shake the bag and draw a marble at random from the bag. If you draw a red marble, you will receive $10,000. If you draw a green marble, your mother will die.\nScenario 2: In a bag is contained the answer to whether [religious belief] is true. You pull the answer out of the bag, if the answer is that [religious belief] is true, you will receive $10,000. If the answer is that [religious belief] is false, your mother will die.\nWhich scenario do you prefer?\nMy thought is that if a person is truly certain that a particular religious belief is true, then they must be indifferent between the two scenarios. This must be the case since a person who is truly certain subjectively assigns probabilities to scenario 2 that mirror the objectively determined probabilities of the first scenario [Expected Outcome = 1.0(outcome if marble is red) + 0.0(outcome if marble is green) = 1.0($10,000) + 0.0(death of mother) = 10,000 = 1.0($10,000) + 0.0(death of mother)= 1.0(religious belief is true) + 0.0(religious belief is false)].\nObviously this would be a poor test for gauging anything but certainty, as it would likely be impossible for a person to distinguish between complete ignorance (probability of .5) and near certainty (probability of .99) based on this test alone, since both a .01 and .5 probability assigned to the death of a loved one would likely produce a negative value greater than both a $9,900 and a $5,000 payoff. However, in the case of true certainty the negative outcome would be ignored, in fact, any number of horrible outcomes could be substituted and they should still be ignored if a person truly feels certain. This is why the outcomes are so lopsided--because it shouldn't matter and it would only matter to a person who is less than certain.\nClearly only the person participating can answer for themselves whether they are indifferent and no one can tell them how they are feeling. Upon proposing this thought experiment I received quite a bit of pushback from the \"stalwarts,\" claiming that the test is flawed, nonsense, and useless. I don't doubt that there may be flaws, but I'm struggling to see them in light of the stated purpose.\nWhat are the flaws in this thought experiment? Would you mind explaining them to me? Much appreciated!",
        "created_utc": 1429140426,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone have a preferred place to debate/discuss religion with theists?",
        "author": "paleolithic_rampage",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32peuu/does_anyone_have_a_preferred_place_to/",
        "text": "I've been on reddit for about 3 years now, and it seems like all of the decent debate/discussion subs have largely been taken over by atheists. The religion specific subs seem to be largely for that specific religion, and not really meant for people outside of that religion to debate. Both /r/debateanatheist, /r/debatereligion, and /r/debateachristian are dominated by atheists and the discussion is substantially less interesting than it used to be.\n\nSo, anyone here have any recommendations for places on the internet with a decent complement of theists that like to have conversations?",
        "created_utc": 1429118597,
        "upvote_ratio": ""
    },
    {
        "title": "Catholics vs. Religious Right of America - What's your opinion",
        "author": "mostcreativesceennam",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32p9qq/catholics_vs_religious_right_of_america_whats/",
        "text": "Hello everyone, a brand new redditor here. My question to you is what is your view of Catholics versus fundamentalist Christians in the United States. I'm Catholic, and reading Trueatheism has made me realize that most theological topics brought up in this subreddit relate to issues of the fundamentalist type. I was just interested in what you guys feel the difference of your views are towards Christians in general, Catholics, and the American phenomenon of the religious right.\n\nI just want to satisfy my curiosity, as many debates just seem to be atheist vs. fundamentalists Christians. I want to see what you redditors say on the topic.\n\n(Hope that I get my question across. If not, I'll try to clarify in more detail to specific parts as necessary.)\n\n**Edit** Thanks for the replies. Just wanted to see what your general opinions were. I appreciate the well stated points from your perspectives.",
        "created_utc": 1429116298,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism and skepticism",
        "author": "Fujum8",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32o99s/atheism_and_skepticism/",
        "text": "Does anyone else here think that atheism is a position arrived at through skepticism? I see myself as an atheist because i lack the belief in God. I lack that belief because sufficient evidence has not been brought forth to prove the things theists believe. \n\nI have never though that the problem between thesim and atheism is the stance on knowledge as much as reasonable belief. I think theists believe without evidence, and atheist don't believe because there is none. And agnostics annoy us all because they feel very special even though one definition of agnostic is a cop out and the other fits right in with atheism. ",
        "created_utc": 1429097214,
        "upvote_ratio": ""
    },
    {
        "title": "Dealing with being a closeted Muslim Athiest",
        "author": "fatzyp",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32lrwh/dealing_with_being_a_closeted_muslim_athiest/",
        "text": "So I have been born and brought up in a conservative Muslim family. I started to question the religion of Islam since I was 17-18. My non-belief was not as extreme as it is now though. I am now 24 and a full blown atheist.\n\nOnly two people in my life know about this, both of whom are atheists. They have been supportive to a degree. But the fact is, I feel like I am living a lie when I pretend to believe in Islam just to please my friends and family. And I know I will lose them if I had to come out. That is not something I am willing to do.\n\nIn the meanwhile, my emotional state is far from sound due to the fact that I am internalizing it. Sure, I have my atheist friends - but they are openly atheist and not ex-Muslim atheists, so they wouldn't truly understand. I feel like I need someone who is in my situation or managed to get out of it, so I have an idea how to deal with my situation and the emotions that come with it.\n\nThere is a person who I think can help. My university supervisor is a \"Muslim\". Overtly, she does not dress conservatively at all, nor does she seem like the type that prays. If you looked at her, you would never tell she's Muslim. I heard from others that she has faced a lot of rejection for her liberal manners. However, I do not know if she simply rejects the cultural aspects of Islam and still believes in it, or outright rejects it.\n\nShe is a very closed off, tough person and keeps relationships purely professional. I do not want to ask about her religious views as it would definitely be inappropriate given the fact that she is closed off. However, she seems like the perfect person to speak to regarding how to deal with rejecting aspects of Islam, especially with regards to how her family and friends viewed it.\n\nShould I reach out to her slowly and if so, how, given her closed off persona? Or do you think that would be inappropriate? \n\nIt is very hard to find ex-Muslim atheists and if there are any, some are probably closeted like me. Should I try reaching out to my supervisor? I am clutching at straws here and my mental state is in shambles at times due to this internal conflict. Any advise would be appreciated.",
        "created_utc": 1429043333,
        "upvote_ratio": ""
    },
    {
        "title": "Prep for National Ask An Atheist Day Thursday.",
        "author": "ChrisBabyYea",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32lkad/prep_for_national_ask_an_atheist_day_thursday/",
        "text": "Hey guys, \n\nI am manning an Ask An Atheist Day table at my school as a part of my SSA group. I was wondering if people could help me prep. If you have done this thing before, what was your experience like? What kinds of questions stumped you?",
        "created_utc": 1429040038,
        "upvote_ratio": ""
    },
    {
        "title": "How do the religious folk that berate and demean \"science\" reconcile the fact that society as we know it today would cease to exist without it?",
        "author": "archzinno",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32lb08/how_do_the_religious_folk_that_berate_and_demean/",
        "text": "",
        "created_utc": 1429036006,
        "upvote_ratio": ""
    },
    {
        "title": "Prejudice against christians in academia?",
        "author": "wren42",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32l6pp/prejudice_against_christians_in_academia/",
        "text": "Hi, looking for corroboration or evidence for or against this claim.   \n\nIn a recent conversation, a christian suggested that prejudice against christians in the US is real, and said they have friends in academia who are afraid to \"out\" themselves as christians for fear of not getting a job/tenure.\n\nNow, while I'd believe that there is a strong liberal, counter-religious culture in Academia, my intuition is to doubt this claim. \n\nFor one, I've seen figures that as many as half of academics are religious themselves.  So while they may not speak openly about it, the idea that Christians are \"oppressed\" in academia seems unlikely.\n\nFor another, if it were true that tenure or employment were being denied on the basis of religion, it would be SUPER ILLEGAL.  Like federal law suit, major media scandal level illegal. \n\nI did find one case of a lawsuit, documented by NPR back in 2010.  A conservative guy started a political blog, and was later denied tenure.  He sued, claiming they denied him because of religious beliefs expressed in his articles.  The judge ruled against him. \n\nKind of weak support for the idea that Christianity is grounds for losing your job in academia. \n\nAre there other cases that would substantiate or refute this claim?  Looking for solid evidence where possible. \n\nThanks!\n\nEDIT:  Thanks everyone for the responses!  This thread was very revealing.  \n\nI must say, I'm surprised that the main thing I learned is how ready even /r/trueatheism is to jump to conclusions and conjecture that aligns with preconceived notions and bias.  Despite my request for evidence, the vast majority of responses seemed to simply be in the vein of \"christians have a persecution complex so this can't possibly be true\".   This is an interesting attitude from a community that prides itself in skepticism and evidence based reasoning. \n\nI did get some excellent replies from people actually in the sciences, though, and some links to good resources, so thank you to them for sharing!\n\nThanks to everyone for contributing!",
        "created_utc": 1429034164,
        "upvote_ratio": ""
    },
    {
        "title": "Does Isaiah 53 prove Judaism? (not a troll)",
        "author": "wheeloficeandfire",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32l1n5/does_isaiah_53_prove_judaism_not_a_troll/",
        "text": "I've been wondering about Isaiah 53 for a while. (I used to be an Orthodox Jew). Yes, I know loads of Christians seem to think it refers to Jesus (an idea as old as Luke-Acts) but what if it refers to the Jewish nation as a whole? We all know that the Jewish people have been persecuted and 'tortured' everywhere they settled, and were frequently regarded as 'criminals' (\"and he was numbered with the transgressors\"), but now they have their own state and their position in the world is improving on the whole (the end of the chapter, where Yahweh promises the sufferer long life and riches)\n",
        "created_utc": 1429032087,
        "upvote_ratio": ""
    },
    {
        "title": "Christening - Thoughts....",
        "author": "Tomble2000",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32jiyh/christening_thoughts/",
        "text": "(I should start this by saying I am in the UK and it's not as bad as many people in the US I read around here.)\n\nSo I am an atheist and hate having to go to christenings/baptisms whatever you want to call them for kids.\n\nWhat I also hate is when the parents ask me to be a god parent or witness to their kid. \n\nThe first time was for one of my best friends, they know I am an atheist and to them it was more a symbolic gesture of being a strong figure in their daughters life. They know I will not promote the religion, but I will look out for the little girl whenever she needs me. \n\nNow the problem comes we have been asked again but a relatively new set of friends for the same thing. We met them during NCT classes and would look out for their kids as our own. They are good friends and we all get on. Again they know (probably not as strongly as my best friend) that I don't like religion but are asking for the same reason. Someone to be a strong figure and look out for their new daughter (our other kids are 2 so we went to the other christening but were not as close as now). \n\nMy thing is I did it for my best friend because he is my best friend. I don't really want to do it as I feel it quite hypocritical but also don't want to be an arse about it. \n\nThe easy thing (being they know I am an atheist and that's not why they are asking me) is to suck it up, just do it and then carry on after. The child in me is stamping it's feet and saying, \"can't make me!\"\n\nJust wanted some thoughts before I make a decision. \n\n(My wife is doing it! She is not really an atheist but she is not religious either, she does not care. I guess she would be classed more as agnostic) ",
        "created_utc": 1428999645,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist VS Deist Help",
        "author": "ljn9",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32if2i/atheist_vs_deist_help/",
        "text": "So I am enjoying the debates with my deist friend who believes in a cosmic force imperceptible to humans. My problem when confronting him with why does he choose to believe in something that is not supported by any evidence, and discounts all the evidence that exists for another view, he retorts with \"well in the past humans believed that the earth was flat until new evidence came and they realized that they were wrong. What makes you so sure that in the future we will not discover some new evidence that will disprove our current beliefs?\" My rhetorical prowess is not admirable, and I really cannot respond well to this given how blatantly obtuse this argument is. Any help on demolishing this monstrosity? I am sure its coming when I jumpstart this debate again, (I've heard it at least three times) and this time I wanna come out guns blazing..  ",
        "created_utc": 1428974283,
        "upvote_ratio": ""
    },
    {
        "title": "This article is being referred to in Danish media. It makes claims about connections between improved health and religiosity. What do you think?",
        "author": "monte_carlo_method",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32f5ol/this_article_is_being_referred_to_in_danish_media/",
        "text": "Link to publication:\n\nhttp://www.researchgate.net/publication/259004017_Spiritually_and_Religiously_Integrated_Group_Psychotherapy_A_Systematic_Literature_Review\n\nIn the introduction they cite a some study [4], that makes some interesting claims. Maybe that's worth looking into. It's available here \n \n\nhttp://ije.oxfordjournals.org/content/early/2011/06/14/ije.dyr089.full.pdf+html \n\nI'm sure this subject has been debated before, but I haven't personally looked into it. Maybe someone can enlighten me? \n\nEdit: My first thought would be that if you correct for discrepancies in social/educational background of danish religious people vs the total danish population, you would find that a religious person is exactly as healthy as any other person in the population. Maybe I'm wrong?  \n\n",
        "created_utc": 1428912180,
        "upvote_ratio": ""
    },
    {
        "title": "Is suicide really that wrong?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32euu6/is_suicide_really_that_wrong/",
        "text": "",
        "created_utc": 1428903186,
        "upvote_ratio": ""
    },
    {
        "title": "TIL: Atheism is shirking as a percentage of global population.",
        "author": "mbevks",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32dfqr/til_atheism_is_shirking_as_a_percentage_of_global/",
        "text": "A [new survey](http://www.telegraph.co.uk/news/worldnews/11518702/Mapped-What-the-worlds-religious-landscape-will-look-like-in-2050.html) projecting changes in religious affiliation show that atheism is shrinking as a percentage of the global population and is projected to continue to shrink, mostly due to the fact that atheist populations have fewer children.",
        "created_utc": 1428874733,
        "upvote_ratio": ""
    },
    {
        "title": "I don't really know or where how to start.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32ciyj/i_dont_really_know_or_where_how_to_start/",
        "text": "Excuse me if I make any mistakes, this is my first time posting and my english isn't really the best.\n\nSo, here's a bit of backstory. I'm a 17 year old female in my last year of high school. I am an athiest and have been for 3 years now and have been going to this school since last year. My mother is non-religious and my father is a Hindu, but they accept my choices and freely discuss my non-beliefs with me. They raised me incredibly well and I couldn't be more grateful. I go to a Christian school and most of my friends are Christians who accept my non-belief. I enjoy myself most of the time in school.\n\nAlthough I am happy that most of my friends and family accept me for who I am, I CANNOT stand the fact that most of the teachers are forcing their religion down our throats. (a few of my teachers are fine, though.)\n\nI understand that it is a Christian school but I chose to enroll because the fees were much cheaper than other schools offering the syllabus, which is IGCSE and I'm sure many others have done the same too.\n\nMy friend, Spencer, had to drop out because they were  almost literally shoving the bible in his face. He is also an atheist, and he is openly gay. They pretty much forced him to believe in Jesus and tried to pray his gay away. When he didn't accept their religion, they ostracized him,  and his peers made up terrible stories about his personal life and he just couldn't take it anymore. He is doing MUCH better now and is self studying for his exams, although he still resents the school VERY much.\n\nI am sick of wasting valuable time that could be used for studying for devotion every single morning. I understand that most of the students are Christians, but there are multiple students who come from different religious backgrounds, and a handful of atheists as well. I feel like they should give those who don't want to listen to the preaching everyday a choice to sit out or go to class earlier and study or finish their homework. They even force every student to bow their head, close their eyes and pray after devotion, no exceptions. \n\nThey also have a 45 minute compulsory \"youth church\" session every Friday before school ends at 3.05 p.m. I, and quite a few others are wasting our time sitting down in the hall, listening to what we don't want to hear with no choice of sitting it out. We are expected to bring bibles to school everyday and sometimes, we are punished for not bringing them.\n\nI'm just so confused about what to do. I only have a few months left of high school but I feel like I'm going to snap at any point. I can't stand their contradictory preaching, the fact that they believe that only those who follow Jesus are good people and those who don't are lost or bad.\n\nI would really appreciate advice on how to survive these last few months. Thank you so much for reading this. \n\nedit: aaand crap. messed up the title. I meant \"how or where to start\".\n\nedit*: thank you so much for each and every single bit of your advice, guys. i'll take the advice to heart and try to shut out any anger or hatred in me for the next 7 months. i really appreciate all the help.  \n\nalso, I went to this school because it is one of the cheapest schools that offers igcse compared to others which cost around 4-5x more lol.",
        "created_utc": 1428858593,
        "upvote_ratio": ""
    },
    {
        "title": "Christian girl I'm into might be causing me to doubt my beliefs",
        "author": "Ilovepotatoes32",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32c7ji/christian_girl_im_into_might_be_causing_me_to/",
        "text": "I'll give a little context. For the majority of my childhood I was an evangelical Christian. My parents were very religious and so I was very religious. They sent me to a christian school. I played bass in the church worship band. I thought evolution and science were myths. That was until my junior year of high school when doubts started forming. I took a class on apologetics to get rid of these doubts but the class just made me doubt more which led me to becoming the atheist I am today. \n\nI am now a senior and I've developed feelings for this girl but she is very religious. She has said in the past that any guy that she dates \"has to love Jesus\". We're good friends and she knows I'm an atheist but I'm still going to ask her out. I know her well enough to say that she wouldn't flat out say no. She would at least give me a chance just to see how it goes. She has invited me to church and lately I've been having thoughts that this would all be easier if I was a Christian. The only problem is I just can't deny the scientific facts and the inconsistencies in the bible. Obviously I'm having these thoughts for the wrong reason. The only reason I'm interested in Christianity is because of her. What should I do?\n\nEDIT: OK guys I recognize that I'm not actually interested in Christianity, I'm interested in her. I just needed some assurance of that. I could still use some advice about my situation though so keep it coming! ",
        "created_utc": 1428852439,
        "upvote_ratio": ""
    },
    {
        "title": "Does blind belief in religion help people push their limits? Does our skepticism come in the way of inspiration?",
        "author": "adheeshlp",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32c4vi/does_blind_belief_in_religion_help_people_push/",
        "text": "Fellow atheist here. First post on Reddit. \n\nI have seen many athletes thank God after victory. This belief in a personal God seems to inspire them. \n\nI was watching this documentary about racing legend Ayrton Senna , the other day. He was a staunch and eloquent christian and one of the fastest drivers in his time, who went so far as to say that once he had a vision of God at the finish line. \n\nAlso this photo of the burning Buddhist monk in Vietnam is a constant fascination for me. - http://upload.wikimedia.org/wikipedia/en/3/38/Th%C3%ADch_Qu%E1%BA%A3ng_%C4%90%E1%BB%A9c_self-immolation.jpg\n\nAre atheists capable of getting such motivation out of something? Or does being a skeptic stop us from such blind belief and similar motivation?",
        "created_utc": 1428850908,
        "upvote_ratio": ""
    },
    {
        "title": "The head-body transplant succeeded! What have you noticed people saying about it and what are your thoughts on it?",
        "author": "HairyFireman",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/32bsnh/the_headbody_transplant_succeeded_what_have_you/",
        "text": "",
        "created_utc": 1428842348,
        "upvote_ratio": ""
    },
    {
        "title": "[OC] Killing an Ant",
        "author": "TheAtheistPriest",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/328qz7/oc_killing_an_ant/",
        "text": "Killing an Ant\n\n“We are not special. We are not crap or trash either. We just are.\nWe just are, and what happens just happens.”\n- Chuck Palahniuk\n\n\nOne day while writing a paper for university, an ant happened to wander up into a glass ashtray that lay on my desk. The ant was stuck in the ashtray; its slick glass ridge made it virtually impossible for the ant to grip itself to the sides and crawl out. As I was looking at its relentless struggle to get out, it hit me that the ant was a living being that was in a struggle to survive. When the ant realized that it was stuck in the ashtray, it tried to escape in a very frantic manner. The ant must have tried its futile getaway over a hundred times, each time utilizing as much effort as the last. It was sad to witness the ant’s wretched situation; it was extra interesting to think that I could intervene and save it at any time. At that moment, I was God for the ant. I could have just as easily given the ant salvation or burnt it to a crisp with the tip of my cigarette. \n \nIs it wrong to kill an ant? Clearly, if you are killing an ant, there is no greater personal use for the ant’s remains… it is not food. Therefore, the excuse that you are killing an ant for your personal survival is not valid. An ant does not think and probably is not conscious of its own existence, yet it is a living being...  \n\nAs I looked at the ant’s struggle, I began to ask myself how important this ant’s life was. I mean, if I killed the ant on the spot, no one would care, no one would know, and honestly, it would probably escape my own memory within a matter of seconds.  Killing that ant would change absolutely nothing in the world. After all, it is just an ant, and there is no shortage of ants on Earth. The ant is a living being, yet its existence is absolutely irrelevant to the greater order of the world and the Universe. We step on ants without even realizing it and nothing changes because of it. When an ant is killed, nothing happens, no one cares, no one and nothing is affected. That ant is not going to Heaven or Hell. That ant will not be reborn. If you kill an ant, it is meaningless.\n\nTo the ant, the ashtray was a big structure. Therefore, to the ant, the entire planet is gigantic. An ant is so small and insignificant compared to the greater size of the Earth that the planet, to an ant, must seem infinite. Imagine the size of the entire globe and then the size of an ant: it becomes obvious that an ant cannot possibly affect the greater functioning of the planet. It simply is not big enough.\n\nHumans are ants in the Universe. We are ants on our own planet. There are billions of ants and there are billions of human beings on Earth. Just like an ant, a human being’s life is insignificant in regards to the greater Universe. Not only are human beings like tiny ants on Earth, the Earth itself is nothing more than a tiny ant, a grain of sand, in the greater universe. Our planet, which is humongous to us, is absolutely nothing in size to the cosmos.\n\nIn the past, people believed that there was nothing in life aside from the Earth; we now know that this belief is false. As a society, we now realize that because of our relative size to the greater universe, our planet, our world, is virtually insignificant. If the Earth explodes and kills all of humanity, the Universe will still exist as though nothing happened. In the past, people thought that the end of the world would be the destruction of Earth; we now know that this is wrong. The Universe continues without the planet, just like the Earth continues without one less measly little ant.\n\nHow important is my existence if the Earth’s destruction is insignificant and basically irrelevant to the Universe? Is that not what all religions want to confirm; that human beings are somehow important, if not central, to the Universe’s value? Most religions put stress on thought and action as being meaningful in the greater Universe (i.e. “God will judge me for my actions and beliefs, therefore I am important in the greater universe”). Obviously, this belief does not make sense.\n  \nJust like the ant in my ashtray, my life and death are insignificant to the greater universe. Just like the ant, I am of no consequence. Just like the ant, I am only out to survive here on Earth. Just like the ant, I am only one member of a billion-member race that lives on one of billions of planets that exist in the Universe. Many people have difficulty accepting this notion because it makes them feel as though life is meaningless or unimportant. However, whether you want to believe it or not, we have proof all around us that the ant’s life is just as significant as our own, it is only our perception of life, our brains and bodies, that are different. An ant lives on the same Earth as us and eats just as we do; they are simply smaller than us... why would their significance in the Universe be any different from our own? \n\nWhen I sat at my desk contemplating whether or not I should save the ant from its dilemma, I realized my life’s true value. When I die, nothing will change. Aside from my close associations, no one will be affected. Society will continue to operate, just like the planet, just like the Universe. We are all ants fighting to stay alive. We are lying to ourselves if we believe that somehow, for whatever reason, our lives are more meaningful or significant to the greater Universe than an ant’s. The ant is not special… the Earth is not special… you and I are not special.\n\nJust like the ant, if a human being dies, it is meaningless.\n\nSo did I kill the ant, you ask?  \n\nI honestly do not remember.",
        "created_utc": 1428769718,
        "upvote_ratio": ""
    },
    {
        "title": "Need help debating a friend",
        "author": "Chimneychong",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/328nbu/need_help_debating_a_friend/",
        "text": "Hey guys and gals first post to reddit so sorry in advance if I do something wrong.\n\nSo me and my friend were having a friendly little debate and we got to the subject of is God good. My friend is a hyper-Calvinist so he believes man has no free will and God controls everything even our choice to accept salvation. I told him that if God is the one choosing people's salvation for them he could easily choose to save everyone, and the fact that he doesn't makes him immoral. My friend responds with these exact words \n\n\"God is equally glorified in people's destructions and salvation. We cannot know or understand Gods will but we must accept it. Some people God creates specifically to burn in hell and yes some of these people are babies who only sins are too be born. But he is God and God can do what he pleases when he pleases with or without your permission and doesn't care if you think it's \"good\"\"\n\nAs you can imagine I was shocked and pretty much came back with \n\n\"if that's true then I have no interest in worshipping your God\" \n\nhe told me \n\n\"it takes a lot of studying and prayer\"\n\n at this point I'm so aggravated I just stop talking to him. Any advice or words to say to him would be helpful! Thanks in advance!\n\nEDIT: Thank you everyone for all the kind words and advice! Yes he is a very strong Calvinist if you were wondering. I had a follow up conversation with him which went something like this:\n\nMe: tells him history of bible (not written by who he thinks it is)\n\nHim: denies and claims we don't have enough evidence to prove it yet.\n\nMe: asks him what the purpose of prayer is\n\nHim: admits there is no purpose but we must do it because the bible told us too.\n\nMe: asks him why God is good\n\nHim: we are worthless worms to God, we all deserve to burn in hell for all eternity, etc... Jesus was Gods gift to us but he only gives this gift to the elect and not to everyone.\n\nMe: asks why God chose him but not me to save.\n\nHim: (after a long pause) he is praying that I will come around and he hopes God chose me\n\nMe: reminds him that praying is not going to change anything and that God will choose to save me or he won't and I don't have a choice in the matter.\n\nNo response\n\nSo all in all I think it went well! I hopefully made him question his beliefs a little more although he still denies all evidence I give him and claims science is the devil :(\n\nThanks again!",
        "created_utc": 1428767803,
        "upvote_ratio": ""
    },
    {
        "title": "christian vs atheist debate..",
        "author": "CVL080779",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/328j7k/christian_vs_atheist_debate/",
        "text": "Hello,\nJust want to ask if any of you guys have any good christian vs atheist debate on youtube, where both people are having conversation with each other.  I dislike the format where person X talks and then rebuttle's person Y and then person Y says, that is not true....or whatever.\n\nI just want a conversation and rebuttle each other real time.\n\nAny good vids out there?\n\nThank you",
        "created_utc": 1428765494,
        "upvote_ratio": ""
    },
    {
        "title": "[OC] Killing an Ant",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/328j40/oc_killing_an_ant/",
        "text": "Killing an Ant\n\n“We are not special. We are not crap or trash either. We just are.\nWe just are, and what happens just happens.”\n- Chuck Palahniuk\n\n\tOne day while writing a university assignment, an ant happened to wander up into a glass ashtray that lay on my desk. The ant was stuck in the ashtray; its slick glass ridge made it virtually impossible for the ant to grip itself to the sides and crawl out. As I was looking at its relentless struggle to get out, it hit me that the ant was a living being that was in a struggle to survive. When the ant realized that it was stuck in the ashtray, it tried to escape in a very frantic manner. The ant must have tried its futile getaway over a hundred times, each time utilizing as much effort as the last. It was sad to witness the ant’s wretched situation; it was extra interesting to think that I could intervene and save it at any time. At that moment, I was God for the ant. I could have just as easily given the ant salvation or burnt it to a crisp with the tip of my cigarette.  \n\tIs it wrong to kill an ant? Clearly, if you are killing an ant, there is no greater personal use for the ant’s remains… it is not food. Therefore, the excuse that you are killing an ant for your personal survival is not valid. An ant does not think and probably is not conscious of its own existence, yet it is a living being...  \n\tAs I looked at the ant’s struggle, I began to ask myself how important this ant’s life was. I mean, if I killed the ant on the spot, no one would care, no one would know, and honestly, it would probably escape my own memory within a matter of seconds.  Killing that ant would change absolutely nothing in the world. After all, it is just an ant, and there is no shortage of ants on Earth. The ant is a living being, yet its existence is absolutely irrelevant to the greater order of the world and the Universe. We step on ants without even realizing it and nothing changes because of it. When an ant is killed, nothing happens, no one cares, no one and nothing is affected. That ant is not going to Heaven or Hell. That ant will not be reborn. If you kill an ant, it is meaningless.  \n\tTo the ant, the ashtray was a big structure. Therefore, to the ant, the entire planet is gigantic. An ant is so small and insignificant compared to the greater size of the Earth that the planet, to an ant, must seem infinite. Imagine the size of the entire globe and then the size of an ant: it becomes obvious that an ant cannot possibly affect the greater functioning of the planet. It simply is not big enough. \n\tHumans are ants in the Universe. We are ants on our own planet. There are billions of ants and there are billions of human beings on Earth. Just like an ant, a human being’s life is insignificant in regards to the greater Universe. Not only are human beings like tiny ants on Earth, the Earth itself is nothing more than a tiny ant, a grain of sand, in the greater universe. Our planet, which is humongous to us, is absolutely nothing in size to the cosmos.\n\tIn the past, people believed that there was nothing in life aside from the Earth; we now know that this belief is false. As a society, we now realize that because of our relative size to the greater universe, our planet, our world, is virtually insignificant. If the Earth explodes and kills all of humanity, the Universe will still exist as though nothing happened. In the past, people thought that the end of the world would be the destruction of Earth; we now know that this is wrong. The Universe continues without the planet, just like the Earth continues without one less measly little ant.\n\tHow important is my existence if the Earth’s destruction is insignificant and basically irrelevant to the Universe? Is that not what all religions want to confirm; that human beings are somehow important, if not central, to the Universe’s value? Most religions put stress on thought and action as being meaningful in the greater Universe (i.e. “God will judge me for my actions and beliefs, therefore I am important in the greater universe”). Obviously, this belief does not make sense.  \n\tJust like the ant in my ashtray, my life and death are insignificant to the greater universe. Just like the ant, I am of no consequence. Just like the ant, I am only out to survive here on Earth. Just like the ant, I am only one member of a billion-member race that lives on one of billions of planets that exist in the Universe. Many people have difficulty accepting this notion because it makes them feel as though life is meaningless or unimportant. However, whether you want to believe it or not, we have proof all around us that the ant’s life is just as significant as our own, it is only our perception of life, our brains and bodies, that are different. An ant lives on the same Earth as us and eats just as we do; they are simply smaller than us... why would their significance in the Universe be any different from our own?  \n\tWhen I sat at my desk contemplating whether or not I should save the ant from its dilemma, I realized my life’s true value. When I die, nothing will change. Aside from my close associations, no one will be affected. Society will continue to operate, just like the planet, just like the Universe. We are all ants fighting to stay alive. We are lying to ourselves if we believe that somehow, for whatever reason, our lives are more meaningful or significant to the greater Universe than an ant’s. The ant is not special… the Earth is not special… you and I are not special.\n\nJust like the ant, if a human being dies, it is meaningless.\n\nSo did I kill the ant, you ask?  \n\nI honestly do not remember.\n",
        "created_utc": 1428765444,
        "upvote_ratio": ""
    },
    {
        "title": "Despite of poisonous doctrines found in both Christianity and Islam, why is it that we see Islam as most harmful religion today?",
        "author": "unexpected_endinb",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/327xjf/despite_of_poisonous_doctrines_found_in_both/",
        "text": "Christianity had a barbaric history filled with wars and gore. When Islam was a young religion it was relatively less harmful than Christianity. Is it just a phase that most religion go through or it has more to do with what it preaches?",
        "created_utc": 1428749834,
        "upvote_ratio": ""
    },
    {
        "title": "I think I was reasonable but I'm a little worried about sounding like a dick.",
        "author": "Cyc68",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/327rn2/i_think_i_was_reasonable_but_im_a_little_worried/",
        "text": "This happened in a Facebook post that my brother's very religious widow made. I have no wish to antagonise her but I felt I had to say something about the homophobia being spewed. We're not close and have never met since we live on different continents but since my equally religious brother has passed away I don't want to be insensitive. \n\nSo with that in mind do I just sound like a smug prick?\n\nhttp://i.imgur.com/YU3zKng.png",
        "created_utc": 1428743308,
        "upvote_ratio": ""
    },
    {
        "title": "How do literalists explain Eve being created twice?",
        "author": "OCogS",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3279ip/how_do_literalists_explain_eve_being_created_twice/",
        "text": "Hi team. I have the good fortune to come from a part of the world where there are very few people who believe the bible is literally true. I’m pretty familiar with Catholic apologetic arguments, but not those of more fundamental arms of Christianity.\n\nI’ve always wanted to know how the double creation of Eve is explained. Obviously most people never bother to read the book because it’s so long and confusing, but even the laziest reader must get up to Adam and Eve and see what seems to me to be an unavoidable contradction between the Adam’s rib story and the dust/clay story.\n\nDo you know what the ‘argument’ is?  \n",
        "created_utc": 1428727567,
        "upvote_ratio": ""
    },
    {
        "title": "Drug Cinquain",
        "author": "crackhacky",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/326ut5/drug_cinquain/",
        "text": "",
        "created_utc": 1428718331,
        "upvote_ratio": ""
    },
    {
        "title": "\"Free Money Venture\"",
        "author": "Husky_Mudkips",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/326gl1/free_money_venture/",
        "text": "",
        "created_utc": 1428710218,
        "upvote_ratio": ""
    },
    {
        "title": "Do you believe in absolute morality and why?",
        "author": "InarticulateAtheist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3268wy/do_you_believe_in_absolute_morality_and_why/",
        "text": "",
        "created_utc": 1428706104,
        "upvote_ratio": ""
    },
    {
        "title": "Fear of death",
        "author": "richifie",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3254fp/fear_of_death/",
        "text": "Is anyone else, as an atheist, terrified by dying? My entire existence is assured by my ability to perceive the world around me and the threat of having that taken away is mortifying. The thought of not thinking is unthinkable.\n\nWithout a belief system supporting life after death, I've fallen into a pit of not wanting to live for fear of stopping living.\n\nThis is something I've grappled with for the majority of my life, and I was just wandering how other people coped, because I obviously cannot.",
        "created_utc": 1428687440,
        "upvote_ratio": ""
    }
]