[
    {
        "title": "I just saw Gaspar Noé's 'Climax' and I'm speechless",
        "author": "yeahmadman",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9db74u/i_just_saw_gaspar_noés_climax_and_im_speechless/",
        "text": "[removed]",
        "created_utc": 1536182959,
        "upvote_ratio": ""
    },
    {
        "title": "Who are your favorite character actors?",
        "author": "BenMelman",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9da5vr/who_are_your_favorite_character_actors/",
        "text": "[removed]",
        "created_utc": 1536176688,
        "upvote_ratio": ""
    },
    {
        "title": "A true cinematic experience",
        "author": "morphdarko",
        "url": "https://youtu.be/nAdniWncWu4",
        "text": "",
        "created_utc": 1536171592,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think should be done with the Terminator franchise? I think I have a good idea for a story",
        "author": "CineRanter-YTchannel",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9d87p9/what_do_you_think_should_be_done_with_the/",
        "text": "[removed]",
        "created_utc": 1536164964,
        "upvote_ratio": ""
    },
    {
        "title": "From Renegades to the Cozmos and Beyond!",
        "author": "AtomicToken",
        "url": "https://atomicnetwork.tv/2018/07/05/from-renegades-to-the-cozmos-and-beyond/",
        "text": "",
        "created_utc": 1536162958,
        "upvote_ratio": ""
    },
    {
        "title": "Are YouTube video essays just reviews? Or maybe even just one-sided discussions?",
        "author": "Arch_Stant0n",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9d7dlq/are_youtube_video_essays_just_reviews_or_maybe/",
        "text": "First, I feel as though a good essay will be able to more narrowly dissect an element, theme, context, etc of a movie without really going into the actual quality of the film. On the other hand, I feel a review is a more broad opinion piece where the writer tries to gauge what the movie and director were trying to communicate to viewers, explain what worked and didn't work in that context, and then what the weight of the good and bad ultimately amounted to, in their opinion, whether it be some kind of score or final verdict\n\nAnyway today I stumbled on [this](https://www.youtube.com/watch?v=S-myJdkVKAk) video, which up-front forms a narrative using personally selected youtube comments about a previous video of his. And, of course, I had to see what the fuss was about. \n\nBut FIRST, in the second minute of this video he says A LOT, but in summary he back tracks further on his previous video and says 1. he believed the campiness of  Raimi's movies was intentional 2. The corniness was a product of the time 3. he enjoyed it. So I imagined that 1. his previous video essay was about how the Raimi Spider-man movies fit into the context of the time period 2. the angry youtube comments that flashed across the screen would have problems with the Raimi movies being called corny.  \n\nSo imagine my surprise when  I realize (the video in the side bar with WHY IT SUCKS on the icon and Worse Than You Remember in the title)[https://www.youtube.com/watch?v=4THpqdEgbqo&amp;t=260s] is the video being discussed. The last thing I heard from the amazing spider-man video was \"I don't care if people disagree with me or misinterpret what I'm saying,\" referring to the raimi video. So, with the mental gymnastics this dude is putting me through and the connotation of that last quote implying he only presented opinions (he didn't say he won't care if he's wrong, meaning there are no facts presented, meaning the bad reception of the previous video is based solely on people not agreeing subjectively)...meaning... that the 2 huge claims of the raimi trilogy \"sucking\" and being \"worse than you remember\" must be supported with just his opinion and no discussion since he won't care.  \n\nSo yeah rant aside lol I watched it expecting a review. It's not a review, he more so just goes through the 3 movies scene by scene, says what he likes and doesn't, weirdly interprets some characters and character moments, and never really sticks to a specific narrative. It's just a free form discussion not really about the camp where he's defensive immediately against his own title. \n\nStumbled on what seemed like an (actual essay)[https://www.youtube.com/watch?v=SjPxyIirTNc] where the claims within the essay are broad thematic strokes supported by what he didn't like about about the movie, again, presented as factual flaws. I stopped watching at around 12:50 where he said \"the holy hand grenade,\" was a failed attempt at commentary for a theme he himself said wasn't even in the movie, not understanding it is a monty python reference in a movie about references. And again, it only irked me because it's not presented in a discussive manner. but in a factual manner.\n\n**I purposefully kept my opinion on the movies out of this to keep the discussion as objective and on-topic as possible**\n\nAnyway \n\nSo a few questions, does saying \"this is just my opinion though\" bring more weight to arguments you have on an objective claim? Does it negate them? Where do you draw the lines between essays, reviews, discussions, rants, etc? ",
        "created_utc": 1536159817,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (September 05, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9d6xrn/casual_discussion_thread_september_05_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1536156871,
        "upvote_ratio": ""
    },
    {
        "title": "Cinemas Greatest Scenes: The Death of Sergeant Elias (Platoon, 1986.)",
        "author": "[deleted]",
        "url": "https://rear-view-mirror.com/2018/07/11/cinemas-greatest-scenes-the-death-of-sergeant-elias/",
        "text": "[deleted]",
        "created_utc": 1536143255,
        "upvote_ratio": ""
    },
    {
        "title": "Kore-eda: Rank His Movies",
        "author": "kawaiiasaurus_flex",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9d3pfh/koreeda_rank_his_movies/",
        "text": "[removed]",
        "created_utc": 1536128302,
        "upvote_ratio": ""
    },
    {
        "title": "Films that have reached you on a spiritual level",
        "author": "Gigamear",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9d3d8e/films_that_have_reached_you_on_a_spiritual_level/",
        "text": "[removed]",
        "created_utc": 1536125070,
        "upvote_ratio": ""
    },
    {
        "title": "Magnificent Seven: A shadow of Seven Samurai",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9d34t4/magnificent_seven_a_shadow_of_seven_samurai/",
        "text": "&amp;#x200B;\n\nhttps://i.redd.it/xelyd089nck11.jpg\n\n \n\n**W**hen I first started writing this, I was going to do my typical review, but as this wore on, I realized some things. First, this is a[shadow of Seven Samurai](https://thefilmera.com/2018/09/04/the-magnificent-seven/)*;* second, that shadow isn’t quite as good. If you’re not aware, *Seven Samurai* is an Akira Kurosawa epic from 1954. Fun fact: it was also from Toho, who produced the Godzilla films. I guess I didn’t realize how extensive their library was. Anyway, *Seven Samurai* is the tale of some villagers being tormented by bandits who seek out the titular samurai to defend them. The film runs nearly four hours and is an emotional roller coaster. I highly recommend watching it if you haven’t already. To get *the Magnificent Seven* down to two hours, a lot was sacrificed. I’ve only watched *Seven Samurai* the one time, but it stuck with me.\n\nThis film starts by showing the bandit gang riding in to steal supplies. They also threaten the villagers and the leader guns down one of the townspeople who tries to charge him. There’s even a speech from the leader complaining that the church goers don’t tithe enough so he doesn’t get to steal as much! However, I feel like *Seven Samurai* did a lot more to develop the villagers as people. This film runs through that part in about ten minutes; I believe the samurai version ran a good thirty minutes or so. That extra time gets you engaged with them so you don’t just see them as fodder later in the film.\n\n \n\nI don’t recall the bad guys in *Seven Samurai,* though. I’m not sure if they were just generic or overshadowed by the villagers and heroes. Here, Eli Wallach is a particularly good villain. His henchmen are kind of just there in the background, but at least he’s a decent bad guy.\n\nBoth films see the villagers go off to town in order to find some heroes to save them. In this case, the villagers arrive at a border town in time to witness Yul Brynner escort an Indian body up to the cemetery. Apparently, the local bigots don’t want him buried with their kind. The guy fell over and died in the street, but he can’t even get a decent burial. Yul’s character takes it upon himself to get the job done and Steve McQueen joins him to ride shotgun. The villagers see this and decide to go hit up Yul’s character for help. In turn, Steve McQueen’s guy gets recruited, as does Charles Bronson, Robert Vaughn, Brad Dexter, and James Coburn. There is also the young guy, Horst Buchholz, who I’ve never seen in anything else. His career must not have gone far.\n\n \n\nSo the cast is pretty remarkable and while I’m not that versed on the western genre itself, I know enough to know this is a good collection of heroes. Brynner is definitely the leader of this outfit. McQueen is a bit more than the trusty sidekick to Brynner. I’d almost say they were double-billed. Bronson is the usual quiet, but violent, guy I’m used to seeing. James Coburn was unrecognizable to me. I’m used to old man Coburn from Mel Gibson’s *Payback*. Robert Vaughn was his usual cool character and Brad Dexter looked familiar, but I couldn’t think of anything else I’d seen him in.\n\nThe thing with *Seven Samurai*, is that it was long enough to really dig into the back stories of the various heroes. *Magnificent Seven* largely glosses over much of that. When Brynner’s character is asked where he’s from, he merely points. Then when asked where he’s going, he points again. There is a bit more details between him and McQueen’s character, but not a whole lot other than both are looking for the next thing to go do. Coburn’s character does get a bit of development where we see his throwing knife abilities, but that part gets left behind as soon as its done. In *Seven Samurai*, the one guy that was featured this way had more of a role in the big battle at the end. Coburn really doesn’t.\n\n Charles Bronson gets to be the cool, quiet guy that the kids want to emulate. There are a couple good scenes in the big battle, but that’s about the extent of him. Brad Dexter participated. So that isn’t saying much. Most disappointing was Robert Vaughn. His character was kind of a coward, or maybe just shell shocked from all the violence he’d seen. So his guy does have a bit to do, but that gets squandered. I really felt like he needed to be more of a part of things. Then again, I just wanted to see more of him anyway. He was in quite a few TV shows I watched as a kid and I’ve always liked his style. \n\n \n\nHorst Buchholz is very close to being the most developed character. In *Seven Samurai*, there was the young and inexperienced guy who was eager for action and wanted to be part of everything. Buchholz is that same guy here and he does well. I enjoyed his interaction with Brynner when he’s trying to join the group and his speech to the cowardly villagers was pretty well done. He also gets a decent share of the latter parts of the film ,too.\n\nSo the cast is good and the western backdrop is a fitting change from the samurai backdrop of the source material, but how does this fail? It’s just too short. There wasn’t nearly enough time to get invested in all the heroes. So we get short bits and explanations for them rather than a good feel for who that person is and that is why the nearly four hours you spend on *Seven Samurai* makes it the masterpiece it is. Time is spent there to invest you in the villagers and their plight. You get to know each of the heroes, their skills, and their motivations. *The Magnificent Seven* largely glosses over things to get going. That isn’t to say this is a bad movie. After all, we’re comparing a remake to an absolute masterpiece.\n\n \n\nSo far I’ve really beaten this thing up comparing to the original, but I think it’s time to go over its merits. First and foremost, I’ve already mentioned the cast. This seems like a who’s who of the western genre from the time period. I’d liken this cast to the *Expendables* of the modern age. The story borrows heavily from its source, but there is a bit of a twist after the first big battle in that the heroes here get captured. The bandit leader sees them as equals in the bandit game and decides to release them without their weapons. Of course, these are the good guys so they head out like they’re supposed to, but end up coming back and finishing things off. That part feels distinctly from a western.\n\n[https://thefilmera.com/2018/09/04/the-magnificent-seven/](https://thefilmera.com/2018/09/04/the-magnificent-seven/) By Ken Cikas\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created_utc": 1536122749,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for movies with a sort of specific criteria for Halloween time, please help",
        "author": "Arch_Stant0n",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9d20iv/looking_for_movies_with_a_sort_of_specific/",
        "text": "[removed]",
        "created_utc": 1536113185,
        "upvote_ratio": ""
    },
    {
        "title": "What is your favorite old style LA jazzy diner style noir movie? Like a quiet darkish rainy movie with jazz featured heavily.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9d1hb3/what_is_your_favorite_old_style_la_jazzy_diner/",
        "text": "[removed]",
        "created_utc": 1536108782,
        "upvote_ratio": ""
    },
    {
        "title": "Grease (1978) v. Grease (2010)'s \"Singalong Edition\"",
        "author": "nkleszcz",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cw9q3/grease_1978_v_grease_2010s_singalong_edition/",
        "text": "This past weekend the family went to see a revival of Grease at our local theater.  But the version they played was not the original (which was the same version as the re-release they did in 1998, celebrating the 20th anniversary), but the 2010 edition, which is a \"singalong\" edition.  \n\nI don't want to make this thread about the movie \"Grease\" itself.  I'm sure that all that has been written about the film has been done.  Suffice it to say, for all the problems of the movie (of which there are a considerable number), the movie does succeed in one important manner: it is a fun film, infectious and happy and its ending is a little too pat.  \n\nBut instead, the \"singalong\" version takes the original film, and adds subtitles when the songs come on.  Not just any subtitles: these subtitles are animated, and have a life of its own.  During \"Greased Lightning\", some of the (naughty) words are replaced by pictures representing family-friendly versions of what was meant (a cow's udder, a cat), and during \"Sandy\" (sung at the drive-in, with the cartoons in the background), the bouncing-ball was popsicle sticks, and hot dogs chasing after its buns.  \n\nFor all the controversy of directors revisiting their landmark projects and making tweaks that make the film different (some better, some worse), I cannot help but think that this sort of change actually *improved* on the original (which was already well-received by the general populace).   The lyrics helped emphasize the plasticity of the whole venture, and portrayed it as a good thing.\n\nI can't help but wonder what other projects have had \"Singalong\" editions as well.  Certainly if _Rocky Horror Picture Show_ didn't have this yet, they should.  And the Disney DVD extra features which allow for singalong editions aren't what I'm referring to, as those are plain text, not the dynamic text that Grease had.",
        "created_utc": 1536072429,
        "upvote_ratio": ""
    },
    {
        "title": "Doing research on Iconic movies from the 1970s up until 2014. How to go about it?",
        "author": "CrappyCrabby",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cur0j/doing_research_on_iconic_movies_from_the_1970s_up/",
        "text": "[removed]",
        "created_utc": 1536060546,
        "upvote_ratio": ""
    },
    {
        "title": "Are Chazelles films too......... white?",
        "author": "SexCashClothes",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cugb8/are_chazelles_films_too_white/",
        "text": "[removed]",
        "created_utc": 1536057537,
        "upvote_ratio": ""
    },
    {
        "title": "Allow me to present - The Cinephile Club!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9ctz1p/allow_me_to_present_the_cinephile_club/",
        "text": "[deleted]",
        "created_utc": 1536052396,
        "upvote_ratio": ""
    },
    {
        "title": "A question about Raw (2016).",
        "author": "Mr-0strich",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9ctush/a_question_about_raw_2016/",
        "text": "So I just watched the french Horror/Drama Raw (actually I watched it twice, back to back because it wouldn't leave my head). After the first watch I was quite confused about everything that happend, knowing what I knew at the end of it, the second viewing was much clearer. However there is one scene that I can't find an explaination for. \nJust before she get's painted in blue Justine is in her bed under a blanket. She starts having a panic attack and shortly after somebody seems to stand next to the bed and hit her several times. What is happening there? Is she dreaming and the sequence is supposed to metaphoricaly explore her psyche? For most scenes that seemed odd I could think of an interpretation of what it could mean, except for this one. Does anyone here have an idea of what this scene means/what is actually happening?",
        "created_utc": 1536051043,
        "upvote_ratio": ""
    },
    {
        "title": "The evolution of comedy",
        "author": "HairyDavid",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9ctg9a/the_evolution_of_comedy/",
        "text": "I was rewatching *The 40-Year-Old Virgin* today, and it made me realize just how long the Apatow influence has gone on in comedy.  It's honestly kind of impressive.  That film was released in 2005, although he's been in Hollywood working since around the early 1990s.\n\nI would say the Apatow style would be, from a filmmaker's point of view, heavy on improv.  Shooting the script, but being very generous with extra takes, and using those if they work better.  And actually releasing very long versions of films as \"director's cuts\" on DVD.  Hell, I think most of his director's cuts of his films go over two hours, some well over.  This is/was pretty unusual for comedy, which has traditionally been a 90-minute \"get in-get out\" medium as far as what I've seen (obviously exceptions exist).\n\nEarlier this year, I watched *A Futile And Stupid Gesture* which was about Doug Kenney and the rise of National Lampoon.  The movies and figures that came out of that movement, Bill Murray, Chevy Chase, Harold Ramis and others were widely influential in the 1970s and 1980s, but by the 1990s that comedy was seen as dated and almost all of them, save for Murray who was perhaps rescued by Wes Anderson, saw their output and careers dry up.\n\nIt's kind of interesting to me how comedy changes.  For instance, there's action and sci-fi directors that can still find work today.  Wes Craven made his mark in the 1970s, but was directing hit horror movies as recently as 2005 (his last critical and financial success).  Obviously directors like Scorcese and Spielberg are still relevant.  But you'd be hard pressed to find comedies done by Zucker, Abrahams and Zucker, or John Landis.\n\nIt's also interesting in what's acceptable to be joked about.  In rewatching *The 40-Year-Old Virgin*, there's jokes about specifically hunting down drunk women (date rape), Steve Carrell doing a \"blaccent,\" and transvestite prostitutes (transphobia).  And this is from a filmmaker who's generally seen as \"woke,\" especially now with his frequent tweets on Bill Cosby and Harvey Weinstein.  If the exact same film were to be released today, he'd be raked over the coals, at least online.\n\nI wonder what the next big comedy trend will be.  I think we're still living in a world where \"The Frat Pack\", i.e. Stiller, Vaughn, Owen Wilson, Ferrell and Jack Black are popular, although they've maybe been eclipsed by the younger group of Rogen, Hill, McBride, Franco, Rudd, Segel and Robinson.  I think we're already seeing less films about largely white man-children, and branching out into different subject matter like Apatow directing Amy Schumer in the female-led *Trainwreck* and producing the film *The Big Sick* starring the Pakistani-American Kumail Nanjiani.",
        "created_utc": 1536046440,
        "upvote_ratio": ""
    },
    {
        "title": "I guess if i would watch 2001 : A Space Odyssey, Solaris and Stalker over and over again. I would choose one of those movies. Because im sure these movies will give different meanings in each view. It will be fun . So what are your movies?",
        "author": "IamSwami",
        "url": "https://www.reddit.com/r/AskReddit/comments/9cpe0d/youll_get_100000_if_you_bingewatch_the_same_movie/",
        "text": "",
        "created_utc": 1536039568,
        "upvote_ratio": ""
    },
    {
        "title": "Looking back at Mad Max(1979)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9csq2z/looking_back_at_mad_max1979/",
        "text": "[deleted]",
        "created_utc": 1536038599,
        "upvote_ratio": ""
    },
    {
        "title": "So what are your answer guys?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskReddit/comments/9cpe0d/youll_get_100000_if_you_bingewatch_the_same_movie/",
        "text": "[deleted]",
        "created_utc": 1536036978,
        "upvote_ratio": ""
    },
    {
        "title": "Eternal Sunshine of the Spotless Mind is one of the best films ever made",
        "author": "_Meme_Sauce",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9crx2t/eternal_sunshine_of_the_spotless_mind_is_one_of/",
        "text": "I just watched Eternal Sunshine for the first time the other day and have not been able to get it out of my head. I’m somewhat familiar with Charlie Kaufman’s work (I’ve seen Anomalisa and Being John Malkovich) both of which I loved, but I just wasn’t prepared in the slightest for the emotional gut punch that was this movie. \n\nI couldn’t relate to the story in a straightforward sense, I’m still very young (16) and have never been in a serious romantic relationship, but obviously it doesn’t take a serious relationship to be able to feel human emotion. In that sense I related to the film immensely. \n\nTo me, without a doubt the most important thing a movie can do is harness the power of emotion. I love films that make me feel something, as I’m sure all of you do as well. Whether it’s sadness, joy, or terror I automatically know a movie is special if it able to get a strong emotion out of me. It’s what I want and look for in film, and love nothing more than to find a film so deeply rooted in feelings and emotions that it automatically becomes a favorite.\n\n“Memory can be erased but the heart can’t”\nThis is a quote from a review of Eternal Sunshine on Letterboxd, and it describes what I got out of it perfectly. The fact that this film can make me tear up while simultaneously making me laugh due to the scenario’s comic absurdness is genius. Heartbreak and confusion are themes that plague the film but it’s never able to lose it’s satirical edge no matter how depressing thing get. A film I’ll be watching for the rest of my life no doubt, and an instant favorite.\n\n“...Like tears in the rain...”\n",
        "created_utc": 1536030724,
        "upvote_ratio": ""
    },
    {
        "title": "(Ghost in the Shell, the Sixth Sense) Can someone help me identify the origin of this (possible) film reference ?",
        "author": "ssb64ceec",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9crwat/ghost_in_the_shell_the_sixth_sense_can_someone/",
        "text": " This may be a long shot, but I'll be ecstatic if somebody has a good answer.\n\nThere is a certain scene, that I suspect is from an older classic, or maybe a painting or other work of art. I can only remember the following two examples right now, but I believe I've seen it in other films as well. I don't believe either of my examples is the original.\n\n​It's always an exterior shot (I think), with city setting in the background. A group of children runs across the foreground (right to left in both of my examples), wearing matching clothing of some kind.\n\nFirst example: Ghost in the Shell (1995) at approx 35m20s. A group of young girls runs right to left across the foreground, in rain each carrying a yellow umbrella. No accompanying adult can be seen. (May be relevant that our characters are not on screen. Possibly, I argue it is, the first-person perspective of our protagonist).\n\n[https://imgur.com/a/JCEs4oJ](https://imgur.com/a/JCEs4oJ)\n\n​Second example: The Sixth Sense (1999) at approx 28m30s. A group of young boys walks right to left across the foreground, in matching baseball uniforms. Obviously a baseball team, but no accompanying adult seen. Our lead characters are walking toward us from the background, but they don't interact with the boys.\n\n[https://imgur.com/a/h8L0ECl](https://imgur.com/a/h8L0ECl)\n\nIt's possible that I'm just noticing a pattern, no such intent by the creators (maybe they just had the same kind of idea independently). But my instinct is that it's a reference. For some reason I find it very visceral. Especially the Ghost in the Shell example.\n\nIn Sixth Sense, there is an obvious contrast between the 'normal' boys happily belonging to a social group, while our kid is lonely and isolated. This could also work for GITS, the Major (female) is struggling with alienation, whereas these young girls appear to be innocent and are effortlessly participating in a social group.\n\nAnybody?",
        "created_utc": 1536030517,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best way to watch The Passion of Joan of Arc (1928)?",
        "author": "Gigamear",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9crqy8/what_is_the_best_way_to_watch_the_passion_of_joan/",
        "text": "I'm extremely curious to finally watch what many have told me is the \"greatest performance in cinematic history\", but I've heard so many horror stories about versions of this film negatively impacting the piece as a whole, that I feel completely lost in figuring this out myself.\n\nDoes anyone have any thoughts on what exactly I should do to watch this in, what you feel, is the right way? I don't know much about silent films, and even less about what treatment they get when they are re-released, so any help would be appreciated.\n\nThanks",
        "created_utc": 1536029188,
        "upvote_ratio": ""
    },
    {
        "title": "Isn't it ironic how David Fincher and Jean-Pierre Jeunet, the directors of the most disliked Alien films (Alien³/Alien Resurrection), are now doing consistently acclaimed films while Ridley Scott and James Cameron have mostly been hit or miss with their movies (in a critical standpoint)?",
        "author": "DraftDraw",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cqx11/isnt_it_ironic_how_david_fincher_and_jeanpierre/",
        "text": "[removed]",
        "created_utc": 1536022207,
        "upvote_ratio": ""
    },
    {
        "title": "If your favourite director were an artist of a different kind (e.g. a painter, composer, poet or novelist), who would they be?",
        "author": "Ardenbas",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9con73/if_your_favourite_director_were_an_artist_of_a/",
        "text": "[removed]",
        "created_utc": 1536004543,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn’t the great composer Miklos Rozsa talked about as much any more?",
        "author": "Kubrick379",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9coira/why_isnt_the_great_composer_miklos_rozsa_talked/",
        "text": "Rozsa is on the level of masters like John Williams, Ennio Morriconne, and Bernard Herrmann. He has done beautiful music for epics like Ben-Hur, Quo Vadis, El Cid, and King of Kings among others. His film noir scores for Double Indemnity, The Asphalt Jungle, and The Killers are fantastic. Even his lesser know scores for films like Julius Caesar and The Golden Voyage of Sinbad are great listening material. How come the man isn’t talked about that much today?",
        "created_utc": 1536003636,
        "upvote_ratio": ""
    },
    {
        "title": "movie posters in movies",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9co9c4/movie_posters_in_movies/",
        "text": "[removed]",
        "created_utc": 1536001761,
        "upvote_ratio": ""
    },
    {
        "title": "movie posters in movies",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9co8el/movie_posters_in_movies/",
        "text": "[removed]",
        "created_utc": 1536001587,
        "upvote_ratio": ""
    },
    {
        "title": "Movies like Blow-Up, The Conversation and Blow Out.",
        "author": "magthyuz",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cn5hq/movies_like_blowup_the_conversation_and_blow_out/",
        "text": "[removed]",
        "created_utc": 1535994118,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (September 03, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9clsp6/casual_discussion_thread_september_03_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/)\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1535984101,
        "upvote_ratio": ""
    },
    {
        "title": "Rob Zombie's 31: Discussion",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cjg2x/rob_zombies_31_discussion/",
        "text": "[deleted]",
        "created_utc": 1535959398,
        "upvote_ratio": ""
    },
    {
        "title": "The Big Lebowski: How it Feels to be a Stoner",
        "author": "TrippEvans",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9ci04k/the_big_lebowski_how_it_feels_to_be_a_stoner/",
        "text": "[A short video essay I just finished on how The Big Lebowski perfectly captures how stoners feel, perceive the world.](https://youtu.be/aiuAC1kJwxI)\n\nIt seems like most stoner comedies focus on the act of smoking weed, while the Big Lebowski uncritically looks at how smoking every day for decades can change who you are, and how you fit into the world.\n\nThanks for clicking, and yes mods, I did make this video",
        "created_utc": 1535944669,
        "upvote_ratio": ""
    },
    {
        "title": "Is David Fincher Overrated?",
        "author": "OrzhovDunn",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9chus8/is_david_fincher_overrated/",
        "text": "(Click like link to watch episode)\nhttps://youtu.be/-ho7nQCiPMs\n\n\"I am Jack's wall of text.\"\n\nIt's not a great feeling realizing your personal hero's are human. Your mother and father whom were responsible for not only squirting life but also (in most cases) are there to protect, guide, &amp; provide. Sounds like a home security system slogan. One day your playing ball with the old man or baking cookies with mom. Then before you know it you're keeping your fathers tongue moist with a sponge because he forgot how to close his mouth. Or your watching a dialysis machine perform Dracula on your mother better than Bela Lugosi. No sympathy here. We all have or will go through it. No more buffer for who's going into the ground. My quarter is on the machine. I GOT NEXT!\n\nThe difference between the hero's we don't choose like parents and the ones we do is extremely important. This is a little how I felt rewatching what was my favorite fimaker in the bizz David Fincher. I could never take away what he has done right. I'm not calling him Tim Burton or Michael Bay. But watching Fight Club in 2018 instead of 1999 is a completely different experiance and made me question why and also what I'd liked about Super Finch.\n\nAlien 3 not his fault...nuff said. But I really think he did the best he could with the hurdles placed on the race track. That project was a steaming bile heap before it was dumped in the young Fincher's lap. Sigourney was being a tyrant and the studio should have never let her have so much power over the creative process. \n\nSe7en holds up. I mean if that was a new release tomorrow it wouldn't feel out of place. Maybe the opening credit sequence is a bit gawdy....no you know what f*ck that. It's still an A+. Fincher found his muse in a young hunky type casted actor in Brad Pitt and Morgan Freeman was great at being Morgan Freeman. As an added bonus lighting struck twice in the same year as Kevin Spacey had two very similar but career defining roles as John Doe &amp; Keyser Soze. \n\nThe Game like The Curious Case of Benjamin Button are the two least Finchy films in the flock. Of course polar opposites but The Game felt like every sleezy 80' s/90' s Michael Douglas role. Albeit with a little more Fincher pizaz. This film does not hold up at all and just seems silly and gross given the modern day social climate. Ben Button has great make-up. I mean GREAT MAKE-UP. Pitt's also at the top of his game performance wise. But still is my least favorite of David's films.\n\nPanic Room suffered from on ongoing theme I've picked up in my more crusty years. Its about 35 mins to long. Let me just say however I loved and still love Jared Leto's performance in this film. He works astonishingly well as the bratty entiled cornrow toting douche bag that employees actual dangerous criminals. His reprisal of this role didn't work for me in Suicide Squad but to be fair nothing really did, did it? \n\nFive years off and allot of research birthed in now my opinion his greatest work to date. Zodiac. The source material is maddening and must have been as confounding to make as it was the actual people working on the case. Adapting Robert Greysmiths accounts and making a movie about people having conversations and running into dead ends is pulled off brilliantly. Many directors are capable of producing special pieces and I think this was Fincher's Citizen Cane. Perfectly cast. Also putting a much deserved actor in Mark Ruffalo into the spotlight. This is really two movies in one. But fits together seemlessly. \n\nThe Social Network was the perfect collaborative effort. Fincher frontlining an Aaron Sorkin script with the dynamic duo of Atticus Ross &amp; Trent Reznor turning in a much deserved Oscar Winning score. The casting of stammer core Jesse Eisenberg was a gutsy move. But one I feel paid off. Eisenberg has stated that this was the closest role to his own personality. Sounds like a swell guy. Garfield, Hammer (Winklevi), Mara, &amp; Timberlake rounded out a very capable and compelling cast that could keep up with Sorkins snappy dialogue. Really everything worked for the FaceBook biopic.\n\nThe Girl With the Dragon Tattoo feels a little unnecessary but was a good watch. Not my favorite of his offerings but Daniel Cregg and Rooney Mara are electric. The plot is weak and the chemistry is off putting and out of left field but it is a visceral experiance.\n\nGone Girl was another gamble casting wise with a very unpopular Affleck &amp; a relative unknown lead in Rosamond Pike. Tyler Perry wasn't a colon full of farts but as my co-host so eloquently stated this wasn't the best Tyler Perry role. It's the only good Tyler Perry role. This is Fincher's latest film so I don't want to go into to much detail because I truly feel this is a great film that deserves an unmolested veiwing. \n\nSo that's it! Hit that upvote, ring that bell, smash that like button, SUBSRIIIIIIBE....\n\nOh...I was hoping you didn't notice. So. Fight Club. When this film came out the studio hadn't the foggiest how to market this film. Was it a drama? Comedy? Thriller? Yes. When I walked out of the movie theatre with the credits blasting The Pixies \"Where Is My Mind?\" Behind me I felt changed. I felt like I just really saw what a film could be. Like I just saw my very first movie. I was a fawn wobbling on brand new legs. Ice cream tasted sweeter. Cotton felt softer. Visually speaking and our two (one?) leads performance still hold up today. But literally everything else is antiquated. The message and soul of this film is missing the mark by a football field. Even Palahniuk has stated that when he wrote the story for which it's based, he was in a completely different mind space. Some of that piss and vinigar wares off when you get older. Most of us would kill to sellout now. Even the staunchly outward punk rockers from yester year. Bills to pay. Mouths to feed. \n\nIt also inspired a wave of douchebagery. The dudebros that didn't get that the film was making a parody of, flew this film like a sigil. So should Fincher be held to the flame for the films supporters? Yes &amp; no. Watching Fight Club recently made me think long and hard if I have been holding Fincher films with a untouchable reverance. Although he is responsible for greats Se7en, The Social Network, &amp; Zodiac. He also created Panic Room , Fight Club, &amp; Ben Button which are overlong music videos. This style is his forte. I never thought I would say that I'm interested in a World War Z sequel. This will be very telling to see if Fincher is one of the greats with a few hiccups or the next Brett Ratner. \n\nThanks for reading. \n\n\"I am Jack's abrupt sign off.\"",
        "created_utc": 1535943228,
        "upvote_ratio": ""
    },
    {
        "title": "Cremaster cycle?",
        "author": "baw2001",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9chqlp/cremaster_cycle/",
        "text": "[removed]",
        "created_utc": 1535942150,
        "upvote_ratio": ""
    },
    {
        "title": "I’m curious what r/TrueFilm thought of Madeline’s Madeline.",
        "author": "Starphysics",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cgzxw/im_curious_what_rtruefilm_thought_of_madelines/",
        "text": "For me it felt insanely overhyped. I had heard that this was a brand new authorial voice and that there was lots of formal experimentation. In reality the film feels a lot like a retread of old topics and formal techniques I’ve seen before. The performative art stuff was done better in Out 1 and the mental illness was done better in Woman Under the Influence. Almost all the characters are one-dimensional, the director is almost wholly portrayed in a negative light, Madeline’s mom is caricaturily weak. On top of that the formal choices are purposefully grating and not particularly impressive or original. Basically, change my mind?",
        "created_utc": 1535935069,
        "upvote_ratio": ""
    },
    {
        "title": "Venice Film Festival 2018",
        "author": "henrythebrown",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cfn9k/venice_film_festival_2018/",
        "text": "Be free to take down if not relevant. Thought I'd post as I am currently here for the entire duration of Venice festival. I've seen a tonne of films so far (currently at the half way point of the festival) and am planning to watch many many more.\n\nPoint of thread? To start discussions on films currently showing here, discuss what people are excited for and why, see if anyone else is going, and if anyone has any queries about anything that is showing I'll answer them. Would like to keep this thread spoiler free but will answer anything else.\n\nCurrent films seen (no particular order): \nPeterloo,\nSuspiria,\nFirst Man,\nRoma,\nThe Ballard of Buster Scruggs,\nA Star is Born,\nThe Mountain,\nOn My Skin,\nThe Favourite,\nDouble Vies,\nThe Great Buster: A Celebration.\n\nIf There's anything showing and you have a recommendation please let me know. Trying to cover as many films as possible while here. Have tried VR sections of films too.\n\nSo there we go, Venice film festival. Happy to answer anything but please, want to hear more about what you guys think and are excited for. Want to hear a range of peoples thoughts of this festival while here.",
        "created_utc": 1535923250,
        "upvote_ratio": ""
    },
    {
        "title": "Finally saw BlacKkKlansman and...",
        "author": "jacobfoster1999",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cfkka/finally_saw_blackkklansman_and/",
        "text": "The theme of duality being presented throughout BlacKkKlansman was really interesting.\n\nJust to list a few off  \n\\-The obvious duality of Ron Stallworth, between his black + \"klan\" self.  \n\\-Along with the duality of Flip, with his Jewish heritage + his on the surface \"whiteness\"  \n\\-David Duke's public persona of being this well dressed politician + his inherent shitty, racist personality, which he only shares in private.\n\nTo me, it was an captivating concept that each of these characters, along with like most the others, were wearing masks to protect who they truly are, with that going to be ends of the \"evil spectrum\". I feel as if this could show how we don't really know the people we judge and that's the cause of all our issues. We only know the tiny, funnelled scraps of information we're given.\n\nAlso, it just came to me that all these \"masks\" the characters wore were self inflicted, so I guess, that could mean if they stop shielding those on the other side then it can only get better(?).",
        "created_utc": 1535922634,
        "upvote_ratio": ""
    },
    {
        "title": "Stagecoach: Defining the Western",
        "author": "BuildMyGallowsHigh",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cffct/stagecoach_defining_the_western/",
        "text": "Yesterday I posted here with a [list](https://thefilmera.com/2018/09/01/the-10-greatest-westerns-and-the-order-in-which-to-watch-them/) of a recommended viewing order for one to better acquaint themselves with the western genre. At the top of that list was John Ford's western masterpiece *Stagecoach* which saved the genre from near depth and elevated it to artistic heights. Ford took the banal, played out stereotypes of previous western films and turned them on their heads by giving greater depth to the stock characters that filled the genre. *Stagecoach* was also the introduction of Ford's beloved Monument Valley, and pervasive western legend John Wayne. Ford redefined the genre entirely, and crafted a film that has stood the test of time nearly 80 years later, even despite some unfortunate racial politics regarding the representation of Native Americans. Ford went on the make more influential and philosophical westerns like *The Searchers* and *The Man Who Shot Liberty Valance*, but neither of them had the explosive impact that Stagecoach did when it burst onto screen in 1939. To accompany its placement on my previous list I have also provided an in depth look at the influence of *Stagecoach* and its importance to the genre as a whole which can be read [here](https://thefilmera.com/2018/09/02/stagecoach-defining-the-western/). Orson Welles was a great admirer of both Ford and *Stagecoach* in particular. He screened the film some 40 times in preparation for making *Citizen Kane* and said of Ford as a director: “I prefer the old masters, by which I mean John Ford, John Ford, and John Ford. He’s a poet and a comedian. With Ford at his best you get a sense of what the Earth was made of.” If that's not enough to solidify its greatness, then I don't know what is.",
        "created_utc": 1535921471,
        "upvote_ratio": ""
    },
    {
        "title": "Barry Lyndon: Society Obsessed with Wealth and Status",
        "author": "Nyg500",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9ceiqs/barry_lyndon_society_obsessed_with_wealth_and/",
        "text": "​\n\nSPOILERS\n\nUsually when I read or hear about Barry Lyndon, the discussions is usually focused on the beautiful/painterly imagery. And yes Barry Lyndon is one of the most beautiful films ever, but I think the brilliance of the story is often overlooked. Barry Lyndon is about many things, but to me its biggest theme is how the immoral obsession of society on wealth/status effects the individual. Of course, the film takes place in 18th century Europe but I think the theme can equally be applied today.\n\nAnyway Redmond Barry starts out the film showing some noble qualities and is generally a likeable character on the surface. However, he is of \"low birth\" and his family is disrespected by others. The early section of the film focuses on Barry's love for his cousin. He believes that his pure love and passion can overcome the promise of status/wealth that can be provided by his rival. After a setup duel and learning that his cousin ended up marrying his wealthy rival he begins to realize that genuine love and passion don't mean much in the world he lives in. This is confirmed when he sees how respected he is when he pretends to be English Officer. After experiencing the good life, he further realizes that success in this world is all about portraying a surface of high class through looks, money, and a sophisticated manner. It seems that to be successful you must be passionless and kiss ass in order to fit in with the elites. This is exactly what Barry does when he seduces Lady Lyndon using his false veneer and good looks. As Barry becomes more successful, the bigger of an asshole he becomes. He loses his good qualities and begins to cheat on his wife and abuse his stepson, and is rewarded more and more. Even Barry's mother is revealed to be equally bankrupt morally as she urges him to take of advantage of Lady Lyndon.\n\nHowever, unlike his elite counterparts Barry was not able to conceal who he truly was for long.  Throughout the film, Barry also learns that sometimes fighting allows him to get what he wants, but is not accepted in this world he has climbed into. When he is insulted by Lord Bullingdon, this passion comes out and destroys the most important thing to him in this social sphere, his reputation. Barry tried to become something he is not and was punished for it. It shows that because of his \"low birth\" he is not really a part of this strata. But it questions what \"low\" really is. We see Barry's life as thrilling and adventurous when he is a nobody and then boring and empty when he is rich. The film is full of irony, perhaps most of all when Barry finally does something honorable by shooting into the ground during his duel, it ends up being the last nail in his coffin. In this world honor and morality are punished.\n\nRyan O'Neil was perfect choice for the role of Barry Lyndon because his expressionless demeanor demonstrates how a person like him is completely devoid of his own will in this society. Like HAL in 2001, he does whatever he can to survive including throwing away his morals and personality. He doesn't give a shit about Lady Lyndon, the paintings he buys, or the culture he is involved in but he knows that feigning that he does will afford him a better life. The only person he does truly love is his son but as the narrator points out his main concern is his son's \"future status\". It shows how deep this obsession with wealth runs in society. It actually reminds me a bit of Scorsese's Goodfellas and The Wolf of Wall Street, as the characters trade in any morality they may have for a lifestyle. ",
        "created_utc": 1535914468,
        "upvote_ratio": ""
    },
    {
        "title": "Horror Analysis Books",
        "author": "BurdPitt",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9ceb1a/horror_analysis_books/",
        "text": "Hello guys! \n\nI have a very simple question this time: I'm just looking for good books as far as horror analysis go. It could be regarding a particular movie, director or subgenre, or the horror genre as a whole. \n\nI'm particularly interesting on the side of suggesting facts, a backstory, an event, without explicitly mentioning it, but rather expressing it through characters and action. In other words, on the side of horror movies that make you imagine things in your head, rather than showing them, but keeping everything grounded on some kind of substance (for example, I believe the \"Come and Play with us, Danny\" line in Shining to be one of the most beautifully terrifying sentences ever, as it does show something but the real horror is created in your mind, by your imagination and also what you can assume, while experiencing the movie).\n\n If this last bit seems too specific, any great book suggestion on the matter will be very welcome! \n\nAnd lastly, if you could please mention why you liked the book(s), it would be even more interesting :)\n\nThanks a lot for the interest and for eventual responses! And if this is the wrong place to post this... Sorry, mods, move it as you wish. \n\nHave a good day ya'll",
        "created_utc": 1535912829,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of September 02, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9cd74p/what_have_you_been_watching_week_of_september_02/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1535904648,
        "upvote_ratio": ""
    },
    {
        "title": "BlacKkKlansman reviewed by Mark Kermode",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=W2jN41b4awA&amp;t=29s",
        "text": "[deleted]",
        "created_utc": 1535888525,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an equivalent to the French Nouvelle Vague Today?",
        "author": "Signed_DC",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c7fmr/is_there_an_equivalent_to_the_french_nouvelle/",
        "text": "Are there any film movements going on now or in very recent times that are experimenting and breaking conventions of filmmaking similar to the French New Wave?  Doesn't really count as a movement but the films of Yorgos Lanthimos are what I immediately think of. Are  there any others, even if they aren't major indie productions, even short films, experimental videos, animation, ect.",
        "created_utc": 1535842882,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an equivalent to the French Nouvelle Vague Today?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c75hc/is_there_an_equivalent_to_the_french_nouvelle/",
        "text": "[removed]",
        "created_utc": 1535840550,
        "upvote_ratio": ""
    },
    {
        "title": "Why does a subreddit called “truefilm” have TDK on their front page?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c75e5/why_does_a_subreddit_called_truefilm_have_tdk_on/",
        "text": "[removed]",
        "created_utc": 1535840533,
        "upvote_ratio": ""
    },
    {
        "title": "THX 1138 and George Lucas's special editions as a form of Cronenbergian horror.",
        "author": "GoldenSights",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c7529/thx_1138_and_george_lucass_special_editions_as_a/",
        "text": "Last night I watched [THX 1138](https://en.wikipedia.org/wiki/THX_1138). The entire time, I was thinking \"hey, these special effects look more like early 2000s cgi than early 70s practical\". I didn't dwell on it because I was trying to stay immersed and wasn't thinking too hard about the implications of watching a Lucas movie. It wasn't until the very end, when the weird monkey things show up, that I had to face the facts: the whole film had been Star Wars'ed. Indeed, the digitally modified director's cut of THX was released in [2004](https://en.wikipedia.org/wiki/THX_1138#2004_director's_cut).\n\nI'm a big fan of David Cronenberg and body horror in general. One of the staple themes of the genre is a dissatisfaction with, or even *loathing of*, the limitations of the human form. A desire to transcend the body into something better but, invariably, monstrous.\n\nSee: [Les yeux sans visage \\(1960\\)](https://en.wikipedia.org/wiki/Eyes_Without_a_Face): the fruitless journey to acquire a new, more beautiful face;  \n[Shivers \\(1975\\)](https://en.wikipedia.org/wiki/Shivers_\\(film\\)): attempts to replace human organs with a functionally superior parasite go awry;  \n[The Fly \\(1986\\)](https://en.wikipedia.org/wiki/The_Fly_\\(1986_film\\)): Brundle, enamored with his newfound strength, denies that there is anything wrong until it's too late;  \n[Cronos \\(1993\\)](https://en.wikipedia.org/wiki/Cronos_\\(film\\)): defeating mortality but becoming glossy-marbleskin-zombie-man in the process. The list goes on.\n\nSince the special-editionification of Star Wars, Lucas has stood his ground regarding their status as the new, official forms of those films. He insists that the GOUT were imperfect, and never lived up to his artistic vision due to limitations in budget, time, and the technology of the era. Apparently these feelings also extended to THX.\n\nAre we seeing the parallels here? There is something tragic about an artist, dissatisfied with the limitations of their work, taking a digitally enhanced butcher knife to it more than 30 years down the line in the hopes of reaching some perfected form, only for it to turn out looking really, really bad.\n\nI'm not sure if I have a thesis, I just wanted to share these thoughts. I struggle with perfectionism as well: this short post has taken over two hours to write. What do you think about this connection between the themes of body horror and non-bodily things, like art? THX prompted me to write this post, but non-Lucas examples are appreciated as well. I know the Star Wars special editions have been discussed to death already.\n\nAlso, how cool would it be to have a horror movie where [Harmy](https://en.wikipedia.org/wiki/Harmy%27s_Despecialized_Edition) swoops in and defeats the mad scientist.",
        "created_utc": 1535840456,
        "upvote_ratio": ""
    },
    {
        "title": "Would you enjoy a directorial partnership between Guillermo Del Toro and Jean-Pierre Jeunet in a movie?",
        "author": "DraftDraw",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c6dvv/would_you_enjoy_a_directorial_partnership_between/",
        "text": "[removed]",
        "created_utc": 1535834521,
        "upvote_ratio": ""
    },
    {
        "title": "Carol or Call me by your name?",
        "author": "youread8ck",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c6by7/carol_or_call_me_by_your_name/",
        "text": "[removed]",
        "created_utc": 1535834085,
        "upvote_ratio": ""
    },
    {
        "title": "Corporate consolidation is slaughtering independent film",
        "author": "projectxama",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c61d9/corporate_consolidation_is_slaughtering/",
        "text": "The independent film business is headed towards an iceberg.\n\nAs Disney/Fox continues to eat up now more than 50 percent of the box office, as companies like Sony Pictures and Lionsgate prime themselves for acquisition, as smaller distributors like Open Road, Annapurna, Neon and STX continue to bleed money and fall apart,  and as digital distributors and platforms begin to actively get involved in the creation and production of stories, (See Netflix, Apple's Netflix clone, etc) it's becoming clear to me that independent film is in danger.  Good luck getting Netflix or YouTube to promote your small movie when they have Originals to elevate. A24 seems to be one of the only small distributors keeping itself afloat, mainly due to the poaching of the Weinstein Co's execs pre-Harvey meltdown.\n\nIf you live in Los Angeles like I do, you've probably noticed the crumbling of our revival theater scene. Currently, the city of Hollywood has one theater that shows old movies. One. *In Hollywood!* I would have never imagined this could happen here.\n\nBut it's par for the course: I was at Sundance this year and couldn't find a single article about any of the jury prize winning films on the front page of Reddit or a single trending story on Facebook or Twitter. Try as they might, the Film Festival circuit is incapable of making traction online. Many of the award winning films were released and buried in a Netflix pile. Most of the attendees were in their 50s-70s. But that's not the first red flag I've noticed. I fully expect Disney to kill Fox Searchlight next year and for AT&amp;Ts new Time Warner to kill Filmstruck.\n\nSince Hollywood has no version of *Steam*, it's still incredibly difficult for indie filmmakers without corporate backing to get their work out. YouTube and Vimeo were supposed to democratize the internet for filmmakers and artist, but that clearly didn't end up happening.\n\nSo what are we to do? If the channels of distribution, both physical and digital, are controlled by companies that want to produce content, and the majority of the box office is kept in an iron grip by one mega-company, then it's unlikely the next generation of filmmakers will get their chance to have their voices heard.\n\n​\n\n​",
        "created_utc": 1535831769,
        "upvote_ratio": ""
    },
    {
        "title": "A Guide Through the Western Genre",
        "author": "BuildMyGallowsHigh",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c4quo/a_guide_through_the_western_genre/",
        "text": "https://thefilmera.com/2018/09/01/the-10-greatest-westerns-and-the-order-in-which-to-watch-them/\n\nI've always found many people who are unfamiliar with westerns tend to be fairly dismissive of the genre as a whole. I myself was once, in my youth anyway. I distinctly remember watching *The Searchers* for the first time and not really enjoying it because of the blatant racism of Ethan Edwards. I thought the film rewarded his character by framing his as a hero. It was not until later when I become more familiar with the genre and its themes that I discovered the meta commentary of *The Searchers*, and other subsequent westerns that do the same. This last year I dove deep into the western genre, looking to gain the greatest exposure I could to all it has to offer, and mentally began crafting a list of my favorite westerns. This list began to grow into something more, as I thought back to *The Searchers* and how my first experience of the film would have been so much better had I the context previous western films has offered. My list soon changed into not a ranking, but an order. an order in which to watch the films that is. I wanted to convey my own thoughts on what the greatest films of the genre had to offer, while simultaneously creating a guide for those unfamiliar to follow so they too can appreciate this most important of genres. From *Stagecoach* to *Unforgiven* there is an expanse of western films that could fill this list, but I managed to limit it down to a mere 10 (with several honorable mentions) which I believe best capture the spirit of the western genre. I'd like to share my list with you [here,](https://thefilmera.com/2018/09/01/the-10-greatest-westerns-and-the-order-in-which-to-watch-them/) and want to know what everyone else thinks. What are the greatest westerns and how do they contribute to the shaping of this cinematic mythology of the west?",
        "created_utc": 1535821929,
        "upvote_ratio": ""
    },
    {
        "title": "Newton (2017) : Showing the gap between the ideals of democracy &amp; the way it's practised in India | Core theme &amp; direction style",
        "author": "allthingsfascinating",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c4qjm/newton_2017_showing_the_gap_between_the_ideals_of/",
        "text": "[VIDEO](https://youtu.be/xmzYPoZT1EQ)\n\n “The gap between the ideals of democracy and the way it is practised (in India) is huge, and we’re all aware of it,” says Amit Masurkar, director of the 2017 film, Newton. I think the content of the film is to make the viewer acutely aware of this gap.  \n\nAnd it does this by showing us the reality of a disturbed Naxalite area. By showing how autocratically the army functions in these areas and how the natives are often the victims of their abuse. I don’t think I have ever seen an Indian film that shows the army in a critical light. It’s a very sensitive topic, and needs to be handled accordingly. And Newton does a praiseworthy job of it.\n\nIn the video above I have discussed the core theme of the film, and the direction style – more specifically, why doesn’t it make use of close-up shots. Let me know what you guys think about it.\n\n&amp;#x200B;",
        "created_utc": 1535821864,
        "upvote_ratio": ""
    },
    {
        "title": "A Guide Through the Western Genre",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c4pwz/a_guide_through_the_western_genre/",
        "text": "[deleted]",
        "created_utc": 1535821744,
        "upvote_ratio": ""
    },
    {
        "title": "Trailer for German, Dario Argento-throwback film \"Luz\"",
        "author": "barracuuda",
        "url": "https://www.youtube.com/watch?v=RT-ndB2M1-Q&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1535808783,
        "upvote_ratio": ""
    },
    {
        "title": "Pi (1998): A modern, psychological take on the flight of Icarus",
        "author": "iacs12",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9c31kf/pi_1998_a_modern_psychological_take_on_the_flight/",
        "text": "Some context on the story of Icarus: Greek mythology tells of Icarus, the son of Athenian craftsmen Daedalus. When trying to escape the island Crete, Daedalus crafts Icarus a pair of wings, but warns him not to fly too close the water, or too the sun. Icarus ignores these warnings, and flew so close to the sun that it melted the wings, forcing him to fall into the water below and drown. The tale is one of precaution, warning of the consequences of overconfidence. \n\nEarly on in the film, there are a couple of references in the dialogue about the flight of Icarus. The first line of the film is the inner dialogue of the main character, Max, who tells of a time when he was child, where his mother told him not to stare into the sun, but he did anyways. The second is when Max, who is Icarus, is being warned by his mentor Sol, who is Daedalus, not to venture so harshly into solving the unsolvable Pi, Sol directly mentions the story by name. \n\nAs the film progresses, Max is consumed by his overconfidence, going so far as calling himself a chosen one by god for having the answer for Pi memorized in his head. Pi represents the sun, and the closer Max gets to it, the more in danger he becomes. \n\nAnd just as Max is at the peak of discovering Pi, learning that the 216 numbers represent the actual name of God, and whomever says the name will bring about the messianic age, metaphorically flies too close to the sun, resulting in Sol dying from a stroke after it’s revealed he was attempting to solve Pi himself after being convinced by Max. This leads to Max having a breakdown in his apartment and performing self trepanation on his brain with a power drill after setting a sheet with the 216 numbers on it on fire.  (burning his wings. Max’s brain and the sheet with the answer represents the wings). \n\nThis is just my analysis and of course the film can be interpreted in more ways than this, so for those who have seen it, what do you think? Also, if you haven’t, I highly recommend it. It is the debut of Darren Aronofsky, and features brilliant use of score and camera work to create a tense and unique experience. \n\n",
        "created_utc": 1535808551,
        "upvote_ratio": ""
    },
    {
        "title": "Riz Ahmed should be the next James Bond",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bz8rv/riz_ahmed_should_be_the_next_james_bond/",
        "text": "[removed]",
        "created_utc": 1535765021,
        "upvote_ratio": ""
    },
    {
        "title": "Yi Yi from a Taiwanese perspective",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bxvxh/yi_yi_from_a_taiwanese_perspective/",
        "text": "&amp;#x200B;\n\n[Yi Yi \\(2000\\) directed by Edward Yang](https://i.redd.it/bz5v6j8p5ij11.jpg)\n\nThe [author](https://thefilmera.com/author/iamgoodjack/) of this piece is Taiwanese, and offers a unique perspective on one of Edward Yang's best films.\n\n[Yi Yi](https://thefilmera.com/2018/08/30/yi-yi/) , or 一一, means “one by one” in Chinese. In writer/director Edward Yang’s 2000 slice-of-life drama, the story follows the Jiangs and their extended family. After one day, the matriarch of the family had mysteriously fallen unconscious, and the rest of the family suddenly arrives at the crossroads of their lives. Yi Yi doesn’t follow any conventional story rhythm; events simply unfold as they do in real life, one after another, no matter how timely or inconvenient they could be.\n\nEach member of the family is a looking glass peering into different parts of Taiwan’s middle class. As a native Taiwanese, I cannot praise Edward Yang enough for the astuteness of his observations. Although Yi Yi is now eighteen years old, its depiction of people is still astoundingly spot on. The characters in Yi Yi are either someone I had personally known or immediately recognizable from after-dinner gossip. The authenticity was amazing, yes, but it was also discouraging. Are we so incapable of change that we are forever confined to the same struggle? There is always one relative you know who is always in between a bad investment and a loan, a teenager defined by uniform and academic performance in the eyes of other adults, a schoolboy battling the legacy of KMT’s authoritarian rule (disciplinary department, in Taiwanese high schools there are even military officers). But must there be?\n\nThe story switches between different points of view, but it was NJ and his two children who got the most screen time. Yi Yi was the debut movie of the two child actors. While both of them weren’t particularly terrible, Ting-Ting (Kelly Lee)’s weakness as an actor was more glaring under the weight of her heavy presence in the story. I had imagined Kelly Lee being a shy, obedient schoolgirl in real life was the reason she got the part, but that does not necessarily mean she was capable of playing as herself on camera. Kelly Lee’s every delivery was strained with effort and that killed any genuineness and spontaneity necessary for some of her lines. The only instance her wooden acting worked in her favor was during her awkward entanglement with her neighbor’s ex-boyfriend.\n\nOf all the PoV characters, the strongest one by far was the salaryman father, NJ (portrayed by Wu Nien-Jen—have you noticed that many of the characters in Yi Yi retained their real names?). The movie didn’t pick up until it shifted its focus from Ting-Ting to NJ. NJ had a stable job in an expanding tech company and a healthy family, yet his existential crisis was the deepest of them all. Though his family life wasn’t exactly unhappy, he just wasn’t close to his wife and children. At work, his peers sought his opinions, but his views were not always respected. His honesty oftentimes became the target of his colleagues’ japes.\n\nNJ was thrown off the rails when he wound up on a business trip with his former lover Sherry to Japan to meet with Mr. Ota (Issey Ogata), a potential business partner. Wu Nien-Jen’s trademark earnestness played off well against Mr. Ota’s optimistic wisdom. For once, he had the opportunity to make something bold and new and be a part of something greater. While he was strolling through the streets of Japan with Shelly, we saw him truly opened up for the first time. In the film, NJ’s character frequently alternates between Mandarin and Taiwanese Hokkien. The two spoken languages’ identities stemmed from the power dynamics between the new immigrants who fled with the Nationalist government and the local Han majority that emigrated to Taiwan during (or before) the Qin dynasty. While Hokkien was considered less refined by some, it was regarded more down to earth by others. Mandarin was the mask of formality NJ wore even when interacting with his family. Only when he was conversing with Shelly was he speaking exclusively in Hokkien in long stretches.\n\nThe trip seemed like a success, but alas, nothing ever goes according to plan. Potentials opened up from the past and the future were in a mere instant, no more. Yi Yi often lamented the fragility of idealism, and how ideals and the nuances of life often succumb to lesser desires. Perhaps Edward Yang based NJ’s character partially on himself. In an interview, the director said he was unsatisfied with how film distribution was in a stranglehold of a few, and he would not want to see his film be sent to die. Thus he forewent releasing Yi Yi in Taiwan altogether. Besides a few film festivals, Yi Yi has never been screened to the public in Taiwan until 2017.\n\nOne could not thoroughly appreciate the wedding scenes until one had watched the movie in full. The wedding at the beginning of Yi Yi was the perfect microcosm of the film’s outlook on life itself. I have attended quite a few Taiwanese weddings in my life. They are such an odd amalgam of conflicting elements, and somehow the image they formed was not one of discord. Wedding ceremonies in Taiwan are a clash of the east and the west, of the new and the old; couples dressed in suits and white dresses exchange vows and rings in the middle of a dinner venue which signals the start of a traditional Chinese feast consisting of no less than ten courses. The wedding in the movie was also where hopes and dreams meet, along with all the crude and mundane attributes of life. Edward Yang captured every human detail: the miscellaneous preparations, the raucous joy, lowly gossips and toasting culture. Life is where everything intersects.\n\n[Yi Yi](https://thefilmera.com/2018/08/30/yi-yi/) was sometimes playfully translated into A One and a Two. It’s a play on the Chinese words of “one” and “two”, in which two “一” form a “二”. There’s an old Chinese expression called “塞翁失馬，焉知非福”. In the parable that spawned the saying, a series of events brought merry and misery, yet no one could really judge the situation fortunate or unfortunate until the dust settled. The only thing Yi Yi makes clear was that life has no clear path and holds no clear answers. Sometimes one needs to accept life in its messy entirety just to see a little better.\n\nIf you would like to support the author and or a small independent film coverage site then give us a visit. We are new but make up for it with our passion.\n\n[https://thefilmera.com/2018/08/30/yi-yi/](https://thefilmera.com/2018/08/30/yi-yi/)\n\n​",
        "created_utc": 1535753163,
        "upvote_ratio": ""
    },
    {
        "title": "Breaking down exactly what makes John Carpenter's \"The Thing\" such effective Horror",
        "author": "FilmRadar",
        "url": "https://youtu.be/4CMCZTdncuQ",
        "text": "",
        "created_utc": 1535750338,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on The Tree of Life?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bxgc1/thoughts_on_the_tree_of_life/",
        "text": "[removed]",
        "created_utc": 1535749785,
        "upvote_ratio": ""
    },
    {
        "title": "\"First Man\" leaves out American flag from moon landing",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bwcqo/first_man_leaves_out_american_flag_from_moon/",
        "text": "[deleted]",
        "created_utc": 1535741771,
        "upvote_ratio": ""
    },
    {
        "title": "A Quiet Place - Telling a Story with Sound",
        "author": "AnOfferYouCanRefuse",
        "url": "https://youtu.be/T-s81-Wl2v0",
        "text": "",
        "created_utc": 1535730250,
        "upvote_ratio": ""
    },
    {
        "title": "70 years gone, yet Apu films seem to be the only Indian cinema to have an acceptance from the international audience. Why?",
        "author": "holden_caulfield1",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9buoks/70_years_gone_yet_apu_films_seem_to_be_the_only/",
        "text": "I am not sure about what I am going to type. I'm just thinking aloud, so please be a little forgiving when you read this. I have thought about it for quite a while, but haven't reached to any firm conclusion or idea. So I think you guys can help me out.\n\n1. The Indian mainstream films are very bad. By bad, I mean, they are outright manipulative, especially the Biopics. I'm not sure how many of you have seen Sanju or Gold (these films were made recently) and they earned crores of money. But they were so full of lies about the lives of the people they were trying to portray. There was no objectivity whatsover. Just plain propaganda of the lives of the main characters. Doesn't the audience get it? Does it have to do something with illiteracy? I mean, the question is, do you have to be literate in order to be able to tell apart good cinema from the bad ones? I am not so sure. Isn't it just common sense? If a Film is real, you'll know it is real. I mean, you can't fool Indians in real life. They can be quite shrewd, especially when it comes to business. Then, why do they get fooled in cinema halls? I'm pretty sure the quality of films have got nothing to do with literacy of a country. I mean, a lot of bad films come from Hollywood, but you guys are pretty literate. Is it because, so many Indians are so entrenched in poverty that they just don't have the time and patience to actively engage themselves with good cinema. They just want to go to a hall to find some cheap entertainment, good guy killing bad guy, one guy laughing at another, and that sort of thing. \n\n2.  That given, India does produce a regular amount of high-quality films. Films like Court, Thithi in the recent times. But   \nI'm not sure if they have been given the amount if International exposure they deserve. I don't know. Or maybe, ever   \nsince Apu there hasn't been anything worthwhile from India? Idk.\n\nWhat do you guys think? Is India underrepresented, and if yes, why?",
        "created_utc": 1535730127,
        "upvote_ratio": ""
    },
    {
        "title": "The Death of the Hollywood Movie Musical",
        "author": "AnOfferYouCanRefuse",
        "url": "https://youtu.be/b8o7LzGqc3E",
        "text": "",
        "created_utc": 1535725462,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (August 31, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9btyi6/casual_discussion_thread_august_31_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1535724855,
        "upvote_ratio": ""
    },
    {
        "title": "Demy’s The Young Girls of Rochefort and La La Land",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bt616/demys_the_young_girls_of_rochefort_and_la_la_land/",
        "text": "​\n\n[Before La La land There was The Young Girls of Rochefort](https://i.redd.it/b5d5k5uaafj11.jpg)\n\nFor this one post I do recommend looking at the links to see the direct correlation between Young Girls and La La Land. [https://thefilmera.com/2018/08/31/film-frame-friday-la-la-land/](https://thefilmera.com/2018/08/31/film-frame-friday-la-la-land/)\n\n​\n\nAs many of you know, *First Man* had its world premiere at the Venice Film Festival to [**critical acclaim**](https://deadline.com/2018/08/first-man-standing-ovation-venice-world-premiere-1202454304/), but two years prior director Damien Chazelle was taking Hollywood by storm with his Jacques Demy-inspired hit *La La Land.* It is not hard to understand why *La La Land* was a big hit. The main leads are two of the biggest stars in Hollywood: Ryan Gosling and Emma Stone. Add on to the fact that this is a dramatic romance with heavy musical numbers, and you got a stand out hit. The visuals are stunning, and the [**music**](https://www.youtube.com/watch?v=yE5PWwoE_3Y) will stick with you long after watching the film.\n\nNow let’s get to the point: yes, *La La Land* is inspired by earlier musicals, but the main inspiration that always stuck out to me like a sore thumb is the work of Demy. I am not just talking about [The Umbrellas of Cherbourg](https://thefilmera.com/2018/07/28/the-umbrellas-of-cherbourg/) either. Most people will mention *Singin’ in the Rain* as another influence, but I don’t think you need to look so far.\n\n​\n\n[I perfectly believe Demy’s The Young Girls of Rochefort inspired not only the musical numbers of La La Land but the optimistic attitude featured in the first half of the film.](https://thefilmera.com/2018/08/31/film-frame-friday-la-la-land/)\n\nTo understand the comparisons of these films, and how these visuals, musical dance numbers, and even emotional beats are connected, you first have to travel back to the 1960s. Demy decided to change the game by releasing *The Umbrellas of Cherbourg* in 1964. A musical romantic drama starring two attractive leads wasn’t unique, but what set it apart was how all the dialogue was sung like an Opera performance. The contrast of lush colorful visuals against the tragic plot of the film was something to take note of. Like Chazelle’s *La La Land*, *The Umbrellas of Cherbourg* put Demy on the worldwide map as a director.\n\nIf *The Umbrellas of Cherbourg* serves as a parallel of not only success for the directors, but actual story elements, how do you explain the well-crafted musical numbers? Easy, with *Young Girls of Rochefort*. Released in 1967, *The Young Girls of Rochefort* took a different approach from *Umbrellas* by sticking to an upbeat story, with more by-the-book musical numbers and erratic dance performances.\n\n​\n\n​",
        "created_utc": 1535718412,
        "upvote_ratio": ""
    },
    {
        "title": "KBINE 2 BABI || FILM IVOIRIEN 2018",
        "author": "filmcamer",
        "url": "https://www.youtube.com/attribution_link?a=fX4TgUIZQLc&amp;u=%2Fwatch%3Fv%3Dx55drzYjmcw%26feature%3Dshare",
        "text": "",
        "created_utc": 1535706045,
        "upvote_ratio": ""
    },
    {
        "title": "Good recommendation on a book on modern distributors",
        "author": "telecode101",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bqhc4/good_recommendation_on_a_book_on_modern/",
        "text": "Hi, I am just wrapping up  Down and Dirty Pictures: Miramax, Sundance, and the Rise of Independent Film by  Peter Biskind. It was an entertaining, interesting and cool read. All about the rise of the independents in the 90s. But I feel like its sort of old history any maybe outdated. I am just wondering, are there any writers that are writing about more modern independent film distributors that are operating within the new channels where independent films are being displayed -- Netflix, Hulu and other places. Just curious. \n\n",
        "created_utc": 1535688849,
        "upvote_ratio": ""
    },
    {
        "title": "Too late (2015)",
        "author": "AnonFullPotato",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bp4xl/too_late_2015/",
        "text": "Watched this little gem on netflix. Its an interesting little indie noir film. Follows a private detective in LA who owns a pontiac firebird XD. The film is quite meta and even has a few subtle 4th wall breaks. Shot on 35mm which is always a big plus. Each act is one big long take which is very impressive for this budget of a movie. This first act's take was a bit... amaetur but its easily forgiven. The acting and dialogue are stellar. Ive heard comments are about the ending some say it was poor. But I thought it was quite sweet and if you get wrapped up in the film its certainly an excellent ending. There are alot of cliched ham and camp but its intentional and well mannered.   \n\n\nIve always love films like this that portray fiction as stylized fiction. Its obvious surreal enough to be a stylish movie but its still grounded enough in reality. It knows its a film and contributes to the art accordingly and respectively. ",
        "created_utc": 1535676814,
        "upvote_ratio": ""
    },
    {
        "title": "Wakaranai: where are you?",
        "author": "LiftedDemon",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bom7m/wakaranai_where_are_you/",
        "text": "&amp;#x200B;\n\nI watched this movie recently. I did not found it so good, but it is a pretty sad and I see a clear critic to the animalization that capitalism causes on men (with the scenes of him eating or saying that \"adults just care for money).\n\nIt is a pretty unknown movie for what I know about it, but althought it's not the best one I've seen these past months, I liked it, there's not much going on during its lenght, not even with dialogues, but all these are intentional, it serves for you to know more about the character and put yourself on his shoes, which may not be fun, but is effective.\n\nHave any of you seen it?",
        "created_utc": 1535672453,
        "upvote_ratio": ""
    },
    {
        "title": "Wakaranai: where are you?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bol23/wakaranai_where_are_you/",
        "text": "[removed]",
        "created_utc": 1535672192,
        "upvote_ratio": ""
    },
    {
        "title": "10 years later: Christopher Nolan's The Dark Knight",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bohv3/10_years_later_christopher_nolans_the_dark_knight/",
        "text": "​\n\n[10 years ago Nolan made a modern classic](https://i.redd.it/1mok11qzdbj11.jpg)\n\n**S**uperhero movies suck most of the time. They’re usually a special brand of generic that tell paint-by-number wish fulfillment stories yet also deviate from the source material so much it actually loses a lot of the original appeal of a property. There are certainly exceptions to the previous statement, but that is the norm. That was what was expected even way back in 2008 when Christopher Nolan released his sophomore installment on the Batman franchise: *The Dark Knight*.\n\n[The Dark Knight](https://thefilmera.com/2018/08/30/the-dark-knight-2008/) obviously was much more than that. Instead of generic fantasy, Nolan opted to use the crime genre as a storytelling structure and use the superhero aesthetic and grandiose thematic elements to tell a compelling morality tale that makes or breaks our characters. Superheroes are just characters; the comic panel is not too different from a film frame. Adaptation is more than possible between the two mediums. In fact, the translation can become an artistic triumph unto itself. Basically, a comic book movie can have its cake and eat it too.\n\n*Batman Begins* wasn’t too different from the norm back in the day. It was an entirely different approach from the awful *Batman &amp; Robin* – where the toys produced for the film were less plastic than the performances – but it still featured an origin story and a simplistic character arc and everything you’d expect. What was nice about *Batman Begins* were the hints towards depth. Batman’s character is actively explored in Bruce’s relationship with Rachel and his relationship with Ra’s Al Ghul. Still, it was trapped in explaining the League of Shadows and how Gotham worked as a city. It felt good, but it was begging for a sequel to expand.\n\nThere are no ninjas in *The Dark Knight*.\n\nInstead we have a rounded cast of characters that don’t need to be explored explicitly, but explored through action. This is really what makes Joker a good antagonist. Ignoring the amazing performance, ignoring the brilliant design, what’s important is the Joker’s function in the story; the Joker puts everyone’s moral philosophy through the ringer and by the end of the film we see who falls apart and who remains.\n\n*Batman Begins* had a final scene that was focused on escalation. Batman as a character meant the evolution of justice, but what’s the evolution of crime? *The Dark Knight* immediately starts with introducing the Joker as a proper antagonist. We see his plan, we see his goons whisper about him, and we see the Joker win big at the end of it.\n\nThen we see how Gotham has transformed since Batman has become a force for good. Criminals are scared to go out at night and everyone seems to be breathing a little easier. The predominant crime family of Gotham has fallen and now there is a power vacuum barely being held together by the Maroni crime family. A young lawyer named Harvey Dent is also a public face for justice. Harvey, Batman, and James Gordon team up to take on the rest of organized crime. This ongoing story is the major crime part of the film and it’s based on the graphic novel *The Long Halloween*. It’s not a direct adaptation. They took the best of the comic and dropped everything else. *The Long Halloween* was Two Face’s best origin story; a story that best gives the reader a sense of Batman, Gordon, and Harvey’s relationship. The ending was a cautionary tale, rather than a stupid origin about a guy obsessed with the number two.\n\n​\n\nThe Maroni family is trying to hoard their remaining money together and hire the Joker to kill Batman. The second biggest comic book influence of the film is *Batman #1 (1940)*, the Joker’s original appearance. Many of Joker’s actions are ripped right off the page, and what’s not explored in either comic or film is Joker’s backstory. We know nothing about what the Joker’s personality or background is; all we know are his motivations. This makes him scary and actively enabled Ledger to be energetic and creative. Ledger has momentum and magnetism. His color draws the eye and the audience is glued to everything he says. The Batman in contrast is a black hole, a solid structure as unflinching as the institutions and world he fights for.\n\nThe supporting performances also deserve to be highlighted. Caine elevated the role of Alfred beyond a support line and became the de facto parental figure. His wisdom haunts the film and guides Bruce when he’s most lost. Gyllenhall’s performance as Rachel goes beyond Holmes’s shallow girl-next-door. Rachel in this film creates a fascinating dynamic between Bruce Wayne (not Batman) and Dent. The romantic triangle isn’t really a rivalry; it’s more like a vague future both characters are married to until their illusions shatter. Oldman’s Gordon is an essential part of the franchise and is perhaps the most human aspect of the films. A workaholic father that struggles to do everything right and fails is not only a person we can relate to, but neither his morality and nor performance carry any epic tones and can be easily grasped. Gordon is what we all would try to be.\n\nZimmer’s score and Nolan’s editing go along with the previously mentioned concept of escalation. Tension rises constantly throughout the film. The violins feel like they’re being cut with razors until Batman explodes onto the scene with a suspenseful brass in a genre usually dominated by triumphant brass.\n\nLooking at other *Batman* directors, Zak Snyder and many others would mistake tone for depth alone. The realistic grit of the Nolan trilogy is not why people actually like these films. The tone merely enabled the audience to take the characters seriously. The removal of camp from the Batman franchise disarmed viewers. This is not a substitute for substance. Nolan delivers on substance, directors like Snyder and Burton did not, though sometimes they made a pretty shot.\n\nOther complex themes addressed in the film have to do with Batman and the Joker as core philosophies: fascism and anarchy. It’s hard to use the word fascist without certain historical imagery called to mind, but disregard that and instead consider Batman’s modus operandi: he believes order and peace are necessary and is achieved through violence. This applies from the bottom to the top, whether he’s punching the thug trying to steal food to punching the mob boss that owns the city. Batman as a fascist has been discussed extensively and is easiest to understand in the landmark graphic novel *The Dark Knight Returns*. Batman’s role as a fascist protector is put into a modern, post-9/11 context. Batman’s surveillance of the city at the end of the movie calls back to the Patriot Act and how our government compromised our liberties for the sake of security. Batman’s fascism and order is questioned and tested by the Joker’s own philosophies. The Joker thinks human nature is ultimately selfish and the trappings of social order are fallacies. This assertion that morality is relative and can buckle under pressure is the ultimate critique of fascism, or justice or society at large or whatever you see fit. The film is flexible like that.\n\nI recall a Superman comic’s answer to the riddle “What happens when an unstoppable force meets an immovable object?” The answer is “They surrender.” The Joker does not surrender; Batman does. Batman compromises his morality with his use of surveillance, and then surrenders his ego by falsely confessing to the murders. This is what it costs to win: a sacrifice of the self that ultimately justifies order and humanity.\n\nThe movie is also funny. Despite what people think, the Joker makes jokes all the time. Bruce Wayne as a public persona is funny. Both Lucius Fox and Alfred’s little quips are comedic. All of these lighter elements help with the suspense and general pacing of the film. They allow the film to breathe.\n\nThe action scenes are fantastic, too. This is also enabled by the superhero genre, which is at its best when the action utilizes the character. Batman blends into the shadows; he is brutal; he flies through the air gracefully. The motorcycle scenes give an intense feel of speed and the way the cape shapes around the back is beautiful. The film emphasizes practicality here, another reason why realism worked. Batman’s suit now enables Bale to turn his head and properly move his limbs, creating much more engaging combat than ANY Batman films before or after the use of this suit. The scenes Nolan created for IMAX also suit the average film experience. Films rarely feel this special.\n\nSo, what’s bad about the movie? Man, I don’t know. I’ve spent the last ten years of my life watching this film in awe. I can go on and on about how good it is, and the only real problem I have with it is I don’t like the dubbed line the cop gives when he arrests the Maroni gang: “Have a nice trip, see you next fall.” Amateur hour, Nolan. Two stars.\n\nif you like what you read support the writer at :[https://thefilmera.com/2018/08/30/the-dark-knight-2008/](https://thefilmera.com/2018/08/30/the-dark-knight-2008/) we are a small independent film site that is always eager to learn. Thank you",
        "created_utc": 1535671499,
        "upvote_ratio": ""
    },
    {
        "title": "Do you get upset when someone doesn't like a movie you love?",
        "author": "modest811",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bmkdo/do_you_get_upset_when_someone_doesnt_like_a_movie/",
        "text": "[removed]",
        "created_utc": 1535656190,
        "upvote_ratio": ""
    },
    {
        "title": "A question about In the Mood for Love (2000)",
        "author": "verysexycaterpillar",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bm3hx/a_question_about_in_the_mood_for_love_2000/",
        "text": "[removed]",
        "created_utc": 1535652978,
        "upvote_ratio": ""
    },
    {
        "title": "See how some of the most insane movie makeup effects are made",
        "author": "Mtime065",
        "url": "https://youtu.be/ANsYU0Z_-sc",
        "text": "",
        "created_utc": 1535639945,
        "upvote_ratio": ""
    },
    {
        "title": "I created a Discord server for movie lovers! \"The Movie Fanatics Club\", want to join?",
        "author": "AndryX7",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bipmz/i_created_a_discord_server_for_movie_lovers_the/",
        "text": "[removed]",
        "created_utc": 1535627750,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for an extensive list of must watch or classic films",
        "author": "oxiarr",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bhqmz/looking_for_an_extensive_list_of_must_watch_or/",
        "text": "[removed]",
        "created_utc": 1535616596,
        "upvote_ratio": ""
    },
    {
        "title": "What are some great films made possible by a GROUP as opposed to an auteur?",
        "author": "aormiston",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bhaug/what_are_some_great_films_made_possible_by_a/",
        "text": "In my mind, so many of the greatest and/or most revolutionary films of all time seem to come from auteurs like Welles, Kurosawa, Kubrick, PT Anderson, etc. This is interesting to me because film is necessarily more collaborative than many other artistic mediums like, say, painting or writing, which are inherently not highly collaborative at all.\n\nWhat are some counter examples here? What are some groundbreaking or important films that were made possible because the right group came together and elevated each other's ideas/work?",
        "created_utc": 1535611438,
        "upvote_ratio": ""
    },
    {
        "title": "I just watched Eyes Wide Shut for the 3rd time, and find myself understanding more but understanding less at the same time.",
        "author": "wayofthefrog",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bgl1e/i_just_watched_eyes_wide_shut_for_the_3rd_time/",
        "text": "I'm not the best when it comes to in-depth film analysis, but I like to think I'm somewhat perceptive when it comes to themes and symbolism these days. I noticed a very chilling theme of infidelity and jealousy running through Eyes Wide Shut. It raises some interesting questions about the nature of human sexuality, relationships and love.\n\nAnyway, there are 2 scenes I'm having a problem understanding, and maybe you guys can offer some interpretations of your own. There's this scene right after the night Tom Cruise trespasses on the party where he's trying to find his friend-the pianist who let him know the party existed and gave him the password. He arrives at the hotel his friend was staying at and asks the hotel attendant about him. The hotel attendant is a pretty flamboyant and seemingly gay man that seems to be attracted to Tom Cruise, and I'm wondering if this had anything to do with the themes of this movie, or just what it could mean, or if it's just the personality quirk of this one side character and doesn't have much significance.\n\nThe 2nd scene is when he returns the outfit he used to crash the party from the eccentric party store owner who busted 2 men from having sex with his apparently underage daughter and threatened to call the police on them. The scene ends before we see whatever happened to the 2 men, but the police were evidently not involved since they can be seen walking out of the room after the girl (who's in her underwear), thanking the man, and leaving. After doing so, Tom Cruise finishes paying for the outfit, and the man seemingly offers Tom Cruise's character that he can pay for sex with his daughter. I can't for the life of me think of what this has to do with the main idea of the movie, and just seems like a random thing to do.\n\nAny thoughts and interpretations are appreciated.",
        "created_utc": 1535603850,
        "upvote_ratio": ""
    },
    {
        "title": "Josie's choice in 2018's Annihilation to let her old self die and become something new is incredibly beautiful and helped convince me to transition~",
        "author": "WiscSissySaving4Op",
        "url": "https://www.youtube.com/watch?v=eyGK-25Z248",
        "text": "",
        "created_utc": 1535596292,
        "upvote_ratio": ""
    },
    {
        "title": "David Mamet's Negative Review of Schindler's List",
        "author": "Severian_of_Nessus",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bf45g/david_mamets_negative_review_of_schindlers_list/",
        "text": "I'm curious what /r/truefilm thinks about Mamet's opinion, considering he is one of the finest screenwriters working today. I think Schindler's List is one of Spielberg's best films, but at the same time, I can definitely see Mamet has very valid points against it.  \n\n&gt;And I do not like \"Schindler's List\". It is to my mind \"Mandingo\" for Jews. \"Mandingo\" was a slave epic made for those interested in watching well-built black men being mistreated. \"Schindler's List\" is another example of emotional pornography.\n\n&gt;It is not the Holocaust we are watching. It is a movie, and the people in the film are not actually being abused, they are acting out a drama to enable the audience to exercise a portion of its ego and call that exercise \"compassion.\" \"Schindler's List\", \"Dances With Wolves\", \"Gentleman's Agreement\" - these films show a member of a dominant culture who condescends to aid those less racially fortunate than himself - who tries to save them and fails, thereby ennobling himself and, by extension, his race. This comfortable theme is more than a sham - it is a lie.\n\n&gt;The New York Times has the charming habit of decrying the latest yellow journalism excess on the op-ed page. In the tabloids we find the scandal on page 1. In the Times we find it on the op-ed page. \"Is it not deplorable,\" they opine, \"that we are deluged with coverage of the _________ scandal; with facts like the following...\"\n\n&gt;Similarly, \"Schindler's List\", ostensibly an indictment of the German murder of the Jews, is finally, just another instance of their abuse. The Jews in this case are not being slaughtered, they are merely being trotted out to entertain. How terrible. For, finally, this movie does not \"teach,\" it does not \"reach a great number who might otherwise be ignorant of this great wrong.\" It is not instruction, but melodrama. Members of the audience learn nothing save the emotional lesson of all of melodrama, that they are better than the villain. The very assertion that the film is instructive is harmful.\n\n&gt;It is destructive. The audience comes to the theater in order to, and leaves teh theater feeling they have looked down on actions that they have been assured - this is the film's central lesson - they would never commit.\n\n&gt;This \"lesson\" is a lie. The audience is not superior to \"Those Bad Nazis.\" Any of us has the capacity for atrocity - just as each of us has the capacity for heroism.\n\n&gt;But the film panders to the audience. It invites them (as does any melodrama) to reward themselves for Seeing That the Villain's Bad; and, in the Liberal Fallacy, of feeling this perception is a moral accomplishment.\n\n&gt;The mechanism of \"Schindler's List\" is that of \"If you can't pay the rent, then I will tie your daughter to the train track.\"\n\n&gt;The Nazis are the waxed-mustachioed villain, and the Jews are the daughter. The film is as far from philo-Semitism as concern for the girl on the tracks is from feminism. \"Schindler's List\" is an exploitation film.\n\n",
        "created_utc": 1535591069,
        "upvote_ratio": ""
    },
    {
        "title": "Someone on r/Movies said you guys might like this, I'm in Paris for a few days so decided to try recreate the final scene from Jean-Luc Godard's \"A Bout De Souffle\"",
        "author": "[deleted]",
        "url": "https://i.redd.it/90a141wn53j11.jpg",
        "text": "[deleted]",
        "created_utc": 1535571742,
        "upvote_ratio": ""
    },
    {
        "title": "Conventional films.",
        "author": "The_First_Order",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bc721/conventional_films/",
        "text": "[removed]",
        "created_utc": 1535569509,
        "upvote_ratio": ""
    },
    {
        "title": "DAVID FINCHER: A Visual Virtuso",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9bakwn/david_fincher_a_visual_virtuso/",
        "text": "&amp;#x200B;\n\nhttps://i.redd.it/iffkgox232j11.jpg\n\nYesterday was David Fincher's birthday.\n\nThere are more than 50 images and gifs involved, along with his top 5 scenes so I figured linking you guys would work. Below is the opening of the article.\n\n[https://thefilmera.com/2018/08/28/david-fincher-a-visual-virtuoso-top-5-scenes/](https://thefilmera.com/2018/08/28/david-fincher-a-visual-virtuoso-top-5-scenes/)\n\n​\n\n&gt;*“Some people go to the movies to be reminded that everything’s okay. I don’t make those kinds of movies. That, to me, is a lie. Everything’s not okay.”*\n\n**T**he gruesome killings of a zealous serial killer in *Se7en;* a tapestry of betrayals in *The Social Network;* a provoked psychopath hell-bent on taking revenge in *Gone Girl*; true stories of a serial-killer depicted with daunting details in *Zodiac;* a rapist in power taking advantage of devastated girls in *The Girl With Dragon Tattoo;* a tragic look into the psychology of serial killers in *Mindhunter;* and an insomniac on the loose in *Fight Club* are only a glimpse of Fincher’s fascination with making you uncomfortable.\n\nAfter watching the making of *Butch Cassidy and the Sundance Kid* when he was only eight years old, Fincher knew that he wanted to be a director. He worked in at Industrial Light and Magic (ILM) for two years as an assistant cameraman. Making the smoking fetus for the American Cancer Society put him on the spotlight, so the next step for him was directing commercials and music videos, which lasted for seven years. Fincher went on to establish Propaganda, the biggest music video company in Hollywood. The young, naïve Fincher kicked off his film career by being at the helm of *Alien 3*. The disdain he has for this film borders on comedy: “I was sodomized ritualistically for two years. There is no one problem with a 65 million dollar fucked-up first-time filmmaking. I made a crucial error of listening to the people who were paying for the movie”.\n\n&gt;*“Films are not finished; they’re abandoned”*\n\nYou can get an inkling of Fincher’s perfectionism in that quote. He’s famous for numerous takes. The reason for which is to get rid of the actors’ earnestness, a process that involves going beyond muscle memory. “Usually by take 17 earnestness is gone. I want you (the actor) to know exactly where to sit in that chair, I want you to be really comfortable. You come in and you throw your coat on couch. When you have done that 15 times, it starts to look like you live there. Conversations between two twin brothers that are supposed to overlap, they have to get to a point that not only they can finish each other’s sentences, but they are finishing each other’s sentences, so you have to make the actors jump in at the right point. I’m always watching for first, the technical, then the believable and then, I’m looking for the connection”.\n\nPerfection lies in details. Thanks to his experience working at ILM, Fincher is well-versed in visual effects and CGI. He employs them to service the story, not to impress. Consider the [**long take of** ***Panic Room***](https://www.youtube.com/watch?v=_Qh7jFJ6zWw). The omniscient camera travels the whole geometry of the scene while giving you other crucial details in only a couple of minutes. You get an idea of the distance between protagonists and antagonists. You see how they break into the house and you can see their escape routes. In *Zodiac*, a period film, he uses visual effects to double down on historical authenticity, achieving the highest possible detail. There are innumerate instances that are beyond the scope of this article, so I recommend [**this** ](https://www.youtube.com/watch?v=QChWIFi8fOY)video for those interested.\n\n&gt;*“In film, we sculpt time, we sculpt behavior, and we sculpt light.”*\n\nFincher synchronizes the camera with the behavior. The character moves; the camera moves. The character stops; the camera stops. The character runs; the camera runs. Character slows down; the camera slows down, and so on.  This is the fulcrum of his direction, which benefits from numerous takes.\n\n​\n\n[https://thefilmera.com/2018/08/28/david-fincher-a-visual-virtuoso-top-5-scenes/](https://thefilmera.com/2018/08/28/david-fincher-a-visual-virtuoso-top-5-scenes/) warning heavy image use",
        "created_utc": 1535558575,
        "upvote_ratio": ""
    },
    {
        "title": "Films which show the Mafia's dislike of violence? And focus on their shrewdness?",
        "author": "StephenKingIsADrunk",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b9vw7/films_which_show_the_mafias_dislike_of_violence/",
        "text": "It might be counter intuitive to how Hollywood portrays gangsters but many of the most successful gangsters  despised overt violence and brutality (which brought police attention).  Meyer Lanksy who was worth over $180 million preferred very much to use brain over brawn (why they had Joe Pesci who generally plays short violent thugs as him in one film I will never know). Frank Costello also known as the 'Prime Minister of the Underworld'  (although the Don of Dons doesn't exist, Frank Costello would be one if they did) deliberately avoided carrying a gun and tried to use negotiation.  Of course all of these had countless underlings to do their dirty work for them.\n\nOne film depiction I like is in The Client (1994) where  boss Johnny Sular (played by Ron Dean who himself had been a criminal in real life and was also in the Dark Knight Batman film, not bad for someone who was arrested for murder when he was younger) eventually gets tired of his nephew Barry The Blade's sadism and violence and plans to have him bumped off (you don't see this but it is heavily implied).\n\nThe Firm (1993) has this where two Mafia brothers are persuaded by reason to help the protagonist when they find out that they themselves have been being ripped off. Instead of just killing the protagonist they realise it is better to go along with non-violent means and co-operate in the legal investigation.\n\n​\n\nAny more films like this where it shows a more subtle Mafia approach rather than tortures and murders?\n\n&amp;#x200B;\n\nEdit: I just clarify I am not trying to glorify the Mafia in anyway. They are horrible, awful people who destroy lives, I would just like recommendations of films which show a more subtle and insidious approach by the Mafia instead of blood and guts.\n\n​\n\n​",
        "created_utc": 1535553814,
        "upvote_ratio": ""
    },
    {
        "title": "The Biblical Narratives of Darren Aronofsky",
        "author": "KirbyYardley",
        "url": "https://www.youtube.com/watch?v=K-9TptsTrr4",
        "text": "",
        "created_utc": 1535552905,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (August 29, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b9n31/casual_discussion_thread_august_29_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1535552046,
        "upvote_ratio": ""
    },
    {
        "title": "The Beautiful Sadness in Chungking Express",
        "author": "HairyDavid",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b83bp/the_beautiful_sadness_in_chungking_express/",
        "text": "Since watching this film around three years ago, it's still my reigning favorite movie of all time.\n\nSpoilers ahead.\n\nI could go on and on about this movie, it's just... sometimes you feel like a movie was made just for you, you know?\n\nEven though it was made in the 1990s, it feels timeless.  Nothing, aside from perhaps the lack of cell phones and how high some of the pants are on the characters screams dated.  \n\nI love how universal, yet international it is.  The setting is exotic, being located near the Chungking Mansions, a \"colorful\" apartment complex that's a bit sketchy (at least at the time of filming), near a popular fast food restaurant, and the world's longest outdoor escalator.  It's set in Hong Kong, which even by itself is an interesting setting as it's a mix of all nationalities, an international city.  \n\nAnd despite the characters being Chinese, their emotions and struggles translate.  He Qiwu has been dumped, and is obsessed over his dead relationship.  He buys a can of pineapple with an expiration date of May 1st every day for the month of April, reasoning to himself that he can will his relationship back to the brink.  Instead, he ends up eating so much pineapple as to make himself sick and gets drunk with a strange woman he'll never see again.\n\nCop 663 is also dealing with heartbreak.  Although he suspects his relationship is over as well, he delays in opening a \"Dear John\" letter in order to tread water and drag out the truth.  As someone who habitually delays in dealing with unpleasant realities in my own life, this was scarily relatable.  \n\nFaye is a proto-Manic Pixie Dream Girl, who nevertheless elevates that title partially by predating it.  She's obsessed with California and longs to travel the world and escape her dreary reality of working her uncle's food stand, but she also finds herself drawn to Cop 663, becoming involved in his life and breaking into his apartment as he works and slowly rearranging and redecorating his things.  \n\nThe film ends on an ambiguous note.  When Cop 663 finally asks Faye out, he's informed that she's impulsively taken a job as a flight attendant and is in California.  He later buys the food stand her uncle owned, and is fixing it up when she returns.  He reveals he kept his boarding pass, and asks her to make a new one.  \n\nI never really know what to make of the ending.  On the one hand, Faye indeed begins writing a new \"boarding pass.\"  However, in Kar Wai's filmography happy endings are something of a rarity.  Rewatching it on YouTube just now, she seems a little standoffish, maybe bitter that it took Cop 663 so long to notice her, or perhaps changed from all of her travels.  To me, it seems unlikely for her to settle back down in Hong Kong with him.  \n\nVisually, it's amazing.  Doyle is my favorite cinematographer.  The mood, the lighting, the handheld camera shots (which I'm normally not a fan of).  It makes being alone in a 24-hour city romantic.  I even like the ending credits of black text on white background, even that evokes something different.\n\nThe dialogue has some great choices as well.  I'll never forget Qiwu talking about how he jogs until all the water in his body is evaporated so he has nothing left to cry with.  Heartbreaking.\n\nThis is a romantic movie.  It's not a romantic movie in the sense that the characters all end up with significant others and there's a wedding at the end.  It's romantic in the way that even cold-blooded smuggler/killers can feel sympathy to strange lonely young men.  It's romantic in the way that, even in the midst of a depression, you can have a life filled with beauty and not even realize it, as Cop 663 does when he is completely blind to the beautiful and quirky countergirl who is remodeling his entire life out of nothing but unspoken love for him.  And though parts of this movie are sad (namely the first story and arguably the ending of the second), it's never depressing, it's never dour or bitter.  Oddly, the best way to describe it is said by [Butters](https://www.youtube.com/watch?v=X-7558NYtwY) from *South Park*.\n\nAnd since I've seen that movie, I've traveled around Asia, and I think it's themes have hit me even more.\n\nI'd love to hear other thoughts on this movie, as well as recommended movies with a similar \"feel,\" and reading recommendations.  I myself was shown some articles on [The Dissolve](https://thedissolve.com/features/movie-of-the-week/216-keynote-chungking-express/).",
        "created_utc": 1535538777,
        "upvote_ratio": ""
    },
    {
        "title": "Will Crazy Rich Asians actually do anything for Asians in Hollywood?",
        "author": "keeplers",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b7vkm/will_crazy_rich_asians_actually_do_anything_for/",
        "text": "It’s been fun to see perhaps the biggest jump in Asian representation in American media in a while with the likes of Crazy Rich Asians, To All the Boys I’ve Loved Before, and Set It Up. But the author of CRA had to sell the rights for $1 to make sure it was made with an all asian cast. TATBILB author said only one production company agreed to make the main character asian. And Lucy Liu is already a big name. (And special shout-out to Searching.)\n\nWith that being said, what does the success of these mean for asian actors? Will there be more Asian led projects or is this time an anomaly?",
        "created_utc": 1535536505,
        "upvote_ratio": ""
    },
    {
        "title": "What’s your favorite film related book?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b78bh/whats_your_favorite_film_related_book/",
        "text": "[removed]",
        "created_utc": 1535528900,
        "upvote_ratio": ""
    },
    {
        "title": "I've never seen 2001: A Space Odyssey. Should I see it in IMAX this week",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b5qwn/ive_never_seen_2001_a_space_odyssey_should_i_see/",
        "text": "[deleted]",
        "created_utc": 1535513438,
        "upvote_ratio": ""
    },
    {
        "title": "Just came back from an IMAX viewing of 2001. My thoughts on the AV",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b5khr/just_came_back_from_an_imax_viewing_of_2001_my/",
        "text": "[deleted]",
        "created_utc": 1535511862,
        "upvote_ratio": ""
    },
    {
        "title": "Twin Peaks: Fire Walk With Me premiered in the U.S. 26 years ago today",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b57sf/twin_peaks_fire_walk_with_me_premiered_in_the_us/",
        "text": "​\n\n[Twin Peaks: Fire Walk With Me](https://i.redd.it/7tb3o2wfyxi11.jpg)\n\n​\n\n[Today is the 26 anniversary of Twin Peaks: Fire Walk With Me](https://thefilmera.com/2018/07/30/twin-peaks-fire-walk-with-me/)\n\n​\n\n[Listen to this theme before reading](https://www.youtube.com/watch?v=3hOERnIuvbg)\n\n​\n\n# Donna: Do you think that if you were falling in space... that you would slow down after a while, or go faster and faster?\n\n# Laura: Faster and faster. And for a long time you wouldn't feel anything. And then you'd burst into fire. Forever... And the angel's wouldn't help you. Because they've all gone away.\n\n# \n\n**P**requels have a strict formula. They set up the stories we already love and play into what we loved about them. The idea is to capture everything that worked in a capsule and translate its formula into an origin story. *Twin Peaks: Fire Walk with Me* breaks the formula entirely. It does not offer any particular fan service or feelings of comfort, like how you feel when you’ve returned home after a long stint somewhere else. Instead, it’s steeped in unease and provides an entirely new series of questions about *Twin Peaks*.\n\n​\n\nIt does not show nostalgic love for the two seasons of *Twin Peaks* that preceded it. In the opening shots, a television goes to static and is promptly cut down with an ax. This is an artist declaring their work dead and saying the process was final. David Lynch created television that broke all of the rules and now he is destroying actual televisions, telling us something of his intent here.\n\n*Fire Walk with Me* is a difficult movie to come to grasps with. It initially opened to sour and confused reviews. Why would you expand this wonderful universe and throw out everything that works? Its first forty minutes don’t even take place in Twin Peaks but another town, Deer Meadows, which is inflicted with the same spiritual evil. It doesn’t even star Twin Peak’s beloved Agent Cooper (Kyle MacLachlan). Critics were confounded by its release: why create such a non-sequitur off on its own tangent, and maybe inside its own nightmare, when working within a version of a popular television show?\n\nThe reason is that this is the show that Lynch wanted to create. It took me many tries to get to the truth or to convince myself that this was an underrated masterpiece. In fact, the movie got better with every repeat viewing, a bold acquired taste – like the best coffee blend – that grows with you and alongside you and reveals its depth and weight as you accept loving it on its own terms.\n\nThe other thing about *Fire Walk with Me* is that, as separate and weird as it can be, it’s an essential component to understanding the universe. I think it has improved dramatically now that it has been connected to the recent *Twin Peaks: The Return*. This has to be cause for reappraisal. It’s now a central motivating part of the universe and made more valuable by new association. Where it was once an odd preface to a disconnected TV show, it’s now a pivotal piece of required viewing to understand where everything comes from.\n\nThis is Laura Palmer’s (Sheryl Lee’s) movie. It’s the manifesto of her troubled life showing how things got to be so bad. Where she was only an ethereal beauty, distanced from time and place before, she is now central, moving toward a death we all know about; we can cringe as we watch her demise. Even if we hadn’t known, her fate is spelled out in plain letters. There is already a spirit of death inhabiting this once sweet high school girl.\n\nSheryl Lee gives an inspired performance. It’s clear at every turn she’s given herself entirely to the production. She brings a brilliant energy to the film. Where she was once only the premise, she is now the movie and it almost certainly benefits, as she turns in several of the finest scenes to come out of *Twin Peaks*.\n\nEven if you’ve gone through it before, it’s time to give *Fire Walk with Me* its reappraisal. Now that it is a central foundation to the new show, it will require a couple hours of your attention anyway if you want anything like a complete understanding of what is going on. And it’s a special prequel, once again breaking every role of form.\n\nOur initial viewing may have been startling. *Fire Walk with Me* is a rejection of what has come before and what we expect from this kind of outing. Try to get on the same wavelength and its genius will slowly seep out. Just like Laura Palmer, we must enter the painting to understand the darkness of our world.\n\nif you liked this writeup check us out at [https://thefilmera.com/](https://thefilmera.com/) we are a small independent film coverage site writing about what we love. ",
        "created_utc": 1535508978,
        "upvote_ratio": ""
    },
    {
        "title": "I've never seen 2001: A Space Odyssey. Should I see it in IMAX this week?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b51fp/ive_never_seen_2001_a_space_odyssey_should_i_see/",
        "text": "[removed]",
        "created_utc": 1535507545,
        "upvote_ratio": ""
    },
    {
        "title": "Everybody wants to be Wong Kar Wai",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=IavNWdbNlqs",
        "text": "[deleted]",
        "created_utc": 1535503068,
        "upvote_ratio": ""
    },
    {
        "title": "Adam Wingard's Death Note is the Starship Troopers of the 21st Century",
        "author": "TheMovieDoctorful",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b4flk/adam_wingards_death_note_is_the_starship_troopers/",
        "text": "(I actually think Showgirls is the superior satire to Starship Troopers, but Starship Troopers is more popular and attention grabbing a comparison.)\n\n&amp;#x200B;\n\nGreat satire is rarely recognized in its own time. That goes double when said satirical material is genuinely ambitious and technically impressive. That goes triple when said satirical material is an adaptation of a beloved IP. Films like Basic Instinct, Starship Troopers and the especially reviled Showgirls were met with mass critical panning on release, it wasn't until over a decade later that they would gain appreciation from the critics who once slammed them. So it makes sense that the initial reception to Adam Wingard's Death Note is almost universally negative. However, much like the reception of the aforementioned films, the critics and audiences are again wrong. Death Note is the most clever, interesting, well made and misunderstood social critique since Showgirls and easily the most underrated film of 2017. Furthermore, I would make the argument that the film is actually superior to the anime in which it is based on, which unintentionally fed the juvenile power fantasies of too many a teenage boy.   \n\n\nUnlike Light Yagami, the unironically edgy and seemingly invulnerable Gary Stu of the anime, Nat Wolff's Light Turner possesses a genuine pathos. The arrogance and narcissism of his anime counterpart are still present, but Wolff imbues the character with a deep insecurity and sensitivity that Yagami never had. The screenwriters never make the mistake of justifying Turner's God complex; he's a selfish, naive teenager in way over his head. Light Turner is not only an effective allegory for entitled and pathetic school shooter youth a la Elliot Rodger, but for every mouth-breathing, edgelord fanboy of the anime who unironically idolized Light Yagami; unsubstantial, pretentious, vulnerable and cowardly. Light Turner is simultaneously amusing and tragic, as is his narrative downfall.  \n\n\nAnd how fitting it is for a critique of entitled edgelord youth to take Misa Amane, Yagami's obedient sex object from the anime, and transform her into Mia Sutton, the ruthless, manipulative, calculating and intelligent seductress played by Margaret Qualley? (Who makes a hard and convincing case in this film for playing a teenage Poison Ivy in the DCEU.) Qualley steals the show as Sutton, giving easily the best performance in the film as every Yagami worshiper's worst nightmare; an uncontrollable and untameable female force of nature, unfazed by Turner's adoration and unconvinced by his insistence of a moral highground. \"You don't get to feel superior for being a p\\*ssy.\" she tells Light. Qualley's biting delivery perfectly sells the hard truth of her words. At the same time, Qualley's Mia does evoke a genuine sympathy that a lesser actress may not have achieved. She's a character who isn't taken seriously or respected by anyone; not even her supposedly loving boyfriend. While not overplayed, Qualley does an excellent job displaying this disappointment and hurt in Mia in her facial acting.  \n\n\nShea Wingham gives a powerful and nuanced performance as Light Turner's father, Detective James Turner. Fiercely protective of his unworthy son, the inevitability of the collapse of their relationship hangs over their every interaction, even as it seemingly grows warmer over the course of the film. This is the core of truly great tragedy; the certainty of its arrival and the false hopes of the audience that things can end any other way.   \n\n\nLakeith Stanfield does for L what Heath Ledger did for The Joker, what he pulls off is extraordinarily transformative. From his physical mannerisms to his vocal ticks to his subtle facial expressions, Stanfield is an anime character brought to life in glorious fashion. Much like Wolff's Light, Stanfield's L has a real emotional vulnerability and sensitivity that was never present in the anime incarnation. L may be brilliant and eccentric, but he is also breakable and fallible. Capable of being pushed too far. I found him truly fascinating.  \n\n\nFanboys will pine for the ultra-serious and nihlistic tone of the anime. Wingard's Death Note brings self awareness to the material and a brilliant sense of dark humor. The film's gore is increased from the anime to an almost cartoonish degree, straight out of the most ludicrous and over-the-top fantasies of an Eric Klebold or Dylan Harris. Much of the soundtrack almost appears mocking and condescending of Light and his pathetic struggle for mass validation. This is satire at its finest.  \n\n\nThe direction of the film is gorgeous. Much like the aforementioned Showgirls, Wingard uses aesthetic beauty and grandeur as a visual metaphor for the \"All that glimmers isn't gold\" themes of the film. Particularly effective is a scene in which Light is reunited with Mia after discovering her treachery, the beautiful Qualley almost sparkling aside packs of teenagers that may as well be faceless. Qualley's Mia is most enchanting at her most dangerous and independent and the cinematography reflects that. Even more effective is the film's climax on the Seattle Great Wheel, in which Light experiences the grand finale of all his failures and the ultimate cost of his unjustified hubris.  \n\n\nSpeaking of, the climax of Death Note is everything it needed to be. Chicago's \"I Don't Wanna Live Without Your Love\" is hilarious when juxtaposed with Light's deepest low of the film. Conversely, the later image of Light Turner in tears at a hospital bed in light of everything he lost in his misguided quest for validation and godhood is hard not to be affected by (In no small part due to Nat Wolff's outstanding facial acting. \"I thought it was simple at first, I'd just kill all the bad guys and the good guys would win but it wasn't like that,\" he cries, a pitiable and broken mess.)  \n\n\nNetflix's Death Note is easily the most underrated film of 2017 and I firmly believe it will find its audience as a future cult classic. A funny, emotional, tragic and beautiful satirical work that's merely waiting for the fanboy fervor to slow down and critical reappraisal to begin. A much more self aware, and more intelligent, story than the anime and a wonderfully post-modern critique of edgelord and school shooter youth. Paul Verhoeven would have loved Adam Wingard's Death Note. ",
        "created_utc": 1535502629,
        "upvote_ratio": ""
    },
    {
        "title": "Whiplash - Andrew vs Imposter Syndrome",
        "author": "TheUltimateInfidel",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b48nq/whiplash_andrew_vs_imposter_syndrome/",
        "text": "Imposter Syndrome is defined as having feelings of inadequacy despite evident success. It's not when you're a beginner and lacking confidence, it's when you're good enough to get into the best music school in the country but end up feeling like you're simply not good enough to be there. Whiplash is actually a great piece on this.\n\nFirstly, Andrew throughout the film is constantly trying to win the approval of not just Fletcher but the audience as well. He can't communicate to the audience because he doesn't physically exist, so he can't see how an audience might react, especially an audience unfamiliar with playing musical instruments. Fletcher's responses are that brutal and devastating at times because you can tell Andrew is a very talented drummer but his only feedback comes from Fletcher who abuses him during the film. A scene that best demonstrates this is when Fletcher starts slapping Andrew for \"rushing\" or \"dragging\". Assuming the large audience isn't familiar with Jazz, or how Jazz studio bands work, this will likely be jarring because besides the blatant abuse taking place, you see Fletcher doing this because he believes Andrew is fucking up. That being said, you might still be nervous and empathetic if you knew the technicalities surrounding the genre and playing because it's not hard to put yourself in Andrew's shoes, after all, the film does come from his perspective. \n\nSecondly, Chazelle makes a point of letting us hear that audience applaud after Andrew plays for the first time during the final concert sequence. He establishes earlier that they're connoisseurs and Fletcher even mentions that messing up is extremely costly because \"they never forget\". Part of what this scene is meant to show is that Fletcher doesn't think that Andrew is good enough regardless of the audience's reaction, and on top of that, we don't actually see the theatre audience's reaction at the end of the film after Andrew carries on drumming. A centrally aligned audience taking Andrew's side would already likely be as blown-the-fuck-away by his drumming as I was, especially as it continues but clearly, Andrew doesn't think he's good enough yet, especially not enough to win Fletcher's approval, which his personal pride rests on. Remember, Andrew can't see how we react and Imposter Syndrome negates how the afflicted percieves positive criticism, as they still don't see themselves as good enough, good enough for him is making Fletcher happy. Andrew doesn't care that he injures himself, he's \"not good enough\". \n\nNow, I could debunk myself here and point out that the dinner scene with his family and familial friends shows how Andrew clearly thinks he's great, and better than others still but I'd argue this is just self-delusion where he's trying to convince himself he's good enough by comparing his achievements to others. Andrew doesn't have any friends, and the people he knows who aren't related to him hate his guts, so he can't get any reassurance. That's part of why the film is so brilliantly brutal and intense; the film regularly reminds you that Andrew is killing himself and is nearly driven mad by his desire to be \"good enough\" by another standard. That's why it seems so batshit insane when Andrew crawls out of his wrecked car to go to on-stage to play drums, even when he's losing blood and his hands are injured. \n\nOn top of this, a common symptom of Imposter Syndrome is feeling like a fraud, or a fake, as I had mentioned earlier. If Andrew is a reliable narrator, which is dubious because of his declining mental state throughout the film, then it is true that Fletcher made a point out of Andrew only being selected by being stumbled upon by chance, and because other people were fucking up so much. If Andrew is an unreliable narrator, then it's that particular scene that becomes so much more important when relating the film's narrative to Imposter Syndrome because it confirms what the audience is most likely to think, which is that Andrew is more than certainly good enough.\n\nHowever, to counter my own points, the final shot of the film shows a gold light shining down on Andrew, as if to say he has actually become the best, and he does start smiling while playing. Fletcher also already admits during a calmer point in the film that he was just using the other drummers to force Andrew to play better out of fear that he might lose his part. The latter bit could still be used to prove my point about Imposter Syndrome though because at that point in the film, Andrew's mental and physical health had improved substantially, meaning he might actually have started to overcome Imposter Syndrome at that point in the film, with the climax being the \"necessary cure\" for it.\n\nWhat do you guys think? I only finished watching the film an hour ago, and I feel like I could delve in a bit more and talk about specific shots and recontextualise it post La La Land.",
        "created_utc": 1535501026,
        "upvote_ratio": ""
    },
    {
        "title": "TIFF 2018 Must Sees/Suggestions?",
        "author": "NecroSpace",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b3gtk/tiff_2018_must_seessuggestions/",
        "text": "So last year tiff was great, and had gotten many good suggestions here. So just wondering what you guys are looking forward to as I need to compile a list of films I need to see. So far I got John F. Donovan, Roma, Shoplifters, If Beale Street could Talk, Peterloo, mid90s, Ash is Purest White, Burning. Also some interesting return of classic franchises like Predator and Halloween, which seem interesting as well. There's a lot of films, and like last year I'm kind of overwhelmed. I don't wanna miss out on some hidden gems, as there are lots of promising indie/foreign films from returning directors and new talent. I'm quite interested in what this year has to show, and since I'm in Toronto it's gonna be a blast. I also wish the new scorsese film premiers next year at Tiff.  \n",
        "created_utc": 1535495150,
        "upvote_ratio": ""
    },
    {
        "title": "TIFF 2018 Movie Suggestions/Must See",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b3fmj/tiff_2018_movie_suggestionsmust_see/",
        "text": "[removed]",
        "created_utc": 1535494893,
        "upvote_ratio": ""
    },
    {
        "title": "Is anyone on this sub attending the 2018 Telluride Film Festival",
        "author": "PeePeeCat",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9b3fbo/is_anyone_on_this_sub_attending_the_2018/",
        "text": "[removed]",
        "created_utc": 1535494829,
        "upvote_ratio": ""
    }
]