[
    {
        "title": "What are some ways to stay mentally sharp?",
        "author": "Adisaisa",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4x1qj7/what_are_some_ways_to_stay_mentally_sharp/",
        "text": "[removed]",
        "created_utc": 1470829742,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think that calling people out on \"Godwin's Law\" is a type of political correctness?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4x1pxe/do_you_think_that_calling_people_out_on_godwins/",
        "text": "[removed]",
        "created_utc": 1470829431,
        "upvote_ratio": ""
    },
    {
        "title": "What is the most unbiased news outlet you know?",
        "author": "schizomisanthrope",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4x06dt/what_is_the_most_unbiased_news_outlet_you_know/",
        "text": "[removed]",
        "created_utc": 1470799053,
        "upvote_ratio": ""
    },
    {
        "title": "How did you first experience \"Evil\" first hand?",
        "author": "sfrasermait",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wzyg8/how_did_you_first_experience_evil_first_hand/",
        "text": "[removed]",
        "created_utc": 1470795735,
        "upvote_ratio": ""
    },
    {
        "title": "How come nobody ever talks about the super anti-PC movement?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wyh47/how_come_nobody_ever_talks_about_the_super_antipc/",
        "text": "[removed]",
        "created_utc": 1470776261,
        "upvote_ratio": ""
    },
    {
        "title": "Is there international laws against militaries appropriating another country's assets?",
        "author": "Papa_Jee",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wwi2y/is_there_international_laws_against_militaries/",
        "text": "[removed]",
        "created_utc": 1470753647,
        "upvote_ratio": ""
    },
    {
        "title": "What is really happening when you take a sip of a drink expecting it to be a different beverage? The resulting flavor is neither the expected drink or the drink you physically drank.",
        "author": "returnthebomb1",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wvysd/what_is_really_happening_when_you_take_a_sip_of_a/",
        "text": "[removed]",
        "created_utc": 1470746363,
        "upvote_ratio": ""
    },
    {
        "title": "Be honest. Have you ever driven drunk? Do you on a regular basis?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wtnn0/be_honest_have_you_ever_driven_drunk_do_you_on_a/",
        "text": "[removed]",
        "created_utc": 1470705385,
        "upvote_ratio": ""
    },
    {
        "title": "Is it advisable or beneficial to have a defined personal mission or purpose in life?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wr12b/is_it_advisable_or_beneficial_to_have_a_defined/",
        "text": "[deleted]",
        "created_utc": 1470674101,
        "upvote_ratio": ""
    },
    {
        "title": "Is Poltical Correctness really that a big issue?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wp63m/is_poltical_correctness_really_that_a_big_issue/",
        "text": "[removed]",
        "created_utc": 1470645557,
        "upvote_ratio": ""
    },
    {
        "title": "Looking at my comments history, what sort of person do you see?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wn53t/looking_at_my_comments_history_what_sort_of/",
        "text": "[removed]",
        "created_utc": 1470609877,
        "upvote_ratio": ""
    },
    {
        "title": "Am I an atheist if I do not necesarilly believe in a God, but also not necesarilly believe that there is nothing after life?",
        "author": "The_Godlike_Zeus",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wmu97/am_i_an_atheist_if_i_do_not_necesarilly_believe/",
        "text": "[removed]",
        "created_utc": 1470605646,
        "upvote_ratio": ""
    },
    {
        "title": "After I spend the day at an art museum, I find myself being much more appreciative of the beauty of things around me. How can I get this effect without going to a museum everyday?",
        "author": "mako123456",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wi149/after_i_spend_the_day_at_an_art_museum_i_find/",
        "text": "After a few hours of looking at art I will find myself taken by landscapes, people, cars and anything with good aesthetics. This is a change for me, since I usually am lost in my own thoughts and don't notice stuff any more than necessary to avoid running into it. Is there any way to set myself in this frame of mind every day?",
        "created_utc": 1470521345,
        "upvote_ratio": ""
    },
    {
        "title": "Clearing iPhone back housing scratches",
        "author": "ReadIt_SuperUser",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4whkt9/clearing_iphone_back_housing_scratches/",
        "text": "[removed]",
        "created_utc": 1470514865,
        "upvote_ratio": ""
    },
    {
        "title": "Donald Trump had some pictures leaked by hackers, but what's your view on things? Could it derail his election campaign?",
        "author": "wizn85kwer",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wcms6/donald_trump_had_some_pictures_leaked_by_hackers/",
        "text": "[removed]",
        "created_utc": 1470430916,
        "upvote_ratio": ""
    },
    {
        "title": "Is the threat from \"Poltical Correctness\"over exaggerated?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wbxyo/is_the_threat_from_poltical_correctnessover/",
        "text": "[removed]",
        "created_utc": 1470422705,
        "upvote_ratio": ""
    },
    {
        "title": "The immediate economic repercussions if Donald Trump is elected POTUS on November 8th?",
        "author": "Bbrainss",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4wbnmh/the_immediate_economic_repercussions_if_donald/",
        "text": "[removed]",
        "created_utc": 1470419392,
        "upvote_ratio": ""
    },
    {
        "title": "What is and isn't being poltically correct?",
        "author": "KNOWER_OF_STUFF",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4w9gu1/what_is_and_isnt_being_poltically_correct/",
        "text": "[removed]",
        "created_utc": 1470386411,
        "upvote_ratio": ""
    },
    {
        "title": "Do people think that hormonal birth control is harmful? Are men less responsible than women when it comes to birth control? Please share your view of this video and contraceptive responsibility in general.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4w86fz/do_people_think_that_hormonal_birth_control_is/",
        "text": "[removed]",
        "created_utc": 1470363236,
        "upvote_ratio": ""
    },
    {
        "title": "Where can the line be reasonably drawn between hate speech and an opinion some people may just find offensive?",
        "author": "nectarine123",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4w3nab/where_can_the_line_be_reasonably_drawn_between/",
        "text": "I've been wondering about this a lot lately seeing some of the silencing that happens on college campuses and have no idea where the line should be drawn.\n\nFor example, if there's a guy who believes that you can only truly be the gender to which you're born and doesn't scientifically validate transgenderism, would it be hate speech if he posted a sign that says \"Transgenderism is not real\"? Would that just be him expressing his scientific opinion, or would that be considered hate speech against transgender people?\n\n(These are not my personal beliefs, solely for argument's sake^)",
        "created_utc": 1470301287,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen, globally, if the entire United States was wiped out by nuclear bombs?",
        "author": "Japhysiva",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4w1uhd/what_would_happen_globally_if_the_entire_united/",
        "text": "[removed]",
        "created_utc": 1470270752,
        "upvote_ratio": ""
    },
    {
        "title": "I often feel overwhelmed when approaching tasks, how can I improve my mind?",
        "author": "deepfatthinker92",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4vwz1u/i_often_feel_overwhelmed_when_approaching_tasks/",
        "text": "[removed]",
        "created_utc": 1470202539,
        "upvote_ratio": ""
    },
    {
        "title": "In what way is knowledge actually useful? Besides the occasional time where you can tell people an interesting fact in a conversation",
        "author": "The_Godlike_Zeus",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4vvfqf/in_what_way_is_knowledge_actually_useful_besides/",
        "text": "[removed]",
        "created_utc": 1470179518,
        "upvote_ratio": ""
    },
    {
        "title": "How are the Olympics still scheduled to take place in Rio?",
        "author": "R-DM",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4vugqj/how_are_the_olympics_still_scheduled_to_take/",
        "text": "[removed]",
        "created_utc": 1470167752,
        "upvote_ratio": ""
    },
    {
        "title": "Who are the electable &amp; moderate 3rd party alternatives that liberals and conservatives dissatisfied with Clinton and Trump should be voting for? (xpost r/ask_politics)",
        "author": "GeorgePukas",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4vtjb8/who_are_the_electable_moderate_3rd_party/",
        "text": "[removed]",
        "created_utc": 1470157651,
        "upvote_ratio": ""
    },
    {
        "title": "A Question of Rock Concert Etiquette",
        "author": "amw157",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4vngdv/a_question_of_rock_concert_etiquette/",
        "text": "I was at a concert this week.  Three rock bands from the 1980's, so this was not an opera or a \"high class\" event.  It was a larger concert venue, not an auditorium but not as big as a stadium.  Because the bands were all from the 1980's, the concertgoers were mostly middle-aged.  \n\nAllow me to tell you what happened in the audience.\n\nHere's the layout of the concert.  There are aisles between all the sections.\n\nhttp://i.imgur.com/SSr4SOb.png\n\nI was in the orange section.  Note that the first three sections are an entire ***tier*** below the second three sections.  You have go to down steps from the back sections to the front sections.\n\nThe whole thing came down to three \"questionable etiquette\" people.  Here's the section I was sitting in.  Those of \"questionable etiquette\" are in yellow.\n\nhttp://i.imgur.com/MAIbZ7e.png\n\nThe yellow people preferred to stand.  Everyone else in the section preferred to sit.  But the yellow people did not want to sit.  \n\nBecause the yellow people stood, all the RED people could NOT see the stage very well.  I was one of the red people.  At first, the red people asked politely for the yellow people to sit, but the yellows literally ignored them, as if they weren't being spoken to.  \n\nThen it got more and more angry, as red people started yelling, and calling them \"assholes\" and using more foul language.  The yellows acted as if they didn't hear a thing.  But the red people got louder and louder, and in unison.  I admit I joined in, because I could not see at all.\n\nOne of the yellows turned around and yelled back, something like \"Why don't you stand, then?\"  It was clear at that point, the yellows weren't going to sit, even if their legs were chopped off, they'd find a way to stand.  It was now a battle of willpower between the reds and the yellows.\n\nThen it got ugly.  One of the reds started throwing things at the yellow people. First it was a balled up piece of paper.  Then a french fry.  Then three minutes later it was an empty cup.  Then three minutes later again it was actual beer!\n\nFinally the yellows got mad and found an usher.  They accused at the reds of throwing things, but they didn't know exactly who was doing the throwing, so nobody was punished.  And the yellows still stood.  The ushers sat there in the aisle, watching for reds to act out, for the next five minutes or so.  \n\nThen the ushers left, and the red guy threw more beer on them!  More terrible yelling and screaming.  I was sure that someone would pull out a gun or something.  The yellows got ushers again, and the ushers moved the yellows to better seats up front.  The red crowd cheered uproariously in joy.  While the yellows were leaving, there was screaming match between them and the reds.  The whole arena could hear the ruckus our section was making.  All this was happening while a slow love song was being performed, which was a shame for the performers and for the other concertgoers.\n\nIt gets worse!  Ten minutes later, ushers and police came back to our section.  They pulled out one guy from the red section, they accused him of throwing the beers, but I knew (and so did everyone else), that he had nothing to do with it at all.  He was just in the wrong place at the wrong time.  They took him out, and he never came back.  This guy was entirely innocent and took the blame.  Nobody among the reds lifted a finger ... and neither did I, and I feel guilty about that.  \n\n**My question:  What should the yellow people have done?**\n\nIn honesty, you're allowed to stand if you want.  It's a rock concert, people like to dance.  And the yellows did nothing wrong.  They weren't the only people at the entire concert who were standing.  And NOTHING stopped ME or anyone else from standing.  Had I stood, I would have been able to see just fine.  \n\nSo were the yellows in the wrong?  On the one hand, no, they had every right to stand.  But when there are 100 other people who you're directly affecting, maybe the right thing to do is try to be a good citizen? Maybe sit for half the songs?  It's not like the yellows would have been unable to see if they sat, because there was an aisle in front of them, and the next section in front of them was one tier lower.  They had the perfect view, even if they sat.\n\nSo there are rules (anyone can stand) and there's etiquette.  And I'm not sure I can condemn the yellows.  I'm not sure I can condemn the reds for being upset about it either.  I can definitely condemn the guy who threw things, though.  And I condemn us all for letting one innocent guy take the fall.\n\nWhat's your opinion?",
        "created_utc": 1470070183,
        "upvote_ratio": ""
    },
    {
        "title": "Men and women of the Waitstaff world. Does a split tip (cash and debit) enable you to pocket the cash part and only claim the debit part of that specific purchase?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4vl6o3/men_and_women_of_the_waitstaff_world_does_a_split/",
        "text": "[deleted]",
        "created_utc": 1470033046,
        "upvote_ratio": ""
    },
    {
        "title": "Would an animal be shocked or freaked to see another animal behaving in human-like ways? Would they even notice a dog talking or cooking?",
        "author": "Alltruenews",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4vkcsk/would_an_animal_be_shocked_or_freaked_to_see/",
        "text": "[removed]",
        "created_utc": 1470018319,
        "upvote_ratio": ""
    },
    {
        "title": "After Obama leaves office, will the secret service still protect him and his kids?",
        "author": "yo_soy_soja",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4v7jrp/after_obama_leaves_office_will_the_secret_service/",
        "text": "[removed]",
        "created_utc": 1469810978,
        "upvote_ratio": ""
    },
    {
        "title": "What is the rate at which animal species are going extinct? is it accelerating each year?",
        "author": "deepfatthinker92",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4v7ay5/what_is_the_rate_at_which_animal_species_are/",
        "text": "[removed]",
        "created_utc": 1469808099,
        "upvote_ratio": ""
    },
    {
        "title": "When are you going to get off Reddit and do something for yourself? (future plans..etc etc)",
        "author": "deepfatthinker92",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4v6mz1/when_are_you_going_to_get_off_reddit_and_do/",
        "text": "[removed]",
        "created_utc": 1469799989,
        "upvote_ratio": ""
    },
    {
        "title": "Underachiever or Overachiever. Who do you prefer and why?",
        "author": "deepfatthinker92",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4v6j8q/underachiever_or_overachiever_who_do_you_prefer/",
        "text": "[removed]",
        "created_utc": 1469798522,
        "upvote_ratio": ""
    },
    {
        "title": "Can you help me find this video?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4v42ne/can_you_help_me_find_this_video/",
        "text": "[deleted]",
        "created_utc": 1469754901,
        "upvote_ratio": ""
    },
    {
        "title": "Do Extroverts have a harder time dealing with depression and/or anxiety than Introverts?",
        "author": "kulstor_ebrough",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4v3x6f/do_extroverts_have_a_harder_time_dealing_with/",
        "text": "I know there is the whole thing that extroverted people are generally better at reading their audience and so on, and introverted people are generally better at understanding themselves. It just seems rude to assume it off that factor alone.\n\nI've more commonly seen extroverted people deal with anxiety or depression along the lines of: If it's acting up and the meds aren't working right, it's just game over. Nope. Done. There is no hope... Whereas on the opposite end (introverts)... It's like an inconvenient game changer. It's  more like... Great, I'm feeling like this is acting up... Now I have to do this, followed by that, then that over there, and I can manage, but it's going to suck. One side it's: Game over, the other it's: Great, now I have to do this...\n\nThe other thing... When I've asked someone how, why, or when that really started. The more extroverted people (I know) typically don't know or it'll start with \"My therapist/doctor says...\" As for the more introverted people (myself included), they could typically write a book and entire origin story before possibly including \"My therapist/doctor says....\"\n \nIt just brings me back to the title. Do extroverts have a harder time dealing with depression and/or anxiety than Introverts do?\n\nIs it mostly a reason of self-awareness?",
        "created_utc": 1469752768,
        "upvote_ratio": ""
    },
    {
        "title": "How does one \"learn a lot about themselves\" while doing an activity?",
        "author": "Your_Mum_",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4v3j48/how_does_one_learn_a_lot_about_themselves_while/",
        "text": "As an example, people will say to take time off and go backpacking in Europe to learn about yourself. What does that even mean? How do you learn about yourself while visiting a new place? Does it just mean you figure out that you don't like certain foods in the area, or maybe you find out you prefer beaches to camping in the mountains? Otherwise, I don't understand what you learn about yourself during this process. ",
        "created_utc": 1469747161,
        "upvote_ratio": ""
    },
    {
        "title": "What are some subtle forms of discrimination that you thinks affect people?",
        "author": "SuingTheCourts",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4v2r7s/what_are_some_subtle_forms_of_discrimination_that/",
        "text": "I'm not thinking of sexism and racism, but traits that usually aren't recognized as discrimination, such as baldness, age, politics, weight, etc.\n\nI don't neccesarily wanna turn this into a \"woe is me\" type of thread, but I'm interested in hearing what you think.",
        "created_utc": 1469737112,
        "upvote_ratio": ""
    },
    {
        "title": "How can I best situate myself and my family to thrive in the event of dramatic (~4°C) global warming in the next 50 years?",
        "author": "Exacting",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4uxmzg/how_can_i_best_situate_myself_and_my_family_to/",
        "text": "[removed]",
        "created_utc": 1469661971,
        "upvote_ratio": ""
    },
    {
        "title": "What sort of life skills should modern students be taught in schools?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4uug3y/what_sort_of_life_skills_should_modern_students/",
        "text": "[removed]",
        "created_utc": 1469623919,
        "upvote_ratio": ""
    },
    {
        "title": "Why do redditers hate Coffee Enemas?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4umsr7/why_do_redditers_hate_coffee_enemas/",
        "text": "[removed]",
        "created_utc": 1469506542,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible, in your opinion, to \"become\" a nationality?",
        "author": "Kaiserlicher-Ritter",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4uloe2/is_it_possible_in_your_opinion_to_become_a/",
        "text": "I was pondering on the matter, and then I decided to Google it, but since the question itself is somewhat very hard to describe, I could find only results for \"citizenship requirement\" and that is not my question, my question is more of a philosophical matter. Let us suppose, there is this Spanish or French or Irish, or whatever, who likes a lot Poland, or Norway, or Mexico, or whatever, but their cultures have little to do with each other. Supposing this man learns the language to fluency, supposing he acquires citizenship, supposing he moves to that country, supposing he owns a house and has a job and friends there, supposing he fully adapts to the culture, tastes, aspects of that given culture, to the point that truly none can say he is from elsewhere, but is in fact a national, let's suppose, to the point an irishman integrates so well in a Russian society that truly no Russian would ever imagine that man was once from Ireland?\n\nPutting aside the question of accent, because we all know some people actually manage to lose their native accent and speak a language perfectly fine, and some never achieve that. Let us suppose the person in question would be one of the easy-tongued ones who in a few years fully adapt to accent.\n\nWhat's your opinions?",
        "created_utc": 1469490444,
        "upvote_ratio": ""
    },
    {
        "title": "Which carriers are actually using LTE-A?",
        "author": "KingOfTheCouch13",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4ukw9p/which_carriers_are_actually_using_ltea/",
        "text": "[removed]",
        "created_utc": 1469480378,
        "upvote_ratio": ""
    },
    {
        "title": "In the past, how have popular, fear-mongering policies and candidates eventually been defeated?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4ujdao/in_the_past_how_have_popular_fearmongering/",
        "text": "[deleted]",
        "created_utc": 1469462968,
        "upvote_ratio": ""
    },
    {
        "title": "When was the last time you had a coffee enema? Did you feel better after?",
        "author": "deepfatthinker92",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4uhe16/when_was_the_last_time_you_had_a_coffee_enema_did/",
        "text": "[removed]",
        "created_utc": 1469431831,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I read about what regular 8-14 year olds think about the world?",
        "author": "heelsoverheadgb",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4ug3hv/where_can_i_read_about_what_regular_814_year_olds/",
        "text": "[removed]",
        "created_utc": 1469409503,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with allergies in the workplace?",
        "author": "ignorant_",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4uf6pe/how_do_you_deal_with_allergies_in_the_workplace/",
        "text": "[removed]",
        "created_utc": 1469396125,
        "upvote_ratio": ""
    },
    {
        "title": "Which are the reasons you are not vegetarian (and wouldn't become one any time soon) ?",
        "author": "Lge24",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4uamwj/which_are_the_reasons_you_are_not_vegetarian_and/",
        "text": "I'm basically looking for distinct elements, like bullet points. \n\nPersonally, my reasons are :\n\n* Medical/health (lack of some nutrients)\n* Lack of taste (my stomach feels empty when i eat only vegetables)\n* Social troubles (having to refuse meals, having to ask for vegetarian food, etc)\n\n\nI could ask this question differently : if you were forced to live 10 years as a vegetarian (eg. your wife forced you, otherwise she kills your children), which troubles would you suffer from ?\n\nThanks ! Cheers",
        "created_utc": 1469316029,
        "upvote_ratio": ""
    },
    {
        "title": "Do you have a sexual fetish and what do you think started it?",
        "author": "dametupata",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4u9zbh/do_you_have_a_sexual_fetish_and_what_do_you_think/",
        "text": "I have a \"fetish\" that a lot of people would judge me for; I like to watch women poop. Whooah, back up a second, let me explain. I'm an otherwise ordinary individual, and in terms of sex I like naked pretty women like a hell of a lot of other guys. I also like long socks, high heels, yoga pants, I quite like trashy looking girls, I love big butts, I even quite like fat girls. Many things.. But the poop thing is something I hate myself for. \n\nTo clarify, scat disgusts me. I am revolted by the idea of people pooping on one another or touching it, licking it, even looking at it.. Uugggghggg. In sex, I am perfectly content with a naked women and even though I love butts and face sitting, a girl pooping on me or farting on me would make me throw up. \n\nBut I like to watch women (in videos not in real life obviously) sitting on the toilet, doing their thing. This has confounded (and yet, excited) me for years. I would never tell this to anyone in real life. Why do I get off on this? Is it that I'm seeing a woman at her most vunerable? Is it that I'm seeing something you're not supposed to see when you think of a perfect woman with no flaws? After all \"girls don't poop\", right?\n\nThen the other day my dad was telling me how, back when we lived in Spain, and I was just a young baby, my mum was so protective of me she would never let me out of her sight. Ever. He said that she would even take me in the bathroom with her and joked about her gassing me out with the smell to which my mum told him to shut up. \n\nAnyway at that point it hit he; that's it. Surely that's the reason I've always, since I was a teenager fantasised about a woman sitting on the toilet as much as I have fantasised having sex with her. \n\nWhat do you think? I'm sorry for the details but is be interested if something like that could trigger a fetish.\n\nWhat is yours and how do you think it was triggered?",
        "created_utc": 1469306466,
        "upvote_ratio": ""
    },
    {
        "title": "On The Integration Of Refugees What does everyone else think?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4u699o/on_the_integration_of_refugees_what_does_everyone/",
        "text": "[deleted]",
        "created_utc": 1469239853,
        "upvote_ratio": ""
    },
    {
        "title": "Why are US politicians so hung up on whether or not to refer to ISIS as \"violent Islamic extremists\"? Why does it matter?",
        "author": "zeptimius",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4u3df7/why_are_us_politicians_so_hung_up_on_whether_or/",
        "text": "First, the Republicans. Why is the name important? We all know who ISIS and Al Qaeda are, don't we? We all (including the vast majority of the Muslim world) agree that they're bad guys who need to be stopped. So what difference does it make how you call them?\n\nNext, the Democrats. Why not call them \"violent islamic extremists\" if that makes the other side happy? Isn't that what they are, and isn't anyone who fits that label a problem by definition? We're specifically saying *violent* Islamic *extremists*, so it's crystal clear that we're not talking about Muslims in general, nor even about *nonviolent* Islamic extremists. So what's the problem?",
        "created_utc": 1469202097,
        "upvote_ratio": ""
    },
    {
        "title": "Islamic State seems to aim at young people who are angry at real or perceived injustices, feel disrespected and so on. If we want to ensure that young people don't become radicalised, how important is it that we tackle White privilege?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4u0jr5/islamic_state_seems_to_aim_at_young_people_who/",
        "text": "[deleted]",
        "created_utc": 1469153352,
        "upvote_ratio": ""
    },
    {
        "title": "This invention should be made ?",
        "author": "comunication",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4tznwj/this_invention_should_be_made/",
        "text": "[removed]",
        "created_utc": 1469140814,
        "upvote_ratio": ""
    },
    {
        "title": "Driverless Cars and the Future of America",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4txp68/driverless_cars_and_the_future_of_america/",
        "text": "[removed]",
        "created_utc": 1469116752,
        "upvote_ratio": ""
    },
    {
        "title": "What are some people now in power in the West that you believe are 'evil'?",
        "author": "Flying_Rainbows",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4twpz0/what_are_some_people_now_in_power_in_the_west/",
        "text": "Ruthless 'evil' people have a tendency to be in power but when talking about evil people everybody points to guys like Putin or Kim Jong-Un or whatever dictator is in the news that month (Erdogan). There must be a couple of less than savory people in power in the West. Also, what about these persons you name makes you think they are 'evil'? Why/how are they still in a position of power? \n\nPlease don't just name somebody you think is an asshole and/or has a different political believe. Also people in power so no serial killers or people of that nature.",
        "created_utc": 1469104174,
        "upvote_ratio": ""
    },
    {
        "title": "When did the 00's transition into the '10s?",
        "author": "hamsterallergy",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4tvu1h/when_did_the_00s_transition_into_the_10s/",
        "text": "[removed]",
        "created_utc": 1469085849,
        "upvote_ratio": ""
    },
    {
        "title": "What is the biggest issue threatening the overall prosperity of America right now?",
        "author": "peetss",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4ts3vi/what_is_the_biggest_issue_threatening_the_overall/",
        "text": "",
        "created_utc": 1469033580,
        "upvote_ratio": ""
    },
    {
        "title": "What are the benefits of the U.S. having such a large military?",
        "author": "tasty_serving",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4tq08z/what_are_the_benefits_of_the_us_having_such_a/",
        "text": "[removed]",
        "created_utc": 1468999382,
        "upvote_ratio": ""
    },
    {
        "title": "At what point should one consider insuring a body part?",
        "author": "matthewsmazes",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4toe52/at_what_point_should_one_consider_insuring_a_body/",
        "text": "[removed]",
        "created_utc": 1468973932,
        "upvote_ratio": ""
    },
    {
        "title": "Which year since 2001 do you think has been the most eventful or newsworthy?",
        "author": "smithedition",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4tn806/which_year_since_2001_do_you_think_has_been_the/",
        "text": "[removed]",
        "created_utc": 1468958986,
        "upvote_ratio": ""
    },
    {
        "title": "When did reddit become so overwhelmingly alt-right?",
        "author": "Grithoof",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4tm0ts/when_did_reddit_become_so_overwhelmingly_altright/",
        "text": "[removed]",
        "created_utc": 1468945807,
        "upvote_ratio": ""
    },
    {
        "title": "To what extent, if any, are parents responsible for the actions of their adult children?",
        "author": "let_them_burn",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4tl8k6/to_what_extent_if_any_are_parents_responsible_for/",
        "text": "",
        "created_utc": 1468936543,
        "upvote_ratio": ""
    },
    {
        "title": "What deed has given you real yet unexpected satisfaction?",
        "author": "deepfatthinker92",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4tk47n/what_deed_has_given_you_real_yet_unexpected/",
        "text": "[removed]",
        "created_utc": 1468917402,
        "upvote_ratio": ""
    },
    {
        "title": "How can we better control how we consume the news?",
        "author": "Zacharias_ursinus",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4tg06y/how_can_we_better_control_how_we_consume_the_news/",
        "text": "Recently I have been feeling increasingly overwhelmed by all the numerous \"takes\" and constantly conflicting analysis presented by different pundits and news sources. I regularly check Google News, the NY Times, WSJ, Twitter, and other major national news sources. I believe this to be aggravated by the recent chaotic news cycles, though I have noticed this for a long time, and certainly prior to our current presidential election. In the past, the physical local newspaper served this function for informed citizens, and the consumer outsourced the responsibility of curating the news/opinion pages to the editor of the paper. Now, in the age of internet journalism, the enormous amount of choice we have has effectively eliminated the role of the editor, even though editors still function at specific papers and major news websites. \n\nPerhaps I am simply asking how to overcome the widely noted [echo chamber effect](http://www.nytimes.com/roomfordebate/2011/04/21/barack-obama-and-the-psychology-of-the-birther-myth/the-echo-chamber-effect), but I believe this question goes further than just managing my bias. How can I, and all of us for that better, best identify the most important pieces of analysis on a given event or issue? I am looking for both practical solutions as well as more strategic suggestions. ",
        "created_utc": 1468859159,
        "upvote_ratio": ""
    },
    {
        "title": "Does a caterpillar feel pain as it transforms into a butterfly?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4tep8b/does_a_caterpillar_feel_pain_as_it_transforms/",
        "text": "[removed]",
        "created_utc": 1468840859,
        "upvote_ratio": ""
    },
    {
        "title": "If we didn't have ups and downs, would life itself be worth less?",
        "author": "deepfatthinker92",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4te2fy/if_we_didnt_have_ups_and_downs_would_life_itself/",
        "text": "",
        "created_utc": 1468827937,
        "upvote_ratio": ""
    },
    {
        "title": "How can my friend reach his crowdfunding goal?",
        "author": "Lithy_Eum",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4tcamk/how_can_my_friend_reach_his_crowdfunding_goal/",
        "text": "[removed]",
        "created_utc": 1468800049,
        "upvote_ratio": ""
    },
    {
        "title": "What careers can someone with anxiety teach themselves from home without having to go to college?",
        "author": "EliKalil",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4t7qxd/what_careers_can_someone_with_anxiety_teach/",
        "text": "[removed]",
        "created_utc": 1468722502,
        "upvote_ratio": ""
    },
    {
        "title": "As a white American, do I legally need to mark off \"Caucasian\" when asked my race? I'm not trying to take any sort of stand I just think the term is stupid.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4t61rn/as_a_white_american_do_i_legally_need_to_mark_off/",
        "text": "[removed]",
        "created_utc": 1468697265,
        "upvote_ratio": ""
    },
    {
        "title": "If I draw Mohammed and post it publicly on my social media, what consequences can I fear?",
        "author": "acdcfreak",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4t5nic/if_i_draw_mohammed_and_post_it_publicly_on_my/",
        "text": "[removed]",
        "created_utc": 1468691780,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think that Murderers must be executed?",
        "author": "killingspeerx",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4t4b89/do_you_think_that_murderers_must_be_executed/",
        "text": "[removed]",
        "created_utc": 1468671191,
        "upvote_ratio": ""
    },
    {
        "title": "Do Americans protest in the present as much as they did in the 60s and 70s and it's just not getting media coverage, or are they too comfortably numb with the way things are to rise up in action?",
        "author": "memurphsta",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4t39u4/do_americans_protest_in_the_present_as_much_as/",
        "text": "[removed]",
        "created_utc": 1468646964,
        "upvote_ratio": ""
    },
    {
        "title": "In an ideal world, what needs to happen worldwide to slow or stop the spread of ISIS idealogy and ISIS violence?",
        "author": "-T-Rekt",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4szvp1/in_an_ideal_world_what_needs_to_happen_worldwide/",
        "text": "If ideal solutions exist, what in the real world is preventing these from occuring?",
        "created_utc": 1468599260,
        "upvote_ratio": ""
    },
    {
        "title": "If you let everything be as it is and let your mind become still, can you describe in your own words what is present?",
        "author": "1tepa1",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4szgen/if_you_let_everything_be_as_it_is_and_let_your/",
        "text": "[removed]",
        "created_utc": 1468594275,
        "upvote_ratio": ""
    },
    {
        "title": "Why we want to know information about ourselves, like what films, food, etc we like and write down (save) it?",
        "author": "G-tiger",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4syrlc/why_we_want_to_know_information_about_ourselves/",
        "text": "Accent not on sharing these, but to know for myself.",
        "created_utc": 1468584531,
        "upvote_ratio": ""
    },
    {
        "title": "Beyond the idea of who you are, who are you in this moment? What is the self? Where is the self?",
        "author": "1tepa1",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4syb80/beyond_the_idea_of_who_you_are_who_are_you_in/",
        "text": "[removed]",
        "created_utc": 1468574859,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of modern architecture?",
        "author": "nerbiehancock",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4sy6fs/what_do_you_think_of_modern_architecture/",
        "text": "[removed]",
        "created_utc": 1468571842,
        "upvote_ratio": ""
    },
    {
        "title": "Why people want to keep memories, like taking photo and video, diary, etc..?",
        "author": "G-tiger",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4stiri/why_people_want_to_keep_memories_like_taking/",
        "text": "[removed]",
        "created_utc": 1468506472,
        "upvote_ratio": ""
    },
    {
        "title": "Those who stayed home during their college years and commuted to school, do you regret not getting the \"full college experience\"?",
        "author": "DRUGSDRUGSMOREDRUGS",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4sq7vx/those_who_stayed_home_during_their_college_years/",
        "text": "Just finished 2 years of studying at a local community college and currently trying to figure out of I should apply to local universities and commute to class from home, or if I should apply to universities further away and live on campus. I'm currently leaning towards staying home, simply because it will be much cheaper, and I won't be away from friends and family. However, the universities within driving distance aren't as prestigious as the ones further away, and there's also a little voice in the back of my head telling me that I'll miss out on a huge part of growing up. It would be my first time living away from my parents, I'd have more freedom, I'd be able to meet new people, I'd be able to go to crazy college parties, and I wouldn't regret missing out on this \"college experience\" thing I've created in my head. \n\nFor those who stayed home and graduated from a college nearby, do you regret your choice? And for those who went away to school and lived on campus, is it really something that I'll regret missing out on, or is what I'm imagining the \"college experience\" to be just a fantasy created by watching too many movies?",
        "created_utc": 1468453440,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think the issue of police brutality is overly focused on race?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4spqe2/do_you_think_the_issue_of_police_brutality_is/",
        "text": "[deleted]",
        "created_utc": 1468447019,
        "upvote_ratio": ""
    },
    {
        "title": "For your average young, atheistic, western person (i.e. your average redditor), what, if anything, is sacred (sacrosanct)?",
        "author": "Exacting",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4spnmn/for_your_average_young_atheistic_western_person/",
        "text": "By sacred I mean the kind of thing that is referred to with reverence, which is not often joked about (or is the subject of 'taboo' jokes). This question was prompted by that recently posted video of 9/11 on the front page, which was dominated by comments showing respect and reverence for the event. What else is treated with such reverence?",
        "created_utc": 1468446049,
        "upvote_ratio": ""
    },
    {
        "title": "Hey my name is Mike Callahan, and I'd like to know if there's anything being said about me.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4sjzkv/hey_my_name_is_mike_callahan_and_id_like_to_know/",
        "text": "[removed]",
        "created_utc": 1468365410,
        "upvote_ratio": ""
    },
    {
        "title": "Funk dancing for self-defence",
        "author": "vapourwavey",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4sjm7h/funk_dancing_for_selfdefence/",
        "text": "[removed]",
        "created_utc": 1468360568,
        "upvote_ratio": ""
    },
    {
        "title": "One of my friends has been diagnosed with ovarian cancer, what can I do to make her feel better?",
        "author": "dopesk1",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4sg9zh/one_of_my_friends_has_been_diagnosed_with_ovarian/",
        "text": "[removed]",
        "created_utc": 1468318340,
        "upvote_ratio": ""
    },
    {
        "title": "Redditors who have taken a year off college/university: what did you do? Was it worth it?",
        "author": "vh28",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4sfk6j/redditors_who_have_taken_a_year_off/",
        "text": "I'm a 20-year-old Australian student currently studying primary education. I'm in my third year of a four year degree and whilst I'm passionate about education, I feel as though my heart is not set on teaching. I have no idea what else I would like to be and I really don't want to be at university right now. I'm considering taking a year off of my studies and going traveling or something, but I can't decide and am seeking some advice.\n\nWhat was your gap year experience like? What did you do? Would you recommend it? Any advice you could offer would be wonderful because I'm really struggling!",
        "created_utc": 1468303826,
        "upvote_ratio": ""
    },
    {
        "title": "Would Black Lives Matter be more effective with less adversarial approach?",
        "author": "LaceandBatman",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4sf2jn/would_black_lives_matter_be_more_effective_with/",
        "text": "[Recently BLM Toronto held up the annual Pride Parade with a list of demands, one of which was that Pride removed the police force from participating in the parade.](http://www.cbc.ca/news/canada/toronto/pride-parade-toronto-1.3662823)\n\nIt got me thinking, isn't this propagating an \"us versus them\" mentality?\n\nI could be completely ignorant on the topic, but instead of holding demonstrations that further feeds a combative approach, wouldn't a more effective means of change be to work within the laws to create more stringent legislation?\n\nIn other words, instead of raising awareness about the issue, why not work to change the issue?\n\nI think this could possibly be done through organizing in police re-trainings, community outreach and participation, and police involvement in educational programs.\n\nThoughts?\n\n(As a sidenote, I tried understanding BLM's platform and I think a more simple approach would also be beneficial.)",
        "created_utc": 1468295458,
        "upvote_ratio": ""
    },
    {
        "title": "Women: what do you think of grey hair on younger men?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4seyl2/women_what_do_you_think_of_grey_hair_on_younger/",
        "text": "[deleted]",
        "created_utc": 1468293735,
        "upvote_ratio": ""
    },
    {
        "title": "How do i deal with adult siblings passive aggressiveness?",
        "author": "jeremychase21",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4sclpf/how_do_i_deal_with_adult_siblings_passive/",
        "text": "[removed]",
        "created_utc": 1468263285,
        "upvote_ratio": ""
    },
    {
        "title": "Question about man make ponds/lakes and ducks.",
        "author": "looklikemonsters",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4sa8ul/question_about_man_make_pondslakes_and_ducks/",
        "text": "[removed]",
        "created_utc": 1468232697,
        "upvote_ratio": ""
    },
    {
        "title": "Thinking about your life on your deathbed is a common point of reference for thinking about the quality of your life, but is it the best one or are there better ones? Why, why not?",
        "author": "Xenograteful",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4s9fdt/thinking_about_your_life_on_your_deathbed_is_a/",
        "text": "",
        "created_utc": 1468215744,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the image of Mexico in the USA so stereotypical?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4s99ym/why_is_the_image_of_mexico_in_the_usa_so/",
        "text": "[removed]",
        "created_utc": 1468213070,
        "upvote_ratio": ""
    },
    {
        "title": "From a philosophical perspective, why is society producing movies about zombies and falling in love with disabled people?",
        "author": "luispebm",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4s992v/from_a_philosophical_perspective_why_is_society/",
        "text": "Any suggested explanation why entertainment hast taken such themes as preponderant? \nDo these themes have any underlying reason in common? \n[Edit 1] I am not a fan of romance movies, but from what I have heard, it seems for me that there is a trend on movies that deal with sticking to relationship that are expected to be tragic due to a physical impediment. Recently heard about [Me before You](http://youtu.be/Eh993__rOxA) ",
        "created_utc": 1468212640,
        "upvote_ratio": ""
    },
    {
        "title": "Counter intelligence",
        "author": "107ak",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4s89vp/counter_intelligence/",
        "text": "[removed]",
        "created_utc": 1468197504,
        "upvote_ratio": ""
    },
    {
        "title": "Is the difference between bribery and blackmail (incentives and deterrents) significant to decide whether various business models should be legal or illegal?",
        "author": "Telope",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4s1vls/is_the_difference_between_bribery_and_blackmail/",
        "text": "During a conversation with my friend I was arguing that \"franchises\" are pyramid schemes with the incentives and deterrents reversed. I was basically arguing that a franchise is a pyramid scheme, or if it's not the difference is insignificant.\n\nI'm probably not using the word \"franchise\" correctly. What I mean by it is a company that sells or rents a product to a middleman who then sells the product to end-users. There is no limit to how many people can become middlemen, and there are various tiers that can be bought which increase the market share the middleman gets, which involves paying more money to the company.\n\nInstead of a pyramid scheme where an individual is encouraged to recruit new members to be promoted, a franchise-owner's business is weakened by new middlemen signing up. In order to maintain a market share, any particular middleman is encouraged pay more money to buy higher tiers of the product.\n\nThe only difference is the way in which middlemen are encouraged to pay more money to buy higher tiers of the product. With pyramid schemes it involved recruiting new members, in the \"franchise\" it's because their business is hurt buy newcomers. It boils down to the difference between bribery and blackmail.\n\nWhy is one so much better than the other? Why is one legal and one not? I came to the conclusion that they are both as bad as each other, whereas my friend thought the \"bibery\" option was unacceptable but the \"blackmail\" option was okay. What do you think?",
        "created_utc": 1468093158,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think evil is from a philosophical perspective?",
        "author": "MichaelLewis55",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4s0ij2/what_do_you_think_evil_is_from_a_philosophical/",
        "text": "",
        "created_utc": 1468074624,
        "upvote_ratio": ""
    },
    {
        "title": "Can you feel when someone is near to you forehead?",
        "author": "exozaln",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4rz2w2/can_you_feel_when_someone_is_near_to_you_forehead/",
        "text": "[removed]",
        "created_utc": 1468043900,
        "upvote_ratio": ""
    },
    {
        "title": "What do you say to someone with terminal cancer?",
        "author": "skylin4",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4rw4uv/what_do_you_say_to_someone_with_terminal_cancer/",
        "text": "[removed]",
        "created_utc": 1468002356,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think is the best minor political party and why?",
        "author": "MichaelLewis55",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4ruxjs/what_do_you_think_is_the_best_minor_political/",
        "text": "[removed]",
        "created_utc": 1467988238,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Men having Sex with Men (MSM) denial still justified when giving blood?",
        "author": "RandomCaucasian",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4roq6g/is_the_men_having_sex_with_men_msm_denial_still/",
        "text": "[removed]",
        "created_utc": 1467900435,
        "upvote_ratio": ""
    },
    {
        "title": "Americans of Redit, In light of the chilcot inquiry, how do you feel about the Iraq war?",
        "author": "Nat_Uchiha",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4rnwa3/americans_of_redit_in_light_of_the_chilcot/",
        "text": "[removed]",
        "created_utc": 1467887892,
        "upvote_ratio": ""
    },
    {
        "title": "How can I actually make a difference in the world?",
        "author": "ThatDirtyHippie",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4rms6l/how_can_i_actually_make_a_difference_in_the_world/",
        "text": "[removed]",
        "created_utc": 1467866523,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] How can I find a (perhaps smart) person (or people) to prove to that you have an equally likely risk of suffering after committing suicide as you do if you continue to live?",
        "author": "Most_Important_Info",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4riou7/serious_how_can_i_find_a_perhaps_smart_person_or/",
        "text": "[removed]",
        "created_utc": 1467814799,
        "upvote_ratio": ""
    }
]