[
    {
        "title": "Prey is one of 2017’s Under-Appreciated Games",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/87r55f/prey_is_one_of_2017s_underappreciated_games/",
        "text": "[removed]",
        "created_utc": 1522236579,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding the top post on the front page right now - Am I the only one who is glad that Far Cry 5 didn't go full political?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/87quch/regarding_the_top_post_on_the_front_page_right/",
        "text": "[removed]",
        "created_utc": 1522233098,
        "upvote_ratio": ""
    },
    {
        "title": "What was name of that tank game I played on a PC browser as a kid?",
        "author": "FlamingSevens",
        "url": "https://www.reddit.com/r/truegaming/comments/87pqgb/what_was_name_of_that_tank_game_i_played_on_a_pc/",
        "text": "[removed]",
        "created_utc": 1522218661,
        "upvote_ratio": ""
    },
    {
        "title": "Why women play less videogames than men?",
        "author": "Arnoux",
        "url": "https://www.reddit.com/r/truegaming/comments/87ppdn/why_women_play_less_videogames_than_men/",
        "text": "Hi\n\nSo I have heard about the study which says something half of the gamers are girls, however this study includes the casual mobile games as well. What I have seen in my life is some girls play Candy Crush for 10 minutes a day or Sims twice a year. I am not talking about these players. I am talking about players who go home from work and do play 1-3 hours with WoW, LoL, Dota, FPS games, singleplayer games anything.\n\nOkay so you might tell me Candy Crush is still a game. **The answer I am looking for is why men play way more with their games than women?**\n\nSeveral factors I am thinking of, however I just pulled them out of my ass:\n\n* Women are less likely to compete with others (in life as well). The main purpose of PVP games are to defeat the other team. Coop focused PVE have competition as well, like in WoW where does your guild stand? Did you got world, EU, server first? Are you better than 90% of other players etc? Plus you can compete with your own teammates in Coop game. Who did the most damage, who killed the most monsters, who was the MVP of the endeavor .\n\n* As women are more social creatures, singleplayer games maybe don't appeal to them as you can't interact with other characters, they are just AI. Seems similar as the recent sex robots trend. I can foresee that way higher number of men will be satisfied with sex robots than women, because(?) women cannot connect with the robots.\n\n* Men's main role was always accumulate wealth in life, so they can convince females that they are fit to feed and protect them and their babies. Maybe games exploit this desire? In WoW you collect items, in CoD you collect guns and levels and points, in LoL you collect champions, and in each game you collect gold, xp, items, in Counter Strike you collect dollars to buy weapons etc.\n\n* Status symbols can be related to the previous point but I put in another paragraph because females enjoy being high status as well in life. Men show their status to demonstrate their wealth. Women also shows status via clothes, Instagram. Maybe men and women want to show different kind of status? Maybe men want to show their achievement, while women their status simply? I am just wondering because there are several ways to show your status in games (transmog, weapon skins, pay to win games, hard to obtain achievements, avatars) yet women are still less likely to play these games on hardmode as men do.\n\nThese are just thoughts from me, I am interested in your perspective.",
        "created_utc": 1522218288,
        "upvote_ratio": ""
    },
    {
        "title": "I'm frustrated with how side content has been handled in recent games",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/87opun/im_frustrated_with_how_side_content_has_been/",
        "text": "[deleted]",
        "created_utc": 1522207085,
        "upvote_ratio": ""
    },
    {
        "title": "Can we PLEASE get some love for GVMERS: A YouTube channel of actual quality content.",
        "author": "FresnoBob90000",
        "url": "https://www.reddit.com/r/truegaming/comments/87njfg/can_we_please_get_some_love_for_gvmers_a_youtube/",
        "text": "[removed]",
        "created_utc": 1522196151,
        "upvote_ratio": ""
    },
    {
        "title": "Major battles in RPGs (xpost r/rpg_gamers)",
        "author": "gawainlatour",
        "url": "https://www.reddit.com/r/truegaming/comments/87mxy9/major_battles_in_rpgs_xpost_rrpg_gamers/",
        "text": "Spoilers for Grimrock 2, D:OS and Pillars of Eternity ahead. \n\nI've been on an RPG spree recently, finishing Kotor, Grimrock 2, Divinity: OS and Tyranny within a couple of weeks/months, and now I am playing through Pillars of Eternity for the first time. Three of these games include battles that are significantly larger than normal encounters, and as appealing as a large-scale battle might sound, I've found they are rarely enjoyable.\n\nDivinity was probably the best of the bunch. The royal rumble in the third village (the one overrun by orcs and mountainfolk) was manageable and the only annoying thing was having to watch 10+ NPCs cycle through their combat turns, especially when that one glitch occurs where they zone out and just do nothing.\n\nGrimrock 2 had the mummy desert, which was not difficult at all because mummies burn like dry leaves, but again - looongwinded and repetitive. It really took away from Grimrock's usual elegance and turned the game into a messy slog. The fight against the wyvern had similar tendencies, except not as bad.\n\nThe most annoying one for me was Pillars. I got the battle quest when my party was between level 5-7, and I bought the \"elite fighters\" for 10k, got support from the knights, and had hired some normal fighters. I felt I was well prepared, but the battle turned out to be utterly impossible on my difficulty setting (hard). My army got ripped to shreds by the time my party had manually killed their 2nd guy. RTwP combat tends to get confusing quickly for me when too many combatants are involved, and this felt like a fresh hell, and worse - cheap, unrewarding, and clashing weirdly with the rest of the game. I ended up cheesing it by setting the game to Storytime, but that really made the whole thing a disappointing experience.\n\nAs a final example Oblivion comes to mind, with its laughable final battle - not sure that should count as a major one though...\n\nWhat do you think of battles like these in RPGs? Can it be done? Should it even be done? Has it ever been done successfully? ",
        "created_utc": 1522191023,
        "upvote_ratio": ""
    },
    {
        "title": "What should open-world games take from Breath of the Wild?",
        "author": "theivoryserf",
        "url": "https://www.reddit.com/r/truegaming/comments/87lqio/what_should_openworld_games_take_from_breath_of/",
        "text": "I think BotW is up there on my top games of all time - as others have said ad nauseam, I can't overstate how wonderful it was just to explore a world rather than working through a database of obvious tasks/missions/chores.\n\n Do you think that developers will wear some influence from Breath of the Wild? I'd love to see some of that free-roaming style adopted in more western games.",
        "created_utc": 1522181660,
        "upvote_ratio": ""
    },
    {
        "title": "(Spoilers for Far Cry 5) Far Cry 5 used a lot of political and religious imagery in its marketing and the developers talked a lot about the game being a look at extremism and cults of personality, but the actual game is oddly sanitized and doesn’t address much of that",
        "author": "casedawgz",
        "url": "https://www.reddit.com/r/truegaming/comments/87lk0u/spoilers_for_far_cry_5_far_cry_5_used_a_lot_of/",
        "text": "It felt like Ubisoft wanted to make a political game but then didn’t want to offend either liberals OR conservatives. Everything in-game feels curiously divorced from the political and religious iconography that they used to sell it. There are a few jokes about Trump and probably some shots at the other side as well but the actual meat of the story feels so safe.\n\nThe antagonist was portrayed as this smooth talker with a cult of personality, but rather than examining how he swayed a small of army of presumably regular people to his cause, the game handwaives any close moral examination of his movement by having him use a mind control gas. \n\nI’m not someone who demands that my art be political or conform to my worldviews but it feels like Ubisoft was, at least in their marketing, making an effort to tell a political story. If that is what they wanted to do, that is fine and I support them. If they wanted to tell a nonpolitical story, that is fine and I support them.\n\nHowever, in an effort to try to have it both ways, I feel like they have failed in both ways. It’s a story of half measures.",
        "created_utc": 1522180353,
        "upvote_ratio": ""
    },
    {
        "title": "micro-transactions are bad!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/87jj8v/microtransactions_are_bad/",
        "text": "[removed]",
        "created_utc": 1522166247,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of when you hear the term \"video-game theory\"?",
        "author": "FiniteRegress",
        "url": "https://www.reddit.com/r/truegaming/comments/87iwim/what_do_you_think_of_when_you_hear_the_term/",
        "text": "(Full disclosure upfront: this mod-approved post is an effort to crowdsource some research for an article I'm writng. I fully plan to cite the good folks of /r/truegaming and share the article here when it's done!)\n\nI'm working on a project that aims to disambiguate the term \"video-game theory,\" because I worry that a lot of the debates and disagreements that arise right now in video-game discourse result from there being many different *kinds* of theory that haven't been sufficiently distinguished from one another.\n\nHere's a *Zelda*-centric example to convince you that there at at least two different things that might be called \"video-game theory\":\n\nIgnoring for a moment that Aonuma has said he doesn't much care about where *Breath of the Wild* falls on the timeline of *Zelda* games, imagine someone who writes an article arguing that this newest *Zelda* game occupies a specific place in the *Zelda* timeline (e.g., after *Skyward Sword* and before *The Minish Cap*, or whatever). You can imagine that this person is **hypothesizing about the author's intent**—i.e. where Nintendo *meant* to situate *Breath of the Wild* on the timeline. And if that is in fact what they're doing with this kind of theory, the game's creator has the last word: they can say, \"Yes, that is in fact where the game falls on the timeline,\" or, \"No, the game is in this other place on the timeline instead,\" and the theory is instantly either verified or debunked.\n\nContrast this with someone who conducts a feminist critique of *Ocarina of Time*, talking about gender roles in the society of the Gerudo, the identity of Zelda vs. Sheik, and so on. Now, it *might* be the case that Nintendo consciously had gender theory in mind when they were making this game, but it doesn't really seem like whether or not they did *matters* for this theory in the same way that it matters for the timeline theorist in the above paragraph. Nintendo can't \"debunk\" the feminist critique of the game by saying, \"No, the game is actually not concerned with anything feminist.\"\n\nAgain, the substance of my example isn't my point here: my point is simply that you could imagine people referring to both the timeline article and the feminist critique as \"video-game theory,\" even though they're two different practices (as evidenced by the fact that they differ in their responsiveness to developer feedback). Even if you don't love this example, I'm willing to bet you can think of two different kinds of video-game discourse that get lumped together under the label of theory.\n\nSo here's my question, where I need the help of all you fine theorists: what are all the different varieties of video-game discussion and analysis that you see referred to as \"theory\"? Please, help me disambiguate this term.",
        "created_utc": 1522161396,
        "upvote_ratio": ""
    },
    {
        "title": "Pretty interesting look at the opening to Final Fantasy 7",
        "author": "bladerunnerdec",
        "url": "https://www.reddit.com/r/truegaming/comments/87hmbu/pretty_interesting_look_at_the_opening_to_final/",
        "text": "[removed]",
        "created_utc": 1522149836,
        "upvote_ratio": ""
    },
    {
        "title": "Idea for a mainline Pokemon game",
        "author": "bladerunnerdec",
        "url": "https://www.reddit.com/r/truegaming/comments/87hhsz/idea_for_a_mainline_pokemon_game/",
        "text": "[removed]",
        "created_utc": 1522148406,
        "upvote_ratio": ""
    },
    {
        "title": "Video essays are a step backwards for the discussion around games",
        "author": "joekllr",
        "url": "https://www.reddit.com/r/truegaming/comments/87heh6/video_essays_are_a_step_backwards_for_the/",
        "text": "Don't get me wrong, **I actually like video essays**. The fact that thousands of people are willing to watch hour-long deep dives into particular games is an exciting opportunity for critics and could free them up to discuss topics that don't really fit into the 1,500 word limit of major games sites. That said, I have some doubts about the quality of the arguments put forth in these videos.\n\nThe specific video that inspired me to write this post is Joseph Anderson's [critique of Subnautica](https://youtu.be/DLsPoJWO-e8). I don't follow his work, but a lot of people recommended him to me in the past, so I decided to give this video a try yesterday and I just can't get over how asinine the entire thing is. I quit in frustration around the 45 minute mark, but from what I saw he spends five minutes barely scratching the surface of the tone and themes of the game and dedicates the rest of the time to ill-informed technical complaints and backseat design, proposing a variety of tweaks to make the game \"smoother\" without ever pausing to consider how those changes would affect the rest of the game, let alone if a smoother experience is even desirable in the context of Subnautica.\n\nMaybe that's not what his work is generally like, maybe he doesn't usually spend the better part of an hour missing the forest for the trees, but what bothers me is how familiar the kind of discourse in this essay feels. One sentence stuck with me in particular. He opens his video by talking about the difference between watching a character in a movie be stranded on a foreign planet and yourself playing a character who is stranded on a foreign planet, saying that: \"The experience offered by Subnautica is unique to videogames [...]\"\n\nThis is an idea I like to call videogame exceptionalism. It originated in the early days of ludology, when academics used this kind of rhetoric to secure funding for new research, new staff positions and new departments and to avoid being lumped in with the existing structures for the study of literature, film, drama, etc. From there, it also proliferated to gamers, who eagerly embraced the idea that their favorite medium was unique and special, using it to defend their pastime from all who still frowned upon the idea of adults playing games.\n\nThe problem with videogame exceptionalism is not that it is wrong per se (all media are unique and have their own specific strengths and weaknesses), but that it is a gross oversimplification that ultimately stunts the discourse around games. By continuing to act like videogames invented interactivity instead of studying their ties to other media, we close ourselves off from a huge body of research on other art forms - from drama to episodic literature to performance art to architecture - that could further our understanding of videogames.\n\nVideogame exceptionalism is a lazy and intellectually dishonest talking point, but you can find it all over the place on Youtube and that leaves me wondering: is the rise of video essays actually about an interest in longform discussions of games, or about gamers using crowdfunding to pay people to tell them what they want to hear (in a way that games writing no longer necessarily caters to them)? Because it sure seems like a lot of the big names that popped up in the last couple of years are soft-spoken dudes that talk about how the games you like are good and interesting, and the games you don't like are badly made and boring. Obviously there are exceptions to this, I would personally list Errant Signal and Gamer Maker's Toolkit. What do you think?",
        "created_utc": 1522147349,
        "upvote_ratio": ""
    },
    {
        "title": "Do you keep yourself from playing, when you found a game which is \"truly\" good?",
        "author": "Klunky2",
        "url": "https://www.reddit.com/r/truegaming/comments/87grh5/do_you_keep_yourself_from_playing_when_you_found/",
        "text": "I'm asking because I see often people who binge their favourite games within a short timespan because: \"it's so good, you can't put if off.\"\n\nFor me it was always the opposite and I ask myself, if my behaviour is rather unusual or is practiced by (many) other people as well?\n\nRegardless of how much time I have, if a game is truly good, like something which I don't see really often I practically **force** myself to lay it down after a while, because I found enough enjoyment already. \nMostly that playsessions are rather short, between approximately 1 or 2 hours in an RPG. In short action orientated games even less.\n\nWhy I do that is natural I guess... \nI just don't want it end to early. \nI believe that my anticipation, the pleasure of awaiting the next playsession, to imagine how much fun I will have or what will happen next, gives at least the same enjoyment for a much wider timespan. \nI love that feeling of finding a grandiose game and playing it I don't want put it off to soon. Especially if it's a high announced title for several years where I waited for a long time. \n\nFor example: I can't imagine to play through Kingdom Hearts 3 in just 3 days, not matter how good it may become, after all this time of waiting I couldn't just go through that adventure in just 3 days. I would feel bad about it. I would try to stretch the playtime as far as possible, (at least if it's fun, which i expect) not only within the game, also outside of the game.\n\nI know that there are enough people out there who haven't that much time and play in this style anyway. But what I want to ask is, if you really force yourself from playing because you want to enjoy that game for a longer time, not because you can just afford 1 hour of free time after work. \n\nThere is famous saying by Walt Disney: \"Always leave them wanting more\" and thats my credo of consuming entertainment. \nWhy should I play a game after it's finished or I am bored? You should always stop when its beatiful  at most. (Don't know how to translate... it's an german saying: \"Man soll aufhören wenn es am schönsten ist.\")\n\nThere are several games where I'm pretty sure that I wouldn't have them as much enjoyed when I just was binging them through, especially in story heavy games where are happening a lot of things in a short time like Nier Automata - in that case I just need a break to process what was happening.\n \nPlaying by this fashion, games are staying much longer in my memory, because it's nothing I experienced in one go. I had time between to think over.\n\nWell I apply the same behaviour to books and series as well. I don't know if its a strange phenomenon or is handled by other people as well. \nI truly love gaming, but for myself a good balance of short playsessions contribute much more to the experience of the medium, than binging it through in 8 hours per day. (or even more)\n\n- Could you relate to that? \n\n- How do you handle your playsessions? Is there some kind of \"philosophy\" behind it?\n\n",
        "created_utc": 1522139052,
        "upvote_ratio": ""
    },
    {
        "title": "Genres that have never been done before",
        "author": "mmmmoneyshot16",
        "url": "https://www.reddit.com/r/truegaming/comments/87ghpw/genres_that_have_never_been_done_before/",
        "text": "[removed]",
        "created_utc": 1522135326,
        "upvote_ratio": ""
    },
    {
        "title": "While the \"Toxic\" gamer have become a hot topic can we talk about other ways players can be \"toxic\" than just them using swear words?",
        "author": "kastdenawaybrugerfor",
        "url": "https://www.reddit.com/r/truegaming/comments/87chzt/while_the_toxic_gamer_have_become_a_hot_topic_can/",
        "text": "Whenever the discussion happens it's always somebody who dislike people using swear words, as someone else said in another thread, he talked about how if you ban swear words and hide them, the people who use them will just find a new way, and he also talks about how much more \"hurtful\" they become if we treat them so seriously.\n\nI heard Blizzard with some other companies are going to fight against swear words in games, but I just think it's so wrong. This is not the toxicity that ruins games.\n\nI would say, if you treat your teammates like shit or call them bad words, then you're a problem and should probably be kicked from the match, but if it's your enemy's or just directed at the game itself or something non person it's fine to swear.\n\nNow the things I really consider \"toxic\" and game ruining\n\n\n* unnecessary noise in voice chat e.g music, dogs barking\n* kicking players for being bad at a game (Seriously just stop it)\n* being rude to teammates\n* playing a social game but generally inactive, don't respond to other players and ignore everything (E.g playing VR chat or Rec Room, Squad)\n* teamkilling\n* unnecessary at shooting teammate, placing explosives and and trying to \"hinder\" another player from enjoying the game.\n\nBut if there is something I really have begun to hate in multiplayer games it's how generic people have become, maybe this is due to unlocks and levels and all that but some matches in video games as become so generic that it feels like they're played by bots or something.\n\nI remember being a kid, playing some MP game, just capture the flag or conquest and it was like people acknowledged each others, the round would always seem unique in some way, the match it would play like it was a story or something, if for example someone took a car and drove around trying to distract the enemy people would notice, maybe they would attack the enemy base more know they're distracted. This has probably changed because Multiplayer has become default in gaming, it used to be a decision when you played online, and people where generally more adware and payed attention to each others.\n\nBut let's just talk, what do you find \"toxic\" and why?",
        "created_utc": 1522096757,
        "upvote_ratio": ""
    },
    {
        "title": "Pc games to play with girlfriend.",
        "author": "Dekmatik",
        "url": "https://www.reddit.com/r/truegaming/comments/87c4fg/pc_games_to_play_with_girlfriend/",
        "text": "[removed]",
        "created_utc": 1522094065,
        "upvote_ratio": ""
    },
    {
        "title": "One stop solution to the most difficult and addictive game of 2018 ...",
        "author": "aman_51995",
        "url": "https://www.reddit.com/r/truegaming/comments/87c0bk/one_stop_solution_to_the_most_difficult_and/",
        "text": "[removed]",
        "created_utc": 1522093240,
        "upvote_ratio": ""
    },
    {
        "title": "Is gaming “wasting your life away?”",
        "author": "mvpalpha",
        "url": "https://www.reddit.com/r/truegaming/comments/87bwmj/is_gaming_wasting_your_life_away/",
        "text": "[removed]",
        "created_utc": 1522092436,
        "upvote_ratio": ""
    },
    {
        "title": "Is lag compensation really necessary in shooters?",
        "author": "StevesEvilTwin2",
        "url": "https://www.reddit.com/r/truegaming/comments/87al6d/is_lag_compensation_really_necessary_in_shooters/",
        "text": "Recently I've gone back to playing Halo CE on PC (which has no lag compensation) and found that I ran into much fewer frustrating situations related to hit registration even though I had to lead shots based on my ping. In comparison, going back to Source engine games (which are notorious for overdoing lag compensation) I started to doubt my sanity as it felt like my shots were not registering for no apparent reason. I think it's much easier and intuitive to try to aim ahead based on predicting your opponent's movement and your ping rather than trying to compensate for whatever magic goes on behind lag compensation systems. ",
        "created_utc": 1522082696,
        "upvote_ratio": ""
    },
    {
        "title": "Gaming Channel",
        "author": "JinX_Gaming",
        "url": "https://www.reddit.com/r/truegaming/comments/87ado4/gaming_channel/",
        "text": "[removed]",
        "created_utc": 1522081144,
        "upvote_ratio": ""
    },
    {
        "title": "Resident Evil 2 History Analysis 2018",
        "author": "TheRetroBible",
        "url": "https://www.reddit.com/r/truegaming/comments/878l8m/resident_evil_2_history_analysis_2018/",
        "text": "[removed]",
        "created_utc": 1522066178,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion: A look at how outrage, echo chambers, and confirmation bias shape our interactions with developers and other gamers",
        "author": "el2mador",
        "url": "https://www.reddit.com/r/truegaming/comments/878egr/discussion_a_look_at_how_outrage_echo_chambers/",
        "text": "**Intro:**\n\nNow one of the games I play/ed was **Destiny 2** - and is a game that had its fair share of criticisms given that it was a disappointment compared to the first (I know full well since I agree with the sentiment as a D1 player myself), as well as how the game’s communication had been handled, and how some of the first game’s good features did not carry over.\n\nBut a common cornerstone of discussion in gaming forums dedicated to Destiny have essentially been filled with very outraged individuals who clamor for change *'the way they want it'* with little to no compromise.\n\nThere have been topics on the main Destiny sub where people would call out for the heads of project leads and developers. Or the whole website would be filled with \"\\#RemoveEververse\" posts from gamers who feel that it was/is the main problem with the game. A similar vocal opinion had been that these changes were made due to casuals, or a brand new audience, and a popular rhetoric had been that it was this audience that was also a cause of the vocal fanbase’s disappointment.\n\nWhen a new patch/event hits, the idea was to find something to be outraged by (*\"this is not enough\"; \"this is just the bare minimum\"; \"they are preventing me from playing the way I want to play\"; \"we should not praise anything the developers do until it has exceeded the first game\"*).\n\n--------------\n\nThese, and many more, have been ever-present in topics each day for the past six months in various communities since the game launched last September.\n\nThe idea is that the angrier and louder you are, the more that developers would listen - [such was the obvious case of **Battlefront 2**](http://www.businessinsider.com/star-wars-battlefront-2-microtransactions-outrage-2017-11); which if [the post had not been locked](https://www.reddit.com/r/StarWarsBattlefront/comments/7cff0b/seriously_i_paid_80_to_have_vader_locked/) would be the #6 highest upvoted thread on r/all.\n\nNow of course, those criticisms are justified in the wake of microtransactions creating a pay-to-win / pay-for-shortcuts scenario... in an AAA-title.\n\nBut I also felt that it was a watershed moment in gaming (for good or ill).\n\nWatershed moment in the sense that it was a turning point where there was an overwhelming degree of outrage in a game, and a change was made to cave in to that outrage.\n\nBut at the same time, while empowering gamers to be more vocal and have a say - it also made more gamers feel that being outraged was the best and only way to achieve that change even more now.\n\n--------------\n\n**The Dangerous Pleasures of Outrage:**\n\nA recent article from [Psychology Today](https://www.psychologytoday.com/us/blog/domestic-intelligence/201803/the-dangerous-pleasures-outrage) presents the dangers of taking pleasure in outrage. Here are some good tidbits:\n\n&gt; Outrage, research shows, has a delicate dynamic, triggered by the emotional environment.  Outrage is contagious.\n\n&gt; Outrage’s contagion is often a force for good.  What was once accepted as the way of the world can be exposed as an evil by others’ outrage.  Sexual harassment, for example, when condemned by others, emerges from its safe hiding spaces to wither in the spotlight.  On the other hand, the more xenophobes declare themselves, the more readily others join them.\n\n&gt; Outrage is one of those emotions (such as anger) that feed and get fat on themselves.  Yet it is different from anger, which is more personal, corrosive and painful.\n\n&gt; Outrage assures us of our moral superiority: “My disapproval proves how distant I am from what I condemn.”\n\n&gt; Outrage quickly infiltrates our identity.  Our disapproval nestles in our persona. As a result, it can reach out to others and inspire discussion.  But this feature also fosters an us-versus-them environment. \n\n&gt; The pleasure of strong negative judgment becomes so enjoyable we seek opportunities to trigger it.\n\n-----------\n\n**To give you a brilliant example - a thought-provoking Discussion on /r/Games:**\n\nHere's [one of the most popular discussions on r/Games](https://www.reddit.com/r/Games/comments/726of2/game_developers_are_not_more_candid_about_game/).\n\nIt's about how [developers are not being candid because of the toxic gaming community](https://twitter.com/charlesrandall/status/911987526541430784).\n\nNow far too often - the 'toxicity' tends to come from outrage, and how it permeates among gamers whenever they need to voice an opinion. From people *'being angry because they were lied to'*, or *'harassing and threatening others'*, or *'watching a Youtube streamer and taking all those opinions to heart'*.\n\nOutrage seeps and permeates among a community until a lot of people end up sharing that sentiment.\n\nIt's also common for people to be very prone to confirmation bias leading to an almost 'Hive Mind' mentality, 'circlejerks', or 'Echo Chambers'.\n\n-------------\n\n**Confirmation Bias and Echo Chambers:**\n\n[Confirmation Bias](https://www.psychologytoday.com/us/blog/science-choice/201504/what-is-confirmation-bias)\n\n&gt; Confirmation bias occurs from the direct influence of desire on beliefs. When people would like a certain idea/concept to be true, they end up believing it to be true. They are motivated by wishful thinking. This error leads the individual to stop gathering information when the evidence gathered so far confirms the views (prejudices) one would like to be true.\n\n&gt; Once we have formed a view, we embrace information that confirms that view while ignoring, or rejecting, information that casts doubt on it. Confirmation bias suggests that we don’t perceive circumstances objectively. We pick out those bits of data that make us feel good because they confirm our prejudices.\n\n[Echo Chambers](https://www.psychologytoday.com/us/blog/unspeakable-gifts/201702/beyond-the-echo-chamber)\n\n&gt; One context for this is the echo chamber many of us are absorbed in on social media. We tend to follow the like-minded. We may not even be aware of how Facebook and other platforms group and shape us with their algorithms. When others with different views jump in, voices that have become exaggerated within their own circles clash with ours. We’ve likely all observed, if not taken part in, the amplification of this: rants, click bait, manipulation, and worse.\n\n&gt; Too often, we stop seeking out opposing viewpoints. Ascertaining where they are coming from, evaluating them, and even critiquing our own. Sometimes we’re too scrambled and self-absorbed to even listen.\n\n--------------\n\nNow consider this in gaming communities or whatever game you may play...\n\n- Have you ever felt you had an opinion that's different from the one established by an outraged majority, and the moment you speak up, you're suddenly shut out?\n\n- Have you ever seen someone angered by microtransactions that he feels that *'people who buy them are part of the problem'*?\n\n- Have you ever seen how gamers readily accept views that also trigger their outraged sentiments, and any dissenting opinion is quickly drowned out?\n\n- Have you ever felt outraged at something and felt the need to voice it on the internet because you know what you feel is a fact; but when pressed for real-life action, these are also things you would not say to people face-to-face?\n\nie. *In situations where people feel that those who buy these 'are also buying in to corrupt practices' or are 'ruining the games industry' - have you ever been able to walk up to a gamer in a store, or a dad buying his son a game, to tell them the same thing face-to-face?*\n\n\n---------------\n\nCan you cite some instances of this among gamer interactions you've had? Or how gamers interact with developers or community managers/moderators that you've noticed?\n\nHas there been a time when you felt that you were powerless or helpless to solve an issue with a video game that you felt that outrage and seeking only like-minded opinions was the way to empower your voice?\n\nIf you feel so strongly or are outraged about an issue in a game, have you tried reaching out to another gamer who does not feel the same, or as strongly about it, as you do?\n\n---------\n\nThank you for reading.\n\n----------\n\n**Notes:**\n\nThe original topic was posted on r/Games and someone messaged me saying I should also share this to the r/truegaming sub for more discussions.\n\nAdditional topics I've written just for anyone who's interested in reading more about tempering outrage, constructive criticism, how controversy fuels video game journalism, etc.\n\n- [Destiny 2: On the effects of outrage, managing it for a balanced viewpoint, and finding discussions](https://www.reddit.com/r/LowSodiumDestiny/comments/871cb9/on_the_effects_of_outrage_managing_it_for_a/) - *this is a critical look at many Destiny communities and how they are fueled by outrage, including the way players and developers are treated in terms of communication*\n\n- [Vermintide 2: How to provide constructive criticism for developers, from a developer](https://www.reddit.com/r/Vermintide/comments/85ptf8/vermintide_2_how_to_provide_constructive/) - *this was an edited version of someone else's topic whom I've credited, edited to fit the VT2 sub*\n\n- [The Division: How a fake exploit manipulated an entire subreddit and the news was reported as fact by gaming websites](https://www.reddit.com/r/thedivision/comments/4g6osh/hey_rthedivision_agents_im_sorry/) - *this was when the playerbase was very disappointed and angry, and fake info was passed off as fact by gaming websites, and gamers became more outraged*",
        "created_utc": 1522064035,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion: A look at how outrage, echo chambers, and confirmation bias shape our interactions with developers and other gamers",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Games/comments/872sr0/discussion_a_look_at_how_outrage_echo_chambers/",
        "text": "[deleted]",
        "created_utc": 1522063376,
        "upvote_ratio": ""
    },
    {
        "title": "Friendly hello from the developers on Jetpack Joyride!",
        "author": "lolpancreas",
        "url": "https://www.reddit.com/r/truegaming/comments/877ldr/friendly_hello_from_the_developers_on_jetpack/",
        "text": "Hey guys n gals,\n\nI work at Halfbrick Studios as a new dev on Jetpack Joyride.\n\nBasically, I'm a developer for the mobile game Jetpack Joyride and I'm looking to start actually engaging with the Reddit community more, because there's next to no place for our players to actually discuss specifically the game (outside of gaming subs like this).\n\nAt this point I'm really looking for feedback from players and to offer them a way to help develop the game with us.\n\nSo if you're interested, check out our /r/jetpackjoyride subreddit.\n\nOr if you have any questions, feel free to ping me. :)",
        "created_utc": 1522053487,
        "upvote_ratio": ""
    },
    {
        "title": "Game overlays - Like them or not? What could be better?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/876qrd/game_overlays_like_them_or_not_what_could_be/",
        "text": "[deleted]",
        "created_utc": 1522042231,
        "upvote_ratio": ""
    },
    {
        "title": "What is the future of handheld consoles?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/876hka/what_is_the_future_of_handheld_consoles/",
        "text": "[deleted]",
        "created_utc": 1522039099,
        "upvote_ratio": ""
    },
    {
        "title": "Could a main-series Pokemon title be coming to Switch this year?",
        "author": "defusei",
        "url": "https://www.reddit.com/r/pokeswitch/comments/871duz/could_a_mainseries_pokemon_title_be_coming_to/",
        "text": "",
        "created_utc": 1522027893,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a nice chair to sit on while gaming",
        "author": "farmer_dabz",
        "url": "https://www.reddit.com/r/truegaming/comments/875cz5/looking_for_a_nice_chair_to_sit_on_while_gaming/",
        "text": "[removed]",
        "created_utc": 1522027197,
        "upvote_ratio": ""
    },
    {
        "title": "Playing Persona for the first time, and the silly way it helped me being more social",
        "author": "o_controverso",
        "url": "https://www.reddit.com/r/truegaming/comments/8759bh/playing_persona_for_the_first_time_and_the_silly/",
        "text": "So, I've heard a lot about Persona and finally decided to give it a try last month. I started playing Persona 3 Portable on my PSP and it actually got me pretty hooked, I'm impressed as I have trouble liking JRPGs since I became an adult\n\nSo, until last year I was having a hard time in the college I was in so I quitted and now I'm doing a new course at a new college from zero. Although this time the college is in my home town, I don't really have any friends or know anyone my age here anymore. So I found the game very relatable as I was in a situation pretty identical to the main character (just started a new school, doesn't know anyone, has to fight evil monsters, you know the drill)\n\nIn the game you have your group which fight monster, but, other than that, you're on your own and can develop activities, meet people, create bonds, study, play videogames. It's a sort of life simulator, but you need to be careful with your time management since when you choose to do something that afternoon/evening, you lose time you could be spending doing other stuff\n\nI am a very shy and somewhat introvert guy and recently my social interaction were all online, which are in some ways very different from a person to person interaction. The game taught me some lessons which are helping me break out of my shell:\n\n- If you want to make friends, you need to spend time with people. I was always spending intervals on my phone and when classes ended I would go straight home. I realized that if I wanted to make friends, I needed to spend time with them, even if it meant I gave up some time I could be doing other stuff like studying or reading\n\n- If you want a stronger bond with your friends, many times you'll do things you don't wanna do or talk about things you don't wanna talk. It might be a conversation topic you don't care about or going out to see a movie you probably won't like. Well, I don't think anyone should be a pushover or anything, but at the same time you can't have things always be your way. Learned this because there were characters that clearly wanted to spend time with me, but I only did it to develop social links which \"make Personas you create gain experience\". I actually found that people I think I wouldn't like at first turned out to be interesting and actually quite cool\n\n- It's okay to talk to people out of interest. And I don't mean it in a selfish way as \"you should build relationships to get stuff in return\" but, for example, in this college I'm turning out to be a rather smart and dedicated student and I wanted to talk a couple of people that seemed to have the same goal and were passionate about it. At the first day this seemed impossible, but yesterday I actually hang out with both of them and I'm quite satisfied. I guess I realized sometimes getting interact with people like asking them which room is your class, how to solve a programming problem and other stuff might facilitate a friendship\n\nLots of other interesting stuff happened. In the game I upped my \"charm\" stat by participating and answering correct questions in class. I found this silly and thought \"this must be something that only happens in Japan\". But the other day I've had 2 classmates praise me for a presentation I did, and I realized people indeed take notice when I participate in class. The difference is that in real life there's no text prompt to make that obvious\n\n**TL;DR:** I guess I had trouble realizing how much control I actually have on the social and academic aspect of my life. Playing the game as I lived through it made me make a lot of parallels between the game and real life and I'm happy",
        "created_utc": 1522026167,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any games where you lose the right to play if/when you die?",
        "author": "PhoenixJ3",
        "url": "https://www.reddit.com/r/truegaming/comments/874obw/are_there_any_games_where_you_lose_the_right_to/",
        "text": "[removed]",
        "created_utc": 1522020579,
        "upvote_ratio": ""
    },
    {
        "title": "What if games weren't self-contained?",
        "author": "Chocodisco",
        "url": "https://www.reddit.com/r/truegaming/comments/873gd9/what_if_games_werent_selfcontained/",
        "text": "From a programming perspective, a game that is self-contained only makes sense. But I often wonder to myself, would it work if games were so \"moddable\" that game creators for example create an \"RPG pack\", a \"RTS pack\", and a \"strategy pack\", and the player can choose which genres they would like in their game?\n\nThink if Nintendo (never in a thousand years because Nintendo) created the ultimate Pokemon game of the future. The player can choose to purchase any of the combination of the following packs: story (rated teen or rated mature), multiplayer, action combat, turn based combat, world map (divided further into specific packs for each area), and even a mod-support pack. Of course, some of these are going to be incompatible with each other. For example, multiplayer may not be compatible with mod-support, and action combat is not compatible with turn based. \n\nIf I just wanted a good time battling my friends online in action combat, I would just buy the multiplayer and action combat packs. No story, no mods, no world map needed. But if I wanted the standard Pokemon experience, I'd buy rated teen story, turn based combat, and world map (all regions that includes all the newest gen pokemon). \n\nA simpler analogy might be that instead of buying a full packaged dinner, you go out and purchase separate ingredients that go best together for you to make your own dish.\n\nOk, that might be way too far fetched. Let's think about it from another perspective.\n\nHow about a service that connects games together, thus making games \"semi\" self-contained?\n\nFor example, you're a big fan of MOBA games (let's say League) and you're a big fan of grand strategy games. A company strikes a deal with Riot and your favourite grand strategy game developer. They produce a product that allows you to use the data from your wins/losses/stats per game/season and port them into the strategy game. For every match you win or lose in League, you win/lose a skirmish in the other game. The skirmish battle feature in the strategy game is essentially disabled and put on pause until your League match is complete and stats accounted for. If the strategy game is single player only, the service might even be configurable so you can customize the \"port\".\n\nThere could also be a service that doesn't link two games, but creates a separate mini-game to go with your main game. For example, a story-less game like CS:GO could have a story attachment service. The company behind this service creates a choose-your-own-adventure text based game (written to loosely fit the CS:GO setting) and the dialogue options in the story actually trigger real CS:GO matches. Depends on the match outcome, the story develops differently.\n\nExcuse the odd examples, but I think you get the idea. Companies create IP-conflict-free (assuming no deal was struck with the other game) content that has \"gaps\" which the player fills by playing any other game of their choice.\n\nTL:DR\n\nCan the gaming industry ever evolve to sell different main features of a game separately?\n\nCan there ever be a service created to bridge your two or more favourite games together?\n\nHow about a service that enhances your game by allow the player to fill gaps in the the service with results from the game?",
        "created_utc": 1522009649,
        "upvote_ratio": ""
    },
    {
        "title": "Tricky Road game - from imagination to execution !",
        "author": "aman_51995",
        "url": "https://www.reddit.com/r/truegaming/comments/872zqt/tricky_road_game_from_imagination_to_execution/",
        "text": "[removed]",
        "created_utc": 1522005701,
        "upvote_ratio": ""
    },
    {
        "title": "The \"gaming\" of today",
        "author": "ItsOuttaSite",
        "url": "https://www.reddit.com/r/truegaming/comments/872vpp/the_gaming_of_today/",
        "text": "Having been a gamer for over thirty years I've seen a lot in the industry change and evolve for the better and for the worse, really.\n\nGames struggled for a while to be considered as art, unfairly. Now it seems as though, after a good while of them being treated as integral creative projects the industry has, for some part, followed a wayward path in regard to those titles that are built around addictive gameplay. And nothing more. There's no real substance there, just mechanics designed to keep the dopamine firing, the online purchases rolling in, and the 'player' 'playing', with no real satisfaction at the end of it. (Why would they risk anyone feeling a sense of achievement?!) Of course gaming on the whole has always had that 'hook' component implemented in certain titles but it's in so many of them now. It's not just the online competitive games, there are of course other titles that are designed in such a way that the numbers get their hooks into the gamer and have them take on the role of a donkey who's following a carrot dangling in front of it. Even a lot of adventure titles that are extremely long, seem to have been designed to BE an extremely long title. The rpg's, etc of yesteryear of which the huge story and immersive experience pretty much needed to have seventy/eighty hours to get through it all, aren't around as much. Or at least as prominent.\n\nThis may seem like a dated 'rant' but it's a situation that's grown to such huge proportions I don't think it's as apparent as it should be. I think these empty, greedy experiences will have their day and start to lack in popularity, but I wonder what it'll take for that to happen. I'm under no illusion that they're pretty much here to stay in a lot of ways but I wonder if the growing popularity of retro gaming and indie gaming is, in part, because of these 'fast food' games. Every cloud, I suppose....",
        "created_utc": 1522004769,
        "upvote_ratio": ""
    },
    {
        "title": "Building a Empire/ Kingdom/ Homebase, etc.",
        "author": "Jlpeaks",
        "url": "https://www.reddit.com/r/truegaming/comments/872ejx/building_a_empire_kingdom_homebase_etc/",
        "text": "[removed]",
        "created_utc": 1522000709,
        "upvote_ratio": ""
    },
    {
        "title": "Are Video Games Art?",
        "author": "Gamedenker",
        "url": "https://www.reddit.com/r/truegaming/comments/8729qh/are_video_games_art/",
        "text": "[removed]",
        "created_utc": 1521999556,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think reading too much about games can affect your enjoyment with them?",
        "author": "Bulldorc",
        "url": "https://www.reddit.com/r/truegaming/comments/871yvw/do_you_think_reading_too_much_about_games_can/",
        "text": "Hey all! \n\nSomething I've been noticing lately is that I've been reading quite a bit about games, as in reading discussions on Reddit or other forums, opinion pieces or even watching YouTube analysis videos.\n\nI feel like lately this has been altering my enjoyment of the games themselves, as I go in with many different opinions or discussions in my head that influence my perception of a game beforehand and then during the time I'm playing it.\n\nAs an example - I've read many opinions about Shadow of Mordor before buying the game. I've read good things, bad things, read about the mechanics and the systems, the comparisons to other games and all that.\nI'm currently playing the game and I'm honestly not sure if I'm enjoying it or not. I have so many of those opinions in my head that I don't know anymore if I have one of my own.\n\nI'm also buying games based on all of these opinions and hype instead of buying something that actually appeals to me.\n\nHas this happened to any of you? Did you ever feel your enjoyment of a game was tempered with by reading too much about it or games in general in discussion forums and so forth?\n\nI'm thinking of abstaining myself from reading too much online for a while to see if this \"feeling\" goes away.\n\n",
        "created_utc": 1521996985,
        "upvote_ratio": ""
    },
    {
        "title": "Is it ok for episodic games to have major changes in gameplay/art style/engine along the way?",
        "author": "zeddyzed",
        "url": "https://www.reddit.com/r/truegaming/comments/870ebq/is_it_ok_for_episodic_games_to_have_major_changes/",
        "text": "Hi, the recent post about Mass Effect reminded me of another episodic series that received big changes between games:  Xenosaga.\n\n\nIt had a major change in art style in #2 (from a more cartoony style to a less cartoony style) and each game had a different combat system, IIRC.\n\n\nSo taking these two examples of game series that had an overarching story told in episodes with each game, do you think it's an acceptable idea for them to make major changes of gameplay, art style, or engine, along the way?\n\n\nPersonally, I feel like, if you're going to make an episodic story, you're kinda committed to making something that will be a complete and consistent product at the end when all the episodes are put together (in a boxset or something).  It's fine to make improvements along the way, but they should take the form of something that can be patched into the earlier games (or for platforms that dont support patching, in the final, complete re-release.)\n\n\nMaking huge changes along the way is like changing actors during a TV mini series (or retconning entire characters out.)  Sure, sometimes it's unavoidable due to people quitting or whatever, and sometimes the replacement might even be better, but it's still a negative to be avoided if possible, in my eyes.  Unless you can go back and re-film the earlier episodes to make them consistent.\n\n\nNote that I only mean episodic games, which have an overall story designed for multiple games.  Not series that just have regular sequels (like Dark Souls or Devil May Cry etc)",
        "created_utc": 1521981084,
        "upvote_ratio": ""
    },
    {
        "title": "WI: Video Games had been begun being marketed to girls after the 1980s video game crash?",
        "author": "ThePoarter",
        "url": "https://www.reddit.com/r/GameSociety/comments/8704nx/wi_video_games_had_been_begun_being_marketed_to/",
        "text": "",
        "created_utc": 1521977669,
        "upvote_ratio": ""
    },
    {
        "title": "Let's Watch/Twitch IS the equivalent of reading cliff notes of Shakespeare in school... Yes or No_",
        "author": "mr2guy0",
        "url": "https://www.reddit.com/r/truegaming/comments/86zpuy/lets_watchtwitch_is_the_equivalent_of_reading/",
        "text": "[removed]",
        "created_utc": 1521969759,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about selling old (often unused consoles?)",
        "author": "loven329",
        "url": "https://www.reddit.com/r/truegaming/comments/86zo0o/how_do_you_feel_about_selling_old_often_unused/",
        "text": "[removed]",
        "created_utc": 1521968805,
        "upvote_ratio": ""
    },
    {
        "title": "do You play niche genres in gaming?",
        "author": "mr2guy0",
        "url": "https://www.reddit.com/r/truegaming/comments/86zfun/do_you_play_niche_genres_in_gaming/",
        "text": "[removed]",
        "created_utc": 1521964676,
        "upvote_ratio": ""
    },
    {
        "title": "Need a controller for Emulators",
        "author": "hgcwarrior",
        "url": "https://www.reddit.com/r/truegaming/comments/86ymme/need_a_controller_for_emulators/",
        "text": "[removed]",
        "created_utc": 1521952532,
        "upvote_ratio": ""
    },
    {
        "title": "What is it about Ice-based characters in multiplayer games?",
        "author": "ZeNorseHorseSleipnir",
        "url": "https://www.reddit.com/r/truegaming/comments/86yise/what_is_it_about_icebased_characters_in/",
        "text": "I've been noticing a trend with Ice-based characters in multiplayer games. They start out extremely powerful, piss off the entire playerbase, and then get nerfed to hell. Why does this always happen?",
        "created_utc": 1521951205,
        "upvote_ratio": ""
    },
    {
        "title": "Do game achievements that are rewarded for unlocking all other game achievements seem kind of redundant?",
        "author": "vinnvout",
        "url": "https://www.reddit.com/r/truegaming/comments/86xuh6/do_game_achievements_that_are_rewarded_for/",
        "text": "[removed]",
        "created_utc": 1521943462,
        "upvote_ratio": ""
    },
    {
        "title": "Whats the best game you are looking forward to on the switch besides Smash Bros?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/86xnlw/whats_the_best_game_you_are_looking_forward_to_on/",
        "text": "[removed]",
        "created_utc": 1521941435,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any actual fans of the Devil May Cry reboot?",
        "author": "pat3548",
        "url": "https://www.reddit.com/r/truegaming/comments/86wyuz/are_there_any_actual_fans_of_the_devil_may_cry/",
        "text": "[removed]",
        "created_utc": 1521934742,
        "upvote_ratio": ""
    },
    {
        "title": "HOI4 VS Sid Mier's Colonization (94 version and 8 bit memory)",
        "author": "druebey",
        "url": "https://www.reddit.com/r/paradoxplaza/comments/86wgmy/hoi4_vs_sid_miers_colonization_94_version_and_8/",
        "text": "",
        "created_utc": 1521931835,
        "upvote_ratio": ""
    },
    {
        "title": "Sea Of Thieves' currently perceived quality reaffirms my thoughts on the dangers of \"service games\"",
        "author": "DeusXVentus",
        "url": "https://www.reddit.com/r/truegaming/comments/86vi20/sea_of_thieves_currently_perceived_quality/",
        "text": "https://www.reddit.com/r/JimSterling/comments/7tnqu0/xbox_game_pass_concerns_me_for_the_potential/\n\nHere one of my main points was basically that these \"service\" games are designed less around being an actual game, and more around being a vector for monetisation and some laughs with friends. Xbox Game Pass facilitates that model to the nth degree, meaning that new releases almost completely sidestep the 60 dollars worth of revenue from a standard game sale.\n\nSea Of Thieves is one of 3 \"big\" Xbox exclusives to come out this year, and we already know State Of Decay 2 is going to be a mid budget game. Which, in a vacuum, isn't a bad thing, but there's a reason why they're offering it up for 10 bucks on game pass. It's probably not very good, and if they aren't putting microtransactions in now, you can bet they will in the future. \n\nMicrosoft generally seems to be pulling away from making games  the \"traditional\" way, and is trying to push the industry in the streaming \"service\" direction. A direction I don't think many on this sub want.\n\nSea Of Thieves perfectly represents what \"live services\" are increasingly becoming. Trend chasing, incomplete games that don't really have a leg to stand on unless you're messing around with your friends.  \n\nThe industry isn't going to learn that it won't work until we start seeing the same number of failures we did back when every studio and their dogs were making FPS games in the 7th gen, or MMOs half a gen before that. Even Epic can't tell you why Paragon failed. Even though it's blatantly obvious.\n\nI do expect Rare to close down within the next few years. ",
        "created_utc": 1521921138,
        "upvote_ratio": ""
    },
    {
        "title": "I'm sick of the backlash against open world games",
        "author": "3rdOption",
        "url": "https://www.reddit.com/r/truegaming/comments/86ui93/im_sick_of_the_backlash_against_open_world_games/",
        "text": "I say this as someone who has been on both sides of the debate: both as someone who wants well-loved franchises like Zelda, Pokémon, or Metroid to go open world, and as someone who wants their franchises to be linear. I'm sick of people arguing that open world sucks and that we need to return to linearity.\n\nYes, modern open world games are prone to padding and bad pacing. But even though there are great linear games like Half-Life or Uncharted, there are always going to be a ton of linear games suffering from padding (Zelda: Skyward Sword), poor mechanical pacing (Final Fantasy 13), bad stories (Metroid: Other M), or inconsistent gameplay (Crash: Wrath of Cortex). Likewise there will always be open world games that are well-paced and accessible (GTA series in general), well-written (Witcher 3) or mechanically impressive (Zelda: Breath of the Wild). I think it's clear that Sturgeon's Law applies to both linear and open world games, even more so when one side is more popularly developed.\n\nAll in all, I don't care whether a game is linear or open world anymore. I just want it to be well-paced, engaging, and *fun* above all else. I can get that no matter whether I pick up an open world or linear game, and either can fail at that.\n\nThat said, I think we need to see more series take a middle-ground: where you unlock increasingly large spaces that you can run around, but in a linear order. Games as classic as Banjo-Kazooie or as modern as Mario Odyssey are my personal models for this.",
        "created_utc": 1521912449,
        "upvote_ratio": ""
    },
    {
        "title": "Games for a dad with volatile free time?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/86u2u5/games_for_a_dad_with_volatile_free_time/",
        "text": "[removed]",
        "created_utc": 1521908625,
        "upvote_ratio": ""
    },
    {
        "title": "Do you guys think that the Xbox One X is worth the money?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/86ty0m/do_you_guys_think_that_the_xbox_one_x_is_worth/",
        "text": "[deleted]",
        "created_utc": 1521907402,
        "upvote_ratio": ""
    },
    {
        "title": "Open world pvp games",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/86tkpe/open_world_pvp_games/",
        "text": "[removed]",
        "created_utc": 1521903963,
        "upvote_ratio": ""
    },
    {
        "title": "Itch.io explains how their curation works.",
        "author": "igd3",
        "url": "https://www.reddit.com/r/gamedev/comments/86rj4f/itchio_explains_how_their_curation_works/",
        "text": "",
        "created_utc": 1521875531,
        "upvote_ratio": ""
    },
    {
        "title": "Which games inspired Pokemon?",
        "author": "Davidee88",
        "url": "https://www.reddit.com/r/truegaming/comments/86py12/which_games_inspired_pokemon/",
        "text": "[removed]",
        "created_utc": 1521855566,
        "upvote_ratio": ""
    },
    {
        "title": "Come stop by! One of the top gamers live on Twitch",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/86px79/come_stop_by_one_of_the_top_gamers_live_on_twitch/",
        "text": "[removed]",
        "created_utc": 1521855328,
        "upvote_ratio": ""
    },
    {
        "title": "What plot twist, trope or general story element are you waiting to see in a game?",
        "author": "complaintaccount",
        "url": "https://www.reddit.com/r/truegaming/comments/86p7us/what_plot_twist_trope_or_general_story_element/",
        "text": "I'll start with one I ended up seeing (spoilers for MGS:V and KotOR):  \n&amp;nbsp;  \nFor a while, I was thinking about how a hospital and facial reconstruction would be a great natural setup for character customization.  You'd end up with a character that felt like yours, but that you wouldn't know the background of (maybe they were an important missing character, or the true villain, basically an alternative way to put Revan).  \n&amp;nbsp;  \nThen the game basically did it, it passed up on making the character an important secret other character (which to be fair to the series, kind of had to happen for continuity).  I think I enjoyed the direction it took even more.  \n&amp;nbsp;  \nEdit: removed a really, the crutch adjective.",
        "created_utc": 1521848452,
        "upvote_ratio": ""
    },
    {
        "title": "Are you happy with the way the Mass Effect trilogy changed from the first game to the second and third?",
        "author": "Eat_Mor3_Puss",
        "url": "https://www.reddit.com/r/truegaming/comments/86nt23/are_you_happy_with_the_way_the_mass_effect/",
        "text": "I know there's already a popular Mass Effect thread on here, but it reminded of something that's always bothered me about the ME trilogy. Thematically, the first game was very different than the second and third games. Exploration was a key aspect of it, and it gave the player (or at least, it gave me) the distinct feeling that I was \"explor[ing] strange new worlds... seek[ing] out new life; [and] new civilizations...\". It almost felt like a Star Trek game. \n\nUnfortunately, ME1's exploration missions were pretty bland. Instead of improving on what they'd done, Bioware scrapped them entirely, and focused more on story and character development. Don't get me wrong, I loved ME2 (ME3 is *okay* imo). There was a lot of dialogue, and I loved getting to know my teammates. Likewise, the gunplay and pacing were *greatly* improved, but that feeling of wonder was missing in both games, at least for me. Even the music was different - more action oriented. And the story took some strange directions that I won't get into, at least for now, for the sake of brevity.  \n\n________________________________________________________________________________________________\n\nDo you agree?\n\nWould it have been feasible for Bioware to try and improve exploration?\n\nWhy are the 2nd and 3rd games so much more action-oriented than the first one? \n\nDid you like the way the story progressed?\n\n,etc.\n\n",
        "created_utc": 1521836558,
        "upvote_ratio": ""
    },
    {
        "title": "Webcam picks up sounds. How to disable",
        "author": "CarlosTheSnail",
        "url": "https://www.reddit.com/r/truegaming/comments/86n5h4/webcam_picks_up_sounds_how_to_disable/",
        "text": "[removed]",
        "created_utc": 1521831381,
        "upvote_ratio": ""
    },
    {
        "title": "Do people still hate the Mass Effect 3 ending? (Spoilers)",
        "author": "SolasLunas",
        "url": "https://www.reddit.com/r/truegaming/comments/86m3ym/do_people_still_hate_the_mass_effect_3_ending/",
        "text": "I recently did a full trilogy playthrough, (ME 1,2, and 3 with all plot dlc,) and had my character and decisions carried through each one.  \nFrom my experience, I felt that the ME3 ending did a fantastic job of wrapping up the series (aside from lacking a \"best ending\" with the Commander surviving.)  \n\nI read how the ending went *before* the extended cut was released, and that was definitely deserving of the backlash, but I wonder what the community thinks of the series *after* the extended cut. Did you enjoy it? Did you feel like the decisions carried over well? What could've been better?",
        "created_utc": 1521823564,
        "upvote_ratio": ""
    },
    {
        "title": "An unspoken underlying issue with God of War?",
        "author": "heroic_stoic",
        "url": "https://www.reddit.com/r/truegaming/comments/86lvb8/an_unspoken_underlying_issue_with_god_of_war/",
        "text": "I'm looking forward to playing the new God of War game, but youtube suggested a video to me that reminded me of a small gripe I have with the game.\n\n&gt;God of War 2018 Is Not God of War At All | And That's Amazing (uploaded by cleanpricegaming)\n\nGod of War has changed so much that I find it a bit odd that it **is** a God of War game.\n\nAlmost everything is different. The only things linking the game to the series is Kratos and the mythological concept. If they had created a different protagonist, the game would've turned out the same way. But besides that, I'm happy to see the more human side of Kratos. \n\nI'm just worried about companies being afraid to take risks with new IPs. ",
        "created_utc": 1521821767,
        "upvote_ratio": ""
    },
    {
        "title": "Opinion on this simple solution to toxicity in online games?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/86lpxo/opinion_on_this_simple_solution_to_toxicity_in/",
        "text": "Hi,\n\njust posted this in another sub where the question was \"How would you fix toxicity in online games? and am interested in hearing this subs opinion:\n\n___\n\nI think to fix this issue, you need to address the root of the problem - Why are people being toxic in the first place?\n\nThe answer is:\n\nA) Because its a team based game where you can only win if the rest of your team is decent.\n\nB) Because they are win-lose games. There's no thing like a draw.\n\nC) Because of anonimity. On the internet, people can say what they want without the repercussions they would face in real life\n\nIn my opinion, its impossible to fix this problem entirely, 100%. There will always be trolls and toxic people. They have been around since the beginning of the internet, and there are always new ones arriving from the younger generation.\n\nTherefore, one simple solution that I would strongly emphasize whenever this topic comes up is this:\n\n**Games should tell people to use the mute button more**\n\nYes, its that simple. And here is why.\n\nLoL has already taken steps towards this. They first added a mute button to mute the chat. Then, they added a mute button to mute pings, because people were still spamming pings to harass people. Last, they even added a mute button to mute emotes, because people would mock other people through emotes.\n\n**Trolls get bored when there is no reaction.**\n\nReactions are what drives toxic people on. They insult someone, and if that person replies with either an insult or something like \"well, you suck as well\" then the flaming begins.\n\n___\n\nHumans are animals. You can also observe this very well in small children:\n\n\"I want this!\"\n\nNo reaction\n\n\"I WANT THIS!\"\n\nNo reaction\n\n\"I WANT THIS\"\n\nNo reaction\n\nAfter a while, they will give up. No one likes talking to a wall.\n\nIn my opinion, the easiest solution to this is telling players at the beginning of each match \"REMEMBER, THERE IS A MUTE BUTTON. IF SOMEONE IS TOXIC, MUTE THEM!!!\"\n\n___\n\nThere is no other solution. LoL has introduced various systems - First, you get a warning. Then you get a chat-block for 10 games. Then, you get a 1 week ban. Then, you get a perma-ban.\n\nPeople *still* make new accounts and keep being toxic.\n\nLoL introduced an honor system. Honorable players get rewards in form of loot boxes and exclusive skins.\n\nPeople are *still* toxic.\n\nThe solution here is not something built into the game. Its not an automatic action developed by the studio. Its not an AI to filter out toxicity. Its not bans or cracking down on people.\n\nThe solution has to be self-action by the players that are being targeted. The fix here is to fix society as a whole. And that means - people have to learn to use the mute button.",
        "created_utc": 1521820646,
        "upvote_ratio": ""
    },
    {
        "title": "I miss the Old Telltale Games",
        "author": "thesame98",
        "url": "https://www.reddit.com/r/truegaming/comments/86l9h9/i_miss_the_old_telltale_games/",
        "text": "[removed]",
        "created_utc": 1521817042,
        "upvote_ratio": ""
    },
    {
        "title": "Why did Fortnite blow up so much??",
        "author": "revolverlolicon",
        "url": "https://www.reddit.com/r/truegaming/comments/86l08b/why_did_fortnite_blow_up_so_much/",
        "text": "Fortnite seems to have gone from being something that people called a PUBG clone to being a game that Roseanne Barr tweets about. It's become the most streamed game on twitch, but what confuses me more is how much mainstream appeal the game has. Even in my own life I see it pop up, at a recent family event my dad asked me what I knew about it and its what my cousins were talking about. NFL players are talking about it. The game is becoming pretty inescapable at this point. Like, worse than minecraft was in its peak. How did this happen???",
        "created_utc": 1521815046,
        "upvote_ratio": ""
    },
    {
        "title": "Why the dialogue system hasnt change so far?",
        "author": "teosito",
        "url": "https://www.reddit.com/r/truegaming/comments/86kueq/why_the_dialogue_system_hasnt_change_so_far/",
        "text": "In all rpg dialogue is an important part of the game, but so far the way your character interacts with a npc with important information is, usually, a skill check. Do you have enough charisma? if yes, then you succed, else you fail. This was used in morrowinds combat and almost everyone hated that, but it seems like nobody cares about the same thing in the dialogue tree.\n\nWhy has the dialogue system stayed the same as in pen and paper games when there is the option to add more depth giving more choice to the player? ",
        "created_utc": 1521813804,
        "upvote_ratio": ""
    },
    {
        "title": "What would it take to further separate AAA games from mainstream gaming?",
        "author": "Renegade_Meister",
        "url": "https://www.reddit.com/r/truegaming/comments/86kr1t/what_would_it_take_to_further_separate_aaa_games/",
        "text": "**TL;DR:** Read exerpts in bold.\n\n**AAA games seem to still have a similar presence or influence in mainstream gaming as several years ago**, despite:\n\n* More non-AAA games &amp; choice, increases competition and potentially quality of available games (thanks to many decreases in market barrier-to-entry for PC and console games)\n\n* Lower average price spent per game due to above as well as more digital bundles of games\n\n* **A growing difference between price and/or monetization of the average priced game vs AAA games** (defined as \"typically have higher development and marketing budgets\")\n\nSo when I see more comments over time like \"[AAA game] shouldn't cost/monetize this much\", I believe the mainstream gamer sentiment behind it is:  **Less AAA games are made for me, but are instead made for whales &amp; high-end gamers** AND/OR AAA games need to leave mainstream gaming.\n\nI'm not talking about AAA publisher practices or political motivations, because mainstream gamers don't care about that, but **it is obvious to mainstream gamers when their AAA games change or increase their monetization because it impacts what they see &amp; do in their games**.\n\nSo **if AAA games are made less &amp; less for mainstream gamers, then wouldn't it make sense for mainstream gaming to distance itself a lot more from AAA games?**\n\nTo reinforce my theory that AAA games influence on mainstream gaming hasn't decreased much, consider this: In many other industries, if a product begins to cost more than the average and is also more than I'm willing to pay (all things considered), normally I or other people would just say \"Whatever - That product is out of my price range\".  The fact that more average/mainstream gamers like me don't just react to increased AAA game monetization with \"whatever\" indicates how ingrained AAA games are to mainstream gaming.\n\nHere are some follow up questions:\n\n* **How far does \"vote with your wallet\" really go toward separating AAA games from mainstream if the wallets of high end &amp; whale gamers are the ones keeping AAA games profitable enough to keep it there?**\n\n* How much does the gaming media play a part in AAA being engrained in mainstream?  Does stuff like penalizing monetization methods in reviews help, which is what a site announced earlier this week?  Do they criticize AAA monetization enough to make a difference, or would a full on assault from them to AAA not reach enough or the right gamers?\n\n* What can non-AAA games do to take more of mainstream gaming?  Support gaming media outlets that don't take AAA (ad) money?  Call out the bad in AAA games?\n\n* If acceptance of AAA games as not-mainstream were measured by the frequency of gamers responding to these games with something simple like \"whatever\", how long will it take for significantly more acceptance of that, if ever?\n\nEDIT: Added clarification that I'm not talking about merely AAA publisher practices or political motivations.",
        "created_utc": 1521812986,
        "upvote_ratio": ""
    },
    {
        "title": "What movie cliches could work as a game?",
        "author": "mmmmoneyshot16",
        "url": "https://www.reddit.com/r/truegaming/comments/86kob0/what_movie_cliches_could_work_as_a_game/",
        "text": "[removed]",
        "created_utc": 1521812271,
        "upvote_ratio": ""
    },
    {
        "title": "The opportunity to beat the game and circument difficulty - Is it an absolute MUST for every modern videogame today?",
        "author": "Klunky2",
        "url": "https://www.reddit.com/r/truegaming/comments/86klmu/the_opportunity_to_beat_the_game_and_circument/",
        "text": "I found parts of that topic in certain threads here and after completing Celeste I had that urge to discuss that topic with other enthusiastic players.\n\nIt occurs much more rarely in todays games, but it does, the moment when you get stuck. The moment when you ask yourself the question \"Am I able to beat it?!\" \n \nThe moment when the difficulty ramps up to much, so much that you don't feel any longer that you are able to push foward. The current obstacle whatever it may be, poses to much of challenge, after countless tries you don't believe you are able to finish it and so... \n\n...you try to use whatever the games offers to you to cirumvent the challenge. \n\nIn terms of Celeste, there is an assistant mode which offers you a bandwith of possibilites to adapt the game to your current skill level: you can slow down the game, can skip difficult levels, turn yourself invincible for a given time (which is decided by yourself)...etc \n\nSo progression is not longer a matter of your skill, muscle memory or whatever, you can bypass that certain section whenever you want with slight adjustments on demand, so that it feels still somewhat challenging for yourself. \nAnyway the question now changes: it's not longer \"Am I able to beat it?!\" it's much more \"Am I able to hold myself back?\"\nThe game no longer demands requirements from you, the requirements are totally up to you.\n\nThe point is: In most older games where there aren't any difficulty options to begin with, such opportunitys were as rare as the absence of the same today.\nThat means, if your aren't able to beat it... that's it. You can try whatever you want, if the game is well thought out about it's challenging aspect you can just try. \n\nIn the past where I was much younger I simply surrendered and played another game, or played previous sections because the game was still fun.\n\nWith todays standards of giving the player the option to make the game easier or trivial for yourself this phenomenon is almost history.\n\nThere is much content in older games I've never seen until now, just because I wasn't good enough, it's some sort of exclusivity. \nSometimes I wasn't even halfway through, so it feels like I paid the whole price just for the half of the game right? There is so much more to discover, but an obnoxius barrier between it.\n\n- Are you able to appreciate a game, even if you aren't good enough to beat it?\n\n- Do you tend to go back to games which you couldn't beat in the past?\n\n- Do you think it's important that every player, on every skill level should be able to beat the game?\n\n- Do you know examples of games which where actually starting to get fun after you stuck for a certain while?\n\n\nWell, my opinion in short:\n\nI was very frustrated in the past about games which I couldn't beat, I would use cheats whenever I get stuck if I had the possiblity. \nBut at some time I realised that progression in games is pretty much worthless if it isn't earned, I realized a difficulty curve which grows with your abilitys is one - if not the MOST - important aspect of a game to me.\n\nAs such new content after hard obstacles feels like earned, hard bosses or similiar challenges can piss you off, but as long it's fair and you have many things to learn yet, they are much more helfpful at it seems on the first glimpse, they prepare you for coming tasks.\n\nI understand why games like Celeste do have it's assistant mode, but I don't think that it really helps or motivates players to play the game for a longer time. While it's ok I wish there would be more comprehension for games which try to force you to get better, for people like me it's the quintessence of gaming.\n\nI don't think that every game has to be beat by everyone, there may be skill checks in the game but the only true barrier am I for myself and my own inavailability, thats something where I can work on. \n\nI do have proper respect for well thought out and absolutely fair leveldesign, no matter what skill they demand, at some point it's useless to give the player a free card everytime they want to, because - especially games which are very gameplay heavy - won't get any easier, it's the opposite, so sometimes that said barriers are your best friend, even if we don't want to believe it, they help us to understand the game more and more and ensure us to have fun beeing challenged even on the later parts.\nIt's more a question of the right mindset to me. I don't have to beat a game to fully enjoy it. And even if you can't beat in on a short-term, nothing hinders you to play it again on some other time. \n\nOccasionally It feels like getting a new game after you beat a difficult section where you stuck for months or even years and seeing more of the game is the best reward a game can give you.\nI neither feel forced to have a tough time, nor I'm willing to give up.\n\nThe game and it's ruleset, thats what I paid for, it's the important aspect which gives the content meaning. Getting straight to the content whenever I want, isn't what consitutes a videogame for me.\n\n\n\n\n\n",
        "created_utc": 1521811572,
        "upvote_ratio": ""
    },
    {
        "title": "Video Games And Misrepresentation Of Muslims At Large",
        "author": "PurloinerofCinders",
        "url": "https://www.reddit.com/r/truegaming/comments/86j9yu/video_games_and_misrepresentation_of_muslims_at/",
        "text": "I was going through GDC 2018 when I came across this piece that revolves around game designer Osama Dorias and why he thinks that positive representation of Muslims in video games is important.\n\nWhile one may argue there is no need to incorporate religion into video games, I do believe that if required, an accurate representation of a community is ideal as opposed to relying on stereotypes.\n\n[Here is](https://www.gamasutra.com/view/news/315758/How_and_why_you_should_better_represent_Muslims_in_your_games.php) the discussion in case you guys want to give it a read.",
        "created_utc": 1521796284,
        "upvote_ratio": ""
    },
    {
        "title": "Non-combat Spells in RPG's?",
        "author": "kstrtroi",
        "url": "https://www.reddit.com/r/truegaming/comments/86iqoh/noncombat_spells_in_rpgs/",
        "text": "It's something I've always wondered about.  I've played BG series, NWN series, Pillars of Eternity, Divinity Original Sin, Skyrim, Oblivion, etc.  None of these games seem to implement mage spells that don't deal with combat.  Which saddens me as a tabletop RPGer, because it just makes me think that a mage is no different from a fighter but with range.  Is there a game out there that has a spell lists that one would use outside of combat?\n",
        "created_utc": 1521788533,
        "upvote_ratio": ""
    },
    {
        "title": "Resurrecting the Nintendo Quality Seal on steam",
        "author": "BobVosh",
        "url": "https://www.reddit.com/r/truegaming/comments/86iq3c/resurrecting_the_nintendo_quality_seal_on_steam/",
        "text": "I would love it if Steam started a program where a developer could spend, and this is a ballpark amount, I'm sure they can figure out a better total, like 10k to have them inspect a game, and give it a quality seal. Refund the money if it isn't a terrible game, so it doesn't hurt the developer. This way you can have the cesspool that Steam Direct gives now, while having a proper curation method for the games that are better.\n\nThe money ensures that only people in good faith are willing to go through with this, while the refund ensures that indie developers don't have too much trouble.  I know there is an obvious problem of how to judge it, but surely a system like this must be better than the vague hope that steam user made curators work.   Especially since the Steam Curators as it exists can't find the good games out of the 200+ that release weekly.  \n\nAs it stands now, I only ever go on steam to find a game I know about.  I miss being able to go on there to find new games.\n\nJust curious what ya'll's thoughts are on this.",
        "created_utc": 1521788301,
        "upvote_ratio": ""
    },
    {
        "title": "Small Application Developers looking for suggestions and feedbacks",
        "author": "brookgo",
        "url": "https://www.reddit.com/r/truegaming/comments/86homl/small_application_developers_looking_for/",
        "text": "[removed]",
        "created_utc": 1521775721,
        "upvote_ratio": ""
    },
    {
        "title": "Small Application Developers looking for suggestions and feedbacks",
        "author": "brookgo",
        "url": "https://www.reddit.com/r/truegaming/comments/86hm8z/small_application_developers_looking_for/",
        "text": "[removed]",
        "created_utc": 1521774995,
        "upvote_ratio": ""
    },
    {
        "title": "Horses...what's up with them?",
        "author": "Happy-Engineer",
        "url": "https://www.reddit.com/r/truegaming/comments/86gbj6/horseswhats_up_with_them/",
        "text": "I believe there's a lot of untapped potential when it comes to the implementation of horses in games.\n\nA trusty steed is vital for many of our favourite genres, but too often they're reduced to little more than whistle-operated motorbikes that snap to the occasional woodland trail. We can do better.\n\n**Controls**\nWhen you ride an animal it doesn't handle like a vehicle. They have their own momentum, reaction time and sense of self-preservation. They don't turn at the touch of a button or run blindly into invisible walls. How great would it be to see a little more intelligence in our adventuring companions, to really feel like you're 'riding' something?\n\nFunction comes first of course - no designer wants an uncooperative mount pulling players out of core gameplay - but there are ways to decouple input and action that still handle consistently. I personally enjoyed Halo's 'oversteer' system on the Warthog. Controversial, yes, but groundbreaking for the time and damn fun. Surely your four-legged friend can take an instruction and execute it sensibly.\n\n**Movement**\nHorses, like people, don't always move the direction their head points. They have a centre of mass, four points of contact and plenty of moving parts. Where is it written that your character's orientation is locked to their movement direction?\n\nGTA V did a great job of implementing this for both characters and vehicles. As you stride off from a standing start your head, torso and legs rotate independently to match your direction, giving your character a real physical presence. The cars also take corners realistically, working from traction and trading momentum with ~~passing~~ colliding objects. A horse that shies away from a threat to the side or slides on a gravelly corner isn't outside the realms of technology, especially for Rockstar Old West®.\n\n**Personality**\nAnyone who's spent time with a horse knows that inside each large head is a unique, slightly insane mind. You've spent a million dollars modelling, animating and sound-designing your player's bulky best friend, it's only fair to get a writer involved as well. Steal an apple, jostle a passing NPC, frolic in a sunbeam, do anything to make yourself memorable and worth spending time with. Do even half the characterisation that Half Life 2 achieved with Dog and you'll make poor Roach look like a hobby horse.\n\n**Combat**\nI'm drawing a blank here, but I bet you've got some ideas.\n\n**Role-play**\nWe could go really deep on this one. Gran Turismo let you hit the car-wash between races, can't I give my buddy a brush-down? She's still steaming from that last chase. Perhaps she'll go find a nearby field while I rest overnight, or maybe she's patiently standing hobbled outside my tent until a local wolf pack makes an attempt on her life. Dropping by an inn for the night? You better pay for that feed and mucking out, but she'll come out with a nice clean coat and a bag of oats for the road.\n\n**Game mechanics**\nHorses carry saddlebags, eat food, wear shoes, pull wagons, follow ~~basic instructions~~ food. Do you like inventory management? Survival mechanics? Blacksmithing? Rope-based physics tomfoolery? Puzzles involving pulleys and pressure plates?\n\n**END**\nI've only scratched the surface here, and I know I've mentioned a few things that already exist, but I'd just like to see more creativity in this area.\n\ntl;dr: I can't wait for Red Dead Equestrian 2",
        "created_utc": 1521762740,
        "upvote_ratio": ""
    },
    {
        "title": "What are good PC games that can be played easily even when talking with someone over the phone?",
        "author": "ohdead",
        "url": "https://www.reddit.com/r/truegaming/comments/86fhlu/what_are_good_pc_games_that_can_be_played_easily/",
        "text": "[removed]",
        "created_utc": 1521756069,
        "upvote_ratio": ""
    },
    {
        "title": "Let's talk 9th Gen and the plateau of technological innovation",
        "author": "foodbaby95",
        "url": "https://www.reddit.com/r/truegaming/comments/86eqxt/lets_talk_9th_gen_and_the_plateau_of/",
        "text": "First off, I want to say how happy I am to have found this sub. I have been missing deep gaming conversations since graduating college and leaving my gamer buddies behind. \n\nSomething I have been thinking a lot about is the inevitable ninth generation of consoles. I think at this point a Playstation 5 is a forgone conclusion, and rumor has it Xbox is already at work on their next update to the brand (whether that is an outright \"Xbox sequel\" or another iteration a la XBX remains to be seen). This leaves me with a couple questions: \n\n1) What will the ninth gen look like? Will it be an outright generation like previous console cycles (PS4 to PS5) or are we truly looking at this mobile phone type model for the future? That is, smaller iterations every few years or so? Part of me thinks that in this world of rapid innovation, it makes sense, but I'm unsure how receptive the wider/more causal audience may be to such model. \n\n2) What will be the \"Catch\" of 9th gen? The leap from 7 to 8 was not nearly as drastic as say, PS2 to PS3, or Xbox to Xbox 360. I fully expect the 9th gen, in whatever form it arrives in, to be even less drastic of a shift. I wonder if this will affect public reception to consoles? Will people really go out and buy a new system for what I assume will be minor upgrades? Will 9th gen really just be a prettier 8th gen, or will there be something to it that changes the status quo (think the leap to 3d graphics in Gen 5 or the HD revolution in Gen 7)",
        "created_utc": 1521750277,
        "upvote_ratio": ""
    },
    {
        "title": "For those on data caps, Sea of Thieves makes it pointless to buy the physical copy. Annoyed",
        "author": "deloreanguy1515",
        "url": "https://www.reddit.com/r/truegaming/comments/86eb27/for_those_on_data_caps_sea_of_thieves_makes_it/",
        "text": "[removed]",
        "created_utc": 1521746918,
        "upvote_ratio": ""
    },
    {
        "title": "Finally played Everyone's Gone to the Rapture",
        "author": "alanbright",
        "url": "https://www.reddit.com/r/truegaming/comments/86e2nm/finally_played_everyones_gone_to_the_rapture/",
        "text": "I finally had a chance to get this game as it is currently on sale and played through it with my SO. I have to say, this game has been one of my most favorite gaming experiences.\n\nThe storytelling is phenomenal and the characters were very complex. It made me appreciate gaming as a medium for storytelling. The slow movement speed at first was annoying (and then I found out there was a run option the whole time), but I realized that the slow pace allowed me to take in the world more effectively than speeding through the town. The audio cues and soundtrack worked so well to tell a story and make you feel certain emotions in just the right way. It is like walking through a book.\n\nThe characters were complex in so many ways, none of them were straight likable, but the were like real humans with faults and desires. And the story unfolded in a way that really hits you emotionally when certain details are revealed.\n\nThe mystery was great and (spoilers) I love the concept of extraterrestrials that are not just human or animal variants, but so alien, they are beyond our comprehension. It is my favorite type of sci-fi.\n\nMy only complaints of the game were the speed (though I kind of am glad I didn't know of the sprint button) and sometimes following the light clues was confusing and I wasn't sure if I had found all I needed to find in a given area.\n\nI know the game is not for everyone, but this gaming experience has seriously has affected me in a very profound way and has made me appreciate gaming as storytelling medium.",
        "created_utc": 1521745121,
        "upvote_ratio": ""
    },
    {
        "title": "Obduction and the usage of real actors",
        "author": "JevonDee",
        "url": "https://www.reddit.com/r/truegaming/comments/86c4th/obduction_and_the_usage_of_real_actors/",
        "text": "I guess I'm a little late to the party, but I just bought Obduction after hearing about how it was designed by the original creators of Myst.  I have to say that it's the first game in years that I actually felt immersed in, and I think a lot of that has to do with the real actors instead of 3D models among other elements.  It makes the entire game feel so much more realistic.  Combine that with the awesome scenery, the ambient and soft background sounds, and at least to me it's a combination for a good time.\n\nI could go on and on about how great I think this game is (let's not talk about the difficulty, that's an entire subject on it's own), but the main thing I wanted to talk about is the acting.  I know this was big in the 90s (which I grew up with and LOVED that era.  Mad Dog 2, Phantasmagoria, 7th Guest, Night Trap,  Gabriel Knight 2, Tex Murphy, the entire Myst series of course, etc) but most people I see absolutely HATE real actors in games and prefer 3D models (I could be wrong but that's the feeling I get when reading  reviews about these games).  I don't care if the acting is cheesy or over-the-top, in fact I consider that a plus. \n\nTL;DR: What are your opinions on the usage of real actors in games?  Should it have died in the 90s?  Is there a potential comeback on this sort of style?  What do you like and dislike about actors in games.",
        "created_utc": 1521730800,
        "upvote_ratio": ""
    },
    {
        "title": "Do you play games again without a break [another game in between]?",
        "author": "SteelofNinja",
        "url": "https://www.reddit.com/r/truegaming/comments/86a8x8/do_you_play_games_again_without_a_break_another/",
        "text": "[removed]",
        "created_utc": 1521711489,
        "upvote_ratio": ""
    },
    {
        "title": "[Tricky Road Game] is just an exception in Hardness ! Nearly Impossible to reach 5th Flag.",
        "author": "aman_51995",
        "url": "https://www.reddit.com/r/truegaming/comments/869im3/tricky_road_game_is_just_an_exception_in_hardness/",
        "text": "[removed]",
        "created_utc": 1521701086,
        "upvote_ratio": ""
    },
    {
        "title": "No wonder EA keeps fucking everyone",
        "author": "filipanton",
        "url": "https://www.reddit.com/r/truegaming/comments/869ggz/no_wonder_ea_keeps_fucking_everyone/",
        "text": "[removed]",
        "created_utc": 1521700234,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any Sci Fi games where you play as just another soldier or police officer type guy?",
        "author": "GreatBallsOfFire_",
        "url": "https://www.reddit.com/r/truegaming/comments/8682qh/are_there_any_sci_fi_games_where_you_play_as_just/",
        "text": "[removed]",
        "created_utc": 1521684716,
        "upvote_ratio": ""
    },
    {
        "title": "A showerthought business model to encourage innovation and avoid microtx's, could it be viable?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/866nvd/a_showerthought_business_model_to_encourage/",
        "text": "[deleted]",
        "created_utc": 1521672544,
        "upvote_ratio": ""
    },
    {
        "title": "logic based games",
        "author": "squidlox",
        "url": "https://www.reddit.com/r/truegaming/comments/865joy/logic_based_games/",
        "text": "[removed]",
        "created_utc": 1521664291,
        "upvote_ratio": ""
    },
    {
        "title": "How well a game translates to real life.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/86409p/how_well_a_game_translates_to_real_life/",
        "text": "[deleted]",
        "created_utc": 1521653639,
        "upvote_ratio": ""
    },
    {
        "title": "How often do you ignore a specific game mechanic on purpose in singleplayer games?",
        "author": "SunTzuGaming",
        "url": "https://www.reddit.com/r/truegaming/comments/863yiq/how_often_do_you_ignore_a_specific_game_mechanic/",
        "text": "Just got Mafia 3 on big discount. They added 2 game mechanics that strips some enjoyment from the game for me so I don't use them, you guys do the same on some games?\n\nMechanics I ignore are the whistle to get enemies attention, AI is moronic so makes it stupid easy to pick them off; and the 'see enemies through walls' thing.\n\nDishonored/Deus Ex I don't use the npc marking thing to track positions, just makes it like game breakingly easy/boring. \n\nYou guys ever do the same, or what mechanics in a game did you ignore and not use to cater the game experience more towards how you enjoy playing it?\n",
        "created_utc": 1521653286,
        "upvote_ratio": ""
    },
    {
        "title": "Kirby: Star Allies Review",
        "author": "BatchelorSean",
        "url": "https://www.reddit.com/r/truegaming/comments/863p0m/kirby_star_allies_review/",
        "text": "[removed]",
        "created_utc": 1521651395,
        "upvote_ratio": ""
    },
    {
        "title": "Why are most mobile games crap?",
        "author": "Catapult_Power",
        "url": "https://www.reddit.com/r/truegaming/comments/863f40/why_are_most_mobile_games_crap/",
        "text": "What do you believe is the reason for most mobile games being bad? Is it the economic pressure to make something full of microtransactions? Is it the inherent lack of creativity in the mobile gaming market? Is it limitations of the technology, or limited resources? I can't help but think it is the first one because I'm sure if you look hard enough there are mobile games that are worth the time. I sure it's not the limitation on technology because they are now porting six gen games on phones, and those games were amazing. I am also hard to believe its resources, as many of the big mobile game companies make a lot of money. \nAlso, are there any mobile games that you think break the mold, and are comparable to either high-quality indie games or maybe even a triple-A game? I'd like to hear your thoughts.",
        "created_utc": 1521649472,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't people talk about old RPGs when talking about \"open world\" games?",
        "author": "notponies",
        "url": "https://www.reddit.com/r/truegaming/comments/863cbq/why_dont_people_talk_about_old_rpgs_when_talking/",
        "text": "Like the *Ultima* games. Or the *Might and Magic* games (the RPGs, not the strategy games). These types of games were doing open world gameplay before \"open world\" became a distinct category.\n\nSo I'm always a bit weirded out by various threads talking about open world games. Especially ones where open world gameplay is treated like some new imposition. I've even seen someone post that RPGs should move away from open world gameplay and *back* to linear gameplay.\n\nAre some too young to know about these older RPGs? Or are they using a specific definition of open world?",
        "created_utc": 1521648922,
        "upvote_ratio": ""
    },
    {
        "title": "Most Difficult Arcade Game emerging... Did you play ?",
        "author": "aman_51995",
        "url": "https://www.reddit.com/r/truegaming/comments/8632kb/most_difficult_arcade_game_emerging_did_you_play/",
        "text": "[removed]",
        "created_utc": 1521646907,
        "upvote_ratio": ""
    },
    {
        "title": "Is competition between platforms good because it drives low prices and innovation, or is it bad because it spawns things like platform exclusivity and platform wars?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8627gs/is_competition_between_platforms_good_because_it/",
        "text": "Title says it all.\n\nOn one hand I sometimes hear \"Competition is good for consumers\"\n\nOn the other hand I hear \"Competition is bad because exclusives are anti consumer\".\n\nSo which one is it?",
        "created_utc": 1521640254,
        "upvote_ratio": ""
    },
    {
        "title": "What are the best Hells in gaming?",
        "author": "Arkadii",
        "url": "https://www.reddit.com/r/truegaming/comments/85z1my/what_are_the_best_hells_in_gaming/",
        "text": "[removed]",
        "created_utc": 1521602529,
        "upvote_ratio": ""
    },
    {
        "title": "Game genre(s) you just can't get into?",
        "author": "cheemio",
        "url": "https://www.reddit.com/r/truegaming/comments/85y9bc/game_genres_you_just_cant_get_into/",
        "text": "[removed]",
        "created_utc": 1521595074,
        "upvote_ratio": ""
    },
    {
        "title": "[Counterstrike] this brought back so many memories.",
        "author": "blackbox1490",
        "url": "https://www.reddit.com/r/truegaming/comments/85wxvl/counterstrike_this_brought_back_so_many_memories/",
        "text": "[removed]",
        "created_utc": 1521584251,
        "upvote_ratio": ""
    },
    {
        "title": "Get stressed while playing.",
        "author": "fladderlappen",
        "url": "https://www.reddit.com/r/truegaming/comments/85w7pg/get_stressed_while_playing/",
        "text": "[removed]",
        "created_utc": 1521578712,
        "upvote_ratio": ""
    },
    {
        "title": "How did 'broken' come to mean 'unacceptably strong' instead of 'so bad it's unusable'?",
        "author": "TomHicks",
        "url": "https://www.reddit.com/r/truegaming/comments/85vfaa/how_did_broken_come_to_mean_unacceptably_strong/",
        "text": "If you break a toy, it doesn't get better, it becomes unusable. In gaming lingo, 'broken' has come to mean the exact opposite: so good it needs to be toned down. I understand if it was 'game-breaking' and that term is used from time to time. However, 'broken' as its used now is counter intuitive at best. ",
        "created_utc": 1521572922,
        "upvote_ratio": ""
    },
    {
        "title": "How would you use TableTop RPG to educate a high school classroom?",
        "author": "MacAuthor",
        "url": "https://www.reddit.com/r/truegaming/comments/85va5v/how_would_you_use_tabletop_rpg_to_educate_a_high/",
        "text": "I teach two game design classes in a Houston public school. Today I had my students divide up into groups of three or four students and I quickly walked them through the FATE Accelerated TableTop RPG system using the following slideshow. Each team nominated their own GM and they are creating themes, characters, and scenes based on their own choosing. \n\nhttps://docs.google.com/presentation/d/1LOEzt5rWWDwgmF5gI3iv2IJZqituW1x7revF7I41yJ0/edit?usp=sharing\n\nI have had some very successful experiments with using board games and especially MegaGames. Together we created ALLIANCE the Ultimate World Leader Political Science Megagame (mymegame.com). \n\nHow would you use TableTop RPG to teach what lessons in a high school classroom?",
        "created_utc": 1521571941,
        "upvote_ratio": ""
    }
]