[
    {
        "title": "If this cruel world owes me nothing why couldn’t i choose to be born or not ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fugs8/if_this_cruel_world_owes_me_nothing_why_couldnt_i/",
        "text": "[removed]",
        "created_utc": 1536949473,
        "upvote_ratio": ""
    },
    {
        "title": "Is interest in a subject, like math, necessary for acing it?",
        "author": "sardan10s",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ftnku/is_interest_in_a_subject_like_math_necessary_for/",
        "text": "###I begin by defining terms. \n\n1. 'subject' signifies academic disciplines offered at a university. For this post, I'll use math as an example.\n\n2. 'interest' signifies so much true fervent attraction to a subject that you're \"thinking, living and breathing\" the subject, even in your spare time (e.g. when you're grocery-shopping or exerciising). Furthermore,  you love it so much that you'd teach yourself and read about it in your spare time.\n\n3. Being British, I'll use the [British undergraduate degree classification](https://en.wikipedia.org/wiki/British_undergraduate_degree_classification). 'ace' signifies grades like a First Class Honours at Oxbridge, namely a [Double or Triple First](https://en.wikipedia.org/wiki/British_undergraduate_degree_classification#Variations_of_first-class_honours). \n\n ###Belief\n\n4. Let me know if anyone knows of other research, but this [2014 Duke University study](https://today.duke.edu/2014/04/interest) substantiates my belief that interest is a necessary condition to success in an academic subject:\n\n &gt;Maintaining an interest in the goals you pursue can improve your work and reduce burnout, according to research from Duke University.\n\n &gt;\"Our research shows that interest is important in the process of pursuing goals. It allows us to perform at high levels without wearing out,\" said Paul O'Keefe, who conducted the studies as a doctoral student in Duke University's Department of Psychology &amp; Neuroscience, along with associate professor Lisa Linnenbrink-Garcia. \"This suggests that interest matters more than we suspected.\"\n\n ###Questions\n\n5. Does anyone know of counterexamples? E.g., are there any Fields Medallists or Nobel or [Noble-equivalent](https://en.wikipedia.org/wiki/List_of_prizes_known_as_the_Nobel_of_a_field) Laureates who loathe their subject? \n\n6. Can anybody try to change my belief?",
        "created_utc": 1536943792,
        "upvote_ratio": ""
    },
    {
        "title": "Involuntarily committing a loved one",
        "author": "mardigras47",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ft74f/involuntarily_committing_a_loved_one/",
        "text": "[removed]",
        "created_utc": 1536940579,
        "upvote_ratio": ""
    },
    {
        "title": "Where can i rewatch the whole fight between Mayweather and McGregor ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9frsfg/where_can_i_rewatch_the_whole_fight_between/",
        "text": "[removed]",
        "created_utc": 1536930029,
        "upvote_ratio": ""
    },
    {
        "title": "What are your thoughts on Jews being able to get away with lying so much?",
        "author": "alljewsdoislie",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fpz3l/what_are_your_thoughts_on_jews_being_able_to_get/",
        "text": "[removed]",
        "created_utc": 1536909871,
        "upvote_ratio": ""
    },
    {
        "title": "Do bats really have bad eyesight?",
        "author": "CykaShark",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9foovu/do_bats_really_have_bad_eyesight/",
        "text": "[removed]",
        "created_utc": 1536895810,
        "upvote_ratio": ""
    },
    {
        "title": "Why can it be so hard to tell your family you love them?",
        "author": "itsmassive",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fntjr/why_can_it_be_so_hard_to_tell_your_family_you/",
        "text": "[removed]",
        "created_utc": 1536888308,
        "upvote_ratio": ""
    },
    {
        "title": "How would humans' daily life be different if we couldn't feel any physical pain?",
        "author": "fumfit",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fmypq/how_would_humans_daily_life_be_different_if_we/",
        "text": "[removed]",
        "created_utc": 1536881219,
        "upvote_ratio": ""
    },
    {
        "title": "Do you find that the amount of negativity on the internet skews our world view as a society?",
        "author": "PADOMAIC-SPECTROMETE",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fmdez/do_you_find_that_the_amount_of_negativity_on_the/",
        "text": "I find social media, especially places like reddit and twitter, are hives for negativity and people venting their politics, how fucked the world is, ect. ect. While I don’t doubt we are facing hard times, I think social media has helped cultivate and bring the worst news in the world to your face 24/7, and humans tend to focus on the negative things. I feel that if it wasn’t for how much we circlejerk our inherent biases, even with a somewhat realistic mindset and a bit of optimism, you can see we can get through this. Plus, I feel like people get on their keyboard/phones to communicate when they’re often not in their best states of mind. Like after a hard day at work or when they’re lonely. We’re obsessed with negativity. Only look at our obsession with dystopia fiction. But that’s chicken and egg in terms of fiction and the reality of our industrial world. \n\nI find when I’m in stressful situations I have to basically delete most social media off my phone. As a fairly new geoscience major who knows a thing or two about the oxygen cycle, resources and climate change, I’ll often bring up facts about how we’re changing our environment, only to get the “we’re dead meat” or “we’re so fucked” reply. I try and tell them that that’s not necessarily true, that in so many ways our world is better than it has ever been, that technology is always improving (renewables and geo-engineering research) and the current political fuck-ups and enviro issues are really bringing the important issues to voters regardless of corporate media, but by then they want to stop talking about it. \n\nIf you look at the world throughout history, there’s been so many times people thought the world was going to end. Look as far back as the Black Death, the Cuban missile crisis, ect. Sure, lots of things that can go wrong today are way more serious and pressing than ever before, but the future isn’t written yet. And if humans can be terrible at anything, it’s predicting the future.\n\nThe internet in general seems to be really good at making people feel like shit but I don’t think it’s necessarily all realism, it’s people venting their frustrations too. ",
        "created_utc": 1536876539,
        "upvote_ratio": ""
    },
    {
        "title": "Microwave caught on fire. I can’t figure out how. Details below.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fkxnp/microwave_caught_on_fire_i_cant_figure_out_how/",
        "text": "[removed]",
        "created_utc": 1536866147,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it so hard for a \"nation\" to become independant from a country?",
        "author": "Arcteryx81",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fjtcm/why_is_it_so_hard_for_a_nation_to_become/",
        "text": "A couple of exemple :\n\nCatalonia from Spain\n\nQuébec from Canada\n\n&amp;#x200B;\n\nFrom my point of view, if the population of said nation fully agree by a majority vote or a way that we can be sure it's accurate, then there should not be anything that blocks the will of people to be self-dependant.",
        "created_utc": 1536858422,
        "upvote_ratio": ""
    },
    {
        "title": "Should i hit the brakes and risk that i could get hit from the car behind me whenever a cat is crossing the street or should i keep on driving and hit the cat ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fjaod/should_i_hit_the_brakes_and_risk_that_i_could_get/",
        "text": "[removed]",
        "created_utc": 1536854831,
        "upvote_ratio": ""
    },
    {
        "title": "Rationality and intellectualism are often regarded as some of most important aspects of human culture. But is there such a thing as being \"too rational\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fib5x/rationality_and_intellectualism_are_often/",
        "text": "[removed]",
        "created_utc": 1536847838,
        "upvote_ratio": ""
    },
    {
        "title": "Middle-aged redditors, what's the death of an elderly parent like?",
        "author": "ghostoftheuniverse",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fi7eu/middleaged_redditors_whats_the_death_of_an/",
        "text": "This question was inspired by [this post](https://www.reddit.com/r/TrueAskReddit/comments/9fcq3b/what_is_the_death_of_a_parent_like/). In said post, OP and commenters were discussing the loss of a parent during their childhood through young adulthood. My paternal grandmother succumbed to Alzheimer's a few years ago at the age of 91. At the time and on through today I don't know exactly what ~~he~~ my dad went through because the men in my family don't share their emotions. It seems more natural to lose an elderly parent, but how does that translate to grief? Does our experience of the loss of a parent change throughout our lives?\n\nI am lucky enough to still have both my parents. Just the thought of losing them makes my thirty year old self want to hold them tightly. \\*wipes tear from eye\\* I plan on calling them when I get home tonight.",
        "created_utc": 1536847071,
        "upvote_ratio": ""
    },
    {
        "title": "When I was young, the attitudes towards nerds and nerd culture were more stereotypical and negative. Nowadays, that attitude has changed into a more positive aspect. How did this come into being?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fhy2o/when_i_was_young_the_attitudes_towards_nerds_and/",
        "text": "[removed]",
        "created_utc": 1536845066,
        "upvote_ratio": ""
    },
    {
        "title": "What is it like to grow up with 4 grandparents alive?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fg1ku/what_is_it_like_to_grow_up_with_4_grandparents/",
        "text": "[removed]",
        "created_utc": 1536825004,
        "upvote_ratio": ""
    },
    {
        "title": "What inspired brand names of old?",
        "author": "AfterDark3",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fdb7k/what_inspired_brand_names_of_old/",
        "text": "[removed]",
        "created_utc": 1536798729,
        "upvote_ratio": ""
    },
    {
        "title": "What motivates you to keep living and do so happily?",
        "author": "Flickthebean87",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fd15q/what_motivates_you_to_keep_living_and_do_so/",
        "text": "[removed]",
        "created_utc": 1536796427,
        "upvote_ratio": ""
    },
    {
        "title": "What is the death of a parent like?",
        "author": "bp5678",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fcq3b/what_is_the_death_of_a_parent_like/",
        "text": "I am 24, male. I am fortunate enough to not have experienced death of any close ones. However my ex girlfriend's dad has recently died due to cancer. He had cancer for the whole of our relationship but it got worse just before we broke up. I have wanted to get back with her for the last 6 months but for various reasons we haven't. Anyway I'm going off track.\n\nI'd like to be there for her with her dad passing away, and of course I can be there for her but if I'm very honest because I've never had to deal with death it is hard to FULLY know &amp; understand.\n\nShe is 23. Her parents were together and she has a brother.\n\n&amp;#x200B;\n\n**-------**\n\n***EDIT:***\n\n**Wow I wasn't expecting so many replies. I'll try to reply to each of them.**\n\n**I didn't want to make this post too long as I felt it wouldn't get read, however I would like to go into more detail. I've actually really struggled with my breakup with her, and even though I've not had to deal with a death, I still feel a lot of what you have said.**\n\n* **If I start to think about her I can make myself feel physically sick.**\n* **I feel something in my stomach and I can just have a sudden moment where I suddenly become really down and upset.**\n* **I'm not really the type to cry but I've brought myself to tears (in private) several times since our breakup. As one of the posters below said \"my ex will never fully get over it but just learn to get used to it\" and I feel like that with regards to the breakup.**\n* **Reddit** **posters below said things like \"they'd get a sense of jealousy seeing someone with/talking about their parents\" and I feel a similar way when I see people happily in love in a relationship (or even arguing about something so petty in an argument not knowing I'm a wreck with what's happened in my old relationship).**\n* **I get panic attacks, I make myself feel weak, I have no motivation or drive and just feel lost. I'm just about going through the motions of daily life.**\n* **Everything I once took for granted has now gone**\n\n**I'm actually having a phone call with my ex tonight (long distance so we don't see each other much) and she's even said before her dad died that I don't understand what she's going through. In hindsight, I probably didn't FULLY understand and get it. If I'm honest, even now I probably still can't fully empthaise or see it from her perspective, however for the first time ever I have been grieving and not due to the death of a loved one but due to our breakup. So in a weird way I feel like I do sort of get it. If I said that to her though, do you think this will make her feel worse because what I've probably experienced is probably not on the same scale as her level of grieving. Would she almost be offended by me comparing the two? We haven't really talked much since the breakup and I kind of wanted to tell her how hard the last 6 months have been as I'm sure she doesn't realise, however I feel like I could be rubbing salt into her wounds because in reality even though it's been tough for me, it's nothing on what she's had to deal with. The other side of me kind of thinks that we've both gone through a tough period and it's not 'comparable' like this.**",
        "created_utc": 1536793737,
        "upvote_ratio": ""
    },
    {
        "title": "Can you even post a picture on Instagram with designer clothing with article 13?",
        "author": "kronwald98",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9fbvq0/can_you_even_post_a_picture_on_instagram_with/",
        "text": "[removed]",
        "created_utc": 1536787443,
        "upvote_ratio": ""
    },
    {
        "title": "Will the popularity of the Ninja Warrior obstacle-challenge show translate into more people, especially young people, working out? Or will this appeal to athletics also lose out to people's fixation with social media--and the resulting inactivity it brings?",
        "author": "Markdd8",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9f64j4/will_the_popularity_of_the_ninja_warrior/",
        "text": "[removed]",
        "created_utc": 1536743687,
        "upvote_ratio": ""
    },
    {
        "title": "From traditional hierarchical organizations to fluid ones. Is it possible to work and create value without a hierarchy?",
        "author": "merterino",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9f607d/from_traditional_hierarchical_organizations_to/",
        "text": "Most of the modern work organizations are super structured with highly specific roles and job titles. In my opinion, these organizations are highly dependent on giving and receiving \"orders\". \n\nDo you think an organization with a high number of people can operate with zero dependency to hierarchy?",
        "created_utc": 1536742198,
        "upvote_ratio": ""
    },
    {
        "title": "Why does it seem that there is so much functionality on a micro-level of human societies, but yet so much corruption on a macro-level of running human society?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9f2ry5/why_does_it_seem_that_there_is_so_much/",
        "text": "[removed]",
        "created_utc": 1536710837,
        "upvote_ratio": ""
    },
    {
        "title": "Do you believe in Universal Energy?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9f2ld3/do_you_believe_in_universal_energy/",
        "text": "[removed]",
        "created_utc": 1536709338,
        "upvote_ratio": ""
    },
    {
        "title": "I have a constant feeling of something is going to hit me in the eye",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9f1i08/i_have_a_constant_feeling_of_something_is_going/",
        "text": "[removed]",
        "created_utc": 1536700854,
        "upvote_ratio": ""
    },
    {
        "title": "This cruel world is filled with diseases, corrupt politicians , war , bullies, , poverty, nazis and the list goes on yet people keep on reproducing even though THEY ALWAYS CLAIM THAT THIS WORLD IS BRUTAL AND WORTHLESS so i am asking why ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9f18hd/this_cruel_world_is_filled_with_diseases_corrupt/",
        "text": "[removed]",
        "created_utc": 1536698866,
        "upvote_ratio": ""
    },
    {
        "title": "Which ethnicities or religious groups, if any, currently thought of as minorities in the U.S. will in the near future be brought under the \"white\" or \"American\" umbrella the way ethnic Irish, Germans, Catholics, Jews, and Italians have?",
        "author": "debtblag",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9f1237/which_ethnicities_or_religious_groups_if_any/",
        "text": "[removed]",
        "created_utc": 1536697581,
        "upvote_ratio": ""
    },
    {
        "title": "Can meth users lead a normal life and have their addiction go fairly unnoticed?",
        "author": "move_illdoit",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9f04as/can_meth_users_lead_a_normal_life_and_have_their/",
        "text": "[removed]",
        "created_utc": 1536690707,
        "upvote_ratio": ""
    },
    {
        "title": "Change my mind. r/TrueAskReddit is basically yahoo anwsers",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ezl6u/change_my_mind_rtrueaskreddit_is_basically_yahoo/",
        "text": "[removed]",
        "created_utc": 1536686934,
        "upvote_ratio": ""
    },
    {
        "title": "Substance Abuse",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ez1yp/substance_abuse/",
        "text": "[removed]",
        "created_utc": 1536683187,
        "upvote_ratio": ""
    },
    {
        "title": "Is mumble rap as dumb as I think it is?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9eymaj/is_mumble_rap_as_dumb_as_i_think_it_is/",
        "text": "[deleted]",
        "created_utc": 1536680259,
        "upvote_ratio": ""
    },
    {
        "title": "What would the US look like now, if 9/11 have never happend?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9eyl45/what_would_the_us_look_like_now_if_911_have_never/",
        "text": "",
        "created_utc": 1536680018,
        "upvote_ratio": ""
    },
    {
        "title": "How and why did 9/11 change America's history and politics?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9eybbm/how_and_why_did_911_change_americas_history_and/",
        "text": "When 9/11 happened, I was 9 years old at the time so I could not really understand fully why exactly this event was so life-changing for American history and to this day, many Americans still mourn about it (some people think that the mourning of the event is exaggerated even though it happened 17 years ago), and many people view the US as using the 9/11 event as an excuse to invoke the war on terror which basically means a clever concept of a just war against anyone or anything that is deemed a threat or a possible terrorist organisation (which many people say that this war will never end and is unwinnable and many people view it as a modern version of imperialism via military action)\n\nSo this day, I have been told over and over and over again about cautious and paranoia of terrorists (even news networks have a breaking news terrorist section almost every week) or how Islam is a religion of hate* (and considering that America's history after WW2, I find it foolish that Al-Qaeda eventually decided to attack the US because judging by American military history, America does not pull its punches when it comes to military force).\n\n*(which is a stereotype and goes against the majority of the Muslim population of today because if you think about it, if all 1.8 billion Muslims are as fanatical as those who want to propose a theocratic government under Sharia law, then there would be a lot more terror in the world. Plus ironically, there is a bit of truth in this Muslim stereotype regarding that the religion of Islam did in fact start as a religious holy war from the side of the Muslims as the prophet Muhammed used his religion with a political/military motive and that motive stayed there for generations. And ironically, the Americans themselves indirectly created Al-Qaeda or these terrorists groups that believe that they are fighting in a Holy War as a means to fight against the USSR during the Cold War in the 1970s and 1980s)\n\nBut I have been about this day in and day out that I do not know or remember why this became a big deal in America or even in the world entirely and why this anti-terrorism agenda is shoved inside my mouth constantly",
        "created_utc": 1536678100,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a proper term for 'Spatial Comedy' ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9exogc/is_there_a_proper_term_for_spatial_comedy/",
        "text": "[deleted]",
        "created_utc": 1536673465,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people call Kevin Durant a snake?",
        "author": "VishnuPradeet",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ewzei/why_do_people_call_kevin_durant_a_snake/",
        "text": "[removed]",
        "created_utc": 1536667921,
        "upvote_ratio": ""
    },
    {
        "title": "When is it ever acceptable to include or incorporate religious values and virtues in today's politics?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9eqspc/when_is_it_ever_acceptable_to_include_or/",
        "text": "[removed]",
        "created_utc": 1536611473,
        "upvote_ratio": ""
    },
    {
        "title": "Should drugs (including alcohol) be legal or illegal?",
        "author": "The_Godlike_Zeus",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9eq6a3/should_drugs_including_alcohol_be_legal_or_illegal/",
        "text": "[removed]",
        "created_utc": 1536607222,
        "upvote_ratio": ""
    },
    {
        "title": "Why is this World such a cruel place with so many evil people who try destroy my life ?",
        "author": "Skllpointer",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9eon2z/why_is_this_world_such_a_cruel_place_with_so_many/",
        "text": "[removed]",
        "created_utc": 1536596651,
        "upvote_ratio": ""
    },
    {
        "title": "What's the best joke to start a speech off with?",
        "author": "blazinghomosexual",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9enf44/whats_the_best_joke_to_start_a_speech_off_with/",
        "text": "[removed]",
        "created_utc": 1536588292,
        "upvote_ratio": ""
    },
    {
        "title": "How would the idea of UBI deal with bad economic choices?",
        "author": "Occams-shaving-cream",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ej8c2/how_would_the_idea_of_ubi_deal_with_bad_economic/",
        "text": "[removed]",
        "created_utc": 1536549728,
        "upvote_ratio": ""
    },
    {
        "title": "My mom is back to smoking cigarettes after quitting for 10+ years.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ehina/my_mom_is_back_to_smoking_cigarettes_after/",
        "text": "[removed]",
        "created_utc": 1536535212,
        "upvote_ratio": ""
    },
    {
        "title": "How will drug dealers (or other people working in the black market) operate when society inevitably becomes cashless?",
        "author": "iMac_Hunt",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9egecd/how_will_drug_dealers_or_other_people_working_in/",
        "text": "",
        "created_utc": 1536526373,
        "upvote_ratio": ""
    },
    {
        "title": "Why am i not allowed to kill myself ?",
        "author": "Skllpointer",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ege78/why_am_i_not_allowed_to_kill_myself/",
        "text": "[removed]",
        "created_utc": 1536526342,
        "upvote_ratio": ""
    },
    {
        "title": "Ranking personal intellingence survey",
        "author": "DiogoMCDMonteiro",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ef655/ranking_personal_intellingence_survey/",
        "text": "[removed]",
        "created_utc": 1536517275,
        "upvote_ratio": ""
    },
    {
        "title": "Does taking ibuprofen or acetaminophen cause fatigue?",
        "author": "Marclescarbot",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9eebf0/does_taking_ibuprofen_or_acetaminophen_cause/",
        "text": "[removed]",
        "created_utc": 1536510866,
        "upvote_ratio": ""
    },
    {
        "title": "We are often told that too much of a good thing is still a bad thing. How much is this actually true?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ee6ao/we_are_often_told_that_too_much_of_a_good_thing/",
        "text": "[removed]",
        "created_utc": 1536509807,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we humans spend most of our life with same people without exploring the nature around us?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ecxqv/why_do_we_humans_spend_most_of_our_life_with_same/",
        "text": "[removed]",
        "created_utc": 1536499556,
        "upvote_ratio": ""
    },
    {
        "title": "We are often told that too much of a good thing is still a bad thing. So does this also mean that being too empathetic, or too enthusiastic or too rational, or too calm is also a bad thing?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9e5fms/we_are_often_told_that_too_much_of_a_good_thing/",
        "text": "[removed]",
        "created_utc": 1536423944,
        "upvote_ratio": ""
    },
    {
        "title": "We live in an era where diversity is a political and social priority and we live in the most diverse era in history. However, given that the emphasis on diversity is everywhere, is it possible that the effort for inclusion is becoming more extreme and radical than what was originally intended?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9e4yps/we_live_in_an_era_where_diversity_is_a_political/",
        "text": "[deleted]",
        "created_utc": 1536419815,
        "upvote_ratio": ""
    },
    {
        "title": "In your opinion, what is that one thing in life everyone should experience at least once and why? Something not cliché (e.g. love). If you think men and women have different things then I’d be glad to hear why.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9e468w/in_your_opinion_what_is_that_one_thing_in_life/",
        "text": "[removed]",
        "created_utc": 1536411729,
        "upvote_ratio": ""
    },
    {
        "title": "If 2/3 of the population suddenly died, pretty evenly across all countries, what would happen to the economy in major countries like US and China?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9e3u6f/if_23_of_the_population_suddenly_died_pretty/",
        "text": "[removed]",
        "created_utc": 1536408222,
        "upvote_ratio": ""
    },
    {
        "title": "What are some issues that are addressed by the judicial system that really should be left up to the legislative system, and visa versa?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9e3j8v/what_are_some_issues_that_are_addressed_by_the/",
        "text": "",
        "created_utc": 1536404624,
        "upvote_ratio": ""
    },
    {
        "title": "Would you buy a car that may choose to kill you?",
        "author": "rollie82",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9e16fn/would_you_buy_a_car_that_may_choose_to_kill_you/",
        "text": "[removed]",
        "created_utc": 1536376970,
        "upvote_ratio": ""
    },
    {
        "title": "Would you buy a care that may choose to kill you?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9e166x/would_you_buy_a_care_that_may_choose_to_kill_you/",
        "text": "[deleted]",
        "created_utc": 1536376902,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it I got woken up as I was drifting off to sleep and now I can't get back to sleep?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dzchs/why_is_it_i_got_woken_up_as_i_was_drifting_off_to/",
        "text": "[removed]",
        "created_utc": 1536360368,
        "upvote_ratio": ""
    },
    {
        "title": "Celebrities that are dregs to society?",
        "author": "PandaVonSaurus",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dwzwj/celebrities_that_are_dregs_to_society/",
        "text": "[removed]",
        "created_utc": 1536344154,
        "upvote_ratio": ""
    },
    {
        "title": "What is more likely? people raised with religion becoming non believers later in life or vice versa; raised w/o religion, later become religious?",
        "author": "LadyRaoulDukeGonzo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dw6fo/what_is_more_likely_people_raised_with_religion/",
        "text": "[removed]",
        "created_utc": 1536339008,
        "upvote_ratio": ""
    },
    {
        "title": "How does the unloading and loading process for really long trains work? What about for different types of cargo?",
        "author": "omniplatypus",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dvtm4/how_does_the_unloading_and_loading_process_for/",
        "text": "[removed]",
        "created_utc": 1536336706,
        "upvote_ratio": ""
    },
    {
        "title": "How can self-taught people land a job in their field without a degree?",
        "author": "Bleizy",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dvj53/how_can_selftaught_people_land_a_job_in_their/",
        "text": "MOOCs and the internet have democratized knowledge so much, it's a shame companies still hire according to degrees rather than actual knowledge and know-how.\n\nHow can someone equally competent, but without a degree be taken seriously and not discarded from the get-go?\n\nCan you pay universities or other organisations to attest you have the equivalent knowledge as someone who has completed a degree? Some sort of equivalency test?\n\n==============================\n\nWow, I wasn't expecting so many quality replies.\n\nThanks so much for all your amazing advice and insight, this sub is the best! \n\nMy next step will be to focus  on building my portfolio and a professional network.\n\nBut I'll make sure to update you guys in a few months once I'm working for Google ;)",
        "created_utc": 1536334770,
        "upvote_ratio": ""
    },
    {
        "title": "Creating a physically and mentally healthy world",
        "author": "physioworld",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ds6ab/creating_a_physically_and_mentally_healthy_world/",
        "text": "[removed]",
        "created_utc": 1536307760,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible that Animal Slaughter and Torture will become illegal after 200 years just like Slavery?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ds4i7/is_it_possible_that_animal_slaughter_and_torture/",
        "text": "[removed]",
        "created_utc": 1536307204,
        "upvote_ratio": ""
    },
    {
        "title": "What are the biggest myths that people of USA have against Bernie Sanders and how can they be cleared before presidential elections in 2020?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dph9z/what_are_the_biggest_myths_that_people_of_usa/",
        "text": "[removed]",
        "created_utc": 1536283992,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between being greedy and being rational or working towards your own self-interests",
        "author": "ligga4nife",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9doxge/what_is_the_difference_between_being_greedy_and/",
        "text": "",
        "created_utc": 1536280175,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many nations love to hate and criticize about America and its politics?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dmv7s/why_do_so_many_nations_love_to_hate_and_criticize/",
        "text": "[removed]",
        "created_utc": 1536266627,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many nation love to hate and criticize about America and its politics?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dmuy7/why_do_so_many_nation_love_to_hate_and_criticize/",
        "text": "[deleted]",
        "created_utc": 1536266585,
        "upvote_ratio": ""
    },
    {
        "title": "What is your ideal neighborhood and what does it have?",
        "author": "GiantDuarf",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dm51t/what_is_your_ideal_neighborhood_and_what_does_it/",
        "text": "[removed]",
        "created_utc": 1536262293,
        "upvote_ratio": ""
    },
    {
        "title": "Job Interviewers of Reddit, What should I do if someone re-explain the same idea I gave as it's his idea in a Group Interview",
        "author": "baggord",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dieai/job_interviewers_of_reddit_what_should_i_do_if/",
        "text": "[removed]",
        "created_utc": 1536239378,
        "upvote_ratio": ""
    },
    {
        "title": "In life, you are going to encounter plenty of uncomfortable things that may make you feel cynical or sad or anything negative. So how can you stay optimistic without being naive?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dhv91/in_life_you_are_going_to_encounter_plenty_of/",
        "text": "This is mostly something that I struggled with in my entire life. \n\nIn life, you are going to encounter plenty of things that are uncomfortable, scary, dark or things that you do not want to see or hear or experience.\n\nBecause of this, many people eventually become cynical or pessimistic or maybe just do not care about anything anymore except for themselves. In some cases, pretty optimistic and promoting the good in life can be seen as naive or stupid, even if these people are actually aware of these dark phenomena.\n\nI struggled with this coping before. \n\nMany times I often feel cynical about plenty of people, sometimes even go through some stages of paranoia even when I simply go out or go abroad (which I haven't done in a long time). \n\nI sometimes even developed mild forms of depression and anxiety disorders becuase of these dark or uncomfortable phenomena get to me personally, even though I was not directly involved in these phenomena\n\nSometimes I am even too scared or too cautious to do anything becuase of these things too.\n\nI know that it may be stupid to feel these kinds of feelings or feel paranoid despite that there are philosophies and ideas that promote the mentality that is mostly against this like living dangerously by Nietzsche or Mohammed Ali mentioned the importance of taking risks or even the idea that it is better to be just a little bit positive amidst the chaos even if it sounds silly for some, or the fact that knowing what to ignore is also a part of mindfulness.\n\n(Sometimes your gut tells you that it is the right thing to do to be more cautious becuase otherwise doing the opposite will make you an idiot or selfish or foolish or childish)\n\nAll in all, I know that there are plenty of things that we all have to come to terms with eventually but I am aware (And frankly, I am tired of this) that this sometimes get to me personally to the point that doing the opposite requires a lot of courage and guts and a whole of fear to confront",
        "created_utc": 1536235738,
        "upvote_ratio": ""
    },
    {
        "title": "Is the education system of today even worth it anymore?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dhbi5/is_the_education_system_of_today_even_worth_it/",
        "text": "If you have gone on social media, many people today criticise against the education system on how anxiety-filling it is, how much pressure it puts people just to do well and succeed despite the intense amount of work and expectations that students have, and not to mention the unbelievable student loans that have to be paid long after the courses have ended.\n\nToday, you will also find videos or articles of people, even famous and successful people, saying that degrees are not worth it anymore becuase they either do not give you the experience that you need or becuase some people judge mostly on degrees alone or the grades without judging the character of the person.\n\nEven today, despite the large advancements in many things in the world of today, from science and technology, to different research methods, to even advancements in history and philosophy, there are still plenty of things that people criticise against when they are taught in education such as whether it is worth teaching students about a particular religion over another, or how much history is allowed to be taught, or how biased can the teacher potentially be about a particular subject, or whether some subjects should be even worth teaching like gender studies which is not those degrees that has been stigmatised as biased research.\n\nMany people still criticise if the degree is even worth it anymore becuase even though many people are promised that degrees will earn them good futures with good income and a good life but many environments are either so competitive that some people will use any means necessary to get the job, or some people are not able to get the job at all becuase either they do not meet the qualities that the work environment need or becuase they do not have the necessary experience and so on.\n\nIt is as if these students are feeling betrayed that after all the work and time committed  to hopefully do the jobs that they desire, all of it is all a lie ",
        "created_utc": 1536231296,
        "upvote_ratio": ""
    },
    {
        "title": "Why are the myths &amp; superstitions that drive the demand for poaching still present? The Chinese government has a lot of control over censorship so it’s be very easy for them to educate people, why don’t they want to?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dh6qn/why_are_the_myths_superstitions_that_drive_the/",
        "text": "[deleted]",
        "created_utc": 1536230106,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think that social media is negatively impacting today’s dating/relationship culture?",
        "author": "_lemontree",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9dcrq5/do_you_think_that_social_media_is_negatively/",
        "text": "",
        "created_utc": 1536193365,
        "upvote_ratio": ""
    },
    {
        "title": "What should I write in my journal, and what questions should I ask my grandfather in letters, in order to be useful to future historians?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9d5r0g/what_should_i_write_in_my_journal_and_what/",
        "text": "[removed]",
        "created_utc": 1536148270,
        "upvote_ratio": ""
    },
    {
        "title": "Name that psychological phenomenon!",
        "author": "ggeedubb",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9d5kx3/name_that_psychological_phenomenon/",
        "text": "[removed]",
        "created_utc": 1536146897,
        "upvote_ratio": ""
    },
    {
        "title": "Gentrification versus white flight suburb",
        "author": "KansasStater",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9d2o4s/gentrification_versus_white_flight_suburb/",
        "text": "[removed]",
        "created_utc": 1536118419,
        "upvote_ratio": ""
    },
    {
        "title": "What does the American Dream mean to you?",
        "author": "spannisharmada",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9d217t/what_does_the_american_dream_mean_to_you/",
        "text": "[removed]",
        "created_utc": 1536113304,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best source for old culture (50+ years ago but more interested in renessaince era and before).",
        "author": "vulcliques",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9d1wh9/what_is_the_best_source_for_old_culture_50_years/",
        "text": "[removed]",
        "created_utc": 1536112247,
        "upvote_ratio": ""
    },
    {
        "title": "How would one go about actually starting a revolution?",
        "author": "Scabious",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9d1hdo/how_would_one_go_about_actually_starting_a/",
        "text": "(a left-wing and a right-wing revolution would of course be two different creatures, feel free to answer for either, though I personally am a leftist, and would value posts more geared towards that tendency)\n\n&amp;#x200B;\n\nWhile the question \"is revolution a good idea?\" is a good question to ask, I'd appreciate a more narrow scope for this question. I don't expect everyone that replies to this to be a revolutionary, on the contrary, I would love some fresh perspectives on the matter, in an effort to escape groupthink. Of course, the answer to this depends on the country, and while I am American, I'd enjoy reading international ideas.\n\n&amp;#x200B;\n\nIf it was your job to start a successful revolution, how would you go about doing so?",
        "created_utc": 1536108797,
        "upvote_ratio": ""
    },
    {
        "title": "What does the American Dream mean to you?",
        "author": "spannisharmada",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9czqv1/what_does_the_american_dream_mean_to_you/",
        "text": "[removed]",
        "created_utc": 1536095304,
        "upvote_ratio": ""
    },
    {
        "title": "What’s the best country on the planet?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cyq6z/whats_the_best_country_on_the_planet/",
        "text": "[removed]",
        "created_utc": 1536088239,
        "upvote_ratio": ""
    },
    {
        "title": "What is your take on these alternative ways of Education, Dating and Housing?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cxi9d/what_is_your_take_on_these_alternative_ways_of/",
        "text": "[removed]",
        "created_utc": 1536080195,
        "upvote_ratio": ""
    },
    {
        "title": "Why is reading considered important?",
        "author": "TheCamelHerder",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cx8ei/why_is_reading_considered_important/",
        "text": "From a very young age, adults and educators heavily encourage kids to read, to get lost in a book. They say it really doesn't matter what they read, as long as they read. Even into adulthood, casual novel reading is lauded as a positive thing to do. My question isn't so much \"*Why do we teach kids how to read?*\" because obviously to function normally in modern society people will need to know how to read on some basic level, but instead \"*Why is reading considered a good use of time compared to similar activities?*\" or something along those lines.\n\nSo, I think I understand why, in general, casual reading is encouraged. I'm assuming it's because casual reading improves and reinforces one's reading ability overall, which can then be beneficial in situations where reading becomes necessary (textbooks, news articles, non-fiction, contacts, writing, etc). Though, is that the sole reason that reading is considered important? \n\nI've heard that popular quote, \"A reader lives a thousand lives before he dies. The man who never reads lives only one.\" Yet, if the reasoning is that reading gives you insight into the lives and minds of others, or something to that extent, why are high-quality movies and television often considered a lesser medium in the cultural mindset - the very same shows and movies that are often based on books? How many times have you heard someone complain about some teenage flunky they know that watches Netflix series and movies all day instead of doing something beneficial - something like exercising, reading, or getting a job? Is it because watching and observing is less intellectual rigorous than reading?\n\nI've read non-fiction books much of my life, with purpose but without much enjoyment, though I've never really read novels. It's not that I can't read, it's just that I'm not aware of the benefits of reading novels compared to other activities that I may enjoy doing more so.",
        "created_utc": 1536078549,
        "upvote_ratio": ""
    },
    {
        "title": "When getting to know someone that there is mutual romantic interest in, how long should you wait before bringing up political views?",
        "author": "XenoPasta",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cuu2d/when_getting_to_know_someone_that_there_is_mutual/",
        "text": "[removed]",
        "created_utc": 1536061348,
        "upvote_ratio": ""
    },
    {
        "title": "I PROMISE I'll reward you REDDIT GOLD if you do this - May you please play the Norwegian National Anthem (Ja, Vi Elsker Dette Landet) on a shamisen (a Japanese banjo) and upload it to YouTube or SoundCloud?",
        "author": "TheSonOfWAY",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ct0hy/i_promise_ill_reward_you_reddit_gold_if_you_do/",
        "text": "[removed]",
        "created_utc": 1536041703,
        "upvote_ratio": ""
    },
    {
        "title": "How can I be sure that people aren't making fun of me behind my back?",
        "author": "Fart_Gas",
        "url": "https://www.reddit.com/r/Advice/comments/9csmge/how_can_i_be_sure_that_people_arent_making_fun_of/",
        "text": "",
        "created_utc": 1536037591,
        "upvote_ratio": ""
    },
    {
        "title": "Is a proportionate minimum wage a better alternative",
        "author": "CuriousNihilist",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9csm6h/is_a_proportionate_minimum_wage_a_better/",
        "text": "So usually, people who are against increasing minimum wage to 15$ say that it  would demotivate aspiring entrepreneurs from starting a business as chances of them earning decent profit would be low if they lose money to the high wages of the staff.\n\nSo as a solution to this, what if we introduce a relative or proportionate minimum wage that will increase as the size and profits of the company increases.\n\nFor example,\n\n10% increase from present minimum wage to 15$ in small company.\n40% increase in medium company.\n80% in large.\n100% in super large.\n\n",
        "created_utc": 1536037489,
        "upvote_ratio": ""
    },
    {
        "title": "Why do porn actors kiss each other on scenes?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9coqw5/why_do_porn_actors_kiss_each_other_on_scenes/",
        "text": "[removed]",
        "created_utc": 1536005285,
        "upvote_ratio": ""
    },
    {
        "title": "In light of the Brazilian National Museum fire, why do we leave priceless artifacts of human civilization in the care of governments who cannot prioritize their preservation?",
        "author": "endtyrrany",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cnh6c/in_light_of_the_brazilian_national_museum_fire/",
        "text": "[removed]",
        "created_utc": 1535996329,
        "upvote_ratio": ""
    },
    {
        "title": "my parents payed for me to have my first driving lesson today and i set an alarm to wake up in enough time to have it (my parents go to work earlier than i’m awake) and my phone ran out of battery so the alarm didn’t go off, and i missed the lesson, what do i do??",
        "author": "richardrichard190",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ckdbe/my_parents_payed_for_me_to_have_my_first_driving/",
        "text": "[removed]",
        "created_utc": 1535970336,
        "upvote_ratio": ""
    },
    {
        "title": "What is the point of spending our free time on artificial things like Smartphones, Laptops and TV etc when travelling in nature and talking to fellow human beings to understand their life feels much better and is also good for health?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cgqb4/what_is_the_point_of_spending_our_free_time_on/",
        "text": "[removed]",
        "created_utc": 1535932584,
        "upvote_ratio": ""
    },
    {
        "title": "What is the point of spending our free time on smartphones and laptops and other forms man made things when travelling in nature and understanding the needs of fellow humans is much better for recreation as well as health?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cgphl/what_is_the_point_of_spending_our_free_time_on/",
        "text": "[deleted]",
        "created_utc": 1535932386,
        "upvote_ratio": ""
    },
    {
        "title": "How do you know that you eventually managed to find your rightful place in the world?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cgnlu/how_do_you_know_that_you_eventually_managed_to/",
        "text": "[removed]",
        "created_utc": 1535931909,
        "upvote_ratio": ""
    },
    {
        "title": "How many people do you estimate will come to your funeral if you died today?",
        "author": "Fart_Gas",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cfd91/how_many_people_do_you_estimate_will_come_to_your/",
        "text": "[removed]",
        "created_utc": 1535921016,
        "upvote_ratio": ""
    },
    {
        "title": "Is it better to let someone follow their own beliefs, even if you think it is damaging to them, or to convince them to follow your own beliefs which may make them happier?",
        "author": "XLISSX",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9ceoet/is_it_better_to_let_someone_follow_their_own/",
        "text": "Edit: I want to clarify, I absolutely believe that I could be wrong in everything I personally believe, just like anyone could be. I am wondering on principle what people think of those who push their beliefs on others, or if they think there is a right way to try and convince a person of their beliefs. Maybe there is or isn't, I don't know.",
        "created_utc": 1535915675,
        "upvote_ratio": ""
    },
    {
        "title": "Many of us are emphasized by others that it is better to be a good person because good will always prosper but reality and history say otherwise. So is being good even worth it in today's world?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cc7bh/many_of_us_are_emphasized_by_others_that_it_is/",
        "text": "[removed]",
        "created_utc": 1535896564,
        "upvote_ratio": ""
    },
    {
        "title": "If one were to find themselves the owners of a large sum of cash sometime in the future, say upwards of a million USD, what would be the best way to invest this said money?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cbplp/if_one_were_to_find_themselves_the_owners_of_a/",
        "text": "[deleted]",
        "created_utc": 1535891505,
        "upvote_ratio": ""
    },
    {
        "title": "What is the core reason that some countries are more social democratic than others?",
        "author": "TrollVagene",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9cb7f8/what_is_the_core_reason_that_some_countries_are/",
        "text": "For example, Canada/Australia/Germany are much better than USA if talk about humane values instead of wealth.\n\nThis is proved by people's healthcare rights, better minimum wages, wealth distribution, GINI Index and opportunities for free education.\n\nNow what is the core reason for this difference?\n\nIf the reason is ignorance then what is the reason for that and so on.",
        "created_utc": 1535885043,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many people and other nations love to hate America?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9catxv/why_do_so_many_people_and_other_nations_love_to/",
        "text": "[removed]",
        "created_utc": 1535879530,
        "upvote_ratio": ""
    },
    {
        "title": "I PROMISE I'll reward you REDDIT GOLD if you do this - May you please play the Norwegian National Anthem (Ja, Vi Elsker Dette Landet) on a shamisen (a Japanese banjo) and upload it to YouTube, SoundCloud or someplace decent?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9calbe/i_promise_ill_reward_you_reddit_gold_if_you_do/",
        "text": "[removed]",
        "created_utc": 1535876059,
        "upvote_ratio": ""
    },
    {
        "title": "I like a girl but she is an introvert! :\")",
        "author": "Bamia21",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9c5tr1/i_like_a_girl_but_she_is_an_introvert/",
        "text": "[removed]",
        "created_utc": 1535830162,
        "upvote_ratio": ""
    },
    {
        "title": "Whenever im siting close to someone i feel like i need to fart?",
        "author": "mikhbjgt",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/9c4swt/whenever_im_siting_close_to_someone_i_feel_like_i/",
        "text": "[removed]",
        "created_utc": 1535822374,
        "upvote_ratio": ""
    }
]