[
    {
        "title": "How should we redefine laws and structure for the future?",
        "author": "glupingane",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5qczt6/how_should_we_redefine_laws_and_structure_for_the/",
        "text": "With so many ethical lines being blurred with today's technology, and as it advances further, they'll only get blurred more, I'm really getting the feeling we should start getting smart people together to figure out exactly what it is we want and don't. With AI's becoming smarter than us fairly soon, that's going to be very important to just stay alive. The whole thing about Midas turning even his family and food into gold leaves me with a moral that you might think you know what you want exactly, but if it isn't thought through thoroughly, that fate could be bestown upon all of humanity. \nLast week I saw a couple articles about Google creating a machine-learning program able to create a machine-learning program that beat human programmed programs at its designated task. This shows how close we are getting to a recursive self improving AI.\n\nSimilarly, with chimera embryos now actually created (and destroyed) as part pig and part human with good arguments for why we should pursue this road further, what we define as human might be quite blurred as pigs grow up to be organ donors to humans with more and more organs replaced by ours. We kill millions after raising them for the purpose of eating them, so we're already doing it large-scale, and to that little boy who's on a waiting list for an organ that probably won't show up, he'd love it if one could grow on a pig.\n\nThe time comes where we have to figure out what an individual is, and create a universal set of rules that would apply even if not from earth, (it's very likely we'll either get contact with extraterrestrials at some point in the future, or destroy ourselves before then, and I know which one I hope for), but alive and smart enough to be considered intelligent. \n\nMain reason I don't bring up outlawing chimera's or other developing technologies is that I believe that all ethically challenging issues/projects should be done carefully and transparently. If they're criminalized, they'll still happen, just with no regulation at all",
        "created_utc": 1485466346,
        "upvote_ratio": ""
    },
    {
        "title": "If all gays became far-right for some reason (like Milo Yiannopoulos) how would the left respond lmfao?",
        "author": "RightWinged-Gay-Man",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5qbey8/if_all_gays_became_farright_for_some_reason_like/",
        "text": "[removed]",
        "created_utc": 1485451051,
        "upvote_ratio": ""
    },
    {
        "title": "Is the best way to combat SJWS and liberals for more right wingers to become gay or more gays to become right winged (on even social issues)?",
        "author": "RightWinged-Gay-Man",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5qba1y/is_the_best_way_to_combat_sjws_and_liberals_for/",
        "text": "[removed]",
        "created_utc": 1485449808,
        "upvote_ratio": ""
    },
    {
        "title": "What is an effective strategy to counteract the effects of \"fake news\"?",
        "author": "roberto_m",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5qa74g/what_is_an_effective_strategy_to_counteract_the/",
        "text": "It seems to me that calling out planned and unplanned blatant lies is useless and counterproductive. I'm thinking of what happened after Silvio Berlusconi was elected in Italy nearly 16 years ago, as well as what's happening now in, er, an unnamed North-American country after an unnamed businessman was elected president.\n\nWhen Berlusconi was president he could say anything, and people would believe him no matter what. Whoever tried to call him out would only boost his popularity, and also expose themselves to attacks for having a hidden agenda (source: I'm Italian).\n\nWhat's happening these days is exactly the same, but at the speed of Twitter instead of the speed of TV.\n\nThis is clearly down to people's beliefs, but in both examples above we aren't talking about religion or a totalitarian regime, rather we have a person or group of people lying for their personal benefit.\n\nAnd this bring me to my question. What is an effective way to counteract these lies and the fake news that spur from them?\n\n**Edit** Various commenters gave me suggestions on how to distinguish fake news from real stories. While I appreciate these answers, that's not what I'm asking. I suppose I could phrase it like this: \"How can a reputable media outlet counteract fake news stories effectively?\" Because I think that drawing attention to the perpetrator of said fake news is really playing the game of the perpetrator themselves.",
        "created_utc": 1485438170,
        "upvote_ratio": ""
    },
    {
        "title": "Will Facebook CIA become a serious threat to freedom of citizens if the US eventually will become a rogue nation with dangerous populists like Trump on top?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q9wjs/will_facebook_cia_become_a_serious_threat_to/",
        "text": "[deleted]",
        "created_utc": 1485434089,
        "upvote_ratio": ""
    },
    {
        "title": "Will Facebook CIA become a serious threat to freedom of citizens if the US eventually will become a rogue nation with dangerous populists like Trump on top?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q9vuk/will_facebook_cia_become_a_serious_threat_to/",
        "text": "[deleted]",
        "created_utc": 1485433773,
        "upvote_ratio": ""
    },
    {
        "title": "On the scanner",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q8lwm/on_the_scanner/",
        "text": "[removed]",
        "created_utc": 1485409190,
        "upvote_ratio": ""
    },
    {
        "title": "On the scanner",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q7dvr/on_the_scanner/",
        "text": "[removed]",
        "created_utc": 1485393852,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a difference in the signal a TV/cable box receives when displaying commercials vs the actual program?",
        "author": "Pickled_Pankake",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q6jj5/is_there_a_difference_in_the_signal_a_tvcable_box/",
        "text": "Not sure how to articulate this. Say you're on channel 5 and you're watching your show, then it goes to commercial. Can you differentiate the signal received during the scheduled program from the one when the show is playing? \n\n",
        "created_utc": 1485384702,
        "upvote_ratio": ""
    },
    {
        "title": "How has extraditing El Chapo to the US affected Mexico?",
        "author": "scaryghosts",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q4yjx/how_has_extraditing_el_chapo_to_the_us_affected/",
        "text": "Has it created a power vacuum in the drug trade? Has it had any immediate positive or negative effects on the US or Mexico?",
        "created_utc": 1485369592,
        "upvote_ratio": ""
    },
    {
        "title": "What are some puns involving the words \"hood\" and \"army ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q4km8/what_are_some_puns_involving_the_words_hood_and/",
        "text": "[removed]",
        "created_utc": 1485365880,
        "upvote_ratio": ""
    },
    {
        "title": "AliExpress vs Ebay vs Amazon",
        "author": "thetallestmanonfire",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q4h83/aliexpress_vs_ebay_vs_amazon/",
        "text": "[removed]",
        "created_utc": 1485364990,
        "upvote_ratio": ""
    },
    {
        "title": "How is that politically conservative subreddits have more folllowers than liberal ones?",
        "author": "RandomWriterGuy",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q1zqa/how_is_that_politically_conservative_subreddits/",
        "text": "[removed]",
        "created_utc": 1485330438,
        "upvote_ratio": ""
    },
    {
        "title": "One of my eye lids hangs lower than the other, is this normal or should I see a doctor?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q13a2/one_of_my_eye_lids_hangs_lower_than_the_other_is/",
        "text": "[deleted]",
        "created_utc": 1485317104,
        "upvote_ratio": ""
    },
    {
        "title": "Is it fair to judge a ideologic group by the actions of its followers?",
        "author": "KNOWER_OF_STUFF",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5q0f9o/is_it_fair_to_judge_a_ideologic_group_by_the/",
        "text": "Like shouldn't it be common sense that stupid people everywhere? ",
        "created_utc": 1485309138,
        "upvote_ratio": ""
    },
    {
        "title": "Meme titles?",
        "author": "crimsonhawk01",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pzoxl/meme_titles/",
        "text": "[removed]",
        "created_utc": 1485300975,
        "upvote_ratio": ""
    },
    {
        "title": "Tips on Crowdfunding?",
        "author": "shotgunlewis",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pz2mc/tips_on_crowdfunding/",
        "text": "I'm planning a crowdfunding campaign for my non-profit education tech startup and could use some wisdom. Let me know if there's a better subreddit to post in!",
        "created_utc": 1485294713,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone give me some good arguments supporting bringing back manufacturing jobs to the U.S. at this day and age?",
        "author": "daphlamedoe",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pxb7l/can_someone_give_me_some_good_arguments/",
        "text": "Is it at all beneficial to the **long-term development** of the U.S. economy to be wanting to bring back 'low-skilled' manufacturing jobs back to the U.S. in 2017? \n",
        "created_utc": 1485277862,
        "upvote_ratio": ""
    },
    {
        "title": "Trump is going to let FBI Comey keep his job?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pwwfq/trump_is_going_to_let_fbi_comey_keep_his_job/",
        "text": "[deleted]",
        "created_utc": 1485273730,
        "upvote_ratio": ""
    },
    {
        "title": "Why am I, a straight male, so intrigued by and interested in TS women?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pw84q/why_am_i_a_straight_male_so_intrigued_by_and/",
        "text": "[removed]",
        "created_utc": 1485266169,
        "upvote_ratio": ""
    },
    {
        "title": "Postmodernist television and the Search for Sincerity",
        "author": "aa24577",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pu6o2/postmodernist_television_and_the_search_for/",
        "text": "I've been very interested recently in the idea of sincerity, and with how it manifests itself in media. I've made some posts about it recently in music subreddits, but I wanted to talk about it here. If anyone has some better subs for me to cross-post in, please recommend them.\n\nAnyway, I was watching [this](https://www.youtube.com/watch?v=2doZROwdte4) youtube video after a long rabbit hole of David Foster Wallace interviews, and it got me thinking about sincerity in modern television. The video basically claimed that shows like Seinfeld and It's Always Sunny are wrapped up in cynicism and postmodern irony, while shows like The Office and Parks and Rec are adopting the ideas of New Sincerity, or an adoption of genuine emotion and appreciation of the human condition at the expense of ridicule. \n\nThis is strange to me, because I love Seinfeld and It's Always Sunny, but I don't really enjoy the Office or Parks and Rec that much. When I watch comedy, I enjoy self awareness and detachment. It makes me laugh harder and makes me more susceptible to the humor. I watch Parks and Rec or the Office, and the combination of the cynicism towards the modern workplace and office life combined with the simultaneous over-the-top ineptness (and also earnestness) of the characters almost takes me out of the moment. \n\nWhat's strange is that I enjoy sincerity in music and other art. I am legitimately tired of parody and irony in music, and I love new artist's attempts to just put themselves out there in a genuine and forthcoming way. Irony almost seems like a cop-out, and it's become lazy. Sincerity is such a refreshing and beautiful change in style. \n\nWhat I'm wondering is how the two mediums are different, and how you guys would explain this, or whether you would agree at all. I watch Letterman and I love the cynicism, it's hilarious. I love how he subverts the format he's in, and how he's also somehow genuine while doing it. Maybe what I really like is metamodernism. \n\nAnyway, I'm drunk and I'd just like anyone to post whatever ideas they have. ",
        "created_utc": 1485232567,
        "upvote_ratio": ""
    },
    {
        "title": "Who are some of the top Reddit posters?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5prh0e/who_are_some_of_the_top_reddit_posters/",
        "text": "[deleted]",
        "created_utc": 1485203815,
        "upvote_ratio": ""
    },
    {
        "title": "Please help expand this grocery shopping list: What more can we eat or drink with anti-aging properties?",
        "author": "Sungani",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pr4vg/please_help_expand_this_grocery_shopping_list/",
        "text": "[removed]",
        "created_utc": 1485200714,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think apple or android make there phones delicate to keep phone case company's in business?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pqp30/do_you_think_apple_or_android_make_there_phones/",
        "text": "[removed]",
        "created_utc": 1485196842,
        "upvote_ratio": ""
    },
    {
        "title": "I am over 2 metres tall, I am born in the wrong time (I hate feminists and liberals) how should I get rid of liberals/feminists?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5ppjuq/i_am_over_2_metres_tall_i_am_born_in_the_wrong/",
        "text": "[removed]",
        "created_utc": 1485186891,
        "upvote_ratio": ""
    },
    {
        "title": "How much credit goes to the rider in horse jumping?",
        "author": "Culecks",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pkyz6/how_much_credit_goes_to_the_rider_in_horse_jumping/",
        "text": "Would the horse still try to jump over the obstacles even if the rider didn't direct him?",
        "created_utc": 1485131560,
        "upvote_ratio": ""
    },
    {
        "title": "In roughly 25 years we went from VHS to Compact Disks to Digital. What's next?",
        "author": "the_seed",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pkald/in_roughly_25_years_we_went_from_vhs_to_compact/",
        "text": "[removed]",
        "created_utc": 1485124945,
        "upvote_ratio": ""
    },
    {
        "title": "It's 10:33am I'm in California, what time is it where your from? Tell me something interesting about yourself!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pimz2/its_1033am_im_in_california_what_time_is_it_where/",
        "text": "[removed]",
        "created_utc": 1485109913,
        "upvote_ratio": ""
    },
    {
        "title": "How do experts who put up so much free content on social media and podcasts make money?",
        "author": "twopatties",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pg5z9/how_do_experts_who_put_up_so_much_free_content_on/",
        "text": "Are they simply trying to attract more paying clients to their own ''practices'' through this amount of free content online? ",
        "created_utc": 1485077237,
        "upvote_ratio": ""
    },
    {
        "title": "How big a role do bots play in the type of content that makes it to the frontpage?",
        "author": "peetss",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pculv/how_big_a_role_do_bots_play_in_the_type_of/",
        "text": "[removed]",
        "created_utc": 1485032239,
        "upvote_ratio": ""
    },
    {
        "title": "Dear Reddit, What tips for relocating to Jakarta with family?",
        "author": "justbflat",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5pal6q/dear_reddit_what_tips_for_relocating_to_jakarta/",
        "text": "[removed]",
        "created_utc": 1485004770,
        "upvote_ratio": ""
    },
    {
        "title": "I was pretty excited about President Trump taking office this morning that I took the day off work to watch everything, as I sit here hours later I hate to say it, but I can't stand his family and Trumps face is really pissing me off, also his wife is very awkward. Do we really have four years?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p8dwi/i_was_pretty_excited_about_president_trump_taking/",
        "text": "[removed]",
        "created_utc": 1484967083,
        "upvote_ratio": ""
    },
    {
        "title": "How is Goldman Sachs so good at getting former executives into government positions?",
        "author": "Smash_4dams",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p7y76/how_is_goldman_sachs_so_good_at_getting_former/",
        "text": "They are currently #76 on the Fortune 500. So 75 other companies are theoretically \"higher up\" than Goldman. How are they able to wield so much more influence than other multi-billion-dollar companies?",
        "created_utc": 1484961355,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a site that hosts varying types of statistics on college students?",
        "author": "AnonymousSteam",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p7y4s/is_there_a_site_that_hosts_varying_types_of/",
        "text": "As the title says I'm looking for a website that I could collect varying types of statistics on college students from behavioral / psychological studies (such as depression rate among students as one example), debt vs. post graduation salary, etcetera. \n\nFreely available and the ability to be posted elsewhere is a must. I don't want to infringe on the data / claim ownership. \n\nI'm simply looking for a source where I can scrape data from to create some line charts for a landing page on a website I'm building. ",
        "created_utc": 1484961328,
        "upvote_ratio": ""
    },
    {
        "title": "What are the factual arguments against the Affordable Care Act?",
        "author": "jlesnick",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p7vor/what_are_the_factual_arguments_against_the/",
        "text": "What would be the factual arguments for repeal?",
        "created_utc": 1484960481,
        "upvote_ratio": ""
    },
    {
        "title": "Why is there no conservative [or otherwise] movement against DIVORCE, the way there is against abortion and drug use?",
        "author": "DAVasquez-",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p6qur/why_is_there_no_conservative_or_otherwise/",
        "text": "[removed]",
        "created_utc": 1484947786,
        "upvote_ratio": ""
    },
    {
        "title": "What can I do to promote male parents breastfeeding from their own nipples?",
        "author": "everythingundersun",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p5m13/what_can_i_do_to_promote_male_parents/",
        "text": "[removed]",
        "created_utc": 1484936547,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think about Trump being the POTUS?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p5dib/what_do_you_think_about_trump_being_the_potus/",
        "text": "[deleted]",
        "created_utc": 1484934451,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people have a problem with closeted gays if they are perfectly happy with that choice?",
        "author": "RightWinged-LGBT-Man",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p4jkj/why_do_people_have_a_problem_with_closeted_gays/",
        "text": "[removed]",
        "created_utc": 1484926608,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the political \"title\" of people with these political views?",
        "author": "Culecks",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p4al4/what_would_be_the_political_title_of_people_with/",
        "text": "[removed]",
        "created_utc": 1484923981,
        "upvote_ratio": ""
    },
    {
        "title": "If isis decided to Attack the US tonight, does Obama or Trump take action?",
        "author": "Aaronrodgers2",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p1gdg/if_isis_decided_to_attack_the_us_tonight_does/",
        "text": "[removed]",
        "created_utc": 1484881813,
        "upvote_ratio": ""
    },
    {
        "title": "What will Trumps be remembered for? four years from now.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p1fgr/what_will_trumps_be_remembered_for_four_years/",
        "text": "[deleted]",
        "created_utc": 1484881505,
        "upvote_ratio": ""
    },
    {
        "title": "How can I find out the health of my sperm?",
        "author": "Culecks",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5p08f6/how_can_i_find_out_the_health_of_my_sperm/",
        "text": "[removed]",
        "created_utc": 1484868391,
        "upvote_ratio": ""
    },
    {
        "title": "I don't believe society should be indoctrinated/forced into this communist way of thinking. I mean I like men, but I do not believe in gay marriage any other gays agree with me?",
        "author": "RightWinged-Gay-Man",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5oy52g/i_dont_believe_society_should_be/",
        "text": "[removed]",
        "created_utc": 1484849245,
        "upvote_ratio": ""
    },
    {
        "title": "Every president has made promises, has their been one that actually came through tho?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5oy4t6/every_president_has_made_promises_has_their_been/",
        "text": "[deleted]",
        "created_utc": 1484849179,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a right winged homosexual man. Now, why do liberals despise my kind even more then straight conservatives?",
        "author": "RightWinged-Gay-Man",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5oxzgm/im_a_right_winged_homosexual_man_now_why_do/",
        "text": "[removed]",
        "created_utc": 1484847804,
        "upvote_ratio": ""
    },
    {
        "title": "Lets have a conversation about tea, how many out there drink tea for health benefits and can you testify that it helps you?",
        "author": "Aaronrodgers2",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5owsp5/lets_have_a_conversation_about_tea_how_many_out/",
        "text": "[removed]",
        "created_utc": 1484835579,
        "upvote_ratio": ""
    },
    {
        "title": "How much faith in humanity do you have?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5owql3/how_much_faith_in_humanity_do_you_have/",
        "text": "[deleted]",
        "created_utc": 1484834892,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there SO MANY ASSHOLES in the Army?",
        "author": "SoManyAssholesThere",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5otp4j/why_are_there_so_many_assholes_in_the_army/",
        "text": "[removed]",
        "created_utc": 1484790009,
        "upvote_ratio": ""
    },
    {
        "title": "Hypothetically speaking, imagine what would happen to say lady Gaga or the NFL if the consumer stoped buying and going to the shows.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5ospyb/hypothetically_speaking_imagine_what_would_happen/",
        "text": "[removed]",
        "created_utc": 1484779493,
        "upvote_ratio": ""
    },
    {
        "title": "I'm seeing tons of arguments against Betsy Devos as Secretary of Education. Those who think she is a good pick--why?",
        "author": "alliegatorrr",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5oqsy7/im_seeing_tons_of_arguments_against_betsy_devos/",
        "text": "",
        "created_utc": 1484761465,
        "upvote_ratio": ""
    },
    {
        "title": "What is your gut feelings on how Friday's inauguration will go?",
        "author": "Aaronrodgers2",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5oqpv7/what_is_your_gut_feelings_on_how_fridays/",
        "text": "",
        "created_utc": 1484760682,
        "upvote_ratio": ""
    },
    {
        "title": "What is behind the trend of the diminishing importance of family? Is it actually a trend?",
        "author": "whatamidoing11",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5onprm/what_is_behind_the_trend_of_the_diminishing/",
        "text": "I'm from a U.S. middle class immigrant family, so it's given me a perspective to see this...I don't know, trend from a unique view.\n\nIn many small ways, it seems like the \"importance\" of family is on the decline.  Lots of southern European (My Big Fat Greek Wedding), Asian, or Indian families seem to be almost run on the assumption that family plays a huge role in everything.  Growing up, it seems like every weekend I was either at a second cousin's birthday party or a fourth cousin once removed's religious event, or just plain going to see this old great-aunt I didn't know I had.  Now as an adult, most of my peers not only wouldn't want to be that involved with their family themselves, and if they did, they'd consider it almost child abuse to make their kid go to dinner at Grandma's house on Sunday rather than stay home and watch a football game or something.\n\nAs famously portrayed in The Sopranos, the idea of putting your elderly parent in a nursing home is a complete insult in some cultures, but has now become a pretty common idea altogether.\n\nThere also seems to have been a time where most of life's choices were done under the family watch.  People wouldn't move out of their house until they were married, so naturally, dating or courtship would be heavily supervised, the parents would be pretty involved in planning the wedding, and in a lot of these cultures, it's not uncommon for multi-generational households to exist.  Obviously the idea of the self-sufficient American who moves out at 18, and gives their parents a couple of calls a year to let them know that they're alive or or marrying a really great person you'll have to meet one day is completely at odds with this.  A lot of /r/relationships type advice recommends complete cutting off of parents or siblings for infractions that my family would consider signs of being too *distant*.\n\nI think I've gotten my point across about the differences between the kind of world I grew up in and the one I live in now.  My main question is, what statistic is an indicator for this?  Almost everyone can agree it's happening more and more.  Why?\n\nIs it a class thing?  As people get richer and don't have to depend on family for basic needs, do they naturally seek more independence and drift apart?  Even in countries where these traditional views came from?  Is it a culture thing?  American's have always been on the more rugged individual side, would a well off family in the early 1900's have had the same \"distance\" as a well off family now?  Is it technology?  Is a lifestyle of all of us staring at separate screens in our own world really making us all more distant?  Would this mean this trend is happening in all countries, across all socioeconomic markers?",
        "created_utc": 1484719658,
        "upvote_ratio": ""
    },
    {
        "title": "What's the hardest thing you have had to deal with up to this point in your life? Did you learn anything from it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5onj6m/whats_the_hardest_thing_you_have_had_to_deal_with/",
        "text": "[deleted]",
        "created_utc": 1484717166,
        "upvote_ratio": ""
    },
    {
        "title": "Since when was large population deemed to be a bad thing?",
        "author": "BeatriceBernardo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5onad5/since_when_was_large_population_deemed_to_be_a/",
        "text": "Reading a bit of history here and there, it seems that the general consensus was that population is a good thing, the bigger the better. You need the people to work on resources and to defend themselves.\n\nHowever, these days, the sentiment is the other way around. Resources are limited, and might not be able to support a large population.\n\n* When was the change in the shift in perspective?\n* Why was there a change?\n* How should we see population and resources?",
        "created_utc": 1484713995,
        "upvote_ratio": ""
    },
    {
        "title": "What is an iconic moment in your life that you will never forget?",
        "author": "Aaronrodgers2",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5olv3p/what_is_an_iconic_moment_in_your_life_that_you/",
        "text": "",
        "created_utc": 1484698126,
        "upvote_ratio": ""
    },
    {
        "title": "How can you know if your love for her/him is 'lovers' or 'platonic' and (why) does it matter?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5olulf/how_can_you_know_if_your_love_for_herhim_is/",
        "text": "[deleted]",
        "created_utc": 1484697982,
        "upvote_ratio": ""
    },
    {
        "title": "What are some milestone a 28 year old male should of achieved or is closing in on before turning 30?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5ol8af/what_are_some_milestone_a_28_year_old_male_should/",
        "text": "[deleted]",
        "created_utc": 1484691729,
        "upvote_ratio": ""
    },
    {
        "title": "Why is that some people can be so oblivious to his surroundings or friends?",
        "author": "5H4D0W_ReapeR",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5oi6bo/why_is_that_some_people_can_be_so_oblivious_to/",
        "text": "I've always been a person that try my best to stay neutral on most occasions. I'll always try to hear the story from both sides before jumping to any conclusion, but this one person just baffles me thus making me wanting to get some input from others. I'm not sure whether to post here or AskReddit, but do direct me elsewhere if I'm at the wrong place. \n\nHere's a few key points that spark some dissatisfaction among other friends towards a particular individual, lets use a fake name Alex as an easier reference:\n\n- When we go for dinner together, we usually car pool in one car. However, sometimes there's just too many people so we definitely need a second vehicle. Every single time, Alex will jump on the chance to hop on others car instead of volunteering to drive. Only he and another friend has car btw. Isn't it a courtesy for each other to take turns from time to time? I couldn't bear myself to strike the question straight as I know I'm not a driver so I'm in no place to tell him what to do, so sometimes I would just ask something along the lines of \"What if you drive your car today so that the remaining friends can join us?\". Unfortunately, it always ended in us having to leave out other friends in the end. \n\n- He would always say he's on a real tight budget and always say how heavy it is the burden of the tuition  fees. Sometimes he'll borrow some money, and of course I wouldn't mind it as long as you will pay it back. However, sometimes when we go out, he always have the urge to buy lots of somewhat pricy beverages or food. Although he's still owing me money, he can still have the audacity to buy things that when added up, surpasses the amount he borrowed from me. If I were to ask him for the money constantly, that just outright makes me seem like a stingy person, and I'm not. But the fact that he can seemingly not mentioning about the money he borrowed just makes me disappointed.  It was not only after about a semester duration and some questionings from my end, which made him go \"owh yea I did borrow money from you last time\" eventhough I've mentioned it several times before and he returned the money in the end. One thing he always does is if you ask him something that can make him feel uncomfortable,  he can actually act like he didn't hear anything at all which is also another trait that drives others slowly hate him. Another thing to add on the financial side is that he will jump on the chance whenever someone offered to pay for him and he doesn't show any sign of feeling grateful while he always asks us for changes eventhough he have a full table of changes in his room. The excuse is he always forgot to take some when he's going out...\n\n- He borrowed a badminton racket from a friend because he wanted to try out that new line of badminton racket, and he asked the friend to lend him for a week. The next week, unsurprisingly, he said he forgot to bring it back so he's unable to return it. After that, one day the racket string snapped when Alex is playing badminton, and one thing that made the lender friend very furious is that Alex actually asked that friend whether did he borrow him the racket with a near-snapping string! When I heard about this from the lender friend, I was truly speechless. That friend even stated he only used the racket once before lending it to Alex, but Alex can have the thought that the string was already damaged before it's lended to him.\n\nThere are other things as well, but I feel like these 3 should put the point of my question across just fine. I'm just really curious why someone can be so inconsiderate and oblivious? I've always given advice to him in hope that he will start being more considerate. At one point of a time last year, he even told me he realise he know he need to change but unfortunately now he is still the same old oblivious person. Should I even continue to try and help him so that the others won't hate him that much? The others have also said that I'm always saying good words for him and this do more harm than good. \n",
        "created_utc": 1484661356,
        "upvote_ratio": ""
    },
    {
        "title": "Any major companies offer home owners insurance to those who have infamous breeds of dogs?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5of522/any_major_companies_offer_home_owners_insurance/",
        "text": "[removed]",
        "created_utc": 1484617776,
        "upvote_ratio": ""
    },
    {
        "title": "How can we expect people to change for the better when the environment that gave rise to their problems in the first place largely haven't?",
        "author": "Miller0700",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5oc1ur/how_can_we_expect_people_to_change_for_the_better/",
        "text": "*It is no measure of health to be well adjusted to a profoundly sick society.\n-Jiddu Krishnamurti*\n\n\n\nHow can one get of their alcohol or drug abuse when the problems of poverty (as with the issue of oil-boom towns running dry for instance) and abuse still linger in their communities?\n\nHow can one get over their anger issues when all the stresses of life and people haven't gone away?\n\nHow can we expect an misanthrope or a cynic to get over their resentment of humanity when everyday we're given yet another story on the brutality, heartlessness, and general stupidity that people can inflict onto others?\n\nHow can we expect the prisoner, once released, to become a productive member of society when he/she is discriminated against on every level (job wise, social, etc) often forcing them back into a state of crime as they was before?\n\nThe list goes on.",
        "created_utc": 1484587280,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best skill to teach someone in a developing country?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5o9n11/what_is_the_best_skill_to_teach_someone_in_a/",
        "text": "[deleted]",
        "created_utc": 1484553391,
        "upvote_ratio": ""
    },
    {
        "title": "Dаting-Оnline=Sех оn thе First Datе",
        "author": "Evanstamaz",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5o8xnh/dаtingоnlinesех_оn_thе_first_datе/",
        "text": "[removed]",
        "created_utc": 1484543180,
        "upvote_ratio": ""
    },
    {
        "title": "What is \"special snowflake\"?",
        "author": "BeatriceBernardo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5o8rp0/what_is_special_snowflake/",
        "text": "[removed]",
        "created_utc": 1484541051,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Reddit filled with Leftists who only care about themselves?",
        "author": "MuricaWillBeGreat",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5o89ey/why_is_reddit_filled_with_leftists_who_only_care/",
        "text": "[removed]",
        "created_utc": 1484534679,
        "upvote_ratio": ""
    },
    {
        "title": "If something has been illegal your whole life, but you move somewhere it is legal, would you try it?",
        "author": "LostMyKarmaElSegundo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5o875r/if_something_has_been_illegal_your_whole_life_but/",
        "text": "For example, if you have never tried pot but ended up moving to Colorado, would you give it a go?\n\nOr if you moved from the US to Australia where brothels are legal, would you be OK with paying for sex?\n\nI guess this question kind of boils down to how closely your morality aligns with the law.",
        "created_utc": 1484533913,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think the political spectrum in the US has gone too far right and too far left in the EU?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5o6xjs/do_you_think_the_political_spectrum_in_the_us_has/",
        "text": "[removed]",
        "created_utc": 1484519817,
        "upvote_ratio": ""
    },
    {
        "title": "Is knowledge and learning good?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5o3ob2/is_knowledge_and_learning_good/",
        "text": "[deleted]",
        "created_utc": 1484482912,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think reporting would improve or worsen if news outlets were somehow forced to fund themselves through donations from citizens only, rather than through ads?",
        "author": "zeptimius",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5o3g1u/do_you_think_reporting_would_improve_or_worsen_if/",
        "text": "",
        "created_utc": 1484478641,
        "upvote_ratio": ""
    },
    {
        "title": "I could possibly be taking my driving test in the rain. Could really use some tips.",
        "author": "Bttfuture123",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5o30kk/i_could_possibly_be_taking_my_driving_test_in_the/",
        "text": "Hi, everyone. My driving test is this week and it could very well be raining on the day I take it (The test is in California by the way). I am very worried because I have never practiced driving in the rain before. There is a possible rainy day before my driving test day so I am hoping to practice then. However, since I have never driven in the rain before, I could really use a few tips. I know I am supposed to turn on my low beam lights and my windshield wipers before exiting the parking lot (if it's pouring, correct?). I just want to know if there are other things I need to do before I even start driving. Maybe turning on the defroster? Or do I do that when the windows start fogging up? Also, if it is pouring, should I turn on the windshield wipers for the front and rear windows, or do I just need the windshield wipers for the front window and when I get to the backing up near the curb part, I should turn on the windshield wipers for the rear window? Other things I know are that I should be going a little slower than usual and keeping a larger following distance between my car and the car in front of me so I have enough time to break. \n\nEdit: By the way, I cannot reschedule my test day because my permit will be expiring this week and there is no other available test day before the expiration date.\n\nEdit: Thanks so much everyone for your responses so far! They are very helpful. :)\n\nUpdate: I passed!!! Only had 3 minors (which I reminded myself not to make before the test, but did anyway). You would not believe the weather... not only was there heavy rain but it was HAILING as well. My examiner was very kind and understanding so I was not very nervous. I just drove how I normally would but with more caution. Thanks again for all of your advice!! They were very helpful!",
        "created_utc": 1484470289,
        "upvote_ratio": ""
    },
    {
        "title": "Why does the USA stick with their weird Fahrenheit temp scale in stead of adapting to Celcius?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5nzcs9/why_does_the_usa_stick_with_their_weird/",
        "text": "[removed]",
        "created_utc": 1484423488,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a feasible way to enforce sex based bathroom policies?",
        "author": "aggsalad",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5nyyz3/is_there_a_feasible_way_to_enforce_sex_based/",
        "text": "To clarify, \n\nBy sex based bathroom policies I mean policies that aim to restrict who can use gendered bathrooms based on biological sex, or by legal identification. \n\nBy \"feasible\", I mean able to be enforced while maintaining:\n\n- A reasonably small number of false positive arrests or reports. (So that females will not have to interact with the police if someone thinks they don't look feminine enough)\n\n\n- No requirement of invasive checking. (IE: No genital police)\n\n\n- No requirement of universal checking. (IE: Security checking all who enter the restroom, either ID or above)\n\n\nThe reasons I'd say those are required for such policies to be feasible is the policies allegedly aim to protect women's privacy and safety of mind when using public bathrooms. I would consider being falsely accused and/or being questioned by a police officer to be rather distressing. The threat of it happening if one appears too masculine in the eyes of an arbitrary observer would not give anyone peace of mind either. I would wager the last requirement is of economic incentive as well, as hiring a door person for every set of bathrooms (or more if the bathrooms are not adjacent) is probably not in anyone's interest, I'd also wager that many of us have used bathrooms while not having our ID on us at the time.\n\nThere is also the issue of how would one ensure the first requirement does not interfere with trans individuals trying to abide by the policy. For example, a transman (a female to male trans person) goes to use the respective female restroom because that is as the policy dictates. The transman is outwardly indistinguishable from a biological male, and as such is reported to security. Even if the transman is able to resolve disputes with legal ID, having to risk this interaction every time he needs to use the restroom is definitely distressing. Someone who appears to be a male in the women's restroom would probably be distressing for women anyways. How do we legally resolve this, other than the transman simply never being able to use public restrooms? ",
        "created_utc": 1484419443,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a sub where Trump supporters engage in intelligent discussion?",
        "author": "sonic_tower",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5nyyp5/is_there_a_sub_where_trump_supporters_engage_in/",
        "text": "[removed]",
        "created_utc": 1484419363,
        "upvote_ratio": ""
    },
    {
        "title": "How do you find balance between others' perception of you and having fun regardless of what others think?",
        "author": "peppapee",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5nxyc0/how_do_you_find_balance_between_others_perception/",
        "text": "I'm not sure my question is clearly phrased, so let me expound.\n\nWe are often told \"You shouldn't care about what others think!\" But I think this advice is quite flawed. Reputation does matter. It matters in your work life, your social life, your family life, etc. There are perks that come with having a good reputation, and disadvantages that come with a bad rep.\n\nSo, I just want to know... How do you find that balance?",
        "created_utc": 1484408033,
        "upvote_ratio": ""
    },
    {
        "title": "Is digitally generated child pornography immoral? Should it be legal or controlled?",
        "author": "RadiantSun",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5nvhkk/is_digitally_generated_child_pornography_immoral/",
        "text": "Child pornography that is generated through the actual abuse of children is one of the most disgusting and terrible things I can think of. No question; children are in my mind the most vulnerable and innocent components of our society and to harm or abuse one, specially in a sexual capacity, is a monstrous act. Child molestors are monstrous people.\n\nBut the actual abuse of children does not need to take place because computer generated imagery has gotten so incredibly realistic nowadays. And as far as I can reason, I don't really know *why* I feel it's immoral. ",
        "created_utc": 1484366779,
        "upvote_ratio": ""
    },
    {
        "title": "When does someone become your boy-/girlfriend?",
        "author": "yo_soy_soja",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5nubm0/when_does_someone_become_your_boygirlfriend/",
        "text": "I'm in my mid-twenties, and the longest I've dated someone was for a month. I'm about to break that record, and I think this relationship could last a while.\n\nI've never called someone my boyfriend or girlfriend.\n\nWhen exactly does that happen? I'm sure it varies person-to-person, but generally when is okay to refer to someone like that? Is there... like an event or talk or something? Is it generally okay after, like, 2 months?\n\nNo pressure. Just curious.",
        "created_utc": 1484352433,
        "upvote_ratio": ""
    },
    {
        "title": "How does sexual harassment work in HR work?",
        "author": "crazybanditt",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5ntjhe/how_does_sexual_harassment_work_in_hr_work/",
        "text": "I have been informed (I'm skeptical) that no matter what form of touching or contact the victim is in the position to define what sexual harassment means to them and HR follow this. Then in most cases the accused looses their job. Does anybody else work in HR or know HR protocol, even from a legal perspective?\nIs it that simple?",
        "created_utc": 1484344153,
        "upvote_ratio": ""
    },
    {
        "title": "Why was the Bernie Sanders healthcare amendment voted down? Was it voted down because it was a small part of a lot of other miscellaneous amendments of the same bill?",
        "author": "swefpelego",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5ntago/why_was_the_bernie_sanders_healthcare_amendment/",
        "text": "Someone asked where the text for this amendment [(in this original reddit post)](https://www.reddit.com/r/Political_Revolution/comments/5nisw5/these_democrats_just_voted_against_bernies/dce2der/) was and I found what I thought was the text and in looking at it.. I think I would have voted that down too. \n\nHere is my [comment.](https://www.reddit.com/r/Political_Revolution/comments/5nisw5/these_democrats_just_voted_against_bernies/dce2der/)\n\nI'm not sure whether to be infuriated or if people are trying to twist something into something it's not. On its face it's infuriating to think this would be voted down, but that text reads like a jumble of ambiguous stuff and I'm not sure what it actually means. I would have voted it down myself. \n\nThanks in advance.\n\n-Since there weren't any answers here, I'll link to another thread where I posted this and got some good info:\n\nhttps://www.reddit.com/r/Delaware/comments/5nts74/chris_coons_and_tom_carper_our_senators_voted_on/\n\n Suprised there were no answers here in six hours and 53 upvotes. I guess I was just wondering whether the anger was warranted.\n\n-My overall gathering from this question and answers I've gotten (mostly from that other thread) is that America should rightfully be pissed at republicans for not adding the reasonable amendments to the resolution so that we can import cheaper medicine (if you truly feel that it would have been safe, top comment here makes a good point about those states being states with opioid problems). And we should also be mad at those few democrats who could have pushed it over the edge. America sucks. \n\n-------------------------\n\n[\"Why Socialism?\" by Albert Einstein](http://monthlyreview.org/2009/05/01/why-socialism/)\n\n\n/r/socialism \n\n/r/LateStageCapitalism \n",
        "created_utc": 1484341668,
        "upvote_ratio": ""
    },
    {
        "title": "What is the most extreme measure you've seen a person take in pursuit of 'ethical living'?",
        "author": "ryan-a",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5np4cs/what_is_the_most_extreme_measure_youve_seen_a/",
        "text": "Optional follow-up question: How do you justify not living like them?",
        "created_utc": 1484289851,
        "upvote_ratio": ""
    },
    {
        "title": "Sax players, how do you achieve the tone in the video below? They are tenor saxes playing. I also play tenor.",
        "author": "komrade_koolkat",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5nnr4m/sax_players_how_do_you_achieve_the_tone_in_the/",
        "text": "[removed]",
        "created_utc": 1484273231,
        "upvote_ratio": ""
    },
    {
        "title": "At what point does something stop being current events and start being history?",
        "author": "SparkySywer",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5nmpgf/at_what_point_does_something_stop_being_current/",
        "text": "",
        "created_utc": 1484261872,
        "upvote_ratio": ""
    },
    {
        "title": "What bias does the scientific establishment have, and what are the implications of this bias?",
        "author": "TheCreatorLovesYou",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5nkbsp/what_bias_does_the_scientific_establishment_have/",
        "text": "",
        "created_utc": 1484238852,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think men ever regret their first time the same way women sometimes do?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5ni4t4/do_you_think_men_ever_regret_their_first_time_the/",
        "text": "[deleted]",
        "created_utc": 1484207293,
        "upvote_ratio": ""
    },
    {
        "title": "If you could do anything without consequence, what would you do?",
        "author": "memurphsta",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5naw8s/if_you_could_do_anything_without_consequence_what/",
        "text": "[removed]",
        "created_utc": 1484120382,
        "upvote_ratio": ""
    },
    {
        "title": "Where's Sasha Obama?",
        "author": "JEMPhish",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5n9myc/wheres_sasha_obama/",
        "text": "[removed]",
        "created_utc": 1484103636,
        "upvote_ratio": ""
    },
    {
        "title": "What's up with trump and the golden shower trending on twitter?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5n94tf/whats_up_with_trump_and_the_golden_shower/",
        "text": "[removed]",
        "created_utc": 1484097769,
        "upvote_ratio": ""
    },
    {
        "title": "Which qualities does one need to learn hypnotizing people?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5n92r7/which_qualities_does_one_need_to_learn/",
        "text": "[removed]",
        "created_utc": 1484097110,
        "upvote_ratio": ""
    },
    {
        "title": "What medical advancements will be made in the next 50 years?",
        "author": "p341250n",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5n4bms/what_medical_advancements_will_be_made_in_the/",
        "text": "I just read a post about how scientists found a way to stimulate cells in our teeth to help heal cavities. What other advancements will be made in the near future? Cure for cancer? Fountain of youth? Panacea?",
        "created_utc": 1484044081,
        "upvote_ratio": ""
    },
    {
        "title": "Why is race still a thing?",
        "author": "KNOWER_OF_STUFF",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5n40w1/why_is_race_still_a_thing/",
        "text": "There is little to know biological difference between races. People are not biologically predetermined to think or act a certain way. Why does this whole social stucture still need to exist?",
        "created_utc": 1484038866,
        "upvote_ratio": ""
    },
    {
        "title": "Who is the YouTuber \"Charisma on Demand\" and why do I see his videos being shared everywhere?",
        "author": "Culecks",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5n2rgv/who_is_the_youtuber_charisma_on_demand_and_why_do/",
        "text": "[removed]",
        "created_utc": 1484020756,
        "upvote_ratio": ""
    },
    {
        "title": "Is it okay for documentaries to push an agenda? If so, where exactly should one draw the line?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5n1zg7/is_it_okay_for_documentaries_to_push_an_agenda_if/",
        "text": "",
        "created_utc": 1484012122,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we keep paying $4/5 dollars on shitty coffee from Starbucks and petes? Half the time the baristas don't know what the hell they are doing, therefore you throw 4 bucks out the window.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5myhhi/why_do_we_keep_paying_45_dollars_on_shitty_coffee/",
        "text": "[removed]",
        "created_utc": 1483978129,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the most effective strategy in pursuing the issue of environmentalism internationally?",
        "author": "Kinost",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5mwp33/what_would_be_the_most_effective_strategy_in/",
        "text": "",
        "created_utc": 1483952697,
        "upvote_ratio": ""
    },
    {
        "title": "Let's just say as consumers we all said fuck it and quite buying name brand. Example ( apple, Sony, android, ford-chevy ) what would happen? Would they company's start to crash? Because for real, $1,000 for a iPhone. Let's quit buying the shit and watch it come crashing down. Or everybody leave FB.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5mvpso/lets_just_say_as_consumers_we_all_said_fuck_it/",
        "text": "[removed]",
        "created_utc": 1483937246,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly is the job of a Homeland Security agent in the US?",
        "author": "komrade_koolkat",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5muh53/what_exactly_is_the_job_of_a_homeland_security/",
        "text": "[removed]",
        "created_utc": 1483922849,
        "upvote_ratio": ""
    },
    {
        "title": "Should the Black Lives Matter movement be judged purely based on its most extreme followers?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5mnx76/should_the_black_lives_matter_movement_be_judged/",
        "text": "[removed]",
        "created_utc": 1483835449,
        "upvote_ratio": ""
    },
    {
        "title": "Are you willing to put your own political and personal beliefs in to question and put the objective truth over your ideological preferences?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5mmcqu/are_you_willing_to_put_your_own_political_and/",
        "text": "[removed]",
        "created_utc": 1483818520,
        "upvote_ratio": ""
    },
    {
        "title": "Realistically, what are the most likely changes we'll see under the Trump administration?",
        "author": "taksark",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5mm3su/realistically_what_are_the_most_likely_changes/",
        "text": "After hearing about the potential end of net neutrality, it made me wonder what will likely change the most over the next 4-8 years.\n\nIf I were to wake up on January 1,2021 and look at the government and legal system of the United States, what would I find to be most different? If we infer from objective evidence.",
        "created_utc": 1483815888,
        "upvote_ratio": ""
    },
    {
        "title": "When was the last time a non-violent protest affected societal change?",
        "author": "ting_bu_dong",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5mly8k/when_was_the_last_time_a_nonviolent_protest/",
        "text": "The history books like to talk about Gandhi and the civil rights movement as examples of the power of non-violent protest, but those were in the 1930s and 1960s, respectively.\n\nHave there been any major examples of non-violent protests affecting broad social change since then?\n\nIt seems that non-violent movements such as (random ones that come to mind) Occupy Wall Street, Occupy Hong Kong, or the recent Black Lives Matter movement all seem to be treated as mere inconveniences, and not positive society-changing movements.\n\nIs non-violent action really a powerful tool to push for social change anymore? ",
        "created_utc": 1483814239,
        "upvote_ratio": ""
    },
    {
        "title": "What are some trustworthy and analytic news sources?",
        "author": "MapsAreCool",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/5mldqe/what_are_some_trustworthy_and_analytic_news/",
        "text": "[removed]",
        "created_utc": 1483808053,
        "upvote_ratio": ""
    }
]