[
    {
        "title": "Looking for help with criticizing my belief.",
        "author": "AregBex",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11t1kgj/looking_for_help_with_criticizing_my_belief/",
        "text": "[removed]",
        "created_utc": 1678989970,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s up with atheism exposed What is they’re whole deal.",
        "author": "Independent_One_648",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11sjm5s/whats_up_with_atheism_exposed_what_is_theyre/",
        "text": "What is they’re whole deal, they called Aron ra a witch or some shit, it’s a very weird sub.   Just for clarification it’s a sub Reddit. Have any of you had any experience with it, are they mostly Muslims.",
        "created_utc": 1678939442,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s up with atheism exposed What is they’re whole deal.",
        "author": "Independent_One_648",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11sjle8/whats_up_with_atheism_exposed_what_is_theyre/",
        "text": "[removed]",
        "created_utc": 1678939372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Functionally what’s the difference between lessers gods in some sects of Hinduism or the Roman pantheon, and angels/demons/saints in Christianity?",
        "author": "INTHEMIDSTOFLIONS",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11s9ko9/functionally_whats_the_difference_between_lessers/",
        "text": "I’m aware Judaism has its roots in polytheism. I’m aware that in modern Christianity, the trilogy technology isn’t 3 separate gods in their beliefs. \n\nBut what about angels, demons, Satan/sheitan, saints? \n\nWhat’s the difference in Islam and Christianity of all these others figures and just lesser gods of certain Hindu sects, or in Greek and Roman pantheons?\n\nJinn/djinn = invisible ethereal spirit, got that. \n\nYhwh = creator god Brahman (Hindu) \n\nTrinity = some hindu sects believe the lesser gods are different personalities of the same Brahman god, like the Christian trilogy \n\nAre saints, Satan, demons, and angels just the equivalent of “lesser gods” in Hindu and Roman pantheons? \n\nI’m asking in this sub because I think this is the best place to get an honest and critical answer, opposed to one that would be defending their faith.",
        "created_utc": 1678915020,
        "upvote_ratio": 1.0
    },
    {
        "title": "We are all born atheists",
        "author": "eddesa",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11qxlom/we_are_all_born_atheists/",
        "text": "We are all born atheists.  If a true deity existed, there would be no need to be indoctrinated from birth into believing in that deity.  No one ever had to indoctrinate me into believing and loving my mother and father.",
        "created_utc": 1678771543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell your story: How did you become an atheist?",
        "author": "Str8Business_",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11qaxbt/tell_your_story_how_did_you_become_an_atheist/",
        "text": "I was raised in a Christian household with my parents and two older siblings. All of us believed in the conception of God described in the Bible. Religion was mandatory. During my childhood, my mother and father were evangelist. They prayed, they spoke in tongues, caught the “Holy Ghost”, went to church revivals and much more. My father used to make staves like the prophets in the Bible. He preached and prophesied often. He even recorded cassette tapes to deliver his messages. My parents made me go to a religious private school when I was a boy. After my parents divorced, I continued to live with my mother and two older sisters. Religion was still a prominent influence in our lives. \n\n\nMy mother and siblings attended church and had a strong faith in the Bible. I did not. The Bible never made sense to me. I never felt a connection with the scriptures. I have always disagreed with Christianity. I never took the Bible seriously, however, my family did take it very seriously. \n\n\nAs I became an adult, I developed a deep resentment towards revealed religion. I wanted to rebel against it. I investigated various topics on the supernatural. I abandoned the beliefs that I was taught as a child. I was never convinced that people believed in Jesus or God as much as they claimed to. I thought they were actors pretending to be redeemed. I began to make observations towards peoples behavior. After church was over, these so called holy people were judgmental, hypocritical, and condescending. I was completely turned off by this. No matter how many articles of faith I read, I was never convinced to believe. \n\n\nEventually, I became a self-proclaimed atheist. I decided not to subscribe to blind faith. I had a desire to discover my own way of life. For many years, I kept my views and opinions on religion away from my family. I let go of the fear of God sending me to a lake of fire for eternity. \n\n\nI have not seen a demonstration that proves God exist. I do not believe there is a supernatural power that intervenes in our lives. I do not believe the Bible is God’s authority. I do not believe Jesus Christ is the son of God. The Bible is fictitious. In my opinion, there is not sufficient evidence to prove the stories written in the Bible are true. I am an agnostic. I do not know whether or not a supernatural power exist. I do not believe claims of divine revelation in revealed religion. Organized religion is a hoax. People say that God exist because a book said so. To me, this is not sufficient. The Bible is disassociated with reality. If God exist, then he is either not all-loving, or not all-powerful. Neither of these have been demonstrated. \n\n\nRegardless of my opinions, I believe that every individual has a right to decide what is true to them. I respect the insight and perspective of other people. I have learned to agree to disagree with those who do not share my views.",
        "created_utc": 1678716994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is atheism logical?",
        "author": "Asleep_F0rever",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11q6fcs/is_atheism_logical/",
        "text": "Logic and evidence are among the central concerns of atheism. No logic or evidence stands in a particularly interesting relationship to theism. Inasmuch as lack of evidence undermines or weakens the belief in a \"god,\" why does it not undermine or weaken atheism? With the incessant search for evidence, we would have to be solipsists, or worse, skeptics who disbelieve in the existence of everything\n\nWe could never have sufficient evidence for the existence of ourselves, other people, or the world around us. The beliefs we hold on to, such as the reliability of our senses or the uniformity of the world around us, are not evidentially grounded. It is not possible to establish evidentially that our senses are not misleading or tricking us, as there would be no other way apart from our sensory experience to prove this. To rely on our senses to prove this would beg the question \n\nScience and atheism function within a paradigm of assumptions. They assume the reliability of perception or sensory experience. Different theories result in different perceptual data. And there are no neutral perceptual data against which to check the reliability of a theory; therefore, science and atheism would be as biased and dogmatic as theism \n\nIf you disagree, could you please explain to me the difference between belief in the existence of a \"god\" and belief in the existence of ourselves, other people and the world around us? How can we prove beyond a shadow of a doubt that we exist, other people exist, the Earth is round, etc? That we aren't, say, in a matrix or simulation? That everything we see or feel is accurate?",
        "created_utc": 1678704698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any atheists here who like Tarot?",
        "author": "TheLoveDolls",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11px4r7/any_atheists_here_who_like_tarot/",
        "text": "I am looking for people with similar interests, mainly in tarot reading.\n\nI recently started getting into it and was wondering if anyone has experience? I tried reading for myself for the past few months and I like it, but sometimes it is hard to memorize the cards.\n\nFeel free to message me if I don't reply here but I will check every now and then.",
        "created_utc": 1678673387,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Way of Christ versus the way of anti-christ, part 1 🌷",
        "author": "JessicaSunlight",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11p6oaf/the_way_of_christ_versus_the_way_of_antichrist/",
        "text": "[removed]",
        "created_utc": 1678599977,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Way of Christ versus the way of anti-christ, part 1 🌷",
        "author": "JessicaSunlight",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11p6nxg/the_way_of_christ_versus_the_way_of_antichrist/",
        "text": "[removed]",
        "created_utc": 1678599946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would anyone who cares about true atheism please prove or disprove this with explanations? I have no bias on the subject. PDF: https://issuu.com/joedoh/docs/horstemeyer_proofs_and_evidences_for_gods_existenc",
        "author": "aqux30",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11oufrj/would_anyone_who_cares_about_true_atheism_please/",
        "text": "[removed]",
        "created_utc": 1678567110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would anyone who cares about true atheism please prove or disprove this with explanations? I have no bias on the subject.",
        "author": "aqux30",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11oud28/would_anyone_who_cares_about_true_atheism_please/",
        "text": "[removed]",
        "created_utc": 1678566921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is Yahweh - How a Warrior-Storm God became the God of the Israelites and World Monotheism",
        "author": "Friendlynortherner",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11ookhi/who_is_yahweh_how_a_warriorstorm_god_became_the/",
        "text": "[removed]",
        "created_utc": 1678552711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proving the negative claim?!",
        "author": "yesnoook",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11ojfh9/proving_the_negative_claim/",
        "text": "So, there are some people on social media that are constantly having debates on their lives about God specifically \"Prove to me god does not exist and win 100$\". In my opinion they might as well put 100000000$  there just because it will never happen just like if I went to my profile and said \"Prove to me unicorns do not exist and win 1000000$.\" Some of them are aware of what they are doing and are using it consciously to gain followers and boost their profiles but most of them have no idea how stupid they sound (especially theists) in their arrogancy believing that they are winning by using a fallacy and one unfalsifiable claim in order to sparkle a debate every single day. However, there was this one guy that said in his live that negative claim can be proven but harder than the positive one and did not explain why so I am asking all of you if you know what he is talking about. In my opinion if it is an ordirary negative claim like I dont own a house, it can be proven very easily, but when it comes to extraordinary negative claims like I believe in a god, I do not see the point cause it is not possible to prove or disprove...that's why I think that agnostic atheist is the best way to call myself.",
        "created_utc": 1678539034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Morality on atheism",
        "author": "freedom_kirilov",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11nsklz/morality_on_atheism/",
        "text": "[removed]",
        "created_utc": 1678463155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is The Satanic Temple considered a religion but Secular Humanism is not, despite that their goals and values seem to be so similar?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11npyfk/why_is_the_satanic_temple_considered_a_religion/",
        "text": "Sorry if this doesn't belong here, but I couldn't think of anywhere else to put it. \n\nI'm referring to the nontheistic organization called The Satanic Temple. NOT the Church of Satan, founded by Anton LaVey. I don't think the CoS worships an actual Satan, but I could be wrong about that. Anyway, I just don't understand why the Satanic Temple gets special treatment in being called a religion despite the fact that they do not worship any deities and that their values align with Secular Humanism, which is not a religion.",
        "created_utc": 1678456730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the Bible condemn interracial marriage?",
        "author": "Isosrule44",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11mkfmi/does_the_bible_condemn_interracial_marriage/",
        "text": "Spoiler : as a secular person there is no good reason to be racist or homophobic and say that the love of interracial or gay couples is invalid. It’s gross.\n\nBut the Bible is a pretty gross book. Filled with mass genocide, the condoning of rape, infanticide, the condemning of those who disagree to an eternity of suffering. When it’s Old Testament people, rape and genocide are ok, (how loving).\n\nThis leads me to a question, is there a scripturally solid argument you could make that the Bible condemns interracial relationships? \n\nIf you can make that case, is it also logical to say that from a biblical perspective, the Bible condemns interracial relationships as much as gay ones? Or does it condemn one more than it condemns the other, in your view.\n\nThe reason I ask, is evangelical used to be really really against interracial couples, and desegregation, and I find it difficult to believe that it was based off them just interpreting the Bible completely wrong. Where there’s smoke, there’s a fire.\n\nAs an atheist, what do you think?",
        "created_utc": 1678341676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please suggest me a good answer for this",
        "author": "Ok_Summer_2427",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11kcw5n/please_suggest_me_a_good_answer_for_this/",
        "text": "I'm a former muslim, I have a muslim friend who was trying to convert me back to Islam. He was asking me about why did I leave Islam. I told him all the moral objections I have against Islam. That for example as a woman, I wouldn't want to be referred as a field just for cultivation, I don't like how our husbands are allowed to beat us, Islam allowed men to have sex with their females war captives. ( Which is clearly rape )\n\nThese are some examples I told him alot of things like this so he said how do you know these things are wrong. Where does your morality come from. \n\nThe only answer i had was \" i just know \"\nAnd he kept on asking \" how do you know \"\n\nPlease suggest me any other good answer that I can give to him and also please tell me if I'm wrong to leave a religion because of its morals.",
        "created_utc": 1678134461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a way to delete a question if you later thought it might be taken the wrong way",
        "author": "Livid-Razzmatazz-991",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11iy4hd/is_there_a_way_to_delete_a_question_if_you_later/",
        "text": "[removed]",
        "created_utc": 1678025658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please just give me a warning and not ban me right away if this question wasn't right for this site.I won't post anything like it again if it is not appropriate for the site.I have no one else I can talk to or relate to. they don't know what it's like to be prejudged",
        "author": "Livid-Razzmatazz-991",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11ixxry/please_just_give_me_a_warning_and_not_ban_me/",
        "text": "I was on r/atheism and I asked the question why people don't consider us a religious group when we believe in the same thing which is God and stuff in bible not being real because there's no proof and I was banned and I couldn't defend myself.Would this question get me banned from here to.\nI don't want to be banned again. I don't have anyone to talk to and relate to and see if they feel the same way without these sites",
        "created_utc": 1678025116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why I hate god.",
        "author": "Classy_Outcast",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11irc49/why_i_hate_god/",
        "text": "I've been an atheist since childhood. The moment I realized god made man, gave man a penis and mouth, made women (with vaginas + mouths) but made women refuse to have sex with good men and then the final straw was making it impossible for man to use his mouth to pleasure himself. It's the cruelest form of torture and I hate god so fucking mych for it. FUCK GOD!!!! Rant over.",
        "created_utc": 1678003130,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a question about another atheist subreddit.",
        "author": "haaaaaaaaaaaaaaargh",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11iam3i/i_have_a_question_about_another_atheist_subreddit/",
        "text": "Hello, new here, first post, and maybe i should not make a post about this, but i need to understand what is happening to me...  \nFor a few days i have subscribed to r/Atheism and mostly just read... This morning i see a discussion about Pro-Lifers who wants to make law in the USA (i'm french) that would ban abortion and punish by death penalty those who would abort anyway... Typical stupid and awful pro-lifers...  \nAnyway, in the comments, i see someone who says something like \"they don't care about saving lives, they just want to control women\"... I am not convinced by this logic. I know many men want to control women, i know religion does too, but i don't think on this particular matter, controlling women is really the reason behind the scene... Maybe i'm wrong... i was expecting other redditors who may disagree with me to just tell me why they would think i'm wrong...\n\nInstead of that, i was just massively downvoted... it's not a big deal since downvotes or upvotes are not that important to me... but it made me realise that what i said may have been misunderstood, that maybe they thought i was a pro-life or something like that... So i just posted another comment asking if what i said in the previous comment was misunderstood... I did not insult anyone, i did not troll, i just asked what they hated so much about my comment to see if there was\n\nAs a result, i was permanently banned. And the mod told me i was a bigot. Obviously they thought i was pro-life which is very far from what i am....\n\nAnyway, the goal of that post is not to bash on this subreddit, but i just do not undertand what happened...  \nI tried to communicate with the mod that banned me, i even sent an appeal, and now i was just muted... That's totally absurd...\n\nDid it ever happen to one of you?",
        "created_utc": 1677957856,
        "upvote_ratio": 1.0
    },
    {
        "title": "the selfishness of the ape",
        "author": "DramaAppropriate2093",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11h5b10/the_selfishness_of_the_ape/",
        "text": "An alien species that is chopping up human babies and wiping human families from existence is no different than a human.\nhumans are doing the same thing for other species, you would sit on a table with your children and enjoy another animal soul without blinking an eye about it.\nWhat we are doing right now to other animals will be looked upon in history as no different than how we look at slavery today.",
        "created_utc": 1677861675,
        "upvote_ratio": 1.0
    },
    {
        "title": "collective ape insanity",
        "author": "DramaAppropriate2093",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11h50r5/collective_ape_insanity/",
        "text": "What kind of insignificant being would create such a beautiful and vast universe for the human selfishness, this existence that can't be imagined and beyond logic is not under the feet of the disgusting human, the ape man with the eye colour and hairstyles preference.\n\nWhat a narcissism a collaboration of insanity, you can't imagine. Just look at this existence that the light is unable to circumnavigate and dare to believe that it was made for the human, his selfish love and prejudices.\n\nthis revolting entitlement of an ape is beyond my imagination.",
        "created_utc": 1677861025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you guys ever worry you may be wrong.",
        "author": "Few_Post_3467",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11gfnbc/do_you_guys_ever_worry_you_may_be_wrong/",
        "text": "",
        "created_utc": 1677794482,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's with the mods on r/atheism?",
        "author": "iamlikeanonion",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11fyiti/whats_with_the_mods_on_ratheism/",
        "text": "Four months ago, I posted a question on r/atheism asking for examples of bad people who lived fulfilling lives.\n\nIt did pretty well and led to a pretty interesting discussion. The point of the post was to build a collection of examples to cite when theists allege that there is a deity that punishes people for being evil even in this world (and not just in a fictional afterlife). \n\nHowever, I got banned from the subreddit without any reason being offered. I was given the option to appeal after reading three lengthy rules-related posts and one about \"how to construct an appeal.\" The last one basically required you to do a Soviet-style self-criticism session in which you prostrate yourself, convict yourself and beg for forgiveness.\n\nAnyway, I read through these documents and did not see how I violated any rule. I said so, and added that I do not offer an apology because I did not do anything wrong. The mods then accused me of not reading the rules. That wasn't true, so I said so and asked for confirmation if this was really the post I was banned for. They then said that no reasonable person could think my post was acceptable if they read the rules and called me a liar. I protested and told them that I was a lawyer, and that it is a generally accepted principle of natural justice that one should be told what rule they violated and why action was taken against them, and it shouldn't be for the accused to make the case of the prosecution to seek a relief. They called me a liar again and muted me.\n\nIs this a common experience? I deconverted about two years ago and am quite disappointed to see such egotistic characters ruling the roost in my new community. I am just as much of an atheist as any other, and I had hoped fellow atheists would hold to higher ethical standards. \n\nMy apologies if I am not allowed to say any of this here. I did look at the rules. Please feel free to remove my post but don't ban me because I'd like to be in spaces where there are like minded people. Thanks!",
        "created_utc": 1677749468,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate philosophical arguments sometimes because they try to define things into existence, rather than demonstrate.",
        "author": "Ramza_Claus",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11fnb2a/i_hate_philosophical_arguments_sometimes_because/",
        "text": "I get it. I understand how philosophy does this. If you can demonstrate that X and Y are the only two possibilities, and you disprove X, then Y must be true, regardless of any lack of evidence for Y. So I get it.\n\nI just don't like this type of reasoning sometimes.\n\nSo, I'm discussing abiogenesis with a guy and he says that life from non-life is impossible because life is an emergent process and life can't have a property that was not present in the non-life blah blah blah philosophy about composition and parts of a whole and so on.\n\nLike, why do we gotta bring philosophy into this? The question is:\n\nCan inorganic material, given the right conditions, begin forming organic material, and if so, can that material begin doing the things we call \"life\"? While this hasn't been proven quite yet (although I think we are getting close), I don't see any reason to bring up Renee Descartes here. This isn't a philosophical composition question. It's a science question.\n\nLike the stupid Ontological arguments that basically boil down to \"of course god exists! If he didn't, he wouldn't be god!\"",
        "created_utc": 1677716919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is hell made up by catholics?",
        "author": "Ren_Amamiyaa",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11f0de6/is_hell_made_up_by_catholics/",
        "text": "[removed]",
        "created_utc": 1677666569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Welp it’s officially over agin with my best friend because jeebus",
        "author": "Cannonel10",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11ens8t/welp_its_officially_over_agin_with_my_best_friend/",
        "text": "Welp, it’s officially over with my best friend again.\n\nI’m the girl who’s best friend with borderline personality disorder had the xmas mass conversion. Eventually she said she couldn’t believe without evidence, but then went back. \n\nAnyway I shared a meme on Instagram that must’ve really got on her nerves because she messaged me saying her faith is extremely important and she doesn’t wanna be friends with me if I insult her faith. After talking for a bit she says “well I guess this is goodbye”. I wanna blame borderline personality disorder combined with her dads narcissistic and emotional abuse but idk if I can anymore.\n\nI’m at a place with my mental health that I’m not super upset like last time. And even my most religious friends are on my side.",
        "created_utc": 1677627518,
        "upvote_ratio": 0.9
    },
    {
        "title": "Welp, it’s officially over with my best friend again.",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677627036,
        "upvote_ratio": 1.0
    },
    {
        "title": "what ist your take in abiogenesis?",
        "author": "_Melissa_99_",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11e2qwi/what_ist_your_take_in_abiogenesis/",
        "text": "",
        "created_utc": 1677580012,
        "upvote_ratio": 1.0
    },
    {
        "title": "As the years go on - the more I think about what I’ve learned in life and whether God could realistically exist, the more plausible it seems to me",
        "author": "ElliElephant",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11dmn7u/as_the_years_go_on_the_more_i_think_about_what/",
        "text": "I’ve thought a lot about it honestly. And I might be at the point where it feels more likely than not to me\n\nI know this is a downvote magnet so I’ll keep it short and just say that if anyone is curious about my thoughts I’m happy to share",
        "created_utc": 1677531431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nihilism in Christianity",
        "author": "tinylord202",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11d5c52/nihilism_in_christianity/",
        "text": "After the death of my brother a few years back, I turned to the Bible for guidance. I started reading Mark. I came upon Mark 13:2,  “Do you see all these great buildings?” replied Jesus. “Not one stone here will be left on another; every one will be thrown down.\n\nI found comfort in this in a very nihilistic way. I reasoned, everyone dies eventually it doesn’t matter that it seems too soon.  \nAfter stepping back and observing what is taught in the New Testament it seems that this reasoning is the correct take away. “God is coming back in my lifetime. “”This life is so I can learn to know god.”\nInstead of the apathy from meaninglessness, it is just apathy for anything that is in this life.",
        "created_utc": 1677481263,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Depth of an Ancient Indian School of Thought: Achintya BhedaAbheda.",
        "author": "WittyVt31",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11chpps/the_depth_of_an_ancient_indian_school_of_thought/",
        "text": " Are we heirs of gods? Are we different from god?  Are we god? Is god an Alien? Does god even exist? Don’t worry, you are not alone; such questions have been asked in ancient civilizations since 2000 BCE or before. The texts from the Vedic period has been interpreted in numerous way that established branches with each interpretation. Such branches are called Shakhas, simply a school of thought. Prominent among them, and also the topic of discussion today are Advaita, Dvaita, and the magnificent thin line among them Bhed-Abheda  All are theories on the nature of the ultimate reality called Brahman and its relationship, similarities, and differences with Jeev or individual souls.  \n\nVideo Link: [https://youtu.be/oAvhxEBAZu4](https://youtu.be/oAvhxEBAZu4)",
        "created_utc": 1677419687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is complexity an indicator of intelligent design?",
        "author": "Ramza_Claus",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11cg6l7/is_complexity_an_indicator_of_intelligent_design/",
        "text": "So, y'all know the watchmaker thing. They claim that we recognize a watch is designed because it's complex. And the human eye is even more complex, so it must have a designer too.\n\nI always heard a good rebuttal was \"simplicity is the actual indicator of design\" because designed things are never needlessly complex, right? Like, a watch. It has exactly the right number of gears to do its job. No more, no less. It's as simple as it can be, which is a good way know it was designed. Compared to a human who is needlessly complex and has lots of features that don't seem to do anything, which shows that a human wasn't designed by an intelligent agent. Cuz what kind of intelligent agent would give nipples to men?\n\nBut it seems to me that, at most, all I can say for sure is that if humans were designed, it was poor design. That doesn't prove (on its own) that humans aren't designed tho. Imagine if you found a watch with a bunch of extraneous gears and screws that don't do anything. You wouldn't assume it was not designed just cuz it's needlessly complex. What if you found a watch that was so complex it didn't even function as a watch anymore? Would that indicate it wasn't designed by an intelligent agent?\n\nI feel like the simplicity/complexity thing isn't that reliable of an indicator one way or another since I can find simple or complex things that are designed or naturally occurring.",
        "created_utc": 1677415444,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Selective History of Anti-Atheist Propagandists.",
        "author": "PoorMetonym",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11aqjf9/the_selective_history_of_antiatheist_propagandists/",
        "text": "Well, duh, you might say. But I think this represents a wider, more serious problem within anti-intellectual spaces about historical revisionism. \"History is written by the winners\" is a known aphorism, but I don't think enough people consider its implications in full, or the related idea that history is framed by the ideology and biases of the person telling you it.\n\nIt's hard to be neutral, and I won't pretend I'll always be when reporting history, but there's a line between recognizing that, and doing it shamelessly. Worse still is when authority figures do it - growing up in the United Kingdom, the way we were taught history, up until you're doing it at A level, say, which is entirely optional, is extremely Anglocentric. For example, when learning about the Napoleonic Wars, generally all we hear about are the Battle of Trafalgar (1805) and the Battle of Waterloo (1815) because of Britain's involvement and victory, giving the impression that Napoleon had a serious losing streak, despite his near invincibility up until his invasion of Russia. As a result, Britons grow up with a completely distorted view of history, not helped by our current nationalist government attempting to imply that Britain can do so well on its own, and has always done, never mind how much our quality of living is plummeting.\n\nNationalist pseudohistory can have even more egregious results in countries like Japan, Turkey, and Russia. But one variant that rarely gets challenged, probably because of the nearly global stigma of irreligion (and the emphasis of 'cultural Christianity' in heavily irreligious countries) is the historical revisionism that paints non-belief as black as possible. The term 'atheist' itself has historically been used pejoratively, and how often have you heard apologists insist 'Atheist regimes have killed the most people!' It's especially rich when they insist upon looking at the nuances and complexities of conflicts intertwined with religion (which I'd agree with - conflicts are rarely down to just one cause alone), but give the sweeping declaration that any conflict between Marxist-Leninists and anyone else (though they make an exception for World War II, it seems), is 'evil atheists persecuting those poor God-fearing heroes!'\n\nThere are many responses one could put to this - I mean, we could be just as reductionist and play the numbers game too, and point out that the deadliest war of the 19th century (The Taiping Rebellion of 1850-1864) was caused by Christianity and killed between 20-30 million people. Ah, but, the apologists way, that number accounts for all casualties, including those of the Taiping Heavenly Kingdom, and Hong Xiuquan didn't act like any modern Christian, he thought he was Jesus' brother! Sure - there are nuances. So, if we agree with that, why not take the same critical look at the casualties of these so-called 'atheist regimes'?\n\nLet's start with Stalin -  he was an atheist, and the Soviet Union endorsed state atheism. Calculating the exact number of deaths he was responsible for is difficult, due to lack of consensus on exactly what deaths he's responsible for. Before the access of the Soviet archives in the 1990s, estimates were put at around 20 million, but in [2011, historian Timothy D. Snyder suggested that it was closer to 9 million, with 6 million as deliberate killings, based on data accessed since the 90s.](https://www.nybooks.com/online/2011/01/27/hitler-vs-stalin-who-was-worse/) Now, the link I provided wasn't to the most cast-iron source, it was all I could find in a pinch, but if, as suggested, Stalin's death toll was lower than that of the Taiping Rebellion, should that matter? When it comes to polemics against religion or atheism, shouldn't motivation be more important? Well, the majority of these deaths can be put down to famine, which was caused by the forced collectivization of farms, an ideological action enforced against evidential problems, and one very difficult to argue that atheism was an indispensable part of. Or, in the case of the Holodomor, anti-Ukranian sentiment can be said to play a huge role, something that current leader of Russia has proved is not inherent to atheists either.\n\nAnd what about Stalin's Great Purge, where he disposed of so many political enemies? A good chunk of them were, naturally, also atheists, including Leon Trotsky. Yes, around the 1930s, Stalin also pushed for more persecution of religious workers and organizations as well, but they were just one target of Stalin's paranoia and didn't make up the bulk of his killings. If this needs to be more obvious, consider when Marxist-Leninist states opposed each other, such as the Khmer Rouge's war against communist Vietnam, or indeed when Marxist-Leninist atheist leaders actively relaxed their grip on power to allow for religious freedom (such as Mikhail Gorbachev and Alexander Dubček). There's a lot more nuance here, and the crucial point is that so much of this nuance goes directly against many propagandists' main claim.\n\nIn Peter Hitchens' book *The Rage Against God*, he attempts to make the case that the deaths contributed to Marxist-Leninist states was inevitably linked with their rejection of religion: '(Atheists)   have a fundamental inability to concede that to be effectively absolute, a moral code needs to be beyond human power to alter.' \\[pg. 103\\]. And that 'those who reject God's absolute authority,  preferring their own, are far more ready to persecute than Christians have been...' \\[pg. 113\\]. But this is a complete (and I would argue, deliberate) misreading of the motivation of such killings. It's not because of a lack of a moral code, it's because of one far too rigid, dogmatic, and myopic, which is why it's apt to compare Stalinism with theocracy, more than with secularism.\n\nThis revisionism continues when the French Revolution is discussed - everyone likes to talk about the horrors of the Reign of Terror, including Edward Burke, who liked to cite it as an example of the evils of any revolution, conveniently forgetting that there was a whole host of reasons for the unpopularity of the Ancien Régime, among many people of diverse opinions, and that Robespierre was neither an atheist nor a secularist, advocating the implementation of his deistic cult as the state religion. When discussing the French Revolution, too many people also miss out on how revolutionary France was the first European state to give Jews equal rights as citizens in 1794 (perhaps because modern advocates of so-called Judeo-Christian values like to pretend that Judaism and Christianity always lived in harmony), or the disgusting actions of the theocratic Bourbon Restoration under Charles X (not the first Bourbon monarch), a believer in divine right, who advocated press censorship, the death penalty for sacrilege, reduced the franchise, and a war against Algeria that many modern commentators have considered genocide. History is imperfect, humans are imperfect, and their regimes are imperfect. The lack of fundamental difference between overtly religious, non-religious, and anti-religious regimes is in the favour of atheism, I feel, as it seems to suggest no divine hand is over anything.\n\nBeing able to dissect this propaganda with knowledge is vital, given the persecution of the irreligious continues today - when different religions do get along, it's usually to target the godless (and anything they see as part of that, including sexual freedom, freedom of conscience, and rights for LGBTQ people) - both the Kremlin and Chechnya will view the war in Ukraine as a holy war against the godless West, just using different religions to justify it.\n\nTo defend the godless, we need to embrace inquiry, nuance, knowledge, and the access to it, as well as acknowledge we always have more to learn than we might realize. It's the way we combat the ignorance and prejudice inherent to historical revisionism.",
        "created_utc": 1677242659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Praying Atheists",
        "author": "gringovato",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/119voqw/praying_atheists/",
        "text": "I highly recommend prayer whether its alone of in a group. That was one of the only things I gained from being religious growing up. You don't have to pray to Jesus or any other deity. Pray to yourself. Think about your prayer, make it meaningful. You will feel better. And if you're really feeling like it, do it in groups... Be well.",
        "created_utc": 1677152531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exploring the depths of Christianity, finding terrifying responses.",
        "author": "kyngston",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/119p3o7/exploring_the_depths_of_christianity_finding/",
        "text": "I've had many debates with theists around the numerous logical fallacies and mental gymnastics that are required to maintain faith in religion.  Most of those debates are harmless and I come to the conclusion that my interlocutor is a few marbles short on their critical thinking skills.\n\nMy recent debates have been asking people to respond to Exodus 12:29, and I wasn't prepared for the responses.\n\n&gt; Exodus 12:**29** At midnight the Lord struck down all the firstborn in Egypt, from the firstborn of Pharaoh, who sat on the throne, to the firstborn of the prisoner, who was in the dungeon, and the firstborn of all the livestock as well. \n\nI generally ask, if god was justified and/or acted morally when he ordered his angel to kill infants.\n\nAs you'd expect, I get the typical apologist responses:\n\n* The old testament is wrong (no true scotsman fallacy)\n* God's actions are beyond morality (special pleading)\n* etc\n\nBut quite a few times, I get responses like this:\n\n&gt;God wouldn’t kill people for no reason. Infants are under judgment just like everyone else. They’re not these innocent little angels that many people believe. They sin as well. We’re all born sinners. \n\nand this is terrifying.\n\nWhen I first learned of Jim Jones and the People's Temple, I really struggled with understanding how an entire congregation would follow a command to poison their own children.   When I learned about the Milgram experiment, it made some sense how authority could overcome one's innate sense of morality.  I could understand how boiling a frog in a pot could lead otherwise normal people to enact the atrocities like the holocaust.\n\nBut with all we've learned, humanity hasn't progressed.  We still have a substantial population of people, who could morally justify infanticide, if it was commanded by a trusted authority.   All in the name of avoiding cognitive dissonance. \n\nAnd those people have the gall to claim that atheists lack morals...sheesh..",
        "created_utc": 1677128626,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you guys think of this post",
        "author": "Independent_One_648",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/1198ajf/what_do_you_guys_think_of_this_post/",
        "text": "[removed]",
        "created_utc": 1677093069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found this on r/true Christian it seems pretty convincing.",
        "author": "Independent_One_648",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11989l7/found_this_on_rtrue_christian_it_seems_pretty/",
        "text": "[removed]",
        "created_utc": 1677093011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found this on r/true Christian",
        "author": "Independent_One_648",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11988qm/found_this_on_rtrue_christian/",
        "text": "[removed]",
        "created_utc": 1677092958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Polish Exorcisms (2023) - documentary",
        "author": "pkostowski",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/115pt5a/polish_exorcisms_2023_documentary/",
        "text": "[removed]",
        "created_utc": 1676752257,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the most powerful pro belief argument made by christians?",
        "author": "yesnoook",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/115erif/what_was_the_most_powerful_pro_belief_argument/",
        "text": "\n\nFellow atheists/nonbelievers/ex christians/jews/muslims, what was that one \"powerful\" argument made by other believers while you were still a believer, but a struggling one, that then made you think that they had a \"Gotcha!\" moment against you but now you see that it was also a complete bullshit that you can simply and easily debunk in a minute or two.\n\nAnd also what was the main \"Aha!\" moment when it all fell apart and when you admitted to yourself that you are a nonbeliever (or was it more of a not so conscious process)?\n\nFor me it was the sentence that sounded so beautiful then but you can easily apply it to literally anything, any god, any fairytale any tooth fairy...\"Just because you cannot see something, it doesn't mean that it is not there\" lol and also the classic \"How can you even be a god person without the bible?\" The irony and stupidity of that question and the assumption that I am morally inferior to childkilling, prorapist, genocidal god now literally hurts my braincells...I'm interested in hearing your thoughts and experiences... thx in advance ❤",
        "created_utc": 1676725108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girl who grew up in a white-supremacist community and moved away and renounced it talks about the role of the church in white supremacy in the American Deep South &amp; likens it to a \"Christian mafia\".",
        "author": "Nches",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/114qi02/girl_who_grew_up_in_a_whitesupremacist_community/",
        "text": "She illustrates pretty well how racism and Christianity can go hand in hand and how one perpetuates the other.\n\n&amp;#x200B;\n\n[https://www.youtube.com/watch?app=desktop&amp;v=7DxRjpKxWdM&amp;t=9s](https://www.youtube.com/watch?app=desktop&amp;v=7DxRjpKxWdM&amp;t=9s)",
        "created_utc": 1676650594,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Identify Human Incarnation?:-",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/114eman/how_to_identify_human_incarnation/",
        "text": "**How to Identify Human Incarnation?:-**\n\n&amp;#x200B;\n\nThe main purpose of God in human form is to give right direction in worldly life (Pravrutti) and spiritual life (Nivrutti) for the humanity, which is very very important. All the efforts are wasted if the direction is wrong and the post of Director is very important in any institution since he gives right direction to all for its success. The right direction is always given by the true spiritual knowledge enlightened with perfect analysis in all directions. The identification must be related to serve your important need. Hence, the Veda says that the only identification is the excellent spiritual knowledge (Prajnaanam), which is true (Satyam) and elaborate due to perfect analysis (Anantam). The Gita also says that God will enter directly in preaching spiritual knowledge (Jnaaniitvaatmaiva), which is very delicate and can be easily twisted for misinterpretation.\n\n&amp;#x200B;\n\nYou need not worry about other defects found in Him since such defects in human form of God have their own program like repelling undeserving devotees, becoming close to defective people for their uplift, testing the faith of true devotees etc. Even if the preacher is a human being only, you need not worry about his defects since he will be punished by nature or God for his defects. You have approached a doctor for the cure of disease in your lungs. The doctor advised you to stop smoking immediately. \n\n&amp;#x200B;\n\nThe doctor is also observed by you while smoking. You shall not reject the doctor and his advice saying that how a doctor, himself smoking, advice you to stop smoking! The doctor will be punished by the laws of nature for his smoking and he shall be worried more about it being a doctor! Why shall you spoil your health by leaving that doctor, who is an excellent specialist for lungs? Perhaps, you are telling like this to continue your smoking!\n\n&amp;#x200B;\n\nThe Veda also speaks about two other identifications by saying that i) God is embodiment of love (Raso vai sah) in order to encourage the devotion of devotees and ii) God can do any miracle (Satyakaamah) to give proof to atheist if He feels that he can be reformed by a miracle. A demon does miracles to project himself with ego and such miracle is also from the grace of God only expressed for his rigid devotion.\n\n&amp;#x200B;\n\n A cheat does false miracles or magic to impress innocent devotees to cheat them. These two wrong sides are absent in God. He does miracles often to help spiritual progress of deserving devotees and not for His self-projection in fame and not for cheating the innocent devotees.\n\n&amp;#x200B;\n\nHuman incarnation is the most relevant form of God for the humanity here and every human being is missing God here due to ego and jealousy towards co-human forms based on repulsion between common media (human body of God and human body of human being). The same soul goes to upper worlds after leaving this gross body and entering a new energetic body. In the upper worlds, the most relevant form of God is energetic body. Due to the same repulsion between common media (energetic body of God and energetic body of human soul), the soul misses God there also. As a result, the soul misses God always and everywhere. If the soul wants success in Nivrutti, it should avoid ego and jealousy towards common medium. To achieve this, the soul shall participate in the service of humanity treating every human form as God.",
        "created_utc": 1676623097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me or do Christians (or people of whatever religion) in debates with atheists often try to redefine simple terms/words and context so much of the time?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/1145axi/is_it_just_me_or_do_christians_or_people_of/",
        "text": "Sorry if this doesn't belong here. But I've noticed in the admittedly few debates I've watched between atheists and Christians, when a Christian has their turn to present their argument for, say, evidence for the existence of God, they will say \"Well, what do we mean by evidence?\" or \"Well, what do we mean by God?\". Stuff like that.\n\nNow, I'm no debater or philosopher. So maybe they're just doing it for clarity. But even when I watch shows like the Atheist Experience and theists of whatever faith call in, when someone asks \"Why does God condone slavery?\", they'll say \"Well, what do you mean by slavery exactly?\", something even a legitimately stupid person would be able to tell you what it means. \n\nIt's just something I noticed.",
        "created_utc": 1676592255,
        "upvote_ratio": 1.0
    },
    {
        "title": "EXPLAIN THIS ATHEISTS!!!!",
        "author": "tommywiseaux",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/1142jt0/explain_this_atheists/",
        "text": "[removed]",
        "created_utc": 1676585174,
        "upvote_ratio": 1.0
    },
    {
        "title": "The story of Jesus’s sacrifice and resurrection is absolute nonsense.",
        "author": "Jumpy_Inflation_7648",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/112hokz/the_story_of_jesuss_sacrifice_and_resurrection_is/",
        "text": "Today, I would call myself an agnostic. But back when I used to attend Church, I remember hearing everybody sing songs that painted [Jesus’s death on the cross](https://catholicstrengthblog.files.wordpress.com/2018/04/icon-1971100_1920-6.jpg) as this noble, inspiring story about love and sacrifice. \n\nAccording to these services and the religion of Christianity, humanity is inherently evil and needs God to absolve them of their sins so they can reconnect with him. So Jesus Christ was sent to Earth to teach humanity how to achieve salvation. Then he agreed to be nailed to and sacrificed on a cross to “take the punishment that we deserve” for our sins. Then he was resurrected and went back to Heaven, proving that salvation can be achieved through his death and resurrection. \n\nFrom Church services to secular media, Jesus’s sacrifice has been a backbone of Western culture. \n\nBut my problem with this story is…\n\n…what does it mean??\n\nIn order to forgive us for our sins, God sends his son…or himself (if you believe in the Trinity)…to Earth so that he can offer…himself…as a blood sacrifice to appease…himself…in order to forgive humanity for sins that are byproducts of a trait that…he…gave us (if you believe in Free Will).\n\nBut like…isn’t the point of a sacrifice to give up something valuable for the sake of something else that is more important? What did Jesus give up exactly? He came back to life in the end.\n\nHow is his sacrifice a sacrifice then??\n\nIt would be one thing if Jesus was a mortal man who *chose* to live a sinless life, agreed to be offered up, and *stayed dead* after his crucifixion. That would actually be consistent with the definition of a sacrifice, which is to give something up for the sake of something else deemed more beneficial and essential. But since Jesus was  supposedly *created by God (or IS God depending on what doctrine you subscribe to),* crediting his sinless lifestyle to his divine origins defeats the purpose of him “dying for our sins.”\n\nIt’s also self-contradictory, as many Christians will preach the importance of living as close to a sinless life as possible since Jesus was an innocent human being, but will also attribute his “perfect” life to God. Jesus having divine powers means he didn't have to work hard in order to live a perfect life; it was already in his nature not to sin.\n\nSo what did Jesus give up to “save us?” What’s inspirational about his sacrifice? What are we supposed to gain from it? \n\nIt just sounds like meaningless word salad.",
        "created_utc": 1676412680,
        "upvote_ratio": 1.0
    },
    {
        "title": "The story of Jesus’s sacrifice is incoherent nonsense.",
        "author": "Jumpy_Inflation_7648",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/112hh36/the_story_of_jesuss_sacrifice_is_incoherent/",
        "text": "Today, I would call myself an agnostic. But back when I used to attend Church, I remember hearing everybody sing songs that painted [Jesus’s death on the cross](https://catholicstrengthblog.files.wordpress.com/2018/04/icon-1971100_1920-6.jpg) as this noble, inspiring story about love and sacrifice. \n\nAccording to these services and the religion of Christianity, humanity is inherently evil and needs God to absolve them of their sins so they can reconnect with him. So Jesus Christ was sent to Earth to teach humanity how to achieve salvation. Then he agreed to be nailed to and sacrificed on a cross to “take the punishment that we deserve” for our sins. Then he was resurrected and went back to Heaven, proving that salvation can be achieved through his death and resurrection. \n\nFrom Church services to secular media, Jesus’s sacrifice has been a backbone of Western culture. \n\nBut my problem with this story is…\n\n…what does it mean??\n\nIn order to forgive us for our sins, God sends his son…or himself (if you believe in the Trinity)…to Earth so that he can offer…himself…as a blood sacrifice to appease…himself…in order to forgive humanity for sins that are byproducts of a trait that…he…gave us (if you believe in Free Will).\n\nBut like…isn’t the point of a sacrifice to give up something valuable for the sake of something else that is more important? What did Jesus give up exactly? He came back to life in the end.\n\nHow is his sacrifice a sacrifice then??\n\nIt would be one thing if Jesus was a mortal man who *chose* to live a sinless life, agreed to be offered up, and *stayed dead* after his crucifixion. That would actually be consistent with the definition of a sacrifice, which is to give something up for the sake of something else deemed more beneficial and essential. But since Jesus was  supposedly *created by God (or IS God depending on what doctrine you subscribe to),* crediting his sinless lifestyle to his divine origins defeats the purpose of him “dying for our sins.”\n\nIt’s also self-contradictory, as many Christians will preach the importance of living as close to a sinless life as possible since Jesus was an innocent human being, but will also attribute his “perfect” life to God. Jesus having divine powers means he didn't have to work hard in order to live a perfect life; it was already in his nature not to sin.\n\nSo what did Jesus give up to “save us?” What’s inspirational about his sacrifice? What are we supposed to gain from it? \n\nIt just sounds like meaningless word salad.",
        "created_utc": 1676412158,
        "upvote_ratio": 1.0
    },
    {
        "title": "CMV: Forming Organizations that Promote Abrahamic Religions Should be Illegalized to Protect People of Other Faiths, Science, and LGBT+ Individuals",
        "author": "Ok-Gas-9476",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/112fjit/cmv_forming_organizations_that_promote_abrahamic/",
        "text": " Perhaps I am making an unfair comparison but recently I came across this [article](https://www.thenation.com/article/world/interview-taliban/) about an interview a journalist had with the Taliban and it made me experience substantial anxiety. I was again reminded that these kinds of movements are highly prevalent throughout the world and will use violence time and time again to impose their version of what society ought to be which involves degrading women, lgbt+ people, atheists, and people of other faiths as second-class citizens. Moreover, it's not just Islam that promotes such values. Christianity is also a significant danger to society and must be oppressed. We have seen this to be the case with Roe V. Wade and how they also attempt to turn atheists and LGBT+ individuals into second-class citizens. They are also very anti-education as they try to stop schools from teaching science. Therefore, Christianity is just as dangerous as Islam and must be eliminated as well.\n\nBecause of promoting this form of oppression, it's crucial that we fight back against all forms of Abrahamic religions to protect these individuals from being oppressed. Therefore, I actually would support policies that imprison leaders of all forms of Abrahamic religions to protect other cultures because Abrahamic religions dominate and will eventually seek to eliminate those who do not embody the values that the religion attempts to impose. In contrast, other religions such as Buddhism, Taoism, or Shintoism do not seek to impose their way of life onto others and Abrahamic religions in fact try to eliminate these minority religions. Because of this, there cannot be human rights if Abrahamic religions continue they exist, these religions must be eliminated through the greatest amount of force possible.",
        "created_utc": 1676407212,
        "upvote_ratio": 1.0
    },
    {
        "title": "dealing with death as an atheist is hard",
        "author": "bitchboy-supreme",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/111eb3g/dealing_with_death_as_an_atheist_is_hard/",
        "text": "I've been atheist ever since i can remember and this isn't the First time i'll have to deal with the death of my loved ones but it really doesn't get easier. \nMy grandmas sister, who i was Close to, is dying soon. We all know it, but while my Family is Christian and believes in her continuing existence in heaven i'm just kinda stuck again with this dread. I like to calm myself with the Idea that she's gonna be part of the earth still with her corpse decomposting but honestly that only does so much. \nHow do you guys deal with death? Not your own but the death of your Loved one i mean.",
        "created_utc": 1676308236,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you haven't heard of \"henotheism,\" then this will be a game-changer for you.",
        "author": "Ben_Eszes",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/111088t/if_you_havent_heard_of_henotheism_then_this_will/",
        "text": "Henotheism: adherence to one particular god out of several, especially by a family, tribe, or other group.\n\nThe reason why this is a game-changer, in my opinion, is because it perfectly describes the transition from Judaism to Christianity. Basically, it makes it painfully obvious that we're looking at a man-made religion which was affected by cultural changes, just like the rest of them. More importantly, it demonstrates that Christianity does **NOT** have monotheistic roots; rather, the origin chain goes polytheism--henotheism--monotheism. Pretty much everyone rejects polytheism these days. So, knowing that the originators were polytheistic should discredit the later-turned-monotheistic religion known as Christianity. Remember reading about Elohim in Genesis and wondering why it basically means plural gods?\n\nThe TL;DR is that Yahweh was a tribal/regional god to the Israelites. They accepted that plenty of other gods existed, but they chose to only worship only him. The origins of Christianity are literally just the boring and typical \"our real god versus your real god, but ours is stronger or likes us better.\" Remember when they lost the battle because the enemies had iron chariots? Classic Old Testament story. (*\"The LORD was with the men of Judah. They took possession of the hill country, but they were unable to drive the people from the plains, because they had chariots fitted with iron.\"*) I guess Yahweh wasn't strong enough to defeat the iron chariots. Eventually, all of the other 'real' gods became 'false idols' and after many generations, you find yourself with monotheism.\n\nHere's something I found online that I wanted to share. I find it does a much better job at explaining everything:\n\nAll archaeological evidence points to the Israelites having been a tribe among the Canaanites that developed a cult of worship around El Elyon, the creator god of the Canaanite Pantheon. They believed that by pooling all of their offerings and prayers into the worship of a single deity, rather than spreading them out amongst multiple Gods, their tribe would be singularly granted favor by this deity. By worshiping only one god, their tribe self-organized itself into a monotone culture that saw itself separate from the other tribes. They managed to expand their rule across the whole region before being defeated by the Persian Empire and sent into exile in Babylon.\n\nTo prevent their people from merging into Persian culture and society, the Levites, who acted as priests and scholars within Israelite society, drafted a revision of Israelite history using stories from different cultures that they came in contact with while in exile as templates. This revision is where the story of Exodus originated from. This revised history gave the Israelites a way to feel separate from Persian society and prevented them from losing their cultural identity until they were finally allowed to return to their homeland from exile many years later when Cyrus the Great came to power in Persia. This period in Israelite history shows stark differences to Israelite culture before their time in exile.\n\nAll the lower gods from the Canaanite Pantheon were seen as false idols in the eyes of their god, now called Yahweh, rather than rivals to him. This transformation may be the first example in history of the emergence of a monotheistic society.",
        "created_utc": 1676265358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our notions of 'spirituality' are only the misinterpretation of an evolved psychological function",
        "author": "Worried_Employee3073",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/110rb7j/our_notions_of_spirituality_are_only_the/",
        "text": " \"Hagioptasia (meaning ‘holy vision’) has recently been identified as an evolved, adaptive psychological mechanism... ...a natural tendency to perceive certain persons, places or things as being preternaturally ‘special’. \"  \n\"(Consequently) The influence of hagioptasia has clearly played a major role in the development of religious and spiritual beliefs \"\n\n[https://hagioptasia.wordpress.com/](https://hagioptasia.wordpress.com/)",
        "created_utc": 1676238624,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of the biggest things that works against the existence of the Biblical God is this question...",
        "author": "Jumpy_Inflation_7648",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/110kyuz/one_of_the_biggest_things_that_works_against_the/",
        "text": "Why would an omnipotent, omniscient, omnipresent, and omnibenevolent being *favor a specific group of people* over the rest of his creation? I’m talking about Yahweh and his covenant with the Israelites in the Old Testament. Why would a being this powerful and wise have [“chosen people?”](https://wol.jw.org/en/wol/mp/r1/lp-e/pc/2009/69)\n\nWell, it could be that Yahweh is real and is a vain and petty god who enjoys being worshipped by a minute number of people while torturing the rest of humanity.\n\nOr maybe Yahweh was made up by ancient Middle Eastern tribesmen who had a limited understanding of the world and wanted to differentiate their religious identity from those of neighboring tribes.\n\nWhich answer sounds the most obvious? I’ll leave it to you to decide. 😉",
        "created_utc": 1676222510,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you believe jesus is a real person?",
        "author": "alwaysanovicee",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/110hdav/do_you_believe_jesus_is_a_real_person/",
        "text": "[removed]",
        "created_utc": 1676213253,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the logical explanation for this?",
        "author": "ContractElegant4391",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/11043gf/what_is_the_logical_explanation_for_this/",
        "text": "[removed]",
        "created_utc": 1676166660,
        "upvote_ratio": 1.0
    },
    {
        "title": "The \"fine tuning\" argument for the existence of God comes with such an extraordinary amount of baggage as to render it untenable as evidence.",
        "author": "OverLifeguard2896",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10yuigw/the_fine_tuning_argument_for_the_existence_of_god/",
        "text": "Tldr at the bottom\n\nThe short version of the fine-tuning argument states that the universe and its laws are so precisely calibrated as to allow life to exist, that there must be a creator who fine-tuned those laws. While this argument appears intuitive at first blush, it rests on such monumentally audacious presuppositions that we should be willing to discard it until they are substantiated.\n\nFirst, to claim that there's significance to the the parameters of the universe, You must first demonstrate that the parameters of the universe can be anything other than what they are. If I open a brand new deck of cards and discover that they are all in order, is this truly the most improbable event of all time, or do all brand new decks of cards come in order?\n\nSecond, if you want to necessitate a fine tuner for the existence of life, you must also demonstrate that some proportion of all possible universes would result in one where life was impossible. Which parameters of the universe are able to be changed, and by what increments? Which ranges of parameters allow life and which don't? \n\nTl;dr *Without being able to substantiate the claim that the universe is even tunable and that it requires tuning for life, the fine-tuning argument fails.*",
        "created_utc": 1676042234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do you not believe in God?",
        "author": "FireNisis",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10yqpfr/why_do_you_not_believe_in_god/",
        "text": "Is it because you've never experienced Him? Do you need an experience to believe? Can you explain our experience of life? How does brain matter produce visuals and sound for our perception? How is it not an infinite cycle to experience the senses? And what distinguishes your body's senses apart from what a spirit would give you? In other words: how do know your not experiencing some of God?",
        "created_utc": 1676031945,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am an observant Jew. I want to be atheist, but stay culturally observant. Would this subreddit be fine with this?",
        "author": "yhl3052",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10y2azx/i_am_an_observant_jew_i_want_to_be_atheist_but/",
        "text": "“How deeply do I regret not having been more diligent in studying the language and literature of our fathers... I read the Bible quite often, but the original text remains inaccessible to me.” - [Albert Einstein](https://mosaicmagazine.com/picks/history-ideas/2021/11/the-rabbi-who-convinced-einstein-to-praise-the-talmud/)\n\nI like the traditions, such as reading prayers in Hebrew, not using electricity on Shabbat, fasting on Yom Kippur, eating Kosher food, baking Challah, and so on.  One reason that I didn't consider atheism in the past was I thought atheists weren't taken seriously.\n\nRecently however, I was reading about the [history of Atheism](https://www.cam.ac.uk/research/news/disbelieve-it-or-not-ancient-history-suggests-that-atheism-is-as-natural-to-humans-as-religion) and learned that Atheism was more common than previously assumed.  I have accepted that many facts in the Torah are vaguely worded and some are made up.  However, the descriptions of Jewish traditions are very strong.  So I definitely want to be atheist, but I don't find \"secular\" Judaism that interesting or immersive.",
        "created_utc": 1675967803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did reading the Bible make you lose your faith in God?",
        "author": "Sufficient_Inside_10",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10xj9k0/did_reading_the_bible_make_you_lose_your_faith_in/",
        "text": "I’ve been reading the Bible, and it really does sound like legends and utter nonsense. Genesis is just the beginning, and unlike some Christian’s say it is supposed to be literal, Jesus took it literally. \n\nMatthew 19:3–4\n\nESV\n\n3 And Pharisees came up to him and tested him by asking, “Is it lawful to divorce one’s wife for any cause?” 4 He answered, “Have you not read that he who created them from the beginning made them male and female,”\n\nMatthew 24:38–39 (ESV)\n\n38 For as in those days before the flood they were eating and drinking, marrying and giving in marriage, until the day when Noah entered the ark, 39 and they were unaware until the flood came and swept them all away, so will be the coming of the Son of Man.\n\nMatthew 10:15 (ESV)\n\n15 Truly, I say to you, it will be more bearable on the day of judgment for the land of Sodom and Gomorrah than for that town\n\nMark 10:6 (ESV)\n\n6 But from the beginning of creation, ‘God made them male and female.’\n\nLuke 11:50–51 (ESV): \n\n50 so that the blood of all the prophets, shed from the foundation of the world, may be charged against this generation, 51 from the blood of Abel to the blood of Zechariah, who perished between the altar and the sanctuary. Yes, I tell you, it will be required of this generation.\n\nThe New Testament Authors also believed genesis is literal. \n\n“The genealogies of Jesus presented in Matthew 1:1–17 and Luke 3:23–38 show that Genesis 1–11 is historical narrative”\n\n1 Corinthians 15:21–22 (ESV)\n\n21 For as by a man came death, by a man has come also the resurrection of the dead. 22 For as in Adam all die, so also in Christ shall all be made alive\n\n2 Corinthians 11:3 (ESV)\n3 But I am afraid that as the serpent deceived Eve by his cunning, your thoughts will be led astray from a sincere and pure devotion to Christ\n\n1 Peter 3:20 (ESV)\n20 because they formerly did not obey, when God’s patience waited in the days of Noah, while the ark was being prepared, in which a few, that is, eight persons, were brought safely through water.\n\n2 Peter 3:4 (ESV)\n\n4 They will say, “Where is the promise of his coming? For ever since the fathers fell asleep, all things are continuing as they were from the beginning of creation.”",
        "created_utc": 1675911061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did reading the Bible make you lose your faith in God?",
        "author": "Sufficient_Inside_10",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10xiben/did_reading_the_bible_make_you_lose_your_faith_in/",
        "text": "[removed]",
        "created_utc": 1675908500,
        "upvote_ratio": 1.0
    },
    {
        "title": "A supernatural claim I'm struggling with",
        "author": "stefanomusilli96",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10wayyr/a_supernatural_claim_im_struggling_with/",
        "text": "I have OCD, and most of my intrusive thoughts are about religion. Lately I've been obsessing over this childhood memory. Basically someone in my class when I was a child claimed that they saw an apparition of a saint who talked to them (to be precise, San Pio, the guy who mutilated his hands and pretended it was a miracle, he's extremely popular in my country).\n\nI don't believe in any supernatural claim, but things like this kinda scare me. Assuming the child wasn't lying or describing a dream (I have no way of confirming any of this and don't know this person), did they have some fucked up hallucination involving a religious figure? I struggle with this and need help looking at this rationally.",
        "created_utc": 1675798847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Christians and Catholics aware that their beloved god is a stellar warcriminal?",
        "author": "oppressed_user",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10uz0a5/are_christians_and_catholics_aware_that_their/",
        "text": "",
        "created_utc": 1675662479,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm going to an apologetics workshop as an atheist.",
        "author": "redsnake25",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10tygv5/im_going_to_an_apologetics_workshop_as_an_atheist/",
        "text": "[removed]",
        "created_utc": 1675563811,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm an atheist going to be \"practice\" at an apologetics workshop.",
        "author": "redsnake25",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10tyfnp/im_an_atheist_going_to_be_practice_at_an/",
        "text": "",
        "created_utc": 1675563713,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we explain psychokinesis?",
        "author": "KpopAmbassador",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10t0w3l/how_do_we_explain_psychokinesis/",
        "text": "While watching The Witch, a story about \"transhumans\" who can manipulate objects with mental effort alone, I remembered my highschool teacher. He believed we all have the psychic ability to move objects, and demonstrated that by moving one of my classmate's hands with his mind \n\nMy classmate didn't want her hand to move, but it did\n\nIs there an explanation for that? God? Soul? What could it be? \n\nCan mind alone move objects, with or without technology? And why?",
        "created_utc": 1675472684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Atheist by default",
        "author": "Jabusprick",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10sorzu/atheist_by_default/",
        "text": "I grew up in a Christian family, very involved in the church, sang in choir, attended Sunday school, (mother was the teacher).\n\nFrom the very first sermon something clicked in my brain. This is a fantasy, a fairy tales with actors dressed in funny garb and silly pointed hats.\n\nI knew it was false as a child, guess that’s why I’m an environmental engineer!\n\nI realize not everyone is “blessed” with rational thinking as a child but I was. My mother taught Sunday school but also literature as a professional accredited teacher. She also encouraged critical thinking and to question everything. \n\nReligion poisons everything. Citing  Hitchens",
        "created_utc": 1675442465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you ever date, or possibly even marry, someone who is religious?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10sjad5/would_you_ever_date_or_possibly_even_marry/",
        "text": "They could be Christian, Jewish (and I mean a religious/theistic Jew, because I know some Jewish people are atheists and have Jewish heritage), Muslim, Hindu, etc. \n\nI'm just curious if you personally would ever get into a relationship with someone who is the opposite of you in terms of your views on God.",
        "created_utc": 1675427732,
        "upvote_ratio": 1.0
    },
    {
        "title": "your brain is begging you to listen to it",
        "author": "ImageWizardry",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10s1gpl/your_brain_is_begging_you_to_listen_to_it/",
        "text": "[removed]",
        "created_utc": 1675373371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I weird (for lack of a better term) for being envious of religious and spiritual people?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10qxcrq/am_i_weird_for_lack_of_a_better_term_for_being/",
        "text": "I am mainly envious because of how much fulfillment either their belief in a God or gods gives them. It gives them purpose and drive. \n\nOr take someone who maybe doesn't believe in a God or gods but instead calls themselves \"spiritual\". They say they do things like meditate and are \"in time with nature\" or something like that. Being able to live in the present moment all day every day and be at peace with their inner selves. \n\nNow, you may call them delusional for believing this or not. Regardless, I personally do not believe in the existence of anything spiritual because I have no reason to think there is anything beyond the material world. There could be, but we haven't found it yet. And yet, I find myself not really having much of a purpose or drive like the aforementioned people do. Like I'm just going through my life day to day. No \"inner peace\" or \"nirvana\" as someone like Alan Watts or the Dali Lama may say. \n\nMaybe I'm just depressed. I don't know. But I can't shake this envious feeling towards those people and am wondering what, if anything, I can do.",
        "created_utc": 1675265038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Slavery in the Bible is not explainable with an Omniscient and Omnipotent God",
        "author": "ccmcdonald0611",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10qg9m1/slavery_in_the_bible_is_not_explainable_with_an/",
        "text": "The common response to God not *condemning* slavery and instead *providing* *parameters* *for* *how* *to* *treat* your slaves is that it was common for the time and culture. Setting aside how that doesn't jive with a God that supposedly is the eternal standard of morality that never changes and shouldn't be shaped by OUR culture, or the culture of the time....\n\nHow do you explain the *necessity* of an immoral system when God could easily replace the need for it with his power? He sustained Israel and the Jews all the way down to Abraham with immense power and sustenance when they had *nothing*. When they themselves were slaves, God helped them. Why can God not sustain his people without slavery and instead abolish an immoral system?",
        "created_utc": 1675213648,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a little bit of a problem with my friendships and I don’t know how to deal with it when it comes to religion",
        "author": "Adventurous-Boss-882",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10qf6c7/i_have_a_little_bit_of_a_problem_with_my/",
        "text": "So, I don’t consider myself fully atheist I do believe there is some type of spiritual being or something like that, but I don’t believe in religion in human made religion at all. The problem is most of my friends have become not a little bit religious but full blown religious, one of them even do fasting for their god. I respect people that are religious, however, is extremely uncomfortable because they are always talking about religion and religion and Bible and god. I have been to church, I have read some of the Bible I don’t feel any type of connection towards religion. I also believe most of them lack common knowledge, like  for me it’s okay to follow something but why follow it completely blindly? I am even gay and they follow preachers that are against homosexuality, trans people and etc. on my birthday they missed their youth group and put their cell phone on in order to hear the preacher.",
        "created_utc": 1675210737,
        "upvote_ratio": 1.0
    },
    {
        "title": "true atheism and nihilism: any difference?",
        "author": "ihcatiahihcu",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10q4ac3/true_atheism_and_nihilism_any_difference/",
        "text": "[removed]",
        "created_utc": 1675184555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Atheist but struggling",
        "author": "JealousMooseisLoose",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10pq2ic/atheist_but_struggling/",
        "text": "I hope this post makes sense and I can have a discussion about my thoughts.  \n\nI did not grow up in a religious household.  I went to church unwillingly with other family members and while I understood the story of Jesus and God being told to me, even then I did not believe it.  First I was a soft agnostic, most likely out of fear. I kept it to myself for a long time, maybe mentioning here or there that l don't really believe in the presence of Gods. As I've gotten older I have shifted to fully embracing atheism, but lately I am struggling.  I feel... wrong for not believing.  So many others do. I cannot shake this feeling of maybe they're right? What am I missing? It makes me uncomfortable.  A neighbor asked me today if I believed in God and when I told her no she took it very personally and blamed my life problems on my lack of faith... but that can't be right.  I still don't believe but I feel like I'm doing something wrong for not being faithful. I believe more in faith of the self.  I believe we are the Gods of our own beings.. if that makes sense. I don't know I feel like I'm rambling.  This may just be religious trauma flaring up that I did not realize I had.  Has anyone else felt this way?",
        "created_utc": 1675143961,
        "upvote_ratio": 1.0
    },
    {
        "title": "An example of the authoritarian logic of Christian nationalists: they condemn Thomas Paine, a man who gave great service to American independence, as a traitor, solely on the basis he was not a Christian",
        "author": "Friendlynortherner",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10owj2j/an_example_of_the_authoritarian_logic_of/",
        "text": "[https://christianheritagefellowship.com/how-thomas-paine-betrayed-america/](https://christianheritagefellowship.com/how-thomas-paine-betrayed-america/)\n\nThis is a deeply authoritarian and anti freedom belief system, that non belief in their religion is treason. It is also full of historically revisionism, denying that Ben Franklin and Thomas Jefferson were deists as well, even though they had made that clear in their private works and statements. Any talk about freedom they made is false, they are in the tradition of the Puritans who claimed to come to America for religious freedom from the Church of England, only to go hang Quakers, execute \"witches\", and harass Catholics. They are cut from the same cloth as the Puritans back in England who when they seized power during the English Civil War immediately began to use the power of the state to force their religious beliefs on everyone else. \n\nChristian nationalists claim to love the American constitution, but they hate the actual meaning of it, starting right with the first amendment. They reject the separation of church and state, which is the foundation of freedom of religion. They instead profess the doctrine that America is a \"Christian nation\". And of course it is their particular brand of Christianity. Freedom of the evils of state religion is one of the great gifts our forefathers gave us, men have to fight and die and use the means of muskets, cannons, and bayonets to rid themselves of this evil here in America and in much of Europe. Their ideology is anti Enlightenment, they want to repress us back to an inferior social order centuries dead,",
        "created_utc": 1675066134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Homophobic hypocrisy in religion.",
        "author": "throwawaymcgee9000",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10nb0um/homophobic_hypocrisy_in_religion/",
        "text": "I am posting this on a throwaway account because I don't want to be deemed Islamophobic on my main. Just to state, I am not in the slightest. This is just something that really bothers me.\n\nA couple months back I was scrolling through social media and I stumbled upon a couple of posts from a Muslim couple discussing homosexuality and trans issues.\n\nThey were answering a question on homosexuality in Islam and if they supported it. They said that they didn't judge people on their sexuality or gender identity. Okay, so far so good. Then they go on to say that gay people can be Muslim but since it was a sin in Islam that they cannot act on their urges.\n\nI am bisexual and trans and this really rubbed me the wrong way because doesn't this directly contradict their previous statement? You can't say that gay people are allowed to be Muslim, then turn around and say that \"Oh, but they just can't act on it.\" That is a homophobic statement no matter which way you twist it.\n\nFurthermore, they claim not to be homophobic, yet the husband says that he refuses to live with his uncle because he's gay and it would be sinful.\n\nThere are also a couple instances of them reducing trans people down to their biology.\n\nIt's not even just isolated in Islam I see this everywhere in Organized religions, especially those which are monotheistic. I mainly see these kinds of statements echoed in Christianity, Catholicism, Mormonism, and in Jehovah's witnesses\n\nIt's awful that most organized big religions are homophobic and transphobic, but it irks me even more when they try and mask it with statements like \"Gay people are welcome but the act isn't.\" Or the ever famous \"love the person hate the sin.\"\n\nLike mate, just say that your religion hates gay people point blank. It would save the lot of us a lot of trouble.",
        "created_utc": 1674897871,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I break my fear of Maltheism once and for all (pls don’t downvote)",
        "author": "_Malinatusik",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10mvbgp/how_can_i_break_my_fear_of_maltheism_once_and_for/",
        "text": "Hi guys. Please forgive me. I’ve posted this on various subs, however I haven’t gotten any satisfiyin answers. So please forgive me and don’t report for spam.  I really need your help guys. \n\nI enjoy talking to you guys about God etc and different theories on it.  \n\nHow can I break my fear of God being evil once and for all?\n\nLately I’ve developed a fear of the belief that God is evil and gets pleasure for our suffering. I suffer from religious ocd and I’m seeking therapy. \n\nI’ve been fearing that what if God is pure evil and sends us to eternal suffering after we die? \n\nNo matter what we do, we end up in eternal suffering. This deity takes pleasure from our suffering and will torture us after we die. \n\nWhat if God surprises us or fools us after we die with a hell?\n\nThis joy and beauty we in this life, is making us think that God is Good, but he’s actually evil and will deceive us.\n\n❌Why is this unlikely?❌\n\nThis will be the last post on this topic. I promise\n\nMuch appreciated guys\n\nThanks",
        "created_utc": 1674851737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with a sense of cosmic loneliness.",
        "author": "baphommite",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10mt8gb/dealing_with_a_sense_of_cosmic_loneliness/",
        "text": "I've been an atheist all my life, so I don't know why this has been upsetting me. But, the past few weeks, I've been dealing with a sense of cosmic loneliness. The idea that nothing out there exists or cares has just.. been dragging me down lately. No god, gods, angels, devils, spirits, souls, or whatever are out there, caring for me, happy I'm here. \n\nAnd of course this could be taken a positive way, that nothing out there wants to harm me. That's how I've thought about it in the past, and it never bothered me.\n\nI don't know what's happened to me. Its like one day I woke up and all of a sudden made me sad. \n\nI don't know. How do you guys deal with these feelings? Is there anything that can be done?",
        "created_utc": 1674846791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should i tell my friend to gt out?",
        "author": "icedark98",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10mgmxr/should_i_tell_my_friend_to_gt_out/",
        "text": "He recently went through a breakup and i know religion is his emotional clutch and i want to let him heal before he can handle, if religion can support him emotionally, i didnt want to let him suddenly feel unclutch",
        "created_utc": 1674810817,
        "upvote_ratio": 1.0
    },
    {
        "title": "I came out as atheist to my parents",
        "author": "SmoughAndOrnstein",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10mbzck/i_came_out_as_atheist_to_my_parents/",
        "text": "Hello fellow atheists, (I'm glad I can say that now). I recently came out out as an atheist to my strict catholic parents. When I told them, they hit me with sticks and yelled at me \"this is how Jesus felt.\" The next day they enlisted me to military school. They said they did that so I could \"find god,\" whatever that means. What should I do? I don't wanna be alone.",
        "created_utc": 1674793424,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do Atheists Explain Spiritual Experience?",
        "author": "Rubberduck640",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10m9un1/how_do_atheists_explain_spiritual_experience/",
        "text": "[removed]",
        "created_utc": 1674786956,
        "upvote_ratio": 1.0
    },
    {
        "title": "i have pointed this inconsistencies in the bible and this are the reply's are they valid",
        "author": "Big-Initiative-2030",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10l5m7f/i_have_pointed_this_inconsistencies_in_the_bible/",
        "text": "The inconsistency \n\n&amp;#x200B;\n\n• In the creation story in the book of Genesis, it states that God created man and woman on the same day, while in the second account it says that God created man first and then woman later.\n\n&amp;#x200B;\n\n[1.In](https://1.In) the book of Genesis, the creation story is told in two different accounts, the first in chapter 1 and the second in chapter 2. In the first account, it states that God created man and woman on the same day, \"So God created man in his own image, in the image of God he created him; male and female he created them\" (Genesis 1:27). However, in the second account, it states that God created man first and then woman later. \"The Lord God formed man from the dust of the ground, and breathed into his nostrils the breath of life; and the man became a living being. Now the Lord God had formed out of the ground all the beasts of the field and all the birds of the air. He brought them to the man to see what he would name them; and whatever the man called each living creature, that was its name\" (Genesis 2:7-19).\n\n&amp;#x200B;\n\nThe defense \n\n&amp;#x200B;\n\nOk genius, here are some answers ( others can add btw)\n\n•the creation story in genesis 1 &amp; 2 is not of two narrations. The first chapter focuses on the whole creation and generalizes the creation of human being in it. Chapter two gives more attention for man and give details.\n\n&amp;#x200B;\n\nThe second chapter is the explanation for the 6th day from the first chapter.\n\n&amp;#x200B;\n\nHow do you know that the days are different???\n\n&amp;#x200B;\n\nI think this was a good argument point",
        "created_utc": 1674671072,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is everyones opinion on Maltheism?",
        "author": "_Malinatusik",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10iithk/what_is_everyones_opinion_on_maltheism/",
        "text": "Maltheism is the belief that there is an Evil God who enjoys our suffering and is toying with us.\n\nPeople also believe that there is a hell that was made by this god and will send us there after we die. \n\nThe god or deity is described as malicious and evil.\n\nIs is an evil God likely to exist, given the amount of suffering that happens on our planet? \n\n\nPeace out",
        "created_utc": 1674391296,
        "upvote_ratio": 1.0
    },
    {
        "title": "My thoughts on death and loss as an atheist",
        "author": "gekx",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10ie17g/my_thoughts_on_death_and_loss_as_an_atheist/",
        "text": "    If we move through one of the known spatial dimensions, we come to understand that each object occupies a finite amount of space. As we move along one dimension, the object will stop taking up space, and eventually fade from view. Still, even though we cannot detect it with any of our senses, we know that it is still there. This is the concept of object permanence, which we learn at a young age.\n\n    I think of the time dimension in much the same way. Our lives occupy a very small amount of space in the grand timeline of the universe. At one point, we are alive, experiencing all that life has to offer, and making an impact on the world whether good or bad. As time goes on, we die. Our deeds live on a bit longer, but eventually, our impact fades until it is indistinguishable from the rest of humanity. But does this mean that our lives were meaningless? Absolutely not. I believe our lives, like objects in space, remain unchanged in the universal timeline. Just because two separate points in time are unable to interact with each other doesn't mean the previous point is meaningless. It's still there, it's every bit as real as any other point in time. So if something is gone, it's not really gone. It remains frozen, unchanged, for all eternity. \n\n\n_\"Don't cry because it's over, smile because it happened\"_ - Dr. Seuss",
        "created_utc": 1674372804,
        "upvote_ratio": 1.0
    },
    {
        "title": "A priest at my catholic grade school told a classmate that suicide is a sin",
        "author": "Cannonel10",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10ibo56/a_priest_at_my_catholic_grade_school_told_a/",
        "text": "A priest I knew in grade school said suicide is a sin\n\nI went to Catholic grade school and had a classmate whose brother apparenty died by suicide a few years prior. He always asked the priest, who visited weekly, if his brother was in hell and he said yes. I recently talked to two friends who are very devout Catholics if that is true, and they said it is absolutely not a sin. I’m only realizing how messed up it was. This was in sixth grade.",
        "created_utc": 1674364092,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you personally feel about degrees in theology or divinity?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10gw82s/how_do_you_personally_feel_about_degrees_in/",
        "text": "Do you consider them legitimate fields of study since they evaluate various religious/holy texts from a wide array of religions throughout the world? Or do you simply think they are wastes since the God or gods they study about have not been proven to exist in the first place?",
        "created_utc": 1674219216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jesuit Extreme Oath of Induction",
        "author": "only1jellybeanz",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10f8smv/jesuit_extreme_oath_of_induction/",
        "text": "My dad shared with me the Jesuit Extreme Oath of Induction and it's shocking, to say the least. Within the FB comments, someone posted that it was debunked, albeit from a possibly noncredible source (it's definitely biased, based on the website it originated from).\n\nThis is the first I've heard about this and while it is alarming, I'm not surprised that they would believe and encourage such extremism. \n\nThis, I believe, to be relevant given that the new pope is a Jesuit and is leading me to believe that we may see more encouragement towards extreme behaviors.\n\nWhat are your thoughts?\n\nhttps://m.facebook.com/nt/screen/?params=%7B%22note_id%22%3A10159235925445312%7D&amp;path=%2Fnotes%2Fnote%2F",
        "created_utc": 1674052397,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you guys deal with the dread of death",
        "author": "KingSnaily",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10es4zt/how_do_you_guys_deal_with_the_dread_of_death/",
        "text": "I’ve been an atheist for a couple years now and I’m still terrified of aging and eventually dying. The “you won’t have a conciseness to know that your dead” thing doesn’t help because I’m going to ruin my only life thinking about it. I also wanted to say thank you to the creator of this sub because I was getting sick of r/atheism posting about how they hate Christian people and (I’m not saying this is bad but) overly-promoting their political views because republicans are evil christians. Anyways I’m getting off topic. Answer away!",
        "created_utc": 1674000424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think that religion in and of itself is inherently bad, evil, etc no matter how good the people who practice it are? Why, why not?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10denej/do_you_think_that_religion_in_and_of_itself_is/",
        "text": "Christopher Hitchens once famously (or infamously) said that religion poisons everything. But I'm curious if you personally think he is right and that religion is, perhaps, some form of cancer on society that needs to be cut out for good. Or, if you think it's the people who exploit other's fears of the unknown and death that are the problem. Or, if it's something else altogether.",
        "created_utc": 1673875974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cosmology and Physics prove gods existence Debunked?",
        "author": "Ren_Amamiyaa",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10ceqhm/cosmology_and_physics_prove_gods_existence/",
        "text": "I am netural on this stance. I'm agnostic But just want you guys reasoning behind why these do not prove gods existence. I talked to a friend today and he said that god absolutely has to exist because without him the laws of physics wouldn't make any sense. Something has to be alive in order for us to all exist right now.  So, What's your arguement against this?",
        "created_utc": 1673771552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1673768336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stop misrepresenting this quote",
        "author": "Ren_Amamiyaa",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10c6w9r/stop_misrepresenting_this_quote/",
        "text": "[removed]",
        "created_utc": 1673746405,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] I've translated/adapted a major foreign counterapologetic debunking of Christianity, praised in the prestigious journal \"Nature\" (!)",
        "author": "Valinorean",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10brph0/oc_ive_translatedadapted_a_major_foreign/",
        "text": "It's called https://en.wikipedia.org/wiki/The_Gospel_of_Afranius (its English version is the second link on that page, the first one is its review in \"Nature\") and, simply put, it is the reason why there are no apologists in Russian-speaking areas - anybody trying to \"rationally *prove*\" Christianity would be soon pointed to this work, and that would be the end of their prospective career as an apologist. \n\nIts power is derived from its original approach, it eats the apologetics \"from inside\", so to speak: for the sake of argument it deliberately assumes all the things about history that apologists assume (e.g. Paul's list of eyewitness reports is genuine, the Gospel of John was really written by John and he is sincere, and so on ad infinitum) and then *from that* shows that Christianity must be false anyway. \n\nEnjoy! :) (If you want to thank me or the original author, the instructions for that are on the first page of the work. Also please don't forget to share it if you like it!)\n\n[You might've seen this post before, e.g. https://old.reddit.com/r/TrueAtheism/comments/10ayva6/oc_ive_translatedadapted_a_major_foreign/. That's because it keeps getting deleted without explanations (heartily requested by me). Well, I'll keep posting it until this stops, or I get an explanation, or I get banned, no biggie. Fair enough, isn't it?]",
        "created_utc": 1673711595,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] I've translated/adapted a major foreign counterapologetic debunking of Christianity, praised in the prestigious journal \"Nature\" (!)",
        "author": "Valinorean",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10ayva6/oc_ive_translatedadapted_a_major_foreign/",
        "text": "It's called https://en.wikipedia.org/wiki/The_Gospel_of_Afranius (its English version is the second link on that page, the first one is its review in \"Nature\") and, simply put, it is the reason why there are no apologists in Russian-speaking areas - anybody trying to \"rationally *prove*\" Christianity would be soon pointed to this work, and that would be the end of their prospective career as an apologist. \n\nIts power is derived from its original approach, it eats the apologetics \"from inside\", so to speak: for the sake of argument it deliberately assumes all the things about history that apologists assume (e.g. Paul's list of eyewitness reports is genuine, the Gospel of John was really written by John and he is sincere, and so on ad infinitum) and then *from that* shows that Christianity must be false anyway. \n\nEnjoy! :) (If you want to thank me or the original author, the instructions for that are on the first page of the work. Also please don't forget to share it if you like it!)",
        "created_utc": 1673627691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could it be possible that God is evil and sends us to a hell for the sake of it?",
        "author": "_Malinatusik",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/10ayqcb/could_it_be_possible_that_god_is_evil_and_sends/",
        "text": "[removed]",
        "created_utc": 1673627364,
        "upvote_ratio": 1.0
    },
    {
        "title": "If something is the only hypothesis, is it, by default, the \"best\" hypothesis?",
        "author": "Ramza_Claus",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/109zoti/if_something_is_the_only_hypothesis_is_it_by/",
        "text": "In a discussion about the origin of the universe, my interlocutor has proposed the universe is the product of an immaterial mind, and contends this is the best hypothesis we have.\n\nI pointed out that as of now, no one has proven that an immaterial mind can exist, does exist or can create universes. He says this doesn't matter because there are no better hypotheses right now therefore, by default, his hypothesis is the current best one, as weak as it is.\n\nIs he correct here? Is a lousy hypothesis still the best one when it's all we have?",
        "created_utc": 1673530204,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am Christian and wanna talk about some stuff",
        "author": "t0_psych0t1c",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/109dz2u/i_am_christian_and_wanna_talk_about_some_stuff/",
        "text": "Now to start off I have nothing bad to say about Atheists.\n\n  I am also going to be talking about controversial topics or anything that comes to mind that people might not know or need to be cleared on about, so this might not be for everybody lol\n\nI firstly wanna apologize on behalf of Christians because I know the majority are very annoying and can be very \"follow God or you'll go to hell\" like and not to just atheists but just in general. I am an orthodox Christian, so I go by the book (KJV). Anything I read or hear or see on TV or Social Media, I instantly go to the book because there are A LOT of preachers or idols of Christianity who don't know what their talking about and spread lies which leads to hateful Christians which is very shameful. I want to clear up a few things that some people might not know and it even took me a while to understand. I'm going to talk as a Christian so like \"sins\" and \"God\" and all that, sorry if it's gonna sound annoying lol. Everyone Sins. God sees Lying and Murder as a sin so no other is more worse. The most controversial topic is Gay and Christianity, this is the thing being gay isn't a sin; the Bible basically says men can't sleep with another man or 2 women and women can't sleep with each other nor with 2 men. It's a sin but so is Lying, Sex before Marriage, Adultery, etc. I believe people just pushed on the gay subject so much because back then it wasn't a topic people liked and they twisted the words and it's one of those things that have built up over the years and is still a topic that people argue over which is sad. Christians are supposed to be good and loving people but the religion and its people(not all but most) have forgotten what that means. I understand people don't like us talking about our religion because it's as if we're forcing it on you and although some might actually be doing that, some of us just want to give you the important information and that's it; also I do agree that Christians should ask before telling someone about the religion. The \"important Information\" is like this, I'll give an example, I usually play games and talk to people and would ask if anyone wants to hear some things about Christianity and if they don't want to then we play the game until it's over and if they want to hear then I tell them a few stories and the whole \"getting saved\" thing. That's it. After that I'm done and I don't do this everyday lol. The whole \"Follow God or you'll go to Hell\" thing is very annoying even to me because it's weird how the only way to get people to follow Christianity is by scaring them, I don't do that and I know others don't either. The whole thing about falls back to sin and if we don't \"repent\" then we won't be saved; repenting is basically believing in your heart that Jesus rose from the dead and that Jesus is the son of God and you basically ask for forgiveness, but you have to mean it with your heart and if you just say it to say it then you aren't saved lol. If you are a murderer and repent and MEAN it with your heart and not out of fear, you'll be saved and if you have slept with the same sex then you repent and believe it then you are also saved. It's weird but yeah. I also wanna talk about the whole \"proof\" thing about Christianity. There IS some proof of Christianity like Chariot wheels in the Red sea from when Moses was helping Isrealites escape Egypt when he parted the red sea, there's proof Jesus was real(that he was a real person, not that he was supernatural being but he was a real person), Dead Sea Scrolls, and some other stuff I'm sure is out there but I cannot confirm is real or not. Also even if all the \"proof\" of Christianity was fake, Christians still have to have faith and as some people might see it as \"a kid believing in Santa\" because that's basically right. There might not be 101% accurate evidence or proof at all but the faith thing is what keeps some or most Christians going. I believe Christians and Society could get together and be peaceful if the majority of Christianity learned boundaries and were taught correctly and if everyone didn't judge Christians based on all their past interactions. I've been told I am wrong by a Muslim and yet I treat all religions with respect, I've been cussed at by LGBTQ community people and told to die by them and yet I treat all with respect and even have friends who are apart of that community,  I have been made fun of by atheists for believing in a fairy tale and yet I am here with the utmost respect and in hopes I haven't upset yall or annoyed yall too much and I have atheists friends. My point is just to judge the person, not the whole community or religion and that doesn't just go for Christianity but for all religions and all communities and all groups. We would progress so far if people stopped judging others based on what they align themselves with. I believe that's all I gotta clear up and say and discuss and if you read this far, Thank you. If you have any questions or opinions I'm free to chat about it all. Thanks for letting me discuss this topic here and I hope you all have a great day and sorry if I was being annoying at parts but I guess it comes with the title lol. ❤️\n\n(Also sorry if I misspelled anything or if my punctuation is bad, I am re-watching The Office and kinda distracted)",
        "created_utc": 1673466473,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m an atheist myself, just wanted to hear everyone’s response to these questions from a Christian. Please weigh in if you’d like.",
        "author": "Harrywuzhere",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/1098pze/im_an_atheist_myself_just_wanted_to_hear/",
        "text": "Recently saw a Facebook post that had 5 questions for atheists. Typical Christian type misunderstanding of the underlying mechanisms. Just wanted to hear the community’s response to these questions and how they would refute them from people more knowledgeable than I am. \n\n1) The Big Bang: How can nothing explode and produce everything? \n\n2) The Formation of Stars: How can exploding matter come together to form stars and galaxies and planets?\n\n3) The Origin of Life: How can life come from non-life?\n\n4) The Diversity of Life: How can natural selection (genetic information loss) and mutations (genetic information corruption) produce evolution (genetic information gain)?\n\n5) Mind and Morality: How can such non-material things arise from material things?\n\nI hope this prompts good discussion. Thanks!",
        "created_utc": 1673454140,
        "upvote_ratio": 1.0
    }
]