[
    {
        "title": "Overwatch Moira Gameplay",
        "author": "Something240",
        "url": "https://www.reddit.com/r/truegaming/comments/7hvobq/overwatch_moira_gameplay/",
        "text": "[removed]",
        "created_utc": 1512534717,
        "upvote_ratio": ""
    },
    {
        "title": "What if Xbox One Family of systems, could possibly turn into a Windows 10 PC? Specifically Xbox One X!",
        "author": "mattpop12",
        "url": "https://www.reddit.com/r/truegaming/comments/7hu7ns/what_if_xbox_one_family_of_systems_could_possibly/",
        "text": "[removed]",
        "created_utc": 1512520218,
        "upvote_ratio": ""
    },
    {
        "title": "Projectors Recommendations",
        "author": "TheGreatDiscontent",
        "url": "https://www.reddit.com/r/truegaming/comments/7htibo/projectors_recommendations/",
        "text": "[removed]",
        "created_utc": 1512513951,
        "upvote_ratio": ""
    },
    {
        "title": "[LITTLE NIGHTMARES] IS THAT THE PILLSBURY DOUGHBOY?!!#4 Why I'm doin...",
        "author": "chalicegambino",
        "url": "https://www.reddit.com/r/truegaming/comments/7hqwji/little_nightmares_is_that_the_pillsbury_doughboy4/",
        "text": "[removed]",
        "created_utc": 1512492299,
        "upvote_ratio": ""
    },
    {
        "title": "Why do I suck at total war Soo much?",
        "author": "BolovoDePomba",
        "url": "https://www.reddit.com/r/truegaming/comments/7hq0uz/why_do_i_suck_at_total_war_soo_much/",
        "text": "I remember when my brother-in law first showed me age of empires, that was my gateway drug to the world of strategy pc games, I've played a 4 hour campaign with him in that AOE3 Amazon map, I like to think that to this day people still sing songs about that glorious final skirmish.  I love civ series (go nuke your mom Gandhi, leave my beautiful cultural cities alone), the old tycoon games, sim city 4, even cities skylines. Remember battle for the middle earth series? Some times I still scream \"BUILD\" like that Isengard constructor for no reason at all. \n\nSoo I must enjoy total war right? is the perfect crossover between AOE and civ right? Right guys!!!?  Why do I suck Soo hard at it? I lowered my self to play on easy mod just to enjoy one single campaign story but couldn't take the humiliation.\n\nI write for you all today so I can take this weight off my soul, have you ever been trough something like that? Like with other games? I can't be the only one.",
        "created_utc": 1512484428,
        "upvote_ratio": ""
    },
    {
        "title": "PVP Games : Is intentionally bad UI a valid part of gameplay?",
        "author": "zeddyzed",
        "url": "https://www.reddit.com/r/truegaming/comments/7hpn2y/pvp_games_is_intentionally_bad_ui_a_valid_part_of/",
        "text": "Some games are designed around intentionally bad UI.  For example, survival horror games often use awkward controls in order to heighten the sense of fear and discomfort.  And games like Octodad have absurd controls as the central gameplay gimmick.\n\n\nHowever, I'd like to talk about competitive PVP games.  Fighting games, RTS, MOBAs, competitive FPS, etc.\n\n\nQuite often, when one suggests UI improvements to a game, you'll get a resounding chorus of \"You want to dumb the game down?\" \"You want the game to play itself?\" \"It will lower the skill ceiling\" etc, to defend the status quo.\nBut it's a very strange argument, because none of those people ever suggests making the UI even worse to raise the skill ceiling, and I'm absolutely sure that if the game had shipped with improved UI in the first place, those people would think any suggestion to change to the unimproved version as totally crazy.\n\n\nA famous example might be Starcraft 1's 12 unit selection limit.  Or the complex joystick commands of fighting games, especially earlier ones.  In each of these cases, you'll get players passionately defending the current badness of the UI.  But they never address the question, if max selection of 12 units is skillful, then isn't 10 even more skillful?  8? 6? 1?   If 720 degree joystick spin is skillful, then isn't 1080 even more skillful?\n\n\nSimilarly, they never question the existing conveniences in the UI.  Aren't queued commands or hotkeys \"dumbing the game down\"?  Wouldn't the game be even more skillful without those features, or with obfuscated versions of them?\n\n\nPersonally, I consider the game mechanics and UI as separate things.  To use an analogy, the game mechanics of Chess are separate to how you move the pieces.   I don't agree with making Chess more \"skillful\", for example, by making pieces incredibly slippery or heavy.\n\n\nI feel that PVP games should be purely battled out in game mechanics, and UI should be as seamless, customisable and comfortable as possible.  Just like getting the right mouse, keyboard, gaming chair, and binding hotkeys to suit your preference.\n\n\nI don't agree with limiting your UI to address shortcomings in your game mechanics.  Eg.  It's often said that, with unlimited selection limit, it's too easy to just gather a huge army, select everything, and then charge them all into the enemy.  But if  this is a problem, doesn't this mean that your game is poorly designed to handle large armies?  Shouldn't you have mechanics in place so that large armies have disadvantages and weaknesses too, in-game?\n\n\nI also don't agree that limited UI makes games more skillful.  If it takes 200 APM just to move 60 units from A to B in a limited UI RTS, then doesn't it mean that, in a RTS with good UI, a 200 APM player can do even more amazing things? Like control 20 separate huge armies in a coordinated attack, fight on a dozen fronts, or whatever?\n\n\nThe final point is regarding AI players / bots.  If bad UI is the thing that you're using to limit human performance and artificially require \"skill\", then your game will be more easily beaten by AI bots who ignore human limits, have unlimited APM and unlimited numbers of fingers, perfect timing and reactions, etc.   In order to make a game that requires true \"human\" skill, your game needs to be deep in areas that require human thought and decision making.",
        "created_utc": 1512480371,
        "upvote_ratio": ""
    },
    {
        "title": "Arma 2 before DayZ: an experience I'll never get back, and a look at how a mod changed a game forever",
        "author": "disgruntled_guy",
        "url": "https://www.reddit.com/r/truegaming/comments/7hoti1/arma_2_before_dayz_an_experience_ill_never_get/",
        "text": "I realize this may not go over well. Lots of people will disagree with my sentiment. But I got an opinion, and I enjoy writing things up.\n\nArma 2: CO was the first and last game I truly got invested in and the only one I can say I played more than 1,000 hours of – which doesn’t make me feel “proud” but it makes a point. I miss it dearly. I was a regular on the TAW Domination server, known as a decent pilot because I flew with an Xbox controller, and other times a dedicated combat medic that got a thrill out of dragging wounded teammates to cover. The gist of that gamemode is you spawn in a military base in a huge Russia or Afghanistan inspired map littered with enemy occupied towns and cities you need to travel to and liberate one at a time. It was the most immersive fun I have experienced from an online game. Either I’ve grown out of games significantly since then, or I still have yet to find something as good.\n \nOne day in May 2012 I logged in and saw about 5-6 DayZ mod servers. I ignored them. Over the next week or so the servers grew in numbers to the point I had to give one of them a shot. The gameplay was very unique and thus very fun, but after a couple days it grew stale. I stuck mostly to Domination, but I can’t deny that DayZ was very fun in bursts. It wasn’t the first zombie survival mod in Arma, but it was the most complex. I had never seen something quite like it and was impressed by what it achieved - namely the fact you could spawn across servers in the same location, with the same gear, as much as you wanted.\n \nIt took about 3-4 weeks before DayZ exploded with critical acclaim and made Arma 2 the most played multiplayer game for that time period. It was all over all the gaming websites and YouTube. Completely unavoidable. This was surreal because no one ever talked about Arma, at least not positively, and it was as though one of the best kept gaming secrets was exposed for the entire world. A couple guys I desperately tried swaying into buying the game were coming to me asking if I wanted to play DayZ with THEM (I didn’t). A playerbase of maybe 7,000 reached 300k. People were interviewing Dean Hall as if they were Rolling Stone. And as such, the servers outside of DayZ went rotten overnight.\n \nArma 2 is a gruelling game. Friendly fire is enabled across the board and should you die on a large map, gearing up and going back to the combat area takes a lot of time. You need to play slow and calculated to make it worthwhile. The learning curve is steep and too boring for many. You know when you play a game and someone tells you to “go back to CoD” when you do or say something they don’t like? The entire tone of Arma is the physical (or digital) representation of that statement. DayZ attracted two different types of people to Domination: those who disrupted gameplay because they didn’t know how to play, and those who disrupted gameplay because they thought it was funny. The gameplay format was an absolute goldmine for trolling.\n \nSpawning in base post DayZ was usually carnage. Inexperienced pilots crashing helicopters into hangars, guys rushing into combat like it’s Battlefield, people having zero understanding or respect for side missions and blowing the game for others (like that “Leroy Jenkins” thing, in a military simulator). The trolls would actively hunt and TK you or ram aircraft into yours so they could jump onto the side chat channel and tell the admin YOU purposely flew into them to get you banned. Once I had to deal with two kids trying to ram a C130 into my helicopter for a good 20 minutes. This isn’t a game where a simple respawn rectifies everything. Going from base to the AO is a mission itself. The accomplishment you get from killing another player, TK or not, is highly satisfying.\n \nEveryone was being called a nigger, “AIDS” was the new buzzword, and no one played serious. If they couldn’t TK you, they would find new ways to ruin your game, such as covering everything with smoke grenades or playing as pilots and bailing on their full helicopter so the occupants meet a fiery death or parachute out in the middle of nowhere.\n \nBy June of 2012, about two months after DayZ mod was launched, Arma 2 was over. The leftover Domination servers were completely liberated by kids causing problems (every time I’d join the base would be completely destroyed, literally a fiery mess) and you could barely find them anymore because 98% of the server browser, no exaggeration,  was DayZ. I complained about DayZ taking over Arma from the start but was always met with hostility because it was “attracting more players” which to others is considered good, but the ultimate proof is no, it’s not. The community was tight and consistent. We didn’t “need” new players. I don’t understand how that benefits anyone.\n\nYes, you could probably find your way into private servers, but I was never looking for that type of dedicated, overbearing teamwork.\n \nI subsequently tried Arma 3 but it’s just not for me. I like the ideas, but not the game. Multiplayer performance issues make mil-sim gameplay hard and that aside, the majority of servers are DayZ-esque “survival” games I have no interest in.\n\nI miss you, Arma. \n",
        "created_utc": 1512469359,
        "upvote_ratio": ""
    },
    {
        "title": "Games with realistic guns/gun handling that are also fun?",
        "author": "Zerimas",
        "url": "https://www.reddit.com/r/truegaming/comments/7hm54v/games_with_realistic_gunsgun_handling_that_are/",
        "text": "So I started play Destiny 2 and the guns in that game kind of drive me nuts. I know it is a sci-fi setting, but the guns aren't handled realistically at all. When you reload, and you haven't completely emptied the gun, the character still operates the bolt/slide even though there should still be a round in the chamber. There should be no need to actuate the action action at all. Why can't reloading simply have more than one animation?\n\nIf I recall correctly, *The Last of Us* handles guns pretty realistically. When Joel reloads the revolver, he doesn't simply dump everything on the ground and insert six new rounds. He puts in the number he needs.\n\nSpeaking of revolvers, they are generally portrayed unrealistically. It's kind of convention that revolvers are super powerful, but slow to fire with high recoil. And this is somewhat true in real life. More powerful cartridges can be loaded into a revolver than you would typically find in a pistol (there are exceptions of course, like the Desert Eagle, but the Desert Eagle doesn't operate the same way the majority of pistols do). These will also have more recoil, and will likely have more stopping power than a semiautomatic pistol, or a gun that uses pistol ammo (like a submachine gun). So powerful revolvers are fairly congruent with reality, for the most part, but what bothers me is that they are often way more powerful than rifles. Yes, a .44 Magnum round can have the same or maybe more muzzle energy than an assault rifle chambered in 5.56×45mm NATO, but it isn't necessarily more lethal. If body armour is a factor, the 5.56 is going to penetrate it more easily owing to it's smaller cross section. Personal defence weapons like the FN P90 are designed for greater effectiveness against body armour as well as better range than SMGs chambered in pistol-caliber cartridges. The 5.7x28mm cartridge doesn't have much more muzzle energy than a 9x19mm Parabellum, but it has been designed with terminal ballistics and armour penetration in mind.\n\nI kind of got sidetracked there. The point is super powerful revolvers are a lot of fun, which is probably why they are in so many games, but video games make them waaaaaaayyyyy to powerful compared to rifles.\n\nThe unrealistic guns are probably an intentional design choice because they are fun—which I'm inclined to agree. However, I can't really think of many games that have very realistic guns. *Titanfall 2* is actually quite good in this respect. All the guns are fictional, but they behave \"realistically\". You can shoot people from really far away with the rifles (especially the heavy machine guns) and still kill people. In fact, I've found that there really isn't enough distance to make sniper rifles necessary (or maybe I just suck). Sniper rifles are a little more powerful than regular rifles, but not absurdly so. Because the guns are designed to shoot reasonable groups at what amounts typical engagement distances, an assault rifle is generally the better choice. \n\n**TL;DR:** Guns in video games aren't always realistic. Sometimes this is due to just ignorance as how guns work. Often times unrealistic guns are probably an intentional choice to make the game more fun. Are there any games that are committed to both realistic guns and fun?",
        "created_utc": 1512436727,
        "upvote_ratio": ""
    },
    {
        "title": "Essay final for College: What are the positive effects and negative effects of video games on generation Y?",
        "author": "TektiticGalaxy",
        "url": "https://www.reddit.com/r/truegaming/comments/7hkyom/essay_final_for_college_what_are_the_positive/",
        "text": " Hello Everyone, I'm writing my final essay over the positive effects of video games, and was wanting some more evidence from the gamer community. I'm a gamer myself mostly on console, and just built my first PC yesterday. Anyone can reply and give positive or negative feedback. Thanks for any reply and have a Merry Christmas.",
        "created_utc": 1512426239,
        "upvote_ratio": ""
    },
    {
        "title": "Are Video Games More Valuable as Games, or Stories?",
        "author": "rikeys",
        "url": "https://www.reddit.com/r/truegaming/comments/7hkamx/are_video_games_more_valuable_as_games_or_stories/",
        "text": "https://www.youtube.com/watch?v=V-JyLxQteUw \n\nI've encountered gamers who seemingly don't care at all about the stories in the games they play - they're just looking for pure entertainment. But I love playing through a good story, and when they're done extremely well, I feel like I would rather play a good story-driven game than watch the movie or read the book version.\n\nBut I'm also *not* attracted to most \"Walking Simulators\", as they basically seem like movies that you move through at your own pace, and... with more reading. \n\nThat got me thinking about what makes a good game, and whether they are indeed more valuable simply as games, or as a vehicle for story. Where do you find the value of games? Should developers simply focus on gameplay innovation, or should games aspire to be the ultimate storytelling medium? *Can* games really tell stories better than films or novels?",
        "created_utc": 1512420765,
        "upvote_ratio": ""
    },
    {
        "title": "Unexcited by New Releases",
        "author": "Geang",
        "url": "https://www.reddit.com/r/truegaming/comments/7hk4qx/unexcited_by_new_releases/",
        "text": "I was watching [Kim Justice's video about Team 17] (https://www.youtube.com/watch?v=Lkkon5QZoIo) and I've realised something about myself. Towards the end, Kim talks about Team 17's more recent releases, one of which was The Escapists. When I go to the game shops in Norwich when I no college lessons for a considerable time, I often see The Escapists in the shops, but until now I've thought nothing of it. Like most other games... \n\nBut this has made me realise that I've not been excited for recent releases. I'm not talking AAA games like Call of Duty, Assassin's Creed so on and so forth, I'm talking about well produced and worth while games like The Escapists. I've seen a few releases like Senran Kagura: Peach Beach Splash that've caught my eye but few other than that. And it's not like Mario Kart 8 and Super Smash Bros., two games that made me want and get a Wii U in 2014 (although I had played Mario Kart before and very vaguely Smash Bros.). So how could I get more excited by new releases? Maybe it'll help if I tell you a bit about myself.\n\nI'm not a very adventurous person, I often don't like to try new games unless they're things I'm familiar with, like arcady racing games. I'm always wary of buying games in case I don't like it and I would've wasted my money (which I don't have much of).I'm also of the mind set that I I haven't heard about it, it's rubbish And that games must be well review so that I have assurance. I don't like taking many risks.\n\nI'm also relatively unaware of events, mainly because I haven't found a reliable source of information, with many websites having biases that try to influence people (although if these biases are stated, then it's not as bad), although I am looking into Edge magazine which I've heard good things about.\n\nI like many retro games/consoles such as the Mega Drive. Currently I'm quite interested in ToeJam and Earl in Panic on Funkotron on the Mega Drive (and it's fully PAL optimised apparently, so no need for importing an American version). One of the things I like about retro games is that I can try a new genre of game for quite cheap using already established classics of the genre, to get a feel for the genre and if I'll like it or not",
        "created_utc": 1512419360,
        "upvote_ratio": ""
    },
    {
        "title": "Fallout NV npc's are more dynamic then Fallout 4's",
        "author": "Darek_Baird",
        "url": "https://www.reddit.com/r/truegaming/comments/7hjtsk/fallout_nv_npcs_are_more_dynamic_then_fallout_4s/",
        "text": "I've put more then a few hours into Fallout 4 and have enjoyed it. I've never played New Vegas or 3 (though I want to start doing a series on New Vegas). Anyways I've been watching a series on New Vegas and I can't help but notice that it seems the NPC's (enemy and allies not just companions) are more dynamic in their actions\n\nI mean in Fallout4 when I shoot NPC's they take damage and maybe I'll cripple a limb. However in the series (which I believe to be unmodded) the NPC's run away when they see the fight not going in their favor. When the guy playing the game shot the retreating npc (a bandit or something like that) he crippled the man's leg yet he kept limping along. \nAlso when fighting his one companion became frenzied...something I don't believe happens in fallout 4.\n\nI enjoyed Fallout 4 but am I wrong in thinking that the NPC's are less dynamic in their actions? I mean they take cover and sometimes try to flank me yet I've never seen them run for the hills or limp around the firefight. Am I the only one thinking this and are there any mods that enhance the behavior of npc's to be more dynamic in Fallout 4 (for Xbox One...or PS4 but isn't that one more restrictive?)",
        "created_utc": 1512416869,
        "upvote_ratio": ""
    },
    {
        "title": "Arkham Knight is the most cinematic game I've ever played",
        "author": "SpookyLlama",
        "url": "https://www.reddit.com/r/truegaming/comments/7him74/arkham_knight_is_the_most_cinematic_game_ive_ever/",
        "text": "I can think of plenty of games that I have enjoyed due to their cinematic quality, but one of them always stood out to me.  Batman: Arkham Knight.\n\nSPOILERS SPOILERS SPOILERS \n\nI didn't play Arkham Asylum but I am aware of how they used the fear gas element to distort in game events.  But I think that Arkham Knight took these techniques to the next level, and some of the scenes completely blew my mind.  I'll give a few examples and why I think they were so effective.\n\nThe first one that comes to mind is early in the game, when Batman is moving the canisters in Ace Chemicals, and Joker appears just as he turned around.  Legitimately scared me both times I played through the game, mostly because of the flow between player control and the cutscene.\n\nThe next (and the best imo), is when Batman enters the clocktower in the race to save Barbara Gordon.  Instead of landing where you expect to land, you land in an apartment, which comes out of nowhere.  The scene only starts to develop as you pan the camera, and the room changes every time a piece of it goes out of view.  This is where you get to witness the moment Joker shoots Barbara, complete with the trademark hawaiian shirt from The Killing Joke.  Eventually, you will pan the camera and the clocktower will return to normal.  This is a technique that I have only seen used this well in Arkham Knight, and is super effective at conveying a memory or hallucination, without once taking control away form the player.\n\nThis technique where things change while they aren't in view is used throughout the game, and really gets the idea across that Batman is losing his mind to Joker.  Even throughout the open world of Gotham, Joker will appear on rooftops to speak to Batman, and once he finishes, he will be gone when you next look away.\n\nSorry if this was a bit of a ramble, but just wanted to express my love for these moments in Arkham Knight.  Let me know if there are other games that use techniques like this, because I think they are worth more than any set piece or QTE.",
        "created_utc": 1512406851,
        "upvote_ratio": ""
    },
    {
        "title": "What ever happened to the classic rts genre? I always ask this but I feel like no one has really ever answered why it just suddenly disappeared.",
        "author": "alienccccombobreaker",
        "url": "https://www.reddit.com/r/truegaming/comments/7hih94/what_ever_happened_to_the_classic_rts_genre_i/",
        "text": "I am sure everybody in here remembers the classic rts genre but what ever happened to it.. it was so big in the early 2000s from its roots in the mid to late 90s and then all of a sudden poof it was gone like a breath of fresh air.. and it really hasn't returned since yet.\n\nJust to clarify I am talking about your standard base building rts game where you create units out of buildings then combine your forces and make strategic plays.\n\nIt can be even semi simulated like the majesty series or full manual say like command and conquer or dark reign or kknd.\n\nI honestly haven't heard much in this genre besides the annihilation series, ashes of the singularity and maybe grey goo.. and a few other medieval and ancient warfare aoe clones.\n\nZero medieval fantasy though.",
        "created_utc": 1512405588,
        "upvote_ratio": ""
    },
    {
        "title": "Can games tell unique, impactful stories outside of metannaratives?",
        "author": "ThatPersonGu",
        "url": "https://www.reddit.com/r/truegaming/comments/7hhtdp/can_games_tell_unique_impactful_stories_outside/",
        "text": "Okay, so yesterday a thread popped up here [discussing games that tell stories not possible in any other medium](https://www.reddit.com/r/truegaming/comments/7h5280/do_you_know_of_a_game_that_yold_its_story_better/?st=jasaz6e8&amp;sh=6cdea190). A lot of the usual picks, a la Bioshock, Spec Ops, Portal, Undertale, etc. etc. But they all seem to rely on very similar elements, albeit with certain differences. Treating the player as a character and using the restrictions of video games as a medium (namely the illusion of choice) in order to get the player to connect emotionally to the events in the story. Now, don't get me wrong, all these games are stellar, truly outstanding achievements in storytelling. \n\nBut is this all games can tell? I won't go far into deciding whether metanarrative is an inherent good or bad, but I do think it is interesting that a lot of these popular narrative-heavy games are popular because of the way they play with expectations, subversion, and in some cases directly interact with the player's experience. They all tend to treat the player as a character, either giving them choices within the narrative or playing with the inevitable restrictions of said choices. And yeah, sure, irony and postmodernism have been hip for decades, it's natural that those elements bleed into such a young medium, but it feels like most renowned stories in games either take one of three routes: Try to directly ape film/television (especially Hollywood), give the player agency, or comment on the player's lack of agency. \n\nI guess, to put it other words, can games tell linear narratives in unique ways? Can you get the player personally invested in a story without directly involving them in it, or will it always seem like a lesser form of other mediums?",
        "created_utc": 1512399570,
        "upvote_ratio": ""
    },
    {
        "title": "Did anyone else find the beginning story of wolfenstein 2 incredibly lazy?",
        "author": "Luminous_Fantasy",
        "url": "https://www.reddit.com/r/truegaming/comments/7hh6ep/did_anyone_else_find_the_beginning_story_of/",
        "text": "[removed]",
        "created_utc": 1512392658,
        "upvote_ratio": ""
    },
    {
        "title": "How To Play Like Shroud Pubg Edition",
        "author": "surat2000",
        "url": "https://www.reddit.com/r/truegaming/comments/7hg54u/how_to_play_like_shroud_pubg_edition/",
        "text": "[removed]",
        "created_utc": 1512377395,
        "upvote_ratio": ""
    },
    {
        "title": "I need tips/advice please 🙏🏼",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7hes66/i_need_tipsadvice_please/",
        "text": "[deleted]",
        "created_utc": 1512359236,
        "upvote_ratio": ""
    },
    {
        "title": "Guys, help me decide, should i buy a ps3?",
        "author": "the-aero-naut",
        "url": "https://www.reddit.com/r/truegaming/comments/7heh8c/guys_help_me_decide_should_i_buy_a_ps3/",
        "text": "[removed]",
        "created_utc": 1512355960,
        "upvote_ratio": ""
    },
    {
        "title": "Why do they even bother having combat at all in RPGs where you heal after every battle?",
        "author": "hyperknees91",
        "url": "https://www.reddit.com/r/truegaming/comments/7he9bz/why_do_they_even_bother_having_combat_at_all_in/",
        "text": "That aren't strategy rpgs? Like literally they become just incredibly crappy strategy rpgs because every fight is an independent affair with no relation to the wear and tear of your characters. Thus normal battles in these games become pointless and are literally there just for busy work. Wild Arms 4&amp;5 I think realized this and they just gave you the option to flat out turn the battles off (Which I did mind you). \n\nIt's already bad enough when FPS's do this, but rpgs that do this are equally mind boggling. Might as well trim the fat all together and just have boss fights. You're never going to have interesting short encounters where the designer has to plan for the player to have full hp/mp in every battle. I get that most rpgs are poorly balanced and designed and don't offer much depth, but this is just a lazy fix to the problem of players just constantly going to the menu and abusing their limitless healing items/mp.  \n\nAs much as I complain about P5, at the very least it doesn't do this. Can you imagine how lame this game would have been if that were the case? Actually I have to give P5 credit (at least early P5). Because it gives player incentive to not just go back and restock, else they end up wasting a day. Perhaps more RPGs can figure out a mechanic such as this (BOF:V also figured out a solution to the typical problem). ",
        "created_utc": 1512353593,
        "upvote_ratio": ""
    },
    {
        "title": "You guys always do 100% Achievements?",
        "author": "arries93",
        "url": "https://www.reddit.com/r/truegaming/comments/7hdz9r/you_guys_always_do_100_achievements/",
        "text": "To me, Never.\n\nI rarely do play one game several times.\n\nbut Being 100% is an another level. they need to play over and over like 3~4 times.\n\nBeating game in higher difficulty or collecting clams are boring to me.\n\nAre you 100% guy? and do you think it is better way to play same game over and over?",
        "created_utc": 1512350722,
        "upvote_ratio": ""
    },
    {
        "title": "Hating MGS 5, the new fashion statement?",
        "author": "gameoftheories",
        "url": "https://www.reddit.com/r/truegaming/comments/7hd7o3/hating_mgs_5_the_new_fashion_statement/",
        "text": "Lets talk MGS 5 TPP. \n\nThis game is super polarizing. \n\nI see three main camps.\n\n-There are the story purists, who always thought of MGS as a story first series and dislike the game because it has very little narrative. I get that.\n\n-Next there are the advocates who think that MGS V takes the systematic possibilities hinted at by previous games and brings them to their logical conclusion--making you the tactical espionage operative the game always promised you could be. To them, MGS V is a flawed masterpiece. I fall in this camp.\n\n-Finally their are those who dislike the game because they think the gameplay doesn't achieve its goals in some sense. \n\nWriting on Game's just put out an hour long video about this, essentially arguing that game rewards the least interesting style of play (tranq + fulton + supply drop, repeat) rendering the experience of MGS the most restrictive in the series. \n\nWhat do you think?",
        "created_utc": 1512343013,
        "upvote_ratio": ""
    },
    {
        "title": "Kirby and the Crystal Shards on N64 is my favorite Kirby game | Which one is your favorite?",
        "author": "NBASwissCheeseD",
        "url": "https://www.reddit.com/r/truegaming/comments/7hbx17/kirby_and_the_crystal_shards_on_n64_is_my/",
        "text": "[removed]",
        "created_utc": 1512331109,
        "upvote_ratio": ""
    },
    {
        "title": "Pixel Art Animation: How much it costs? Where can I find artists (portfolios)?",
        "author": "Guesswhat7",
        "url": "https://www.reddit.com/r/truegaming/comments/7hbpku/pixel_art_animation_how_much_it_costs_where_can_i/",
        "text": "I love pixel art. I am designing a game and I want it to have pixel graphics. \n\nFor that, I want to know how much I should be prepared to spend and where I can find artists for that. It would be simple repetitive animations (And not many of them at start).\n\nSo, you guys know something to share with me? \n\nHere some examples of what I want: \n\n[Image 1](https://i.pinimg.com/564x/56/68/d5/5668d567a4f28f96073cb81c662ab43f.jpg)\n\n[Image 2](https://i.pinimg.com/564x/91/56/01/915601cee7c6ed7796cefe6b17e93e65.jpg)\n\n[Image 3](https://i.pinimg.com/564x/ef/d1/64/efd1641c00dff597ca971593ca62126f.jpg)\n\n[Animated example](https://i.pinimg.com/originals/a3/f2/89/a3f28972e5f8ca5cf2f6f9891e4b9f81.gif)\n\n[Animated example 2](https://i.pinimg.com/originals/4c/bc/f8/4cbcf8c425b206baae947a0d24ff99fc.gif)\n",
        "created_utc": 1512329257,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on COD as an esport (gameplay type, production style)",
        "author": "almundane",
        "url": "https://www.reddit.com/r/truegaming/comments/7hax23/thoughts_on_cod_as_an_esport_gameplay_type/",
        "text": "[removed]",
        "created_utc": 1512322064,
        "upvote_ratio": ""
    },
    {
        "title": "Kotaku: In Game Purchases Poison The Well",
        "author": "CherryPhosphate",
        "url": "https://www.reddit.com/r/truegaming/comments/7ha4a1/kotaku_in_game_purchases_poison_the_well/",
        "text": "Article: https://kotaku.com/in-game-purchases-poison-the-well-1820844066\n\nThis is a short andsimple dissection of how the imposition of microtransactions can undermine the all-important trust between player &amp; designer. \n\n",
        "created_utc": 1512313916,
        "upvote_ratio": ""
    },
    {
        "title": "Can video game escapism ever lead to something more productive?",
        "author": "Zhieyen",
        "url": "https://www.reddit.com/r/truegaming/comments/7h9gey/can_video_game_escapism_ever_lead_to_something/",
        "text": "I've been playing video games to escape my entire life: from my faulty childhood, lonely teens, and now my twenties. Also, I'm at the age where it's time to start a career, and through my research and exploration, I realized that I have wasted so much time playing video games when I could have doing something else more productive.\n\nPersonally, there was no inherent goal in mind when gaming; it was just something that felt good and made everything easier rather like a psychedelic drug. So, whenever things stopped being pleasant, whether it be because of video game tolerance, anhedonia, team play, etc., I transitioned to something else usually something new and refreshing. This included activities that could have been somewhat productive such as making connections online or analyzing gameplay &amp; producing content (severe social anxiety prohibited both).\n\nIn retrospect, if I had the mindset of being productive with a future goal present in my head, then even if all I did was play video games, I could've made something out of it. E-sports is such a booming industry, and the game that really exponentiation its growth was League of Legends, a game which has its own independent multi-billion dollar industry with opportunities all over the place. if I had just tweaked my mindset, all the hours I dumped into this game could have amounted to something in the end. I had the skill, the aptitude, the advantage of being young, the lack of competition because of a brand new industry, etc. \n\n\n\n\n\nAs I was writing this, I realized that I answered my own question, but I still feel inclined to post anyway and share.\n\n",
        "created_utc": 1512305005,
        "upvote_ratio": ""
    },
    {
        "title": "The Mario games have a save problem (Difficulty design in platformers and the role of lives)",
        "author": "Cipher_-",
        "url": "https://www.reddit.com/r/truegaming/comments/7h95qq/the_mario_games_have_a_save_problem_difficulty/",
        "text": "I recently took a trip back through three Mario games more or less at once, playing them on and off at intervals. For the first time ever, as a recent Wii U owner, I took a trip through *New Super Luigi U* (and bits of the base game *Super Mario Bros. U* alongside it), replayed all 96 exits of *Super Mario World* for the first time in ten-plus years, and took a night to do a no-warp run of *Super Mario Bros. 2* JPN, undoubtedly my favorite in the series, and a game I'm at this point pretty familiar with.\n\nThis is a post about Mario, but it's also a post about what the trajectory of Mario games means for difficulty design in platformers as a whole, and any discussion that flows from there.\n\nThe thing that keeps me coming back to a game like *Super Mario Bros. 2* JPN, and this stuck out in particular during this accidental comparison, is that it offers a consistent marathon challenge. That is, the game is structured like this: You get three lives per game, plus whatever 1-Ups you can earn, and progress is maintained every four levels. (If you get a game over, you go back to the beginning of the four-level world.) \n\nAs far as I know, there are really two options in terms of designing difficulty in a Mario game: One is to design singular levels requiring so much precision or endurance they become difficult to simply complete once. The other is to limit player resources and demand consistency over a longer stretch. *Super Mario Bros. 2* takes the latter approach, giving you three lives to get through four hard (but not insane) levels.\n\nThere are a plenty of fan creations I can turn to go get difficulty in line with the former design. There are relatively few that embrace the latter. \n\nAnd I wonder why that is. I'd love to see more, either from the community or from Nintendo itself. What's really interesting to me, though, is that there don't seem to be a lot of modern platformers/sidescrollers that embrace that model even outside the series. More on that later.\n\nThe that really struck me about my recent Mario playthroughs is that, opposite to what I expected, Nintendo is still plenty capable of working difficult level design into their post-NES titles. In both my *Mario Bros. U* and *Mario World* playthroughs, I encountered level design and even stretches of levels that risked sending me to multiple game overs. That is, if you ignore everything else the game hands you.\n\nThe issue is that the games have a save problem. Beyond that, they also have a generosity problem, but I think the more fundamental issue is the save system.\n\nLet's look at one of the hardest two-level stretches in *Mario World*: \"Way Cool\" and \"Awesome\" in the Special World. These levels genuinely bare fangs; I was surprised to realize there were seeds of inspiration for some of T. Takamoto's *Kaizo Mario* levels here. Together, they make a fun challenge, and they're nominally structured to require the player to go through the two of them in a single continue before the next save prompt arrives. (I forced myself to play them this way and had a good time.)\n\nBut you don't have to play that way, and frankly, you have to impose restrictions on yourself as a player to bring the challenge in line with what the game's save system seems to expect you to do. Because you can go to any earlier, easier save-point-enabled level in between each and pop a quick save. You can bring items in. You can farm 1-Ups. (Both levels also bafflingly hand the player an easy way out, almost like apologizing for daring to be challenging for a moment, but let's pretend they didn't back off from their own difficulty for the sake of argument.)  The result is a game set up as something where stretches of consistency seem to be the way it wants to achieve its challenge—much like earlier titles, saves are only offered every four or so stages on the map—but the fact that you can move anywhere and retreat to earlier levels for saves and item-collecting means any semblance of challenge has to come, instead, from the hurdle of an individual level. None are remotely up to that task. Rather than scrapping for everything the game gives you, actually having to take risks for more resources, which the game still tries to present to you as if they have consequence, you have to actively impose self-limitations in order for the game to function as many of its aspects seem to imply it should.\n\nThis issue is also present in all of the *New Super Mario Bros.* games. *New Super Luigi U* indeed offers challenging level design, but the fact that you can back off to earlier saves and the fact the game showers you in 1-Ups renders it all moot. You're never in danger of facing the threat of, or threat from, a game over, and the levels are only a challenge in stretches. (In the core *NSMB* games, the fact that the difficulty is also intended to be shifted onto optional coin collecting exacerbates these issues, as coin collecting also needn't be done in one stretch; after reaching the end with one coin, you can hop out and save at any previous level, grabbing them piecemeal and reducing any non-self-imposed danger. And again, infinite 1-Up showers.) The game is nominally designed to be played in four-or-so-level stretches exactly the way *Super Mario World* is, but since you can retreat to earlier saves, or save any time after beating the final boss, after which the player is likely to be continuing with the collection challenges intended to present an optional difficulty increase, all of it is inconsequential. It essentially pushes the game's difficulty model toward that single-level hurdle model, and none even come close to putting up that much resistance on their own. There actually are levels here you can sink your teeth into, but any real hurdles have to be player-imposed.\n\nThe crazy thing, of course, is that the level design is there. All Nintendo would need to do to make a Mario game challenging for platformer-literate players again would be to actually stick to the restrictions imposed by a stricter save system, and reduce player resources a bit. Not everything needs to be as hard or gamer-oriented as *SMB 2*, which is in the upper echelons of NES-hard and absolutely sacrifices accessibility, but certainly that could be there as an option, or simply a way to bring the latter games' own design elements more in line with themselves. As it stands, they're a weird mass of contradictions.\n\nAll this got me thinking about other modern platformers. So let's look at one infamous for being \"hard\" and see how it achieves its challenge: *Super Meat Boy* certainly opts for the model of single-level challenge rather than marathon-resource management, and I think that might be a weakness if not for some of its other design choices. Because, infamously \"hard\" as it is, completing its basic levels really isn't going to be a sweat for anyone literate in platformers (and I think that's an appropriate word to use here; non-beginners, which is its intended audience). With infinite tries, none of its basic, light-world levels present the level of precision-challenge such that most non-beginner players won't finish them with minimal hurdles. As a way of balancing this, and I'm thankful for this, the game does demand consistency similar to the lives-and-worlds models of older platformers by demanding par times be met for its better ending. That's a good compromise. (It also offers some Herculean challenges in both single-level difficulty and marathon difficulty in its special levels and achievements, but those are beyond the realm of normal play/challenge I want to get at here.) But the times I most enjoy it, and when it feels like it really offers resistance? Its optional \"bandaid\" missions, which spread the difficulty out over a series of three or so smaller \"stages,\" and give the player a limited set of attempts, just like games of old.\n\nWhy do we not have games fully embracing this then? I can't think of a modern platformer that actually really goes for a lives-per-world model and mines its challenge from it. Are we so afraid of making people replay stages for more consistency? Indie titles seem to have moved away from it, and the Mario games, while confusingly keeping its trappings, functionally have for twenty-five years. Granted, it takes some considerate level design to avoid tedium—*SMB 2*'s near-perfect nailing of this balance is what ranks it so highly for me, and that's a whole separate post—but I'm not in love with the results of just giving up on it either. This moves everything over to single-level challenges, but—honestly, not only do I not find those as fun or satisfying—unless they're ramped up to a level of insanity most people will never touch, they remove any real challenge unless tempered well with other elements to demand consistency.\n\nHow do you feel about difficulty design in platformers? Should it come from individual stages, or from resource management over a series of stages? Why have we so wholly moved away from the latter model, what games would benefit from it, and are there any modern gems that embrace it that I've missed? \n\nAny other thoughts spinning off from the topic are, of course, welcome. Feel free to disagree too. This all wound up being a little scattershot, but without taking the time to make it into a proper essay, hopefully some of the sentiment got through.",
        "created_utc": 1512299779,
        "upvote_ratio": ""
    },
    {
        "title": "Which stealth game does difficulty properly?",
        "author": "mithrillion",
        "url": "https://www.reddit.com/r/truegaming/comments/7h8e95/which_stealth_game_does_difficulty_properly/",
        "text": "I played a few stealth games in recent years and found that they are much more challenging to tweak difficulties for than straight shooters or action games. Many games, despite their strengths in other aspects, do not have a well-balanced or meaningful difficulty system. The biggest challenge is that the normal enemy HP : player HP ratio does not work if you play the game and intended, and simple number shuffling only works if you decide to go gunslinger mode which is usually discouraged in the first place. You cannot make enemies who can be stealthily taken down have more HP so you need to choke them out twice (??) cause that would completely change how the game is to be played. You have to actually increase the difficulty of stealth play, which requires more thought than simply making targets harder to kill. I find that many games with optional \"Rambo\" paths lacking in this aspect.\n\nHere are some games I've played:\n\nAssassin's Creed: Origins - not really a stealth game, although stealth is a very visible option and gives the most exp. Difficulty does nothing for stealth play, as enemy behaviors are completely the same and you one-shot everyone regardless. This is forgiveable for a game with action roots, but as an \"assassin\" game, this is a bit disappointing.\n\nDeus Ex: Human Revolution - great game, but again difficulty only affects brute-forcing. There is indeed an energy bar limit on hardest difficulty, which affects how often you can use abilities and how long a combo can you pull off, but there are plenty of energy items in game for most of the critical situation. Enemy AI does not seem to be affected.\n\nDishonored - difficulty affects detection, enemy alertness and power use frequency. This seems to have the most meaningful difficulty settings so far.\n\nAnd lastly, just for fun. Skyrim - higher difficulty completely breaks stealth play until you get the 15x damage and higher tier weapons because the difficulty is not balanced around stealth at all.\n\nI'd like to know how other games handle stealth difficulty, and what your guys think of their approaches. Are there any truly brilliant solutions?",
        "created_utc": 1512285379,
        "upvote_ratio": ""
    },
    {
        "title": "I want to talk about David Cage (Beyond Two Souls, Heavy Rain, etc)",
        "author": "appleparkfive",
        "url": "https://www.reddit.com/r/truegaming/comments/7h86m7/i_want_to_talk_about_david_cage_beyond_two_souls/",
        "text": "Man. I need to talk about this. \n\nNever has one writer gone from something so insanely so-bad-its-good to actually improving over every game like David Cage. Seriously, every game has been better than the last. But, that's not saying much, because the first ones are basically video game's versions of The Room.\n\nI know I'll probably offend some Fahrenheit fans, but just know this is my opinion. And some might not agree on the order.\n\nIn order. Both chronologically and from worst to best:\nOmikron: Just absolutely terrible, with its David Bowie original soundtrack and confusing everything. Worst game pretty easily. Just feels very campy and shallow. Unintentionally funny.\n\nIndigo Prophecy / Fahrenheit: I have never seen a game fall apart so spectacularly. What started with an interesting premise turned into the most amazing Matrix rip off I've ever seen. Bad, but I can see SOME interesting ideas. [Watch this little bit of the game. Tell me it's not hilariously bad. From the Jesse Cox playthrough](https://youtu.be/XrrOWVWAMUo?t=3m16s) The action sequences are essentially Simon Says, and they happen during the most inconvenient times, like during plot points and the important dialogue.\n\nHeavy Rain: I like this game overall. This is the first one I'd consider interesting enough as a story, even though there's major flaws and plot holes. But there's enough interesting stuff there to understand why its so big. The art design is great, and it really probably had a big effect on big budget games in terms of what a story can be in a bigger game. Its popularity shows that a game can be just gestures and walking around and still sell well as a bigger title. Voice acting was a bit stiff and some usual writing issues, but it was still immersive enough to really enjoy.\n\nBeyond Two Souls: Again, major problems, but still an interesting and unique game. Ellen Page does well in it given the material, as does Willem Dafoe. IT really does some intersting things. The action controls are greatly improved. The voice acting is really great, the acting is great. I actually liked the broken up story out of order. It probably helped it feel more fluid over all. As usual, it sort of breaks down towards the end, but it still kept itself going better than the past games, in my opinion. \n\nNow his next project.\n\nDetroit: Become Human. Looks legitimately good and interesting, stellar art and graphics, and an interesting premise. I can see this being the first truly great game in his career. [Here is a trailer](https://www.youtube.com/watch?v=YtPmIBqRwQU)\n\nI'm just so confused, It's like Tommy Wiseau kept making movies and slowly became a quality filmmaker. I see the same thing in all of his games though. They devolve into weird generic action films at the end, always starting pretty strong.\n\nThe reason I bring this up is that I just watched Jesse Cox play Fahrenheit, and it has to be the absolute most hilarious thing I've seen in a long time. I'm really perplexed why people think its a classic. By the end, it becomes something a 12 year old wrote, even when starting so strong. It literally devolves into the character basically becoming Neo in every way. And the protagonist makes NO sense. If you want a good laugh, watch Cox's Lets Play.\n\nI'm watching Omikron now, and it's somehow worse, but not in the watch it to laugh way.\n\nSo, I don't know. David Cage is fascinating to me now. To go from so unbelievably bad to Detroit: Become Human is nothing short of a miracle. I can't be the only one fascinated by this guy.",
        "created_utc": 1512281946,
        "upvote_ratio": ""
    },
    {
        "title": "Are subscription models obsolete or has the bar been raised?",
        "author": "anomabus",
        "url": "https://www.reddit.com/r/truegaming/comments/7h82fy/are_subscription_models_obsolete_or_has_the_bar/",
        "text": "Micro-transactions have become the hot-button debate, everyone is aware of this now.  While I agree that some single-player games should sell more game instead of loot-boxes or mods, long-term multiplayer games are iffy.  MMOs and competitive games need a more sustained source of income for upkeep and new content, but do they HAVE to use micro-transactions?\n\nWoW used the subscription model, as did plenty of other games before it.  But lately, games like Wildstar and Elder Scrolls Online have nearly flopped with this model, as did many others.  But ESO is now doing better with the microtransaction model and GW2 is still a strong contender despite never having a sub.  \n\nHowever, I expect there may be another explanation.  FF14 is doing pretty well still with a sub model, but only after they overhauled the game.  Perhaps the subscription model is still viable, but only if the games are vastly improved over their predecessors.  Right now, you can purchase GW2 and get all kinds of content, or just play a large portion of it for free.  It's a similar deal with ESO, Destiny 2, Overwatch, and plenty of F2P games (To varying degrees).  There are good games out there that don't charge you per the month.  \n\nSo I'm curious.  Are microtransactions really the only way to fund a persistent multiplayer game?  Or can subscription games increase in quality enough to be a great value proposition?",
        "created_utc": 1512280261,
        "upvote_ratio": ""
    },
    {
        "title": "If Napoleon Bonaparte and Alexander the Great were brought back to life, how well would they be at Starcraft?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7h772o/if_napoleon_bonaparte_and_alexander_the_great/",
        "text": "[deleted]",
        "created_utc": 1512269163,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone know a good survival, online game? For ps4",
        "author": "McFlurryMedBrus",
        "url": "https://www.reddit.com/r/truegaming/comments/7h6taj/anyone_know_a_good_survival_online_game_for_ps4/",
        "text": "[removed]",
        "created_utc": 1512264775,
        "upvote_ratio": ""
    },
    {
        "title": "Doki Doki Literature Club taught me that sometimes it‘s okay to walk away.",
        "author": "PrincessMagnificent",
        "url": "https://www.reddit.com/r/DDLC/comments/7h56zs/longunfunny_ddlc_taught_me_that_sometimes_its/",
        "text": "",
        "created_utc": 1512248701,
        "upvote_ratio": ""
    },
    {
        "title": "Do you know of a game that yold its story better than any other medium could have?",
        "author": "AkiMatti",
        "url": "https://www.reddit.com/r/truegaming/comments/7h5280/do_you_know_of_a_game_that_yold_its_story_better/",
        "text": "I'm looking fojr suggestions since I would lke to think games have potential for greatness through interactivity. ",
        "created_utc": 1512246617,
        "upvote_ratio": ""
    },
    {
        "title": "Is FF15 worth another go around?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7h4o9c/is_ff15_worth_another_go_around/",
        "text": "[deleted]",
        "created_utc": 1512242864,
        "upvote_ratio": ""
    },
    {
        "title": "Older Article on Gaming and Mainstream Culture",
        "author": "matayhass",
        "url": "https://www.reddit.com/r/truegaming/comments/7h4js0/older_article_on_gaming_and_mainstream_culture/",
        "text": "[The Impact of Video Games on Culture](http://open.lib.umn.edu/mediaandculture/chapter/10-4-the-impact-of-video-games-on-culture/)\n\nLately, I've been interested in video games as an art form and how the lessons we learn from playing games impact the culture at large. I found this article while digging around online and thought that this would be a good place to share it. This is a budding interest for me. I'd love to hear more thoughts and opinions on the topic. Cheers!",
        "created_utc": 1512241679,
        "upvote_ratio": ""
    },
    {
        "title": "Petition to remove EAs Star Wars license",
        "author": "GardHaakonsen",
        "url": "https://www.reddit.com/r/truegaming/comments/7h4dk6/petition_to_remove_eas_star_wars_license/",
        "text": "[removed]",
        "created_utc": 1512240079,
        "upvote_ratio": ""
    },
    {
        "title": "Why did the CoD series lose it's massive popularity it once had?",
        "author": "CisumStraeh",
        "url": "https://www.reddit.com/r/truegaming/comments/7h48re/why_did_the_cod_series_lose_its_massive/",
        "text": "No doubt CoD is still one(if not THE)of the top selling games every year. Still very popular worldwide and a staple in modern gaming. \n\nBut what happened to its insane popularity of 2009-2013? I remember almost everybody played it. It was all any casual-regular gamer talked about for better or worse,it was much bigger in pop culture,and had a hell of a lot more traction back then. \n\nWas it the decline starting with Ghosts?\n\nDid more MP games become available and it gained more competition? Games like OW/RB6/GTA5:O/BF1,etc. Are titles in recent years I feel might have taken A LOT of previous CoD fans.\n\nOr did the series just catch \"lightning in a bottle\" for a few years before coming back to a more reasonable popularity?\n\nI'm a COD fan,played all of them except Ghosts since 2009 and I didn't play AW in it's year, I mainly quit between Ghosts-AW returning for BO3 and the past few years I've always felt it hasn't felt the same community/gaming industry wise since at least 2012.\n\n I feel back then it was a much bigger deal than now, and I'm wondering if anyone feels the same or would like to express their thoughts?",
        "created_utc": 1512238839,
        "upvote_ratio": ""
    },
    {
        "title": "How do you critically analyse a game?",
        "author": "bluo100",
        "url": "https://www.reddit.com/r/truegaming/comments/7h240p/how_do_you_critically_analyse_a_game/",
        "text": "Hey guys! I've been thinking and reading into literary analysis for a class I'm taking and the thought struck me that while literature, movies etc have whole frameworks for analysing their meanings, themes, topics and tones for critical analysis works like essays, commentaries and such when it comes to games there really isn't a proper set of frameworks that actually compares. \n\nWhen being taught about how to analyse literature you are usually taught to look for a certain set of things: Topic(s) and theme(s) being discussed, and how the literary devices of the piece serve to reinforce the theme(s). You can then construct say an essay by finding an angle to examine the work from and discuss the different elements of how each literary device and example aids the theme. This is something taught in pretty much any high school English class and the insight into the works that it has provided has allowed the medium of literature to grow incredibly in quality and ideas. The same can be said of film as well, wherein the device of cinematography is introduced as a additional device to convey theme.\n\nIn *games* however there isn't exactly an equivalent concept. There are no defined \"game literary devices\" or anything of that sort and often times when people try to analyse games from a narrativist viewpoint it is done so pertaining to traditional literary devices that while may on the surface appear to be working towards the intended theme, are often contradicted by a set of gameplay aesthetics that frame the tone of the game in a different manner. \n\nWhat's more, many games do not even set out with a narrative, let alone theme or tone in mind, so how does one generalise such a concept to encompass the entire all types of games? Is theme and tone even a universal concept for games, and how would one go about creating a framework for critical analysis of games that is broad enough to allow people to find deeper meaning in games without trying to strangle it out if you understand what I mean. : / \n\nThis is a concept that I've been musing over for quite some time now as I think if we want this medium to grow to stand by film and literature and truly have artistic potential we need to be able to see and understand how a game can convey such themes. What are your opinions on this topic? How does one critically analyse games for thematic value or is it something that isn't worth doing at all?\n\nThanks!\n\nTL:DR: Film/ Literature have frameworks/devices under which we can do critical analysis but games lack such a framework. How do we make one or would it be too specific an idea as to be useful for games overall?",
        "created_utc": 1512213013,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about people watching a full walkthrough of a game instead of playing it?",
        "author": "TOFAS89",
        "url": "https://www.reddit.com/r/truegaming/comments/7h11u5/how_do_you_feel_about_people_watching_a_full/",
        "text": "A bit of a \"gatekeeping\" post i guess. But what are people missing when they watch a game instead of playing it? Would you do this? I used to have a hard time talking about a game with a person who knows all about the game, the story, the game play, the problems with it etc only to find out he has never played it but basically youtubed the whole experience. But now as i rethink this mindset of mine, there might not be anything wrong with watching uncharted 1,2,3 and not playing them in order to fully enjoy uncharted 4's play through. What are your thoughts on the subject?",
        "created_utc": 1512194832,
        "upvote_ratio": ""
    },
    {
        "title": "OLD BUT GOLD.",
        "author": "Ganjaalex",
        "url": "https://www.reddit.com/r/truegaming/comments/7h0idw/old_but_gold/",
        "text": "[removed]",
        "created_utc": 1512187536,
        "upvote_ratio": ""
    },
    {
        "title": "What's your favourite single sitting game? That is, a game that takes one sitting to complete.",
        "author": "mrdinosaur",
        "url": "https://www.reddit.com/r/truegaming/comments/7gxvi9/whats_your_favourite_single_sitting_game_that_is/",
        "text": "[removed]",
        "created_utc": 1512160651,
        "upvote_ratio": ""
    },
    {
        "title": "Tom Clancy's Rainbow Six Siege Montage!!",
        "author": "twiz91",
        "url": "https://www.reddit.com/r/truegaming/comments/7gwwm0/tom_clancys_rainbow_six_siege_montage/",
        "text": "[removed]",
        "created_utc": 1512152509,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there no true open world games?",
        "author": "Sabrovitch",
        "url": "https://www.reddit.com/r/truegaming/comments/7gu06c/why_are_there_no_true_open_world_games/",
        "text": "So this might seem to be a weird title, or a contrived one at best. I understand that, but I wanted to make a point. \nThere is such a thing as a sense of marvel and wonder through discovery. Who hasn't been awed when they explored nature and stumbled upon something of interest? You spend hours hiking, and you saw plenty of pretty things, but only one very special thing. You spent hours getting there, to see this single thing, and, well, the trip makes it. If you could see directly, there would be no awe. The trip makes the experience. This is something lots of us can relate to, and yet, has any game come close to this feeling? Or, rather, has there been a real vast open world game that captures this feeling?\n\nI've got some examples that really try to represent the sheer size of a true world - Fallout 1&amp;2  Arcanum have a huge world, but you cheat by fast travelling everywhere. But they are exceptions. There is such a thing as a too crowded open world, and that's exactly what happens in mainstream open world rpgs - Skyrim, Fallout 4, The Witcher 3 (yes, I so dare to criticize it) are too crowded, to varying levels, too small and their worlds don't feel real (The Witcher 3 is of course less victim to this, but still, there are a loot of repetitive quests that don't really add anything and detract you from the immersion.) \nMost open world adventure games fit in the same category (Horizon say.)\nSo where are the games where you can't fast travel, where you have to plan every trip, and that thus makes it worth it?\nThe most mainstream ones I can think of are Minecraft, Elite: Dangerous and Zelda:BOTW. I can't really speak for BOTW as I haven't played it, but Minecraft and Elite offer huge worlds. Yet, they lack what makes games interesting as they are in the complete opposite direction; their huge worlds are only that, huge, and the 100% procedurally generated content doesn't make it super worth it. Why isn't there such a thing as a hand-crafted yet big open world? Hand-crafted quests, but disseminated  in a clever manner, not a crowded one.\nI think I've ever really felt like I was taking on a journey in a game in one; and that game is STALKER. The world is dangerous and, albeit not very big, every trip being so dangerous makes them a journey. And you don't get assaulted by a compass that tells you what you can do, you only are trying to survive in this hostile yet beautiful panorama. So why is it that a FPS that is barely open world be the best candidate to \"immersive open-world RPG\"?\nI shall put a note that Dark Souls I has this same feeling in some ways, but it is also barely open.\nWhy is it so hard for game companies to try to recreate this feeling? I understand that of course this kind of experience is demanding, and most players don't want to spend 30 minutes just to travel to get to a quest. Yet, when games try those kinds of content, they can be the best thing ever, if you're willing to put the time into it.\nSo here is the question, why are there no \"true\" open world games?\n\n\n\nBut maybe there are games of this kind that I've managed to completely avoid during my gaming years. I hope so, that'd be an amazing thing to discover.",
        "created_utc": 1512121143,
        "upvote_ratio": ""
    },
    {
        "title": "Has 2017 Really Been one of the \"Best Years of Gaming?\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7gsx49/has_2017_really_been_one_of_the_best_years_of/",
        "text": "[deleted]",
        "created_utc": 1512106104,
        "upvote_ratio": ""
    },
    {
        "title": "I feel like the issue with video game movies being mostly all bad is obvious, and 'easy' to fix",
        "author": "temporarycreature",
        "url": "https://www.reddit.com/r/truegaming/comments/7gswzf/i_feel_like_the_issue_with_video_game_movies/",
        "text": "I don't know if this is the place for this. Figured this audience is the ones that hope we get a good video game movie one day. \n\nThere have been many video game movies made, and for the most part they have all been underwhelming. Everyone says it's hard to make a good video game inspired movie, and I'm not so sure that is true. Out of all of these underwhelming, or otherwise failures, none of them were direct frame for frame of the actual video game story. They always spin some new story using the key points of the game's story. \n\nI guess I'm just thinking it's a bit weird that we have all these failures at the box office, but all of them had stories inspired by the games. Why doesn't someone just do this? ",
        "created_utc": 1512106067,
        "upvote_ratio": ""
    },
    {
        "title": "Need a WW2 Clan!? If so read this!",
        "author": "GalaxyVibezzz",
        "url": "https://www.reddit.com/r/truegaming/comments/7grcsd/need_a_ww2_clan_if_so_read_this/",
        "text": "[removed]",
        "created_utc": 1512090734,
        "upvote_ratio": ""
    },
    {
        "title": "Selling games on a *SPOILER* tag, and what they could do differently",
        "author": "Katana314",
        "url": "https://www.reddit.com/r/truegaming/comments/7grbn0/selling_games_on_a_spoiler_tag_and_what_they/",
        "text": "\"DUDE! You HAVE to play JRPG Quest 8!\"  \n\"Really? How is it?\"  \n\"Well, the combat is *okay* I guess and the American voice acting is terrible, and it went open world even though the quest is entirely linear, and it takes like 10 hours to actually get going, and the control prompts and tutorials are really bad, and the PC port sucks, BUT there's a point in the story when [SPOILERZ] (#s \"Okay, there's no actual spoiler here. It's just to demonstrate the point.\") and it BLEW MY MIND!!\"\n\nThis is a problem not relegated to JRPGs, but the issue came up as I was researching certain ones to buy. I was searching and searching for a *gameplay* reason to be invested in these games, and found that overall, there just weren't many salient selling points to these games - not unless you were either a series fan, or you somehow already had some idea of what was going to happen. When the core reason to play a game is story-related, and that story relies on either \"shock moments\" or \"twists\", it becomes really hard to make a 30-second, or even 30-minute, sales pitch on the style of the game.\n\nI've ended up skipping on quite a few games considered \"Must-play masterpieces\" by much of the gaming community, and sadly some of my skips even include \"Underrated tragedies\" that sold poorly and aren't likely to get a sequel. So it's come to the point that I actually have some investment in solving this problem. I also have some idea of how this could be countered.\n\nOne thing that comes as an advantage for gameplay-focused games (to take as an example, Zelda: BOTW, a game whose plot is \"Ganon is bad. Help Zelda!\") is that even if you can't explain what's going to happen in a two hours of sample gameplay, you can describe it in brief. \"This is your big open world. There are shrines, quests, korok seeds, and various secrets!\" Showing a little open-ended fight with some bokoblins will give you a general idea of the appeal of the game. And just seeing the landscape pretty much maps out your opportunity space.\n\nBut, fixing this issue isn't simply a matter of ensuring all good stories have excellent gameplay to them, or by announcing the twists ahead of time. I also play games for story, and have picked up quite a few I thoroughly enjoyed. Why did I make the $60 bet on them?\n\nOne way stories can work is by having a premise that is handed to players directly in marketing. **Ghost Trick**: You're *dead*. You can manipulate objects in the world, and you can even rewind time past someone's death to try to save them. Interesting, right? But the BEST part of the game is when [spoilers] (#s \"Nope, you have to play it for yourself.\"). **Steins;Gate**: The characters inadvertently invent a time machine that can send texts to the past. They learn this when the main character sends a text to his friend after a disappointing lecture on theories of time travel, and the moment he hits send, the crowd around him disappears, and a huge crashed satellite appears on the building behind him. But the BEST part of the game is when [spoilers] (#s \"Something something shower scene.\").\n\nThese early glimpses invite mystery, and set up some premise for the future. It gets players thinking creatively about what will happen next, and perhaps a bit more eager to investigate further by buying the game. On the other hand, something I tend to see in a lot of mysterious fantasy games is opening mysteries that are so nebulous (eg, \"*a black creature materialized from nowhere and swallowed my sister whole! When I tried to chase it I got a piercing headache and collapsed*\") that they invite no intrigue because they're simply so open-ended. They don't have questions like \"Why does nobody remember my grandfather's existence?\" but questions as generic as \"What the hell just happened?\"\n\nTying in with the story very closely is the characters, and this can be a core reason why people buy a game even if their appreciation for the story thus far is limited, [or perhaps the story does not exist at all] (https://www.playoverwatch.com). Overwatch is a great example of selling a game based entirely on character designs/backstories, without even having a solidly defined lore to begin with. It was very important that the Overwatch webpage let people read the full description and origin of each of the game's heroes, since their many designs were what sold people on the game. It's also important that they were so varied. Even though I'm not Indian or religious, having an autistic Indian architect and a robot monk were really cool ideas to me.\n\nAnother way to make stories easier to access is digestability. Some games are about epics that last 80 hours and then some. Some games that rhyme with Ringdom Smarts aren't even FINISHED with their overly long stories yet. Some players may continue to show interest in the core mystery even if it takes a long time. For other consumers though, it's easier to allure people into it when they can more clearly see an opening \"sub-story\" and it follows a process of opening, buildup, conclusion, maybe even with its own small villain, all in the space of a small quarter of their total runtime. Some games that follow this formula include Phoenix Wright, the Project Octopath Traveler demo, Persona 5, Ocarina of Time, and plenty of others.\n\nFinally, there's something to be said about reducing early complexity of a game. I actually think that this works well for both gameplay and story; only very slowly adding new concepts to the player's mental library of the world. Anytime I play a Tolkien RPG these days, I tend to just skip its opening cutscene (oft narrated by an old man) completely, and I feel completely justified in doing so *even* if I care about the story. Generally to keep my mind centered, what I want to know about first is my character and his/her origins; THEN the first area I'll be travelling to, and THEN the broader concept of what's going on in the world and what happened 100 years ago. I actually have a lot of appreciation for openings like Final Fantasy 7, which provide some immediate context and conflict with little subtlety, slowly build as the hours go on, and don't actually even get into the fact that Cloud is an amnesiac until many hours later in the story. An important part of this low early complexity is that it should be appealing without the need for big spoiler tags.\n\nSo, in summary, tips for a story that doesn't need players to just trust the writer knows what they're doing:\n\n- Sell the game on the gameplay, and let story spoilers be a bonus (not always an option, but I still list it first)\n\n- Begin with a simple and direct premise that the game builds off of or even evolves past (eg, \"*Bill Murray wakes up every day and it's still Groundhog Day*\")\n\n- Center early focus on the game's strong variety of interesting and vocal characters; make people want to go on a journey with them, perhaps even base the marketing around them\n\n- Tell a digestible, complete story before the viewer considers leaving, so that they can already see some enjoyment of the writing and world and want to learn about further twists\n\n- Focus the writing on simple, closely related concepts early on to ensure players have context before providing branches into something complex.\n\nI'd also very much like to know in the comments whether people have feedback to these rules, whether other people encounter the same problems around story-based games as I do, or if you believe I'm sorely mistaken in my beliefs or logic around story design. It would also be nice to get examples of games you feel carried these concepts very well, or very poorly.",
        "created_utc": 1512090435,
        "upvote_ratio": ""
    },
    {
        "title": "Monthly /r/truegaming Post Feedback Thread",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/truegaming/comments/7go9tj/monthly_rtruegaming_post_feedback_thread/",
        "text": "Many regular posters here at /r/truegaming may often wonder how to improve their posts to better improve possible discussions, but have been unable to get the feedback they desire in any form besides a downvote. This monthly post is designed for frequent posters of /r/truegaming to receive the feedback they'd like in an organized fashion.\n\nIf you are seeking feedback for your posts, we recommend linking to your threads and explaining your thought process in posting them. Explaining the reasoning behind how you posted may be key to finding out what you did wrong and what can be improved. We also recommend including what type of discussion you wanted to start within your threads, and what you believe your own strengths/weaknesses are as a discussion author. This way, people can gauge how you see yourself and can give feedback appropriately.\n\nIf you would like to give feedback, we emphasize to please be constructive and polite when doing so. This post is designed for posters to learn from their mistakes, and in order to do so, a decently-sized explanation of their mistakes may be needed. Please also consider replying to those who may not have any replies yet, for even the smallest amount of feedback can help discussion authors. ",
        "created_utc": 1512065322,
        "upvote_ratio": ""
    },
    {
        "title": "Let's stop the AAA gaming industry.",
        "author": "TheMemo",
        "url": "https://www.reddit.com/r/truegaming/comments/7gnacg/lets_stop_the_aaa_gaming_industry/",
        "text": "Every morning, on my way to work, I see them; the poor, huddled masses with their cans of beer and cigarettes, waiting desperately for the betting shop to open. They're still there when I come back from work; smoking, pacing, calling for more payday loans on their mobile phones. They don't look as majestic as whales are supposed to.\n\nIt is interesting that the video game community has been marked by the battle between GamerGate and the SJWs, constant petty whining about to whom the game industry should pander. The game industry has its own idea as to its preferred customer base and it's not the GamerGatists or the SJWotsits; it's the people I pass by on my way to work every morning. The industry's interest in you, dear gamer, begins and ends at your susceptibility to be turned into those wretched souls.\n\nI used to love computer games, and I used to scoff at the scaremongering stories of my youth about computer games being used to influence people for sinister ends. I'm not scoffing now, as the leaders of our industry channel The Demon Headmaster, offering us just the chance to buy an Octopus Dare lootbox for a feeling of 'accomplishment and reward.'\n\nSo, here's a new game for us to play: kill the triple-A industry before it turns mainstream computer gaming into just another variation of the Fixed Odds Betting Terminal. Our mission: force every triple-A publisher into bankruptcy within two years. Otherwise, the fair, balanced and winnable games we prefer to play may be relegated only to small indie teams with few resources - the brave few who try to maintain games as art, or at least as *games,* while mainstream publishers continue to devalue our great new medium into nothing more than a slot machine.\n\nAs with the 1983 video games crash, perhaps a better industry can emerge like a phoenix from the flames of our ire. We cannot allow this exploitative industry to continue unscathed, or we will all suffer the consequences...and so will our societies.",
        "created_utc": 1512057436,
        "upvote_ratio": ""
    },
    {
        "title": "Which is harder and why? FTL, Darkest Dungeon, XCOM: Enemy Within,",
        "author": "amnekian",
        "url": "https://www.reddit.com/r/truegaming/comments/7gkzny/which_is_harder_and_why_ftl_darkest_dungeon_xcom/",
        "text": "If possible order these based on their normal difficulty. Then do the same on their hardest settings.",
        "created_utc": 1512031403,
        "upvote_ratio": ""
    },
    {
        "title": "What series concluded gracefully?",
        "author": "mithrillion",
        "url": "https://www.reddit.com/r/truegaming/comments/7gjtua/what_series_concluded_gracefully/",
        "text": "By \"gracefully\" I mean no unnecessary sequels, no cancelled successors, no unresolved cliffhangers, and the last game is definitely not the worst in the series.\n\nIt seems really hard to find a game series that conclude gracefully without overstaying their welcome or messing up at the end. Similar observations with TV series, somewhat less so with movies and books. Game series are either milked till dry, or the developers simply cannot keep the spark of inspiration alive till the end. Is there a game series that actually concluded properly in your memory?\n\n(Regarding the definition of \"series\": I think we can restrict the definition to a set of games that are closely related by plot, usually chronologically. For example, we may consider all Final Fantasy main series separate, but the 3 FFXIII games are on the same series. )",
        "created_utc": 1512017458,
        "upvote_ratio": ""
    },
    {
        "title": "What game series gracefully concluded with no unnecessary sequels, cancelled sequels or gradual downgrade?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7gjnq0/what_game_series_gracefully_concluded_with_no/",
        "text": "[removed]",
        "created_utc": 1512015687,
        "upvote_ratio": ""
    },
    {
        "title": "Dark Souls 2, explain me how people like it",
        "author": "Dargoron",
        "url": "https://www.reddit.com/r/truegaming/comments/7gj09z/dark_souls_2_explain_me_how_people_like_it/",
        "text": "I just bought DS2 Scholar of the First Sin, because it has really good reviews and is a pretty \"known\" game.\nSo let me get started,\n you are nearly forced to play online\nThe Menu is a joke\nThe Keyboard/Controller thing is ridicilous, they game is still getting updates but this stays the same, a PC game which shows me controller buttons, and not only that it has a menu for keyboard. But to open a door its Strg+Double Leftclick and you can't change unless you make scripts. Wtf\nIts clunky as hell, you slide glitch and fall down from weirdest points\nThe Hitboxes are not existent\nIam not a graphic whore but brown mixed with green is a disaster.\nThose are my main points got about 100 more though.\n\nI didn't post this in the DS Forum since i will get hated.\nBut no offense all i want is an explanation how a game from 2014, with bad graphics, bad controls, bad pc port, etc etc can get SO loved\nAnd yes i know you can play it with a controller.",
        "created_utc": 1512009450,
        "upvote_ratio": ""
    },
    {
        "title": "The time management problem",
        "author": "bideodames",
        "url": "https://www.reddit.com/r/truegaming/comments/7gidj6/the_time_management_problem/",
        "text": "I've noticed a couple of seemingly opposed yet simultaneously prevailing schools of thought among a large portion of the gaming community here on reddit. That being people who are very vocal about having a large backlog of games and not enough time to play them and of people who feel that a game must provide 40+ hours of content for it to be considered worth it.\n\nThese 2 demands seem at odds to me. If one is concerned with ensuring that they are able to play through their catalog of games, the desire for a game to have a high time investment would be less common than it is. One would think that shorter, harder-hitting games would be more desirable. I suspect that the basis of this desire for long games comes from placing more value on the person's dollar than the person's hour. And if that's the case, maybe they have more time available than they are arguing for.\n\nGive me your perspectives.",
        "created_utc": 1512003618,
        "upvote_ratio": ""
    },
    {
        "title": "Follow up on previous post about \"greatest\" game. Desert island scenario.",
        "author": "TOFAS89",
        "url": "https://www.reddit.com/r/truegaming/comments/7gic6q/follow_up_on_previous_post_about_greatest_game/",
        "text": "[removed]",
        "created_utc": 1512003296,
        "upvote_ratio": ""
    },
    {
        "title": "What happened with \"halo\" games?",
        "author": "tylercoder",
        "url": "https://www.reddit.com/r/truegaming/comments/7giarf/what_happened_with_halo_games/",
        "text": "BTW this isn't about the halo series (hence the quotes) but the [halo effect](https://www.investopedia.com/terms/h/halo-effect.asp)\n\nSo EA just said they closed Visceral Games because they are moving on from single player (SP) games since they don't make \"that much\" money. Keep in mind they don't say they were losing money, just that they aren't making as much money as only-MP games do.\n\nThis isn't an isolated even BTW, tons of companies are doing this and other similar moves against SP games because they get a better ROI on MP games that don't have the added cost of a SP story and levels.\n\nRemember when MP was a side-feature of SP games? I remember...\n\nIt's ironic for me to see these big game companies cry over not being as greedy as they could. Tons of companies on other industries have halo products, products that don't make a ton of money and sometimes even lose money, but raise the consumers' awareness of the brand to high degree. This is not seen as a bad idea but as a powerful marketing tool.\n\nMovie studios make unpopular \"artsy\" movies all the time for this very same reason. Blockbusters might be way more profitable but nobody wants to be the studio that only makes Michael Bay movies. And so film studios finance movies that might not even turn a profit and actually lose money but make the studio stand out for its quality.\n\nHell even *car companies* have halo products, the term *halo car* is well known in that industry and we're talking about projects that cost more than a game to create and can bankrupt a company if it goes horribly wrong. And yet they take the risk.\n\nEven Apple had halo products like the Cube and the G4 iMac that didn't sell well but that became icons of the tech industry at the time. They did all this at a time when the company was just getting out from an almost-bankruptcy a few years ago.\n\nWhich brings me to EA, the company that often gets to the top of the rankings of worst company ever, the company that apparently *can't afford to make good games anymore*. \n\nIf there is a company out there that should be churning halo products like sausages to get its brand out of the gutter that should be EA, but instead they shut down one of the few studios they have left that still made good games.\n\nAnd it isn't the first: EA has killed or ruined famous studios like Maxis, Westwood, Mythic, Bullfrog, Origin and many more.\n\nSo IMHO if this works for the industry and they keep making more and more money every year with MP-only games then it's only downhill from here because they'll keep looking at things to cut out from games so they can raise their profits a bit more.",
        "created_utc": 1512002912,
        "upvote_ratio": ""
    },
    {
        "title": "Why framerate and frametime don't match (during frametime spikes)?",
        "author": "falconepl",
        "url": "https://www.reddit.com/r/truegaming/comments/7gh64w/why_framerate_and_frametime_dont_match_during/",
        "text": "Occasionally, with some game titles (especially those named *early access*, that are not yet well optimized) I suffer from the gameplay that is not smooth. Sometimes it has nothing to do with the client-server network lag, but it's all about local graphics rendering, namely **frametime** (not to be confused with the framerate/FPS). Sometimes it's all about frametime spikes.\n\nIn theory, frametime is just the *inverse* of the framerate/FPS, thus:\n\n* 30 FPS = 33.3 ms\n* 60 FPS = 16.7 ms\n* 100 FPS = 10 ms\n* 120 FPS = 8.3 ms\n* 144 FPS = 6.9 ms\n* ...and so on (you should read '=' as '*corresponds to*')\n\nMy question then is - while monitoring FPS along with the frametime (e.g. with MSI Afterburner)...\n\n* **Why when I can see frametime spikes** (40+ ms, that make the game feel not smooth), **I often don't see FPS drops?**\n\nE.g. [[here]](https://drive.google.com/file/d/1zsEqpxHRTVdlrU7iNK2qOFSKDLJymuaY/view?usp=sharing) is one of my Playerunknown's Battlegrounds logs graph that shows frametime spikes (for that split second of such **stutter**, game becomes jittery), although FPS remains at it's standard level, as if there where no stuttering at all.\n\nIs it because FPS &amp; frametime monitoring tools use different GPU/DirectX/OpenGL APIs to calculate those values, or calculate them at the different stages of rendering pipeline?",
        "created_utc": 1511993339,
        "upvote_ratio": ""
    },
    {
        "title": "Do you guys still buy new games even if you have a huge backlog?",
        "author": "mvpalpha",
        "url": "https://www.reddit.com/r/truegaming/comments/7ggcg8/do_you_guys_still_buy_new_games_even_if_you_have/",
        "text": "I’d been all caught up with switch games since launch, but now I’m about to buy xenoblade 2 when I still haven’t finished doom, skyrim, resident evil 1 and 2, and not to mention a ridiculous amount of eshop titles. I’m starting to feel a little ridiculous. How do you guys handle your buying/playig habits?",
        "created_utc": 1511986920,
        "upvote_ratio": ""
    },
    {
        "title": "I don't understand what happened to the Crysis series",
        "author": "kiskoller",
        "url": "https://www.reddit.com/r/truegaming/comments/7geozp/i_dont_understand_what_happened_to_the_crysis/",
        "text": "If you look that the first game in the series, you see a game with a nice, simple storyline that has a superb build-up and a great final act / conclusion. The expansion does what it should: it expands on the storyline, without altering the feel too much. The first game was a standard tactical shooter turned into a sci-fi shooter, with the expansion adding some drama to it.\n\nI was a great fan of both games, and I hold up Crysis to be one of the best FPS games I've ever played. It has everything a PC FPS gamer would want: good controls, AI, vehicles, setting, etc.\n\nThen Crysis 2 came out and it was a completely different game. I understand that making a console game meant having to change a lot of things, including how the controls and the suit functioned, map design, even map location, the list goes on.\n\nWhat I don't understand is the gigantic switch of tone in the storyline. To be honest, I've only played both 2 and 3 to maybe halfway, but I've read and watched the plot/cutscenes online. \n\nCrysis 1 is a realistic shooter in the nearby future. It sets up a lot of things and has a lot of unsolved plotlines for the sequels to dwelve into: What happened with the ever-so-important no-self-destruct alien exosuit? What happend with Prophet, Psycho, Nomad and the archeologist girl after they went back to the island? The suit had the origin-story of being a standard, but expensive U.S.A. military product.\n\nCrysis 2 flipped everything on it's head. Every single one of the past cast was gone. Prophet was killed in the first cutscene, the protagonist was changed without every really mentioning the previous one, the backstory of the suit was changed, the aliens were changed, the list goes on.\n\nI understand they wanted to make a stand-alone sequel. Since console-players couldn't play the original one (neither most of the PC players of that time) they did not want to built on the knowledge of the previous games. But they could've went with either:\n\n- Follow the same story, just have enough exposition talk or flashbacks for newcommers\n\n- Make a reboot\n\nInstead, they made an officially sequel game, which had very little to do with the original. \n\nI see this happening when the game switches studios or publishers, but in this case, that did not occur. Pretty much the same people made Crysis 1 and 2.\n\nThen Crysis 3 came out, which was still much closer to 2, than 1.\n\nI also don't understand the point of killing then resurrecting Prophet. I get that they've tried to make a Jesus-parallel, but what is the point of killing a character at the very first scene, then act as he didn't die in the middle of the story, then resurrect him in the end? Nothing.\n\nDon't get me wrong people, I am not bitching about a somewhat older game-series, I am just confused. \n\nWhen I see a bad movie or a bad sequel, I still see the good ideas behind the bad implementation. I can see what Lucas tried to achieve with the prequel Star Wars trilogy for example. I just don't get WHY Crytek went this way with this series.\n\nDid they fear the game will look like a Call of Duty clone?",
        "created_utc": 1511974464,
        "upvote_ratio": ""
    },
    {
        "title": "An argument on not to trust the \"random\" programming behind \"lootboxes\" and how easily manipulated they can be.",
        "author": "Bloodhound01",
        "url": "https://www.reddit.com/r/truegaming/comments/7gdv8w/an_argument_on_not_to_trust_the_random/",
        "text": "This is something I never see talked about in these thread. People keep talking about the predatory nature of Microtransactions and Lootboxes. I think the real issue here is that no one truely knows if these are even 'random'.  \n\n**The Age of Data Mining**\n\nTriple A companies have a LOT of resources at their disposable. We live in an age where everything you do on the internet is logged in someway. Facebook, Google, Apple, Blizzard, EA, etc. Are collecting data constantly when you are playing their games. All this information is stored in Databases and linked to your account. Blizzard can adjust drop-rates of items in Diablo 3 without applying a hotfix because everything is server side. They know the statistics on every spell being used. They know the statistics on how many of each class is being played, etc. all this info is being logged and analyzed by these companies. They know the statistics of what cards are being used the most, etc. Pick a game, pick an important aspect of an online game and its probable that they are logging the information about it, its almost naive to think these companies aren't when they have the resources at their disposal.\n\nThe programming behind these 'random' lootboxes or creates is laughably easy to manipulate. They can cross-reference the opening of these boxes with all the information logged about your account. **This is real and this is happening.**\n\n* They can program so you dont get 2 legendaries in a row. \n\n* They can program if you get to many high value cards your next drops are all crap until your average drop rating evens out. \n\n* They see you using shotguns a lot? Well now you dont get any shotguns in your lootboxes for awhile. \n\n* Certain guns are becoming to common? Lootbox drop rates for those guns start dissapearing. \n\n* They see you only buying a lootbox every few months? They give you slightly better loot to entice you into buying more.\n\n* Paid lootboxes can potentially give better loot then 'free' lootboxes. \n\n* I can come up with hundreds of variables to cross-reference a lootbox with your account/game statistics.\n\n[Hearthstone checks for duplicate legendaries.](https://www.forbes.com/sites/insertcoin/2017/06/22/hearthstone-is-eliminating-duplicate-legendary-cards-from-packs/#7a50b7eb19e0) That is not what I would consider 'random'.\n\n[Hearthstone has a pity timer](https://www.reddit.com/r/hearthstone/comments/3z7jyh/pity_timer_on_packs_opening_and_the_best_strategy/) This is the most blatant example with proof. They are monitoring exactly what is being opened and exactly what you get to make sure you get certain cards to not allow you to get a sense of discouragement.\n\n[TF2 controls their item drop system](https://wiki.teamfortress.com/wiki/Item_drop_system) Based on playing time.\n\n[Destiny 2 just got hit for XP tampering](https://www.kitguru.net/gaming/matthew-wilson/destiny-2-investigation-reveals-hidden-xp-scaling-system/) Based on playing time. This actually came out after I started collecting examples.\n\n[Online Poker had a backdoor to 'see' other peoples cards](http://www.slate.com/blogs/crime/2013/05/29/ultimatepoker_and_ultimatebet_the_online_poker_scandal_that_never_ends.html) There is a reason online-gambling is illegal. Its incredibly hard to monitor.\n\n\n\nMy point is, these 'random' elements that games are trying to throw at us now-a-days. Are anything but random. Something isn't 'random' when there are variables controlling what and when you get items. Why anyone trust any game with a 'random' element in the age of computers is stupid. These aren't card packs in stores where companies have no idea who is buying the packs. This is a reality where companies know *a lot* about who is buying the packs. It's almost impossible to prove any manipulation unless you have a large number of people providing data-sets.\n\nTL;DR - You should go into any game with a lootbox/crate system with knowledge that you are probably being manipulated.\n",
        "created_utc": 1511967799,
        "upvote_ratio": ""
    },
    {
        "title": "Games with slow charging but super strong moves? ALA Dragons Dogma.",
        "author": "NeonAbomination",
        "url": "https://www.reddit.com/r/truegaming/comments/7gdlc7/games_with_slow_charging_but_super_strong_moves/",
        "text": "[removed]",
        "created_utc": 1511965357,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone else had this experience of playing through a game, but not remembering a damn thing about it?",
        "author": "Rock_Carlos",
        "url": "https://www.reddit.com/r/truegaming/comments/7gd6xq/has_anyone_else_had_this_experience_of_playing/",
        "text": "[removed]",
        "created_utc": 1511961624,
        "upvote_ratio": ""
    },
    {
        "title": "Has a game/interactive experience ever affected you so much that its changed your perspective on something?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7gc6av/has_a_gameinteractive_experience_ever_affected/",
        "text": "[deleted]",
        "created_utc": 1511949715,
        "upvote_ratio": ""
    },
    {
        "title": "Ralph koster´s perspectve on the whole microtransaction issues.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7g6oeg/ralph_kosters_perspectve_on_the_whole/",
        "text": "[deleted]",
        "created_utc": 1511897046,
        "upvote_ratio": ""
    },
    {
        "title": "The Secret Psychology Of Gambling With Battlefront 2's Loot Boxes",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/truegaming/comments/7g6fam/the_secret_psychology_of_gambling_with/",
        "text": "[removed]",
        "created_utc": 1511895129,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most interesting topics that have been brought up on r/TrueGaming?",
        "author": "GermBurglar007",
        "url": "https://www.reddit.com/r/truegaming/comments/7g30ud/what_are_the_most_interesting_topics_that_have/",
        "text": "So, I'm planning on starting a series on my YouTube channel based around game mechanics, progression of the industry, all that jazz. So I'm just gonna ask it straight, what are some of the most interesting topics you've seen on this subreddit? If you can provide a link, that would be great, but don't bother if you can't find it.\n\nThanks in advance, people of r/TrueGaming!",
        "created_utc": 1511861692,
        "upvote_ratio": ""
    },
    {
        "title": "Can current gaming technology adapt the Tournament of Power saga of Dragon Ball Super?",
        "author": "DAVasquez-",
        "url": "https://www.reddit.com/r/truegaming/comments/7g2cu3/can_current_gaming_technology_adapt_the/",
        "text": "79 AIs or human players on screen at once besides you , thousands of ki blasts, 80 endings, visibility of potentially kilometers, etc etc.",
        "created_utc": 1511852809,
        "upvote_ratio": ""
    },
    {
        "title": "What was the first game you remember ever beating? (i.e minimum: completed story)",
        "author": "RevolutionDoctor",
        "url": "https://www.reddit.com/r/truegaming/comments/7g27bh/what_was_the_first_game_you_remember_ever_beating/",
        "text": "For me it was Fable on the original Xbox, I played that game almost constantly, day and night, of course having to go to bed, bathroom breaks and family stuff in between since I was a young kid. That game absolutely blew me away and pretty much got me into gaming, really wish that series would come back. The systems implemented in that game like the Karma system were truly amazing at the time.",
        "created_utc": 1511850905,
        "upvote_ratio": ""
    },
    {
        "title": "Kingdom: New Lands",
        "author": "CarcassEater569",
        "url": "https://www.reddit.com/r/truegaming/comments/7fzvwc/kingdom_new_lands/",
        "text": "[removed]",
        "created_utc": 1511828492,
        "upvote_ratio": ""
    },
    {
        "title": "What puzzle genres have already been hybridized by adding RPG and/or civ elements?",
        "author": "efofecks",
        "url": "https://www.reddit.com/r/truegaming/comments/7fzhmd/what_puzzle_genres_have_already_been_hybridized/",
        "text": "I asked this question in r/gamedev a couple of days back and got some good feedback, but was hoping to see if I missed anything here.  \n\nA surprisingly rich space in design is tacking on RPG and/or RTS/Civ elements to an established puzzle game core.  Earliest mainstream examples of these I believe are Puzzle Fighter (match-3, bejeweled) and Bookworm Adventures. I've gotten a kick out of these games, and was hoping to compile a list.  Note that these games should have the puzzle as the standout game loop, not just a minor element in the game. Also not looking for videogame conversions of existing board games, even though those would fit nicely. :)\n\n**Can anyone contribute to this list? Are there any newer, better games which innovate on the genre? Are there untapped base games that can be used?**\n\nPuzzle Core | Game \n---|---\nMinesweeper| Dungelot, Tales of the Adventure Company, Mamono Sweeper, Oasis, Psycard\nMatch 3 - Board as abstract | Puzzle Quest franchise, Puzzle &amp; Dragons, Glyph Quest (hex board), Gridland, and a whole lot of others\nMatch 3 - Board as physical map |  Cavemania, Scurvy Scallywags, Tavern Guardians, Swap Sword \nPoker | Sword and Poker\nChuzzle (Rotate-match) | 10000000\nPinball | Momonga, Pinball Quest, Rollers of the Realm\nMatch Line-Drawing | Fidel Dungeon Rescue, Dungeon Raid, Puzzle Craft, Wargames WOPR, Dungeon Link, Dungeon Story\nWord Games | Spellspire (Anagrams), Bookworm Adventures (Boggle), Spellwood (Scrabble), Crossword Dungeon (Crossword)\nConstructive Matching | Triple Town (civilization building)\nBreakout/Arkanoid | Wizorbs\nPipe Dream| Swap Quest\nThrees/2048 | Lost Viking,  Boneswiper, Sword&amp;Dragon, Dungeon Tiles (ios), The Nightmare Cooperative\nSorting (Tinder) | Reigns, Mobs &amp; Potions, Tinder (if that's your thing)\nBookworm | Bookworm Adventures\nCollapse! | Knightfall, Samegame Fighter, Dangerous Adventure\nSnake | Nimble Quest\nSlots | Tower of Fortune, LuckyStrike\nIdle Games | Too many to mention\nYahtzee | Delve the Dice Game\nSolitaire | Solitairica (Klondike); Card Crawl, Donsol, Card Thief (Various other Mechanics)",
        "created_utc": 1511825077,
        "upvote_ratio": ""
    },
    {
        "title": "Youtube Channels dedicated to good gameplay/montages",
        "author": "Vizingard",
        "url": "https://www.reddit.com/r/truegaming/comments/7fydz2/youtube_channels_dedicated_to_good/",
        "text": "[removed]",
        "created_utc": 1511816216,
        "upvote_ratio": ""
    },
    {
        "title": "With all the space simulators coming out, when do you think we will see the next indie/AA/AAA space opera game?",
        "author": "Fokken_Prawns_",
        "url": "https://www.reddit.com/r/truegaming/comments/7fwc0m/with_all_the_space_simulators_coming_out_when_do/",
        "text": "The amount of space simulators in the last few years prove that there is an interest in space games.\n\nGames like Elite Dangerous, No Man's Sky, Star Citizen, Kerbal Space Program, Everspace, Astroneer and Space Engineer, should show there is an interest games that takes place in space and the unknown.\n\nStill missing is the games with proper narrative, with Mass Effect on \"hiatus\", shouldn't there at least be some interest in taking the title as the premiere space RPG?",
        "created_utc": 1511800116,
        "upvote_ratio": ""
    },
    {
        "title": "I hold game companies to a higher standard than mere profit",
        "author": "zeddyzed",
        "url": "https://www.reddit.com/r/truegaming/comments/7fvxej/i_hold_game_companies_to_a_higher_standard_than/",
        "text": "Quite often when discussing player-unfriendly decisions by game companies, someone will chime in with a defense like, \"They're a business, their only responsibility is to make money\" etc blah.\n\n\nWell, I don't agree - we should hold them to a higher standard than mere profit.  (We should pretty much hold all companies to a higher standard, unless they are pure finance companies, whose only function is to make money.)\n\n\nConsider a (private) hospital.  A hospital is a business.  It needs to make money to survive.  But making money is not its mission.  Its mission is to save lives, improve health, etc.  If a patient dies due to cheap faulty equipment, we do not say, \"Well, they're a business, they have to make a profit somehow.\"  We totally say, \"This is not a correct decision for a hospital.\"\n\n\nSimilarly, for game companies, their mission is to make entertaining games.  They need to make money to survive, in order to accomplish their mission.  But making money isn't their mission.  \n\n\n So when a game company compromises its mission for the sake of making money (outside of emergency save-the-company-from-ruin situations) we shouldn't defend them - we need to keep the pressure on so that they know we're not going to overlook these sorts of decisions.",
        "created_utc": 1511796697,
        "upvote_ratio": ""
    },
    {
        "title": "With all the space simulators coming out, where is the next Mass Effect?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7fvx08/with_all_the_space_simulators_coming_out_where_is/",
        "text": "[deleted]",
        "created_utc": 1511796596,
        "upvote_ratio": ""
    },
    {
        "title": "Starting a studio and I want to do right by potential players and customers.",
        "author": "fairtradedev",
        "url": "https://www.reddit.com/r/truegaming/comments/7fvuwn/starting_a_studio_and_i_want_to_do_right_by/",
        "text": "Hi,\nI am currently in the beginning stages of creating a game with a technology stack that I've been working on for quite a while now and is finally maturing to the point of being able to create shippable products. There has, rightfully so, been a lot of swirl in the news lately criticizing the way companies are monetizing their games. When I was growing up, you bought a game, you received the game, and that was the end of the transaction. Ultimately this is the model I would like to pursue. People who elect to spend their income on my game shouldn't be penalized for that choice.\n\nTo that end - I would like to discuss alternate financing strategies with a community to get a better sense for what people find fair versus unfair.  My big picture summary is this: I've worked developing software professionally for 10+ years and I've saved up enough to sustain myself doing full-time work on my final game idea for roughly two years given no huge unexpected costs. There's some padding built into the budget for issues here and there, just nothing earth-shattering.  Having been in software development for a while, I have a decent idea of the time it would take me to complete various stages of the game; a playable alpha, a few iterations of more polished betas, and a release version.  Two years' of funds can get me there if other aspects of life cooperate.\n\nWhen the game is released - I want that to be it.  No microtransactions, no ads, no day-one DLC, no loot boxes or any other nonsense.  If the game is successful enough that I can continue working on it, I'd be up for something more like expansion packs - i.e., very large new content - but have zero interest in nickel and diming people for cosmetic differences and will absolutely not support any type of pay to win model.\n\nIn order to build myself a bit of a cushion on the two-year funds depletion date, I've been brainstorming some ideas for alternate sources of income and would like to run them by the community to see what type of reception they receive. While I know a lot of people have had success with kickstarters, I just don't feel right asking people for money.  For one, I'm unproven in this space and that could prove to be a hard sell.  Furthermore, I simply don't like asking something for nothing - maybe I'm old and out-dated, but it doesn't seem right to me that someone can take a bunch of individual strangers' money on a promise, and then months/years later either not deliver at all, or under-deliver and have a disappointed crowd that won't trust you again in the future.  I understand that people get their money back if the product isn't delivered, but at the same time, they could have used that money for anything else in the meantime - heck they could've even thrown it in a savings account and came out further on top than having it sit in an blackbox account for a year just to be given back to them.\n\nAll that being said - the main idea I've been throwing around in my head is this: building micro-games / experiences with the engine technology that I've been building. The point of this is two-fold. First, it would demonstrate that the technology is feasible, and also help me find bugs/issues in it, and secondly it could be a small revenue stream. My thought is to sell the games/experiences for about $0.99 each with a very clear disclaimer that they are meant to be short-lived and that their purpose is in funding something larger.  The reason I keep saying games / experiences is that some of the ideas I've come up for these are things as simple as attempting to create certain atmospheres (scary, happy, sad, etc.) using the engine tech and having the user explore these spaces to attempt to evoke a certain type of feeling.  They're short-lived by design, thus very cheap, but at the end of the day, the user is helping fund a larger project and even if the project ends up being a bust, they have something real to show for it.\n\nMy ask of this community is to take the above and critique it; let me know where it needs improvement, or if the whole idea needs to be rethought from scratch. None of this is possible without community support, so it only seems reasonable to start here and learn what I can to set myself up for the highest chance of success. One of my biggest concerns is around the expectations that app stores, etc., have set up for what $0.99 gets you. I would hate for people to feel cheated, but also feel like this is a better and less intrusive model for the end-user than riddling these micro-games with ads and annoying the user out of any further interest down the road.  My other concern is that the time I put towards the micro-games could be going towards the end-goal. I'm ok with accepting this risk because their purpose is to fund the larger project and they will also help refine the technology stack I'm building, meaning the final game product will be in a more refined state.  The micro projects will be planned out and time-boxed appropriately so that I know up-front how much time they're setting me back versus time that could go towards the end product.\n\nIs this a good idea, bad idea, or somewhere in-between? Have I missed something obvious, or not thought something through to the right degree?\n\nI apologize for the word wall, and sincerely appreciate those who take the time to read it and provide feedback.\n\nThank you!\n\nP.S. I've been a redditor for a long time (8 year club), but only a handful of folks I work with know that I'm considering leaving to start this venture, and until I get a few more things ironed out, I'm not quite ready to broadcast it throughout the office just yet (where a few more people know my usual username).  Future posts will be either through my usual handle, or one I set up specifically for this purpose through the LLC I will form.\n\n**TLDR** I would like feedback on my idea for funding a longer-term project by producing small self-contained micro-games as a funding mechanism.",
        "created_utc": 1511796085,
        "upvote_ratio": ""
    },
    {
        "title": "Are we allowed to share Synthesia piano Game record's here ?",
        "author": "Bleupetrole",
        "url": "https://www.reddit.com/r/truegaming/comments/7fu7l9/are_we_allowed_to_share_synthesia_piano_game/",
        "text": "[removed]",
        "created_utc": 1511777569,
        "upvote_ratio": ""
    },
    {
        "title": "Are there more games that are a cross media experience?",
        "author": "lutifun",
        "url": "https://www.reddit.com/r/truegaming/comments/7fsxtw/are_there_more_games_that_are_a_cross_media/",
        "text": "[removed]",
        "created_utc": 1511761053,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think the inherent value of an endless game (e.g MOBAs, Team-Based Shooters) outweighs the opportunities lost to play other games?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7fsd4q/do_you_think_the_inherent_value_of_an_endless/",
        "text": "[deleted]",
        "created_utc": 1511754746,
        "upvote_ratio": ""
    },
    {
        "title": "Hitman 2016 is one of few AAA games that relies on mastery, and I love it.",
        "author": "vgambit",
        "url": "https://www.reddit.com/r/truegaming/comments/7frfw0/hitman_2016_is_one_of_few_aaa_games_that_relies/",
        "text": "Hitman 2016 comprises 6 episodes, each taking place on its own large map. The first way to play these modes is via their Missions, which feature an overarching plot that continues on from the previous Hitman games. They also serve as a nice semi-guided tour of each level, because various \"opportunities\" pop up, cluing you into learning more about how each level works. You might overhear a conversation that leads you to the possibility of disguising yourself as a bartender or chef so you can covertly poison your target. \n\nBut the story missions largely serve as introductions to the level. Sure, if you want, you can keep replaying those levels in an attempt to get feats, which is how the game's progression system works; accomplish certain tasks (like \"kill your target and hide the body in one move\"), and you gain XP, and every time you level up, you unlock some new gadget for 47 or some new starting location or smuggling drop point to use in that location.\n\nWhere the game really shines, though, is in the Escalations. Each episode has several Escalations where you have some set of objectives (\"kill this NPC,\" \"break into that safe,\" and so on). Each Escalation has several levels that add more objectives as well as complications that make them harder to accomplish. And saving is disabled, so given how difficult a mission can become once you screw up, this means you'll restart a lot, and end up learning the maps very quickly. \n\nMy favorite Escalation thus far (and the hardest one I've done) is The Kotti Paradigm. For [its final level (spoilers)](https://www.youtube.com/watch?v=LTQeBqi0CtE), I had to kill 3 targets, each with a battle axe, while wearing 47's Signature Suit, without using agility (no climbing/vaulting/etc.), without pacification (so if anyone gets in my way, I have to kill them and lose points, or distract/sneak past), and with super enforcers walking around that can see through all of 47's disguises, including his suit. \n\nThe way I did it was very similar to the above video; I interrupted a conversation the 1st target was having so that she'd quickly walk to the bathroom while I got the battle axe from the adjacent room. On my way to get the battle axe, I unlocked the door leading outside from that room and shot a car while the 2nd target was standing out on his balcony so that he'd investigate the noise the alarm made. I killed the 1st target while #2 made his way down, then got #2 as he walked past the bathroom. I stashed his body in the bathroom, then disguised myself as him (the Sheikh) so I could get to the 3rd floor unperturbed, stashing the battle axe in a stairwell on the way. The 3rd target was one of the people running the auction, so I grabbed the laptop password dongle from the attic and used it to disable the auction laptop before dashing back to the Sheikh's body to retrieve my disguise, then making my way back to the stairwell I stashed the axe in. I got the axe, went upstairs, and hid behind a statue until the auction woman, frazzled about the auction's technical difficulties, walked past, and went down the stairwell, where *I threw the axe at the back of her head* before I made my escape, completely incognito. \n\nEven though I \"cheated\" by watching a video first, the puzzle solving challenge of roughly figuring out what steps need to be followed is still there if I want to try to get a higher score for a better placing on the leaderboards\\*. \n\nAnother mode is Contracts, which are essentially user-generated Escalations. Some of these Contracts can be just as entertaining as the Escalations. And then you have Elusive Targets, which are essentially Escalations that you can only even attempt once, win or lose. You also only have a 10-day window to attempt them before they're gone (I think for a year). \n\nI'm gushing about this game because so few like it are made. I think this might be in my top 5. Bayonetta's another strong example. They give you progressively difficult things to do, then add the point system on top of it once simply getting it done becomes too easy. Even if you find some \"optimal\" easy way of accomplishing something, the complications in the Escalations and Contracts help throw a wrench into those plans and keep the game interesting.\n\nWhat other games emphasize mastery that people might not realize?\n\n\\*: I don't plan on ever playing for score in this game, because Io Interactive does not police their leaderboards. One of the individuals in the top 10 for one of the Escalations definitely has a racial slur (like TheN-wordKiller) in their Steam name. I don't need to see that shit. I asked IoI about it and got no response. ",
        "created_utc": 1511745519,
        "upvote_ratio": ""
    },
    {
        "title": "Waning Interest in Playing Games",
        "author": "Geang",
        "url": "https://www.reddit.com/r/truegaming/comments/7fphz0/waning_interest_in_playing_games/",
        "text": "The other day, I was looking through my room, and in my very modest Mega Drive library, I saw Sonic 1 (the slow PAL version). I started playing it, and I was hooked; I couldn't go to bed. I knew it was the slower PAL version but I didn't care about that; I was just so into it (I played it for 45 minutes, then I had to go to bed, though it was hard to put down). But when I came back to it the next day, that magic wasn't there; I could've easily gotten off of it. I also recently moved my Wii U into my room and I started playing Smash Brothers, but it wasn't the same as it had been when I last played it (I'd played it for months it 2015, single player, but then I got bored in about August). Again, I could've easily given it up, and worst of all, it didn't grab me lie Sonic 1 did initially\n\nRecently, I've found that I found that I have more fun researching the history of games, rather than playing it. (Edit: researching stuff like Mega Drive vs SNES, ZX Spectrum, Amiga have really fascinated me)There've been no games that I've been, I NEED to get this. I've recently picked up Ecco the Dolphin (also for the Mega Drive), not because I NEEDED it, but rather I've heard good things about it, and I've barely played it. Some games like say, Senran Kagura, look interesting, but there's no urge to get it. Back in 2014, I was really hyped for the Wii U, but I've not been like that since. I bought many retro systems (Edit: because I'd been really hyped) since the Wii U, but I've gotten rid of them a few months later becasue I've just gotten bored of them, (edit: and I haven't been hyped for any system for some time, about a month). I had for some time this year been really into SNK, but I've haven't been able to play **any** of their games apart from Metal Slug 1 (which did have some of that magic that Sonic 1 above had in that I couldn't put it down), and I'm not sure if that has affected my interest in playing games. I'm really worried that I just don't want to play games any more.What should I do to regain interest in playing, not just researching games?",
        "created_utc": 1511727841,
        "upvote_ratio": ""
    },
    {
        "title": "Despite massive criticism. I think the new Call of Duty, WWII is a step in the right direction for the franchise.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7fpd3z/despite_massive_criticism_i_think_the_new_call_of/",
        "text": "[deleted]",
        "created_utc": 1511726653,
        "upvote_ratio": ""
    },
    {
        "title": "Is mobile gaming bound to be casual?",
        "author": "Guandor",
        "url": "https://www.reddit.com/r/truegaming/comments/7foffh/is_mobile_gaming_bound_to_be_casual/",
        "text": "Recently, I've been a little bit sick and I don't feel like getting out of the bed. So, being fed up with scrolling my Facebook feed, I've decided to see what's up in Google Play. \n\nThere are lots of good games, really. The graphics, the music, the gameplay are all top notch quality. It is clear that the mobile developers have solved such issues. But, almost all of them are casual. I install a game, play it for half an hour, then I'm looking for another game because I don't feel like investing more time to it. Whereas when I'm playing, say, The Witcher 3, I'm always looking for what else the game can offer. \n\nI think I'm giving too much useless background information now, anyway, do you think mobile gaming can give the same immersion of pc gaming? Are there technical limitations to it such as controls or is this just what mobile gamers demand? ",
        "created_utc": 1511718566,
        "upvote_ratio": ""
    },
    {
        "title": "2D games for a 3 year old",
        "author": "mackadoo",
        "url": "https://www.reddit.com/r/truegaming/comments/7fo7dp/2d_games_for_a_3_year_old/",
        "text": "As her Christmas present, my daughter and I have been putting together a Gameboy Advance Raspberry Pi Zero kit to run Retropie. My understanding is that it will be able to handle emulating old 2d systems well. \n\nMy next issue is what games to start her on - I'm worried giving her a Contra or Battletoads experience too early on will sour her on gaming. She's 3, so as much as she loves Pokemon I think the reading will make it incomprehensible.   Maybe I'm being too pessimistic - maybe I just throw her into Super Mario and she figures it out with time. \n\nTLDR: How do you introduce a 3 year old to classic games?",
        "created_utc": 1511716543,
        "upvote_ratio": ""
    },
    {
        "title": "What makes a good Esport and what's the definition of an Esport to you?",
        "author": "TheRandor69",
        "url": "https://www.reddit.com/r/truegaming/comments/7fnys5/what_makes_a_good_esport_and_whats_the_definition/",
        "text": "So with Esport heading more and more into the mainstream I thought I'd start a conversation with you guys. How would you define an Esport? And what are some key ingrediënts for a good Esport?",
        "created_utc": 1511714409,
        "upvote_ratio": ""
    },
    {
        "title": "What is the logic of having a bunch of people talk at once in battle? (Xenoblade 2)",
        "author": "hyperknees91",
        "url": "https://www.reddit.com/r/truegaming/comments/7fnp78/what_is_the_logic_of_having_a_bunch_of_people/",
        "text": "I'll just use Xenoblade 2 as an example because its recent and it shows you it keeps on happening. In turn based battles I understand somewhat because its at least one line at a time (still sounds bad usually because of repetition). \n\nBut in games like this? This is just a cluster of noise that I can't believe anyone thinks actually sounds good. This seems like a basic problem that never got corrected. You know how in Nier the characters just kind of.....stay quiet while they fight (with some minor battle grunts), why not make every game like that? Or at least save it when the character is doing their big ultimate attack or something. \n\nhttps://www.youtube.com/watch?v=OwuUlw876T4 Just check out 10:00 in. The fact games still do this saddens me. It sounds awful. ",
        "created_utc": 1511711888,
        "upvote_ratio": ""
    },
    {
        "title": "FOV not the only reason causing motion sickness",
        "author": "burningbun",
        "url": "https://www.reddit.com/r/truegaming/comments/7fmnfx/fov_not_the_only_reason_causing_motion_sickness/",
        "text": "I've played many FPS &amp; 3rdPS on PC, while lower FOV on these games make me feel uncomfortable, i notice there is this 1 game where FPS don't really help reduce motion sickness:\n\nViscera Clean Up Details &amp; Santa's Rampage.\n\nI set the FOV at 95, turned off headbob &amp; motion blur, i even tuned it up to 105 just to check, but i get motion sickness around 1 hour after playing on both tries. I never had motion sickness when FOV is more than 90, but this game is special. Maybe something to do with the hands &amp; mop you see remains the same irregardless of the FOV?\n\nI haven't played Shadow Warrior but i'm guessing since they are using the same settings i'm quite confident it will also give me the same issue.\n\nSeems despite higher FOV being an important part in reducing motion sickness, if the hands &amp; guns remains too close to the screen your eyes will still perceive the screen as having low FOV despite the broader field the screen is showing you.",
        "created_utc": 1511699830,
        "upvote_ratio": ""
    },
    {
        "title": "Best game ever vs guilty pleasure and thoughts",
        "author": "TOFAS89",
        "url": "https://www.reddit.com/r/truegaming/comments/7fm1pc/best_game_ever_vs_guilty_pleasure_and_thoughts/",
        "text": "When people ask me what my all time favorite games are i usually give an answer like, fallout, uncharted, dead-space, RDR, Chrono etc. because not only are they fun to play i really love their stories. But when i look back alot of the games i consider the best i have only played through once or occasionally twice. Whereas there are games like COD, Battlefield or Rust(online based) that i have sunk thousands of hours into that i would not name as the GOAT. Plus there are games like Crash Bandicoot, Super mario, pokemon and Klonoa that i go back to regularly that no one would probably name the best game of all time. What are your thoughts on this? How would you pick the best game of all time? would you consider time spent on it? Impact the game had on you while you played it or when it was over? Nostalgia?\n\nI'm curious to hear your thoughts and also if you had to pick the best game of all time and guilty pleasure game what would they be? \nBEST GAME:\nMine would be WOW because amount of time and fun i had playing it, the lore and the social interactions of the game ( that at the time was a first for me). But then again i haven't played it since Wrath of the Lich King came out, so i might not even enjoy it anymore.\nGUILTY PLEASURE:\nCall of duty Black ops: mind numbing repetitive stupid shit while playing gun game with friends, i love the simplicity of going back to it for a few games and just getting into it straight away or some BF for the same reason. And again i haven't played these games in a year almost since i am abroad and don't have the capability at the moment",
        "created_utc": 1511690303,
        "upvote_ratio": ""
    },
    {
        "title": "Death in Games: Survey Closure (and thank you!)",
        "author": "amracs",
        "url": "https://www.reddit.com/r/truegaming/comments/7fkko8/death_in_games_survey_closure_and_thank_you/",
        "text": "A big thank you to everyone here who completed the survey at www.surveymonkey.com/r/gamedeath. Your responses will help to further our understanding of the different ways players experience in-game death (including permadeath). Preliminary assessment of the data shows variation in responses, suggesting variation in experiences of in-game death. Variation is seen in genres, motivations, sentiments, emotions, and other factors.\n\nThe survey will close on 1ST DECEMBER 11PM AEST so if you started but haven't yet completed it please do so in order for your responses to count. If you haven't started the survey but are interested in filling it out you are very welcome to do so. Further information can be found on the page.\n\nIf there's interest in the results, I'm happy to post about it here when it's ready. Thank you again!",
        "created_utc": 1511670231,
        "upvote_ratio": ""
    },
    {
        "title": "Need this back",
        "author": "ColeLoaf",
        "url": "https://www.reddit.com/r/truegaming/comments/7fkack/need_this_back/",
        "text": "[removed]",
        "created_utc": 1511667009,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting story from my trip to EB Games today.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7fi3sz/interesting_story_from_my_trip_to_eb_games_today/",
        "text": "[deleted]",
        "created_utc": 1511644998,
        "upvote_ratio": ""
    },
    {
        "title": "/r/AltPokémon - The Alternative Pokémon Subreddit",
        "author": "Prosode",
        "url": "https://www.reddit.com/r/truegaming/comments/7fgqhl/raltpokémon_the_alternative_pokémon_subreddit/",
        "text": "[removed]",
        "created_utc": 1511632291,
        "upvote_ratio": ""
    },
    {
        "title": "Wolfenstein: The Responsabilities of Alt-History Stories",
        "author": "NietzschesMustaches",
        "url": "https://www.reddit.com/r/truegaming/comments/7fga74/wolfenstein_the_responsabilities_of_althistory/",
        "text": "Nazis have been a staple of videogames and popular culture for years. Because of this, it seems we went through every possible iteration of the same discussion: “Is there a reason we shouldn’t let gamers play as Axis soldiers in games? Should it be considered offensive to set a game in such an immense tragedy?” The collective answer seems to have been a resounding no. Nevertheless, games aiming at recounting a deeper story set in World War 2 are often appreciated (or criticized, if they do something wrong) for how they handle a delicate topic which is otherwise pretty much ignored by AAA games. Wolfenstein: The New Order has for example been praised for the earnest depiction of the Holocaust, while its sequel has been [criticized](https://www.youtube.com/watch?v=vqLE1Bh190g) for its lazy depiction of a Nazi-dominated America, which has been described as inferior in worldbuilding when compared to its predecessor. The lack of significant interaction with the KKK has been cited as a missed opportunity. \n[In my blog](http://boringaffairs.com/2017/11/25/wolfenstein-the-responsabilities-of-alt-history-stories/) I argued that popular alternate history stories generally do a great disservice to their audience by using a very defined entity such as the Third Reich as a front for an array of “big bads” it hardly represented in real life. I argue that this is because true, aberrant actions of the Nazis often struggle to resonate with Western European and American audiences, simply because most of the public would have been affected to a relatively lesser degree than those populations facing outright mass murder. Now, Wolfenstein is one of those games which heavily fluctuate between over-the-top action and dead-serious moments, but I think we can all agree it has the merit of at least trying to explore the horror of fascism. \n\n* How do you think Wolfenstein handles the topic? \n* Is the personal struggle of Blaskowitz complementary to the one against fascism or does the alternate history setting only serve gameplay and backdrop functions? \n* Do you think games should have the same historical accountability of other mediums?\n",
        "created_utc": 1511628051,
        "upvote_ratio": ""
    },
    {
        "title": "Exploration in video games - Specifically; Metro: Last Light Redux",
        "author": "Soup-Drogen",
        "url": "https://www.reddit.com/r/truegaming/comments/7ff0b0/exploration_in_video_games_specifically_metro/",
        "text": "I am currently playing through Metro: Last Light Redux and thoroughly enjoying it.\n\nHowever, I find myself backtracking and exploring every nook and cranny in every level to find as many supplies, secrets and collectibles as I can. This then means that I can spend a large amount of time on one level. I wouldn't categorize myself as a completionist, per se, but I want to get as much done of a level as I can and get as much from it, as I have said.\n\nThis may sound ridiculous but, this backtracking and going down every possible route on a level kind of breaks my immersion. Realistically, being a Spartan, you would want to get to your objective via the best/easiest route possible. However, I cannot just get to my objective without exploring the level entirely.\n\nAs stupid as this post may seem, I just want to get a couple of your guys' views on this type of play style and whether or not you adopt it.\n\nTL;DR - Do you explore every nook and cranny of a level before moving on or do you just complete each level without exploring 100% of it? \n\nCheers guys!",
        "created_utc": 1511614146,
        "upvote_ratio": ""
    },
    {
        "title": "Is making players redo sections of the game because of failure an outdated punishment?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7fcw5g/is_making_players_redo_sections_of_the_game/",
        "text": "[deleted]",
        "created_utc": 1511583750,
        "upvote_ratio": ""
    },
    {
        "title": "Do kids these days make avid use of game guides like in the 90s?",
        "author": "irelann",
        "url": "https://www.reddit.com/r/truegaming/comments/7fby02/do_kids_these_days_make_avid_use_of_game_guides/",
        "text": "Probably earlier too, I just grew up in the 90s so I don't want to talk about things I wasn't there for. \n\nAs a kid I and everyone I knew *always* looked up stuff on magazine guides for any games we played. We always wanted to be on top of the game, grab all the stuff and exploit all the exploits. I never even thought about it back then, why *wouldn't* I want to have all the advantages I could? The idea of game balance or spoilers never even crossed my mind, I just wanted to win.\n\n   \n \nNow it's been ages since I've done that, I always go into games as blind as possible to avoid spoilers and experience the game as the developers intended, without other people's opinions clouding my own. The idea of using exploits to become overpowered and beat the final boss in one hit sounds incredibly boring to me now, but I loved it as a kid. \n\nWhat are kids like these days regarding games? I have zero contact with children at this point in my life so I'm curious. Do they still seek guides as much as we did or do they just play the games without much outside help?\n\n(By kids I mean, say, 13 and lower. Not teenagers)",
        "created_utc": 1511573074,
        "upvote_ratio": ""
    },
    {
        "title": "I Need Game Suggestions...",
        "author": "__slothy",
        "url": "https://www.reddit.com/r/truegaming/comments/7fagi3/i_need_game_suggestions/",
        "text": "[removed]",
        "created_utc": 1511558426,
        "upvote_ratio": ""
    },
    {
        "title": "What makes a good open world game? And what is up with making games open world to begin with?",
        "author": "the_DashingPickle",
        "url": "https://www.reddit.com/r/truegaming/comments/7f9slg/what_makes_a_good_open_world_game_and_what_is_up/",
        "text": "While I am one for open world games do games really need it? Do developers use open world as a crutch or do they use it as a benchmark to show how powerful the system can render graphics and distances Etc. I used to love back in the PS2 era when open world games were scarce. \n\nBut now, has it saturated the market? And what is the quality of a good open world game I know it can be character building, the amount or lack thereof main missions and side quest, art style, or difficulty. But what really makes it good, what are some personal touches on different open world games that get you engrossed?",
        "created_utc": 1511552359,
        "upvote_ratio": ""
    },
    {
        "title": "I love the Witcher 3 a lot but the story and its characters always makes me feel like I should have knowledge of the books before playing it.",
        "author": "TheOldBlood16",
        "url": "https://www.reddit.com/r/truegaming/comments/7f90up/i_love_the_witcher_3_a_lot_but_the_story_and_its/",
        "text": "Witcher 3 is fantastic in a lot of ways and it is deserving of its praise however playing through the story for me feels like I am missing something or some piece of information that was in a book.\n\nIn Witcher 3 you are introduced to two characters Yennifer and Ciri they are both really awesome characters in their own right. I find that however with Yennifer we are led to believe she and Geralt are long lost lovers and how she is her true love but it never fells that way maybe its because they waited until the games where drawing to a conclusion to set this romance up in game but it feels like we don't have any time with Yennifer and Geralt before hand that would make players believe this and ultimately the choice to make Yennifer your permanent lover is such a whatever choice because we never see them in love before Geralt looses his memory in game.\n\nCiri is new and she is great to but it feels like we never much of her character and her hard relationship with Geralt is talked about but we never see her struggle in previous games and it makes their reunion a bit weird because we were only introduced to Ciri early on in the Witcher 3 then were told all the hard ships she had to endure and that was that it feels emotionally void.\n\nDoes anyone else feel this way also?\n\n\n ",
        "created_utc": 1511545471,
        "upvote_ratio": ""
    }
]