[
    {
        "title": "Attempting To Unravel STALKER (1979)",
        "author": "ZacharyConan",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7rbehb/attempting_to_unravel_stalker_1979/",
        "text": "Stalker is one of the most incredible films ever made. It's also one of the more unforgiving pieces we've covered on the channel.\n\nLet's jump straight into Andrei Tarkovsky's poetic masterwork.\n\nNOTE - I misspeak around the 13:00 mark when discussing The Professor. I mistakenly refer to him as 'The Writer' several times. Slip of the tongue. All apologies. \n\nhttps://www.youtube.com/watch?v=k6ZOHPJD2Mo&amp;t=471s\n\nAll films have voices. Some are louder than others, some more comforting, and others speak with esoteric tongues. Stalker speaks with truth. There is truth in cinema and Tarkovsky demonstrates it beautifully here. This is a haunting film. It's a deeply probing, deeply moving film. It's everything you ever needed to know about nihilist philosophy, gnostic escapism, and the anti-metaphysical truth that defies logic, that defies certainty. Tarkovsky operates under the precept that there is romance in the unknowable and boredom in anarchy. Stalker never loses that esoteric wish but it's stuck in its own inert mania, its own nihilist dwindle, in its own castaway depression. It's a film that knows only truth and it will tell you only what is true. I honestly think it wants to change you. It changes me in time-bomb ways. I won't think about it at all for months, then all of a sudden I find myself in a rather stunning dilemma, a dilemma so chaotic that its only way of expressing itself is through melancholy and weariness, and I turn to Stalker, I turn to the Zone, and I stand there chilled to my bones at the threshold of invaluable knowledge. The very core of my being splits and screams but I don't. I'm boring and I am without inspiration. I don't know what I want, I don't know what I don't want, I only know that I don't know. Stalker's truths are many. Tarkovsky reinvented me by simply repositioning me inside a forbidden place called the Zone. Stalker is a film about hatred, it's about accountability and it's about existing. It's about being an existent and all that goes into it (including everything that actually doesn't). It's about a scarcity of reasons.\n\nStalker is an experience that defines you. It's got wisdom and it's got teeth. It's got me, every last part of me.",
        "created_utc": 1516297184,
        "upvote_ratio": ""
    },
    {
        "title": "Obsessing Over MIAMI VICE (2006)",
        "author": "ZacharyConan",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7rbdod/obsessing_over_miami_vice_2006/",
        "text": "Wow. This misunderstood masterwork is... astonishing. \n\nPlease, watch my visual love letter to it!\n\nhttps://www.youtube.com/watch?v=PJySQ3F_L0k&amp;t=1005s\n\nThe poetic reasoning demonstrated by Michael Mann is astounding and the colorful hues he bathes Miami Vice with are absorbingly kinetic, always-present, and moving. It's a compelling film in every possible dimension. \n\nMichael Mann is one of my artistic heroes and I love his work to death. This discussion is just the tip of the iceberg. Michael Mann's Miami Vice (as well as the Anthony Yerkovich created archetypal procedural Television program it's based on and that Mann produced) is an extremely complicated work of American poetry. Spinotti may be absent from the film's photography, but Mann more than proves his supreme eloquence and demonstrates an unreal visual genius with his critical framing of expressionist colors. \n\nIt's a fascinating and vivid experience. \n\nI fully support the CULT STATUS that this film is slowly cultivating. It completely deserves it. ",
        "created_utc": 1516297009,
        "upvote_ratio": ""
    },
    {
        "title": "Is there something I am missing about \"Bright\"?",
        "author": "angelichysteric",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ray6a/is_there_something_i_am_missing_about_bright/",
        "text": "I finally got around to watching David Ayer's \"Bright\" and I am honestly and unbiasedly confused. Why are people so hyped about it? It isn't the worst thing that has ever happened to cinema, but it is also...not good? The characters and acting are so one-note it hurts a little, the plot is a smorgasbord of beats from every urban fantasy I've ever read, and the directing feels like something you'd find in a webseries. Even if people want to spark impetus for bigger Netflix offerings, why are they banking on this film? Help me, guys, this is actually bothering me. ",
        "created_utc": 1516293686,
        "upvote_ratio": ""
    },
    {
        "title": "BR2049:Why wasn't Joi a surveillance program?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7rafsd/br2049why_wasnt_joi_a_surveillance_program/",
        "text": "[removed]",
        "created_utc": 1516289441,
        "upvote_ratio": ""
    },
    {
        "title": "Back to the Future film soundtrack analysis and review",
        "author": "[deleted]",
        "url": "https://youtu.be/I8bApHIGz38",
        "text": "[deleted]",
        "created_utc": 1516288663,
        "upvote_ratio": ""
    },
    {
        "title": "The TrueFilm Weekly Plug. Post your blog, site, channel, podcast or profile right here. Week of (January 18, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r9w10/the_truefilm_weekly_plug_post_your_blog_site/",
        "text": "This is the one and only place on the TrueFilm frontpage where you are allowed, and even encouraged, to promote yourself. If you have a blog, a YouTube channel, a Twitter account, a podcast, or film that you'd like us to see, plug it here, and only here.",
        "created_utc": 1516284363,
        "upvote_ratio": ""
    },
    {
        "title": "Submarine(2010): The \"adolescent\" movie we all need in our lives.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r7q3y/submarine2010_the_adolescent_movie_we_all_need_in/",
        "text": "[deleted]",
        "created_utc": 1516255768,
        "upvote_ratio": ""
    },
    {
        "title": "Come and see Execution scene",
        "author": "ookboyo",
        "url": "https://www.youtube.com/watch?v=Uydp-hLDPjs",
        "text": "",
        "created_utc": 1516252896,
        "upvote_ratio": ""
    },
    {
        "title": "SlashFilm debates about The Last Jedi's anti-climatic resolve of Luke vs Kylo Ren (podcast)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r79ue/slashfilm_debates_about_the_last_jedis/",
        "text": "[removed]",
        "created_utc": 1516250521,
        "upvote_ratio": ""
    },
    {
        "title": "Did \"Call Me By Your Name\" cinematically convey the lovers' attraction? How did Elio and Oscar (and Elio's dad) know?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r72q9/did_call_me_by_your_name_cinematically_convey_the/",
        "text": "[deleted]",
        "created_utc": 1516248308,
        "upvote_ratio": ""
    },
    {
        "title": "SlashFilm debate on the anti-climatic resolve of Luke vs the First Order in The Last Jedi (post from me, the guy who wrote the 'Last Jedi is Poor Storytelling' piece)",
        "author": "[deleted]",
        "url": "https://www.podbean.com/media/share/pb-fy6yg-83d175",
        "text": "[deleted]",
        "created_utc": 1516228171,
        "upvote_ratio": ""
    },
    {
        "title": "La Dolce Vita - A pessimistic take on modern life in the post-religious era?",
        "author": "Lucianv2",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r4sy1/la_dolce_vita_a_pessimistic_take_on_modern_life/",
        "text": "I was a bit intimidated by its runtime, and boy oh boy was it packed. I would like to make it clear that I wasn’t 100% during the movie as I’ve been a bit sick and a bit tired these past few days, and I had to go wash my face a couple of times during the movie. \n\nI'm not sure what to take away from this movie. By the end of the movie it felt like it was showing us how “pointless” and almost “pathetic” Marcello’s life was, but earlier in the movie it almost felt like it was making it clear that marriage and modern day big city life don't go hand in hand, not to mention Steiner, the only character that has settled down with kids in the movie felt so bad about his life that he killed himself and (attempted?) to kill his own children, but there is probably more to it than that. \n\nThe first hour I was totally captivated by it, found it to be gorgeous and wonderful, wondering where it would go but when it got the (tree of life?) and the children seeing Maria I felt like it took a big downswing, I still don’t get what that whole thing was about… Like I said I was tired and sick while watching this so it probably affected my viewing but after that part it picked up again and I enjoyed the bits with the Dad and getting to see that the apple does indeed not fall far from the tree, even in its absence. \n\nThe movie feels very pessimistic by the end, I can’t tell if this was Federico’s way of saying that nothing that we used to hold dear(marriage, faithfulness and god mainly) is cared for in the modern age, even Marcello’s relationship with his father seems so non-existence as both men are busy with their jobs and are both cheating womanizers, feels like an overtly pessimistic view of the the modern and non-religious world, but perhaps this has to do with Fellini’s upgrowing in which he was raised as catholic, and the fact that a lot of religious people thing that a moral code “can’t exist” without religion. I can’t tell if it’s a commentary on the upper class or the new modern age post-religion, what was your take on it?\n",
        "created_utc": 1516227307,
        "upvote_ratio": ""
    },
    {
        "title": "Films where the city is a character in itself?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r4hl2/films_where_the_city_is_a_character_in_itself/",
        "text": "[deleted]",
        "created_utc": 1516224774,
        "upvote_ratio": ""
    },
    {
        "title": "The Lure (2015) Dir: Agnieszka Smoczynska",
        "author": "Buckaroosamurai",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r4djy/the_lure_2015_dir_agnieszka_smoczynska/",
        "text": "Recently got this film from the wife for Christmas and we finally got around to watching it and while its aesthetically pleasing, the songs are pretty great, and the pleasure of seeing the \"prince\" from the little mermaid get his comeuppance is a wonderful upending of one of the most notoriously misogynistic fairy tales ever told, and even though its transposed to 80's nightclubs in Poland it follows the traditional story pretty closely. According to the essay included, it appears to also is about growing up as children and friends of nightclub performers in Poland in the 80s. In the former I think the film is a success, but in regards to the latter other than the setting there really isn't much to belie this intent other than the setting itself and maybe a single song.\n\nThe film adds a bit to the little mermaid myth by turning the mermaid into sirens and makes the lone \"Ariel\" into a sister duo of \"Golden\" and \"Silver\". We first see them being drawn out of the water by a trio of people (2 men, 1 woman) on the beach at night drunk and singing. They begin to call the men, while the woman seems to not hear them as she dances gaily in the background. We aren't sure if the sirens are going to eat them or want something else. As the men reach out it cuts to the woman letting loose a blood curdling scream. Cut to a sleazy night club where strip teases are backed by live bands. A club owner gets a whiff of something fishy and starts to investigate his club for the source of the smell, and eventually finds the 2 sirens have been brought to the club by the trio of revelers who apparently are a band that play at this club.\n\nAs these are mythical creatures the actual age of them is unknown but I will say that the actresses barely look 18 and are topless for long stretches of the film and in the next sequence are naked and have legs but have no genitalia. I must say a lot of this film definitely made me uncomfortable just because the age of the actresses seemed so dodgy, especially since a lot of the allegory seemed to also parallel the transition of girlhood to womanhood.(Maybe I'm just a prude, but I digress). The club owner decides he's going to make these sirens into his next act especially when the trio shows that when they get wet the sirens' legs turn back into tails. \n\nThe movie is described as a horror musical and it does not shy away from so quite explicit gore throughout, but also has some truly great songs by Ballady|Romanse , especially \"I Came to the City\" the first and only real true \"Musical/Dance Number\". This song conveying the naivete and optimism of the sirens in this new world. The film continues to touch on the exploitative nature of the club world as well as female sexuality and womanhood with a strong feminist bent exposing some not only the nasty males of the myth its based on but the misogynistic views and attitudes toward being a woman. As we move into the 3rd act the \"Little Mermaid\" myth kicks into high gear and becomes the focal point of the rest of the film, and basically retells the story with the addition of a revenge ending. The scene of Silver getting her legs is the scene that most fell flat for me as it is played as a straight melancholy scene and the actresses give it their all and its shot beautifully but the conceit made my wife and I audibly laugh. Silver is given her legs (and specifically female genitalia), via literally being sawed in half with a bone saw, and the lower half of another woman being sewed on, and her tail being sewn onto the other woman. I mean I know its both a fantasy horror film, and musical but both my wife and I felt that the scene simply broke the spell of suspension of disbelief, especially when it seemed to be going for a mythical realism about everything else. \n\nThe film comes in at only 90 minutes, and in some ways I think suffers from this briefness as it makes it a little hard to connect too closely with some of the characters, some of whom are barely more than mugging faces (a common problem with musicals IMO). It also inconsistently subtitles the telepathic communication between the Sirens though its quite clear what they are saying to each other. Golden (the much more interesting character) doesn't get much to do beyond a lesbian encounter that while a great song and sequence doesn't do much for the plot or character development, and when Golden becomes infatuated with a male mythical figure confuses a lot of her narrative. \n\nThe film certainly has a clear disdain for its male characters, and I can't think of one that is portrayed in any kind of positive light, Triton (the male mythical figure) being the only one and even he brow beats Golden. Its a beautiful movie and scratches that 80's aesthetic amazingly but without being nostalgic about it. I don't know that it succeeds as a musical, a fairy tale, or horror movie, but feels like a mish mash of genres a little in-elegantly slammed together. \n\nDefinitely worth seeking out if you are after something very off the wall, idiosyncratic, and boldly feminist albeit extremely graphic in its depiction of womanhood at times a bit exploitative for this American's tastes. There is also somethings that just felt a little lost in the translation of culture and language. ",
        "created_utc": 1516223883,
        "upvote_ratio": ""
    },
    {
        "title": "Can't remember name of film",
        "author": "edders",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r4cre/cant_remember_name_of_film/",
        "text": "[removed]",
        "created_utc": 1516223708,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations on the Fandor app",
        "author": "the400blowjobs",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r4c4g/recommendations_on_the_fandor_app/",
        "text": "[removed]",
        "created_utc": 1516223559,
        "upvote_ratio": ""
    },
    {
        "title": "Is Last Flag Flying underrated?",
        "author": "AverageJoe48",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r4bb1/is_last_flag_flying_underrated/",
        "text": "Ever since I've heard Richard Linklater is making a spiritual sequel of one of my favorite films of all time (Hal Ashby's masterful The Last Detail), I felt really excited. Now that it's out, we know it's not nearly on the same level, but does it deserve to get neglected the way it did? Sure, its themes are really heavyhanded and the dialogue sometimes drags on for way too long (even for Linklater who almost always manages to maintain it fresh), but it has some advantages that put it above some of the more praised films this year. The acting was surprisingly good. Even though the starring trio was impressive throughout their careers, here they manage to create intrigue out of somewhat lackluster characters (especially Steve Carrell, whose subdued performance is a rarity for me). The film manages to keep the entertainment value high, even if it misses the mark on the original's wild spirit.\n\nAgain, I don't claim the film is anything particularly special, but its qualities weigh out the flaws. I think it is middle of the road Linklater, yet good enough to get a lot more mention than it currently gets. I'd like to hear your opinions and I wish I had more time to write a more detailed summary of my feelings. This isn't a review as much as it is an attempt to create at least some discussion about the film, I've hardly seen a mention.",
        "created_utc": 1516223392,
        "upvote_ratio": ""
    },
    {
        "title": "Zootopia: More than just a great film",
        "author": "trippy_apple99",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r395p/zootopia_more_than_just_a_great_film/",
        "text": "Hey there. I found this subreddit very recently, and thought I'd give it a try at analyzing a film and getting some opinions. Beware that I don't really know how to structure my reviews well, but I hope I get my point across.\n\nZootopia has exceeded my expectations by a long shot, and I consider it to be a masterpiece among all the best Pixar movies like Up, WALL-E, Inside Out etc. even though I'm aware that it wasn't made by Pixar. My perspective of this film is a psychological one. Psychology has been a part of my curriculum for 2 years now, so I think I've got the koalafications (pardon the lame joke) to speak about the topic. Reminder that it is preferable for you to have already watched this film before continuing.\n\nThis is a character-driven narrative. It studies the complicated thing that is implicit bias, through the main character Judy. I will talk first about her, and then Nick at the end.\n\n---\n\n**Judy**\n\nJudy has two distinct character arcs/transformations:\n\n1. Growing from an idealist to more of a realist\n\n2. Realizing that she carries implicit biases within herself, becoming conscious of her flaws\n\n**The first one** is both simple and complicated, but no less interesting. Judy is taught since she was little that the city of Zootopia was built upon peace that was created between predators and prey. They decided to live in harmony together, and proclaimed that \"anyone can be anything\". We know that she is a full believer in equal opportunities, and doesn't believe in segregation in that sense. To her, everyone deserves a chance, and nobody should be treated differently. This is what she firmly believes.\n\nThroughout her journey, from when she came to Zootopia, a city that boasts itself as an egalitarian paradise, she expected everything that she previously believed. However, as her first day on the force rolls around, she starts noticing that things aren't like she expected. This all started when she met Nick, a hustler fox. By how she handled their first encounter, Nick could instantly read her as a bright-eyed optimist. On their second encounter, after she discovers she had been hustled, Nick instantly challenges her core beliefs by telling her that things aren't the way she thinks by basically retelling her own story back to her (this is important when I get to Nick's character, so keep this in mind). Judy challenges him by saying the following:\n\n&gt; No one can tell me what I can or can't be. Especially not some jerk who never had the guts to try to be anything more than a popsicle hustler!\n\nNick lays the argument to rest by saying:\n\n&gt; Everyone comes to Zootopia, thinking they can be anything they want. Well you can't. You can only be what you are: sly fox, dumb bunny.\n\nHe indirectly says to her that he has thought the same thing at first, but that something happened, and he is now simply just a sly fox, and that she should just return to being a dumb carrot-farming bunny. This is where Judy's idealistic beliefs get their first big blow, and it just continues getting dismantled throughout the course of the story. This is where I transition to...\n\nThe second part is her finding out she holds biases that she is not aware of. This is what's called implicit bias, and it works on the principle of [nurture rather than nature](https://en.wikipedia.org/wiki/Nature_versus_nurture). She grew up with those biases being implanted in her head, starting from the very beginning of the movie, when she says that:\n\n&gt; Predators had an uncontrollable biological urge to maim, and maul, and...\n\nin her stage play. While she shows no signs so far that she is bothered by this, we know that she knows this as a fact. The part where it really shows is her encounter with Gideon after the play. He physically assaults her while stating that he is a predator, a fox, and that killer instincts are in his \"denna\". This is where she unconsciously starts being afraid of predators, more specifically foxes.\n\nAt the train station, as she is about to leave for Zootopia, we find out that her parents are really prejudiced. Her father bought her things to fend off predators with. She thinks that her father is being completely ridiculous. After her mother mentions \"DNA\" thing to her again, and citing Gideon Grey as her source of trouble, Judy instantly challenges her mother's logic by saying that:\n\n&gt; Gideon Grey was a jerk who *happens* to be a fox. I know plenty of bunnies who are jerks.\n\nAnd she is absolutely right. Her mother had no logical basis to assume that all foxes would behave like Gideon, by stating that she knows bunnies who are jerks just like him. She dismisses the \"DNA\" claim because of that, but she still keeps it at the back of her mind here. Then she decides to do an interesting thing by taking the fox repellent from her dad. She claims that this was to \"make him stop talking\", but the thing that's happening here is that she is starting to show signs of her implicit bias showing. **She consciously dismisses the DNA claim, but subconsciously sticks to it, because of what happened with Gideon. She excuses her action by claiming it's because of something completely unrelated (to shut her father up), and refuses to acknowledge why she is actually taking the repellent.**\n\nThis is the crux of what implicit bias does. She is unaware that she has made connection between predators and hunting instincts being in their DNA. She is subconsciously afraid, which is why she takes the repellent. That repellent can be seen as sort of a marker/symbol for her implicit biases. This can also be seen in the scene where she changes her mind and takes the repellent from her room. Seemingly unimportant scene, but it shows a lot about her character. She experiences [cognitive dissonance](https://en.wikipedia.org/wiki/Cognitive_dissonance) because of this.\n\nThen, we see her reaction when she first sees Nick seemingly lurking around the ice cream shop. She is instantly suspicious of him, and follows him, getting ready to use the repellent. Her biases are on the surface again.\n\nA few more remarks are made that play into Judy's mind throughout the film, like Mr. Big saying that:\n\n&gt; Deep down we're all still animals\n\n... referring to biology again. Once again reaffirming her subconscious, ushering her to believe it. Then we hear it once again in the asylum for savages when doctor tells Lionheart that:\n\n&gt; It might be in their biology\n\nYet again, she hears it once more. This is what leads to the culmination at the press conference.\n\nShe is put under pressure, she is nervous, and they invite her to answer questions. To avoid embarrassment for not knowing the answer to the question, she recites the thing that she has heard a lot of times. The thing that sounds the most logical to her:\n\n&gt; It... may have something to do with... biology\n\nAnd because of being put under pressure, she sees nothing wrong with it in the moment. After the press reacts quite visibly to her statement, she faces Nick. He is visibly angry with her because he felt utterly betrayed (explained in Nick's character further bellow). She says that she is stating \"facts of the case\", because that's how it seemed to her, but we know that those weren't facts at all, because they came from her subconscious. This nicely demonstrates a principle known as [motivated reasoning](https://en.wikipedia.org/wiki/Motivated_reasoning) in Judy, as she uses it to mitigate her own cognitive dissonance.\n\nNick acts threatening to her by exposing his teeth and claws. This is where she is thrown back to her experience with Gideon, because the two situations look identical. She responds with fear, and \"confirms\" to Nick that she did mean what she said, and Nick leaves.\n\nAfter things had cooled off, she has the chance to see the effects of her speech. She sees that predators are being laid off their jobs because they pose a potential threat. But they were really innocent and suffering the effects, and she feels terrible about it. The final straw was Bellwether offering her to be the face of the ZPD, with words \"Integrity, trust, bravery\" describing her, when she feels like a complete failure to her own ideals, and a complete failure as a cop who the mammals were supposed to trust to protect them. She hands in her badge and heads home.\n\nWhile she's home, she finds out the real reason why predators had been going savage. Thanks to the nighthowler flower, she realizes that the savagery had been induced artificially, and that prey can go savage as well.\n\nHer apology to Nick is sincere and from the heart. She admits her mistakes and flaws, and doesn't ask for forgiveness, because she knows she doesn't deserve it. In Nick's eyes, this is exactly why she deserves it.\n\nIn her final speech, she gives an inspirational and thought-provoking speech:\n\n&gt; When I was a kid, I thought Zootopia was this perfect place where everyone got along and anyone can be anything. Turns out - real life is a little bit more complicated than a slogan on a bumper-sticker.\n\nIn [the speech] she has shown that:\n\na. She has grown from an idealist to a realist;\n\nb. She realized her flaws, and is trying her best to do as much as she can to change herself, while inspiring others to start their own change, because it starts individually. We all are essentially flawed:\n\n&gt; We all have limitations. We all make mistakes. Which means - hey, glass half full - we all have a lot in common. \n\n---\n\n**Nick**\n\nHe is a very well-made character that compliments Judy's character almost every step of the way. Their dynamic is amazing, I just have to say.\n\nIn the scene where Nick is lecturing Judy, he figures out Judy's backstory so easily. She is a bright-eyed idealist that came to Zootopia in hopes of making it better. This is where we first start to see his own depth. He hits it right on the nose with Judy's story because he is exactly like her. We can subtly see it as he's talking:\n\n&gt; And whoopsie number threesie: no one cares about her or her dreams. And soon enough those dreams die, and our bunny sinks into an emotional and literal squalor living in a box under a bridge, until finally she decides to go back home with that cute fuzzy-wuzzy little tail between her legs to become... you're from Bunnyburrows out, you said? So, how about a carrot farmer? That sound about right?\n\nBut... why literal squalor and box under a bridge? This seemingly odd specific thing makes us realize that he is actually talking about himself there, and it still hits close to home with Judy too. This is the beginning of their growth as friends, even if they kinda despise each other at that moment. You can tell that Nick is relating to Judy on an emotional level there. They have common ground here, which is what helps their friendship grow later on.\n\nAfter she blackmails him into helping her with the case, they go through multiple scenes where their chemistry really start showing. They annoy and poke fun at each other through these scenes on their way of solving the case, and that's where you can really feel how well they play off each other. And they enjoy it, both of them. As much as Nick would hate to admit it, he doesn't hate the situation at all. In the limo, Nick starts to realize that the case is actually serious, and from there on co-operates with Judy and seems genuinely interested. He stopped focusing on getting the pen back, which was the reason why he was forced to assist Judy. Their jabs and insults turn more into harmless, playful banter, and they find each other's company enjoyable instead of annoying. It all unfolds so organically, it's amazing. It never feels forced.\n\nAfter Manchas goes savage they find themselves on the run, Judy trying her best to guide Nick to safety, while Nick also saves her from falling. The moment where Nick can escape on the wire thing, but chooses to wait for Judy is a testament to their built-up trust. As the backup arrives, and jaguar has disappeared, Judy is confronted by Bogo, who tells her that her time limit is up, and asks for her badge. Nick visibly reacts to this, and jumps in without hesitation to defend Judy. He ends up humiliating Bogo, and saving Judy's job. They board the wire ride, and this is where we find out the purest reason why Nick got adjusted to Judy the way he did.\n\nHe tells her that he was exactly like her when he was little. He was ambitious, determined, and dreamed of joining the ranger scouts. His dream was crushed that day, and this fundamentally changed him. He was an idealist like Judy too, but after the tragic experience he realized that there was no point to try to be more than what you're seen as. He was seen as a fox who can't be trusted, so that's what he became.\n\nNow we realize that when he was verbally destroying her at the beginning, Nick was actually telling Judy that his own outcome will get her too, which leads us to believe that he didn't actually mean her any harm when he said all those things to her. Instead, he was trying to get her to realize things before it's too late for her. He couldn't stop the event that changed his life and essentially ruined it. But Nick saw himself in Judy like in a mirror. He saw his younger self in her, before his dreams were crushed. Throughout their time together, he learned about her ambition of being a cop, and how she enjoyed doing the thing she loved.\n\nAnd when he saw that Bogo was about to take that away from her, he had to stop it. He knew he couldn't bear seeing another life getting ruined in the same way. This is the strength in writing that blew me away. It was so subtle, yet worked so perfectly.\n\nThis also explains his reaction to her betrayal at the press conference. It wasn't extremely negative for no reason. Judy was likely the first person that he had an emotional connection with in a long time. This is what made the betrayal hurt that much more, and this is what made it effective.\n\nWe know that all that time after the conference, Nick kept the carrot pen she used to record him with, showing that he was still attached to her. And when Nick heard Judy's sincere apology to the point she started crying, where she admitted her own mistakes and never asked for forgiveness, but instead begged him to help her fix her mistakes, the only thing he could do is forgive her.\n\n---\n\nThere are many other aspects of this movie worth the praise, such as an immensely interesting world, technical achievements in CGI animations, and many more. But I think this movie is Disney's finest work when it comes to storytelling and strength of the characters. I just loved it to bits.\n\nThanks for reading all the way through, and tell me what you think?",
        "created_utc": 1516215178,
        "upvote_ratio": ""
    },
    {
        "title": "Mystery Skulls - Endlessly [Electro-Pop]",
        "author": "Vetap49p6",
        "url": "https://www.youtube.com/watch?v=Lz6NovfTAeg&amp;amp;feature=share",
        "text": "",
        "created_utc": 1516207344,
        "upvote_ratio": ""
    },
    {
        "title": "Confusion about what film analysis entails",
        "author": "OhiCwhatyouDidthere",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r1sfr/confusion_about_what_film_analysis_entails/",
        "text": "I apologize if this the wrong sub for this question but it seemed like the most appropriate one for it. \n\nAccording to Wikipedia, Film Analysis is \"the process in which a film is analyzed in terms of mise-en-scène, cinematography, sound, and editing.\" That's all good but that's not what I mean when I say I am interested in Film Analysis. What I am actually interested in is understanding the underlying meaning behind movies. For example, how Mad Max: Fury Road is about Feminism(?) or how in The Squid And The Whale the creatures are a metaphor for the parents(?) and so on. My question is what is this form of analysis known as? Is it film theory? \n\nAlso, if anyone can recommend books that talk about this form of analysis and the tools needed to reach your own analytical conclusions, that would be greatly appreciated.",
        "created_utc": 1516203615,
        "upvote_ratio": ""
    },
    {
        "title": "The portrayal of Indian men in Hollywood makes me sick",
        "author": "NeedHairAdvice96",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r17pf/the_portrayal_of_indian_men_in_hollywood_makes_me/",
        "text": "Don't know if this is the right sub? I could post this to /r/movies but I imagine that this sub values more detailed discussion.\n\nAnyway, the last thing I want to come across as is an SJW, because I don't like SJW's myself, but as an Indian male, I feel that I have to get this off my chest a bit.\n\nI think that Hollywood really has done a disservice to portraying Indian men. They are either portrayed as:\n\n- Efiminate\n- Weak\n- Nerdy\n- Asexual\n\nIndian men in Hollywood are rarely portrayed as masculine, why is this? What caused this to be?\n\nI'm from a Punjabi background, and if anything our culture and history is *very* masculine. The Sikhs have a strong military history. And I'm sure many other subcultures in India do too, but especially when it comes to American media, Indian men are portrayed as, well, *losers*.\n\nThis isn't a big a problem here in the UK, because Indians make up such a large part of the population and are more ''integrated'' (I guess that is the word?) you can see TV shows where Indians have normal roles/characters.\n\nBut in America, it seems like every group of people and their mother can get a shot at being the masculine star. Hell, even white *women* are portrayed as more masculine (there's nothing wrong with portraying women in more assertive/action type roles, but I find it interesting how there's such a big push for this yet none for Indian men).\n\n**Thoughts? Am I onto something or just an emotional pathetic rant? I'm not trying to claim victimhood or anything, just my grievances.**\n\nSeems like the only big Hollywood blockbuster with an Indian lead was Life of Pi.",
        "created_utc": 1516198456,
        "upvote_ratio": ""
    },
    {
        "title": "It's Your Fun &amp; Fancy Free Discussion! (January 17, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r15w1/its_your_fun_fancy_free_discussion_january_17_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nFun and Fancy Free threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; you can even discuss tv here! Lurkers, this and our Slack team are *the* places to introduce yourself.\n\n##Sign up for the TrueFilm Slack team [here](https://whispering-temple-35722.herokuapp.com/). Our team page is [here](https://truefilmreddit.slack.com/).\n\n###Follow us on:\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) ([fellow TrueFilm users](https://www.reddit.com/r/TrueFilm/comments/3th7st/anyone_here_use_letterboxd/))\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n- [Criticker](https://www.criticker.com/profile/rTrueFilm/)\n\n- [Facebook](https://facebook.com/TrueFilmReddit/)\n\n####The sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1516197986,
        "upvote_ratio": ""
    },
    {
        "title": "Movies like \"Enter the Void\" and \"Blade Runner: 2049\" are of artistic value, but rarely succeed at the box office.",
        "author": "pencilsarelife2",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7r041b/movies_like_enter_the_void_and_blade_runner_2049/",
        "text": "I watched \"Enter the Void\" tonight, and even as a devout Catholic, with the many lurid scenes in the film, there is incredible artistic and cathartic value in it. \n\nI loved the pay-off from this film, but making films like this does not pay. The movies that often intellectually challenge paradigms and audiences are often box office bombs. Are we entering the end of the intellectual film era?",
        "created_utc": 1516184830,
        "upvote_ratio": ""
    },
    {
        "title": "Querying the reasoning behind the prejudice against Netflix original movies (and shows) and my take on why they’re important.",
        "author": "Quantum_Quentin",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qymlr/querying_the_reasoning_behind_the_prejudice/",
        "text": "I’ve noticed a lot of backlash against anything produced by Netflix. (Like what happened at the Cannes) I’ll admit that I’m not particularly well versed in this subject so please correct me if I’m wrong. \n\nI think that film for streaming services has the potential to be quite fantastic. And here’s why. The movies created in Hollywood are made for the express purpose of making money. The people involved in the production have the direct responsibility to the producer to make a movie that will create box office sales. This practice most commonly creates movies that pander to the lowest common denominator. Fun, surface level movies that your average joe will pay to see. \nWhy is Netflix better? By removing the immediate cash return, it becomes prudent for Netflix to be more experimental in what movies are made. There is greater freedom for the writers and directors. Although this system produces many weird pieces that may not be very good, it also increases the chance that something truly amazing to be made. \n\nIn short, Netflix’s system will more easily create great films than the Hollywood system. \n\n(I don’t know what the flair means, please don’t hurt me)",
        "created_utc": 1516164668,
        "upvote_ratio": ""
    },
    {
        "title": "Discussing Miami Vice by Michael Mann",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qy5dk/discussing_miami_vice_by_michael_mann/",
        "text": "[deleted]",
        "created_utc": 1516159691,
        "upvote_ratio": ""
    },
    {
        "title": "The Commuter - An exquisite short film heading B movie fare",
        "author": "CQME",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qxyy0/the_commuter_an_exquisite_short_film_heading_b/",
        "text": "I just saw the Commuter, and while the movie itself was pretty much what I expected (light popcorn fare, thinking about it hurts the brain), the introductory montage really struck me at the beginning as a really good piece of cinematography.  \n\nSince it's literally the beginning of the movie, I don't think I'll be spoiling anything by describing it - it depicts the husband waking up in the morning to an AM radio news program, his wife not responding at all to the alarm clock.  He gets up and begins his routine...then the alarm clock goes off again, this time the wife is smiling right at him.  Again the clock, this time the lights on, etc...downstairs they're having a chat about their kid's future, they eat breakfast, then husband and wife get in the car to drive to his train stop, where he begins his commute.  Through what seemed like ingenious cuts, they depict them arguing, them laughing, them coldly silent, them kissing, etc, all while the weather outside changes from autumn to snow to spring to summer.  Then he walks through the train station, and we see a fast forward montage of activity changing all around him while the husband steadily walks in real time to the train.  Then, the activity stops, the station is devoid of activity save the husband still steadily walking to the train station.\n\nThis really impressed me.  It established within 5-10 minutes everything we needed to know about the commuter's background, and that he'd been a steady commuter on this train for evidently years.  It then makes sense, without explanation, that he knows everyone on the train.\n\nThis sounds almost pedestrian, but the style that went into this montage really blew me away and IMHO was itself worth the price of the matinee ticket I purchased.  Did anyone else see this movie, and if so, were they similarly struck by the intro?  ",
        "created_utc": 1516157907,
        "upvote_ratio": ""
    },
    {
        "title": "The Red Shoes (1948) - Hot damn, everything is a feast for the senses",
        "author": "JakeTheSandbag",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qwksf/the_red_shoes_1948_hot_damn_everything_is_a_feast/",
        "text": "I don't like my title for this post. But I was absolutely floored by this film. The cinematography, the performances, the score, the story, the mise-en-scene, the script, the everything. This might be a basic little post praising a film in cliche over-generalizations, but I'm seriously blown away with how kinetic, fluid, and beautiful this movie was. Any thoughts on it from everyone else that can delve into better than I am right now, because I'm seriously surprised how engaged I was with a 1948 film about ballet.",
        "created_utc": 1516144980,
        "upvote_ratio": ""
    },
    {
        "title": "6 Films To Get You Into Silent Cinema",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=bmPAiVgv0yg&amp;t=631s",
        "text": "[deleted]",
        "created_utc": 1516140261,
        "upvote_ratio": ""
    },
    {
        "title": "Why do (some) modern coming of age films feel like they're trying so hard?",
        "author": "tiMartyn",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qvzt9/why_do_some_modern_coming_of_age_films_feel_like/",
        "text": "I want to open this question up. For the past few years, \"coming of age\" films have felt so overbearing in convincing us that characters are relatable or have a lot at stake. I'm thinking of The Fault in Our Stars, Paper Towns, and even The Spectacular Now and The Perks of Being a Wallflower. (I actually like those last two.)\n\n*The few I listed happen to be adaptions. \n\n[I just saw a trailer for a new one called \"Love, Simon\"](https://youtu.be/ykHeGtN4m94) about a teenager who's hiding the secret that he's gay, until he admits it for the first time to an anonymous classmate who comes out online. The premise of a coming of age film with a protagonist hiding their sexuality is intriguing, but throw in that anonymous student email and I lose interest.\n\nMaybe it has to do with the soundtracks often used that makes coming of age films feel like they try to hard? They're often attempting to be the next John Hughes, nostalgic classic, but they rarely earn it. Although I enjoy Spectacular Now and Wallflower, I would hesitate to call them classics.",
        "created_utc": 1516140217,
        "upvote_ratio": ""
    },
    {
        "title": "Filmmakers' interviews",
        "author": "wolfoftripoli",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7quozy/filmmakers_interviews/",
        "text": "[removed]",
        "created_utc": 1516129960,
        "upvote_ratio": ""
    },
    {
        "title": "What is the role of the Oscars in the global context?",
        "author": "mukas17",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qu0ok/what_is_the_role_of_the_oscars_in_the_global/",
        "text": "&gt; The Academy Awards, also known as the Oscars, are a set of 24 awards for artistic and technical merit in the **American film industry.** ([Wikipedia](https://en.wikipedia.org/wiki/Academy_Awards))\n\nAt the 2012 Oscars Asghar Farhadi's _A Separation_ won best screenplay and Michel Hazanavicius' _The Artist_ won in 5 categories. How do these pictures fall under the category of American film industry? The problem, as I see it, is that it then raises the question of why other excellent foreign films don't get recognized which in turn questions the worth of an Oscar, because your competition is handicapped by obscure inclusion/exclusion choices. It sets a precedent which devalues the remaining categories/years. For instance, _The Hunt_ at the 2014 Oscars was nominated in the foreign language category, but not in any other, while Mads Mikkelsen gave a very subdued and nuanced performance, arguably more demanding than DiCaprio's hysterical romp in _The Wolf of Wall Street_ or Christian Bale in _American Hustle_.\n\nThe choice to nominate several foreign films in other than the designated category seems like an \"inclusive\" move which again devalues the nomination. If they think the film is worthy then they either need to acknowledge it across the board (as they did with _The Artist_) or get their policy straight and relegate all foreign films to one category. British films are a separate question as well, they constantly get nominated while not part of the American film industry.\n\nThis \"inclusivity\" seems presumptuous to me. The Academy is taking the role of a universal judge on cinematic excellency breaking their own apparent rules based on some unknown criteria. As far as I can glean, when a film is really good (good for what? sometimes it seems like for their own image) they nominate it in any number of categories.\n\nAre the Oscars supposed to be \"the USA film awards\" or are they international? Either way, they are damaging their own credibility by either not recognizing excellent foreign films or giving out (what comes across as) \"pity awards\" as well as compromising \"the opposition\" (did the film win because it was better or because the contenders were not even nominated?) The way I see it, they need to define what they are more clearly and stick to their own criteria.\n\n\nIf I'm mistaken and there is some way in which these films qualify as part of the \"American film industry\" - please excuse me.",
        "created_utc": 1516124677,
        "upvote_ratio": ""
    },
    {
        "title": "Why are good film scores a rare thing nowadays?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qt412/why_are_good_film_scores_a_rare_thing_nowadays/",
        "text": "[deleted]",
        "created_utc": 1516117323,
        "upvote_ratio": ""
    },
    {
        "title": "An In-Depth Thematic Analysis of \"Stranger Things\"",
        "author": "ShivasRightFoot",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qszmi/an_indepth_thematic_analysis_of_stranger_things/",
        "text": "Warning: Spoilers in the body of text.\n\nGoing into watching \"Stranger Things\" I was under the impression that the show was simply an exercise in Nostalgia Porn and I had low expectations. Looking at some reviews online confirmed this view.  [This review on Mashable](http://mashable.com/2017/11/01/stranger-things-season-2-review-bad-worse-season-1/#EqBdwGfp7mqD) expresses the exact sentiment I saw before I watched the show (although I avoided spoilers so I didn't see this particular review before viewing):\n\n&gt;Last year, the overarching critique of the cultural phenomenon came down to its derivativeness, as an unabashed stew of our favorite '80s horror and sci-fi tropes. \n\nSo I was very pleasantly surprised while watching it to discover how deep in meaning, themes, and symbolism this show really is. \n\nThe central theme of \"Stranger Things\" is the contrast between Strangers and what is not a stranger: neighbors, friends, and family. This is a very clever use of the language as most people interpret the \"-er\" suffix on \"Strange\" to mean \"more\" when it may be more appropriate to interpret it as \"one who -\" like \"walk-er\" or \"plumb-er\". This occurred to me when Hopp mentions in S1:E2 that while working in a city criminals and victims were \"strangers\". In this light, all of the many references to 80's nostalgia are actually very central to the theme of the show and they symbolize the theme of familiarity in a similar way to the setting in a small town or the relationships between the main characters of friendship and family. \n\nI still haven't seen any review that comes to this realization. The closest is [this Wisecrack review](https://www.youtube.com/watch?v=ELFZARNWBJY) and while I like their stuff, they miss the point a little. The give-away is this line:\n\n&gt;Some may pin it on nostalgia, but I’m going to argue it has a lot to do with toys.\n\nMaybe toys have special importance as more than nostalgia, but that's a couple layers deep and Wisecrack blows level 1 with this statement. Nostalgia as an aspect of familiarity is central to the show.\n\nOn the blackboard early in S1 we see written the question \"what is evil?\" This made me anticipate that the show's authors saw \"evil\" as unified in some sense, and that we should be looking for commonalities between \"evil\" characters as well as looking for how the theme of familiarity fits into the good/evil dichotomy. The first season gave me the impression that lack of willingness to explore and immediate aggression toward the strange and strangers was what defined evil in \"Stranger Things\" (the mouth-breathers who bullied the party for being \"freaks\" were perhaps the most direct symbol of this form of evil), but Brenner as a scientist and explorer didn't exactly fit this view. It is a little deeper than simple exploration, it is a willingness to become \"friends\". What does \"Stranger Things\" and El/Jane in particular tell us about \"friends\"? \"Friends tell the truth.\" So not only should you be open to explore new strangers to learn about them, you have to share information yourself as well as have common goals to be truly united in familiarity or friendship. And this lack of sharing of information and goals was the sin of the scientists of the first season. The second season sees them redeeming themselves somewhat, but that is getting ahead of ourselves.\n\nEven though exploration is viewed as nearly an absolute good, \"Stranger Things\" leaves room for that exploration to fail to generate a friendship. The ex-husband and his attempts at manipulation are the most concrete example. In the past he was explored as a possible member of Joyce's family, but that exploration proved that his goals were not similar enough to Joyce's that they could have a deep relationship. Brenner and his manipulation as well as refusal to be open are another way that friendship can be rejected after exploration. \n\n\"Stranger Things\" also has a purpose for this familiarity. The reason that willingness to maximize the things you are bonded to through exploration is a good thing is that it makes you stronger by uniting you into a larger entity. The show is constantly putting characters into situations where there is some important piece of information that one group of characters has that another group really needs or could use. This occurred to me right before the scene in the junkyard where the demodogs run away. The kids in the junkyard could have warned the others that there were so many demodogs on the way and possibly prevented the deaths of the government scientists in the tunnels. The ending of S2 shows the group's integration effectively turning them into a figurative coordinated hive-mind that is able to defeat the literal hive-mind of the Mind Flayer. \n\nSo now that we have mostly discussed the themes of \"Stranger Things\" (mostly...), how original is it? The theme of familiarity and union contrasts with the individualistic views of Existentialism that are reflected in several shows in the contemporary media landscape (at least the ones that actually have deeper themes). Existentialism as a philosophy is about radical choice despite what is imposed on the individual, and that therefore the actions of an individual are exclusively that individual's responsibility. Some of the oldest applications of the idea are against the stereotypes that society assumes of minorities and women, arguing that even if society tells you to assume some role you have the choice to go against that and do what you want anyway. We can see easily the many ways this is reflected in Game of Throne's treatment of female and slave characters (although the themes of Existentialism go much deeper than that). Breaking Bad explores rejection of society's expectations in favor of personal expression from a different angle. Another pertinent application of Existentialism is to argue Nazi war criminals who plead that they were \"Just following orders,\" were in fact responsible for their actions.\n\n\"Stranger Things\" though is centered on the idea of collectivism, going so far as to make a metaphorical hive-mind entity out of the human characters in the show. It illustrates the ways that our collective existence constrains our actions, particularly by our obligations to others. At one point the issue of dissent in Democracy is addressed over the issue of informing Maxine about the secrets of the party, for example. \n\nCompromise is illustrated as an essential part of the familiarity process, and is mentioned specifically by Hopp in his parenting of El/Jane. This is also reflected in the \"watering-down\" that the reporter suggests to make Jon and Nancy's tape more successful. This is also a reason that pop-culture metaphors and analogies are sprinkled through the show and used by the in-show characters to illustrate ideas to each-other. This familiarity is partially illustrative of how the human hive-mind works; you need to understand your audience and use what you know is familiar to them to walk them slowly into more strange intellectual territory (on a meta-level the way \"Stranger Things\" references old tropes and subverts them, like having Nancy be the sharp-shooter, is a way authors do this through media)^1 . On a meta-level all of the pop-culture nostalgia references make the show successful in communication with Hollywood decision makers (who greenlit the show) and audiences. But cultural tropes are viewed as an incomplete representation of truth, just like the story about the flea or the flipped game board is an incomplete representation of the nature of the Upside-Down. Nancy isn't in Band as Steve assumes, for example (she also shoots well). So cultural roles and tropes are useful, but we have to be mindful of their incomplete nature and be willing to explore the strange.\n\nBut even stronger than compromise, allowing something else to become familiar with oneself leaves you more open to manipulation by necessity. The collective in the view of \"Stranger Things\" is defined by the mutual manipulation of its components, sometimes voluntary and sometimes through deceitful manipulation. The fact that deceit was used to positive effect in the case of Murray's tape is strong proof that \"Stranger Things\" doesn't see this as inherently evil (another case was Lucas's deceit in getting max isolated to tell her the secrets of the party, or the party lying to the teacher about El, or Dustin manipulating D'art, there are many positive uses of deceit and manipulation in the show). But this manipulation has to be done to advance the collective will of the group, otherwise you are a *virus* (technically a parasite, but the show seems to equate virus with parasite), something that uses the tools and machinery of a collective system for its own ends and not the collective good of the system. Going back to the discussion of reasons not to unite in familiar friendship, Dr. Brenner is the paragon of manipulation in the show. He represents a virus figuratively in the way the Mind Flayer is literally a virus in Will's body (Haha, cute. Just caught that. A virus inserts itself into the collective **Will**) ^2 . Getting rid of him means exposing the divergence in his values from the group's values, i.e. monsters don't like light (or exposes written by Murray). Right now I'm not sure what heat represents, perhaps closeness and emotional warmth? That seems to fit the heat lamps, but the flamethrowers seem to be more anger and retribution (as well as Joyce's face when she cranks the heat lamp).\n\nFocusing on the necessity of compromise and manipulation by others puts \"Stranger Things\" into conflict with the Existential idea of radical choice. While this is enough to establish conflict with Existential ideas, the show is very self aware of this and addresses the issue surprisingly directly. We actually see in S2:E7 the most direct confrontation of these ideas to date, and we will definitely see the story of chasing down retired Lab employees play out further. When Jane/El lets the fat former lab employee go we see \"Stranger Things\" begin making an argument rejecting the Existentialist conclusion that \"following orders\" is an invalid excuse. The change in the relationship between the main characters and Hawkins Lab between seasons also illustrates an anti-Existentialist willingness to forgive at least some employees who participated in pretty reprehensible things under the guise of \"following orders\". Kali is a Hindu god of anger, revenge, and freedom. If El is supposed to represent The Judeo-Christian Deity, He is described in sacred texts as compassionate and gracious, slow to anger, and abundant in mercy (although *jealous*, biblical texts rarely refer to The Deity as angry, wrathful, or vengeful but His jealousy is often mentioned, and we definitely see this in El regarding Maxine/MadMax).\n\nBut maybe the most interesting confrontation of Existentialist individualistic radical choice is the relationship between Jon and Nancy where their bond of intimacy is deeper and more meaningful due to historical circumstance than the relationship she has with Steve. It is specifically framed as not a matter of her choice when they are getting drunk with Murray; she would consciously choose Steve but she is forced by circumstance (\"history\" is specifically cited by Murray) to fall in love with Jon. This is echoed in the scene with Lucas's little sister who forces Lucas's He-Man doll to fall in love with her doll. Her inevitable interference in Lucas's affairs (snooping in his room), as a product of circumstance (living in the same house as siblings), is another representation of the inability of Lucas to choose to remain more distant.\n\n\"Stranger Things\" argues against Existentialism very strongly that identity and actions are a product of historical circumstance, and that individuals are largely a product of their social environment. I guess we should expect this from a pair of very close brothers.\n\n1: As a digression from the point I am making in the body of the post I'd like to discuss the use of meta-textual reference in \"Stranger Things\" and \"Westworld\". Repetition according to \"Stranger Things\" happens in culture because the old is used to introduce the new because of familiarity. In \"Westworld's\" view the repetition in culture through history is due to the fact there are fundamental commonalities to human experience across time (and culture). \"Westworld\" points to the example of Orion the constellation as an example where many human cultures point to the same natural phenomenon and create culture around it. In the view of \"Stranger Things\" there wouldn't necessarily be a cross cultural commonality of repeated themes. The things repeated in the \"ST\" view are repeated simply by virtue of happening before; they are as random and arbitrary as what family you are born into or who your neighbors were growing up. This is another thematic contrast between \"Stranger Things\" and a big popular show.\n\n2: Another digression: The contrast between El and Kali seems to set-up El as symbolic of The Judeo-Christian Deity. Will is set-up as parallel character to El in S1 chiefly, being absent when she is present and vice versa. They seem to represent the two halves of forming successful union: familiarity to the point of being able to manipulate others, represented by El and her literal ability to manipulate objects, and forming a collective will with common interests, represented by the quiet kid who is always willing to go along with what others say and is able to hide himself (symbolic of hiding his own internal desires and ego). Very Father-Jesus like, especially considering that Will is also known as Zombie Boy. This does seem to suggest a possible third element, although the \"Holy Spirit\" could be the community of friends and family among the main characters.\n\n",
        "created_utc": 1516116225,
        "upvote_ratio": ""
    },
    {
        "title": "Barefoot Gen (1983): Revisiting the Powerful Anti-War movie about Hiroshima (who has seen it and what did you think of it?)",
        "author": "[deleted]",
        "url": "https://youtu.be/J99LiXDhAO0",
        "text": "[deleted]",
        "created_utc": 1516113112,
        "upvote_ratio": ""
    },
    {
        "title": "TrueFilm’s TCM Top 20 (1/17-1/23)",
        "author": "TheGreatZiegfeld",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qrja7/truefilms_tcm_top_20_117123/",
        "text": "[An old segment from TrueFilm's past,](https://www.reddit.com/r/TrueFilm/comments/2j2mrm/truefilms_tcm_top_10_week_of_1013/) started by /u/kingofthejungle223 over three years ago. At this time /r/TrueFilm had ~55,000 subscribers, less than half of how many are subscribed today.\n\nWhat these posts do is give recommendations based on upcoming film showings on the television channel Turner Classic Movies, so all of you know what to look out for if you weren't so sure previously. Here we'll highlight some popular choices alongside some you might not have heard of. Some of the films are technically in the early morning of the 24th, but I'll be including them here anyways due to them being a part of the event taking place on the 23rd.\n\nIf you have any recommendations we didn't cover in this post, feel free to share them below. \n\n---\n\n**Honorable Mention: The Cobweb (1955) - Vincente Minnelli**\n\n*Inmates and staff at a posh asylum clash over love and lunacy.*\n\nA cult classic for the often romanticized director, but certainly worth a mention at least.\n\nAirs January 19th, 3:30am EST\n\n**20. The Stranger's Return (1933) - King Vidor**\n\n*A divorcee visits her grandfather's farm to recover and discovers a life she never expected to love.*\n\nSupposedly highly admired by Yasujiro Ozu, The Stranger's Return is an obscure early sound film by the great King Vidor that has slowly been building a reputation as a forgotten classic in his filmography. \n\nAirs January 18th, 6:00am EST\n\n**19. Oliver! (1968) - Carol Reed**\n\n*Musical version of the Dickens classic about an orphan taken in by a band of boy thieves.*\n\nWith five Oscar wins to its name, including Best Picture and Best Director, Carol Reed proves his skills lie not only in Noir, but in the Musical as well.\n\nAirs January 23rd, Noon\n\n**18. Safe in Hell (1931) - William A. Wellman**\n\n*On the run from the police, a New Orleans prostitute gets stranded in a tropical haven for outlaws.*\n\nIn the same year Wellman directed the iconic gangster flick The Public Enemy, Safe in Hell carries a similar edge through its pre-code era.\n\nAirs January 22nd, 6:00am\n\n**17. The Flight of the Phoenix (1965) - Robert Aldrich**\n\n*The survivors of a desert plane crash fight to get back in the air.*\n\nThree years after What Ever Happened to Baby Jane, and two years before The Dirty Dozen, Aldrich directs yet another beloved film of his. Among its stars are James Stewart, Richard Attenborough, and Peter Finch.\n\nAirs January 19th, 8:00pm EST\n\n**16. The China Syndrome (1979) - James Bridges**\n\n*A television newswoman stumbles onto deadly secrets at a nuclear power plant.*\n\nNominated for four Oscars, The China Syndrome would be one of James Bridges greatest moments of prominence, and also one of many acclaimed crime thrillers within the decade.\n\nAirs January 21st, 10:15pm EST\n\n**15. The Black Stallion (1979) - Carroll Ballard**\n\n*A boy and a horse forge a close friendship after being shipwrecked together in Africa.*\n\nA family classic, produced by Francis Ford Coppola and earning two Oscar nominations. While it's not as prominent as it once was, it remains highly regarded to this day.\n\nAirs January 22nd, 8:00pm EST\n\n**14. Act of Violence (1949) - Fred Zinnemann**\n\n*An embittered veteran tracks down a POW camp informer.*\n\nAct of Violence may not be Zinnemann's finest effort, nor is it a staple in the film-noir genre, but as its popularity grows, it does more comfortably fit both categories.\n\nAirs January 21st, 10:00am EST\n\n**13. Midnight Express (1978) - Alan Parker**\n\n*A young man arrested for drug smuggling fights to survive the horrors of a Turkish prison.*\n\nWith an Oscar-winning screenplay by Oliver Stone, the intensity of Midnight Express could only be matched that year by the film that won Best Picture over it, which would be The Deer Hunter. \n\nAirs January 18th, 2:15am EST\n\n**12. Cluny Brown (1946) - Ernst Lubitsch**\n\n*A servant girl's passion for plumbing shocks London society.*\n\nThe final film completed by Lubitsch, it shows a more reserved side to his comedic directing that unfortunately could not be expanded upon by Lubitsch himself.\n\nAirs January 18th, 8:00pm EST\n\n**11. Fiddler on the Roof (1971) - Norman Jewison**\n\n*In Russia before the revolution, a Jewish milkman tries to marry off his daughters who have plans of their own.*\n\nA massive critical hit at the time, and still an iconic musical nearly fifty years after its release.\n\nAirs January 23rd, 8:00pm EST\n\n**10. The Band Wagon (1953) - Vincente Minnelli**\n\n*A Broadway artiste turns a faded film star's comeback vehicle into an artsy flop.*\n\nOne of many beloved Minnelli films of the decade, with stars Fred Astaire and Cyd Charisse leading the colorful musical.\n\nAirs January 20th, 8:00pm EST\n\n**9. The Tree of Wooden Clogs (1978) - Ermanno Olmi**\n\n*Migrant workers struggle to send their child to school.*\n\nThis three hour Italian film may not be the most successful elsewhere in the world, but it holds a dedicated fanbase and a prestigious Palme d'Or.\n\nAirs January 22nd, 2:15am\n\n**8. Equinox Flower (1958) - Yasujiro Ozu**\n\n*A businessman who excels at giving others family advice, can't cope with his daughter's wedding plans.*\n\nOne of Ozu's many masterpieces, and his first to be filmed in color. Not his best known, but adored all the same.\n\nAirs January 24th, 3:00am EST\n\n**7. Chimes at Midnight (1965) - Orson Welles**\n\n*An aging knight uses his wits to survive in war and peace.*\n\nThe comedic, but also expressive and powerful Chimes at Midnight proves Orson Welles to be one of the more fascinating, and certainly among the most talented filmmakers to direct anything.\n\nAirs January 17th, 8:00pm EST\n\n**6. Day for Night (1973) - Francois Truffaut**\n\n*A committed film director struggles to complete his movie while coping with a myriad of crises among the cast and crew.*\n\nAlmost fifteen years past his feature film debut, Truffaut tackles the struggles of a director in one of his best remembered late-era films.\n\nAirs January 23rd, 12:45am EST\n\n**5. Who's Afraid of Virginia Woolf? (1966) - Mike Nichols**\n\n*An academic couple reveal their deepest secret to a pair of newcomers during an all-night booze fest.*\n\nAn intense battle between Elizabeth Taylor and Richard Burton plays out in an angry, passionate two hours. A stunning directorial debut for Nichols.\n\nAirs January 23rd, 3:00am EST\n\n**4. The Earrings of Madame de... (1953) - Max Ophuls**\n\n*When a woman sells her earrings to pay a gambling debt, it leads to a string of betrayals.*\n\nThe extravagant beauty of Ophuls' films is unmatched, and Madame de may be his finest.\n\nAirs January 18th, 10:00pm EST\n\n**3. Wings of Desire (1987) - Wim Wenders**\n\n*An angel of death gives up his wings for love.*\n\nA fantastical romance from Wim Wenders nearing his most experimental, just barely sitting in the shadow of Paris Texas as his most popular, and his most beloved work.\n\nAirs January 22nd, 10:15pm EST\n\n**2. Early Summer (1951) - Yasujiro Ozu**\n\n*A family chooses a match for their 28-year-old daughter, but she has her own plans.*\n\n Ozu's beauty in stillness is at its peak here, right in-between Late Spring and Tokyo Story. Easily in contention for Ozu's finest, which makes it also an easy contender for the finest in cinema.\n\nAirs January 24th, 5:15am\n\n**1. Make Way for Tomorrow (1937) - Leo McCarey**\n\n*A devoted couple faces the harsh economic realities of growing older.*\n\nThe only thing that could top Ozu is the film Ozu would remake into his own most popular and beloved film, Tokyo Story. And if Tokyo Story isn't the saddest film in popular film canon, Make Way for Tomorrow most definitely takes that spot.\n\nAirs January 20th, 7:45am\n\n---",
        "created_utc": 1516099703,
        "upvote_ratio": ""
    },
    {
        "title": "How Steven Spielberg reinvented the whodunnit with Minority Report",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qr4aw/how_steven_spielberg_reinvented_the_whodunnit/",
        "text": "[removed]",
        "created_utc": 1516093718,
        "upvote_ratio": ""
    },
    {
        "title": "Life+1 Day, \"siah namaii\" or How Iran is Viewed Through the Lens of a Young Director",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qqsld/life1_day_siah_namaii_or_how_iran_is_viewed/",
        "text": "Life+1 Day is not a new movie, but an unknown movie in the West. It's about an extremely poor family, so poor that one of the sisters takes cares of cats for a living, who struggle with the marriage of one of their sisters. It's implied that the biggest brother has received some dowry in exchange for letting a \"dirty Afghan\" marry her sister. His younger brother, who is addicted to meth, escapes from \"camp\" and is notified of her marriage. He is against it. But a the end of the movie, the older brother sends his younger brother to the nuthouse to deal with his addiction, paving the way of marriage. But then, the sister leaves the groom as he's taking her to Afghanistan, making the older brother angry but he finally submits. At the end, a single light reminds us that after all, this family might have a bright future.\n\nWhat I want to talk about is \"siah namaii\" or \"making it appear black\" (literal translation), the director, who's only 26 at the time, shows a mishmash of sexism, misogyny, poverty, racism, etc and if the Western audience watches this movie, they'll definitely have a warped view of Iran. I think freedom of expression is a must, but we have to ask ourselves, is it worth it? Staining your country to appease to a bunch of stuck-up Westerners? Why?",
        "created_utc": 1516088919,
        "upvote_ratio": ""
    },
    {
        "title": "Bizarre Cases Of North Korean Fame (Lots Of North Korean Cinema Discussed)",
        "author": "Davidee88",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qpgiw/bizarre_cases_of_north_korean_fame_lots_of_north/",
        "text": "Video On Some Of The Weirdest Instances Of Fame In North Korea:\n\nhttps://www.youtube.com/watch?v=lO9O-n2M_iM\n\nCinema is extensively discussed, including the kidnapping of South Korean actress Choi Eun-hee and her estranged director husband Shin Sang-ok. Kim Jong-il captured them, in order to kickstart the North Korean film industry. The most notable film that was produced as a result of the kidnappings was called Pulgasari, which has striking similarities to Godzilla. It's all covered in the video, along with clips from the films. \n\nIt also touches upon North Korea's use of U.S. Army defectors in their film industry and focusses in on James Joseph Dresnok, who played the role of American bad guy in a lot of NK films. In his previous life, he had been a soldier stationed at the border between South Korea and North Korea. He got fed up and decided to defect across a minefield, and after a few years, became a film star. ",
        "created_utc": 1516072902,
        "upvote_ratio": ""
    },
    {
        "title": "Bizarre Cases Of North Korean Fame (Lots Of North Korean Cinema Discussed)",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=lO9O-n2M_iM",
        "text": "[deleted]",
        "created_utc": 1516072617,
        "upvote_ratio": ""
    },
    {
        "title": "Format/Formula/Set of Questions for analyzing and thinking about film?",
        "author": "subsidizedtime",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qnt74/formatformulaset_of_questions_for_analyzing_and/",
        "text": "I've been using Moviepass for the past three months and my number of films viewed in theater has increased exponentially. \n\nMy Mom and Dad just got their own passes for the holidays and have similarly started going to the theaters a good bit more. \n\nIt's a nice change (and bonding experience) because generally it was difficult to get them to watch the same movies at home (either due to lack of access or interest). \n\nMy Dad and I have had multiple in depth phone calls to discuss films in the last month (generally this was something that prior to MP, might happen once per year).\n\nOne interest we discussed was having some sort of easy formula or questions set to write on for 10-15 minutes after seeing a movie. It would be a great way to have a more informed discussion, built around a similar structure, when we did re-visit the film. Additionally, years later the quick analysis would also provide a short, nostalgic glimpse into your life and state of mind at the time of viewing.\n\nI took a few film courses in college but can't remember anything too notable. Is there anything (review format, set of questions, formula) that the community would recommend for this type of idea?",
        "created_utc": 1516057472,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion on Films as Therapy",
        "author": "mattusha",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qnrni/discussion_on_films_as_therapy/",
        "text": "As a preface, I volunteer at a rehabilitative centre for persons recovering from addiction. All of the people there suffer from mental illness, be it depression, schizophrenia, or bipolar disorder. Many have lived on the streets, broken ties with family and friends as a result of their addictions, and lack meaningful relationships.\n\nI am implementing a weekly film group at the centre with the following goals:\n\n* Provide a mentally/emotionally stimulating activity to do\n* Use film as a means to expand worldviews\n* Potentially use film as a therapeutic agent\n\nI want to start a discussion on the potential of films as therapeutic devices. What films are known to have profound therapeutic benefits? Many people cite films such as Lost in Translation or Taxi Driver as being poignant depictions of loneliness, but how can these depictions benefit people suffering from such? Can the introspective nature of many films be considered a therapy in and of itself? Can using film as escapism potentially be harmful to vulnerable populations? These are just a few questions I have been thinking about as I brainstorm my approach to the third goal. \n\nI welcome personal stories of how film has helped you, discussion regarding the emotional benefits of film, or even recommendations of films that might be good to consider for my volunteer purposes. ",
        "created_utc": 1516057153,
        "upvote_ratio": ""
    },
    {
        "title": "The Longest Heist (2001) - Hackman vs. Norton (underrated?)",
        "author": "trollhistoryfilms",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qn5pq/the_longest_heist_2001_hackman_vs_norton/",
        "text": "[removed]",
        "created_utc": 1516052523,
        "upvote_ratio": ""
    },
    {
        "title": "On The Waterfront and the symbols of being trapped",
        "author": "tastar1",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qm44e/on_the_waterfront_and_the_symbols_of_being_trapped/",
        "text": "I just watched On The Waterfront last night and was absolutely delighted by it. I had seen another Marlon Brando movie, A Streetcar Named Desire, only a day before but that one didn't move me as much (although the acting and Vivian Leigh was amazing). One of the subplots that I found illustrative is of the pigeons kept on the roofs of the buildings. This is a fairly simple symbol in that a physical construction represents an analogous feeling in the characters. Primarily, the use of cages and fences, both within the context of the birds and without, represents the constriction of Brando's character, Terry.\n\nThe film opens with Terry being pushed to, unbeknownst to him, help with a murder. He calls out to Joey (a beloved longshoremen and friend of Terry's) claiming he found one of his racing pigeons, prompting Joey to meet him on the roof, where he meets his demise. This act leads to falling in love with Joey's sister, Edie, standing up to his brother Charlie, and a defiant stand against the corrupt union. Each of those encompassed some level of being trapped. \n\nTerry first meets Edie at Joey's pigeon cage and the many meetings between Terry and others at the same spot all occur with Terry tending to the birds inside the coop with the second party standing outside. There is always the chicken-wire separating the two actors, with Terry on the inside as one of the pigeons, a notorious pest often called \"rats of the skies\". The parallel is fairly obvious, he is a bum and and is caged. He is trapped in his involvement with Edie since he knows he can't keep up the relationship while simultaneously withholding his involvement in her brothers death, and once he does tell her she runs off, as if freed from a cage. Meanwhile the priest looks on from behind a wrought-iron fence, another symbol of entrapment. \n\nWhile more symbolic and there isn't much imagery to suggest it, Terry is also trapped by his brother. Charlie held him back from a boxing career (\"I coulda had class, I coulda been a contender\") and pushed him towards the criminal world run by Friendly. Once Charlie is killed for protecting his brother is Terry free to act his conscience. \n\nWhich brings us to the last moment of Terry's freedom from cages. After he testifies and is rejected by the docks, he stands up to Friendly, someone he recognizes is powerless without his goons and their guns. He stands on the gangplank and yells at Friendly and draws him out into a fight. The entire time he is standing alone, with nothing between him and Friendly, while the rest of the longshoremen are watching anxiously behind a fence. Only after Terry walks to the docks to start work does everyone rally behind him. Terry started off a caged man, stuck between keeping his head down to make a buck, the girl of his dreams and the moral voice of righteousness, but ducks and weaves his way through to the end, and escapes alive and a free man. ",
        "created_utc": 1516044585,
        "upvote_ratio": ""
    },
    {
        "title": "The ridiculousness of Brad Anderson’s Beirut (2018)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qlg2k/the_ridiculousness_of_brad_andersons_beirut_2018/",
        "text": "[deleted]",
        "created_utc": 1516039311,
        "upvote_ratio": ""
    },
    {
        "title": "Phantom Thread 70mm presentation",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qkz16/phantom_thread_70mm_presentation/",
        "text": "[removed]",
        "created_utc": 1516035532,
        "upvote_ratio": ""
    },
    {
        "title": "Need help interpreting A Ghost Story",
        "author": "newtothelyte",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qkh46/need_help_interpreting_a_ghost_story/",
        "text": "I seem to have a pretty good grasp of what's happening in the film except for one part, his neighbor ghost.  If we are to believe that Affleck finally got the closure he needed in the afterlife upon reading the note, then how do you explain what happens to his neighbor ghost? They simply disappear after their house is destroyed, but the ghost states that they are waiting for someone to show up. Are we to believe that the ghost was waiting for the construction crew to show up to demolish the house?  ",
        "created_utc": 1516031246,
        "upvote_ratio": ""
    },
    {
        "title": "It's Your Fun &amp; Fancy Free Discussion! (January 15, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qjuz0/its_your_fun_fancy_free_discussion_january_15_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nFun and Fancy Free threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; you can even discuss tv here! Lurkers, this and our Slack team are *the* places to introduce yourself.\n\n##Sign up for the TrueFilm Slack team [here](https://whispering-temple-35722.herokuapp.com/). Our team page is [here](https://truefilmreddit.slack.com/).\n\n###Follow us on:\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) ([fellow TrueFilm users](https://www.reddit.com/r/TrueFilm/comments/3th7st/anyone_here_use_letterboxd/))\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n- [Criticker](https://www.criticker.com/profile/rTrueFilm/)\n\n- [Facebook](https://facebook.com/TrueFilmReddit/)\n\n####The sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1516025152,
        "upvote_ratio": ""
    },
    {
        "title": "Why does nobody talk about Iranian cinema?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qjq8p/why_does_nobody_talk_about_iranian_cinema/",
        "text": "[removed]",
        "created_utc": 1516023672,
        "upvote_ratio": ""
    },
    {
        "title": "Are female film directors not good enough to win awards - or is it the other way round?",
        "author": "rhubarbjelly",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qiviq/are_female_film_directors_not_good_enough_to_win/",
        "text": "This post is inspired by Kelly Reichardt's *Certain Women* (2016) which I just finished watching on DVD. I was very impressed by the film. Reichardt is at the top of her game here - beautiful, sensitive, compassionate film making. I won't go into everything I loved about this film here, but I can safely say it has immediately become my favourite film of 2016. \n\nIt got me thinking about awards, and the currently popular issue of why there aren't more prominent female film directors in Hollywood, and why those there are don't win the big awards. I was surprised to discover that *Certain Women* had been ignored by both the Golden Globes and the Oscars - and yet at the same time I was not surprised at all. Although in my opinion *Certain Women* is an example of exceptionally good film making, at the end of the day it's just not 'the type of film' that attracts shiny gold things. But what does this mean? What is this 'type of film'?\n\nIs there, I wondered, something intrinsically female about Reichardt's work? I think of one of the greatest film directors of the French New Wave, Agnes Varda - another female artist who while she was not completely ignored by major awards ceremonies, never won a César for best film, nor a Palme D'or. Her films were entirely ignored by the Oscars. Varda is an artist I have always thought of as coming from a particularly female perspective, and I have wondered if this is connected to the way she was somewhat 'drowned out' by her male contemporaries, most of whom were (arguably) less talented than she. (Varda now has both an honorary Oscar and a Palme D'or. Her film *Le Bonheur* won the Golden Bear at Berlin, and *Vagabond* scooped the Golden Lion at Venice. Please correct any mistakes I've made here - I'm not an expert on this). \n\nThis all got me thinking - do these great female directors really care that much about the awards ceremonies that appear to ignore them? Come to think of it - are awards ceremonies in general a peculiarly male concept, and one in which certain talented female artists are just a bad fit. And if so, is this OK? After all, very often on this sub we spend time criticising awards as shallow and meaningless. Perhaps they are, and perhaps there are female film artists who think this too. What I'm asking is, is Kelly Reichardt just too good for the Golden Globes? And is there a way in which the whole issue of female directors in Hollywood is missing the point? Maybe great female artists don't care about little shiny statuettes. Maybe they don't want to sink to that level. ",
        "created_utc": 1516012010,
        "upvote_ratio": ""
    },
    {
        "title": "Django Unchained: What are the strengths of its screenplay?",
        "author": "curious3george",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qhm09/django_unchained_what_are_the_strengths_of_its/",
        "text": "I recently watched this Tarantino flick again yesterday. \n\nI like the movie overall but I'm not sure I really agree with all the awards showered on the script, including an Oscar for Best Original Screenplay. \n\nMaybe this is just a subjective opinion but I wonder why the already lengthy film needed to add yet another 20-30 min. for a whole section of Django being sent away after an awesome shootout sequence (one of the best in the 21st century). Am I the only one who thought that entire part of of the story was kinda pointless and unnecessary?\n\nIt couldn't just be written in a way that Django kills all the main villains (including Samuel L. Jackson's character) right then and there in the epic shootout, completes his mission and takes his wife with him, galloping away?\n\nAnyway, I know for a fact that all you people here are far more knowledgeable about this craft than I. **What did you guys like about the screenplay, pros and cons?**\n\n**What can one learn from its writing? Did it only/ mostly win the Oscar cuz Tarantino penned it?**\n\n**What are your thoughts?**",
        "created_utc": 1515994273,
        "upvote_ratio": ""
    },
    {
        "title": "How do I appreciate film more?",
        "author": "amethodicalmadness",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qhj35/how_do_i_appreciate_film_more/",
        "text": "I love watching films. I love reading up on them, sometimes I even read the screenplays. But I want to learn how to truly appreciate film. I want to start writing a film blog, but I don't know what to look for. I like the direction, the acting and so on but I don't know what makes me truly appreciate film. \n\nI prefer this community over r/movies because sometimes people just post why they hated x film but not go into details. \n\nI'd appreciate any help. ",
        "created_utc": 1515993278,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding The Prestige and the knot (Spoilers)",
        "author": "DireSire",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qga9t/regarding_the_prestige_and_the_knot_spoilers/",
        "text": "[removed]",
        "created_utc": 1515979722,
        "upvote_ratio": ""
    },
    {
        "title": "Will BR2049 survive the test of time?",
        "author": "Myxamatosis92",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qfgdc/will_br2049_survive_the_test_of_time/",
        "text": "Already after having seen it for the third time I can see THE MANY,MANY plot holes and contrivances that are just simply lazy writing.\n\nThis films plot is just NOTHING.WHY does Wallace want natural reproduction so much?The replicants will then be born and have to be looked after for 18 years until they are fully grown adults. Wallace made the Rachel clone within at most a month from her bone and hair samples.We see a replicant birth in a big plastic bag,you could store thousands and thousands in a large  space and then when they are born grow some more.\n\nWhy does K. Automatically assume the memory is real that it's him that experienced it?He gets mad for no reason as if it's him that been conned into thinking he's a replicant\n\nThe SLOOOOW pacing,Vileneuves must have thought we'd miss the gorgeous cinematography so he lingers and lingers on it for eternity,that and Ryan Goslings's face.\n\nLeto as always is AWFUL.I hated him in this film, that crummy dialogue about angels,he just eats up the screen and over does it in everything he does in these extremely small parts.He was horribly miscast in this.\n\nWhy was Deckard to be sent to ANOTHER PLANET to be tortured?\n\nThis film is faux deep,this raises NOTHING that the original didn't do already and far better.\n\nLuv was okay I guess but I don't know why the actress played her as a terminator that  occasionally cries so we assume more emotional depth from her.\n\nRobin Wright plays stock bitch but inside deeply caring because she wants some of Gosling. (That thing she did where she would point to the ground when she was making a point seemed like a very actor 101 class thing to do too)\n\nJoi was a small highlight  but it's  just like Her.\n\nHarrison Ford is Harrison Ford,he took me out force awakens too with his cranky old man routine and  who for some reason wants loads of money with all these reboots.\n\nSo we we get to the wasteland Vegas at about 1hr 45 mins into the the film,which by the way is the end of the original blade runner not including credits.And the film just STOPS.Gosling wanders around like he's on magic mushrooms touching the bees.All that just to get to Deckard which we already know is in the film from the trailers.\n\n\nThen the replicant uprising.Its a testament to how deluded I was overlooking the flaws I didn't roll my eyes in the cinema the two times I saw it.How did the writers honestly come up with this.Michael green must have forced Hampton Fancher into that.The guy who co-wrote the original bladerunner came up with this?\n\nThis film is Hollywood dying it's last breath.185 million was pumped into this,a sequel to what is only a cult film.\n\nDid they honestly think this would gross over 800 million?Showtimes were much less because for the run time.\n\n\nHollywood will shove money at anything that has any semblance of a return.\n\nI can honestly say I won't look forward to any future vileneuve films,supposedly he is going to an do dune but that will probably just be three and  a half hours of gazing at Roger deakin cinematography.\n\nThis just didn't feel like a blade runner film.It was slapped on for marketing,Hollywood claims another great film that just simply didn't need a sequel like at all\n\nThis felt like what Christopher Nolan would imagine a blade runner sequel as.It felt very much like a Nolan film and I suppose he and Vileneuves are quite similar.\n\nUsing Hans \"BLAAAAAÀAAAAMM WHAAAAÀAAM\" Zimmer.Where you replace score with loud noise.\n\nIt's average,it took no risks.It had the opportunity to be so much more.The original book Do androids dream of electric sheep was brilliant,a work of genius in my opinion.They could have taken more from it for this film.\n\nI just felt like the film came with the heading in every scene \"THIS...IS...ART\".",
        "created_utc": 1515971403,
        "upvote_ratio": ""
    },
    {
        "title": "The Shape of Water: Storytelling through Color",
        "author": "Tomahawkeye12",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qetmp/the_shape_of_water_storytelling_through_color/",
        "text": "As far as I'm concerned, Guillermo del Toro has constructed a second masterpiece in *The Shape of Water*. The direction and production quality is absolutely stunning, and there's some great character and emotion to back it up.\n\nAfter 3 viewings, one of the things that strikes me most about the film is the use of color as a character rather than simply an aesthetic choice. Specifically, I want to look at how the colors of green and red are used to communicate where characters find passion, purpose, and fulfillment. This analysis is kind of raw, and I'm sure there's stuff I'm missing or misinterpreting, but here we go.\n\nThe film has a green tint all the way through, which I'm not commenting on here. Rather, I want to look at how our main characters interact with these colors, and what it communicates about their lives. Specifically, I want to look at Elisa (Sally Hawkins), Strickland (Michael Shannon), and Giles (Richard Jenkins).\n\nI believe that, for these characters, green represents failure and emptiness, while red represents passion and fulfillment.\n\nWe'll start with Elisa, played brilliantly by Sally Hawkins. For the first part of the film, she dresses in green clothes and wears a green headband. In the opening minutes, we see her looking at a pair of red heels in a shop. After her first face to face interaction with the creature, she's riding home on the bus, and the scene is lit with red lights from the streets, illuminating her face. As her relationship with the creature progresses, so does her interaction with the color red. She wears a red headband, then buys the red heels she was looking at in the opening scene, then wears a red coat. This color coincides with her increased sense of belonging and happiness.\n\nNext is Giles. The key lime pie is green, telling us that his attraction to the pie guy will go nowhere. The gelatin in his portrait starts as red, telling us that this could be a place of meaning and passion for him. Unfortunately, he's told to change the gelatin to green, and when he delivers this version, it becomes clear that he will not find meaning here. With green pie and green gelatin, we know he's not finding meaning in his 2 primary life pursuits. However, as he develops a relationship with the creature, we see him wearing a burgundy sweater (in the scene where both he and the creature are watching the rain.)\n\nFinally is Strickland. This one feels like more of a stretch, and the colors don't seem to as obviously reflect where the character is at. That said... His candy is green and his car is green (teal, but you know, green.) When we first see his wife, she's wearing a bright red sweater. Perhaps he'll find meaning in her? Unfortunately he basically rapes her, and the next time we see her, the red is gone. ~~It does seem that she still loves him, but the color has changed.~~ **(Edit: it's more about his perspective on his family than their perspective on him.)** He's not gonna find fulfillment there, and it's made clear that he's not satisfied with her (or his family in general). Finally, the phone he uses to communicate with General Hoyt is red. Maybe this is where he finds meaning... And this seems to like up with what I understand his character: rigidity, authority, responsibility, success. This is what he holds true to, and he's desperate to succeed and prove Hoyt wrong about him being a failure.\n\nLet me know what you guys think. I definitely think some of these observations are more ambiguous than others, and I may be trying to find meaning where it doesn't exist. I just noticed these parallels and thought they meant something.",
        "created_utc": 1515965642,
        "upvote_ratio": ""
    },
    {
        "title": "Is Speilberg the best director at pulling crowds &amp; at the same time ending up in AFI list/academy nominations?",
        "author": "shubhamplank",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qe3o8/is_speilberg_the_best_director_at_pulling_crowds/",
        "text": "A thought on the directors, whose body of work, has been being good at achieving the mix of making commercially successful cinema and critically acclaimed too.\n\nLet's assume a spectrum: on one end purely acclaimed movies and another end [purely crowd puller](http://www.boxofficemojo.com/alltime/adjusted.htm?sort=year&amp;order=DESC&amp;adjust_yr=2018&amp;p=.htm). By acclaimed I mean, either having academy wins/nomination, being l[isted in AFI](https://en.wikipedia.org/wiki/AFI%27s_100_Years...100_Movies) etc or acclaimed in \"cinephile\" community.\n \nThere are lots of directors who have made either \"acclaimed but not crowd-puller\" movies or \"crowd-puller but not all-time great' movies. Only a handful of people lie in the middle of the spectrum, having made a mix of both. \n\nIn this regard, which others, in your opinion compares to Speilberg, across the eras and not just in contemporary time ( One other I can think of is Hitchcock!)",
        "created_utc": 1515959249,
        "upvote_ratio": ""
    },
    {
        "title": "Is Speilberg the best director at pulling and crowds &amp; at the time ending up in AFI list/academy nominations?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qe14b/is_speilberg_the_best_director_at_pulling_and/",
        "text": "[removed]",
        "created_utc": 1515958618,
        "upvote_ratio": ""
    },
    {
        "title": "What is it called in cinema when something looks like something else?",
        "author": "BearBarely",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qdpns/what_is_it_called_in_cinema_when_something_looks/",
        "text": "I am writing an essay and I can't find the word for when something looks like something else then makes a jump cut. For example in *2001: A Space Odyssey* the ape throws the bone into the sky then it cuts to a spaceship that appears to be similar dimentions on screen. More specifically in *Nosferatu the Vampyre*, Herzog shows a mummified corpse with it's mouth open that appears to be screaming, then cuts to Lucy screaming.\n\nIs this metonomic displacement or is there a more specific term for it.",
        "created_utc": 1515955794,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of January 14, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qbzzf/what_have_you_been_watching_week_of_january_14/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1515938749,
        "upvote_ratio": ""
    },
    {
        "title": "Blade Runner 2049 &amp; How it Phantom Menaced me.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qb3es/blade_runner_2049_how_it_phantom_menaced_me/",
        "text": "[removed]",
        "created_utc": 1515924142,
        "upvote_ratio": ""
    },
    {
        "title": "Is beautiful cinematography ever a problem?",
        "author": "FaerieStories",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7qb1g2/is_beautiful_cinematography_ever_a_problem/",
        "text": "I've heard before people make the point that some films benefit from nondescript cinematography. Boyhood for example, a brilliant film that that is fairly 'flat' in terms of cinematography: framing and composition are unremarkable, and largely the camera serves its functional purpose of capturing the action and does little else. Some might say that this muted style of cinematography is important in a film like Boyhood because more visually appealing camerawork would draw focus away from a story that's meant to feel 'real'.\n\nBut I'm not so sure. The two most recent films I've seen are The Wind that Shakes the Barley and The Witch - both great films. The former lacks anything particularly remarkable in the way it's shot, and I suspect this is largely for the same reason as Boyhood. Ken Loach has always been more interested in conveying political ideas than agonising over artistry. The Witch, on the other hand, is a visual feast, and it's no exaggeration to say that you could pause that film anywhere and the frame would be good enough to hang on your wall: lighting, composition and shot choice are all consistently sublime.\n\nSo in the Linklater and Loach school of thought, the camera in The Witch should be distracting, but I don't feel it is. Brilliant cinematography in a mediocre film might draw too much attention to itself, but brilliant cinematography in a brilliant film feels as natural as a stirring soundtrack or a convincing performance. I remain wondering that Boyhood and The Wind that Shakes the Barley, as good as they are, might not be improved with a more artistic approach to camerawork\n\nSo, can you think of an example of a film that would be much better if the cinematography were *less* beautiful or *less* visually interesting?",
        "created_utc": 1515923106,
        "upvote_ratio": ""
    },
    {
        "title": "Not bad...please support",
        "author": "Whiitex",
        "url": "https://youtu.be/rnAZ_zIFGbQ",
        "text": "",
        "created_utc": 1515894376,
        "upvote_ratio": ""
    },
    {
        "title": "Three Billboards Outside Ebbing, Missouri - Blue Lives Matter For White Middle-Class Liberals",
        "author": "NapkinsUnite",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7q6c2f/three_billboards_outside_ebbing_missouri_blue/",
        "text": "I grew up on quality films. I love quality films. If I had grown up on a farm, and was retarded, this film might impress me. But I didn’t, so it doesn’t.  \n\n.\n\n\nFrances McDormand delivers the goods the script provides. She doesn’t invent a character, she doesn’t revolutionize the art form, she translates the dialogue from the page to the screen. When you read the script it’s obvious how the lines should be read, which words should be emphasized, and when pauses should be taken. She does communicate grief in a way that’s rare to see on screen, in the form of a motivated woman. She nonverbally displays this grief in ways that effectively communicate that grief. It may sound self-explanatory and surface level but when Frances acts, she’s doing it effectively and nothing more. She’s communicating emotion and nailing emotional beats and delivering the comical moments alongside the dramatic ones with grace. This performance isn’t really anything special, most definitely not deserving of a best actress golden globe. It’s perfectly competent. Lucas Hedges, on the other hand, was atrocious. He could barely get the lines out, much less effectively communicate emotion! He wasn’t natural, he wasn’t believable, he didn’t even seem human! He lacked the grace that his costars possessed when navigated the sharp emotional and tonal shifts of the film. He was cheesy and cliche and he reduced his character to something even more shallow than what was originally on the page. An actor is supposed to invent a character, they’re supposed to take the dialogue that’s on the page and expand upon it tenfold and craft a character that means something personal to them. They need to fully inhabit this character as if it were alive. I see this a lot in high school theatre, and my performances, he’s not comfortable. He’s not inhabiting his character, he’s not falling full force into this film, he’s holding back. He’s preserving himself in his performance. Instead of building the character off of the dialogue and the director’s vision, he’s building it off of himself. He’s just him. Reacting. Not a character, living. He played the emotional beats as straightforward as he could have, he didn’t reinvent the wheel, he didn’t even use the wheel! There are small meaningless gestures that the director obviously threw into the film for no emotional effect, things that don’t connect to character or emotion or theme or really anything. Again, I think of the theatre director in my town, he finds ways of imbuing character and emotion into the blocking and the minuscule movements of characters. He finds ways of blocking scenes in ways that feel structured and meaningful yet allow for the actors to build upon them in ways that are intuitive and inform the character. Three Billboards does not. These characters move and gesture in ways that are emotionally irrelevant. These actors are only half-heartedly committing to the gestures, they do them but there’s nothing behind them. There’s no emotion backing them up. They are emotionally vacuous. McDormand relies on the script. It’s like when I played John Proctor in the Crucible, I let the script do the heavy lifting. I let the script build the character and left it at that. My performance was dictated and warped by the script. The script didn’t provide a foundation, it was the whole performance. McDormand does the same thing here, letting the script dictate her performance to an emotionally hollow degree. \n\n.\n\n\nThis is the time for Oscar bait, movies that pander to the academy, aka old white men, with sappy subject matter and cliches. Here’s a message to all those old white voters, just because a movie is about poverty, racism, cancer, or an underdog who perseveres against all odds, doesn’t mean it’s automatically a good movie. The subject matter of Three Billboards Outside Ebbing, Missouri seems to have been handpicked from a list of “Top 10 Award Season Movie Cliches.” The film then proceeds to execute on these cliches with the subtlety of a… I don’t know, something absurdly unsubtle. The trailer of this film lead me to believe this film would focus on the lack of quality police work (boy, if that isn’t an oxymoron I don’t know what is) a lack of quality police work in America, specifically focusing on a murder in a small Missourian town. I did not get that movie. The first half of this movie played with that premise, but ultimately by the second half it lost focus and drifted into the dangerous territory of attempting to redeem racist pigs. The titular billboards were put up in an effort to pressure the police to solve this murder case, the murder of Mildred’s daughter. But do we follow this storyline? Nope! Since the script reads like it was written by an amateur, the billboards inspire NOBODY to do ANYTHING about the investigation. You heard that right, not a single second is spent by anyone to look more into the case after the construction of the billboards. And all of this leads to … nothing. At the end of the movie, the audience and the characters are no closer to solving the crime than they were at the beginning. In fact, Mildred instead decides to kill some random dude who raped someone in Iraq.  Cause, yeah, that makes perfect sense from a screenwriting perspective and according to the internal logic of the film. There’s something futile and dull about a woman putting up billboards to remind the police to look into something. If the police were covering something up, or there was corruption or any number of real things that happen in real police stations all across America, you would have SOME conflict; you would have a story! But we don’t get anything even resembling a compelling setup like that. Just a glorified flier telling the cops to spend a few more hours a week on her daughter’s investigation. It’s an empty gesture that leads to some quaint little chats in her backyard about absolutely nothing. Even just SOME connective tissue would have satisfied me, have two subplots come together to form SOMETHING cohesive. Have two scenes flow into each other thematically and emotionally. Something that strings together this hodgepodge of moments. And what’s it all in service to? What’s the overarching theme of this film; what is this film saying? Grief? Sure Mildred is grief-stricken the entire film but the film never says anything about it, it never goes the extra step beyond merely showcasing something it never ventures into the potential of film and storytelling to actually comment and criticize the events of the film. She feels guilty about her daughter’s horrifying death – of course she does, that’s how anyone would feel. But the film doesn’t trust us to accept that anybody would feel that way. The movie has her feel guilty because she literally, exactly in these words, told her daughter to go walk in that field and get raped and murdered, and then she did! It’s just all so on-the-nose and unnecessary. It's a 7th grader's idea of screenwriting irony. While we shouldn’t ridicule the young people, they are trying, we shouldn’t expect that level of quality in major motion pictures! Studio films that are nominated for golden globes! Many scenes are transparently constructed with the sole intent of teeing Mildred up for a no-BS, tell ‘em how it is monologue that’s littered with swear words and set-up-less payoffs. McDonagh's signature obscenity-laden dialogue is so forced here, that the swears sound like they’re meant to be the punchlines. This screenplay RELIES on said obscenities, they’re the backbone of this script, and it comes off as idiotic and infantile. This film insists on going for the cheap laugh over the painful laugh. The film insists on having the viewer laugh at others instead of laughing at ourselves. True comedy is when the humor reveals some inner chink in our souls' armor. Not merely laughing at other people’s inadequacies. Woody Harrelson's cancer felt like bad writing 101 - a second conflict that actually undermines the premise of the film by convoluting it with an unlikely scenario. His death ultimately derails any narrative momentum the story had, and completely splits the focus of the film, as he turns into a strange spiritual guide for each of the characters. Lessons from the Screenplay talked about what makes a good subplot in his Hidden Figures video; he said that in order to be effective, a subplot must support the protagonist's story. Three Billboards does not do this, instead, Three Billboards uses the cancer subplot undermines the investigation and shifts the narrative away from everything that was set up in the first half of the film. He says the subplot must enhance the main plot. Well, in Three Billboards the subplot BECOMES the main plot. It consumes the story. The subplot is supposed to resonate the theme of the main plot. Three Billboards barely has any themes established in the first act for the subplot to resonate with. These themes are all just events. They don’t explore. About three fourths into the film, Francis hits her lowest low, and while sitting under her billboards, she meets a deer, and talks to it as if it were her daughter. This scene could have been immensely emotionally powerful, it could have left me with tears. But instead, the scene was filled with schmaltzy overly sentimental dialogue and an awful CGI deer. I mean seriously, how hard is it to import a deer and have them stand on some grass? One of this films biggest missteps, and boy oh boy is it a misstep, is the twist that the man who the audience thought was the culprit, turns out to be some random guy who just so happened to rape and murder someone else in the exact same manner as this case. This soldier comes from Idaho to threaten and intimidate Mildred, he says some pretty incriminating things to her, then comes back, sits down at the local bar next to Dixon and loudly confesses to committing an identical, fairly unique, crime at the same time as Angela's - and plot twist!- he's not the guy! If you give the viewer every reason to think that a character is the man who raped and killed the daughter, we're not stupid for believing it, and the reveal that he's not that person isn't at all satisfying. It's frustrating. How likely is it that a man who raped a girl and burned her to death in Afghanistan would go to a small town in Missouri halfway across the country from his home state where a highly publicized case of the exact same nature took place, then go and torment the mother of that person for no apparent reason, then go in a bar and brag about your rape and murder that wasn't the rape and murder in question? Just what in the land??? It seemed as if the screenwriter was slapping you across the face with the absurdity of it - dragging you by the collar from plot contrivance to plot contrivance, all while professing how clever it is. Again, it’s a seventh grader’s idea of a plot twist: you flip everything on its head for no apparent reason, you don’t set this twist up, and it’s all in an effort to confuse the audience and declare to them that you are the most cunning screenwriter in history because the whole story turned out to be a dream. If the script has a saving grace, it’s that it’s an actor's dream. Whoever plays Mildred gets to act like a crazy lunatic for two hours, which should surely earn then an Oscar nomination. That character was interesting, it was neat to see an emotionally strong and resilient woman who didn’t put up with anyone else’s crap. Someone gets to play a racist cop when racist cops are all the rage in the news. And every character seems to have a larger backstory, some legitimate depth. If this was a debut, I would be impressed. I can see the potential, this man has a keen ear for dialogue. But I’ve already seen In Bruges! And that was a much better film! \n\n.\n\n\nPolice defend the bourgeoisie and their ideals. Mainly private property, and breaking up protests that give the workers a voice. This is not an individual analysis, rather it is a class analysis. It’s an analysis of the class of the oppressor, the militarized combatants who arrest based off of laws written to target people of color and protestors. We’re introduced to Sam Rockwell’s character as someone who ‘tortures black people’ yet he acts as a goofy comic relief character and then turns into a hero without any consequence to his earlier racist behavior. Isn't it great when films glorify racist and homophobic cops? That’s why I go to the movies! It doesn’t bother me that this character is racist, it bothers me that he never gets his comeuppance. He’s never punished for his behavior. Rather, he’s rewarded, and made to look like an underdog and someone we should empathize with and love. The film explicitly redeems an irredeemable character. Racism and black people are puppets used to talk solely about the sins and redemptions of white people. The white characters are held up for their hot takes on racist policing, but there are few fully developed black characters to speak of. Like many Oscar-bait films that handle racism with kiddy gloves in order to appeal to older white liberals who want to feel good about how not racist they are, the film neatly divides the good white people and the bad white people into their respective boxes of non-racist and racists. This leads to modern white liberal audiences seeing the film and thinking that they are definitely the non-racists. They obviously don’t profit off the backs of slaves! Their ancestors were AB-SO-LUTELY anti-slavery. Obviously. This is false. Many white ancestors were slave owners. They profited off of the work of slaves. You’re not the great great granddaughter of Emma Stone’s journalist in The Help. No. More than likely, you are the descendant of a racist slave owner. This is what Get Out did so well that so many films have since failed to do: Get Out declared that white, upper middle class, liberals are just as dangerous as the openly racist. Police and their relationship to a city is a juicy theme that has plenty to explore...but THIS, save for a passing reference to killing black people, is a fairy tale police department, and the truth about police or our relationship to the police is never explored in the film! There was so much room for exploration into the theme of the ineptitude of the police and their brutal relationship with people of color, it’s a shame this film didn’t dive head first - instead it wandered confusingly from character to character, moment to moment, unconvincing accent to unconvincing accent, never truly focusing and investigating any themes whatsoever. Look at any Malcolm X speech. They are all just as if not more relevant today than when was when it was originally spoken. What does this mean? It means that the situation has not changed. Malcolm X is still as relevant as ever, the only difference is that people have the ability to view his immortal words. It means that the legitimacy of Cold War propaganda, the legitimacy of neoliberal propaganda, is waning. People now have the ability to see what Malcolm was talking about half a century ago through smartphone videos. These videos of police abusing their power and obeying their burgoiseise overlords has awakened people to the fact that the only thing that has changed since the days of Malcolm’s speeches is the year. He stated that A hundred years ago they used to put on a white sheet and used a bloodhound against People of Color, he said today they’ve taken off the white sheet and put on a police uniform, he said they’ve traded in the bloodhounds for police dogs, and they’re still doing the same thing. America touts itself as the land of the free, but there are truly only two freedoms you and I have. Number one is the freedom to enter into a subservient role in the workplace. Once you exercise this freedom you’ve lost all control over what you do, what is produced, and how it is produced. And in the end, the goods don’t belong to you. The only way you can avoid this wage slavery is if you don’t care about making a living. Which leads to the second freedom: the freedom to starve. A homeless person isn’t free to eat, they’re not free to learn, they’re not free to sleep in a house, not free to receive medicine, and not even free to work. But they’re free to speak their mind because they have zero influence. If you think America is quote-unquote free because there are some bourgeois privileges for the upper middle class, think again. You might enjoy having entertaining debates in social studies class, but the prisoners in untried permanent detention, the 32 million people who can’t read, and the people who were slaughtered by police don’t enjoy that luxury. To talk about rational argument and peaceful protest against brutal violent oppression is the liberal equivalent of letting the people eat cake. \n",
        "created_utc": 1515869455,
        "upvote_ratio": ""
    },
    {
        "title": "Mulva: Zombie Ass Kicker (Film Review)",
        "author": "hickorymonkey",
        "url": "https://www.youtube.com/watch?v=zIA0lLuV2kM",
        "text": "",
        "created_utc": 1515869215,
        "upvote_ratio": ""
    },
    {
        "title": "It: How to Make a Modern Horror Movie - Film Analysis",
        "author": "DaKinginDaNorth1",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7q578y/it_how_to_make_a_modern_horror_movie_film_analysis/",
        "text": "Video Form: https://youtu.be/h9rlIswOyUo\n\nAh, scary movies. There’s just something about them that makes us wanna keep watching. Maybe it’s the adrenaline rush that we get when we’re scared to death or maybe it’s that sense of accomplishment that we ¨made it¨ through something that terrifies us. Whatever it may be, we love horror movies, And It just became the highest grossing horror movie of all time and the fourth highest grossing R rated film at the box office, as well as having pretty good reviews. So why did it work?\n\nLet’s talk about jump scares for a second. A jump scare is not necessarily bad, when properly executed. To execute a proper jump scare, you need two things: First a proper build up of tension. And the second requirement is that it’s not a false scare. Most of the jump scares in the movie are actually properly earned. They all have a proper build up and they aren’t false. The payoff would have been really good if only they hadn't added that stupid clang noise attached to every single scare in the movie. A loud noise isn’t scary. It’s definitely startling and annoying, but scary? Not in a million years. I highly recommend you watch The Problem with Horror Movies Today over on Chris Stuckmann´s channel where he thoroughly explains how people have forgotten what scary actually is. But the point is that what's actually scaring the kids in the movie is the frightening part, not an added loud noise. (To illustrate this point, let's watch this scene of the movie as it was originally released and now a sound edited cut where there´s no loud noise after the scare). Both of these clips are just as effective in their build up and pay off, but one is annoyingly stupid and the other one isn’t. It may seem like I’m complaining way too much about a jump scare tactic that has been used for years but there is a big problem here. And that is that these loud noises take you completely out of the movie experience as you´re fully immersed. It's frustrating. So why do pretty much all modern horror movies have them? Well, the obvious reason would be that ADD audiences have forgotten what true horror is. But the real reason is the same one why everything in It is blown out of proportion.  The best example of this is the projector scene where Pennywise starts appearing on screen, which is probably the most horrific thing any one of those kids has ever seen in their lives. The situation itself is creepy. But then they had to show the huge clown coming out of the screen. (Sigh). Subtle moments like the page turning scene do not have a lasting impact on today's audiences. Speaking of modern audiences, let’s talk about the timing of the It release and why it’s so important.\n\nThe timing of the release was perfect. The obvious reason behind this is that it's been 27 years since the release of the 1990 Miniseries. But it does go beyond that. The release of an R rated It movie where kids throw around the f word like it's nothing (which is great by the way) is one reaction to the success of Deadpool two years ago, which showed that R rated movies can definitely turn a big profit. Ahhh and then there's the whole “What's old is new again¨. Star Wars, Jurassic World, Star Trek, Ghostbusters, Blade Runner, Alien, Clash of the Titans, A Nightmare on Elm Street, The Blair Witch Project, The A Team, Karate Kid, Tron, Gremlins, Mad Max, Starship Troopers, Jumanji, Robocop, The Mummy, and so on. In 2017 out of the top 20 highest box office movies, only 4 were original releases. It’s pretty clear that general audiences prefer familiar content instead of new approaches and stories. People are familiar with It, particularly because of Tim Curry´s pretty good performance in the miniseries. And we also have Stranger Things now, which is clearly a love letter to Stephen Kignisms and Steven Spielberg Isms from the 80’s. Retro is cool gain. And It has a very strong retro feel to it, very similar to Stranger Things.\n\nSo what was the point of this entire rant? It definitely wasn’t to hate on It, because it was actually a pretty good haunted house like experience with creepy moments and a memorable performance by Bill Skarsgard. But there’s a lot more to this than meets the eye. People loved It because it’s the perfect movie for modern day mainstream audiences. It had jumpscares, creepy clowns, retro kids from the 80’s that say shit and fuck and so on. It was a safe movie to make. The point of this video is just to illustrate how modern day massively popular films are pretty much genetically engineered to satisfy modern audiencies and are rarely the ramblings of a crazy man. I mean the vision of a director (Star Wars, Rian Johnson, Writer and Director). They’re like Original Glazed Doughnuts that are designed to make you fat. And this isn’t a hate letter to Hollywood either, this analysis is more observational than critical. So watch It, it’s pretty entertaining and you’ll have a good time watching it. The goal of this analysis is to create a more aware viewer that questions as to why certain things are in a movie putting them in a historical context, because big movies like these are always a direct representation of worldwide audiences.\n\nVideo Form: https://youtu.be/h9rlIswOyUo\n",
        "created_utc": 1515858930,
        "upvote_ratio": ""
    },
    {
        "title": "It: How to Make a Modern Horror Movie - Film Analysis",
        "author": "DaKinginDaNorth1",
        "url": "https://www.youtube.com/watch?v=h9rlIswOyUo&amp;t=51s",
        "text": "",
        "created_utc": 1515858075,
        "upvote_ratio": ""
    },
    {
        "title": "This Week in Film: New Releases Discussion Thread (Week of January 13, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7q4m55/this_week_in_film_new_releases_discussion_thread/",
        "text": "Please use this thread to discuss this week's latest releases. We're not harsh on the rules here; if it's new to your neighborhood, this thread considers the movie new.\n- [What IMDb](http://www.imdb.com/movies-in-theaters/?ref_=nv_mv_inth_1) considers \"new.\"\n- We also consider new releases to home video \"new.\" So if all fifty hours of *Greed* is discovered and finally released on laserdisc, then yes, definitely let us know what you think about it.\n- This is a discussion about new movies. If you are worried about spoilers, watch the movie first, and only then should you come back here. Spoilers ahead. This thread is filled with spoilers. Spoiler alert.\n- If you want to create a thread about a new movie, talk about it here first. If it does well, consider making a frontpage thread out of it. Please do not jump the gun and make a thread about a new blockbuster without seeing how it fares here. We have a rule; 1 thread per movie per frontpage. Many times, the first thread for a new movie is not the best, and the best get removed. This should help fix that.\nSo tell us; what did you think about the latest fare at the theater?\nSincerely,\nDavid",
        "created_utc": 1515852343,
        "upvote_ratio": ""
    },
    {
        "title": "FRENCH NEW WAVE : “The NEW in New Wave”",
        "author": "desicinephiles",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7q3o3f/french_new_wave_the_new_in_new_wave/",
        "text": "[removed]",
        "created_utc": 1515837386,
        "upvote_ratio": ""
    },
    {
        "title": "An offer you can't refuse. The Godfather Soundtrack Review by Awesome Soundtracks.",
        "author": "[deleted]",
        "url": "https://youtu.be/LAmWvHyfhnQ",
        "text": "[deleted]",
        "created_utc": 1515835972,
        "upvote_ratio": ""
    },
    {
        "title": "Why does Harmonica act so rapey for that one scene in *Once Upon A Time In The West*?",
        "author": "BeyondWikipedia",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7q38in/why_does_harmonica_act_so_rapey_for_that_one/",
        "text": "[removed]",
        "created_utc": 1515829636,
        "upvote_ratio": ""
    },
    {
        "title": "The Post and the Ambiguity of Virtue",
        "author": "dirteater6",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7q2fxb/the_post_and_the_ambiguity_of_virtue/",
        "text": "Spielberg knocked this one out of the park. By placing the audience smack-dab in the middle of a dogfight between the press and the state, we are able to decide for ourselves the answers to the various ethical questions this film brings about. Being a news junkie of a certain political persuasion, I must concede that Spielberg portrayed both sides of The Post's internal arguments fairly. In the critical situations shown, The Post makes a defining statement on the ambiguity of virtue. Throughout life, humans consistently make difficult decisions despite the impossibility of knowing that we are making the morally correct choices.\n\nAlthough The Post is comprehensively detailed in its storytelling, it is the responsibility of the viewer to recognize that the heroic archetype this film outlines is not always virtuous itself. Whether it be financial greed or a cozy relationship with a politician, our heroes are not immune to the forces that magnetize them away from making the right decisions. But is this not the beauty of life? Perhaps what gives us meaning is the ability to correct past misdeeds with a vehement commitment to making the world a better place?\n\nThe dynamic of a free press battling an authoritarian government hellbent on censoring the truth makes it easy for the audience to take a side. It is critical that understand our role in these situations that continue to take place in our everyday lives. I firmly believe we can best battle iniquity if we first recognize that our heroes are not without sin, and our enemies are not devoid of virtue.\n\nWe can use the framework necessary to answer all of the hard questions that life throws at us. It lies somewhere in a foggy grey area between fake news and government censorship. In a time of political chaos, this responsibility of ours has never been more relevant. Western civilization is at stake. The clock is ticking.\n\n9/10",
        "created_utc": 1515818463,
        "upvote_ratio": ""
    },
    {
        "title": "At a live Q&amp;A and double feature with William Dafoe for The Florida Project and Shadow of the Vampire",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7q1wl7/at_a_live_qa_and_double_feature_with_william/",
        "text": "[deleted]",
        "created_utc": 1515812252,
        "upvote_ratio": ""
    },
    {
        "title": "Just watched The Florida Project. Here's my take.",
        "author": "DeathbyOstrich",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7q008w/just_watched_the_florida_project_heres_my_take/",
        "text": "Very good movie. Probably don't want to watch it again though. Very real life movie, instantly reminded me of the 1995 film *Kids* and the film *Gummo*. For it's depiction of children in poverty situations. I don't think the writer/director was trying to make a political or philosophical statement at all. I've read others that claim it shows how Disney has ruined Florida, or how Capitalism sucks, or how children are innocent. I think he was trying to present a slice of life that is very very rarely looked at in depth. I think it's a brilliant film in that it holds an unflinching mirror or exposes a part of America that we don't want to think about. Poverty, what the causes of it are, how it affects everything around and in poverty. The children. The working poor, and those that simply make BAD life choices. But again, the director was simply trying to catch an accurate feeling slice and let the view make up their own minds. The scene choices and editing were great. Scenes shot under the staircases, and around corners were very clever and essential in giving the view a feel that they were peaking into this life. Also, the child acting was terrific. There is nothing I can't stand more than Hollywood children who are all to often smarter than parents, and smarter than their age should be.  These children were directed and portrayed to act appropriate for their age. Which added to the realism. I felt that Dafoe was great in a subtle performance. And the other unknowns did very well. The last thing I'll say is about the ending. SPOILER::::::\n\nThe ending shot was filmed on an iPhone. For one simple reason. Disney does not give anyone permission to film in the park. I have read opinions that the ending choice of camera was intended to be a contrast to the other parts of the film and infuse \"hope\", or finally show things from the little girls perspective etc. That's nonsense. It was simply a matter of necessity.  The filmmaker himself has made an ENTIRE movie using an iPhone 5s. Look him up. \n\nI think this one should get Oscar consideration. But not sure if it will because this year is the year of the woman overcoming the man. So 3 Billboards will probably take the indy spots on the nominations. Just my 2 cents. ",
        "created_utc": 1515793707,
        "upvote_ratio": ""
    },
    {
        "title": "New to \"true\" film, and just subbed to FilmStruck. Where to begin?",
        "author": "umboy678",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pzw8e/new_to_true_film_and_just_subbed_to_filmstruck/",
        "text": "[removed]",
        "created_utc": 1515792767,
        "upvote_ratio": ""
    },
    {
        "title": "Rainmaker (1997) - wow it's just bad",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pyeq0/rainmaker_1997_wow_its_just_bad/",
        "text": "[removed]",
        "created_utc": 1515780421,
        "upvote_ratio": ""
    },
    {
        "title": "My review of \"All the Money in the World\"",
        "author": "screenpoet",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pxnzh/my_review_of_all_the_money_in_the_world/",
        "text": "I'm trying to start a new column on my blog for film criticism. Here's my review of *All the Money in the World*. [The link to the original blog post can be found here.](https://theverboseauteur.wordpress.com/2018/01/12/review-all-the-money-in-the-world-ridley-scott-2017/)\n\n&gt;**Review—\"All the Money in the World\" (Ridley Scott, 2017)**\n\n&gt;*\"Look on my Works, ye Mighty, and despair!\"*\n\n&gt;It is a quality peculiar to the craft of the most experienced craftsmen: the things they represent are fully what they are, but what they are is not fully what represents them.\n\n&gt;This isn’t something all artists are capable of. The lines and contours may all be there, the angles all tightly balanced, the movements all precise, the decisions all purposeful: such is the work of an adequate, or even an extraordinary, workman like Clint Eastwood or Steven Spielberg. The actors inhabiting their make-believe world imitate reality, under their influence and direction, down to the merest speck of detail. But gaze a little too deeply, and that reality freezes; the details become pixellated. No twinkle in their eye, no breath of air, no elusive facet of truth the light only shines on for brief milliseconds before turning away. Nothing that makes a human image a human being.\n\n&gt;Neither of the aforementioned men ever created a character like Jean Paul Getty (insofar as Getty the character was sculpted from the mould of his life). Ridley Scott did, a man whose résumé is embroidered like few others are, but who has often manoeuvred his needle too far off the mark (compare 2014’s anchorless *Exodus: Gods and Kings* to the other heterodox Bible adaptation from that year, *Noah*). One cannot rank Scott among the greatest of his field without causing a little consternation, if only for the unevenness of his oeuvre. If one calls him an auteur, one must simultaneously note his limitations. But it was he who took Getty off the pages of David Scarpa’s sparkling, if occasionally stolid (and never stodgy), script, and created a living, eating enigma from it. What is the secret of J. Paul Getty? What makes J. Paul Getty tick? The script poses this question; the movie rebuffs it.\n\n&gt;Christopher Plummer, who plays the Getty patriarch, was Scott’s first choice for the role he later obtained from Kevin Spacey in a now-infamous series of events that would certainly have pleased the old Getty, if only for the sheer incredulity of everything turning out well in the end. Because Plummer, unconstrained by Spacey’s prosthetic mask (and guilty conscience) and being the right age for the role, plays every facet of Getty at once: cold, avuncular, entitled, humble, blinkered, intelligent, smug, and filled with a terrible regret that informs his every choice. With an assured verve he reveals the personas at his disposal. One lies dormant, say, for a few minutes, and then suddenly flares into light with a crack of the voice or with a curl of a lip. Then it fades, and another takes its place.\n\n&gt;And yet we see more of J. Paul Getty in his person than may have existed in the real item. Introduced at the tail of a short tracking shot through a palatial corridor, he is cast in the cold greys of morning, entangled in an endless train of ticker tape, an incessant record of his undulating fortunes. Informed of his grandson’s kidnapping, his responds: a curt dismissal, and back over the ticker tape he bends. Plummer plays him like a person who successfully hides the terrible emotions that combat within him every moment of the day, whose internal contradictions very subtly underscore the lambasting he receives from the two Marxists that appear in one scene: just like the contradiction in the fact of his wealth in the face of proletarian suffering, there is a contradiction in the fact of his wealth in the face of his grandson’s suffering, and the all-consuming contradiction of his pursuit of wealth to the neglect of his children. His wealth invites suffering, and his greed prolongs it. He refuses to pay the ransom, because he reasons it would only put his other grandsons in kidnappers’ visors. When he does consider paying it, he demands in return a relinquishment of parental rights from the young Getty’s estranged mother, his former daughter-in-law, Gail Getty (Michelle Williams), and even then he would only pay a fraction of the demand. He confides in a moment of candour to his ex-CIA negotiator, Fletcher Chace (Mark Wahlberg), that he does indeed love his grandson very much. But when asked what it would take for him to lift a finger to help, his monosyllabic reply is dispiriting, almost chilling, in its ambiguity: \"More.\" Love versus greed: a clash of titanic forces that has left him attrited.\n\n&gt;The senior Getty is a mammoth of a character; his presence dominates the entire movie. It casts it in shadow from beginning to end, but there is one other character who stands out in that shadow. Whatever Getty Senior is, Gail Getty is his diametrical opposite. Taste, power, spirit, or wealth: they share nothing, except a name whose light is steadily dimming. The end of the Getty empire may be said to have begun with the abduction of John Paul Getty III (Charlie Plummer, no relation), and the resultant scandal. The film gives Gail an instrumental (and deliberate) part in its decline. The movie benefits from having its two most significant characters never actually meet or talk directly to each other once the main plot begins (except for a single vital scene close to the climax). Such an arrangement allows for their personalities to develop autonomously, and keeps their mutual antipathy from overshadowing the real conflict of the plot.\n\n&gt;Gail, desperate, suspicious, suspected, suave: the rattling engine of the film, David Scarpa’s contribution to the index of strong female characters, whose charm and fortitude elicit only mistrust from the people she is asked to trust. While the old Getty is a man obsessed with ancient objects, whose plaster and marble and stone bodies, he seems to believe, are imbued with a mystical anamnesis, she is far more pragmatic. A cheap Minotaur trinket from Heraklion is to Getty Senior an invaluable relic, a heirloom from all the imperial Gettys of history; to Gail it is a showpiece, albeit a priceless showpiece. She sees through the façade of luxury the senior Getty puts up about his empire: she sees the poverty, the void, within. She deprecates it; she much prefers the company of human beings. The scenes in which she is at her happiest, or in times of duress at her most content, is when she is around the people she loves. She dances with her children in the middle of breakfast; she makes out with her husband over the dinner table, having sent the kids out of eyeshot; and, when living in a house garrisoned by Italian policemen, she sleeps in a bed surrounded by her three younger children. And in a film which seeks to chill its audience with tones of icy blue, these scenes are suffused in a warm orange.\n\n&gt;The film, lensed by veteran cinematographer Dariusz Wolski, is a masterwork of lighting. Our collective memories of the 1970s, remembered in photographs, movies, songs, and words, are condensed into the lighting-work of the film, responding to our minutest, most obscure images of that decade. The gloss of vinyl, the flicker of candlelight, the harsh glare of red bulbs at night, along with a sweeping, reverent score by Daniel Pemberton: they tug at forgotten references in our brains, leaving us to revel in the pleasure of finding ourselves transported: transported to another age, when mafiosi lurked in the chasms between yellow Roman streetlights, when snow fell like a stream of salt, preserving antique ruins in time, when the towers of a crumbling empire still disappeared into the cold blue sky.",
        "created_utc": 1515774309,
        "upvote_ratio": ""
    },
    {
        "title": "Directors Talking About Their Films",
        "author": "Braveson",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pxbnk/directors_talking_about_their_films/",
        "text": "“If you try to probe, I’ll lie to you. Seventy-five percent of what I say in interviews is false. I’m like a hen protecting her eggs. I cannot talk. I must protect my work. Introspection is bad for me. I’m a medium, not an orator. Like certain oriental and Christian mystics, I think the ‘self’ is a kind of enemy. My work is what enables me to come out of myself. I like what I do, not what I am … Do you know the best service anyone could render to art? Destroy all biographies. Only art can explain the life of a man — and not the contrary.” \n-Orson Welles\n\nJust a quick post. I've seen a few people citing a director's comments on his own film as if that's the final interpretive word, but this is never the case. First of all if a director explains something about his film he's either failed to convey his point in the movie (bad art) or is talking about his intention (whether he was successful in his intention is another question altogether).\n\nMost good directors will deflect any questions about \"what their movies mean\" and when they do offer an answer it's usually bland or offered in the spirit of \"this is what I think I was doing\" but their words must submit to the movie. The movie is the definitive statement, not whatever was in the director's head at the time of filming.\n\nEDIT: I also came across this quote today and I thought I'd post it. It's about poetry, but the principle for the director is the same:\n\n“Surely no one can believe that poets invidiously veil the truth with fiction, either to deprive the reader of the hidden sense, or to appear the more clever; but rather to make truths which would otherwise cheapen by exposure the object of strong intellectual effort and various interpretation, that in the ultimate discovery they shall be the more precious.” -Giovanni Boccaccio",
        "created_utc": 1515771307,
        "upvote_ratio": ""
    },
    {
        "title": "It's Your Fun &amp; Fancy Free Discussion! (January 12, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pwrhl/its_your_fun_fancy_free_discussion_january_12_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nFun and Fancy Free threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; you can even discuss tv here! Lurkers, this and our Slack team are *the* places to introduce yourself.\n\n##Sign up for the TrueFilm Slack team [here](https://whispering-temple-35722.herokuapp.com/). Our team page is [here](https://truefilmreddit.slack.com/).\n\n###Follow us on:\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) ([fellow TrueFilm users](https://www.reddit.com/r/TrueFilm/comments/3th7st/anyone_here_use_letterboxd/))\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n- [Criticker](https://www.criticker.com/profile/rTrueFilm/)\n\n- [Facebook](https://facebook.com/TrueFilmReddit/)\n\n####The sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1515765958,
        "upvote_ratio": ""
    },
    {
        "title": "Review: Gay for Pray: The erotic adventures of Jesus Christ. I love movies that are really different, and present a concept that I’ve never considered before. This movie is hysterical. This reviewer is just normal guy discussing the movie, so I thought it was a good fit here.",
        "author": "[deleted]",
        "url": "https://youtu.be/54hx9fO1LqM",
        "text": "[deleted]",
        "created_utc": 1515764747,
        "upvote_ratio": ""
    },
    {
        "title": "Review: Gay for Pray: The erotic adventures of Jesus Christ",
        "author": "[deleted]",
        "url": "https://youtu.be/54hx9fO1LqM",
        "text": "[deleted]",
        "created_utc": 1515764123,
        "upvote_ratio": ""
    },
    {
        "title": "Exploring the relationship between the upcoming The Irishman (2019) and Scorsese's other gangster movies",
        "author": "The_Social_Introvert",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pw24o/exploring_the_relationship_between_the_upcoming/",
        "text": "[removed]",
        "created_utc": 1515757332,
        "upvote_ratio": ""
    },
    {
        "title": "Mystic River: Does Jimmy feel remorse for killing the wrong man?",
        "author": "lbailey224",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7psgrb/mystic_river_does_jimmy_feel_remorse_for_killing/",
        "text": "[removed]",
        "created_utc": 1515714719,
        "upvote_ratio": ""
    },
    {
        "title": "[Spoiler]A Ghost Story - Rant(Kinda)",
        "author": "Lucianv2",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7psarz/spoilera_ghost_story_rantkinda/",
        "text": "This one is actually a rewatch. I liked it the first time that I watched it but my oh my did I love it this time around. Perhaps its because I’ve watched so many more films since the first time that I watched it that my appreciation for it has gone through the roof. I think A Ghost Story, and particularly the first 48 minutes of it, is absolutely brilliant. It captures the intimacy of relationships in such a subtle way and it makes you feel like you’re a part of it, with the aspect ratio of the movie being a big contributor to this. \n\nI don’t get the hate for the pie scene honestly. The first time I watched this movie I really felt its length but also recognized its importance. It’s one of the few times that I’ve seen real time in cinema go on for that long. This time around it felt much shorter weirdly enough, it felt like it was only about 3 minutes or so, but I still appreciate it. To quote the director and writer David Lowery: **“Hopefully, two minutes into it, when people realize it’s still going on, the anticipation just evaporates and you just exist in that scene the way it was intended to function.”**.\n\n Outside of being there to serve as a contrast to the later parts of the film where time goes by faster and faster, it’s also one of if not the single best scene that I’ve seen that perfectly demonstrates grief. No bullshit over the top overacting, just a simple 7 minute take of someone comfort eating pie to deal with the loss of a loved one, it doesn’t get more real than that. And honestly that’s where the movie peaks for me, the first 48 minutes where it tells a personal story from the unique perspective of a ghost about grief and loss and moving on, the scene with Rooney Mara’s character moving out and sitting in her car showing that time heals most wounds, it’s absolutely brilliant…\n\nThen we move on to the second half of the movie, and just to note I still liked most of it, but the focus shifts into something else(even though some of the themes such as the passage of time and death remains). There is one particular scene that bothers me, and anyone that have watched this movie will know exactly which scene it is. For a movie that relies on visual storytelling and was doing such a brilliant job, that scene with the dude explaining the meaninglessness of life and legacy in such a cynical way feels like we went from 100 miles an hour to hitting a road block. I’m still not sure why the director chose to have this scene, and I can’t tell if it is meant to be taken as the “message” of this movie. I know the director was in a dark time in his life when he wrote this but the cynical message feels so out of place specially considering the movie that he’s made. I’m sure many people will be moved by this movie, and some of them will get crushed with how hard they relate to the events being shown, but there is at least hopefulness in the first half, an inspiring take on grief that “time eventually heals all wounds”, and to me that alone is worth making art for. But my interpretation of that dude’s speech is that it doesn’t matter if you affect millions if not billions of people, even that small part of you that lives on will eventually die, making all of it meaningless… With that being said, I understand the directors perspective, [considering that he had an existential crisis when he decided to make the movie]( https://www.theguardian.com/film/2017/aug/09/a-ghost-story-interview-david-lowery-casey-affleck-rooney-mara-pie), when looking at it from that perspective the message becomes much more digestible, although the scene still remains out of place in the movie and *almost* ruins a movie by trying to get too much of the director into the film through expositional dialogue. \n\nThat being said I still think this movie is absolutely brilliant, it's weirdly one of the most touching movies that I've seen in a while, and outside of that one scene, it is able to convey its messages and themes in such a subtle and excellent way! What did you think of it?",
        "created_utc": 1515713206,
        "upvote_ratio": ""
    },
    {
        "title": "Im interested on learning cinema (movie literature)",
        "author": "HeWhoHatesPuns",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7prgfb/im_interested_on_learning_cinema_movie_literature/",
        "text": "Hi. I dont know if this is a weird question, but here goes:\n\nIm a biology student but my great passion is cinema. Im very interested in learning filmmaking in-depth. However, I dont have much time or money to spend on cinema classes so Im wondering if theres any resources (especially books) where I can read more about movies. \n\nIm currently taking the free online course from MIT (The film experience) and Im loving it. What are the \"must read\" books that cinema students study?\n\nIm mostly interested on screenwriting, but Id love to read a little bit about everything movie-related. Ill take what I can get. Thanks!",
        "created_utc": 1515706025,
        "upvote_ratio": ""
    },
    {
        "title": "Analyzing film (the silence of the lambs and a fistful of dollars",
        "author": "aesmxrtin",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pqc4g/analyzing_film_the_silence_of_the_lambs_and_a/",
        "text": "I have 2 problems:\nProblem 1 - First off: I’m a sophomore in high school with aspirations of going to film school and becoming a director. A few months ago (thanks to r/truefilm) I began watching movies every week based on director. I started off with Scorsese and fell in love with ‘Taxi Driver.’ I finished most of his filmography then watched Hitchcock (who I spent the most time on), Billy Wilder, and other classic films. Recently I watched ‘A Fistful of Dollars’ but didn’t really enjoy it. I’ve watched ‘Once Upon a Time In America’ with my grandpa and loved it, but this film didn’t really stick to me. From what I remember, the movie felt a little flat. I felt that there was a cool plot, but barely any thematic elements or use of symbolism. It just felt like it was empty? I felt like the characters were hastily developed and Clint Eastwood’s character came off too exaggerated and pretentious. Am I missing something because I feel like there should be a reason it’s regarded as such a classic. A week later I watched ‘The Silence of the Lambs.’ I enjoyed the plot and the characters, but again it felt like that was all there was. The most I got out of the film was how Clarice was constantly viewed as inferior by other men. I’m really bad at reading camera movement and cinematography, but I noticed the use of camera to show the smallness of Clarice created by the men. Other than that the film felt like a nice story. What I’m trying to get out of this is that I feel I’m lacking something when watching and analyzing a film. I’m not entirely sure, but I can’t really give a movie a grade or clear opinion. \n\nProblem 2 - I’ve been watching Channel Chriswell and other video essays on film analysis. I just can’t seem to analyze a film the way these professionals do. The most I get out of a film is a vague feeling of ‘I liked it’ or ‘I disliked it,’ and a few themes, symbols, and concepts. I have particular trouble with visual literacy. I can’t understand the use of camera movement, cinematography, and the reasons behind certain uses of placement in a scene. How do I better understand these things and analyze a film with these tools? I feel like I’ve been watching many movies but the level of interpretation has only improved a little bit. Thanks everybody and sorry for the huge jumble",
        "created_utc": 1515696998,
        "upvote_ratio": ""
    },
    {
        "title": "Mini Film Series with Chinatown as a seed",
        "author": "eventfieldvibration",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ppdc0/mini_film_series_with_chinatown_as_a_seed/",
        "text": "I'm starting up a small viewing series for my partner to take place over the course of a few weeks, exposure to some great films. \n\nIt all started with a conversation about Chinatown, so we watched that, and now I'm not sure how to proceed. I want there to be somewhat of a theme, not necessarily auteur. \n\nI'm on the fence about continuing with noir. I'm tempted to play Blowup next. \n\nDon't want to continue with Polanski yet.",
        "created_utc": 1515689078,
        "upvote_ratio": ""
    },
    {
        "title": "The TrueFilm Weekly Plug. Post your blog, site, channel, podcast or profile right here. Week of (January 11, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7poa7o/the_truefilm_weekly_plug_post_your_blog_site/",
        "text": "This is the one and only place on the TrueFilm frontpage where you are allowed, and even encouraged, to promote yourself. If you have a blog, a YouTube channel, a Twitter account, a podcast, or film that you'd like us to see, plug it here, and only here.",
        "created_utc": 1515679556,
        "upvote_ratio": ""
    },
    {
        "title": "I am drafting a film or possibly a series about female twins. I am looking for an artistic partner or a skeleton crew.",
        "author": "synecdocheandrea",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pmffo/i_am_drafting_a_film_or_possibly_a_series_about/",
        "text": "[removed]",
        "created_utc": 1515654653,
        "upvote_ratio": ""
    },
    {
        "title": "NOLAN PEEKS INTO THE MIND OF CINEMA",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7piok3/nolan_peeks_into_the_mind_of_cinema/",
        "text": "[deleted]",
        "created_utc": 1515617949,
        "upvote_ratio": ""
    },
    {
        "title": "NOLAN PEEKS INTO THE MIND OF CINEMA",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pio6m/nolan_peeks_into_the_mind_of_cinema/",
        "text": "[deleted]",
        "created_utc": 1515617855,
        "upvote_ratio": ""
    },
    {
        "title": "[Spoiler] Treasure from the Wreck of the Unbelievable rocked my world, and here's why. (Extra spoiler-y)",
        "author": "LastArmistice",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pi95w/spoiler_treasure_from_the_wreck_of_the/",
        "text": "This documentary caught my interest right away when it came up in my suggested titles list on Netflix. I watched it the same night I saw it was out- 2 days later, I'm still reeling from shock. \n\nDazzled and agape at the treasures a team of divers, scientists, and historical consultants brought up from the seabed off the East African coast, dating back to the first century C.E., this 'documentary' had me fooled from the very beginning right up until the very end. When the credits rolled, first I felt let down- so all those incredible artifacts were a modern farce? Not done by the masters of the classical world, but rather some hipster from the UK? But then something happened- the full metaphor, the bait-and-switch, the insight into the human condition and the desire to believe the incredible and extraordinary, and all the incredibly thoughtful and risky endeavors to make both the art and the documentary real, it came crashing down on me, and I realized that the documentary and the exhibition were both masterpieces. \n\nWhat an incredible thrill as the cerberus, Medusa bust and that giant hydra statue came up! Not to mention that huge golden disk. It was like seeing the sun itself. So beautiful, so priceless, so mysterious, so majestic. A few times I caught myself thinking \"I can't believe this is real, this must be one of the most important discoveries in history! How extraordinary that this exists in the world again now.\" How indeed. \n\nThe thing is, the artist made it clear from the very start- with the title even- that this was a concept exhibition, with believing in the unbelievable being the main concept. And after watching it a second time in 2 days (don't judge me), there are so. many. clues. throughout the film that make it fairly obvious that this wasn't a real excavation. The artists uses our preconceived notions (\"maybe this is modern? Nah, I mean, why the hell would they bother sinking this stuff just to make a fake documentary about it?\") and our desire to believe the incredible (the story, the beauty, the discovery, the history) to create another layer of meaning on top of his already amazing art exhibition. \n\nWith all the beauty of classic fine arts and aesthetics, and all the metaphor and abstractness of contemporary art, Damien Hirst (the artist) creates something truly brilliant, truly exceptional. Usually I find contemporary art to be oddly esoteric or trying a little too hard to be truly brilliant or special. Many will disagree with me and I understand completely, but this documentary, and the exhibit, blew my mind in ways most art never can. It's symbolism carved new holes in my brain.\n\nMy only complaint on how this was handled is that they crafted just the one story for the 'wreckage', which puts the imagination down one linear path. For how big of a concept this was, I wish they'd spared one or two more ideas on how the treasure got to be where it was. Otherwise, this was a masterpiece of an idea.\n\nWould love to know the community's thoughts on the matter.",
        "created_utc": 1515614536,
        "upvote_ratio": ""
    },
    {
        "title": "looking for films and directors that use weather, rain, water, the wetlands, places of forgetting the same was as Tarkovsky",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pi4ub/looking_for_films_and_directors_that_use_weather/",
        "text": "[removed]",
        "created_utc": 1515613573,
        "upvote_ratio": ""
    },
    {
        "title": "THE FALLIBILITY OF MAN AND HIS INSTITUTIONS IN THE LADY VANISHES",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pi2rq/the_fallibility_of_man_and_his_institutions_in/",
        "text": "[deleted]",
        "created_utc": 1515613119,
        "upvote_ratio": ""
    },
    {
        "title": "Frederick Wiseman's documentaries will be available to stream in a couple of months",
        "author": "menevets",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7phk3o/frederick_wisemans_documentaries_will_be/",
        "text": "Wiseman's Ex Libris, a documentary on the New York Public Library, is among the documentaries that could be in contention for an Oscar this year and one of my favorite movies of 2017. It's over three hours, but he lets the camera linger on its subject for a long time, you don't really see this much. \n\nHis whole catalog, which is a lot of documentaries, like National Gallery, will be available as well.\n\nYou'll need a library card and your library to support Kanopy. Just sign up and you can stream from the popular streaming devices or your laptop.\n\nhttp://deadline.com/2018/01/frederick-wiseman-catalog-heading-to-free-streaming-service-kanopy-1202239250/",
        "created_utc": 1515608915,
        "upvote_ratio": ""
    },
    {
        "title": "Frederick Wiseman's documentary coming to Kanopy in a couple of months",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7phgt5/frederick_wisemans_documentary_coming_to_kanopy/",
        "text": "[deleted]",
        "created_utc": 1515608155,
        "upvote_ratio": ""
    },
    {
        "title": "It's Your Fun &amp; Fancy Free Discussion! (January 10, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pfrjs/its_your_fun_fancy_free_discussion_january_10_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nFun and Fancy Free threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; you can even discuss tv here! Lurkers, this and our Slack team are *the* places to introduce yourself.\n\n##Sign up for the TrueFilm Slack team [here](https://whispering-temple-35722.herokuapp.com/). Our team page is [here](https://truefilmreddit.slack.com/).\n\n###Follow us on:\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) ([fellow TrueFilm users](https://www.reddit.com/r/TrueFilm/comments/3th7st/anyone_here_use_letterboxd/))\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n- [Criticker](https://www.criticker.com/profile/rTrueFilm/)\n\n- [Facebook](https://facebook.com/TrueFilmReddit/)\n\n####The sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1515593173,
        "upvote_ratio": ""
    },
    {
        "title": "Personal Shopper and modern communication with each other and the past",
        "author": "IDrinkUrMilkShake94",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pda1m/personal_shopper_and_modern_communication_with/",
        "text": "I just finished and my mind is all over the place, but I loved this film so much. There are many layers and ways you can read it, but I think my own relationship really impacted my viewing. \n\nI've been in a relationship for 6 years and the past year and a half has been long distance. We see each other periodically throughout the year, but it very much has become dependent on technology for communication.\n\nWhat I found most interesting about Personal Shopper was the way spiritual communication and human communication were put on the same plane.\n\nSPOILER: When Maureen first starts receiving text messages from an unknown number, there's a creeping suspicion that it could be her dead brother. We of course find out at the end of the film that it was not, but it got me thinking about my own relationship.\n\nI feel like in a way our form of modern communication is ghostly? I  don't know, it's hard to explain. My girlfriend and I go hours a day sending messages, going silent, popping back up again, and it's weird that it satisfies the need to communicate, but at the same time it really doesn't. It doesn't have the same feel as a real interaction. \n\nAnother thing was the way we can access the past. In a typical ghost story, the past is coming through to us. It's traveling through another dimension to reach us or tell us something. Personal Shopper includes that type of interaction, but also shows how easy it is to literally reach into the past ourselves with our phones. Maureen uses her phone throughout to watch old movies, look at paintings, and research an artist.\n\nI could be spewing nonsense, but the film has me thinking about our unique point in time where communication seems otherworldly and supernatural.\n\nWhat did you guys thinking watching it?",
        "created_utc": 1515559796,
        "upvote_ratio": ""
    },
    {
        "title": "EPIC WIN",
        "author": "Spooky_Hyena",
        "url": "https://www.youtube.com/watch?v=F5Gh01YUFlM",
        "text": "",
        "created_utc": 1515550030,
        "upvote_ratio": ""
    },
    {
        "title": "What are your favorite/best movies of the 2010s so far?",
        "author": "useyourturnsignal",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pbvhe/what_are_your_favoritebest_movies_of_the_2010s_so/",
        "text": "[removed]",
        "created_utc": 1515545801,
        "upvote_ratio": ""
    },
    {
        "title": "Adequate size of screen",
        "author": "RigormortisVortis",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7pb1b0/adequate_size_of_screen/",
        "text": "As i was in watching the danish film \"A terrible woman\" i was thinking about how i choose to watch my films. \n\nIt occurred to me that my most used screen has become my Asus laptop with a 13 inch screen (And not Retina). \n\nThough i like the cinematography this movie is shot fairly \"basic\" film. The lighting is very anti stylistic and in many cases just natural. The apartments are realistic for many ordinary urban living danish people and not fancy decorated. There is no sense of grandness or glamour and extreme close ups are extensively used. \n\nSo here i was in the theater enjoying this aesthetically \"basic\", and i thought, what a shame it would have been if i had watched it on my laptop. Somehow i feel that the emotions conveyed in the close ups would lose some of their power in a sized down version. When the handheld camera moved i want to believe it affected me differently and more \"authentically\" (Aka. director/DOP 's vision) than if i had seen it at home. I mean, pre Netflix movies are made for the big screen and are \"supposed\" to be enjoyed there.\n\nOf course most people cannot see every movie on a theater screen and yesterday i saw Prisoners (2013) on my friends fifty something UHD TV with surround sound and this movie was tense as hell. Though only hypothetical i sincerely doubt that i would have felt the same kind of unease and tension in some scenes had i just streamed it on my laptop.\n\nYou only get to watch your new favorite movie once. Of course some of your favorite movies seem quite indifferent to you after your first viewing, but other movies are love at first sight. I feel as i owe myself the pleasure of getting as close to the theater experience as possible within my budget. Many weeks i use more than 20 hours to watch films, it seems valid to use some money to improve this experience. \n\nWhat are your thoughts about this? And maybe even better, what are you guys set up?  \n\nI have a 40 inch FULL HD Samsung screen at home, and will be streaming on this instead of my computer from now on.\n\nEDIT: Anti stylistic, not realistic * ",
        "created_utc": 1515538344,
        "upvote_ratio": ""
    },
    {
        "title": "How Star Wars was saved in the edit: a video essay",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=GFMyMxMYDNk&amp;index=36&amp;list=WL",
        "text": "[deleted]",
        "created_utc": 1515529334,
        "upvote_ratio": ""
    }
]