[
    {
        "title": "Why is RuneScape the only popular MMO that features unique quests?",
        "author": "Radidactyl",
        "url": "https://www.reddit.com/r/truegaming/comments/8bzfl3/why_is_runescape_the_only_popular_mmo_that/",
        "text": "I've played WoW, Guild Wars 1 and 2, Aion, Rift, SWTOR, LOTRO, and RunScape (not in that order) and I gotta wonder why RuneScape is the only MMO that hit mainstream success where each quest was an individually written experience? \n\nIt seems it's the only game that doesn't feature \"collect 20 bear asses\" type gameplay, so why is this? What gave it the possiblity to? Why don't the others have more quests like this?,",
        "created_utc": 1523628564,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion: Do you feel angry, hateful, or negative about other players who enjoy games that you do not?",
        "author": "el2mador",
        "url": "https://www.reddit.com/r/truegaming/comments/8bzd6x/discussion_do_you_feel_angry_hateful_or_negative/",
        "text": "It's a simple yes or no answer.\n\nBut I'd like to provide some detail:\n\nRecently, there was a topic about [Destiny 2's planned development roadmap](https://www.reddit.com/r/Games/comments/8bm9zk/destiny_2_development_roadmap_all_dlc_maps_free/dx7vht2/).\n\nA Redditor, u/kristijan1001 mentioned the following (note that I'm summarizing his posts):\n\n&gt; \"I'm a fan of the first game. I am disappointed in the second and that's why I only play it every now and then, not as often as the first. I am hoping that it eventually becomes better. I'd like to check the next DLC for new content and I'd like to get a lot of hours from it.\"*\n\nIf you check that summary, and cross-reference it with his posts, that's basically all there is to it.\n\nThat's about as inoffensive and non-confrontational as you can get.\n\n- It's critical of the game (*'previous dlc was a letdown')\n- It's also optimistic for improvements and new content (*'new enemy types, patches, updates'*)\n- And it's also realistic (*'dlc will cost me $20 and I can get a lot of hours from it compared to $60 games that can be finished quickly'*)\n\nIt's the point-of-view of a gamer who knows the game's faults, but also wants to see it improve and become a great hobby again (like its predecessor was).\n\nBasically - he's no different from any other gamer who's disappointed in the game and wishes it could be better.\n\n------------\n\nBut if you take a look at several of his comments - they currently have a grand total of **(-75 downvotes)**.\n\nYes, a plain, inoffensive, level-headed opinion - downvoted to oblivion.\n\n- Does this come from gamers who are so angry and frustrated about a game that they've forgotten that another player has the same ideas/goals that they do?\n- Or does it come from gamers who play the other games that are 'part of the competition' and thus an opinion about a different game should be made to look unpopular?\n\n-----------\n\nSo back to the topic question:\n\n**Do you, fellow Redditor, fellow gamer, feel anger/hate/negativity towards players who enjoy other games that you don't?**\n\n- And how do you react to those opinions/players even in the most level-headed and objective responses that are provided?\n\n- Are you more subjective/biased? Or are you more objective/balanced?\n\n- Are there any specific types of responses about games that cause emotional/negative triggers?\n\n- And specifically in that example given above - is there any particular reason for you to personally view it so negatively?",
        "created_utc": 1523628042,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the more obscure (but still fun) games you have played, especially indie games before the Steam boon?",
        "author": "shoutout_to_burritos",
        "url": "https://www.reddit.com/r/truegaming/comments/8bz5xe/what_are_some_of_the_more_obscure_but_still_fun/",
        "text": "This is a subject I've been meaning to bring up for a while. I grew up partially on eGames shareware (and still have a number of discs), and they introduced me to Speedy Eggbert (which was great because it was like Mario on PC and had a level creator), Spooky Castle/Hamumu Software, Nebula Fighter, Crazy Drake, Wild Wheels, Safari Kongo, and numerous other indie titles. Most of these have largely remained forgotten and of course your average person won't know about these, but I still had a blast and enjoy seeing - through the power of the internet - who else remembers these titles. Unrelated to eGames, I also remember a funky platformer called Noop's Odyssey.\n\nSo I'm interested to know what relatively obscure (focusing on indie) games you played and had fun with before Steam and digital downloads/storefronts helped bring indies into the mainstream. (Perhaps also mention if you think the game(s) still holds up today or if it's probably just rose-tinted nostalgia goggles.)\n\nbtw, [Speedy Eggbert and co. were recently made freeware](http://www.blupi.org/) (Blupi is the original title of the egg-like character), as were [Hamumu Software games](http://hamumu.com/games.php).",
        "created_utc": 1523626233,
        "upvote_ratio": ""
    },
    {
        "title": "[Poll] What's the best video game series of all time?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8bz5g6/poll_whats_the_best_video_game_series_of_all_time/",
        "text": "[deleted]",
        "created_utc": 1523626110,
        "upvote_ratio": ""
    },
    {
        "title": "Albion Online free trial keys &amp; 50.000 free silver",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8bvmpf/albion_online_free_trial_keys_50000_free_silver/",
        "text": "[removed]",
        "created_utc": 1523584334,
        "upvote_ratio": ""
    },
    {
        "title": "The Pleasures of Armchair Gaming",
        "author": "TheAmazingCatfish",
        "url": "https://www.reddit.com/r/truegaming/comments/8bvkf8/the_pleasures_of_armchair_gaming/",
        "text": "So I just had the weirdest experience.\n\nBackstory (skippable): me and my wife are going through kind of a rough time due to some troubles in her family, and it is hellishly stressful for us. One way to cope is in watching Star Trek every evening, we are both new to trek and love the show (finished TOS, now in the middle of TNG season 4). Today in particular was extremely heavy on her, and I had a dumb idea on how to up the ante in terms of escapism). I'm a gamer since a very early age, she kind of skipped the medium and has a very basic understanding of it.\n\nMain point starts here: So I showed my SO the Stellaris race builder and invited her to put together a species. She picked the happy snail avatar (because of course she did), made them autocratic, materialistic and xenophobic (she's jewish, go figure), and named them after our cat.\n\nThe plan was to just stop at that and happily return to TNG. But I just kind of hit \"new game\" as a reflex, and we started playing. I briefly explained the resources, the general goals (to boldly go and all that), the premise in general. She dug it, mostly thanks to the familiarity of the setting (again, trek binge), and we kept on. Problems presented themselves, I explained the available options and the ramifications of potential decisions. She nodded, and chose the course of action. The snail empire snailed on. I carefully guided her in avoidance of potential mistakes, but never insisted on decisions that went against her own vision for the glorious snails.\n\nWhat I found:\n1) This was the first time I truly felt my spouse was digging the appeal of gaming, mostly because I removed the barrier to entry by interfacing her with the game.\n2) Just as with showing someone a movie you love, it felt like rediscovering this great game all over again.\n\nFuture plans include trying the same thing with FTL.\n\nAnyone have the same experience? Anyone want to try this out? Any suggestions on further games to put on the armchair list? Go :)",
        "created_utc": 1523583749,
        "upvote_ratio": ""
    },
    {
        "title": "Fishing sucks",
        "author": "SpaceMasters",
        "url": "https://www.reddit.com/r/truegaming/comments/8buo3l/fishing_sucks/",
        "text": "[removed]",
        "created_utc": 1523575472,
        "upvote_ratio": ""
    },
    {
        "title": "How do you pick your character in a fighting game?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/truegaming/comments/8bukfa/how_do_you_pick_your_character_in_a_fighting_game/",
        "text": "[removed]",
        "created_utc": 1523574526,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it so difficult to find a reliable, diverse source of gaming news?",
        "author": "dragonslumber",
        "url": "https://www.reddit.com/r/truegaming/comments/8bua3j/why_is_it_so_difficult_to_find_a_reliable_diverse/",
        "text": "[removed]",
        "created_utc": 1523572051,
        "upvote_ratio": ""
    },
    {
        "title": "What are does it take to either keep you engaged or turn you off from a story?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8btxdr/what_are_does_it_take_to_either_keep_you_engaged/",
        "text": "[deleted]",
        "created_utc": 1523569187,
        "upvote_ratio": ""
    },
    {
        "title": "I really wouldn't mind fast-forwarding to the point in time where people say \"Lol, you still play Fortnite?\"",
        "author": "UpsetSupport",
        "url": "https://www.reddit.com/r/truegaming/comments/8btw86/i_really_wouldnt_mind_fastforwarding_to_the_point/",
        "text": "[removed]",
        "created_utc": 1523568927,
        "upvote_ratio": ""
    },
    {
        "title": "Tell Me Why More Games Like Planetside 2 Are Not Prospering?",
        "author": "alienccccombobreaker",
        "url": "https://www.reddit.com/r/truegaming/comments/8btort/tell_me_why_more_games_like_planetside_2_are_not/",
        "text": "I know gaming is a very personal subject and everybody's experience is different but somebody please tell me why games like Planetside 2 are not prospering?\n\nIt feels like this genre is severely lacking and is going the way of the RTS classic genre aka dying and going underground.\n\nIt is a niche genre still atm but so niche I cannot even name any other competitors.\n\nIt is essentially an adaptation of the multiplayer fps series just expanded and large scale but much larger than say battlefield or battlefront or other fps (usually capped at 64 max players).\n\nI always thought that with the improvement of hardware and software and technology as a whole that the natural progression would have been mass scale battles apparently not as we have stayed well within the 64 player limit for a long time now and the only games that surpass this are other MMO's.\n\nIs it just me or whenever you play a game you sometimes think imagine if there was more to this? Imagine if instead of just maybe 8 or 12 or 16 players there was maybe 100 more.\n\nI am sure there are many games that could benefit from this with Team Fortress 2 I used to think was being one with mass battles and super large \"maps\" going crazy but for some reason it never came.\n\nHonestly I always pictured somebody making a Lord of the Rings game like this but maybe with scattered heroes and some NPC's along the way to fill the battlefield but minimum a few hundred playable characters but a large battlefield like we see in the movies.\n\nI do like my small type shoot em up and slash and dodge arenas but every now and then I yearn for the bigger picture the epic large scale battle but most importantly done right.\n\nI sometimes feel like we might be heading hopefully towards larger games with the improvement of technology as we see in the latest craze of battle royale games but honestly I still see more.\n\nThis has been a vision or want of mine for many years now I think possibly even since the old large scale arena days in unreal tournament and quake and tribes and whatnot and playing old school RTS games commanding legions of armies to do my bidding against one another.. now that we have really entered the beautiful modern 3D model art age I could potentially see some really great mass large scale type genres popping up where hundreds of players have to work together to accomplish a goal but maybe be done in under an hour or so.. maybe more depending on the campaign or scenario.\n\nWoW was the last game that did this right by me.. I still love WoW and it is honestly my motherland but if other companies could see this and utilize this concept then man we could have another great revolution in gaming coming some time soon.\n\nSo what do you think? Am I mad in thinking this? Or does everybody else in the room think the same and secretly also wish the same?\n\nI would like to know your thoughts in the comments below because I have these dreams of fantastic beautiful large mass scale games with hundreds of players all at once in a nice open battlefield or scenario of some sort.. hopefully working together lol.",
        "created_utc": 1523567291,
        "upvote_ratio": ""
    },
    {
        "title": "Is the concept of unlocking characters or content an obsolete method? Does it really not generate as much money than locking content behind paywalls?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8btmp2/is_the_concept_of_unlocking_characters_or_content/",
        "text": "[removed]",
        "created_utc": 1523566848,
        "upvote_ratio": ""
    },
    {
        "title": "Do you feel the need to finish the title if you don't like it at first?",
        "author": "Flashi3q",
        "url": "https://www.reddit.com/r/truegaming/comments/8btdwz/do_you_feel_the_need_to_finish_the_title_if_you/",
        "text": "[removed]",
        "created_utc": 1523564959,
        "upvote_ratio": ""
    },
    {
        "title": "As gamer with synesthesia I've had to turn off the music of most of my games, what great soundtracks have I missed?",
        "author": "unitrooper7",
        "url": "https://www.reddit.com/r/truegaming/comments/8bsv3s/as_gamer_with_synesthesia_ive_had_to_turn_off_the/",
        "text": "[removed]",
        "created_utc": 1523560959,
        "upvote_ratio": ""
    },
    {
        "title": "Weirdest genre of game you loved to play?",
        "author": "Onion_Sun_Bro",
        "url": "https://www.reddit.com/r/truegaming/comments/8bshid/weirdest_genre_of_game_you_loved_to_play/",
        "text": "Battle Royal, FPS, RPG, Mobas, MMO… everyone knows the big genres and probably already played at least a few games of each one. But once in a while we feel like try something new and here is when weirdest genre of games. \n\nFor weird I don’t mean the game is bad in any sense, just that is a unusual genre that few people know about. E.g:\n\n**Hacker Games**\n\n* Uplink\n* Hacker Evolution\n\n**Lemmings-like**\n\n* Eets\n* Flockers\n* Your Doodles are Bugged!\n\nSome of theses games are so different from what we generally play that even if we not necessary like the game the experience of playing them is worth.\n\nSo, what the weirdest genre of game you ever played and loved to play it?\n\nEDIT: Wow, I didn't thought this post would get so many comments. Thank you guys, I got to know genres I never would have guessed exist. Go check some of these games.",
        "created_utc": 1523558003,
        "upvote_ratio": ""
    },
    {
        "title": "Nice Xbox Tags , Hmu Need All Gone",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8bs8ic/nice_xbox_tags_hmu_need_all_gone/",
        "text": "[removed]",
        "created_utc": 1523556076,
        "upvote_ratio": ""
    },
    {
        "title": "Need responses from people that work in the video game industry",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8bs0lo/need_responses_from_people_that_work_in_the_video/",
        "text": "[removed]",
        "created_utc": 1523554400,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of your favorite character/stage select screens? What are some bad ones?",
        "author": "TrapperKeeperCosby",
        "url": "https://www.reddit.com/r/truegaming/comments/8brtcg/what_are_some_of_your_favorite_characterstage/",
        "text": "[removed]",
        "created_utc": 1523552922,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of your favorite character/stage select screens?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8brpm9/what_are_some_of_your_favorite_characterstage/",
        "text": "[removed]",
        "created_utc": 1523552141,
        "upvote_ratio": ""
    },
    {
        "title": "SteamSpy discussion before that site closes down",
        "author": "01314150",
        "url": "https://www.reddit.com/r/truegaming/comments/8bro0s/steamspy_discussion_before_that_site_closes_down/",
        "text": "I just read that SteamSpy will be closed down due to new Steam privacy settings. \n\nSince there's a lot of unique data on that site, I figured we could dump some selections into a thread and invite to discuss or just observe the data. \n\nExample: Do people still play Braid?\n\nYes, Apparently: \n\nPlayers in the last 2 weeks: 5,454 ± 2,756 (0.48%)\n\nPlayers total: 739,484 ± 30,311 (65.29%)\n\nPeak concurrent players yesterday: 25\n\nPeak on Twitch yesterday: 4 viewers, 2 channels",
        "created_utc": 1523551798,
        "upvote_ratio": ""
    },
    {
        "title": "Distance to screen affect experience?",
        "author": "lemon31314",
        "url": "https://www.reddit.com/r/truegaming/comments/8bqtne/distance_to_screen_affect_experience/",
        "text": "Hi everyone, recently I've been thinking whether the distance to the screen affects gaming experience, especially with story/character focused games.\n\n&amp;nbsp;\n\nThe thought came to mind when I started play Persona 5 on the PS4. I played the previous games and loved P4G on the Vita (didn't like P3) - felt immersed in the world pretty much after the first dungeon. This is not the case with Persona 5 however. While the consensus is that Persona 5 is objectively better in almost every area (and I agree), I just don't feel as immersed in / attached to the universe. \n\n&amp;nbsp;\n\nSince neither is my first entry to the series, and I actually prefer Persona 5 in every way, the only thing I could think of is the fact I used different platforms. Assuming it's not the sore elbows or strained eyes that prefer, the only difference the distance to screen. \n\n&amp;nbsp;\n\nWhat do you guys think? Have you had similar experiences or is this all in my head?\n\n\n&amp;nbsp;\n\nEdit: Thanks everyone for your input, TIL!",
        "created_utc": 1523545325,
        "upvote_ratio": ""
    },
    {
        "title": "Lenovo Star Wars: Jedi Challenges - do you think it's worth 200 bucks?",
        "author": "brot_ohne_wurst",
        "url": "https://www.reddit.com/r/truegaming/comments/8bq4m6/lenovo_star_wars_jedi_challenges_do_you_think_its/",
        "text": "[removed]",
        "created_utc": 1523539624,
        "upvote_ratio": ""
    },
    {
        "title": "Top 5 Best Selling Video Games In The History",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8bpq5w/top_5_best_selling_video_games_in_the_history/",
        "text": "[removed]",
        "created_utc": 1523535826,
        "upvote_ratio": ""
    },
    {
        "title": "A debate on how you can define content in a video game.",
        "author": "Vealzy",
        "url": "https://www.reddit.com/r/truegaming/comments/8bp7m9/a_debate_on_how_you_can_define_content_in_a_video/",
        "text": "Hello everyone, i posted this on r/gaming but someone suggested i should post here. So here it goes, me and my friends were having an argument about how one would define content in a video game. After a few hours we reached no consensus so we gave up. Now i an curious about the wisdom of reddit so here is the argument.\n\nCan you define content as hours played? Which game has more content Dota 2 or Witcher 3?\n\nSo one side was arguing that you have more things to do in a game like Witcher for example, and that content should be defined as different things you can do in a game.\n\nThe other side of the argument was saying that content can be defined in how many hours does it take you to do everything in a game. And on that note Dota 2 with all the different possible iterations has a lot more content.\n\nSo in conclusion how should we look at content? \n\nP.S. Lets try and stay on the subject and not degenerate the discussion. Thank you all for reading.",
        "created_utc": 1523529993,
        "upvote_ratio": ""
    },
    {
        "title": "\"Only Play What You Want\" Vs Instant Gratification",
        "author": "blockmagethegrey",
        "url": "https://www.reddit.com/r/truegaming/comments/8bitqw/only_play_what_you_want_vs_instant_gratification/",
        "text": "For me, it was right after I went down the rabbit hole of MMOs that I picked up the rallying cry echoed by many of us around here to “only play what you love” and “if you lose interest in a game, just stop playing it”. I was really discouraged by the tactics used by game companies to get players hooked (unlockables, loot boxes, rankings, etc.) and continue to play their games for reasons other than intrinsically fun gameplay.  I questioned the time I was sinking into some of those games and questioned why I was doing all this grinding and not even having any fun. That’s not what any of this is about, right? \n\nBut lately, I’ve been catching myself using this rationale to basically excuse what is just instant gratification. If a game doesn’t give me that instant “hit” I’m looking for, then I’m on to the next title. I’ve seen the comment frequently that “if a new game doesn’t grab my attention in X amount of time, I un-install”.\n\nAnd I think that’s really unfair. There’s really something to be said for sticking with something through a rough passage, like a novel for example, and it becomes that much more rewarding when you get to the end. I remember slogging through all the Tom Bombadil songs in Fellowship of the Ring. Had I given up on the series then, I never would have had the mountaintop experience of seeing it through to the end. \n\nSo I’ve come to think that there’s something to be said for sticking with a game for a bit before we completely write it off. What do you think? ",
        "created_utc": 1523467251,
        "upvote_ratio": ""
    },
    {
        "title": "Here is a short review about Battlerite, if you are interested. :)",
        "author": "_Capataina_",
        "url": "https://www.reddit.com/r/truegaming/comments/8bihza/here_is_a_short_review_about_battlerite_if_you/",
        "text": "[removed]",
        "created_utc": 1523464772,
        "upvote_ratio": ""
    },
    {
        "title": "Albion online",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8bhz0m/albion_online/",
        "text": "[removed]",
        "created_utc": 1523460765,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an effective way to recreate the feeling I first had as a kid when experiencing a mind-blowing game genre for the first time?",
        "author": "AnokataX",
        "url": "https://www.reddit.com/r/truegaming/comments/8bhvnh/is_there_an_effective_way_to_recreate_the_feeling/",
        "text": "When I was a kid, I recall playing MapleStory for the first time and it blowing me away. The simple Jump and Attack and 2D sidescrolling moments with the equipment excited me, and it was such a pleasure to learn such a game was playable. It was addicting and fun, and some of my fondest gaming memories were of it\n\nBut there haven't been as many moments afterward that wowed and captured my imagination the same. For example, the first time I played Super Mario 64, I was excited and giddy. Super Mario Sunshine was much less new and exciting to me because I'd already been exposed to 3D, colorful cartoon platform gaming. Ditto for later Mario's up to Odyssey.\n\nThat made me wonder - is there *any way* for an adult like me to recreate those first experiences? I've tried nostalgia by replaying these older things, but the novelty has work off. I've tried finding the best new and great games that everyone says are Must Plays, but even though I really liked stuff like Breath of the Wild and can understand why people called it the most recent Game of the Year, it still didn't \"wow\" and capture my imagination for the first time like MapleStory for example did (and this is in spite of BotW being in my Top 9 but MS is not)\n\nI partly think I need to either forget my memories of those first games (impossible) OR do a new medium. For example, learning board games had been illuminating and tactilely stimulating unlike games. But I've played over 400 according to Boardgamegeek and feel the novelty has work off from that too despite still enjoying Dominion, Power Grid, Dungeons and Dragons RPG etc. The only other media I can think of close to gaming to try is VR for the first time, but I suspect I wouldn't be blown away after the first few plays. **Is there any way to consistently relive those beginning sense of discoveries, wonder, and \"wow\" factor from my nostalgic and first time memories of gaming a new, fresh game/genre?**",
        "created_utc": 1523459995,
        "upvote_ratio": ""
    },
    {
        "title": "Online Trading Card Games and Addiction",
        "author": "fenexj",
        "url": "https://www.reddit.com/r/truegaming/comments/8bhrhm/online_trading_card_games_and_addiction/",
        "text": "I want to make this brief,  for the last ~4 years I've been heavily addicted to TCGs.  Namely Hearthstone, Gwent &amp; Star Realms have been my poisons of choice.\n\nIt started with HS but as the skill ceiling was diluted with the addition of heavy RNG based cards and a high cost to play I drifted from that to Star Realms and then picked up Gwent.  I am seemingly able to rack up huge play times in these games and always able to battle it out in the upper echelon on skill levels, grand master in gwent, legend in hearthstone and 60%ish+ win/loss ratio but I am always left unfulfilled and wanting more.\n\nWhat's more is I enjoy playing multiplayer games with friends but these games promote lonely gaming and while that doens't seem to bother me I may as well be playing again AI for all I know, there isn't any human interaction at all, not even a chat box.\n\nI am a big fan of strategic turn based games such as chess and enjoy complex decision making and planning ahead but I can't seem to stop playing these [children's] card games and I am wasting so much time and I wish that instead I'd start planning ahead in my own life and get meaningful shit done.\n\nJust wondering if anyone had any similar experiences and could offer any advice on this weird road I am on.",
        "created_utc": 1523459153,
        "upvote_ratio": ""
    },
    {
        "title": "Lenovo Star Wars: Jedi Challenges... is it worth the money?",
        "author": "brot_ohne_wurst",
        "url": "https://www.reddit.com/r/truegaming/comments/8bh2uu/lenovo_star_wars_jedi_challenges_is_it_worth_the/",
        "text": "[removed]",
        "created_utc": 1523453566,
        "upvote_ratio": ""
    },
    {
        "title": "DXRacer lockable wheels?",
        "author": "jobantonis",
        "url": "https://www.reddit.com/r/truegaming/comments/8bgdss/dxracer_lockable_wheels/",
        "text": "[removed]",
        "created_utc": 1523446790,
        "upvote_ratio": ""
    },
    {
        "title": "Now that the 3DS era is slowly coming to an end what do you think about the Dual Screen?",
        "author": "Klunky2",
        "url": "https://www.reddit.com/r/truegaming/comments/8bg1gc/now_that_the_3ds_era_is_slowly_coming_to_an_end/",
        "text": "I know there are still many titles in the pipeline for that system and nintendo stated thay they will further support the handheld into 2019, but still it's conceiveable that in the near future the 3DS will be fully replaced by the Nintendo Switch and there is no succesor to close the gap. \nAll in all the Nintendo Switch is already a home console and a handeld in one, so you can assume that it makes sense.\n\nWell, but there still will be a loss for the future game industry:\n\n*The end of the 3DS will be the end of the dual screen.* At the moment, no other plattform supports any kind of dual screen or something similiar, so it looks like this (for the condidtions of the days) unique concept will ultimately face its demise.\n\n- So I wanna ask you, did you ever appreciated the idea of the dual screen? \n\nIt's important to mention, that two different screens at the same time mainly served the purpose to seperate the interactive touch screen, from the actual display screen of the game. Sometimes the touch screen was an extension for the display screen and sometimes the actual happening of the game was completely on the touch screen.\n\nWell, that highlights one of the greatest advantages of the dual screen in my opinion: the high flexibility to project informations to the player. In combination of the the touch screen there was high potential for many unique ways to depict the actual process and controls of the game.\n\nSome known franchise were able to utilise the features of the touchscreen to give their games a fresh new interesting twist, \nSome of them improved the handling of their UI with the advantage to outsource the menue to an seperate screen, where it's not even necessary to pause the game for. \n\nThe Zelda games and remakes on DS/3DS are good examples for both cases. \n\nAlso there are franchises where the Dual Screen was the main inspiration and the reason for their entire existence: The Etrian Odyssey series at example.\n\nShortly they announced their last game for the system, after that one of the main selling points of the game will no longer be possible. The use of the Touchscreen to navigate through an huge labyrinth and drawing your own map.\nIt's an high appealing feature which defines one of the biggest strenghts of the game and a good example for a game where the experience would suffer from the lack of a second screen.\n\nRegarding touch: One thing I criticise on common system like the Playstation Vita or the Nintendo Switch is that the screens aren't haptic enough, they weren't designed to draw on a stylus, also my own hand covers to much of the screen while i'm drawing/touching, as long the game happening and the touch screen are on the same screen.\n\nSo yeah all in all I think the Dual Screen was an innovative, smart idea which enforced touch screens to videogames more than any other system at the time did- and even today does. As such I'm not happy at all about the downfall of the 3DS system, because in it's current state, the Nintendo Switch has no replacement for the Dual Screen. \nSo games like Etrian Odyssey are forced to change if they get continued on the Nintendo Switch.\n\nI truly believe the Dual Screen was an enhancement to handhelds as concept overall, as such it looks more like the Nintendo Switch does a step backwards in that regard.\n\n\n",
        "created_utc": 1523442700,
        "upvote_ratio": ""
    },
    {
        "title": "INSANE YOUTUBE CHANNEL",
        "author": "Ianhuughes",
        "url": "https://www.reddit.com/r/truegaming/comments/8bdkz5/insane_youtube_channel/",
        "text": "[removed]",
        "created_utc": 1523412316,
        "upvote_ratio": ""
    },
    {
        "title": "Fortnite, Pokemon GO, and Fad Games",
        "author": "hcipap",
        "url": "https://www.reddit.com/r/truegaming/comments/8bbmv1/fortnite_pokemon_go_and_fad_games/",
        "text": "Hello everyone! \n\nThe success of Fortnight Battle Royale is one we don't often see. Its a massive cultural pheonomnon unlike most any other games.  Everyone from rappers, to popular streamers, to most PC gamers, and teens in middle school and high school are playing, talking about, and enjoying this new hit. A massive contribution to its success and the status its gained is the fact that its a free to play battle royale game, a price tag that includes anyone and everyone as long as you’ve got any kind of modern hardware, in a genre that's the next upcoming big thing, most comparable to how the survival game became the huge thing after Minecraft's massive success that everyone was making and talking about. \n\nUnlike survival games like Rust, Ark, and Minecraft, I think Fortnite Battle Royale has the possibility of not staying around too long. When I think of this game, my immediate thought is the game that gained that took the world by storm like this last time.\n\nAnd that game was Pokemon Go, a game that is still somehow somewhat popular and had an active community, but is no longer this cool, new game that EVERYONE is talking about and is familiar with. Pokemons fall from this once grandeous position was almost inevitable. The gimmick, an admittedly awesome, groundbreaking, and just really cool gimmick, saw players going outside, conversing, trading, and battling. All for the pure, innocent fun of becoming a Pokemon master. This gimmick, using Pokemon, a massive brand, to draw everyone in with the ability to live a dream most of us have probably have had at some point, and thats to be in the pokemon world where pokemon are real. Its amazingly the closest, most immersive Pokemon game we’ve gotten, and I dont tjink itll ever be touched in that regard. Even a Pokemon MMO, or Pokemon in VR, couldn’t ever draw you in the same way as actually going around outside to specific locations searching for specific pokemon found in them. This gimmick could only draw awe from it for so long however, as the games pretty glaring issues began to make themselves more transparent. After the gimmick wore off and the games shallow mechanics revealed themselves. It was bound to drop attention because of a lack of content and things to do other than catch Pokemon, and its fate was sealed once people were clamoring for more generations of Pokemon or new and improved mechanics that werent provided until most people were pretty over the whole idea. And that ends the generalized saga of Pokemon GOs life, which again hasnt ended, its just no longer what it was once was and couldve been.\n\nWith all that being said, I'm wondering if Fortnite will follow the same course. I feel like they're very similar and the ways they've hit the public eye. I go more in depth on this in my video: https://www.youtube.com/watch?v=dNW7_5x98XM&amp;feature=youtu.be\n(Which, I've made posts like this that use my video as the basis and they get tons of upvotes, so if you enjoy what I talk about, consider checking this video and my channel out!) \n\nHow do you guys think Fortnites role in the industry will pan out in the long term?\n",
        "created_utc": 1523396048,
        "upvote_ratio": ""
    },
    {
        "title": "Games that match the best movies in terms of story and presentation",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8bbgi3/games_that_match_the_best_movies_in_terms_of/",
        "text": "[removed]",
        "created_utc": 1523394789,
        "upvote_ratio": ""
    },
    {
        "title": "Possible PUBG and Fortnite destroyer",
        "author": "crippPR",
        "url": "https://www.reddit.com/r/truegaming/comments/8bazfy/possible_pubg_and_fortnite_destroyer/",
        "text": "[removed]",
        "created_utc": 1523391470,
        "upvote_ratio": ""
    },
    {
        "title": "OG &amp; Semi OG Xbox Tags",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8b9dw6/og_semi_og_xbox_tags/",
        "text": "[removed]",
        "created_utc": 1523380576,
        "upvote_ratio": ""
    },
    {
        "title": "Decline of games",
        "author": "elektrisko",
        "url": "https://www.reddit.com/r/truegaming/comments/8b9774/decline_of_games/",
        "text": "[removed]",
        "created_utc": 1523379331,
        "upvote_ratio": ""
    },
    {
        "title": "Turn a Gaming Addiction into a Life Skill",
        "author": "rwp80",
        "url": "https://www.reddit.com/r/truegaming/comments/8b8svc/turn_a_gaming_addiction_into_a_life_skill/",
        "text": "Hello everyone.\n\nGaming can be an addiction, just like anything else. However in my experience it can be controlled and even turned into a useful life skill.\n\nI'm a long-time gamer in my late 30s. I have a lot of things going on in my life right now and I've had to really tear myself away from gaming to be able to progress with the important things. Over the years I've grappled with gaming as a source of both joy and woe alike. This is going to be long so I'll try to structure and section it as best as I can.\n\n*Please keep in mind that I am not a doctor or expert of any kind. I strongly urge you to speak to a medical professional before you do anything at all in this post.*\n\n\n**The Mind**\nFirst off, I want to cover how I (as a layman) perceive the mind to work. This is completely subjective and unscientific, however that might be beneficial to this text.\n\nThe mind is like an ocean, it has a surface and you can dive deep down to the seabed at the bottom. I think of the surface as my conscious area, and the seabed as my subconscious area. At the surface, I'm thinking about what words to type and trying to check my spelling as I proceed through each sentence. As I dive deeper into the mind I start to notice my breathing, my posture in my chair, I've just realized my feet are crossed, and I just remembered that my coffee has probably cooled off a little now. If I was able to dive deeper still, I'd be able to notice other more base functions of my body such as my heartbeat and possibly all the chemical/hormonal science stuff going on in my body and brain.\n\nMy point is that the mind is not just two distinct layers. It is a huge vertical grey area.\nSo what does this have to do with gaming?\n\n\n**Flow vs Brain Fog**\nWe've all been there: When you get into a game, your mind settles into what is known as \"the Flow\". You're suddenly much more aware of everything going on, your reactions are quicker and more accurate, and you're making better moment-by-moment decisions.\n\nDeveloping Flow is, based on my many years of gaming, a massively positive attribute of gaming. When used correctly it teaches your brain to focus in on a specific task and master it. This is absolutely very healthy and is a skill that can be transferred to non-gaming tasks, personal and professional alike.\n\nThink about the positive symptoms of the Flow as described above. What's going on in the brain that enables those improvements?\n\nWell, put simply, the level of consciousness just below your conscious focus is aligning to take on the task. In simple terms this means your brain is adapting to all of the simpler parts of the task so that you can do them on autopilot. This is how the brain learns to do things - It puts the simpler parts on autopilot, thus freeing you up to focus on the more difficult parts. Once you become familiar with those, then that gets pushed down into the \"autopilot\", and so on. This is basically the process for any kind of learning, be it your math times table, learning a second language, or getting skilled at a competitive online game - And most important to note is that your brain does this automatically whether you know it or not.\n\nGreat... You've gotten into the Flow, beaten the competition, and it felt like you were surfing on the clouds. Everything started to feel effortless because you've become so fluent at it. Now it's time to turn the gaming device off.\nUh oh...\n\nYou reluctantly turn off your gaming device and you're hit with a wave of the infamous *Brain Fog*!\nYou stand up to get yourself a glass of water, or perhaps a coffee - You can't even decide.\nAs you start walking to the kitchen, it feels weird. Suddenly you realize you need to the bathroom, so you do that first. Even then each step of the task seems confusing, as if you have to re-remember the correct order of this simple act of personal hygiene.\nThen you go back to the kitchen, put some coffee granules in your mug, and wait for the water to boil. After about 15 seconds you realize you never put any water to boil in the first place. Urgh!\n\nWhy does this happen? Well, take a look at your brain. Over the past hour (or more) you have programmed your brain to focus intensely on a specific task or set of tasks. The layer of brain processing just below the conscious surface is still thinking along those lines. You know this to be true because each time you dare to think about turning the same game back on, your brain instantly feels clear again, because those are the pieces it is set up to deal with. Try it. Each time you think about work you get brain fog, and each time your mind wanders back to gaming you feel the Flow's rush of clarity again.\n\nThis is where the biggest benefit of gaming (training the Flow) shows itself as a double-edged sword - You can't stop thinking about the games, because that's what you've trained your brain to do so intensely and effectively. Each time your achieve a goal in-game, your brain recognizes that as reinforcement reward and this only bolsters your brain's efforts to focus ever more on the game.\n\n\n**Resetting and Redirecting**\nSo the problem is not gaming itself, but being able to redirect your mind to other tasks. Our brains need a \"Ctrl-Alt-Del\" with an \"End Process\" button!\n\nI've tried many methods of doing this. Breathing exercises, take a nap, physical exercise, take a shower - None of them work because they affect specifically the body, and any effect on the mind is only secondary.\nThe reason it doesn't work on your mind is obvious, in fact it's so obvious that it surprised me when I saw it...\n\n*You've just spent hours training and rewarding your brain to use the Flow, and suddenly you want it to stop doing that?!*\n\nThe solution to beat brain fog is to embrace the Flow skills your brain enjoys so much, but learn to redirect them to your other tasks.\n\nHere's what works for me as a \"Reset\" method:\n*1. Close your eyes.\n*2. Think about absolute darkness in deep space; A place of complete emptiness. As thoughts pop into your head, just imagine them fizzling away as you re-focus on keeping the space empty.\n*3. While doing this, take 5 big, slow deep breaths.\nThe whole process can last about a minute or so. If you have time, I recommend doing this for longer periods of time. In the past there have been a few times where I have done this for 3 full hours, and it felt amazing afterwards.\n\nYou've cleared out the junk from your surface-level mind. You'll already be able to function much more coherently within your immediate surroundings.\n\nHowever, your brain is still in Flow mode, so you must straight away direct your thoughts to your work tasks.\nStart thinking about the bullet-point list of things you need to do. What do you need to get started with the first item on the list? Ask as many other relevant questions focus specifically on your work task. Don't clutter your questions; Keep them logical and relevant to the practical requirements of the task.\n\nBy doing this you're overloading your brain with all the pieces related to your work task. As your brain tries to answer all the questions and make sense of them, you're kicking your brain back into Flow mode, but this time it's directed at your work instead of gaming!\n\nCaution! There is a dark side that must be avoided: The previous times you used your brain in Flow mode was for gaming, so the brain might try to wander to gaming-related tasks as it fires up. Each time your mind wanders to gaming, pinpoint the very next thing you need to think about for your work task, repeat the above \"reset\" method, and then get back to the next work-related thought or question.\n\nYou'll find yourself having to correct your thought patterns frequently at first, but very soon your brain learns to focus on the work task without hardly ever deviating. This is compounded by the fact that your brain is re-wiring the Flow mode to the work task as you progress through your work.\n\nYour brain is a massively powerful engine. As you focus on a task, it kicks into overdrive and puts you into Flow mode.\nBeing aware of your brain's \"mode\" enables you to redirect your thoughts to not avoid the Flow, but to embrace it and use it to your advantage to complete useful real world tasks. You've spent all those hours training the Flow, why not use it?!\n\n\n**Balancing Gaming with Real Life**\nIf gaming is intruding in your real non-gaming life, then you have a problem. I won't go into great detail here, but I urge you to be honest and admit you have a problem.\n\nGaming can yield fantastic benefits. The greatest is training of the Flow as I described above. Many other games I've played have put my maths skills to good practice, helped me learn to make strategic decisions and juggle backup plans, among other mental skills.\n\nSimply going cold turkey and saying \"all gaming is bad\" does not help, because your brain has already felt the benefits of it. When you try to tell yourself that gaming is bad, subconsciously your brain knows that you are lying! ...That's why cold turkey never works.\n\nYour brain loves gaming because it loves being put to use, especially when it successfully completes tasks. This is perfectly healthy.\nI am no expert, but I would recommend gaming as a great way to help drug addicts recover from chemical dependency.\n\nI completely reject the idea that gaming should be completely \"cut out\" of your life, but real life must come first!\n\nHere's what I recommend, to balance gaming with a real life:\n\n* 1. Gaming should be treated as entertainment filler.\n\nYes gaming gives you skills, including the Flow which practically makes you a real-life Jedi if you use it wisely. However no matter how rewarding gaming is, you should be mindful that it is still just you sat in front of a screen.\n\nYou must train your brain to opt for real-world interactions. If at any point you have the option to do something else for entertainment instead of gaming, then go do the other thing.\n\n* 2. Take control of your gaming habits, and diversify.\n\nPlaying only one game makes your brain (and Flow mode) too ingrained in that particular game, and it becomes more difficult to redirect your Flow to other tasks. If you hop between around four carefully-selected games, then your brain learns to switch between them, which also means it learns to switch each of them off.\n\nHow do you choose which games to play? Well, think about how your brain works in each game. There is no point picking multiple games that are similar - You must pick games that are all very different from each other, so each one pushes your brain to engage the Flow in their own unique way.\n\nBefore I did this, I was hopping wildly between 10 or so games, letting my boredom take the wheel. This, as you can imagine, was massively dangerous and caused me to lose a lot of time from real-world tasks!\n\nThis is what worked for me:\nA. Make a text document with a \"Good\" and \"Bad\" section, and list of all the games you play directly in the \"Bad\" section.\nB. Cross off all the games that make you frustrated. (ie: This is usually the games you most often lose at). Add a small one-sentence note as to why each game is being crossed off.\nC. Cross off all the games that make you work towards some kind of long-term goal, rather than entertaining you in the moment. MMORPG's are notorious for keeping players engaged based on the promise of something better while making players simply rinse and repeat the same boring gameplay. Add a small one-sentence note as to why each game is being crossed off.\nD. Cross off all the games that force you to disengage or sacrifice real-world activities. Add a small one-sentence note as to why each game is being crossed off.\nE. Keep repeating the above steps until you've left with four-or-so varied games that don't frustrate you, but do give you enjoyment in the moment. Move these games up to the \"Good\" section. Keep this text document in the same place wherever you have your game launch icons if possible. Move all the \"Bad\" games to another location. If you really want to be thorough, uninstall those \"Bad\" games.\n\nFor example, my \"Good\" section reads as follows:\n*MechWarrior Online -- Complex, slow, tactical action.\n*Insurgency -- Tense, tactical shooter. (Best ever modern warfare shooter IMO. Puts the AAA contenders to shame.)\n*Doom 2016 (Single Player) -- Nerve-wracking, heart-racing run-and-gun action.\n*Total War: Medieval 2 -- Fun, slow strategic gameplay.\n*Left 4 Dead 2 -- Nice easy fun blastin thru zombos with the boys. (This is only on my list because my offline real-world \"casual gamer\" friends play this with me occasionally)\n\nI won't go into detail, but each of these games (except for the last \"casual\" entry) put me into Flow mode in their own unique way - They are all very different from each other, so the Flow mode experience is varied.\nEvery time I sit down to do some gaming, I read the list and think about what I'd like to do. I try to spread my time between them to avoid playing the same game too much - This keeps my brain adept at jumping between different tasks which is another useful skill in itself.\n\n*3. Remain mindful of your real-world needs, and expend your brainpower cautiously.\n\nWhen we're young we think we can do everything endlessly. Newsflash: We can't. Not even when young.\n\nYou brain is like a muscle, it can only do so much work each day before it needs to rest, just like your body. If there's anything important you need to do that day, then save the gaming till afterwards. Give your mental and physical energy to the important real-world tasks. Don't worry, gaming will still be there waiting for you whenever you can get to it.\n\nThe healthiest time to do some gaming is late at night before bed. Let gaming be present in your daily life, but keep it be last on the list.\nIt will wear the last of your brain energy out. Once you turn off your gaming device your brain at first will want to continue engaged in the flow, but as soon as you hit the mattress you'll automatically direct the brain into the Flow of deep sleep! - Just remember to do the \"Reset\" method described earlier.\n\nOne last part of being mindful of your real-world needs is obvious:\n*Know when to switch off.* Plan your life. Thinking about what you need to do the next day plus a little bit of arithmetic will give you a good answer for what time you need to switch off and head straight to bed.\n\n\n**Conclusion and TL;DR version**\nGaming teaches your brain to use the Flow.\nDoing it wrong gives you brain fog. Doing it right makes you a Jedi.\nDon't go cold turkey, just be sensible and purposeful about what games you play and when.\n\nGood luck... I hope all of this helps you!\n\n*Edit: Apologies for the awful formatting! I'm new at this.*",
        "created_utc": 1523376548,
        "upvote_ratio": ""
    },
    {
        "title": "Turn a Gaming Addiction into a Like Skill",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8b8p2i/turn_a_gaming_addiction_into_a_like_skill/",
        "text": "[deleted]",
        "created_utc": 1523375821,
        "upvote_ratio": ""
    },
    {
        "title": "GTAV torture scene is probably one of the best depictions of the situation the American government faces when it tortures people",
        "author": "Alpha_Bit_Poop",
        "url": "https://www.reddit.com/r/truegaming/comments/8b8nto/gtav_torture_scene_is_probably_one_of_the_best/",
        "text": "The torture scene in GTAV is what made me quit playing the game, I really didn't like it.  But it is accurate in that you never find out if the guy you torture is a terrorist or if he really is just a random innocent guy you accidentally picked up.  And this is the situation that the American government faces every day when it ships people off to other countries to be tortured for information.  (This is called 'extraordinary rendition' https://en.wikipedia.org/wiki/Extraordinary_rendition#Example_cases)\n\nCompare this to most torture done by the good guys against the bad guys you see in movies or TV like 24 or The Foreigner, a Jackie Chan / Pierce Brosnan movie that came out last year.  In The Foreigner torture is used on some bad terrorist lady who tells them where a bomb is and they defuse it without a second to spare and save a bunch of people.  \n\nThe view of torture we get in most movies is very dumbed down, while in GTAV it's extremely real world, maybe one of the best real world depictions of the reality of not knowing whether someone is actually bad or not.",
        "created_utc": 1523375601,
        "upvote_ratio": ""
    },
    {
        "title": "Clean Xbox Tag Shop ! READ BELOW",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8b8ndd/clean_xbox_tag_shop_read_below/",
        "text": "[removed]",
        "created_utc": 1523375532,
        "upvote_ratio": ""
    },
    {
        "title": "[SPOILERS] Can we have a serious talk about how morally reprehensible Far Cry 5's \"proper\" ending is?",
        "author": "a_hirst",
        "url": "https://www.reddit.com/r/truegaming/comments/8b7wbv/spoilers_can_we_have_a_serious_talk_about_how/",
        "text": "If you haven't finished it and want to watch it, [here's a video of the whole horrible thing](https://youtu.be/l6PCFurLeEg).\n\nMany things have been written about how bad this ending is (including an [article on Polygon](https://www.polygon.com/2018/4/2/17188486/lets-talk-about-the-ending-of-far-cry-5) which actually got a response from Ubisoft). Most of the criticism focuses on a few things:\n\n1. there is literally no foreshadowing, so it is jarring and abrupt. Well, actually, this isn't quite correct. According to the Ubisoft rep on that Polygon article it is \"hiding in plain sight\" because there are small number of news broadcasts on the radio station you can only listen to in cars, which I (and many others, apparently) never actually listened to. Unless you actually listened to these broadcasts, there is literally no foreshadowing.\n\n2. it erases everything you've been working towards for the entirety of the game. Every outpost you liberated, every town you saved, every person you befriended: all gone. All dead. This makes the entire playtime up to this point feel pointless and like a waste of time.\n\n3. it's tonally inconsistent with the rest of the game. It's a game about sticking it back to an invading force, with a sense of camaraderie and hope. In fact, the tone of the entire game is pretty much just the cult's ostensibly positive message about saving everyone juxtaposed with their unrelenting brutality towards everyone. That's about 99.9% of Far Cry 5. The remaining 0.01% is the ending, where you are told that the cult was \"right\" and that everything you thought was wrong. Polygon called this \"emo art school nihilism\". It's like a terrible attempt at the \"you were the bad guy all along\" trope done so well in games like Spec Ops: The Line. \n\nI want to make a slightly different argument here that follows on from point 3 and takes it slightly further. I don't think this is just simply emo art school nihilism. It's worse than that. It's actually **morally reprehensible**.\n\n######The cult is wrong... right?\n\nThe writers spend the entire game showing this cult to be awful, brutal, and terrifying. They murder, torture, and drug people, and are actually successful at capturing and brainwashing several of your colleagues, which leads to the murder-suicide of one of them. In fact, they're also successful at brainwashing *you*, to a certain degree (through Jacob Seed's post-hypnotic suggestion). The point is: they're awful, they're scary, and - to any reasonable, non-psychopath playing the game - they're flat-out *wrong*. \n\nOnly... they're not wrong, are they? Not within the world of Far Cry 5, at least. When you are driving your colleagues and Joseph to Duke's bunker during the ending sequence, Pratt is screaming \"he was right!\" the whole time. After you are dragged to the bunker by Joseph, one of the first things he says to you when you wake up is that this all means that he \"was right\", and that you stopped his (apparently reasonable) plans to prepare his family for this exact event. You were wrong, he was right. That's the end of the discussion.\n\n######It was all a \"reasonable\" means to an end, apparently\n\nThis is what seriously concerns me about this ending: the narrative seems to implicitly agree with everything the cult does. In making you feel bad for stopping his plans and showing all his prophesies to be true, it not only glosses over all the brutalising and torturing, but kind of *assents* to it, almost like the writers wanted you to see it as a semi-reasonable means to an end. It's almost like they wanted to say \"well, the world *was actually* coming to an end, so the cult were just doing what was necessary for the survival of humanity\". \n\n######This is (sort of) confirmed in an interview\n\nThis might seem like I'm putting words into their mouths, but there's an extremely telling interview [with Dan Hay, the creative director](https://news.vice.com/en_us/article/wj7gvn/the-creator-of-far-cry-5-is-worried-the-world-might-actually-be-ending) which seems to hint that he *actually has sympathies* for end of the world cults, and seems to think we are actually \"on the brink\". He even says \"when I started the game, I drove a Prius. Half way through the game, I bought a Jeep\", implying that he's given up on the world. He also talks about seeing a guy wearing a sandwich board saying \"the end of the world is near\" and he thought \"you're not wrong\". \n\nThey also interview filmmaker Mia Donovan, who was invited to work on the game by Ubisoft. She produced the film \"Deprogrammed\" which was highly controversial as it criticises Ted Patrick, a guy who takes credit for saving 1600 people from a cult, and questions whether it's actually worth saving people from cults at all. So yeah, they got in someone to advise them on the game who actually has sympathies for cults (or, at least, sympathies for the idea of just leaving them alone). \n\nThe interviewer himself actually says:\n&gt; sometimes cult members are really nice to you, and a lot of the things the cult says seem pretty reasonable. In fact, you spend a lot of the game wondering if maybe you should have just left the cult alone. Maybe you're the one who's crazy. Maybe the world really is about to end.\n\nEither we played a different game, or the interviewer himself hadn't actually played the game and was just saying what Ubisoft told him to. I suspect the latter is more likely, which makes this all the more concerning. The cult *aren't* nice to you. They're *never* reasonable. I never at *any* point thought I should have left this brutal, horrible cult alone, and left all these people to be tortured or killed. Anyone who could play the game and think that is seriously wrong in the head. \n\n######This is clearly the story they wanted to tell\n\nAnd here lies the fundamental problem with this game: it's pretty clear that this is the story they wanted to tell. Joseph was right, you were wrong, the cult isn't *too* bad, and you should have left them alone. The writers don't seem to care about the unrelenting brutality that the cult unleashes on Hope County. That's clearly not something they're interested in. What does it matter if hundreds of people are tortured, brainwashed, and murdered? The world is ending, and you are wrong for caring at all. \n\nThis isn't just a cynical, shocking, or \"bold\" ending. It's a morally reprehensible story told by people too jaded to care about human suffering anymore. ",
        "created_utc": 1523369932,
        "upvote_ratio": ""
    },
    {
        "title": "What are some older games you know of that cannot be pirated or downloaded from a digital store front?",
        "author": "mmm27",
        "url": "https://www.reddit.com/r/truegaming/comments/8b7th6/what_are_some_older_games_you_know_of_that_cannot/",
        "text": "[removed]",
        "created_utc": 1523369189,
        "upvote_ratio": ""
    },
    {
        "title": "Do game franchises always get faster over time?",
        "author": "SomeThoughtsOnDesign",
        "url": "https://www.reddit.com/r/truegaming/comments/8b76g6/do_game_franchises_always_get_faster_over_time/",
        "text": "I was thinking about how the combat, pacing, and general feel of several (most?) game franchises have gotten faster and faster as the series has gone on. For example, the pace of shooting and movement in the Call of Duty series over time, and the speed of the combat and healing in the Dark Souls series. Do you think most series get faster over time, and if so, is it linear and gradual or sudden and exponential?\n\n I was also wondering if this is something that all series that aren't turn based have experienced over time, and if there any examples where a series gets slower or reaches a maximum and plateaus. \n",
        "created_utc": 1523362850,
        "upvote_ratio": ""
    },
    {
        "title": "Games where combat only plays a small part?",
        "author": "Mewwy_Quizzmas",
        "url": "https://www.reddit.com/r/truegaming/comments/8b6t94/games_where_combat_only_plays_a_small_part/",
        "text": "[removed]",
        "created_utc": 1523358895,
        "upvote_ratio": ""
    },
    {
        "title": "Does the decision you made in video game reflecting you as a human being?",
        "author": "TheGoodKiller",
        "url": "https://www.reddit.com/r/truegaming/comments/8b55du/does_the_decision_you_made_in_video_game/",
        "text": "Some people said it doesn’t because at the end it’s just a video game, but you still have made a choice.\n\nFor an example: you either made a choice that make your companion suffer but for a greater good of the other people; or make your companion’s life is healthier but other people suffering.\n\nYou either got entitle as a selfish person for let majority suffer or entitle as a selfless person but a bastard that let your friend suffer?",
        "created_utc": 1523336490,
        "upvote_ratio": ""
    },
    {
        "title": "Unnecessary videogame mechanics",
        "author": "NYstate",
        "url": "https://www.reddit.com/r/truegaming/comments/8b3vlv/unnecessary_videogame_mechanics/",
        "text": "I would love to discuss hated videogame mechanics that are completely unnecessary. The one that I personally hate are breakable weapons. I remember playing Far Cry 2 and a gun literally explodes in your hand. Nothing worse than being in a fire fight and your weapon breaks. Unnecessary. It's a gun, they don't break that easy. Far Cry's pipe pistols hold up better than that, and it's made out of junk.\nPersonally I hate this and think it's an artificially designed to make a game harder. How about making a gun jam instead? That makes more sense honestly, I mean at least you'd just have to dodge behind something and unjam it, but breaking? Nope. \n\nDying Light also has weapons that break. In that game I understand, it's a survival game after all, however *all* of the weapons break. But how about having metal weapons being the only one that doesn't break? I'm no expert, but I'm sure I could bash 10,000 skulls with a pipe and it wouldn't break. People may argue that would make the game easier, but I disagree, guns would make the game easier, pipes would give you something to use until you find something  better. Honestly who wants to play the entire gaming using a pipe anyway?",
        "created_utc": 1523324046,
        "upvote_ratio": ""
    },
    {
        "title": "Which games journalists and/or critics would you most like to hear talk to each other?",
        "author": "Cosmo_Kane",
        "url": "https://www.reddit.com/r/truegaming/comments/8b33px/which_games_journalists_andor_critics_would_you/",
        "text": "[removed]",
        "created_utc": 1523317128,
        "upvote_ratio": ""
    },
    {
        "title": "For those of you who like 21:9 or (to a lesser extent) 16:10 monitors, what 2D or 2.5D side-scrolling games have adapted well to the form factor and scaled to fit your screen? What should they do?",
        "author": "gamelord12",
        "url": "https://www.reddit.com/r/truegaming/comments/8b2wj4/for_those_of_you_who_like_219_or_to_a_lesser/",
        "text": "Most examples I can think of for side-scrolling games are impacted by the boundaries of your screen.  Unlike a behind-the-back game, where you just get a wider field of view, side-scrolling games often don't load in enemies or levels until they're within some defined boundary; otherwise, you could often just shoot them from off-screen.  Hotline: Miami 2 feels like it was designed for a larger screen space than what they gave you, for instance.  How should a game like this scale so that it takes up the whole monitor but doesn't break the game?  Do you have any examples of games that have done it right?  This may also extend to games originally designed in 4:3 that scaled up to wide screen.",
        "created_utc": 1523315382,
        "upvote_ratio": ""
    },
    {
        "title": "[SPOILERS] The movie Annihilation would be a perfect subject for a video game.",
        "author": "landoindisguise",
        "url": "https://www.reddit.com/r/truegaming/comments/8b2s5d/spoilers_the_movie_annihilation_would_be_a/",
        "text": "Just watched this movie the other night, and although I rarely even have time to play games these days, for some reason I couldn't get this idea out of my head, so here you go. \n\n***\n\n**WARNING, SPOILERS FOR THE MOVIE FOLLOW.** I will try to spoiler tag everything, but there's really no way to even start this discussion without giving some stuff away. If you want to see the movie and haven't, I'd suggest not reading any further, as it'll be better if you go in not knowing anything about it.\n\n***\n\nSpecifically, it seems like the movie would work very well as a first person/third person action/horror shooter, either as a series of levels progressing from [SPOILER](#s \"outside or just inside the Shimmer to a final level at or around the lighthouse.\") or as an open world game sort of like STALKER.\n\nThis would work well for a bunch of reasons:\n\n*  [SPOILER](#s \"The weird mutations of everything in the world would allow for beautiful, creative environment designs and a basically unlimited number of cool and/or horrifying enemies. The possibilities and combinations are endless and they all have a convenient plot explanation. It would be very fun to play a game in this beautiful but bizarre and deadly environment.\")\n\n*  [SPOILER](#s \"Like the movie, the game could feature a day/night cycle where the day is about making progress and discovering story clues, and the night is more about survival horror, when the truly terrifying monsters like that screaming bear come out.\")\n\n*  [SPOILER](#s \"The movie makes it clear that multiple previous expeditions were sent into the Shimmer and disappeared but keeps it quite vague otherwise, so the game could be focused on the experiences of one of those teams without having to fuck with canon/retcon anything.\")\n\n*  [SPOILER](#s \"Unlike in most games, where it's kind of immersion-killing that people just left a bunch of tapes/documents/whatever around for you to find, in Annihilation the previous teams were intentionally leaving notes and records for the teams that followed them, so this common way of telling game stories actually fits incredibly well into the Annihilation 'universe'\")\n\n*  \"Multiplayer could be implemented in the form of team-based co-op story missions, \"wave\" survival mode in various locations at night, or even an open-ended DayZ type thing where [SPOILER](#s \"The team wakes up in different places with no memory of how they got there, and then from there it's up to each player to decide how they want to proceed.\")\n\n* Annihilation screenwriter and director Alex Garland has experience working on video games (he co-wrote Enslaved: Odyssey to the West), so there's at least a decent chance that if he was involved and the project was given to a good developer, it might actually end up being good. \n\n* [SPOILER](#s \"The movie leaves a lot unanswered so there could be plenty to explore in the game, story-wise - perhaps a team that learns much more about the alien, but fails to escape with that info, or chooses to escape secretly and keep it to themselves for some reason.\")\n\n* [SPOILER](#s \"Although the movie wasn't really about shooting or action, there's plenty of room in the world for a more action-focused game, and of course also plenty of room for sequels and spin-offs.\")\n\nAnyway it's a pretty decent movie, just couldn't stop thinking about how cool it'd be to play a game in that world though.",
        "created_utc": 1523314302,
        "upvote_ratio": ""
    },
    {
        "title": "[Xbox] Gamertags shop",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8b2mt0/xbox_gamertags_shop/",
        "text": "[removed]",
        "created_utc": 1523313061,
        "upvote_ratio": ""
    },
    {
        "title": "Without spoilers what are some of the best video game plots you've ever played?",
        "author": "the_DashingPickle",
        "url": "https://www.reddit.com/r/truegaming/comments/8b0v7k/without_spoilers_what_are_some_of_the_best_video/",
        "text": "[removed]",
        "created_utc": 1523299512,
        "upvote_ratio": ""
    },
    {
        "title": "Selling Clean Xbox Tags , Hmu on kik: @Pattern.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8b0dt3/selling_clean_xbox_tags_hmu_on_kik_pattern/",
        "text": "[removed]",
        "created_utc": 1523295924,
        "upvote_ratio": ""
    },
    {
        "title": "What are the differences / simmilarities between \"repetitive\" games, like Super Meat Boy or Celeste, and something like a jigsaw puzzle.",
        "author": "poringo",
        "url": "https://www.reddit.com/r/truegaming/comments/8azwjt/what_are_the_differences_simmilarities_between/",
        "text": "My wife likes jigsaw puzzles and I like games like Meat boy or Celeste, and she says it's kinda the same thing playing over and over until you \"solve\" a part of the game, much like \"solving\" a part of a jigsaw puzzle. The thing is, I don't like jigsaw puzzles, but I do see the simmilarity.\n\nI don't know if this is the place to ask, but I mainly want to know what you think of these 2 types of games, how are they related, if they are, etc.",
        "created_utc": 1523292404,
        "upvote_ratio": ""
    },
    {
        "title": "WWE Games should not be about winning. The gameplay should be about how good you are at Kayfabe!",
        "author": "oridjinn",
        "url": "https://www.reddit.com/r/truegaming/comments/8ayrjv/wwe_games_should_not_be_about_winning_the/",
        "text": "Ok so. When i was younger... 7 or 8. I got to play my first wrestling game.  \"WWF Wrestlemania\" for the NES. It was cool and fun and I have tried each of the new WWF/WWE games ever since.  \n\nBut I have not really enjoyed any of them for much more than just a few matches here and there at a friends house. And this is because they make these games like fighting games. The problem with this is.. In a real WWE career a wrestler does not win every single match all the way to the top. So making the gameplay mostly about winning every match never made any sense.    \n\nEven as a very young child I realized this. Yeah I wanted to win.. But it made no sense to win EVERY TIME. a real WWE career is filled with ups and downs, Injuries, new moves, re-branding, etc..    \n\nThe problem is What we enjoy in WWE is not the fighting. It is about the story, the moves, The botches, Selling, Faces, Heels, Turns, etc.. Seeing 2 Pros who know what they are doing IS where the entertainment is. Watching 2 guys just perform the same 3 moves for 15 minutes is boring and then you do not care who won or loss. Everything leading up to that match and the content of the match are far far more important.       \n\nNow while some of that would be near impossible to get into a game mechanically. I think a lot of it could be done.  \n\n\n**DISCLAIMER - I am not trying to design a new game here and now. There will be gaps in my idea. HUGE gaps. I am simply trying to convey a general concept for how I think WWE games should be.\"**    \n\n**How to Play the Game - It doesn't matter if you win, It matters how you play**  \n- The game should be about how well you can \"Fake Wrestle\" Just like the WWE really is.  \n- The stats should not be Strength and speed. They should be performance skills Like Selling hits, Landing moves, Acting chops, creativity.  \n- \"Winning\" Should be on how well your wrestler can Kayfabe!  \n\n**What does it mean? How do I \"win\"?**  \n- You \"Win\" when you sell that thrashing and make your defeat look real.  \n- You \"Win\" when you do not injure yourself or others performing moves.    \n- You \"Win\" when you raise that \"Selling\" stat higher.  \n- You \"Win\" when you win over the crowd for your Underdog abilities.  \n- You \"Win\" when you goto the gym and adjust your wrestlers appearance a little.  \n- Getting stronger to do certain moves on heavier opponents.  \n- Maybe you get lighter to allow different moves to be done on you more easily  \n- You \"Win\" because everything you do decides what you can and cannot do, and you get to decide and re-work your wrestler and career.  \n\n**How could this possibly work?**  \n- It would play basically very similar to how it does today, but your moves are no longer thing to do to the other player. They are moves you and the other player do together. It does not matter who takes the hit, It matters how well you execute each piece.  \n- You would have a way to tell what kind of move the other wrestler wants to do and ways to communicate the move you want to do.  \n- There would be stats for which wrestler decides the next type of move.  \n- As you become more experienced you make more decisions, when you fight with equally skilled kayfabe levels you both decide moves together and can mix styles.  \n- The crowd would have a variety of enjoyment levels \"Realism\", \"Entertainment value\", \"Underdog\", \"Champ\", etc..  \n\nAnyways I have lots of ideas about how to go about it, but a lot of that is irrelevant. My main point is. The game should be a fighting game. But now about winning. Simply about putting on a good show. You could lose every single match in your career. and that would be your \"thing\" You still win at the video game because you become a good wrestler who can make others look good, Help put others over, Put on a good show, and not injure your co-workers.  \n\nThanks for reading.",
        "created_utc": 1523283637,
        "upvote_ratio": ""
    },
    {
        "title": "game design discussion: a game that's not full on combat heavy and how to make it good.",
        "author": "ewolf20",
        "url": "https://www.reddit.com/r/SRSGaming/comments/8ayk8c/game_design_discussion_a_game_thats_not_full_on/",
        "text": "",
        "created_utc": 1523282552,
        "upvote_ratio": ""
    },
    {
        "title": "Is your enjoyment of a famous/well-acclaimed game affected by how much you know about it before playing?",
        "author": "fabrar",
        "url": "https://www.reddit.com/r/truegaming/comments/8ay88r/is_your_enjoyment_of_a_famouswellacclaimed_game/",
        "text": "For a lot of us, it's natural to get around to playing a well-regarded game (by both critics, regualr consumers and more \"serious\" reddit gamers) a few years after it releases for a multitude of reasons. Unless you completely cut yourself off from all gaming-related news or discussion, it's inevitable that you'd assimilate at least some aspects and qualities of these games in your head. Most likely, you'd form some kind of baseline opinion on them too.\n\nSome examples:\n\n- The Last of Us - you'd be likely to hear about an emotionally powerful narrative, compelling character interaction and grounded, realistic gameplay\n\n- The Witcher 3 - amazing narratives and stories, gorgeous visuals, immersive open world and realistic characters\n\n- Dark Souls - You'd hear about it being punishing and difficult, have great world design, precise combat and a general sense of obfuscation\n\n- Portal 2 - you'd hear about the great storyline, charming characters and clever puzzles\n\nWhen you actually play these games, has your pre-conceived notions and what you know about these games before playing, and what you *imagine* them to be, affect how your experience when you're actually playing them?",
        "created_utc": 1523278904,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good games that dont require much attention?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8avuzz/what_are_some_good_games_that_dont_require_much/",
        "text": "[deleted]",
        "created_utc": 1523248526,
        "upvote_ratio": ""
    },
    {
        "title": "A Way Out is Memorable for the Right Reasons",
        "author": "Masseffectshep",
        "url": "https://www.reddit.com/r/truegaming/comments/8aunmf/a_way_out_is_memorable_for_the_right_reasons/",
        "text": "A Way Out\n\nThe Scenarios \nConsidering the simple approach to gameplay and the focus on story, the game continues to keep good pacing for your first playthrough and retain that for a second session. I think part of this is from the situations. Each scenario is a mini puzzle that has its own moment of victory and giving the player that feeling of progression and accomplishment. This is seen right away from the prison escape as players participate in each piece of the escape. \n\n\n\nThe Characters \nBoth Leo and Vincent have great chemistry and this is from both the performances and the writing. The brief sequences in the plane allow players to see a friendship that has grown and how they joke about prior events. The beginning of the game shows how we start at square one with them. The contrast made the relationship interesting from a storytelling stand point. There’s a bit of connection between the characters growing to work together and the actual players learning to work together. \n\nThe Camerawork \nI wish there was an award for Best Camerawork in Video games. The direction is masterful at times. You get a glimpse of this from the courtyard fist fight in the prison and then you see the Memorable Hospital Escape and your jaw hits the floor. The use of transitioning player control between players and the film like movement of making it look like the sequence is done in one take is impressive. \n\nLink: https://youtu.be/zuuXXhwT6kk\n\nA Way Out is one of the best things to have that EA label on it in a long time ",
        "created_utc": 1523236224,
        "upvote_ratio": ""
    },
    {
        "title": "Nice Xbox Tags &amp; OG Tags ! Hmu on kik: @Pattern.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8asoz8/nice_xbox_tags_og_tags_hmu_on_kik_pattern/",
        "text": "[removed]",
        "created_utc": 1523218681,
        "upvote_ratio": ""
    },
    {
        "title": "Mechanics of grinding and how they retain a player's attention vs. fresh content.",
        "author": "Duderino99",
        "url": "https://www.reddit.com/r/truegaming/comments/8as80b/mechanics_of_grinding_and_how_they_retain_a/",
        "text": "I've been trying to get my friend into Destiny 1 and Monster Hunter, but he expressed that just doesn't see the appeal of grinding. This is the text I sent him attempting to lay out the basic fundamentals behind the design of a grind:\n\n\"\n\nGrinding games are typically loot-based, meaning that each weapon/drop has the potential to fundamentally change the way you play.\n\nThe repeated boss fights/activities are not just to get more gear, but because you learn them like the back of your hand, it allows you to become extremely inventive and creative in your playstyle.\n\nGrinds will always let players have a Grail they're chasing, their carrot on a stick. However, good grinds are ones where the sandbox is fun enough to warrant playing without the external reward, items and builds are player-set goals and self expression within the grind sandbox.\n\nGrind games typically have extreme mechanical depth, allowing every encounter to played in an infinite amount of ways. Players are expected to change their builds and play styles consistently to match the challenges\n\na) Intrinsically have more fun\n\nb) Have a better chance of beating the encounter and receiving your reward\n\nc)The hell of trying something new\n\nThis creates a positive feedback loop of getting better at the game&gt;enjoying the game more fully.\n\nIt's important to note, most grinders are MMORPGs at heart, and as such, are designed with a power fantasty and power curve in mind. Begin the boring basic rat, end with the dimension shattering God. Good grinds keep all enemies and activies relevant to an end-game player. (Monster Hunter gets a special note and does this by having High Rank, where once the player has defeated all the monsters they are all powered up to an equal level. It's kind of ingenius in it's simplicity. No other game does this.)\n\nThe appeal of grinders is the fact you are able to replay the same activies infinitely, and good grinders will have a diverse pool to choose from, always allowing the player to keep it fresh.\n\nI feel Monster Hunter and Destiny excel in all these things. Not everyone enjoys grinding, of course, but the repeated content (diverse enough to keep interest) is the main appeal. So I find it strange you seem to not enjoy it at all.\n\n\"\n\nWhat are your thoughts? Did I miss something essential to a grind? Do you think this theory holds any water, or should we move away from grind-based games?",
        "created_utc": 1523214944,
        "upvote_ratio": ""
    },
    {
        "title": "Fortnite teammates.",
        "author": "evaxton",
        "url": "https://www.reddit.com/r/truegaming/comments/8as2nx/fortnite_teammates/",
        "text": "[removed]",
        "created_utc": 1523213677,
        "upvote_ratio": ""
    },
    {
        "title": "Do you enjoy difficult/grindy games?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8ar79i/do_you_enjoy_difficultgrindy_games/",
        "text": "[removed]",
        "created_utc": 1523206410,
        "upvote_ratio": ""
    },
    {
        "title": "The Impact of Voice Acting in Video Games",
        "author": "Gaming_Truth",
        "url": "https://www.reddit.com/r/truegaming/comments/8and8r/the_impact_of_voice_acting_in_video_games/",
        "text": "I for one, will be the first person to talk to you about a game's core mechanics and how well they fit the controls or overall gameplay. I will talk all day about the aesthetics that the game elicits for me as a player, or about how well the game grabbed me in terms of immersion. And while I will find myself sometimes mentioning a game's amazing soundtrack or art style, I rarely ever mention (good or bad) the quality of voice acting in a game.\n\nOften times I find myself so into a game, but the voice that expresses the character I am so invested in seems like a distant noise in the back of my head. The only times I ever seem to notice much of anything is if I recognize the voice actor from a different game. Very few times have I really sat down and thought, \"Wow, that was some incredible voice acting.\" Rarely does the voice acting in a game raise or lower my overall rating of said game, and I can't tell if that is a good or bad thing.\n\nI am sure that there are many people who have a much keener ear than me, and are more affected by voice acting in games than I am. What I mainly want to discuss is this point. How impactful is voice acting to a player overall, and can we consider voice acting \"good\" if it doesn't affect the player or the playthrough at all?\n\nJust want to know your two cents.",
        "created_utc": 1523157305,
        "upvote_ratio": ""
    },
    {
        "title": "[Spoilers] Apollo Justice: Ace Attorney. A good , but flawed game experience, with interesting writing and ambitious ideas. A potential wasted in the saga",
        "author": "LuisSLS_HQ",
        "url": "https://www.reddit.com/r/truegaming/comments/8an3gc/spoilers_apollo_justice_ace_attorney_a_good_but/",
        "text": "Hello, I wanted to talk about Apollo Justice after having completed it for the second time. It is one of my favorites in the franchise, but I think it's worth analyzing it more thoroughly, and talking about several aspects. So let's go with this analysis from the introduction of the game until the end of its history development.\n\nThe game is a graphic adventure / visual novel that consists of 4 cases to develop the argument. This installment is the fourth title of the Ace Attorney franchise, but in its own way, this is the point of division between triology and 3DS games. Something that differentiates this game from the rest of the franchise, is the atmosphere and tone it presents, which makes it unique in a certain way: The game has a certain dark aesthetic in the scenarios, and the characters live that tone. The game wants to talk about the dark era of the law: With things like falsification of evidence, corruption and the mafia as the background of cases. \n\nThe game is right in some of the aspects to work in this field: The first case is successful in everything to develop and build the stage from the first point. As the protagonist of previous deliveries becomes nothing more than a lawyer stripped of his badge and is blamed for murder as our first client, how the previous concept of the figure of the defense lawyer is deconstructed, and becomes a villain (Kristoph Gavin), the fact that our mentor, who gives us first impressions that will be a supporting  character in the game, is revealed as a murderer, and we must confront him, as our client falsified evidence to have a verdict of no culpability. There is also the aspect that none of your clients is totally innocent, even, having crimes and past history that makes you question the aspect of their innocence (As a suspect Ganster, or Phoenix forging evidence at the beginning)... That separates Apollo Justice from the other games, from the familiar aspect and with caricature touches, to a more cold and sinister one. Phoenix's transition from lawyer to father, and the role he plays in the story, makes it clear. Phoenix is ​​a forger, who developed a complicated scheme of revenge against Kristoph to put the balance of the legal system in his favor. The mystery surrounding Phoenix's past in the first and last case is fascinating, and Kristoph Gavin makes him really great as a villain. Then come case 2, which is more to introduce and characterize the characters, as the introduction and dynamic with the prosecutor with the defense attorney, the introduction of Trucy Wrigth, involve Apollo in his first case as an employee of a private agency , talk more about the past of Phoenix, re-introduce Emma Skye in the fourth installment as the main detective, and introduce you to the mechanics and dynamics of the gameplay (Interrogation, investigation, present evidence, explain more about the ability to perceive the witness's concerns and elements of detective investigation, such as the fingerprints system). At the moment I will not talk about case 3, but speaking about case 4, it has great things. Finally it reveals the master mind that is Kristoph Gavin, as a manipulative murderer, which was behind the death of Zak G., and which personality surrounds it a sinister aura and hidden mystery of Psycho black padlocks that hide the evil being behind of the lenses. The case links all the cases so that the whole game feels connected to each other, and the game has an end where it tries to transmit us, how the law is hollow and full of contradictions, and the system changes over the years , with us changing around the system. Also, how the introduction tells us and explains about certain past mysteries, and even those of which we do not realize. And when the characters look at the screen, and the player represents the jury system to make the final decision, wow.\n\nNow, what is what makes AJ \"flawed\"?. To begin with, speaking of the protagonist, I must assume that he is a great character: Something optimistic but sarcastic, how he genuinely wants to be a lawyer for justice and not for a tragic background, his reactions to the interactions with the other characters, having a more critical personality with regard to, and how It differs from the other main characters in the series with its way of being. At the first moment that he acts in court, you feel that after 7 years, he finally arrives at a court, where the law has been almost devastated, and he is the hope that the judicial system needed at that moment to find the truth. And he does ... for 2 cases. In the first case, you feel very close to the hand of Phoenix and his mentor, but it is not necessarily a bad thing, because due to how the story unfolds, it makes a lot of sense. The problem is in the last case: As a whole, it does not seem that Apollo's actions really mattered, or at least, you do not feel that in any way, we are as important as Phoenix is, and the story and outcome will only focus on the fall and rise of Phoenix Wright. Which is not bad in one part, on the other hand, it is a pity that Apollo did not have the opportunity to really shine in the revelation or central development of the great mystery, taking away the focus of what could be, a great execution for him to play the role he was made from the beginning. Also, case 3 would be specifically, which is the part of the development of the story where the game becomes a heavy experience. One of the main mechanics that involves one of the pieces of key evidence is exploited but in a horrible way that makes it a tedious and irritating experience to play (the videotape), the logic of the accusation is extremely questionable, the villain is weak, the prosecutor in charge of the case supports the defense more than his best friend being accused of a crime, the pace of the case is bad, and the case in general is very flat, uninteresting and full of inconsistent and dull moments. The last case even has its flaws. Like the fact that it closes other mysteries, but not its own...not at all. As the antagonist's dark psycho-locks, for example, or a certain part of the antagonist's motivations and origins, although some aspects give him the charming mysterious touch that the antagonist possesses, and you can even speculate and form an idea around the information in some points, but there are other issues that involve the plot and that intrigues long term in an unsatisfactory way. \n\nBut I must admit that, although the game has its great points and amazing qualities and details that it has, it also has those flaws. And it's a shame, because the total idea of ​​Apollo Justice, makes it have a lot of potential. Starting with the second case, where to start ?. The case in general is very good and enjoyable, but it could be amazing and unforgettable: The whole thing of the mafia as part of the background, could be a fundamental part of the development of the argument, as the Kitaki family bribes or threatens members of the court and the police to falsify or create false evidence, or even change key parts of the story: Make Wocky a secondary character to the story, make the father the murder suspect, make Alita Tiala the accused and make Plum a witness . They could develop more the characters that make up the Kitaki family, and even give a more powerful meaning to the subject related to Bigs Wins and their interest in leaving the world of crime by the condition of Wocky, and that he and Plum have a emotional confrontation in court. Eldoon is a nice, unique and particularly memorable character. It's good, but it could be MUCH better. Explore more the character as a doctor than as a noodle vendor, delve into his background story, and give a satisfactory conclusion to his little sub story. That would have benefited the case, and even, why not, would have added an important character to the franchise in the long term. And going with Case 3, the concept of the case in a concert is great, but the case as a whole makes it terrible in terms of execution. The argument could be improved if: Making the victim our client would make more sense to the accusation arguments against the accused, make the antagonist more interesting and better written, make Klavier worry more about his partner to the point of facing to the court in an emotional way, since in itself, it seems that he cared more about the guitar case than his friend, and make Laminoir a more interesting witness. In addition to that, of course, remove or make less redundant the mechanics of the video tape. They could make something much better and more digestible as part of the story and as a case. Case 4 can improve on a lot of things and be even brighter if it is composed and elaborated better: Kirstoph Gavin is great, but with an excessively paranoid direction and without adequate enough development. We seek to be complex, and the Apollo Justice message is genuinely interesting and involves something deeper than we think, but MUCH more is missing to concretize those ideas. The motives of Kristoph could be an exploit minds, since in general the saga has given us villains with more concrete and exact motivations, but this time, it becomes the main dish of the great mystery that awaits to be discovered to find that message, but the fact that the only thing we have is \"I kill a man for a game of cards and because I am bad\" when there is supposed to be much more than just that around him. It has all the elements, the pieces, the moment, but in the end, it is a bit disappointing and lacks substance in its moment of brilliance. As well as, well, the mysteries that it leaves aside: Not only related to Kristoph, the drawings of Adrew of the previous cases also do not lead to anything really, and the fact that Laminour is the mother of Trucy and Apollo is only revealed to the final and it means absolutely nothing because the game is over. As well as the fact that the victim was killed by the poison at the exact moment in which there was a witness in front with a sickly perfect synchronization. And well, the list goes on and on.\n\nIn conclusion, I can say that Apollo Justice is a good game, or well, at least a solid one. The characters are really very good and memorable, 3 of the cases have a great mystery, the atmosphere and tone is part of what makes it special, I really like the protagonist and the research in general is good enough for a game of the saga. It could be said that it is one of my favorites. But nevertheless, that does not stop him from being far from being the best. Anyway, is next to those games like Crash Twinsanity: Those games whose concepts and ideas gave for more in their games for different reasons. It just feels rushed. The game has ambition, has vision, the context surprises me and fascinates me to take into account as a game of the series, when the game hits its positive points it is magnificent, and to this day, I do not see any other game that is feel particularly like this in the franchise to which it belongs. But, in execution stumble in certain points and it is necessary to develop all those ideas, and build them properly. And it's a shame, because even though Spirit Of Justice looks great (I have not played it), you can appreciate Takumi's attempt to end the Phoenix moment in Ace Attorney and start a new world, a new setting and a new story. Dual Destinies is the opposite of the fourth game, being more charming, bombastic, and with the colorful and friendly environment of the triology, and from here, is what makes this delivery is maintained by what makes it unique. \n\nI like it, I can even say that I love it, but it could be the best, it really could , and is very distant from being.\n\n\n\n",
        "created_utc": 1523154393,
        "upvote_ratio": ""
    },
    {
        "title": "Games that handle weather immersively without being annoying?",
        "author": "Tre2",
        "url": "https://www.reddit.com/r/truegaming/comments/8ampf8/games_that_handle_weather_immersively_without/",
        "text": "[removed]",
        "created_utc": 1523150271,
        "upvote_ratio": ""
    },
    {
        "title": "Having watched Spider-Man: Homecoming and seeing all the suit upgrades, I am desperate for the team that did Prototype (Radical, now absorbed into Activision) to make the game.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8am92d/having_watched_spiderman_homecoming_and_seeing/",
        "text": "[removed]",
        "created_utc": 1523145840,
        "upvote_ratio": ""
    },
    {
        "title": "What's the point of hacking and cheating in a video game?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/truegaming/comments/8am459/whats_the_point_of_hacking_and_cheating_in_a/",
        "text": "[removed]",
        "created_utc": 1523144487,
        "upvote_ratio": ""
    },
    {
        "title": "What's this sub's opinion on Life is Strange?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8altxo/whats_this_subs_opinion_on_life_is_strange/",
        "text": "[removed]",
        "created_utc": 1523141721,
        "upvote_ratio": ""
    },
    {
        "title": "What are the actual \"rules\" for what constitutes an overly or distastefully sexualized character in a game?",
        "author": "Manonymous",
        "url": "https://www.reddit.com/r/truegaming/comments/8alpah/what_are_the_actual_rules_for_what_constitutes_an/",
        "text": "[removed]",
        "created_utc": 1523140549,
        "upvote_ratio": ""
    },
    {
        "title": "What are some (preferably recent) challenging/engaging games to play with a significant other?",
        "author": "Soycrates",
        "url": "https://www.reddit.com/r/truegaming/comments/8al715/what_are_some_preferably_recent/",
        "text": "[removed]",
        "created_utc": 1523136041,
        "upvote_ratio": ""
    },
    {
        "title": "What is the most immersive atmosphere you have seen in a video game?",
        "author": "LuisSLS_HQ",
        "url": "https://www.reddit.com/r/truegaming/comments/8ak15e/what_is_the_most_immersive_atmosphere_you_have/",
        "text": "[removed]",
        "created_utc": 1523125963,
        "upvote_ratio": ""
    },
    {
        "title": "Pumped up for E3 2018 ?? 🤩🤩🤩",
        "author": "zaintheyelloww",
        "url": "https://www.reddit.com/r/truegaming/comments/8ajzvp/pumped_up_for_e3_2018/",
        "text": "[removed]",
        "created_utc": 1523125670,
        "upvote_ratio": ""
    },
    {
        "title": "Did Minecraft start the Xbox One stagnation? Is XB1 improving?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8ajboq/did_minecraft_start_the_xbox_one_stagnation_is/",
        "text": "[removed]",
        "created_utc": 1523119882,
        "upvote_ratio": ""
    },
    {
        "title": "With the Nintendo Switch as the main console of Nintendo today, what do you think about the Wii U?",
        "author": "LuisSLS_HQ",
        "url": "https://www.reddit.com/r/truegaming/comments/8aja8t/with_the_nintendo_switch_as_the_main_console_of/",
        "text": "(I did a little edit)\n\nIt could be said that the console was one of the biggest commercial failures of Nintendo, but nowadays, is a console that has been able to extend its catalog through its years of life. And now with his death, what would be your opinion of this console today? Is it one of the best or the worst ?, why you consider what it is ?, or what makes it so special for you?\n\n",
        "created_utc": 1523119491,
        "upvote_ratio": ""
    },
    {
        "title": "A noob looking for Fornite squad mates",
        "author": "AeroElectro",
        "url": "https://www.reddit.com/r/truegaming/comments/8ainvb/a_noob_looking_for_fornite_squad_mates/",
        "text": "[removed]",
        "created_utc": 1523114022,
        "upvote_ratio": ""
    },
    {
        "title": "How are exclusivity contracts profitable?",
        "author": "TheGreatMontezuma",
        "url": "https://www.reddit.com/r/truegaming/comments/8ahkje/how_are_exclusivity_contracts_profitable/",
        "text": "[removed]",
        "created_utc": 1523101994,
        "upvote_ratio": ""
    },
    {
        "title": "The future of exercise is the gamification of exercise - agree or disagree?",
        "author": "atomicwombat00",
        "url": "https://www.reddit.com/r/truegaming/comments/8ahj0b/the_future_of_exercise_is_the_gamification_of/",
        "text": "Hey all\n\nAs a kid, I was an avid and eclectic gamer. You could find me and my friends WoW'ing, CS'ing, Gran Turismo'ing, Fifa'ing and many more'ing until the early hours. It wasn't so good for my grades but it was certainly great fun\n\nBut in my current late twenty-something state, I've found my life has shifted from late night COD binges to early morning starts and after work gym trips aimed at maintaining and improving my health. In other words, physical health and the necessity to live has taken a precedent over my love of gaming\n\nThis isn't necessarily a bad thing, as I love to exercise and feel great being active. But it'd be fantastic if games could be integrated into my routine\n\nIn this respect, it seems obvious why gamifying exercise would be extremely beneficial to me since I'd kill two birds with one stone\n\nBut for those of you who still play games without exercising - do you ever worry about not exercising, and if so, would the gamification of exercise appeal to you? I imagine it would because you'd allay health concerns whilst doing what you love. In other words, you'd also kill two birds with one stone\n\nAlso, for those of you that exercise and still game - are you, like me, interested in equipment focusing on your love of games? To me there seems too little equipment on the market focused on that\n\nAnyways, my answer to the above is probably quite obvious - yes I think the future of exercise is the gamification of exercise. To me it addresses both those who love gaming, but want to exercise and aren't, and those who exercise and game\n\nWhat do you think? Is the future of exercise the gamification of exercise?\n\n\n\n\n",
        "created_utc": 1523101373,
        "upvote_ratio": ""
    },
    {
        "title": "Gaming as an art is dead, all that remains are soulless products from corporations.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8agnad/gaming_as_an_art_is_dead_all_that_remains_are/",
        "text": "[deleted]",
        "created_utc": 1523087198,
        "upvote_ratio": ""
    },
    {
        "title": "Kingdom Hearts: Chain of Memories, an excellent an idea that falls flat.",
        "author": "hcipap",
        "url": "https://www.reddit.com/r/truegaming/comments/8ag78p/kingdom_hearts_chain_of_memories_an_excellent_an/",
        "text": "Hello everyone, I've been playing through Re: Chain of Memories, and boy does this game's card system seem interesting. \n\nSo let’s me start by explaining how this system works, and what I think it does great.\n\nIn Chain of Memories, every action you want to take is based on what cards you have in your deck. Cards are numbered from 0-9. In the middle of the screen, cards are played against each other, the higher card always wins, and if a card is broken, the animation stops and you get stunned for a bit. That all applies to everything, with the exception of the 0 card, which can break any card, but can be broken by any other card. Once you run out of cards, you must “Reload” them, which leaves you vulnerable for a couple second while you do. You also have the ability to use sleights, which is combining 3 of your cards at once, to either form a chain of attacks, or a whole new ability entirely.\n\nThese are the basic rules for every encounter. I think this system allows for a wide variety of tactics, in the very early game and in some boss fights, it forces you to think smart with your cards, you have to keep track of maneuvering around the battlefield while also finding the perfect cards to attack and when to use them. I feel like it really truly hits that nice balance between turn based and real time combat that a lot of JRPGs have attempted in the past. And… that’s all I can really say that’s good about this system, because it almost squanders all of it’s potential with the following issue:\nThe game is far too easy. I played it on Proud on my recent go around, first time in years, and I was honestly shocked that I ever had issues with it. I’m focusing on the PS2 version because this was their chance to fix the issues of the original, but not only did they not fix them, the issues were made several degrees worse. \n\nThe game is too easy because all of the non-boss encounters can be beaten by doing NOTHING other than press triangle. I mean it, once you hit the 3rd or 4th world, you will have a deck with a few decent sleights in them. After that, you can close your eyes, press triangle, and wave goodbye to any idea of strategy or challenge in the random encounters. The reason for this is that the mobs never, ever, get 0 cards. There is not a single common enemy in the game that uses 0 cards. They also can’t perform sleights, which means that, if Sora is attacking with any cards 10 or above, the enemies will never be able to attack. Which is… baffling to say the least, when the 0 card and sleights were obviously designed to combat the over-usage of an opponents sleights and counter opponents. So, if you do just sit there and… press triangle, the enemies will never be able to get a hit in. They will never have a card that beats anything higher than a sleight with 10 or more. It creates a reverse difficulty curve within the game, since Sora is constantly getting more powerful, and all the enemies really never evolve since they can never counter your attacks after a certain point. This glaring issue with the game was made so much worse in Re: Chain of Memories. I appreciate wanting to add new content and mechanics to the game, but all they do is make the combat even more trivial than before. Games can give you plenty of powerful attacks, but also make the game balanced, Resident Evil 4 and The Darkness 2 both pull this concept off excellently, by making ammo limited for your weapons and enemies that require you to think differently and require you to switch up what how you approach a situation with different enemy types that force you to approach situations in a myriad of ways.\n\nI go more in detail on this in a video: https://www.youtube.com/watch?v=d36VUb4-Q5k\n\nHow do you guys think they could have improved this combat system and make it work?",
        "created_utc": 1523080602,
        "upvote_ratio": ""
    },
    {
        "title": "A rare thing: The Satisfying ending Ethan Carter",
        "author": "Availe",
        "url": "https://www.reddit.com/r/truegaming/comments/8aeuuf/a_rare_thing_the_satisfying_ending_ethan_carter/",
        "text": "[removed]",
        "created_utc": 1523065117,
        "upvote_ratio": ""
    },
    {
        "title": "I recently delved into the world of modern Board Games, and I must say, it was love at first sight.. BUT, I don't see myself buying any of them unless they're in digital form.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8aeqz4/i_recently_delved_into_the_world_of_modern_board/",
        "text": "[deleted]",
        "created_utc": 1523063977,
        "upvote_ratio": ""
    },
    {
        "title": "I want to homebrew a new species. Where do I start?",
        "author": "Just_Pip",
        "url": "https://www.reddit.com/r/truegaming/comments/8ae4s3/i_want_to_homebrew_a_new_species_where_do_i_start/",
        "text": "[removed]",
        "created_utc": 1523057867,
        "upvote_ratio": ""
    },
    {
        "title": "Games which are suitable for beginners with limited experience",
        "author": "NewtUK",
        "url": "https://www.reddit.com/r/truegaming/comments/8ade59/games_which_are_suitable_for_beginners_with/",
        "text": "[removed]",
        "created_utc": 1523051191,
        "upvote_ratio": ""
    },
    {
        "title": "What makes a character unique/memorable ?",
        "author": "ExternalFinding",
        "url": "https://www.reddit.com/r/truegaming/comments/8acp81/what_makes_a_character_uniquememorable/",
        "text": "I know almost everyone has a preference to a particular character. One they see as unique as well as able to relate too.\n\nI've had a lot of people saying they feel the most memorable character is Gordon Freeman which i find quite odd seeming as he plays a silent protagonist and to my knowledge doesn't have any feats upon which the player can relate too ?\n\nIm also aware many people would point out Mario as the most unique/memorable and I wonder if this is due to him being around so long and potentially seen as the franchise character of gaming.\n\nI would like to understand why characters with little to no dialogue such as those listed above are strongly preferred over story-heavy characters such as General Shepard from the Mass Effect series.\n\nI would also like to know who you think the most unique/memorable video game character is and why ?\n\nI also will include a survey link that you can fill out that can help me gather results however this is optional:\n[Link to said survey](https://docs.google.com/forms/d/e/1FAIpQLSfBIxcVCPunl4twyPr7ozmIyBl-9CiwFqFeUVG4t1bH-G9Liw/viewform?usp=sf_link)",
        "created_utc": 1523045602,
        "upvote_ratio": ""
    },
    {
        "title": "Re-Using Game Worlds",
        "author": "CaptRik",
        "url": "https://www.reddit.com/r/truegaming/comments/8aburh/reusing_game_worlds/",
        "text": "What do people think about the idea of a games developer releasing an open world game (e.g. BotW, RdR, GTA) and following it up a year later with a second game using the exact same game world but with completely different assets and storylines, perhaps with some new/improved mechanics too?\n\nIt’s something I don’t think I’ve ever seen done before, for example there’s ocarina of time &amp; majoras mask (different world, some asset re-use).\n\nThere seem to be some obvious advantages, mainly that the cost of developing the game world can be recouped across more than 1 game, which may in turn allow the cost of each game to be lower than they currently are.  In theory a games developer couple even license their game world to another company to make their own game using it.\n\nAnother advantage would perhaps give developers more time to refine ideas that didn’t make the cut for the original game into something, also using player feedback.\n\nThoughts?",
        "created_utc": 1523039011,
        "upvote_ratio": ""
    },
    {
        "title": "What is your favorite 2D platform game in terms of artistic direction?",
        "author": "LuisSLS_HQ",
        "url": "https://www.reddit.com/r/truegaming/comments/8abe6c/what_is_your_favorite_2d_platform_game_in_terms/",
        "text": "[removed]",
        "created_utc": 1523035540,
        "upvote_ratio": ""
    },
    {
        "title": "Smash Bros. Brawl, in my opinion, remains the highest point in Singleplayer experience and content in any Smash Bros, and one of the most important deliveries in the series.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8ab1mo/smash_bros_brawl_in_my_opinion_remains_the/",
        "text": "[deleted]",
        "created_utc": 1523032923,
        "upvote_ratio": ""
    },
    {
        "title": "Why “Patient Gaming” Is The New Best Gaming Trend",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8aat1n/why_patient_gaming_is_the_new_best_gaming_trend/",
        "text": "[deleted]",
        "created_utc": 1523031158,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think I should keep my hope up for Project Phoenix Rising by Visionary Games?",
        "author": "CarnivalOfLies",
        "url": "https://www.reddit.com/r/truegaming/comments/8aa7zz/do_you_think_i_should_keep_my_hope_up_for_project/",
        "text": "[removed]",
        "created_utc": 1523027024,
        "upvote_ratio": ""
    },
    {
        "title": "Nostalgia in Video Games",
        "author": "OdaibaBay",
        "url": "https://www.reddit.com/r/truegaming/comments/8a8vye/nostalgia_in_video_games/",
        "text": "*Not to be a downer, really not my aim.* But the hype that's greeted the Spyro announcement has left a weird taste in my mouth. \n\nOne common criticism of popular culture over the past decade has been the immense amount of nostalgia properties being wheeled out again and again in different versions. This is especially obvious in the film industry- where major Blockbusters seem to default to remakes, sequels or adaptions- with the occasional new IP thrown in to experiment. \n\nIt's got me thinking what extent has gaming has been infected by this. Is the excitement which has greeted the Spyro games, or the Crash Bandicoot remakes, or Bethesda's DOOM, a good natured desire to replay older games with a new polish on them? Or does it signal a more suspect nostalgia infection of the gaming industry? Are we dumbing ourselves down by trying to recapture the gaming experiences we had as kids? And does it even matter?\n\nIt's also an interesting situation, since the former kings of nostalgia, Nintendo, appear to be turning away from it slightly and experimenting more with different styles of gameplay: Breath of the Wild being a great example. They appear more wiling to shake things up and even annoy older fanbases in order to try something new. \n\nPerhaps it's just me, and while I feel uneasy about this I don't feel especially militant in opposing it- these older games were fun- but these long term trends matter and will dictate the shape of the industry for years to come. \n",
        "created_utc": 1523015706,
        "upvote_ratio": ""
    },
    {
        "title": "Selling all games and starting over to solve backlog issue?",
        "author": "throwaway_184893",
        "url": "https://www.reddit.com/r/truegaming/comments/8a86s6/selling_all_games_and_starting_over_to_solve/",
        "text": "[removed]",
        "created_utc": 1523007607,
        "upvote_ratio": ""
    },
    {
        "title": "Being so bad at video games makes me want to stop playing them.",
        "author": "Suplewich",
        "url": "https://www.reddit.com/r/truegaming/comments/8a6yo9/being_so_bad_at_video_games_makes_me_want_to_stop/",
        "text": "[removed]",
        "created_utc": 1522991834,
        "upvote_ratio": ""
    },
    {
        "title": "Favorite spyro game of the first three?",
        "author": "Inferno221",
        "url": "https://www.reddit.com/r/truegaming/comments/8a4d7b/favorite_spyro_game_of_the_first_three/",
        "text": "[removed]",
        "created_utc": 1522968564,
        "upvote_ratio": ""
    },
    {
        "title": "Fortnite PC",
        "author": "TheDiamondPvP",
        "url": "https://www.reddit.com/r/truegaming/comments/8a423m/fortnite_pc/",
        "text": "[removed]",
        "created_utc": 1522966161,
        "upvote_ratio": ""
    },
    {
        "title": "Why have some areas in gaming declined?",
        "author": "elektrisko",
        "url": "https://www.reddit.com/r/truegaming/comments/8a3l6j/why_have_some_areas_in_gaming_declined/",
        "text": "[removed]",
        "created_utc": 1522962719,
        "upvote_ratio": ""
    },
    {
        "title": "Trading Life for Power as a Game Mechanic",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8a2poq/trading_life_for_power_as_a_game_mechanic/",
        "text": "I find it fascinating when a game gives the player an option to trade health in exchange for more power, higher damage output, etc.  Basically, \"You can die more easily, but you also become stronger.\"  I've seen this in only a few games -- Bloodborne has a couple weapons with this effect.  The Warlock's hero power and class cards do this in Hearthstone.  And Slay the Spire has lots of ways to do this (the vampire event, for example).  \n\nWhat games have you played that do this well?",
        "created_utc": 1522956457,
        "upvote_ratio": ""
    },
    {
        "title": "Trading Life for Power as a Game Mechanic",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8a2peq/trading_life_for_power_as_a_game_mechanic/",
        "text": "[deleted]",
        "created_utc": 1522956405,
        "upvote_ratio": ""
    }
]