[
    {
        "title": "The truth behind the quote \"Out of nothing, nothing comes\" and Kalam.",
        "author": "ronin1066",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6ndw95/the_truth_behind_the_quote_out_of_nothing_nothing/",
        "text": "In watching some old “Atheist Experience” episodes (AXP), I notice a lot of people bringing up the quote “[From nothing, nothing comes](https://en.wikipedia.org/wiki/Nothing_comes_from_nothing)” as part of their justification for the Kalam cosmological argument. So I decided to look it up; lo and behold, it appears to be yet another case of xian dissembling. The quote is attributed to Lucretius and his poem “[De rerum natura](https://en.wikipedia.org/wiki/De_rerum_natura#Lack_of_divine_intervention)”. (note that I linked it to the relevant \"atheist\" section for our concerns, but the whole page is good).\n\nThe actual quote is:\n\n&gt;But by observing Nature and her laws. And this will lay\n\n&gt;The warp out for us - her first principle: that nothing's brought\n\n&gt;Forth **by any supernatural power** out of naught.\n\nAnd if you read the linked wiki pages, you’ll see that this poem is often (but not always) viewed as dangerous atheist rhetoric.\n\nMy apologies if this is already widely known here, I hadn’t seen it mentioned. I was shocked and I hope anyone who debates someone who brings up Kalam might use this. The actual quote appeard to be completely useless and even undermines their tactic of appealing to this ancient authority.",
        "created_utc": 1500090448,
        "upvote_ratio": ""
    },
    {
        "title": "Ex-Christians, have you considered the Apostle Thomas?",
        "author": "temporarycreature",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6nc159/exchristians_have_you_considered_the_apostle/",
        "text": "Most Christians will be doom-sayers against atheists in general. I mean, we're on our way to hell because of our lack of belief in their religion. Cool. Got it.\n\nUnder the assumption there is a afterlife based on the Christian narrative, have any of you considered that it may be perfectly fine not to believe? \n\nThomas, aka Doubting Thomas didn't believe that Christ rose from the dead until Christ showed up to play patty cake with the man to show him the holes in his wrists, and feet. \n\nWith that I think it's fine to be a doubter, and in favour of science, and fact, and to not take *anything* on faith. \n\nIf this is naive, I apologize. I've been an atheist for around a decade now, and while I do hope there is afterlife primarily so I can see my dogs again, I feel deep down there is none, nor reincarnation. ",
        "created_utc": 1500067703,
        "upvote_ratio": ""
    },
    {
        "title": "Which authors are the main influences on you?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6nbd51/which_authors_are_the_main_influences_on_you/",
        "text": "[removed]",
        "created_utc": 1500061153,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think is more rational Deism or Theism?",
        "author": "Achernar_bordeaux",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6nbbrq/do_you_think_is_more_rational_deism_or_theism/",
        "text": "Hello, everybody.\n\nI'm your friendly neighborhood believer.\n\nLet's talk about two different kinds of religion.\n\nWhen I was in High School, I have studied philosophy for three years. I'm curious, do you study this subject too? :)\n\nAll right, back to business.\n\n&gt; Someone who admits only a transcendental theology would be called a deist; but if he also accepts a natural theology, he would be called a theist. The former concedes that we can in any case cognize the existence of an original being through mere reason, but our concept of it is merely transcendental - namely, only that of a being having all reality, but it cannot be determined more closely. The second asserts that reason is in a position to determine the object more closely by analogy with nature - namely as a being containing the original ground of all other things within itself through understanding and freedom. The **deist** represents this being merely as a **cause of the world** (whether through the necessity of its nature or through freedom remains undecided), the **theist** as an **author of the world**.\n\n(Kant, Critique of Pure Reason)\n\nAn important and fundamental matter of Deism is, therefore, Rationalism, a philosophy based on the assertion that human reason can, in principle, be the source of all knowledge. \n\nOn the contrary, theism has, in my opinion, a predominantly irrational characteristic.\n\nBlaise Pascal says:\n\n&gt; Reason's last step is the recognition that there are an infinite number of things which are beyond it.\n\nSuch sentence can be easily linked to theist religions, isn't it?\n\nIs Rationalism actually rational? (seems like a tautology XD ) Do you think a human being, thanks to reason, in principle, can or will be able somehow to know everything?  \n\nAnd, my atheist friends, do you think is more rational Deism or Theism?\n\n*Ad maiora!*\n\nP.S: as always, sorry for the mistakes, English isn't my first language.",
        "created_utc": 1500060788,
        "upvote_ratio": ""
    },
    {
        "title": "Did the Gospels paint Jesus as Prophet or Cult Leader?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6nbbf1/did_the_gospels_paint_jesus_as_prophet_or_cult/",
        "text": "[deleted]",
        "created_utc": 1500060702,
        "upvote_ratio": ""
    },
    {
        "title": "How much Catholicism and the Church have influenced your culture?",
        "author": "Achernar_bordeaux",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6n17xk/how_much_catholicism_and_the_church_have/",
        "text": "[removed]",
        "created_utc": 1499948021,
        "upvote_ratio": ""
    },
    {
        "title": "Is atheism elitist?",
        "author": "Achernar_bordeaux",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6mus68/is_atheism_elitist/",
        "text": "Hello, everybody.\n\nI am not an atheist, so I feel like I am a lamb in a wolves cave ahah.\n\nI was thinking that it is almost impossible for atheism to prevail and overcome religions, for the reason that the culture of many societies is and was always characterized by a certain degree of spirituality, such as animism in some African territories or Catholicism in Europe. As long as the dominant cultures remain dominant, there will be a small space for a massive secularism in every area of interest where atheism wants to be.\n\nClearly, I'm not interested and I do not have the slightest intention of comparing atheism with a religion, but I would like to focus on the social –not individual- aspect of the atheism.\n\nAtheism, in order to survive and to spread, must be supported by a greater culture and a greater knowledge (basically scientific): that’s because the religious response is easier than the atheistic-scientific response and this is true for almost everything; for example, it is easier to attribute a soul to every man, than explain self-awareness in electrochemical, biological, and physical terms.\n\nTaken individually, it is not very important that knowledge and culture have atheists, but if we consider everything on a social level, then they have to deal with many more complex and complicated explanations.\nSo, in a social perspective, the law of the strongest –or the law of the majority- wins.\n\nDo you think that atheism must be supported by a greater culture and a greater knowledge in order to spread? Do you think atheism could become dominant, thanks to the progress of science?\nDon’t you think that atheism, here and now, is elitist just because it is difficult to support?\n\n\nP.S: I’m sorry if I made some mistakes, English isn’t my first language. :)\n",
        "created_utc": 1499874365,
        "upvote_ratio": ""
    },
    {
        "title": "I have recently become an Atheist. I feel overcome by despair...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6mob60/i_have_recently_become_an_atheist_i_feel_overcome/",
        "text": "[deleted]",
        "created_utc": 1499799000,
        "upvote_ratio": ""
    },
    {
        "title": "Ex-theists: What would you say brought you to your previous beliefs/religion?",
        "author": "LegendaryJay",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6mkhs8/extheists_what_would_you_say_brought_you_to_your/",
        "text": "So I guess I'm wondering why you were religious when you were? If it was personal experiences, what experiences were they and how did they bring you to that conclusion? \n\nFor example, I think I believed in god because I saw miracles daily like secrets being revealed through prayer and the future being told to us by god. Over time I realized that there were easier explanations like cold reading and non specific prophecies that would always be true almost no matter what.\n\nI guess so often we ask why we left a religion, but I'm starting to wonder why people joined. I've been asking Christians why they believe what they believe (a bit like street epistomology) and I find it endlessly fascinating (and sometimes frustrating).",
        "created_utc": 1499754980,
        "upvote_ratio": ""
    },
    {
        "title": "What's wrong with believing the Catholic Church?",
        "author": "AdversusDownvoters",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6mdr65/whats_wrong_with_believing_the_catholic_church/",
        "text": "[removed]",
        "created_utc": 1499684708,
        "upvote_ratio": ""
    },
    {
        "title": "What are dreams and do they serve any biological purpose? Why must we spend 8 hours a day unconscious?",
        "author": "Eagleheart585",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6m1d8d/what_are_dreams_and_do_they_serve_any_biological/",
        "text": "[removed]",
        "created_utc": 1499525546,
        "upvote_ratio": ""
    },
    {
        "title": "What role does love, awareness, and meaning of life play in non-belief?",
        "author": "lsrlsr",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6m0t3f/what_role_does_love_awareness_and_meaning_of_life/",
        "text": "[removed]",
        "created_utc": 1499518308,
        "upvote_ratio": ""
    },
    {
        "title": "Does it all work out for the best?",
        "author": "TSomaT",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6lxbbk/does_it_all_work_out_for_the_best/",
        "text": "If there is no God, and no spiritual master plan behind our life, if our steps aren't truly ordered by a divine planner/engineer, does everything truly work out for the best when life gets hard? Or is that just a matter of our attitude and perception? Can there be a higher reason behind everything bad that has happened to you in life, like learning a lesson? Or does one just learn from these bad mistakes to avoid them in the future to make them seem meaningful in such a way that a person says, \"oh, this terrible experience HAD to happen to me so that I could learn to improve myself from it.\" \n\nAnd more importantly, should the difference even matter?",
        "created_utc": 1499467653,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone have a good compilation on verses that undermine Muslim apologists?",
        "author": "canttaketheshyfromme",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6lwwlr/anyone_have_a_good_compilation_on_verses_that/",
        "text": "A friend of a friend in the UK is considering going from being faithless, to Sunni Islam. She's a trans lesbian and this is obviously going to go badly for her for any number of reasons and I've gotten her to the point where she says she will at least look critically at the source material she's presented with. SO, does anyone know a good compilation of verses in the Qu'ran and Hadith in which Mohammed undermines his own argument that Allah is merciful and defends the weak and vulnerable?",
        "created_utc": 1499463640,
        "upvote_ratio": ""
    },
    {
        "title": "I am having an issue trying to deal with problems in epistemology that come up in Christian Presuppostional Apologetics.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6lqcn8/i_am_having_an_issue_trying_to_deal_with_problems/",
        "text": "[deleted]",
        "created_utc": 1499390274,
        "upvote_ratio": ""
    },
    {
        "title": "Due to my Christian upbringing, I still unconsciously believe that death will be a superior state to life. How can I overcome this?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6lkswg/due_to_my_christian_upbringing_i_still/",
        "text": "[deleted]",
        "created_utc": 1499335562,
        "upvote_ratio": ""
    },
    {
        "title": "One Year Later",
        "author": "TSomaT",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6ljp5r/one_year_later/",
        "text": "It's been a year since my deconversion from Roman Catholicism.\n\nI lost my faith in God a year ago. I posted on this subreddit asking for support during the process, and all of you came to me to help and offer guidance. I am so thankful to all of you for your advice and assurances that my outlook on everything would improve. It truly has, and I can't thank this community enough for helping me see the good in my crisis of faith. Since then, my perspective on so many things have changed. Every day, I just feel so grateful to be alive because I know that none of us had to exist. It was all pure chance, and yet it's so beautiful. \n\nI want everyone who is currently going through a deconversion to know that it does get better with time. You will soon be able to see so much beauty in the world that you never saw before and you will be absolutely wonderstruck. \n\nTrust me. \n ",
        "created_utc": 1499318510,
        "upvote_ratio": ""
    },
    {
        "title": "God loves you plz come home",
        "author": "Losingcuntroll",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6lih41/god_loves_you_plz_come_home/",
        "text": "[removed]",
        "created_utc": 1499304232,
        "upvote_ratio": ""
    },
    {
        "title": "How do I get my mother to understand?",
        "author": "blue_eyed_yankee",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6li9z1/how_do_i_get_my_mother_to_understand/",
        "text": "Hey everyone. I come from a very religious family. As in everyone except me now. There are no estranged uncles or worrisome cousins who have questions, it is literally just me who began questioning the Bible and stopped believing. I want my mother to understand that this isn't a phase or a \"everyone pulls away from religion in college. I did too\". Everyone I try to talk to her about beliefs and ask why she does, she just shuts me down saying it's too upsetting. I'm not allowed to tell any other family, we are all very close and I have to go to church with them and do all the motions. I want to be understood but I'm not sure what to do. Any advice?",
        "created_utc": 1499302120,
        "upvote_ratio": ""
    },
    {
        "title": "Fuck You. Fuck your mom. Fuck your dad. Fuck your dog. Fuck your cat.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6lax80/fuck_you_fuck_your_mom_fuck_your_dad_fuck_your/",
        "text": "[removed]",
        "created_utc": 1499216434,
        "upvote_ratio": ""
    },
    {
        "title": "To anyone who grew up atheist or secular, have you tried religion?",
        "author": "VeritasDignitas",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6l9qbo/to_anyone_who_grew_up_atheist_or_secular_have_you/",
        "text": "***(If you don't want to read a story, just answer the titular question.)***\n\n\nI'm the type who read the entirety of the Twilight saga just to properly hate it, who listened to the top hip-hop albums before knowing I'll never like the genre, who will try any food to get a proper opinion, and so on. I have to experience something before I will make a judgment on it.\n\nFor me, this is Evangelical Christianity, which happens to be the easiest religion to just \"walk into\" (unlike Islam, Catholicism, or Mormonism, which would be interesting experiments). I am exclusively visiting nondenominational evangelical churches and events, as this sect is becoming the fastest growing in the US and I don't need to research too heavily into what is \"proper\" (like women only wearing skirts and no makeup at Pentecostal churches, etc.).\n\nI'm one year into two years of immersing myself in Christian culture as an atheist. It's sort of the reverse of the [preacher who lived as an atheist for a year.](https://en.wikipedia.org/wiki/Ryan_J._Bell) Before you say I am crazy, I will gladly agree with you. I am not hurting my life and all my obligations based in reality come first.\n\nEven though I am a year in by going to Christian talks, meetups, small groups, concerts, and of course, Sunday morning services--my opinion on the religion hasn't changed. In fact, I am even more convinced that there are no gods. \n\nIt is *super easy* to get caught up into the moment and I've felt hints of \"belief\" because the preacher easily enthralled me by poking at weak points. Anxiety and depression are very common and I've noticed that preachers *love* to tailor their sermons to the anxious and depressed. As someone with both, the claims that I could cast all my anxieties on Jesus and feel the weight lifted was extremely appealing. Sermons like these are typically followed by prayers where you can pray about your anxieties in silence.\n\nThis is figuratively the junk food version of mindfulness meditation.\n\nThe concerts are pretty fun if you ignore the Jesus stuff. A lot of the bands are extremely talented and could probably make it if they ditched the religious aspect of their music (or made it subtle like Twenty-One Pilots). \n\nBut what is most interesting is the reactions I get if I ever say I converted to Christianity from atheism.* People beg me to write a book or make a video about it, they want to hear my testimony, they want me to speak to youth and teens. An atheist convert is really considered the \"best thing ever\", even more than a Muslim or Jew convert. I think that's why Case for Christ and similar things are so ridiculously popular. Interestingly, every atheist convert I've met was definitely secular, not an atheist. \n\nAtheists and agnostics are primary targets for conversion, particularly with young adults. A lot of the reasoning behind it is that trying to convert and targeting Muslims in the US might look like Islamophobia, which is interesting. Atheists and agnostics are a safe choice. So by being an \"atheist who became Christian\", you're inspiring and you're showing atheists that there is reason to believe.\n\nAt the end of my two years, I'll write up something more through about my experiences and I'll see if I believe (likely not).\n\n\n^* ^Unlike ^Hemant ^Mehta's ^church ^visiting ^experiment, ^I ^wanted ^the ^\"full ^experience\", ^so ^I ^go ^under ^the ^guise ^of ^being ^Christian ^so ^I ^don't ^have ^everyone ^trying ^to ^convert ^me. \n\n",
        "created_utc": 1499202191,
        "upvote_ratio": ""
    },
    {
        "title": "In need of some advice after a bit of a shock.",
        "author": "arivas26",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6l7yi7/in_need_of_some_advice_after_a_bit_of_a_shock/",
        "text": " I always thought this is the type of thing that happens to other people so I'm at a bit of a loss for what to do here and I could really use some advice. This was the only place I could think to ask. So I have been living and working abroad pretty much constantly for the past 10 years and I'll  be the first to admit that I haven't maintained the closest relationship with my Father, Stepmother and half siblings but that's not to say I don't love them, just that I'm not the type of person to call home all the time. \n\nWell I'm visiting home right now for the 4th of July holiday and somehow the topic of evolution came up with my sister who is 13. She said \"oh I don't believe in that, I'm Christian\". I was stunned. When I tried to explain the idea to her and explain that even if she was Christian she could believe in evolution but she just shut down, got really upset and yelled \"I'm not related to a monkey!\" My Dad tried to step in and say that she should calm down and that everyone is entitled to their opinion but I couldn't let that lie so I told him that that was dangerous because not all opinions are equal, and that science is not an opinion. \n\n My sister ended up locking herself in her room and my stepmom sat off to the side pointedly staring into her phone and ignoring the conversation but after I left the room I heard her say that that is what she had been teaching them and since they are her kids they will learn that. For some context we live in Southern California. The education system in this area is pretty good too so it was pretty surprising to me. My father isn't stupid but he's not smartest guy either and he's the type of person to not waste energy on forming opinions on things that don't affect him e.g. Evolution apparently.\n\nI really don't how to approach this. I leave again in a week and I won't be back to visit in person for a long time (a couple years at least). I almost feel like the damage is done for my sister who is almost in high school. I just have to hope she comes out of it eventually but my brother is only 10 and he really looks up to me, I have to hope there's a chance to do something here. Does anyone have any experience or advice for this type of situation? ",
        "created_utc": 1499184637,
        "upvote_ratio": ""
    },
    {
        "title": "Are you atheist if you're a theist?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6l5jns/are_you_atheist_if_youre_a_theist/",
        "text": "[removed]",
        "created_utc": 1499151776,
        "upvote_ratio": ""
    },
    {
        "title": "Baby steps",
        "author": "kindofokayish",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6l59go/baby_steps/",
        "text": "So I have this friend who is bisexual, but due to her religion, Mormonism, she's been suppressing this part of her. Her justification and reasoning is that while she can be bisexual and have those same sex attractions, it's a sin to act on them. She doesn't understand why it's like that though and why her church says that, but she says, in her own words, \"we're never going to understand everything, so we just have to accept how it is and move on\". She also says that she can't be a 'true' Mormon and pursue those feelings at the same time.\n\nFor about a month, she did try to withdraw from her religion, though she wasn't doing so because she questioned it. She was also surrounded by Mormons and still had to go through all the motions, so obviously, it didn't work out for her. In that month, she was also basically dating a girl, but it was on the down low, as in no one, not even her family knew, for a while. After she told her parents, they were obviously not supportive of it and so she had to end things with the girl, even though they still wanted to be together. So, even those experiences didn't change her belief in any way really. Though, I'm pretty sure it did plant a small seed in her head. So how exactly does one expand on that little seed before it becomes stagnant? I mean, at least she acknowledges that some parts don't make sense, so that's a start.",
        "created_utc": 1499147590,
        "upvote_ratio": ""
    },
    {
        "title": "Why do atheists respond to opinion requests by explaining what atheism is?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6l3otl/why_do_atheists_respond_to_opinion_requests_by/",
        "text": "[deleted]",
        "created_utc": 1499127208,
        "upvote_ratio": ""
    },
    {
        "title": "An Upgrade Pascal's Wager",
        "author": "VorakRenus",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6ky6zm/an_upgrade_pascals_wager/",
        "text": "So, I'm not sure if this is the right place for this kinda thing, but as bad as we all know Pascal's Wager to be, I've always felt that there is some construction of it that is true. I think that I've managed to make that thing, although I'd appreciate it if you were to point out any flaws or anything I overlooked. There are definitely a few places where I feel that I've badly defined something or equivocated but am just not sure about it.\n\n#Pascal's Wager+\n\n##Terms\n\nx or y - A given religion along with its prescribed religious practices\n\nS - A given set of mutually compatible religions and religious practices. The union of religions x_i\n\nS^c - The complement set of S. The union of religions y_i\n\nF(S) - The 'fitness' of a set of religious practices i.e., difference between its expected reward for fulfillment and all other religions' punishments for lack of fulfillment. (The exact meaning of fitness *is* the formula, this is just an overview)\n\nR(x,y) - The consequence of fulfilling practice x according to religion y. Higher values are more favorable, lower values less so\n\nE(x) - The effort expended in enacting practice x relative to doing what one would do ordinarily. (So a religion that requires one to eat food at least weekly, for example, incurs little to no effort)\n\np(x) - The probability that religion x's tenets are true\n\n∅ - The set of actions one would take without any religious belief. (This in particular feels ill-defined)\n\n##The Formula\n\nF(S)=∑[p(x_i)\\*(R(x_i,x_i)-R(∅,x_i))]-∑[p(y_i)*(R(x_i,y_i)-R(∅,y_i))]-E(S)\n\n##The Wager\n\nOne should seek to maximize the fitness, F(S) of one's set of religious practices.\n\n\n\n1^st Note: All this assumes that things like effort and outcomes can be represented numerically on some consistent scale. I'd guess that criteria for such a scheme would be \n\n1. Outcomes of equal value could be substituted without a perceived loss or gain\n1. Taking a negative outcome/effort along with an equal but opposite gain is seen overall as neither a loss nor a gain.\n\nOther criteria on which to base this scale elude me.\n\n2^nd Note: If anyone wants the formula explained in English, I can do that. It *is* quite difficult to parse.\n\n3^rd Note: If you're wondering why I wasted my time with this, the answer is that I was very bored in class. ",
        "created_utc": 1499062294,
        "upvote_ratio": ""
    },
    {
        "title": "Without a God, do atheists recognise gender equality?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6kw0ct/without_a_god_do_atheists_recognise_gender/",
        "text": "[deleted]",
        "created_utc": 1499033687,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on souls",
        "author": "PhamousFilosopher",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6kkwmx/thoughts_on_souls/",
        "text": "In my life I have talked to many atheists but never have I met someone offline who doesn't believe in some kind of soul. This has always confused me as it seems like the two ideas contradict each other. In my mind the general idea behind atheism is that we reject god because it seems like a story made up to explain our world even though there is no evidence support it. That's exactly how I see the soul. We don't understand consciousness thus people have found a way to explain it that makes us feel good, like we aren't just stacks of meat walking around. So if you're an atheist who believes in a soul or anything like that I'd love to hear your reasoning.",
        "created_utc": 1498881018,
        "upvote_ratio": ""
    },
    {
        "title": "How many are here due to being banned from r/atheism?",
        "author": "moon-worshiper",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6kb7or/how_many_are_here_due_to_being_banned_from/",
        "text": "[removed]",
        "created_utc": 1498769004,
        "upvote_ratio": ""
    },
    {
        "title": "Did anyone else become an atheist all by themselves?",
        "author": "HereticalSkeptic",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6k9nzk/did_anyone_else_become_an_atheist_all_by/",
        "text": "I was brought up mildly religious and believed in the basic Christian tenets until I was about 8 and thought a little bit harder about it all and decided it was all nonsense. I had never heard any of the atheist arguments from anyone else or even knew that there were people who weren't theists. I then came up with all the usual basic atheist arguments all by myself when discussing my new non-belief with still believing friends. \"Then how did everything get here?\" was always the first comment. (Let's never forget what religious belief is really based on - the lack of knowledge of a scientific explanation for our existence).\n\nAnyone else arrive at atheism the same way?\n\nEdit: Thanks for all the great responses. I thought I was all alone in this.",
        "created_utc": 1498755397,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on this argument?",
        "author": "arc31",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6k2b2r/thoughts_on_this_argument/",
        "text": "The theists claims that something cannot come from nothing and the atheist points out that according to that rule, god cannot come out of nowhere. Then the theist says that outside the universe and before time the laws of physics aren't applicable.",
        "created_utc": 1498672556,
        "upvote_ratio": ""
    },
    {
        "title": "No more CREATOR of Men. Nobel Prize winning DNA researcher: Francis Crick confirm that it was impossible for DNA molecule to be created on earth by accident. If Evolution Theory is not enough to explain the human origin, Bible is a myth, so what's the truth?",
        "author": "9play",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6jzfiq/no_more_creator_of_men_nobel_prize_winning_dna/",
        "text": "[removed]",
        "created_utc": 1498641286,
        "upvote_ratio": ""
    },
    {
        "title": "https://youtu.be/--Bh-lD7GdM",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6jze2x/httpsyoutubebhld7gdm/",
        "text": "[deleted]",
        "created_utc": 1498640664,
        "upvote_ratio": ""
    },
    {
        "title": "Where has atheist YouTuber 43 Alley been for the past two years?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6jz9u9/where_has_atheist_youtuber_43_alley_been_for_the/",
        "text": "[removed]",
        "created_utc": 1498638652,
        "upvote_ratio": ""
    },
    {
        "title": "Help With Finding An Article",
        "author": "Tunesmith29",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6jt3gt/help_with_finding_an_article/",
        "text": "[removed]",
        "created_utc": 1498574343,
        "upvote_ratio": ""
    },
    {
        "title": "Because we are a story-telling species, does religion not then become inevitable due to our story-telling nature? And in a post-religion society, what stories will we be telling?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6jku7j/because_we_are_a_storytelling_species_does/",
        "text": "[deleted]",
        "created_utc": 1498480975,
        "upvote_ratio": ""
    },
    {
        "title": "Popularity, meaning, and use of the term \"Atheism\"",
        "author": "arthurjeremypearson",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6jjbfv/popularity_meaning_and_use_of_the_term_atheism/",
        "text": "**EDIT EDIT:** I realize this is tone trolling, so I hid this post. Sorry.\n\n**EDIT: I don't own a physical 1950's Webster's dictionary and I live in America.**\n\nSince most ~~people~~ **Americans** are Christian and their ~~dictionaries are actual physical paper dictionaries from the 1950's where the term \"Atheism\" is defined as~~ **definition** is \"Claims God is not real\" ...\n\n**Christians tell us this over and over again. I saw a youtube video recently where someone was trying to explain atheism to people, and he had SIX CHRISTIANS ALL defining \"atheism\" as \"Claims God is not real.\"**\n\nThen isn't calling ourselves \"atheist\" just wrong?\n\nWe aren't claiming God isn't real. The only people we NEED to EDUCATE about our opinion define \"atheist\" as something we're NOT.\n\nIsn't a LOT of the contention a byproduct of this confusion?\n\nIf I call myself a demon-worshiping liar and try to THEN explain I define \"demon-worshiping liar\" as something innocent like dishwashing, I might have LOST the conversation already.\n\nWhy do so many of us skeptics' first step in the debate with people who disagree with us... misrepresent OURSELVES and REQUIRE clunky \"education\" of the etymological roots of the word \"atheist?\"\n\nColloquially, \"atheist\" doesn't mean \"doesn't accept god claims.\" Not to the majority of people that USE the english language: the Christians using the Christian dialect ~~as defined by 1950's Webster's dictionaries~~.\n\nThoughts?",
        "created_utc": 1498456437,
        "upvote_ratio": ""
    },
    {
        "title": "Therapy for atheists",
        "author": "theBCexperience",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6jfaqr/therapy_for_atheists/",
        "text": "I'm depressed, anxious, dislike my existence, and have for a long time. That said, I don't really believe in therapy and don't believe they have what I need to actually solve my problems. I tried it once. Wasn't all that helpful. I figured I'd give it one more try, though.\n\nThe issue in the context of atheism is that I live in the Bible Belt, and try as I might, I cannot seem to find a counselor that isn't Christian-based. There is no shortage of therapists around here, yet not a single one isn't centered around Christian faith. I'm left to assume that not all of them are going to push religion on me, but given that many of my problems stem from my history with Christianity, I doubt many of them will be able to sympathize. Maybe I'm wrong, but it doesn't seem that the odds are not in my favor. \n\nHave any of you had any luck with this sort of thing?",
        "created_utc": 1498409083,
        "upvote_ratio": ""
    },
    {
        "title": "My take on the cosmological arguement",
        "author": "the_valient",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6jars9/my_take_on_the_cosmological_arguement/",
        "text": "[removed]",
        "created_utc": 1498341265,
        "upvote_ratio": ""
    },
    {
        "title": "If you live in an overtly religious environment, would you teach kids atheism?",
        "author": "anakmager",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6it3gy/if_you_live_in_an_overtly_religious_environment/",
        "text": "I've been having an interesting dilemma concerning religion and family. I'm an agnostic who lives in Indonesia, the most populous Muslim nation. Here, the people are very religious, so much so that to be \"religious\" is pretty much a synonym for a good person. I've been an agnostic ever since I was in 7th grade (I'm 21 now) back then, I was a very angry kid. I was argumentative as hell, and was frustrated at how \"dumb\" I perceive the people around me to be, basically a stereotypical /r/atheism user. I've since matured, I have accepted the inherently religiosity of my environment,  I hid my agnosticism and have engaged in religious customs, but lately a certain problem has been bothering me a bit. Basically, I'm at the age where I'm about to enter \"the real world\", naturally I start thinking about my future and my goals. One of the things that I worry the most is, what kind of a father would I be? more specifically, will I teach my kids to be like me.. an agnostic? is it moral for me to doom my children to be an outcast? It was hard for in the first few years of being agnostic, but that frustation for me was soften a bit because I had been a religion person before, so I understand their point of view somewhat. Now imagine a person who never understood the concept of God, heaven and hell, angels, sins etc etc.. must be crazy for them\n\nTLDR: I live in an extremely religious environment. Would you raise your children to be atheist if you were in my position.\n\nSorry if somethings aren't clear. As you can probably guess English is not my first language.. I'm not good at writing about abstract thoughts in my mother language, even less in English.",
        "created_utc": 1498133728,
        "upvote_ratio": ""
    },
    {
        "title": "Without a religion how do you teach children morals?",
        "author": "Milan_Sai",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6is1uh/without_a_religion_how_do_you_teach_children/",
        "text": "[removed]",
        "created_utc": 1498117616,
        "upvote_ratio": ""
    },
    {
        "title": "Making the case for objective non-religious values",
        "author": "Il_Valentino",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6ikjnn/making_the_case_for_objective_nonreligious_values/",
        "text": "We often hear from the theistic communities that in order to have objective morality, to *know* something is objectively a moral error, you need to establish a \"god\". We also know the common answers from popular atheists:\n\n1. The hope that there is objective morality doesn't provide an argument for its existence.\n2. Objective morality is an oxymoron. Without a consciousness to condemn moral wrong, there is no concept of moral wrong.\n3. A morality based on a \"god\"/divine subject doesn't provide more objectivity than a morality based on a human subject. Even if you assume that morality comes from a \"god\", you still tie it to his existence.\n\nHowever I do think we can still make the case for describing objective moral *values* from a secular point of view. The *concept* of morality might be subjective and morality is a human structure evolved through our culture and social habits. Without humans there wouldn't be such a concept (or atleast without animals/consciousness in general). However we can objectively say that this subjective concept does have a general ~~purpose~~ role (through evolution, thanks to u/Y_ROR) that we can do observe: eg *Making social structures more stable.* This is often achieved through:\n\n1. Providing a foundation for authority (eg respect \"honor\", parents, teachers)\n2. Providing rules that protect the individual from other individuals within the community (eg condemnation of murder)\n3. Providing special treatment for individuals who are defenseless. (eg pregnant women, children, elderly, sick)\n4. ...\n\nAnother explanation from the comment section:\n&gt; We can examine morality and can study it in the context of social and cultural evolution. Within these frames we can apply a certain role of it (social stability was my attempt but it could also be something else) and can compare different moral orders in the context of the fulfillment of that role. Therefore we can make objective statements about values within the subjetive morality.\n\n**The question of moral obedience is a story in itself.**\n\n\"Is murder objectively a moral wrong?\"- \"Yes, morality is a human concept to stabilize social structures. Murder does destabilize social structures. Therefore it is a moral wrong from an objective standpoint.\"\n\nWhat do you think? Is my point of view nonsense? Challenge it!",
        "created_utc": 1498034209,
        "upvote_ratio": ""
    },
    {
        "title": "Dyson sphere speculation and the watchmaker arguement",
        "author": "BeatriceBernardo",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6ikcit/dyson_sphere_speculation_and_the_watchmaker/",
        "text": "I'm referring to this http://www.independent.co.uk/news/world/forget-water-on-mars-astronomers-may-have-just-found-giant-alien-megastructures-orbiting-a-star-near-a6693886.html\n\nI usually lurk at /r/debateanatheist, but I'm looking more of a conversation than an actual debate\n\nThe watchmaker arguement is, that if you see something complicated, chances are, it is design by intelligence, or something that goes along that line.\n\nWhen astronomers discovered irregular, \"complex\", variation in stars' brightness, and start speculating about Dyson sphere, isn't that basically applying the watchmaker fallacy?",
        "created_utc": 1498030829,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone a Pro-Life Atheist?",
        "author": "indielib",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6ij2ok/anyone_a_prolife_atheist/",
        "text": "[removed]",
        "created_utc": 1498013946,
        "upvote_ratio": ""
    },
    {
        "title": "\"There Is No God\" Versus \"I Don't Believe In God\"",
        "author": "dryh2o",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6iitie/there_is_no_god_versus_i_dont_believe_in_god/",
        "text": "I prefer to say \"there is no god\" because, to me, saying that I don't believe leaves a door open to possibility when there is none. I guess you could make the argument that we can never truly \"know\" but, at least as far as I am concerned, I know.\n\nI'm just curious if anyone else has thought about this.",
        "created_utc": 1498011242,
        "upvote_ratio": ""
    },
    {
        "title": "Got banned from atheism for being a \"Bigot\"",
        "author": "indielib",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6iikda/got_banned_from_atheism_for_being_a_bigot/",
        "text": "[removed]",
        "created_utc": 1498008485,
        "upvote_ratio": ""
    },
    {
        "title": "Today Someone tried to re",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6i4ynm/today_someone_tried_to_re/",
        "text": "[removed]",
        "created_utc": 1497858006,
        "upvote_ratio": ""
    },
    {
        "title": "Today I got invited to join a cult!",
        "author": "Georgia_Disorder",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6i4wue/today_i_got_invited_to_join_a_cult/",
        "text": "[removed]",
        "created_utc": 1497857132,
        "upvote_ratio": ""
    },
    {
        "title": "If you think there is any valid morality in the atheist world view, you have the burden of proof",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6hyzfo/if_you_think_there_is_any_valid_morality_in_the/",
        "text": "[removed]",
        "created_utc": 1497781227,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta] Please don't let /r/TrueAtheism turn into /r/Atheism",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6hvw39/meta_please_dont_let_rtrueatheism_turn_into/",
        "text": "[removed]",
        "created_utc": 1497734565,
        "upvote_ratio": ""
    },
    {
        "title": "γ = ( 1 - ( v^2 / c^2 ) )^(-1/2)",
        "author": "HonorableJudgeHolden",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6hvb2r/γ_1_v2_c2_12/",
        "text": "[removed]",
        "created_utc": 1497727743,
        "upvote_ratio": ""
    },
    {
        "title": "\"The Pagan gods just seem more 'real' than other religions...\"",
        "author": "TheSingingQuaker",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6hs40n/the_pagan_gods_just_seem_more_real_than_other/",
        "text": "Really, it's something I just can't wrap my head around.\n\n1. \"They're more real because they're more like humans.\"\n\nThat's so fucking stupid. I really don't understand how the *more* anthropomorphic a god is, the *less* likely it is to be an invention.  I can't quite articulate why it's so ridiculous. If there *was* a god, then he would be *completely different* to humans, because, you know, he's a god. A god which is basically a human doesn't become anymore \"real\" just because he's close to being a human.\n\nSimilarly, the anthropomorphic pagan gods seem, to me at least, more obviously inventions and forms of animism. Like, wow, there's a god for war, death, love, evil? It's almost like humans became aware of certain concepts and made up gods to represent them! How is this not obvious? I can't wrap my head around the fact that people *genuinely* believe that gods which are obviously based on universal themes are somehow more \"real\" than a single god.\n\n2. \"They don't have the same logical paradoxes.\"\n\nOkay, maybe that's true, but on the flip side, the fact that these multiple gods aren't omnipotent/perfect/eternal means that there's *less* possible arguments for them. You can't use the Cosmological argument to try and argue for the existence of the Norse gods if they aren't perfect, eternal, or omnipotent in the first place. Similarly, if these gods created the universe, who created the gods? If you don't have a handy little eternal/perfect/that which nothing greater can be conceived tag line then you fall into infinite regression - every time.\n\nI really do not understand it.",
        "created_utc": 1497683099,
        "upvote_ratio": ""
    },
    {
        "title": "Anti-evolution argument",
        "author": "Pandarandrist",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6hnuit/antievolution_argument/",
        "text": "[removed]",
        "created_utc": 1497632722,
        "upvote_ratio": ""
    },
    {
        "title": "Christian here looking for some answers",
        "author": "prophecythrowaway",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6hka2d/christian_here_looking_for_some_answers/",
        "text": "I'm going to preface this by saying apologies for massive wall of text!\n\nPLEASE POINT OUT ANY AND EVERY POINT WHERE THERE IS A FLAW IN LOGIC, OR I AM MISSING SOMETHING!\nI AM HERE TO LEARN! PLEASE RIP THIS TO SHREDS!\n\n---\n\nHey guys, I'm a guy who was raised a charismatic Christian, and basically believed it my whole life (cuz, you know, I was raised in it). I've come to the point where if none of it is true, then oh well. My existence is arbitrary, and what I do in the run of eternity doesn't matter. If it is true, then sweet, getting to spend an eternity to do whatever I want, develop skills in everything I ever wanted to learn, living in eternal \"happiness\" sounds pretty okay to me.\n\nBack to the definite possibility that it's all false. Attributing meaning to \"what you give meaning to in life\" is not appealing as an answer. Existence is fun and all, but in the end, after death, none of it means anything unless an observable legacy is left. However, dedicating life to building a legacy is impossible for every human to achieve, and it demeans from the enjoyment of the now.\n\nIf the meaning of existence is to make the most of it, it turns selfish in nature because in order to maximize the \"quality of life\" determined by happiness or pleasure over time, it has to be for one's self to feel. While joy can derive from the caring for another, it often comes with the fair share of time in dread or unhappiness. The payoff being that the possibility of overcoming a dip makes the reward in the end better, but seems rather inefficient if maximum time dedicated to happiness is to be achieved. \n\nWould (by a very undefined and rough definition of) \"love\" be more worth it as a currency of happiness, that is more likely to leave a legacy as it pertains to other humans? It seems to me that if there is a hypothetical worth to the various forms of being \"happy\", there is a hypothetical formula for every human to be able to achieve maximum happiness... but then what. If universal happiness is achieved, there is no goal for the end, living in casual ecstasy to exist, love, die, repeat until earth is engulfed by some catastrophe, and life in its entirety is gone. Then legacy loses its purpose in the long run. I'd rather believe in something that has more hope than that if it comes to choosing what possible outcome sounds most appealing to me.\n\nA similar line of logic is kinda applied to the common question I hear from my friends thrown around on the purpose of an all good God creating an imperfect creation, and punishing all of it for the obviously baited tree of good and evil, spurring from one person's sin. If humans didn't have the choice to pick God, and were just created in perfectness, the narrative of humans would be entirely boring, and as arbitrary as a world of perfect happiness that could disappear without memory. There is no point. Without sin, there is no understanding of what is truly good. Without the contrast of a dip, there is no payoff. Without free will, love is not a choice, and is not true or meaningful. \n\nAnyways, another thing I want answers on is the so called \"supernatural\" experiences, and where science and psychology draw a line. As a christian, I believe God works through the laws of everything in existence before he starts to allow for more funky stuff to happen. For example I would go around with a group of people that would pray over people, and they would instantly be healed of minor stuff, like a headache disappearing in a second, or stretched and sore muscles instantly feeling alright. If you haven't figure it out already, I'm pretty sure it happens because of placebo, because the \"God\" element allows for the skeptical to give believing hard enough a chance. Anyways, that same group of people said that they had instances where they prayed over a dude with a broken leg and he was healed, or crazy stuff like that. I don't believe they were making that up, but I also don't have a realistic explanation. I also have no idea what experiences like this occur in other religions, and would really like to look into that further.\n\nAnother \"supernatural\" thing that's been really boggling me is what this throwaway is name after. Prophecy. So basically I went to this christian prophecy event where this adorable little couple have you sit and they pray, then just start telling you super specific things about yourself, what you are struggling with, and what to do in the future. It is accurate enough that it can only be pertained to the exact person who is being prophesied over, and is usually exactly what the person is struggling with, so it's not like some general personality read, or a horoscope style thing. For example, I want to go into filmmaking. I love being the man in charge, and I always have a broad plan for the future. During that time I was thinking about the plan for my career, and struggling with where my religious faith fits in with all my plans for a career in film. The couple called out all of these things super specifically, except they didn't specify film. They just kept saying \"career.\" However they did use the term \"director\" whenever they were describing me in my career, so there's that. It was kind of ridiculous how accurate it was, and gave me a very clear answer to what I was looking for. They did the same for all of my friends that showed up as well.\n\nThe closest thing I have for a non-religious answer on how that works is some extreme form of mentalism (look up Lior Suchard). Even still, it wasn't the same. They would go on for minutes and minutes with fresh insight, and the best mentalists I've seen only get finely orchestrated answers. It's also important to note that the couple does truly believe it is God who gives them the words to say in the moment, and do not do this kind of thing for profit, fame, or anything like that.\n\nAnyways, it's late, I gotta go to bed, and I haven't re-read this to make sure what I'm saying makes any sense at all. I'll check back in later.\n\nThanks Everyone!\n\n---\n\nEDIT: Thanks for all the replies guys! Certainly stuff to think about. I guess I'm just used to thinking about existence in the scale of eternity, and need to scope it in a whole lot more to just a single person's lifetime. So if we are going about the journey is the meaning, and progress is the goal, I get it, in the ultimate end nothing matters, but we won't be there anyways, so make the most of what you got. I guess this philosophy bothers lots of religious people because it feels so much more mundane than religion. To shift thought from an eternity and the purpose of existence in its entirety, to just about 80ish years and how the individual feels, is just a loss of weight to decisions and morality.\n\nSo about the couple, there was no prior information given to them, no payment, it's just a walk in and sit down kind of thing. I wasn't planning on going, but changed my mind last minute, and showed up in the middle of it. I didn't say anything, and the audience didn't say anything to give feedback. Most people would just sit there with their heads down listening intently. There was basically no feedback until after they were done and people were in tears giving them hugs and stuff. The specifics weren't all self fulfilling prophecies as they were usually specific advice to situations any not super personal friend would know they had. The couple also didn't let any real verbal pauses, and were standing behind them, so facial cues couldn't be read. Half the time, they had their eyes closed as well because of the praying nature of their way of doing it. They legitimately believe what they are doing is from God.\n\nSo whether it's real or not, it does seem to work, and the advice given is pretty good, so why don't more counsellors and psychologists use stuff like this to give advice to their patients?",
        "created_utc": 1497586478,
        "upvote_ratio": ""
    },
    {
        "title": "How do you guys find the will/power to continue living a meaningless existence.",
        "author": "HopefullNurse17",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6hiotq/how_do_you_guys_find_the_willpower_to_continue/",
        "text": "I've been an atheist a few years now and slowly come to terms with the fact that existence is truly meaningless. It has left me asking daily, what is the point to all this hustle and bustle. Why work hard and try to make something of myself if all that awaits me is a life of hardship and suffering and death at the end? Why not just cut the journey short? I'm guessing others on here have had similar thoughts, just wondering what drives other atheists to survive and deal with the harshness and reality of the world. ",
        "created_utc": 1497568096,
        "upvote_ratio": ""
    },
    {
        "title": "A serious question.",
        "author": "CustomSawdust",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6hgobh/a_serious_question/",
        "text": "[removed]",
        "created_utc": 1497549167,
        "upvote_ratio": ""
    },
    {
        "title": "Does the Christian Atonement actually make any sense?",
        "author": "MrLiszt",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6h4lcj/does_the_christian_atonement_actually_make_any/",
        "text": "Growing up Mormon (Of all religions), I was always taught that Jesus' atonement was incredibly perfect and was completely necessary to mankind. Of course, there are tons of conflicting opinions out there regarding this, but I want to know: do you, as atheists, think that the concept of the atonement makes any sense at all? Also please explain your reasoning. ",
        "created_utc": 1497406278,
        "upvote_ratio": ""
    },
    {
        "title": "Victim-blaming in the Old Testament: Why is the Book of Job so different in the Bible?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6h4do8/victimblaming_in_the_old_testament_why_is_the/",
        "text": "[deleted]",
        "created_utc": 1497403860,
        "upvote_ratio": ""
    },
    {
        "title": "Is it wrong to teach kids about the secular, scientific origin story of the universe?",
        "author": "GeorgiasTelescope",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6h3cyo/is_it_wrong_to_teach_kids_about_the_secular/",
        "text": "The religion one follows is largely based on where they are from. For example, if you're from America, you're likely Christian – Middle-East, you're probably Muslim. It seems like (generally speaking) people are largely given very little choice of their religion; they're raised up with it. I was lucky enough to grow up exposed to many different cultures and religions, and somewhere along the way, questioned how all of them could be true. Long story short, this is probably what first led me to being atheist. I'm sure everyone in this sub has their own story, some similar, some different than mine. \n\nSo my question is, is it also \"wrong\" if we teach young kids the secular origin story? That is, the Big Bang theory? Is that also forcing them to believe in something before they have the opportunity to choose what to believe in? \n\nI'm asking because I wrote the [first book](https://www.kickstarter.com/projects/nthao/georgias-telescope-discovering-the-big-bang-for-ch) to teach the Big Bang theory to preschoolers, and some feedback I have gotten is also that the book is \"brainwashing\" young kids into believing in science that we don't know for sure happened. It seems as though science gets more critique than anything else because people want every experiment to be repeatable and observable real-time. \n\nI just want to put another origin story on the table and have kids be exposed to as many ideas as possible. I was born in Thailand, very Buddhist, my family is Hmong, very Animist, and from Laos, again Buddhist. I was raised in America, so I saw a lot of different religions, but never really heard about a secular/scientific origin story until I was in middle school. I want to change that, and some people think it shouldn't happen, or they think kids aren't smart enough to learn about the Big Bang.\n\nSo what do you think? How can I do this effectively without people dismissing the idea?\n\n**EDIT:** Thanks for the feedback everyone! Homeschool Base featured [this article](https://homeschoolbase.com/big-bang-theory-for-preschoolers/) on Georgia's Telescope. The homeschooling community does have a higher tendency to be religious, so that's cool that they talked about the book and spoke to what a lot of you said about how truth comes if we teach students to analyze their world:\n\n&gt; Neng Thao's pitch is simple. He thinks that education should be broad. And in a global world, he believes that students should hear as many origins stories as possible. Because there's no early childhood narrative for the Big Bang theory, Neng wrote one himself.\n\n\n",
        "created_utc": 1497392691,
        "upvote_ratio": ""
    },
    {
        "title": "why should God be empirically verifiable?",
        "author": "Rattional",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6gwbzt/why_should_god_be_empirically_verifiable/",
        "text": "[removed]",
        "created_utc": 1497313382,
        "upvote_ratio": ""
    },
    {
        "title": "Dawkins promotes comparative religion studies and dropping \"theory\" reference from evolution.",
        "author": "BrautanGud",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6gs2bi/dawkins_promotes_comparative_religion_studies_and/",
        "text": "http://www.telegraph.co.uk/science/2017/06/11/richard-dawkins-religious-education-crucial-british-schoolchildren/\n\nHe recommends we stop referring to evolution as a theory to avoid confusion with the general public who are ignorant about the scientific implications of something labeled such.\nHe also believes studying the Bible is essential to understanding English literature, equally important alongside Shakespeare.\nComparative religion studies should be as compulsory as math and science in our schools around the globe. It serves to set the phenomena of religion in the skeptical perspective it warrants.",
        "created_utc": 1497272492,
        "upvote_ratio": ""
    },
    {
        "title": "Are you glad you're an atheist?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6gkiuk/are_you_glad_youre_an_atheist/",
        "text": "[removed]",
        "created_utc": 1497172539,
        "upvote_ratio": ""
    },
    {
        "title": "An atheist since 13 (now 23). Thought afterlife is just absurd, then it troublingly hit me that the seeming alternative, that people such as myself are automata, is even harder to believe (and is anti-humanistic). Any thoughts?",
        "author": "Aoea",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6gfryf/an_atheist_since_13_now_23_thought_afterlife_is/",
        "text": "Edit: I need to leave now (maybe I'll come back later), it was very interesting to talk to you guys - I've learned something :) \n\n___\n\nBasically, I was already born in irreligious social conditions, and myself further came to the conclusion (which I uphold firmly) that the idea that human beings are cattle of a ghost with contranatural powers is abhorrent. So I'm basically a humanist and even a \"militant atheist\", I guess, since I even had occasional quarrels on this topic. \n\nHowever, I'm beginning to feel that there are issues beyond that. An obvious example is human rights. Kinda hard to seriously reconcile them with animalistic view of people; so are they made-up concepts, and humanism is bs? (Well even in this case we can handwave to pure formal legalism - supremacy of voted law per se - I guess. But there is something hollow about this.) \n\nA related issue is afterlife. Thinking what happens when dying, from the first-person perspective, is scary, but it seems that's not itself a grounds for any reliable conclusion. (Although to be scrupulous about one thing, I think I don't agree with the often brought-up supposed symmetry of \"beforelife\" and \"afterlife\". Time is from the past to the future, and \"what happens once that is gone?\" is a question okay with no beforelife - the first thing you know is being born, anyway - but not with no afterlife.) \n\nWhat hit me was the realization that the answer \"definitely nothing\" is basically relying on a mechanistic view of human beings, myself in particular, as an automaton, which is sincerely hard to believe in. (How can an automaton experience pain, for example?) Still, I believe that it's common sense that if you are hit at the head, you lose consciousness - let alone if the head is smashed altogether. In other words, it has always been obvious to me that dead people are unconscious (in particular, there is no heaven), but I'm beginning to seriously think about the possibility of reembodiment. What if you can, in theory, wake up with a new body, like in \"Avatar\" or \"The Groundhog Day\"? \n\nSo my question is, am I going crazy from a rational perspective - and to not, I definitely need some external input. I mean, I'm a Dawkins/Hitchens (but not Harris) fan, I know inconsistencies (to put it mildly) in religions, I have a STEM education, etc, and my natural sane reaction about starting to having such thoughts is 1) being troubled and 2) interested in peer-review/discussion. What do you guys think? \n",
        "created_utc": 1497108320,
        "upvote_ratio": ""
    },
    {
        "title": "Are there such things as \"Atheist Regimes\"? And does this equalize religion and secularism?",
        "author": "drkesi88",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6gcmpx/are_there_such_things_as_atheist_regimes_and_does/",
        "text": "[removed]",
        "created_utc": 1497057762,
        "upvote_ratio": ""
    },
    {
        "title": "So my Christian friend told me of his experience that he had in church...",
        "author": "williamZ8",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6g7e3d/so_my_christian_friend_told_me_of_his_experience/",
        "text": "I'm an atheist, but I don't refer to myself as one because religious people have skewed the definition. My church going friend told me that when he was in church, he started crying uncontrollably. It was some strange Christian ritual that they were doing. He said he felt the \"presence of God\" and that he felt as if his \"sins\" were being expelled. How do I argue against this? He and I have friendly debates on religion all the time. Is it some sort of psychotic episode that he had? Or is he lying about the entire thing? He said others have started uncontrollably crying when they went through this, too. Am I crazy or is he crazy? I can't seem to defend myself against what he said. Any thoughts?\n\nedit:\n\nThanks everyone for putting in your two cents! Sorry if I came off as ignorant or arrogant about this. I was really confused, but you all have broadened my mind on the subject itself. I feel like I'll stand a better chance if he ever instigates another debate, but then again I'll probably just decline and refuse to talk about it in the first place.\n\nThanks again everyone!\n\nedit #2:\n\nAlso, if it helps, he's a presbyterian.",
        "created_utc": 1497001068,
        "upvote_ratio": ""
    },
    {
        "title": "Jordan Peterson Recommendation",
        "author": "pm093",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6fyyp0/jordan_peterson_recommendation/",
        "text": "[removed]",
        "created_utc": 1496899111,
        "upvote_ratio": ""
    },
    {
        "title": "The flaws in the \"Who created god\" argument",
        "author": "NoorArif",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6fudm3/the_flaws_in_the_who_created_god_argument/",
        "text": "[removed]",
        "created_utc": 1496851485,
        "upvote_ratio": ""
    },
    {
        "title": "Podcast seeking people to interview about their deconversion stories!",
        "author": "NotGnosticPodcast",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6fjg5f/podcast_seeking_people_to_interview_about_their/",
        "text": "Note: posted with mods' approval\n\nSo as the title states, I am looking for people to interview on my show called [Not Gnostic](http://www.notgnosticpodcast.podbean.com). My friend is supposed to join me but the last few episodes he has been absent due to life circumstances though he should be back this week. We talk about our own deconversion stories and experience with the church in [episode one](http://notgnosticpodcast.podbean.com/e/not-gnostic-episode-1-deconversion/). \n\nPodcast description:\n\n*Welcome to the Not Gnostic Podcast! This is a weekly show about post-faith (i.e. deconversion) and religious experiences where we discuss many different topics with the overarching theme of religion. We will go through big questions like our origins, the universe, existence itself, consciousness, and many more.* \n\n*The goal of this show is to show people that life can actually be interesting when you appreciate it for what it is now, not for what comes after. If you are interested in coming on the show to share your own deconversion story or just want to talk about religion, science, or politics with us then please send us a message to notgnosticpodcast@gmail.com. Please note what time zone you're in, the days and times that work for you, as well as if you have any recording equipment or not (please don't worry if you don't... we just want to have the best sound quality as possible).*\n\n*You can find us on [iTunes](https://itunes.apple.com/us/podcast/not-gnostic-podcast/id1236519039?mt=2) and [YouTube](https://www.youtube.com/channel/UCFVcdBG3ZMb9BUdxQ0MPf1A) or whichever app you use to listen to podcasts if it pulls from iTunes' API.* \n\n*Thanks in advance for listening!*\n\nSo that's it in a nutshell. If you have deconverted or are knowledgeable about certain topics and want to come on then please send us a message. \n\nA note on sound quality: \n\nIn [episode 4](http://notgnosticpodcast.podbean.com/e/not-gnostic-episode-4-the-ex-files-1-johnny/) the interviewee uses his cell phone and I used Callnote to capture the conversation over Skype. However, it is best if you have some kind of microphone and a recording program (if it's not too troubling) to record your side for the absolute best quality possible. Of course, it isn't necessary.\n\nThat said, not all cellphones/mics are created equal. If there are quality issues that make it hard to listen to the episode then unfortunately we won't be able to upload the episode and will have to record again some other time if possible. I don't suspect many people will have this issue though. \n\nAnyways, that about wraps it up for this post I think. Please send me a message either over Reddit or gmail if you'd like to come on an episode! \n\nThanks in advance! \n\n-Ty\n\nEdit: Just woke up and I'm surprised by the amount of responses I've gotten! I'll be getting back to everyone within the next day or so. And still feel free to email me even if you see this later! Thanks again!\n",
        "created_utc": 1496721694,
        "upvote_ratio": ""
    },
    {
        "title": "Directness",
        "author": "Kappalicious",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6fi4fo/directness/",
        "text": "[removed]",
        "created_utc": 1496706611,
        "upvote_ratio": ""
    },
    {
        "title": "I still can't believe people think like this.",
        "author": "123ib",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6fe5fj/i_still_cant_believe_people_think_like_this/",
        "text": "[removed]",
        "created_utc": 1496669247,
        "upvote_ratio": ""
    },
    {
        "title": "Matthew 5:17-20. I've never seen it used in an argument, and i don't understand why.",
        "author": "Fiannaidhe",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6fad7a/matthew_51720_ive_never_seen_it_used_in_an/",
        "text": "Edit: i just wanted to thank you guys. I've posted this in /r/Christianity and /r/AcademicBiblical. In the academic post, 0 responses, although i kind of expected that as a lot of posts there go unanswered. \n\nIn /r/Christianity, i received very few, very low effort answers, that the community has mostly voted to 0. I expected more traction there. \n\nYet here, with fellow atheists, i have received very well thought out and sourced replies, that have opened up a decent discussion.  I find that both sad, and amusing. \n\nEnd edit\n\nI've been watching The Atheist Experience recently, and just commented about this in the gluttony post. \n\nThere are always discussions regarding the Old Testament laws that atheists use to point out the hypocrisy of Christians in general, mostly in regards to the verse on homosexuality. This law is sandwiched between not eating shellfish and not wearing clothing that's made of mixed material. I'm sure most of you are familiar with this. \n\nWhen this is pointed out to Christians, the argument follows a normal course with them saying that homosexuality is referred to in the New Testament, and the food and clothing law is Old Testament and not meant for them. This also applies to the laws on slavery, rape etc. that our society has deemed immoral. \n\nAn argument that i have never seen to refute Christians dismissing Leviticus is the Sermon on the Mount:\n\n17 “Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them. 18 For truly I tell you, until heaven and earth disappear, not the smallest letter, not the least stroke of a pen, will by any means disappear from the Law until everything is accomplished. 19 Therefore anyone who sets aside one of the least of these commands and teaches others accordingly will be called least in the kingdom of heaven, but whoever practices and teaches these commands will be called great in the kingdom of heaven. 20 For I tell you that unless your righteousness surpasses that of the Pharisees and the teachers of the law, you will certainly not enter the kingdom of heaven.\n\nIn these verses, Jesus very clearly states his intent, and that intent proves every one of those Christians wrong, yet it's never used to counter their argument. Am i missing something? Or is everyone else? ",
        "created_utc": 1496616655,
        "upvote_ratio": ""
    },
    {
        "title": "Religions in which humans don't save themselves?",
        "author": "PonceAdmiralStarbone",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6f9p26/religions_in_which_humans_dont_save_themselves/",
        "text": "I've had an ongoing argument with someone, a Lutheran and they tell me Christianity is unique in that it's the only religion in which man does not save himself, but without exercizing his agency he somehow submits himself to be saved by the religion's diety. \n\nCiting ephisians 2:8, where you are saved and it was a gift from god. \n\nI at first responded by saying that any theistic religion that does not believe in free will is going to meet his criteria, but he insists that you must have free will so that god can take the glory for saving you. Just to see where the rabbit hole goes I'm not looking for the 7 immediate counterarguments that will make it completely pointless. But I am curious if there are other religions in which salvation from the religion's version of hell is a gift from the diety rather than something that the believer has to achieve.\n\nHe's annoyed by me not considering his religion any more special than the thousands of others and brings this up constantly. But I wonder if I can make the distinction meaningless on his own terms.",
        "created_utc": 1496609317,
        "upvote_ratio": ""
    },
    {
        "title": "Why do many Christians completely glance over Gluttony as a sin?",
        "author": "Shaddleson",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6f7doc/why_do_many_christians_completely_glance_over/",
        "text": "I've never spent much time in a church, but I'm assuming this is never really brought up.  \n\nThere is a lot of talk about homosexuality (lust?) being a sin, but so is gluttony.  Why is this almost completely ignored when many Christians seem to not be able to stop stuffing themselves with food.  Ofc, not all Christians fail here, but my idea of a typical southern baptist is an overweight, and often obese, individual.  \n\nWhy is homosexuality targeted, but not gluttony?  Is it because it is an outside target for them?",
        "created_utc": 1496583593,
        "upvote_ratio": ""
    },
    {
        "title": "\"You don't believe in God because you hate him.\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6f4x11/you_dont_believe_in_god_because_you_hate_him/",
        "text": "[removed]",
        "created_utc": 1496541239,
        "upvote_ratio": ""
    },
    {
        "title": "I Am A Muslim, AMA",
        "author": "qaseemiqbal",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6f3n5n/i_am_a_muslim_ama/",
        "text": "[removed]",
        "created_utc": 1496525532,
        "upvote_ratio": ""
    },
    {
        "title": "What's the point of living in meaningless world where there is so much suffering in daily life?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6f2j1m/whats_the_point_of_living_in_meaningless_world/",
        "text": "[removed]",
        "created_utc": 1496512657,
        "upvote_ratio": ""
    },
    {
        "title": "A question about Russell's Teapot and Gödel's incompleteness theorem",
        "author": "CompositeOnReddit",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6ezo9h/a_question_about_russells_teapot_and_gödels/",
        "text": "Russell's teapot: \"...if I were to go on to say that, since my assertion cannot be disproved, it is intolerable presumption on the part of human reason to doubt it, I should rightly be thought to be talking nonsense.\"\n\nGödel's incompleteness theorem: For any consistent, axiomatic system, there will always be statements that are true, but that are unprovable within the system. (Wikipedia)\n\nSo if we assume that for every explanation from every study for every phenomenon in this world is now included in a consistent axiomatic system. According to Gödel's incompleteness theorem there would be statements that are true, but unprovable. But according to Russell's teapot if a statement can not be disproved, it's nonsense to say that the statement is undoubtedly true.\n\nSo the two...kind of contradict each other. Is it because Gödel's incompleteness theorem only works on logical systems involving natural numbers? Or is it because Russell's Teapot is only supposed to be a philosophical approach to the existence of god? I'm confused.\n\nEdit: I think I got it now. Russell's teapot is saying something that can't be proven false is not necessarily true, and more about the burden of proof. Incompleteness theorem is saying something that can't be proven true is not necessarily false.",
        "created_utc": 1496469048,
        "upvote_ratio": ""
    },
    {
        "title": "Should We Learn More About Muhammad?",
        "author": "unematrix0",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6entwc/should_we_learn_more_about_muhammad/",
        "text": "[removed]",
        "created_utc": 1496334105,
        "upvote_ratio": ""
    },
    {
        "title": "An Atheist Partner?",
        "author": "N-H-W",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6eabhv/an_atheist_partner/",
        "text": "I just recently got out of a relationship with someone I thought was the love of my life. It turns out that she put her christian faith and family's far right political stance, above what we had for the entirety of the 6 months we were together. \nI thought that even though we had our differences, we could coexist and focus on the things that truly matter in life. I was pretty wrong.\nSo now, I'm learning from my mistakes and wondering, how exactly do I find an atheist partner?  Someone who thinks like me in that regard at least\nHopefully this question falls in the community guidelines. It seemed pretty appropriate. ",
        "created_utc": 1496179453,
        "upvote_ratio": ""
    },
    {
        "title": "Why are we here? Where do we come from? Why did we come? Where are we going? Why are we going?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6e61he/why_are_we_here_where_do_we_come_from_why_did_we/",
        "text": "[removed]",
        "created_utc": 1496132083,
        "upvote_ratio": ""
    },
    {
        "title": "Concerning the problem of evil, what is your opinion of the response: \"God allows evil so that he may one day destroy it\"?",
        "author": "01000001-065",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6dyp0d/concerning_the_problem_of_evil_what_is_your/",
        "text": "[removed]",
        "created_utc": 1496038886,
        "upvote_ratio": ""
    },
    {
        "title": "Here's why I don't feel the need to try to convert people to atheism",
        "author": "WhiteOrca",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6dwf7c/heres_why_i_dont_feel_the_need_to_try_to_convert/",
        "text": "First of all, I don't really care what other people believe.  As long as their beliefs aren't being used to justify being hateful, harming others, or rejecting science, then whatever people believe doesn't matter to me.  Second of all, atheists are going to win in the end regardless.  As time goes on and people become smarter, belief in God slowly fades away.  I doubt that it'll happen in our lifetimes, but eventually, humanity will reach a point where we look back on the belief in God just the same as people of today look back on Greek, Norse, Egyptian, or any other culture's mythology.\n\nI don't know whether or not we'll ever reach a point where every single human being on Earth does not believe in any god, but I do believe that we'll reach a point eventually when the majority of people do not believe in god.  I don't know how long that will take, but I think that it is going to happen at some point in the future.\n\nCorrect me if I'm wrong, but I do believe that I read that the fastest growing religion in the world right now is no religion.  This doesn't necessarily mean that no religion is atheism.  People can have no religion and still believe in a god, but it does show that religion overall is losing its grip on humanity.  Don't get me wrong, religion still has a really tight grip on the world, but it's not as tight as it used to be.  As time goes on, this grip gets looser and looser.\n\nA lot of people tend to look at the future very pessimistically, but I'm much more of an optimist when I look towards the future.",
        "created_utc": 1496008416,
        "upvote_ratio": ""
    },
    {
        "title": "How Oxford and Peter Singer drove me from atheism to Jesus",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6dvez6/how_oxford_and_peter_singer_drove_me_from_atheism/",
        "text": "[deleted]",
        "created_utc": 1495997193,
        "upvote_ratio": ""
    },
    {
        "title": "My friend found jesus",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6dutwe/my_friend_found_jesus/",
        "text": "[deleted]",
        "created_utc": 1495990795,
        "upvote_ratio": ""
    },
    {
        "title": "Can you practice medicine while believing in God?",
        "author": "im_larf",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6dudun/can_you_practice_medicine_while_believing_in_god/",
        "text": "I'm a med student and in my college there is a surprising amount of people that believe in God. Not just believing in God but follow Catholic practices and beliefs. I just can't understand how can someone believe in that and still practice medicine. There is beliefs in Catholicism that are just incompatible with what you do as a physician.",
        "created_utc": 1495985787,
        "upvote_ratio": ""
    },
    {
        "title": "Arguments against the \"Alexander the Great Prophecy\" in the book of Daniel?",
        "author": "Joider",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6ds7ka/arguments_against_the_alexander_the_great/",
        "text": "I was debating with a Christian today, and he brought up the prediction of Alexander the Great in the book of Daniel. I'd never heard of this before, and after looking up the prophecy and seeing some of its accuracies, I decided to look for arguments against it, but couldn't find anything. \n\nHere is a summarization of the prophecy (taken from https://www.gotquestions.org/Alexander-the-Great.html) \n\nDaniel chapter 2 tells of Daniel’s interpretation of King Nebuchadnezzar’s dream. Nebuchadnezzar dreamed of a large statue made of a gold head, silver chest and arms, bronze belly and thighs and iron legs. Each of these metals is progressively less valuable and represents a different kingdom, the first of which Daniel identifies as Babylon, Nebuchadnezzar’s empire. From our vantage point in history, we now know the four kingdoms are the Babylonian, Medo-Persian, Greek and Roman empires.\n\nDaniel also received a vision of the demise of the Medo-Persian Empire, which had, in 539 B.C., overtaken the Babylonian Kingdom. God specifically names the Medo-Persian and Greek empires in Daniel 8:20-21 and 10:20–11:4. The first half of chapter 8 is a highly symbolic passage about a ram and a goat. The ram had two horns, one longer than the other, representing the empire of the Medes and the Persians (Daniel 8:20), and “none could rescue from his power. He did as he pleased and became great” (Daniel 8:4).\n\nThen a goat “came from the west” (Daniel 8:5) with a single horn between its eyes. The horn represents the king, Alexander. The goat killed the ram and “became very great, but at the height of his power his large horn was broken off” (Daniel 8:8) – a prediction of Alexander’s untimely death. In Daniel’s vision, the single horn is replaced with four new horns, which are “four kingdoms that will emerge from his nation but will not have the same power” (Daniel 8:22). The four new kingdoms are mentioned again in Daniel 11:4, which says that “his [Alexander’s] empire will be broken up and parceled out toward the four winds of heaven. It will not go to his descendants, nor will it have the power he exercised.” These passages describe, two centuries in advance, precisely what happened to Alexander and his empire.\n\nHoping to hear some responses so I can better counter the argument in the future. ",
        "created_utc": 1495948860,
        "upvote_ratio": ""
    },
    {
        "title": "Going to church",
        "author": "funderbolt95",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6drqt8/going_to_church/",
        "text": "I'm going to church with my fiancé in the morning because lifelong friend he's had is preaching and asked us to come. I live in South Georgia and haven't been to church in like 4 years. I'm so nervous. I always have to lie and say I am Christian so people don't treat me bad down here. Even my family. Anyone else had a similar experience?",
        "created_utc": 1495941538,
        "upvote_ratio": ""
    },
    {
        "title": "Theists generally don't believe me when I say I wish there was a God",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6dqpfl/theists_generally_dont_believe_me_when_i_say_i/",
        "text": "[deleted]",
        "created_utc": 1495927472,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people use \"God told me to...\" as a means for rationalizing their poor decisions?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6doju4/why_do_people_use_god_told_me_to_as_a_means_for/",
        "text": "[deleted]",
        "created_utc": 1495902242,
        "upvote_ratio": ""
    },
    {
        "title": "Is death too high a cost to pay for being alive?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6df37y/is_death_too_high_a_cost_to_pay_for_being_alive/",
        "text": "[removed]",
        "created_utc": 1495777175,
        "upvote_ratio": ""
    },
    {
        "title": "To learn the history of religion, which would be a better book to read, the Evolution of God or the History of God?",
        "author": "TheManWhoSlays",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6dcmcm/to_learn_the_history_of_religion_which_would_be_a/",
        "text": "[removed]",
        "created_utc": 1495747635,
        "upvote_ratio": ""
    },
    {
        "title": "To learn the history of religion, which the better book, The Evolution of God or the History of God?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6db0bu/to_learn_the_history_of_religion_which_the_better/",
        "text": "[removed]",
        "created_utc": 1495732356,
        "upvote_ratio": ""
    },
    {
        "title": "Opinions on pantheism?",
        "author": "rasputin1",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6daltc/opinions_on_pantheism/",
        "text": "[removed]",
        "created_utc": 1495728699,
        "upvote_ratio": ""
    },
    {
        "title": "PLEASE convince me that there is an afterlife.",
        "author": "MisfitMarie87",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6d74ek/please_convince_me_that_there_is_an_afterlife/",
        "text": "[removed]",
        "created_utc": 1495682632,
        "upvote_ratio": ""
    },
    {
        "title": "Where do we get our morals from?",
        "author": "EvilStevilTheKenevil",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6d3aza/where_do_we_get_our_morals_from/",
        "text": "[removed]",
        "created_utc": 1495643943,
        "upvote_ratio": ""
    },
    {
        "title": "What I know, what I think and what I hope.",
        "author": "BarneyTheWise",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6d1c0w/what_i_know_what_i_think_and_what_i_hope/",
        "text": "I apologize if this post devolves into the ramblings of a misguided young fool. That's not my intention at all. I've just been going through a period of self reflection and would like to share it in a civil manner amongst like minded peers.\n\nI would like to start by saying that I very much enjoy this sub and it's general content. It's laid back, it's neutral, and it's fair.\n\nWhat I know.\n\nAll I know is that I don't know very much. I'm living a false title but to be fair BarneyTheNotSoWise is a bit of a mouthful. I don't know what happens when we die, I don't know if a God or gods exists and I don't know what I would do even if they did. \n\nWhat I do know is that short of reincarnation,  this is the only life we get. I know that existence in and of itself is a truly remarkable thing. I know I shouldn't be cruel to sentient life (one should not be cruel to non-sentient life either). I know the universe is a really big place and I know I'm just living on a rock floating through said space. \n\nWhat I think\n\nI think that in all likelihood there is no supernatural higher power. I think religion was created to help explain things we couldn't explain at the time and as a species I think we've reached the point in our collective knowledge to where religion is no longer needed. I think life is pain and that we should assist one another with the hardships that come with that pain. I think when we die we slip off into oblivion, where all life will go one day.\n\nWhat I hope\n\nI hope I'm wrong. Every fiber of my being hopes I'm wrong, because death is scary and my ego is large enough to where I believe I deserve eternal life. I hope a truly kind and benevolent God or gods exists and I hope mankind would benifit from them. I truly 100% hope I'm wrong about every conclusion I've come to in my life in regards to the supernatural.\n\nBut I don't think I am.",
        "created_utc": 1495622402,
        "upvote_ratio": ""
    },
    {
        "title": "Introducing /r/ThoughtfulAtheism, a sub for in-depth articles and discussion of religion and Atheism",
        "author": "TeoKajLibroj",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6cvcre/introducing_rthoughtfulatheism_a_sub_for_indepth/",
        "text": "[removed]",
        "created_utc": 1495553288,
        "upvote_ratio": ""
    },
    {
        "title": "Can you consider yourself an atheist if you have hope for something more after this life?",
        "author": "danceman101",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6cjzzx/can_you_consider_yourself_an_atheist_if_you_have/",
        "text": "So I'm a recent ex Mormon and I'm starting to consider myself an atheist. However, for some reason I can't accept the fact that this life is all there is. I think mainly it has to do with family members that have died and not being able to accept the fact that they are gone for ever. Anyone have some thoughts or words of wisdom?",
        "created_utc": 1495412385,
        "upvote_ratio": ""
    },
    {
        "title": "What is it like being an Atheist where you live?",
        "author": "nothingimportant2say",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6c3ye4/what_is_it_like_being_an_atheist_where_you_live/",
        "text": "Where else have you resided? Was being an Atheist a problem in any places you stayed? Do you think it was more​ of a rural vs urban situation or specific to the location you were in? Has being an Atheist ever been a benefit where you lived?",
        "created_utc": 1495203979,
        "upvote_ratio": ""
    },
    {
        "title": "We truly are living in an age of ignorance.",
        "author": "truth_alternative",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/6byp14/we_truly_are_living_in_an_age_of_ignorance/",
        "text": "[removed]",
        "created_utc": 1495137512,
        "upvote_ratio": ""
    }
]