[
    {
        "title": "Feeling pretty alone....",
        "author": "GameMisconduct63",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3emqz5/feeling_pretty_alone/",
        "text": "So I just watched the movie Interstellar with my parents (both extremely religious). Long story short, I mentioned how I liked the movie at the conclusion because I could see something similar to it happening in the future, once our species becomes critically in need of food, resources, etc. \n\nThey proceeded to call me an idiot for believing in that whole plot line (4th dimensions...) but not the bible. \n\nI ignored it and tried to make them recognize the social importance of saving our species and preserving humankind. As if the bible remark wasn't bad enough, they proceeded to tell me that they didn't care about saving our species as long as their \"souls were saved\". Word for word my dad said that he didn't give a shit about the planet.....\n\n\nAnd that just hit pretty deep.....because I may not know much about the accuracy of ancient prophecies and what not, but....I do know that a apathetic attitude about our direction as a species is not what our planet needs. Not one bit......so I don't really have a point to this post other than to let off some steam....\n\n\n\n",
        "created_utc": 1437886105,
        "upvote_ratio": ""
    },
    {
        "title": "An Inquisition regarding the Old Testament.",
        "author": "AirKing_",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ekojb/an_inquisition_regarding_the_old_testament/",
        "text": "Against my better judgement, I foolishly logged into Facebook and for the past two weeks, I’ve been following the outrage and ridiculous drivel many have been spouting in regards to the legalization of gay marriage in America. One trend that caught my eye were many Christians completely disregarding the Old Testament and only adhering to the laws of the New Testament; many claimed that the New Testament is more lenient and accepting of the gay community whereas its predecessor was draconian.  \n\nOver the weekend while I was out of town at a party where I met a woman who graduated with a PhD. in Theology. We engaged in some friendly conversation regarding the recent events that transpired and the reactions we’d seen from others. She preceded to inform me that the Mosaic Law of the Old Testament was written for the chosen people of Israel and that many of those laws do not apply to the Christians of today’s time. She also explained that God changes a lot of different things. He can arrange and play things out so that certain situations apply in some cases and don’t apply later, though His purpose is constant and unchanging.\n\nHere’s the conundrum I have with Christianity: Why do many Christians choose to deliberately ignore, the laws of the Old Testament? Furthermore, if God’s law is deemed absolute by the creed that is supposed to be followed in the Bible, then an individual who tries to refute these laws should be regarded as an infidel correct? Yet we see many followers of the doctrine (i.e., apologists) attempt a sort of revisionism on a book that for many is seen as an axiom.\n\nIt is universally understood that God is a omniscience and omnipotent force, the perfect being if you will. Assuming that he is truly perfect as are the words and laws in “his” book, Would it not be illogical for any follower to think there are any errors in context?\n\n",
        "created_utc": 1437843671,
        "upvote_ratio": ""
    },
    {
        "title": "I'm going to read through the Bible. Any tips?",
        "author": "metaformer",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ek5rx/im_going_to_read_through_the_bible_any_tips/",
        "text": "I have come to understand the book to be a collection of myth, and will be trying to read it as though it were literature. My parents want me to come back to Christianity, so they support my wanting to read it. They want me to read the NIV translation, but I'm going to try to get my hands on an Oxford study Bible (or just their translation) or an NSRV study Bible at the local Christian book store.\n\nI have several questions for you all. What mindset should I read it with (knowing that it is very likely untrue), what parts/books/passages should I just skip over? How do I keep track of discrepancies between different verses? What kinds of notes should I take? Finally, should I read it straight from Genesis to Revelation or in a different order? Is there anything else you guys can tell me?",
        "created_utc": 1437832732,
        "upvote_ratio": ""
    },
    {
        "title": "Using Desiderata as a form of prayer/ daily reminder.",
        "author": "roadblock07",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3eiu6j/using_desiderata_as_a_form_of_prayer_daily/",
        "text": "Ever since I've became atheist, I've started using the poem Desiderata as a form of prayer or daily reminder of my life. Does anyone here still use some form of prayer to yourself?\n\n\nHere's the poem.\n\"Go placidly amid the noise and the haste, and remember what peace there may be in silence. As far as possible, without surrender, be on good terms with all persons.\n\n\nSpeak your truth quietly and clearly; and listen to others, even to the dull and the ignorant; they too have their story.\n\n\nAvoid loud and aggressive persons; they are vexatious to the spirit. If you compare yourself with others, you may become vain or bitter, for always there will be greater and lesser persons than yourself.\n\n\nEnjoy your achievements as well as your plans. Keep interested in your own career, however humble; it is a real possession in the changing fortunes of time.\n\n\nExercise caution in your business affairs, for the world is full of trickery. But let this not blind you to what virtue there is; many persons strive for high ideals, and everywhere life is full of heroism.\n\n\nBe yourself. Especially, do not feign affection. Neither be cynical about love; for in the face of all aridity and disenchantment, it is as perennial as the grass.\n\n\nTake kindly the counsel of the years, gracefully surrendering the things of youth.\n\n\nNurture strength of spirit to shield you in sudden misfortune. But do not distress yourself with dark imaginings. Many fears are born of fatigue and loneliness.\n\n\nBeyond a wholesome discipline, be gentle with yourself. You are a child of the universe no less than the trees and the stars; you have a right to be here.\n\n\nAnd whether or not it is clear to you, no doubt the universe is unfolding as it should. Therefore be at peace with God, whatever you conceive Him to be.\n\nAnd whatever your labors and aspirations, in the noisy confusion of life, keep peace in your soul. With all its sham, drudgery and broken dreams, it is still a beautiful world. Be cheerful. Strive to be happy.\" Max Ehrmann, \"Desiderata\".\n",
        "created_utc": 1437793765,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting point made by a friend.",
        "author": "Mainstay17",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ef3vh/interesting_point_made_by_a_friend/",
        "text": "I consider myself an atheist, he considers himself an agnostic. In explaining himself, he claimed that since we have absolutely zero information regarding existence before the beginning of the universe, it is illogical to rule out a demiurge (a god who merely begins creation, the deist concept of god).\n\nI responded that I consider that irrelevant to my atheism, but looking back on it I don't think my justification makes much sense.\n\n1. Thoughts on his claim?\n\n2. Is my response justifiable?\n\n---\n\nI'd just like to add something on. I did tell him that including the possibility of any form of a god as a creator doesn't conform to empiricism and logic, to which he replied (IIRC) that we don't know if empiricism and logic hold any bearing on reality before the Big Bang, so that didn't matter.",
        "created_utc": 1437721085,
        "upvote_ratio": ""
    },
    {
        "title": "Do \"values\" exist?",
        "author": "drkesi88",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ebsm5/do_values_exist/",
        "text": "Intuitively this sounds like a stupid question, and I'm still not sure that it isn't, but after reading and engaging in some conversations about morality with theists (mostly Christians), I've started to wonder what exactly \"values\" are. The word's been long co-opted by social conservatives - i.e. \"family values\" - and they appear to take it to refer to the eternal, transcendent morality bequeathed to us by their god, even though they seem hard pressed to name one. \n\nIs \"values\" a useful term in discussions about morality? Do they exist outside of philosophy? Do they exist at all? \n\nIs this a stupid question?",
        "created_utc": 1437662272,
        "upvote_ratio": ""
    },
    {
        "title": "Why A God would create",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3eb6pd/why_a_god_would_create/",
        "text": "Now, let me get the boring and almost ignorant suppositions out of the way. No, God didn’t create us for a “purpose”, or create us to do His bidding, or even create us to follow a path. All of these things revolve around assumptions that our Human brain makes by looking at Human tendencies and desires. That is all.\n\nNo, I’m looking for suppositions and assumptions around the rules of the game of life and that of the universe. I will attempt to do it with as little science as possible, I promise.\n\nSome Facts/Ideas that appear as facts –\n\nA) God has given us curiosity, and has given us plenty of things to uncover.\n\nB) God doesn’t show his face, explicitly as God, to everyone on a daily basis.\n\nC) Hamburgers.\n\nNow, why C)? Hamburgers involve us killing cows and eating them between grains that are created into bread. The protein is great and it keeps us alive. Heck, even vegetarians eat bacteria when they breathe in. So now, this is a puzzle to solve. Does God want us to kill and destroy for food, but not for entertainment (like a murderer)? Why is that? Infact why do we eat things any ways? Why do we sleep? All of these things make sense, if you want someone or something to do something without his permission – but don’t explicitly state that his permission is taken. Kinda like a slave. See, if God wanted us to do something – he would force us to do it everyday and as much as possible ( work or God’s work), and then enjoy a few hours of horsing around (play), and then a deep stopping of the experience (sleep). This variation ensures that the Human is kept engaged. But God created this Human! So why create the desire for variation in the first place? This theory falls flat here.\n\nNow, lets move on to A). I love the idea that God is in hiding, but has made it curious enough for us to find him. How will a person in a Coma find God, if everyday humans can’t find him? God’s rules seem to be flexible and shady. So God, isn’t hiding in the clouds waiting for us to discover Him.\n\nNow, lets focus on divine revelation. The idea that God sends a messiah to sort things out (Christ, Vishnu, Mohammad). Why does God create the rules of violence in the first place, and then send a mechanic to fix things? That makes no sense.\n\nYou see, how quickly the idea that “God is watching us or judging us” starts to quickly fade away?\n\nNow, consider that God is Us. We are all God, where God is enjoying the thrills of everyday experience by living it through us. It sounds like science-fiction, but then again – a man that we’ve never seen existing above the clouds, sounds a whole lot more fiction to me. Nobody appears to be watching us here, we’re watching out for ourselves in this theory called – Simulation Theory. But take it further than that. Why is God enjoying the thrills through us? Is he bored? Is he stressed from his own plane of existence?\n\nThese questions make you wonder about the “personality” of God. But consider this always, your thoughts and your questions were given to you, and not a lot of people consider this daily. Infact, there is no evidence that cats and ants think about this ever. So we’re 0.0000001% of life on this earth, and we think about God. It seems like another game.\n\nTherefore, in the end there is only silence, when you finally realize that all questions are meaningless and can be dropped down to their most basic levels and beaten to death with curiosity. This is when you can breathe out. Silence accepts all propositions and imposes little thought on it that is beyond its conception. Everything beyond conception is mystery and fairy-tales which are very entertaining indeed. But fairy-tales in the end.",
        "created_utc": 1437649674,
        "upvote_ratio": ""
    },
    {
        "title": "Here's the first chapter of my pro-atheist book, please give me a critique.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3eahh1/heres_the_first_chapter_of_my_proatheist_book/",
        "text": "Haven't added the citations yet, but I'd like to know the general opinions about it. Due to the word limit, I could only post a certain amount here; if it interests you then below is a link to all of the first chapter.\n\nhttps://byjarinjove.wordpress.com/2015/07/22/my-pro-atheist-book/\n\nsource for the most pertinent topic I mentioned: \n\nhttp://www.nytimes.com/2005/06/28/politics/justices-rule-police-do-not-have-a-constitutional-duty-to-protect-someone.html\n\nChapter 1: Conventional Religion\nReligion has commonly been defended by our personal experience. People who don’t take an in-depth look into their respective theological texts will often use anecdotes to defend their beliefs and usually say that they have faith. Favorable perceptions are argued as reasons for why a particular religious faith is true and the majority of people use faith as a guidepost for certain everyday activities. This creates a convoluted and harmful standard that people live under but don’t recognize. As a consequence, many people don’t give much consideration to this issue because they feel it is normal. It is not dissimilar to observing the harmful effects of believing in the lucky chance of winning the lottery. For example, people who play the lottery and have faith in the belief of good fortune often don’t give any consideration to the detrimental effects of their gambling habit nor the mathematical chances involved in determining the winner. Typically, there are several false assumptions made by the purchaser that cause this problem. The most notorious – and wrong – belief is that purchasing more tickets increases the chances of winning. This assumption isn’t true and it is proven on the very ticket sold; to explain further, let us say there are 60 different possible combinations of numbers on a combination of ten numbers in a ticket and the winning combination is 1234560789. What are the chances of winning the lottery by that combination of tickets? \nShocking as this may sound, the winning chances is determined by the number of possible combinations of each digit. Thus, because there are sixty possible combinations at the start, the actual chances of winning are 60 x 59 x 58 x 57 and so forth. The only winning ticket is 1234560789 so every other combination from 1-60 will lead to waste of your money. A lottery ticket such as the Powerball has an approximate chance of 1 in 70,000 years and the odds of the Powerball are around 1 in 900 million for any set of combinations. Which means that every U.S. citizen – from child to adult – must buy three tickets each and among those people only a single person can win the lottery; a single person buying more tickets won’t change this fact or strengthen the odds because each ticket has a 1 in 900 million chance of being the winner. For those readers who purchase lotto tickets, please compare the combinations of real life tickets that you know of. Count the possible combinations of each sets of numbers or – in some cases – just look at the back of the ticket where it explains the chances of winning. Usually, the lottery ticket combinations exceed the amount of people living within the country by a wide margin. In some cases, due to the combinations being 3 times the number of actual citizens in the country, the chances of actually winning the lottery can be greater than 1 in 70,000 years. This is because the amount of times you play, how old you are, and what special meaning – such as a birthday that a particular combination has – is absolutely inconsequential to the total combinations of numbers that are possible. Lottery players are simply being duped and using irrational thinking to waste their savings on gambling. This means that millions of people both within your country and across the world who strongly have faith that they will win the lottery believe in an utter falsehood; it means that people who play the lottery out of habit are still squandering their money away on a useless and detrimental pastime. It shows that millions of people can be utterly wrong despite the popularity of a belief and defensive arguments that lottery purchasers make such as statements similar to “You never know” only display arguments demonstrating a basic ignorance of how lotteries function. This can be proven on a demonstrable mathematical level, if need be. Lottery gamblers have been duped by their faith in the power of luck and good fortune. Scholars have privately regarded the lottery as a stupidity tax.\nThis duping is largely because they use personal experience – their own anecdotal events in life – and selectively focus upon the lottery winners who won millions. They have not considered the millions of people who have played the lottery throughout their lifetime and never won. Even if small rewards such as $3000 is won by a lottery player, it wouldn’t be a gain because they would have to compare the amount won with the total amount lost during their lottery ticket purchases throughout the years. Their purchasing power was diminished on every ticket that was not a winner. A community of lotto ticket purchasers only serves to normalize this self-destructive gambling habit. So, why does this matter and what does it have to do with religion? It shows that millions of people can be utterly wrong about assumptions regarding the normal activities that they partake in, it shows that despite repeated behavior they don’t realize the negative consequences of wasting money that could be saved for their future, it shows that using a large population size to justify a belief isn’t a good reason at all to argue in favor of that belief, it shows that people can have positive beliefs used against them and harm them both emotionally and financially without them recognizing the problem, and that relying on “luck” through arguments from their own lack of knowledge of the odds can cause people to waste years of their life on a harmful belief. All of this is a consequence of using only personal events – anecdotes – and a belief in a metaphysical “luck” as a way to justify ones choices. A community that helps reinforce the normalcy and treats the lottery as a positive activity can only serve to harm the individual. Lastly, highly educated individuals don’t fall for the lottery trap and recognize the personal experiences and faith of the lottery gamblers is a falsehood despite the amount of lottery players who strongly believe in these fanciful qualities about the lottery. \n\t\t\t\tAnecdotes            \n\t A focal problem with anecdotes is that they can be argued in favor of any position; no matter how contradictory, racist, homophobic, or even positive. Anecdotes are a logical fallacy because they don’t account for the actual statistical figures of a given subject and instead argue in favor of a position through personal events or isolated incidents. Some of these anecdotes can be inferred from viewing events on television. An example to understand this would be the statistics on wars. Despite what is displayed on the news, wars have been on the decline since the 1960s. After World War 2, there has been a huge drop in the ratio of violent conflicts throughout the world, but this sounds ridiculous in the face of war stories that occur on the news virtually every week. Evidently, the only reason that the majority of people perceive that humanity has become more violent is the easy coverage of violent conflicts as they are happening. During the era of newspapers, this was not possible. The modern media has allowed people across the world to gain insight on conflicts far removed from their location and NGOs have allowed people to give aid to suffering refugees to a greater extent than in the past. A greater awareness of these violent events has actually allowed better responses for the people who are suffering. Yet, the erroneous perception that humanity is becoming more violent still remains because of people’s repeated exposure to news about different wars across the world. The 19th century accounts for the most violent of times throughout human history in terms of wars and mass genocides.\nReligious anecdotes are just as problematic. If, for example, a child is suffering from cancer but is cured either through medical treatment or the cancer disappears because their immune system successfully fought it off then religious believers often say that God has cured the child of cancer. If, however, the child regrettably dies of cancer then religious believers are most likely to – after giving honest condolences – say the child is with God in the afterlife. Thus, what changes aren’t the horrible circumstances of the events but rather the interpretation of the events to make the observers of the event feel better. It is the same for children in third world countries; the majority of people in first world countries ignore the issue of starving and dying children in third world countries under the basis that it has nothing to do with their personal lives. People often tout that the dead children are in heaven and no longer suffering. However, what changes aren’t the horrific circumstances of innocent children dying from the world at large having failed them, what changes is a religious believer’s perception of the event and only to the comfort of the religious believer so that they don’t have to think or feel horrible from knowing there are children dying from starvation in third world countries. Sadly, this creates another problem, predatory missionary groups use anecdotes to their advantage on unsuspecting and uneducated people to argue in favor of their religion by holding people hostage such as pretending a transport vehicle is broken down until impoverished people living in a third world country pray to the religion of the missionary group to get the bus “working” again. Worse still, some missionaries are known to refuse health services until impoverished people pray to their God. The level of apathy for the plight of the third world has prompted wealthy families to create public works projects like the Gates Foundation to combat these continued issues.\n\t\t\tAnecdotes and Symbolism\nAnecdotes often require symbolism in order to maintain the state of normalcy. Religious symbols are often displayed to instill feelings of hope; especially during harrowing times. Religious symbolism is often utilized in books, films, and sometimes in court proceedings to create a veneer of God defending the rights of the people for the sake of equality and to further symbolize moral goodness. Flag symbols in the background of a superhero character, religious symbols such as the cross, and of course the statement “In God We Trust” behind the court judge serve as common examples of these symbols. Symbols help facilitate the pattern recognition bias within humans; that is, perceiving a correlation between two different events where there is none. Instances of justice failing or unfair laws are often ignored and people gain a fallacious understanding of what the law is really meant to be. Laws are dependent upon interpretation; juries are to determine if a particular incident broke a set of rules. Yet, when instances such as the failure of the law are displayed then it is argued that humans are imperfect. So what good is the symbolism in the first place? It is a deception and one that is used against individuals who harbor such perceptions. \n  An example of this nefarious deception, the faultiness of symbolism, can be shown by the following: most US citizens believe that US police officers have a lawful duty to protect them from any harm. This is legally false; a Supreme Court decision in 2005, Gonzales V. Castle Rock, determined that police protection was not a protected entitlement under the 14th amendment and that the protection of private citizens was not part of the public duty doctrine. In the context of the case itself, Gonzales noticed her children missing from her front yard and called the police to inform them that her estranged husband had probably taken them. He wasn’t allowed to take them during that day because of the custody rules in place for when he was could spend time with the children. The police didn’t take the claim seriously; Gonzales then tried calling the police at several times during the hours and even went to the police station to show the legal document whilst desperately asking for help. The police refused to do anything, the police officer at the desk took a lunch break after hearing her pleas, and the next day her ex-husband committed suicide by cop and the officer found the dead bodies of Gonzales’s three young children in the trunk of the ex-husband’s car. The trial went to the Supreme Court and the case was dismissed on the basis that Gonzales’s children and by proxy all Americans had no legal right to police protection within the United States. According to the ruling, the police don’t have to help you, even in instances when you are being robbed, assaulted, raped, or murdered. The Castle Rock police department was quick to reframe the event in order to blame the grieving mother and politicians hailed the decision by focusing strictly on how police had to make tough decisions when on the field of duty. What wasn’t mentioned was how the US government, from the local to federal level, no longer had to pay any damages to victims who suffered from the police failing to uphold their supposed duty in protecting the citizens from harm. The Supreme Court of the United States had determined that the lives of children were less important than the government losing sums of money.   \nIf you are a US citizen, you may have feelings of disbelief upon reading the aforementioned paragraph. After all, you’ve likely grown up with an entire culture of police dramas like Law and Order, NCIS, and other American TV shows with a plethora of episodes depicting valiant police officers doing their utmost to aid rape victims, children, and the wrongfully accused. These depictions usually consist of a main character having a strong personal connection with the victims to help them cope with the horrible events. The reality of the law seems ridiculous in comparison to what you might believe about the justice system; what you may not have realized is that you are using aspects of fiction to fill the gaps in your understanding of reality. You have used fiction as a substitute to fill in what you didn’t know because we humans feel safe when we have a coherent understanding of the world. These stereotypes have been formed by shortcuts that you have developed regarding the world around you and your ignorance of the real law could be utilized against you. You may have formed a coherent story and expectations based on what you knew about the law but the fact remains that you probably didn’t know about the actual laws governing you. Psychological studies have found that, due to our increasingly complex societies, people use shortcuts to quickly determine what different subject matter represent and mean. This is natural because as human beings, we cannot make deep insights about every single subject matter that we are confronted with even in a single day. As a consequence, stereotypes about certain jobs, organizations, and different types of people abound and will probably always exist. These psychological shortcuts are only worsened by our human bias to see pattern recognition but more on that in later chapters. \n We humans need to use shortcuts in our increasingly complex societies and so we use them without even realizing it. Whatever you thought might be credible laws depicted on television shouldn’t be trusted. A repeated marathon of episodes in which fictional police only act positively towards the general public would cause an obvious bias with an implicit understanding that police are legally required to protect the public; it follows along the lines of the motto “protect and serve”, it is what young children are led to believe when meeting friendly police officers during their time in school, it follows the norms of what we expect when we see TV shows like COPS that selectively show favorable police chases, and the fact remains that it isn’t legally accurate. US citizens don’t have the right to police protection. What people have done is let the belief in symbols, the repeated exposure to favorable police shows, and the popular opinion of the public give them a misrepresentation of the actual law. Neither the fact that the majority of the 300 million people living in the US believe that police are legally suppose to protect citizens nor the fact that 300 million people are bombarded with imagery, symbols, and stories of police heroics make the law any less valid or impactful upon people’s daily lives. If you believe that this is a lie then I encourage you to independently verify the lawful impact of “Gonzales V. Castle Rock” for yourself. The fact is that we humans have a tendency to go by the information and repeated exposure to what is most available to us. It is known as the availability bias within psychology and it is a psychological factor that governments, police organizations, the national media, and psychologists are well aware of.\nHow does this apply to religion? It shows that millions of people can wholeheartedly have an understanding about the norms of their society, harbor an overwhelmingly positive outlook on an organization and what it is perceived to do based on implicit understandings, and be completely wrong. The fact that millions upon millions of people believe that police officers are legally required to protect them and this belief is what they consider to be a normal aspect of their everyday lives doesn’t make the belief true. If you were in a similar position to Gonzales and lost a loved one through police failure in doing their duty, your ignorance about this ruling would serve as a detriment to you; the police wouldn’t need to pay any damages for failing you or your loved one. At best, they would simply be forced into retirement. Your ignorance, created by an obfuscation of the real facts through positive cultural imagery, will be used against you. It is also important to consider how many of us come to these beliefs. We often observe and consider what other people think or do and copy that behavior in order to remain in a favorable view to the majority of people; that is social proof. Therefore, the majority of people being confronted with this law would probably be skeptical and may view such a legal fact to be a conspiracy theory. After all, it doesn’t follow any coherent understanding about their beliefs regarding American society and it doesn’t fit a coherent expectation about the law itself. Yet it is a real law, but accepting that would require a drastic change of perception regarding what most Americans have come to expect regarding their own safety and the safety of their loved ones.\n Christians make up the largest population in the world. In almost every country, there is at least a minority Christian population. For all the speeches about how India and China have a majority Hindu or majority atheist population, it remains true that Christianity – as a whole – has the largest population size. Yet, this is not a valid argument favoring Christianity. This is what is known as the appeal to population fallacy. Consider this hypothetical argument: what if Judaism turned out to be the one true religion? If that were so, then it wouldn’t matter how many people across the world believed in Christianity, it wouldn’t even matter if every country in the world outside of Israel believed in Christianity or even if every person in the world believed in Christianity while Judaism was no longer believed in. It would be meaningless in the face of Jewish people being the chosen people of God. You can substitute this proposition with another religion or reverse it; if Christianity is true then Jewish people have suffered throughout history for a meaningless cause or – worse still – they have endured suffering to be killed en masse for some apocalyptic prophecy. Now consider this: according to most polling data, Islam will be the world’s largest religion by 2050. If that prediction becomes true, then what value can there be in Christians making up the majority of the world population currently? It has no value and on closer inspection, it is less meaningful than most Christians might realize. Christianity has long been divided into Protestants, Catholics, and East Orthodoxy; in other regions of the world Christianity has blended with local religions in the regions that it has spread. For example, Christians of India follow a Caste system just like the Hindus. In the Philippines, books of local religious witchcraft have been blended together with Christian teachings. There is no, and there probably will never be, a uniform Christianity; but this is not a unique problem to Christianity. It is the natural occurrence of any belief spreading; it is why India has had a tradition of Hindu heterodoxy, why Islam has differences in Sunni and Shia, and intrinsic differences in several Buddhist schools of thought. In the context of the United States, liberals and conservatives have diametrically opposed views of Jesus Christ’s teachings and expectations. What use is the term Christianity, or indeed any religious identity, when it has belief systems that conflict with each other on fundamental levels?\nIn the following chapters, I will extrapolate on the faultiness of open interpretation and how each of the major religions suffers from being unable to grapple with modernity. \nConvenience\n    Religion has often been used to suit our conveniences. In the previous section, I mentioned how people living in first world countries ignore the circumstances of children in third world countries as having nothing to do with them and how religion helps ameliorate the immorality of such a position by the presumption of a positive afterlife for the children who have died. This is a regrettable truth that we should confront because it takes away the easiness and simplicity of religious answers. Religion, for the longest period of time, has helped facilitate apathy to problems of child mortality in third world countries but the apathy and convenience of religion doesn’t end there.\nThe majority of people in any first world country don’t give much thought to the problems of countries outside of theirs. Beyond selective media portrayals that create negative stereotypes, there is very little about foreign countries that residents of any given country understand and why should they? After all, it has little impact on their lives. As a result, due to our increasingly complex world and the shortcuts we use in understanding foreigners, we create negative stereotypes about other regions of the world and their people. Religion implicitly creates differences of in-group and out-group conditions and according to psychological research; the grouping of people into these different codifications is instantaneous. We humans are “groupist” by instinct. Race, religion, age, gender, political affiliation, citizenship, and other aspects of our personal identity have consequences for how we are all viewed by society. People codify us into groups, we codify them, and stereotypes are soon formed because of these rash generalizations from our “shortcuts” about other people. This societal reality has a pernicious and demoralizing effect upon entire groups of people. \nIn my discussions with fellow millennials on facebook, in college clubs, and among friends; I would ask whether they noticed an implicitly racist codification conducted by the generations before us. Almost unanimously, the millennials that I spoke with – among different social classes, having different racial backgrounds, and coming from different political affiliations – agreed with the strange behavior of the generations before us. What we all agreed on was thus: the older generation would assess the quality of an entire racial group by comparing the good and bad people of that racial group that they personally met. For my group of friends and I, this seemed both fundamentally absurd and stupid. By defining people by their racial group, you are erroneously attributing negative qualities to people who have nothing to do with each other beyond being born with the same skin pigmentation. This is fundamentally unfair and racist. To the keen observer, the argument from followers of this belief attributing these distinctions from the “good” or “bad” qualities of the racial “community” does little to obfuscate the underlying racism. A disturbing implication from this viewpoint is the ignorant idea that skin pigmentation is linked to bloodline. In online forums, people will speak of how racist family members of theirs will demand that certain other racial groups be kept out of their family line. However, if people believe that “race” has to do with one’s familial blood then what these racists are advocating is incest. If they truly believe that skin pigmentation determines similarities in blood then this is an advocacy for certain degrees of incest. Fortunately, ignorant racists are entirely wrong; skin pigmentation was determined by people adapting to their specific climates in their environments and skin pigmentation is a phenotype and not a genotype. In concise terms, skin color has nothing to do with how genetically close you are to someone else. For example, if you’re white, you may be closer in genetic relations to your fellow black members of society than your fellow white members. This is primarily because skin pigmentation is just one small part of our genetic make-up; these racial boundaries are a cognitive illusion fostered by misapplied cultural history and historic racism. Examples of this fact can be seen across the world: Northern Indians of India are genetically closer to British people than Central and Southern Indians in genetic make-up, most Europeans can trace their roots to the Near-East, Iraqis are classified as Caucasian and in fact have a significant percentage of people who typical Westerners would generally classify as being “white”, and Mexico has more diversity among different racial backgrounds than at first glance. These distinctions are worthless anyway because the generalizations of each group are based on either racism or ignorant cultural discrimination. Generally speaking, racists have a difficult time classifying anything that isn’t their expected similarity. The predominance of incestuous beliefs seems to be the root of most racism; this provincialism seems to be true of each country that practices it. I’d make the argument that US citizens are criticized for it because it is inconsistent with the championed diversity of the US and shows a failure of the education system of the US; furthermore, government codifications via racial background may be a double-edged sword because it promotes these implicit divisions by the evaluation of society through skin pigmentation.\nDuring a news panel on Fox News in 2014, Megyn Kelly received a wide amount of criticism for openly saying to any possible children watching that Jesus Christ and Santa Claus were white. After the public’s derision of Kelly’s statement, politicians ignored the part about Jesus Christ and shifted the focus to Santa Claus being a diverse cultural icon for children of all skin pigmentations. Virtually no politician or social media critic confronted the quirk about Jesus Christ being a white man and the backlash quickly died down. The educated members of the general public pointed out historical inaccuracies in social media regarding Jesus’s skin pigmentation, groups of Christians stated that the skin color of Jesus Christ obviously didn’t matter because his love for humanity is universal, and discussions about a black Jesus were largely met with an equal possibility to a white Jesus. This type of controversy over the racial background of a religious figure isn’t unique to Jesus Christ or to religious discourse itself. Ancient stories about Cinderella, Ali Baba, and the 16 labors have changed a multitude of times to the renaming of the characters, the changes to the skin color of the characters, and the sanitization of the more morally dubious aspects of the stories that don’t fit with the moral guideposts of the cultures that adopt the stories. In the context of religion, the Buddha has faced similar issues of cultural appropriation; his racial background has changed from Indian to the race of the majority population of each country that adapted Buddhism. In Korea, his appearance is reshaped to that of a Korean and in Taiwan, he looks Taiwanese; this is a blatant historical inaccuracy but these types of iconography persist throughout history and persist within each country where the majority population is of a different racial background from the revered figure. For the most part, within each country that Jesus and the Buddha are revered, their racial background changes to the majority population of that country. So, if the racial background of Jesus Christ and Gautama Buddha don’t matter then why does this form of cultural appropriation overwhelmingly persist throughout the world? A pernicious and unpopular answer could be our psychological biases; psychologists have found that human beings prefer to associate with others who are similar to them. Psychologists have coined the term “relatedness” but from my studies in political psychology, I would argue that this terminology skims over the true impact of the meaning. A more appropriate term might be “narcissistic impulse” and each racial group’s desire to praise their revered figure only under conditions in which the figure is depicted to have the same racial background as them – while wholly ignoring the historical inaccuracies – reveals each individual’s narcissistic desire for their racial background to be the most important in the world. I suspect that it is an explicit and irrational form of religious convenience that isn’t challenged because it would engender a plethora of racism and hate speech from any group that faced such a challenge to their religious worldview because the iconography is more important to satisfying their narcissism than historical facts. While the socially progressive religious adherents are willing to acquiesce to the legitimate history of their religion, it would be more challenging to convince the more ignorant groups in any given country to do the same. This religious convenience reveals a depth of difference and fracturing beyond the multitude of religious denominations that just isn’t discussed. People remain silent about this global racist phenomenon throughout their religious practices precisely because challenging the issue would harm the convenience of the majority of religious people.    \n\t\t\tConvenience and Coherence\nIn his best-selling book, Thinking Fast and Slow, Psychologist Daniel Kahneman unveiled the multitude of biases and cognitive shortcuts within the human psyche. The human mind has a bias to frame events in the manner of storytelling. We create stories and form a coherent understanding of the world through this biased framework. As a result of this, we create a coherent framework of the world through our own biased assessments and formulate our own causal relationships for why events happen. It shouldn’t come as a surprise that Gods or God itself is a concept of convenience for humankind as a result of looking for the causes of events. These examples can be seen in every religion. In polytheism, different Gods serve different aspects of human convenience from concepts such as a fountain goddess of luck in Rome, to a goddess of love in Hinduism, to a God of trickery in the Norse religion, to goddesses of death in Celtic religions, and to a God of either love or torment who helps people in mysterious ways in the Abrahamic faiths including the dualistic concept of God and the Devil. They are depictions of the human mind, the justifications for our actions, and the human biases that we have. \nWe use this framework of coherence in our understanding of history and the attachment we place upon historical figures that are similar to us; they help serve our desires for inspirational storytelling and our narcissistic impulse with how we draw similarities to them. An example of this is the stories of the Crusades. Depending on whether you are Christian or Muslim, you may attach yourselves to some of these heroic depictions in films, books, or television shows about the Crusades and liken yourself to one of the so-called heroes. But, were you aware that both the ancient Christian and Muslim warring factions practiced cannibalism and ate the people that they killed – including children? This wasn’t simply one side; it was both religious groups and the censoring of this significant historical fact displays a chief problem with religion. Similar to the apathy of first world peoples to the plight of the third world, religious people ignore the horrific acts in the name of religion for the sake of their own convenience. They ignore the barbarity for the sake of their own coherence to defend the view of religion being morally good for people. The negative history of their religion on the world is argued to be causes other than their religious teachings: the evil nature of humanity, the evil of politics, the instigation of the enemy, the mysterious will of God, and a multifarious amount of other causes. Typically, the popular justification is that false interpretations of the faith occur and cause violence; it is an appeal to purity, that is, an attempt at defending some perceived special and unique goodness of the religious faith. Apologists are willing to downplay, disingenuously misinterpret, and vilify attempts at highlighting horrific acts in the name of religion; to the extent that they ignore ongoing human rights crimes, ignore the victims of the past because they harm the positive coherence of religion, and may even come-up with a convenient notion that the victims are in a better place in the afterlife regardless. The lives and deaths of others become an abstract concept instead of a real event that has hurt real life people. The notion of victims finding peace in the afterlife only serves the convenience and narcissism of the religious believer. \nCriticisms of the religion itself can be obfuscated and ignored through the cognitive dissonance and convenience of certain religious principles. The argument from ignorance that God’s plan is unknowable serves the convenience of the religious adherent to ignore human rights abuses. Some religious believers try to dispense with their previous religious identity from their religious faith; often by arguing that their faith isn’t truly a religion and that they’re simply spiritual without identifying with the religious identity because of the negative connotations associated with it. This is consistent with the psychological act of substitution, in which people find alternative reasons to justify their beliefs or actions because of unwillingness to change and an apathetic disposition for the victims because victims are part of the out-group. To that end, people are self-centered because they are far more willing to ignore the victims for the sake of arguing for the purity of the religious faith. People simply don’t care because they’re unwilling to inconvenience themselves by examining their own beliefs.\nThe obfuscation and self-centeredness doesn’t exist strictly for religion; it can exist in lesser known cultural forms but it is most damaging in the context of religion because of how easily people ignore human rights abuses because it doesn’t fit into the positive image that they have about their own religious beliefs or those of their loved ones. \n\t\t\tThe Convenience of Good and Evil\nThe dualistic concept of Good and Evil creates a limiting and damaging worldview that ultimately harms people who believe it to be the truth; even the idea that there are small gray areas in a mostly good and evil framework is harmful because it is also an oversimplification. The concept of good and evil – above all other concepts – leads to extremism, xenophobia, bigotry, hatred, and mass murder. This is primarily because the dualistic concept of “Good versus Evil” is a framework and promotion of extremist ideology; this concept isn’t a safe and carefree ideology for children as is often touted via mass media and popular parenting ideas. It is a concept that compels people to hate and murder under a veneer of justice. The reason for these issues is due to our groupist mentality intermingling with the extremist ideology of absolute good and absolute evil. The idea of mostly good or mostly evil is self-damaging because people have anchored their viewpoints on an absolutist concept and given small concessions to what is still largely an absolutist disposition. When we apply these dual extremist ideologies to our fellow human beings that are different from us then we will always be generalizing them with a simplistic worldview. There are different degrees of how pernicious this concept is but the problem is the concept itself being flawed and instigating hatred toward others.\nApologists of the dualistic concept of Good and Evil are quick to point out truly horrific crimes as proof that the concept itself has merit: the Holocaust, an anecdotal account such as the gruesome death of a child at the hands of a pedophile, or terrorism. Yet, upon a deeper look, these show a shallow understanding of the consequences of believing in good and evil. The Nazis committed a mass genocide after a voluminous amount of religious and political propaganda condemning the Jews for being evil people throughout the history of Christian Europe; they used the economic crisis, the belief that the Jews were responsible for murdering Jesus Christ, and anecdotal stories to argue that Jewish people were a villainous and hateful group that ruined their country. The narrative of doing what must be done to protect the innate goodness of the German people were used to instill the idea, for German soldiers, that they were heroically going through hell and committing these atrocities to protect the goodness of the German public. A violent pedophile who made a child suffer probably emphasizes their other actions, perhaps such as giving to charity, to ameliorate themselves from their horrific sexual tendencies; they vindicate themselves of responsibility by telling themselves that they are a mostly good person. How can we know this? Because that is exactly what the national media does to protect their image and many pedophiles wearing religious garb had defenders who blamed the victims or found examples of a priest being a “good person” to vindicate their rape of children. Psychologists have found that terrorists, by and large, aren’t insane extremists but rather people who turned to violence after seeing their efforts through more peaceful means being ignored or violently crushed – such as peaceful protests or the judicial system being purposefully ineffectual. A terrorist would argue the innate goodness of their actions or possibly highlight how the foreign country that they’re trying to destroy committed more egregious acts of violence upon their people to justify their behavior. In fact, that has been done in the case of Iraqi insurgents; they justified the beheadings by blaming President Obama for beginning an initial bombing campaign that Wall Street and the US’s Gulf allies demanded of him to protect global economic interests.",
        "created_utc": 1437629517,
        "upvote_ratio": ""
    },
    {
        "title": "People are excited for the Pope, an anti-gay advocate and advocate for the poor, to visit congress. These same people shun anti-gay advocate and lifetime civil rights activist Fred Phelps.",
        "author": "SecularVirginian",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3e8cng/people_are_excited_for_the_pope_an_antigay/",
        "text": "Does anyone else see the hypocrisy in this?  The Pope has been very clear on his stance regarding same-sex marriage (he's against it).  He's also been a clear on his advocacy for the poor.\n\nFred Phelps was very clear on his stance regarding same-sex marriage.  He was also very clear in his support by being a civil rights activist  (winning an award from his local NAACP).\n\nWhat's the difference between the two other than Fred Phelps not being smugly condescending about his disapproval of homosexuality?\n\nHow can you think that Fred Phelps was bad because he voiced his opinion, but the Pope is good despite formally encouraging over a billion people to have the same opinion?\n\nI think it stems from people's refusal to accept that religion makes people believe and do things.  They refuse to accept that the woman who gives her life to helping the poor does that because her book tells her so, just like how it tells her that homosexuality is a sin.\n\nThey refuse to accept that Fred Phelps was fighting for what he believed the bible taught equally as much when he was defending disenfranchised minorities as when bashing LGBT people.\n\nMore pervasive than the stigma against atheists is the stigma that it is morally bankrupt to believe that religion can be a primary source of immorality.",
        "created_utc": 1437592059,
        "upvote_ratio": ""
    },
    {
        "title": "Protip for those wanting to break the ice with family about your atheism in a friendly way.",
        "author": "ethernetcord",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3e6e1y/protip_for_those_wanting_to_break_the_ice_with/",
        "text": "My family is very religious and I never brought up the topic of religion myself but when the topic came up once I basically interjected at an appropriate time something like this, and it went over very smoothly:\n\n\"Well I am a fan of Jesus but I doubt that the stories literally happened the way that they are told in the bible. But his message is still a good thing to strive towards whether those things literally happened or not, it doesn't really matter, I don't think.\"\n\nI got various questions of course, something like, \"If it didnt really happen then why would anyone follow the message? If it's just another story what's the point.\"\n\nWhich I answered along the lines of, \"Because it sounds like a good way to live, being honest and peaceful, loving your enemies, being charitable and humble, etc. If you are just looking at him and thinking 'well shoot I better live this way or else I'll be smitten and sent to hell and all that' then you aren't following for the right reasons anyway. Just looking at the stories and the message makes it clear to me that living life in that fashion would be a good thing to do and be worth striving for.\"\n\nOther questions I remember getting were, \"why celebrate Christmas\", which I went into because the message of 'peace and goodwill towards man' is worth taking a day to remember plus most the things we love at Christmas aren't even Christian anyway such as Santa and egg nog and reindeers and so forth. Another question was \"well then where do you think the universe came from\", which I simply stated that I didn't pretend to know but ultimately it doesn't really matter, we are here now, lets make the most of it.\n\nYes this method does take a bit of pandering to their feelings which I know many people don't like, but hey, that is why I said a \"friendly\" way. It doesn't make you come off looking like a know-it-all or attacking their beliefs, it's a way to come away with mutual resepect and understanding. So if you are wanting a way to show them they are wrong or deconvert them, this isn't the option for you.\n",
        "created_utc": 1437554236,
        "upvote_ratio": ""
    },
    {
        "title": "I have a desire to discus religion with Christians.",
        "author": "madmonkey12",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3e6dav/i_have_a_desire_to_discus_religion_with_christians/",
        "text": "I'm an athiest but I was raised by a very Christian family. We almost never discussed religion. I guess there was no need since we were all on the same page and the pastor talked for us. It wasn't until senior year of high school that I started to think for myself.\n\n One day a professor in college asked us a simple question. Do we think a dead baby would go to heaven or not. He just sat to the side and watched us argue. He never explained how it was remotely relevant to a Shakespear class. Now I think he was just trying to make us realize how none of us have any idea what we are talking about. \n\nThe room was pretty evenly split. I remember saying that getting into heaven was based on accepting Jesus and a baby doesn't have the ability to do that so obviously the baby would go to hell. It seemed a perfectly logical thing to say until it actually came out of my mouth. Did I really believe that stuff? \n\nAfterward I talked to a friend who sat it out because he didn't have an opinion. He said, \"It's alright. You just know that stuff. Right?\" I felt the most uncomfortable feeling ever, cognitive disonance. I told him \"No I don't, you can't just know something, you have to have a reason.\" \n\nFor the next month I slowly observed my own belief system and realized it was a mess. The only thing holding up my belief was fear and pascals wager and one day I sort of realized how silly that was. This was a few years ago. I couldn't be happier that I got religion out of my life. Everything is so much clearer now. \n\nEventually my friends and family noticed that I no longer believed. I never mentioned it but I wasn't hiding it either. The problem is, non of my friends or family seemed to care. They just accepted me for who I am. That's great and all but now I have this pent up desire to talk about it. I enjoy debate for the sake of it and I really want to share my side and maybe make up for the fact that I have only ever talked about how Jesus is love and that kind of nonsense. I don't actually expect I would change someones mind but If I could give them a different perspective or strengthen their critical thinking skills that would be wonderful. Even if they got angry about it that would be pretty entertaining provided it isn't someone I care about. \n\nSo far I coped by listening to debates and call in radio shows such as The Atheist Experience but that doesn't seem to cut it any more. Where can I go to have an educated discussion about religion and the bible with a Christian? You might say the internet but that doesn't seem personal enough. You might also say door to door evangelists but they have never come to my door when I was home God damn it!\n\n**TLDR**: Everyone I know seems to have no interest in talking about religion. Hello people? You think your loved one is going to burn in hell for ever. Don't you want to talk about that? or... something?",
        "created_utc": 1437553579,
        "upvote_ratio": ""
    },
    {
        "title": "I think about God more frequently while atheist than I ever did while theist.",
        "author": "dommitor",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3e5bbk/i_think_about_god_more_frequently_while_atheist/",
        "text": "When I was younger, I believed in God, but I rarely thought about the divine or supernatural on a day-to-day basis. I noticed that the past few years, following my deconversion, I tend to think quite frequently about religion and the people who adhere to it.\n\nSome theists would likely pin this on an idea of God trying to make himself known to me; however, I pin it on a culture around me that is hostile to atheism and always reminding me that I am part of an outcast subculture. Does anyone else experience a recurring focus on God that is unparalleled by their theist days?",
        "created_utc": 1437530181,
        "upvote_ratio": ""
    },
    {
        "title": "ABC aired an episode of \"What would you do?\" In which an athiest is harassing a group of people praying.",
        "author": "Mexicantdie",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3e4hnu/abc_aired_an_episode_of_what_would_you_do_in/",
        "text": "",
        "created_utc": 1437516022,
        "upvote_ratio": ""
    },
    {
        "title": "How to deal with your beliefs being oppressed or being atheist-shamed.",
        "author": "NickelBack_Lover_69",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3e20k0/how_to_deal_with_your_beliefs_being_oppressed_or/",
        "text": "",
        "created_utc": 1437473291,
        "upvote_ratio": ""
    },
    {
        "title": "What are they hearing when they pray?",
        "author": "MicooForYou",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dyx3w/what_are_they_hearing_when_they_pray/",
        "text": "Part of the reason I lost faith in God is because I never heard his voice during prayer. I remember that I would sit around for almost an hour saying things in my head, waiting for a big voice or small whisper to tell me something that was important for my life. This never happened. And as time went on, I eventually stopped praying and now I am an atheist. \n\nHere's my question: What then are people hearing during prayer when they say that they hear God's voice? I went to a Catholic high school and I was a retreat leader so I know a lot of religious people; when I talked to them about prayer, they would always tell me about \"hearing the Lord's voice\" or \"feeling the gentle breath of the Father.\" And the thing is, these people aren't stupid and they are not schizophrenics suffering from auditory hallucinations. And even if they were dumb as rocks, they should still be able to recognize their own \"thinking voice.\" What do you guys think? What are they hearing?",
        "created_utc": 1437414064,
        "upvote_ratio": ""
    },
    {
        "title": "Having young children with a religious ex-spouse",
        "author": "th3STlG",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dyb8d/having_young_children_with_a_religious_exspouse/",
        "text": "Decently complex situation, but I bet it is more common than I anticipate.\n\n**TL:DR:**  Ex wife is extremely devout.  I am extremely atheist. 5 year old has be attending church and VBS with mother.  How to handle?\n\nThe full story is, I thought I could look past the religion in the beginning, and I went and appeased her and did what a idiot would do.  But that is all over and the marriage was dissolved.  Now that our daughter is 5 and pretty intelligent, her mother takes her to church and other religious activities on her days, while on my days we just do the typical things like play games, read and I try to teach her about neat concepts that are simple but mind blowing (recently it was vacuums).\n\nI am at a point to where I think it is time to properly intervene on this whole \"My dead PaPa is with God in heaven\" stuff and time to stop the indoctrination.  The problem is how to go about it without breaking her fragile little mind.  \"God doesn't exist\" I think is far to harsh and complex for her.  How many questions would run through her head about why she is being told that. About why Mommy says he does exist.  And so on.\n\nAny ideas on approach here, or would you guys let it go a little longer and just keep introducing her to scientific stuff.  Maybe casually talk about all the other religions and maybe just drop the hint that they all think they are right?  When I was younger that was a big solidifying fact that religion was absurd, and maybe it could help her out in making her own conclusions.  As we like to say, \"Education is the best defense against religion.\"  Or I do anyway. \n\n**EDIT:** I really want to thank every that has commented.  Very supportive and informative.  Another reason why I came over here from the original sub.  You guys are awesome.  Plus have a list of books to check out.  If anyone else is interested in the topic here they are:\n\nRichard Dawkins - The Magic of Reality\n\nDale McGowan - Raising Freethinkers\n\nDale McGowan - Parenting Beyond Belief\n\nGene Weingarten - Me &amp; Dog\n\nRick Riordan - Any of his books on Gods (Make sure to point out their flaws)\n\nThanks so much again guys.",
        "created_utc": 1437404725,
        "upvote_ratio": ""
    },
    {
        "title": "I want to memorize some bible quotes to use in debates. Suggestions?",
        "author": "SouthernTeapot",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dxjfk/i_want_to_memorize_some_bible_quotes_to_use_in/",
        "text": "",
        "created_utc": 1437388459,
        "upvote_ratio": ""
    },
    {
        "title": "Saw another play, and boy was it something else. Here's my take on \"Hand to God.\" [Spoilers]",
        "author": "Mainstay17",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dwxle/saw_another_play_and_boy_was_it_something_else/",
        "text": "*Hand to God* takes place in a small town in Texas, where three teenagers have made puppets to put on a show for their church. Jason, the show's main character, loses control of his puppet Tyrone, who embarrasses him in front of a girl whom he secretly likes.\n\nTyrone takes on a life of its own, talking to Jason (through Jason's own voice) and persuading him to go on with what he convinces him are Jason's own evil desires. They then head back to the church, tear another kid's ear off, and paint satanic pictures on the walls. Eventually the conflict (it's deeper than this, but I'm skipping over it since it's not relevant) is resolved and Tyrone the puppet is destroyed.\n\nThe puppet is a metaphor. The show's pastor believes it to be possessed by Satan. But Tyrone himself explains in the beginning and end of the show - Satan is only an invention of Man. It's a convenient way to get past the ideas of 'right' and 'wrong,' so that a person can damage their community all they want and get away with it - after all, the Devil made them do it.\n\nI think this is what makes/made religion so attractive to people. Not just the ability to ascribe wrongdoing to Satan, sacrifice a sheep and be free of all sin, but the whole cop-out mentality in general. Prayer comes to mind - pray, and God will heal your sick relative ([unless, of course, they're an amputee](http://whywontgodhealamputees.com/god5.htm)). Pray, and God will strike down ISIS. Satan is just one facet of this mentality, and it's hardly the most dangerous. Because if you are taught that if you close your eyes and clasp your hands together then the world will be healed, you have no incentive to go out and heal it yourself.",
        "created_utc": 1437370247,
        "upvote_ratio": ""
    },
    {
        "title": "Just ran into an interesting argument on twitter.",
        "author": "SeismicAltop",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dvuw4/just_ran_into_an_interesting_argument_on_twitter/",
        "text": "I saw this tweet.  \n\"If God does actually exist it likely occupies a much higher dimension altogether. Atheists and theists alike need to stop personifying God.\"  \nIt's not even really an argument. Just a statement. The one thing that bothers me is that it leaves atheists in a silly, paradoxical spiral. We refute the theist point of view by using their personify in logic against them, but then we are scolding for using that logic. What do you think?",
        "created_utc": 1437348535,
        "upvote_ratio": ""
    },
    {
        "title": "I made a deal with 'God'. Now I need to pay up. What should I do and why did I do what I did?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dv3rn/i_made_a_deal_with_god_now_i_need_to_pay_up_what/",
        "text": "",
        "created_utc": 1437334691,
        "upvote_ratio": ""
    },
    {
        "title": "Should I renounce my baptism?",
        "author": "1283619264",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dtw9m/should_i_renounce_my_baptism/",
        "text": "(A bit of a rant) My family is Roman Catholic but I have been atheist since pretty much 12 if not earlier, I am now 16. My family is forcing me to be a godfather for my half-sister, they know I am an atheist but seem to be quiet dismissive of that fact as if it's \"just a phase\". I have been thinking about renouncing my baptism as I really just don't want to be considered as part of that cult, but doing so might make my mother offended. I often feel like I am being pressured to do what they do, it makes me quiet angry. Question is should I make an official renouncement and risk offending my mother?",
        "created_utc": 1437309289,
        "upvote_ratio": ""
    },
    {
        "title": "I'm an atheist \"SJW.\"",
        "author": "Desecr8or",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dtbto/im_an_atheist_sjw/",
        "text": "",
        "created_utc": 1437288144,
        "upvote_ratio": ""
    },
    {
        "title": "A Christian asks you \"Why are you an athiest?\". What's your go-to response?",
        "author": "Harley-the-Harlot",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ds295/a_christian_asks_you_why_are_you_an_athiest_whats/",
        "text": "",
        "created_utc": 1437258401,
        "upvote_ratio": ""
    },
    {
        "title": "According to the Kalam Cosmological Argument, you're dead. [Humor]",
        "author": "InfintySquared",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dpmov/according_to_the_kalam_cosmological_argument/",
        "text": "",
        "created_utc": 1437198584,
        "upvote_ratio": ""
    },
    {
        "title": "I get why now",
        "author": "profgray2",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dp5bg/i_get_why_now/",
        "text": "Over the last week, I delt with the fear and worry of a cancer scare. Being an atheist, I delt with it by looking at the odds and the possible treatments involved. \n\nMy wife is a Christian, as is my mother, and several family and friends. While I am not an in your face type of atheist, it is known by most that I am not a believer. \n\nDuring this week, I heard over and over again, we are praying for you.  And the question how are you doing. \n\nIt seemed that no one could understand why I was so calm. And when I tried to explain my thinking, they all got this far away confused look on their faces.  \n\nI often heard the same time, God will be done. \n\nJust today, I got my results in.  Precancerous polyp that was removed, and the problem was in fact a minor hernia. The doctor said that if it had not been found now, by the time normal screening would have occurred In my early 50s,it would have been cancer. \n\nMy family and friends all say it was God looking out for me, of course I realize that it's just a matter of odds,  I happened to fall on the right point in the bell curve. \n\nNow  none of these events have changed my belief at all. But I now understand emotionally what I have often know intellectually, religious belief is little more than a soothing lie told to those without the intellectual and emotional strength to handle a life of random events. \n\nThe reaction of every one around me seems to be the same,  I told them the odds, I delt with it with little stress or fear, yet every one seems to feel that God reached down and held me up, (almost the exact words my mother used). \n\nNow I get why they cling to there beliefs,  it's not that they have been lied to there entire life,  it's  not that they are unable to understand it. \n\nIt is just they do not have the strength of will and mind to face the random nature of the world. They need to believe that there is a reason for the chaos, they need something to put there faith in, because they just can't face it alone. \n\nSo I nod my head, say thank you for the prayers, and start to eat a bit better. Because I do have the strength to face it. \n\nLet the believers cling to there illusions, if they find solice, so be it. \n\nMe,  I have to get more exercise...",
        "created_utc": 1437187670,
        "upvote_ratio": ""
    },
    {
        "title": "should i be a atheist?",
        "author": "mdsearcy999",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dowdf/should_i_be_a_atheist/",
        "text": "",
        "created_utc": 1437182695,
        "upvote_ratio": ""
    },
    {
        "title": "Sam Harris- The Problem with Atheism [01:06 video]",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3do77x/sam_harris_the_problem_with_atheism_0106_video/",
        "text": "",
        "created_utc": 1437169478,
        "upvote_ratio": ""
    },
    {
        "title": "should i be an atheist",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dno0f/should_i_be_an_atheist/",
        "text": "hellow,i am a atheist and i have been looking into my religion and others like it and have very resently looked into atheism and i ahev noticed something,almost all scientists are atheist and i have a question,does science really support atheism?and if it does what sciences support it?",
        "created_utc": 1437160638,
        "upvote_ratio": ""
    },
    {
        "title": "How do you debate with christians?",
        "author": "Lkira1992",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dnmqc/how_do_you_debate_with_christians/",
        "text": "Every time I try and show them proofs that YHWH is mix of different gods like Baal, Aton and others they always tell me that it does not matter and that I am sinning or lying.\nWhen I tell them to read a book about the origin of YHWH, for example History of God by Karen Armstrong, in which she shows archeological evidence of how YHWH was created, they always do not care to read it or tell me that it's all made up.\nHow do you make your evidence count? I like to debate with them but it seems like it goes nowhere and nobody really cares. ",
        "created_utc": 1437160081,
        "upvote_ratio": ""
    },
    {
        "title": "should i be an atheist",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dnm27/should_i_be_an_atheist/",
        "text": "hellow,i am a atheist and i have been looking into my religion and others like it and have very resently looked into atheism and i ahev noticed something,almost all scientists are atheist and i have a question,does science really support atheism?and if it does what sciences support it?",
        "created_utc": 1437159792,
        "upvote_ratio": ""
    },
    {
        "title": "Where the authors of the bible trying to bring their community (the jews) out of oppression through the belief in a God that fights for them",
        "author": "CaptainClittie",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dnlk2/where_the_authors_of_the_bible_trying_to_bring/",
        "text": "Ive noticed that the old testament favors the jews a lot but the new testament claims jesus came to save all humanity.\nAlso the fact that the jews dont believe jesus ever came. \nThis is why i feel i have reason to believe the authors of the jewish old testament with the laws of moses and the commandments is a way of motivating morality and action against the oppression that the jews were going trough and had nothing to do with salvation and hell. ",
        "created_utc": 1437159566,
        "upvote_ratio": ""
    },
    {
        "title": "should i be a atheist?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dniyx/should_i_be_a_atheist/",
        "text": "",
        "created_utc": 1437158393,
        "upvote_ratio": ""
    },
    {
        "title": "What are the best books/blogs/websites/resources for someone leaving Christianity?",
        "author": "burmah",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dmv1t/what_are_the_best_booksblogswebsitesresources_for/",
        "text": "Hey guys,\n\nA week or so ago, a friend of mine contacted me asking for help leaving the faith. I did so around four years ago after a lengthy (3 year) internal battle. I did a great deal of reading and researching during that time, but after I came to my decision and sat with it for a year or so, I finally put it to rest. I've essentially steered clear of that discussion since then (for my own mental health), and sold many of the books/forgot the websites I utilized during that time.\n\nDo you have any resources that you turn/turned to on this topic? What books did you read? Which blogs and websites did you frequent? It's worth mentioning that my friend and I come from a neo-reformed background, served as missionaries overseas together and worked in ministry for several years. She will easily ignore anything that puts it too simply. By that I mean that some people can, in a few short words, explain what is illogical about Christianity. She, like I did when I left, will want extensive readings and discussions that objectively address the problems with Christianity. We were both heavily brainwashed as children, so there are several checks and balances we have to go through in order to truly hear something. I still turn to some of the stuff I read when I first started questioning, but at the time, I refused to accept it. (For instance, Nietzsche has some 'one-liners' that are so simple, yet so profound. It took me three years to appreciate them because the noise in my head said to dismiss him. It took reading the entirety of the AntiChrist to finally consider his thoughts.)\n\nAnyways, thanks ahead of time to all who respond. We both live in Bible Belt Texas, so the pressure to remain in the faith is strong, and doubt leaves one feeling fairly isolated down here.\n\nEDIT: Sorry for the delay, guys. Two people quit at work and I just had the craziest time filling in several shifts. My phone updated me on your comments, however, so thank you!",
        "created_utc": 1437147636,
        "upvote_ratio": ""
    },
    {
        "title": "Omnipresence is self-defeating to Christianity.",
        "author": "sprawn",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dlxy9/omnipresence_is_selfdefeating_to_christianity/",
        "text": "Omnipresence, if the Christian God is claimed to possess it, calls into question the sincerity of any Christian believer. If you asked a Christian if he or she were willing to commit a very small violation while being observed by the Police (say, changing lanes without signalling) they will tell you that they would not. They know they are being observed, and they know that there is a potential penalty for commission of the crime. Yet every Christian will easily admit that they commit crimes right in front of God all the time. They admit that they sin.\n\nNow. God is a much better observer than the Police. God is observing you commit the sin *from inside your own head.* Most Christians believe that the triple God of Father, Son and Holy Ghost are  all omnipresent. So, according to their own definitions, as the Romans were nailing Jesus to the cross Jesus was *watching you sin.* He was watching *all of your sins.* He is doing this *all the time,* somehow. Anyway, there is no need to go too far down the path on how absurd that is. They (allegedly) believe that God sees (smells, tastes, touches and feels) *everything from every perspective.*\n\nSo, given that you won't change lanes without signalling in front of a mortal, comparatively powerless Police Officer, what does that say? You will commit sins in front of an omnipotent, omnipresent creature that will torture you for all eternity for an errant thought. You will do it all the time. But you won't change lanes without signalling in front of a cop? What that says to me is *they don't believe their god is omnipresent.*\n\nAnd then they claim that they believe in forgiveness and grace. Then why not sin on a whim? Is not God's grace and forgiveness infinite? If so, then you are in the clear! They don't believe *that either.* The inconsistencies are glaring. I don't know how they square it.\n\n",
        "created_utc": 1437127006,
        "upvote_ratio": ""
    },
    {
        "title": "Will education eradicate religion?",
        "author": "Rationalizationer",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dlckl/will_education_eradicate_religion/",
        "text": "In the Genesis creation myth, is the Tree of Knowledge of Good and Evil in the Garden of Eden comparable to science, enlightenment, reason, or the search for knowledge?  In the myth of Adam and Eve, avoiding the tree was keeping them in a complete state of blind faith. Faith in a religion is often strong mainly by avoiding anything that questions it.  This has been pushed countless times by religious leaders over thousands of years.  Young Earth Creationists, Christian homeschoolers, and pastors will often advise that parents raise their children sheltered, even isolated as much as possible from the influences of the world, lest their children \"lose their faith\". \n\nIt is somewhat telling that so early in the Bible, we have an example of the need to isolate or shelter oneself from certain knowledge.\n\nWhy is it that knowledge is what needs to be avoided?  Adam and Eve were told to avoid knowledge of good and evil.  Children isolated from knowledge of science and critical thinking.  There is plenty of material and resources geared toward home schoolers or Christians that teaches science, but so often that \"science\" is incredibly biased toward Christianity that it discourages critical thinking.  This science is not for learning new knowledge, just to reinforce what the children have already been taught.  Young Earth Creationism science takes what is \"known\" from the bible, and fits the evidence to the bible.  What does it say about faith that isolation from knowledge is encouraged, lest that knowledge destroys faith?\n\nQuestions\n\n1. Is education and knowledge the greatest threat to religion?\n\n2. a.  Looking at how far humanity has come, might there ever be a time that education will eradicate religion?\n\n2. b.  Will we always have a significant amount of people who would rather have blind faith instead of critical thinking, or will they diminish into a small minority?\n\n3. Is it possible that the section about the Tree of Knowledge of Good and Evil in Genesis was written to specifically discourage people from seeking knowledge?\n\nEdit.  Thank you to all that replied to my post.  Significantly more people replied than I expected.  Many great points were made, and some of my opinions have changed.  I was a Christian, and an extremely conservative one at that.  About 4 or 5 years ago I started out to try and \"prove\" Christianity, but I ended up dropping my faith altogether.  It was mostly a result of being unsatisfied with the arguments and \"proofs\" for Christianity and Young Earth Creationism.  I really only started reading on Atheistic views about a year ago, and it was the final \"nail in the coffin\".  Being open minded played a huge part, and it's funny, I was open minded because when I was a Christian, I assumed the truth would come out on top.  It did, only not how I expected.\n\ntl;dr  Education can defeat religion, but an open mind is vital.  Also, I may be too optimistic about people changing their views on religion when presented by facts because of how the facts changed me.\n\nEdit 2  Education can defeat religion.",
        "created_utc": 1437109740,
        "upvote_ratio": ""
    },
    {
        "title": "It makes me so, so sad to here this man's story. He was in the mormon church for 50 years, has 14 children, 10 of them cut them out of their lives because he resigned from his church and is now atheist.",
        "author": "margulisg",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dl1f1/it_makes_me_so_so_sad_to_here_this_mans_story_he/",
        "text": "",
        "created_utc": 1437103091,
        "upvote_ratio": ""
    },
    {
        "title": "So i am going to have \"the talk\" with my local priest...",
        "author": "sai_ismyname",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dhtoh/so_i_am_going_to_have_the_talk_with_my_local/",
        "text": "After years of non-believing and beeing an Atheist i found the time to make it offiicial.\nIt is common practice, that you get a letter from your local church where they invite you to a personal talk.\n\nI am honestly planing on taking this talk and show the priest what kind of outdated view the church has\n\nany suggestions which topics i should bring up or which passages of the bible i should read ?\n\nEdit:Thank you for all your responses, i decided not to go since i don't see a reason for it now.\nYou all mentioned some interessting points which made me think about arguing with religious people in general.\nIt was really interessting reading all of the comments.\n\nThank you",
        "created_utc": 1437047042,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure how to feel about this",
        "author": "Drysaf",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dgwwl/not_sure_how_to_feel_about_this/",
        "text": "So I have a blog on tumblr about atheism (yeah yeah, I know, but I decided that I wanted to be more open with my atheism without family and certain friends finding out, plus I figured why not.) When I dicided to start it, I let a few of my non religious friends know since I felt comfortable with them knowing. Even let my Catholic boyfriend know. Sometimes, I would work on a post and we would be hanging out and I would say \"Drysaf's bf, I just finished this post, want to read it?\" He always would (I only offered since I was working on it, never to change his opinion, just to be clear). One day, we were having casual conversation and I mentioned my blog. And he knew exactly what I was talking about. Turns out he reads my blog on his own which surprised me and weirded me out a little. \n\nIt makes me feel bad because if the roles were reversed, I wouldn't read his Catholic blog on my own. If he asked me to read it, I would, but I don't think I would read it on my own continually. I feel like I would run into a topic that I take personally and get upset. It makes me feel like a dick to be honest.\n\nMy boyfriend takes his beliefs very seriously, and I respect that. It feels like he supports my atheism, but I wouldnt support his Catholicism. It feels like I should open myself more.\n\nWell, thanks for reading. Not quite sure if this topic fits under this subreddit, it seems too personal. \n\nEdit: typo\n\nEdit 2: realized that I didn't make clear that I'm asking for advice. I am. I want to know if I'm being closed minded about other viewpoints.\n",
        "created_utc": 1437021050,
        "upvote_ratio": ""
    },
    {
        "title": "Why am I persistently regarded as an asshole for being a non-believer?",
        "author": "honestblackman",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dga1n/why_am_i_persistently_regarded_as_an_asshole_for/",
        "text": "I was raised a fundamentalist Christian. To put myself back into the shoes of a believer, the reason why I would have thought that atheists were assholes was precisely because I felt as though they were a threat to me and my way of life. When I was religious, it captured my heart, my mind, my perspectives, my actions, almost every aspect of my life. I was encouraged to be open, to proselytize, to actively recruit and engage people on the Lord's Holy word. This was seen as a good thing. The people around me felt a profound need to reinforce their faith by wearing it outward with pride, as well as shoving it down other peoples' throats. \n\nBut when I was introduced to alternative thoughts on religion, theology, and the like, it had a profound influence on me, ultimately leading to my disbelief. When the entire rug of my life was swooped from under me, it was a rather jolting experience, and for reasons that many might relate to I was angry. I wasn't angry at the world, or even the people who raised me in Christian thought. I was angry because I was realizing that I had been lied to (unintentionally), realizing that I had been dedicating my life to a sham, and recognizing that the things I once believed in weren't real. And Holy Fuck, where was the support? During this phase of my life, I was encountering people who had never been religious in their lives, and they were telling me and others like me that we're assholes - all the same things I would have said to an Atheist when I was religious. Suddenly openly acknowledging my disbelief and being honest about my feelings was leading both the religious and the non-religious to tell me to shut up about it. No, I wasn't going out of my way to debate people who didn't want to. Sure, I may have gotten into scuffles here and there, but it wasn't something I was trying to just shove people's faces into. Incredibly though, those atheists whom had never been religious in their lives (it seemed) were suddenly shunning people of my experience as if our feelings were wholly irrelevant. Why? This is something I still can't seem to wrap my head around.\n\nSuddenly, I was faced with \"you give atheists a bad name\", \"you are just a condescending asshole,\" \"You shouldn't challenge people's beliefs. Why can't you just let people have their beliefs?\" \"Why do you have to be an arrogant dick?\"\n\nNo, I didn't (and still don't) have the same oral skills as Matt Dillahunty or Sam Harris or Hitchens, but it wasn't like I had those skills when I was religious either. Why is it that when I was religious, being openly and overtly religious was seemingly acceptable by both parties, but suddenly when I'm a non-believer I need to keep my fucking mouth shut - even by Atheists who may not be as passionate about their life experiences as me?\n\nAside from those forums where debate is welcomed, which I seldom post to, it seems that if I may even identify as a non-believer (with nothing else added) in some happenstance relaxed setting, I'm suddenly perceived as a rabid wolf dog who will chew a person out at any mention of the word \"god\". \n\nWhy is this?\n\nBest,\nHonestblackman",
        "created_utc": 1437009009,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't think i'd ever not be a christian because atheism is nihilistic\"",
        "author": "LegendaryJay",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3deav6/i_dont_think_id_ever_not_be_a_christian_because/",
        "text": "^(I know for a fact this question must have probably been answered a million times before on this sub, but i guess i'm blind or something. Sorry if i am being redundant)\n\nBasically this has been said to me by nearly all Christians. I have no idea what to say to this. Usually when i ask *why* an atheist would be a nihilist, they don't answer or they say \"because you don't believe in god.\" Why do so many Christians carry this idea? Is it at all true? Isn't Christianity equally nihilistic? I truly am not trying to make a point, but asking questions no one will seem to answer and one that i don't feel comfortable asking others.\n\nMy answer is this- I mean in the scope of everything, sure, everything is meaningless, i'll reluctantly admit. Making you smile today means nothing thousands of years from today, sure, but doesn't it at all matter now what happens now? No single raindrop feels responsible for a flood, but without raindrops a flood wouldn't form. The things that we do that 'Don't matter' usually form something much bigger than ourselves. Not only that, but even if i can't make the world smile, i can make you smile. Doesn't that matter to you now? Doesn't someone's smile make your day a little better? So then the smile i give you may just touch the person next to you, and then the person after that. We do things that ripple outwards in ways that we don't know and cannot predict and the effect the now.\n\nTheir response to this is usually, \"ya, but i don't want to be a nihilist.\" This begins the \"why would you be?\" \"because i'd be an atheist\" downward spiral and we speedily arrive nowhere. Am i missing something? \n\nAlso, are you guys a nihilist? Do i have a misinformed understanding of what nihilism is and means to others? ",
        "created_utc": 1436977764,
        "upvote_ratio": ""
    },
    {
        "title": "\"Non-Christians cannot be truly happy\"",
        "author": "killing_buddhas",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ddl4c/nonchristians_cannot_be_truly_happy/",
        "text": "I'm currently in a discussion with a Christian who believes that it is a fact that *only* Christians (and only those in a subset of denominations) can be truly happy. He defines \"truly happy\" as having a happiness and joy that persists through profound personal tragedy.\n\nOf course I don't think that there are zero people outside of his definition of Christianity that have this kind of happiness. This seems silly. But he says that if he met a Mormon who said that they were truly happy, then that person must be lying.\n\nWhat would you say to this person?",
        "created_utc": 1436965402,
        "upvote_ratio": ""
    },
    {
        "title": "On Homosexuality and God - Does my view essentially lead to belief that there is no God?",
        "author": "AngelDustnBones",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dd6zc/on_homosexuality_and_god_does_my_view_essentially/",
        "text": "These are my rather simplistic perhaps childish viewpoints , a flowchart so to speak.\n\n1. Is Homosexuality a choice? \nThe answer can be varied but the general consensus is that homosexuality is not something that a person can choose.\n\n2. If it isn't a choice then we'd have to agree that homosexuality was created by God. \n\n3. So God basically made some of us homosexuals, hence sinful by birth. Now if it is a sin can it be cured? The answer in short is no.\n\n4. So if it cannot be cured then has God condemned homosexuals to a life of sin? What are the alternatives? abstaining from homosexual acts? If yes\nthen what kind of life is it that God has made for a homosexual!\n\nSo basically that's a very cruel God ain't it? Hence just one of the reasons why I'm an atheist. \n\nAt which point in my arguments  will a Christian point out a flaw in my reasoning above?\n\nThoughts? ",
        "created_utc": 1436955223,
        "upvote_ratio": ""
    },
    {
        "title": "Bible and archeology?",
        "author": "therationale",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dd6jg/bible_and_archeology/",
        "text": "",
        "created_utc": 1436954826,
        "upvote_ratio": ""
    },
    {
        "title": "bible an archeology ?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dd5jx/bible_an_archeology/",
        "text": "while I'm mostly interested in Koran however I couldn't find any good books on Koranic archeology , so I thought I could read Biblical studies and then cross reference them with similarities in the Koran, where should I start , any good books? \n\noh ,sorry I meant bible **and** archeology. ",
        "created_utc": 1436954045,
        "upvote_ratio": ""
    },
    {
        "title": "In a series of studies in 2005 and 2006, researchers at the University of Michigan found that when misinformed people were exposed to corrected facts in news stories, they rarely changed their minds.",
        "author": "AmiriteClyde",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dc4ew/in_a_series_of_studies_in_2005_and_2006/",
        "text": "",
        "created_utc": 1436928971,
        "upvote_ratio": ""
    },
    {
        "title": "Let us imagine that the theories of multi-dimensional space and multiverses are true then could this argument be valid",
        "author": "plasticpony256",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dbu1i/let_us_imagine_that_the_theories_of/",
        "text": "",
        "created_utc": 1436923990,
        "upvote_ratio": ""
    },
    {
        "title": "My dad believes we are living in the end times, Help!",
        "author": "Michaelnom",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dblp0/my_dad_believes_we_are_living_in_the_end_times/",
        "text": "My dad has become increasingly convinced that we are living in the end days and sincerely believes that he will see the end of the world in his lifetime based on his interpretation of biblical prophesy and the current state of the world as he sees it. I know that people have pretty much been saying this for the past 2000 years but im having a hard time finding websites/books that catalog this. Just throwing names of people who have falsely predicted the end of the world (Harold Camping, Benny Hinn, etc) falls on deaf ears because he thinks those guys are crazy(it's all fucking crazy). What I would like to find is why/how these people throughout history used scripture and their current events to come to this conclusion. I feel like my dad would respond to this type example. He may be too far in to come back to reality, but I love him and I figured I'd try one more time before just asking him to stop talking to me about it, as it's starting to drive me insane. Any resources would be great! ",
        "created_utc": 1436920071,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of scientific facts found in the bible way before their time?",
        "author": "JorSum",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dbcjs/what_do_you_think_of_scientific_facts_found_in/",
        "text": "",
        "created_utc": 1436915812,
        "upvote_ratio": ""
    },
    {
        "title": "Progressive atheists... do you believe the Pope Francis' focus on inequality has any positive role to play in the movement to address the excesses of global hypercaptialism?",
        "author": "Mr_Subtlety",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dats9/progressive_atheists_do_you_believe_the_pope/",
        "text": "Obviously the Catholic church hardly has a leg to stand on historically talking about the abuses and inequalities suffered due to capitalism, but then again, Francis is almost without question the most prominent world figure to take on these issues in a deliberate and sustained way (See, for example: [this article] (http://www.washingtonpost.com/news/acts-of-faith/wp/2015/07/14/pope-francis-is-not-a-marxist-but-make-no-mistake-he-will-challenge-the-worlds-leading-capitalist-power/) ). Is it worth considering the head of the Catholic church as a potential ally here, or are the divides between progressives and other church doctrine (birth control, exorcism, etc) too great? How should progressive atheists respond to Francis' agenda?",
        "created_utc": 1436907603,
        "upvote_ratio": ""
    },
    {
        "title": "The philosophy of Friedrich Nietzsche and how it can apply to you.",
        "author": "-Ecce_Homo-",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dagkl/the_philosophy_of_friedrich_nietzsche_and_how_it/",
        "text": "I'd like to talk to you for a bit about the philosophy of Friedrich Nietzsche. What I really would like to do is go over his core philosophy and talk about some main ideas that occur repeatedly throughout his work. Nietzsche viewed the true nature of philosophy as being something that every man must grapple with, not something that is unreachably lofty and academic. This is not to say that academic study is ineffectual, but rather, that philosophy must be fundamentally indebted to the practical concerns of life. As a result, Nietzsche was highly critical of several  influential philosophers of the past, who he felt had perverted philosophy by detaching it from life.\n\nAt the heart of Nietzsche's philosophy is a redefinition of truth itself. Nietzsche expressed extreme dissatisfaction with religion and belief in God. He often raises psychological, evidential, and logical arguments against belief in God and religion. As a result, Nietzsche saw atheism as the reasonable conclusion to be drawn. Now, it is certainly of value and significant that one reaches the conclusion of atheism. However, it is another issue entirely to understand the implications of such a position. Religions bring with them a prepackaged meaning of life and a guidelines for how to live. Atheism is ultimately the negation of such a construct. It is not only the negation of a single religion, but also of all religions. Once this is realized, the natural result is that life is drained of meaning and purpose. The resulting perception of meaninglessness is called nihilism. The angst and despair that comes from nihilism is explored through \"[The Parable of the Madman](http://www.historyguide.org/europe/madman.html)\" in Nietzsche's book, *The Gay Science*.\n\nBut Nietzsche saw such a result as unacceptable. His solution was what he termed \"active nihilism\": to unequivocally affirm life. But what exactly does it mean to affirm life? Well, first off, we need to examine a few aspects of what it means to experience life as a human. Nietzsche saw a fundamental flaw in thinking grounded by purely rational thought. To Nietzsche, rationalism is an improper and flawed way of approaching life. Instead,  Nietzsche viewed sensory experience as being the sole source of a meaningful existence. Therefore, in order to embrace life, one must embrace their experience. Nietzsche regarded Plato's theory of forms, the idea of an unchanging non-sensory world, and the idea that the human senses are fallible as denying the value of life, because they reject the very essence of what it means to experience. To deny the senses then, is to deny all value in life. In contrast, by valuing the senses, a man is able to own himself and stay true to his own experiences. Christianity, Nietzsche points out, denies the senses by believing in a non-physical, non-sensory world. This, to Nietzsche, is the epitome of a pessimistic hatred of life. It is a philosophy followed by the weak and ignoble. It is a philosophy that turns its back on life and promotes mediocrity and the denial of one's humanity. \n\nNietzsche identifies a need to re-evaluate our values to promote life. As an empowering goal, Nietzsche puts forth the Übermensch as the ideal man of the future that adheres to worldliness and his own experience. The Übermensch upholds strength and nobility as key values that naturally enhance his existence. Nobility allows the Übermensch to control his experiences to a greater degree. Strength allows the Übermensch to overcome adversity. The Übermensch values challenge, because challenge can only increase his greatness. The Übermensch welcomes a healthy amount of suffering as something that teaches him how to become stronger. The Übermensch lives life to thrive. In contrast to the Übermensch, Nietzsche posits the pessimistic prophecy of the \"Last Man\". The Last Man is a new species of man that adheres to values that, like Christianity, lead to the decline of life. the Last Man values easiness, complacency, mediocrity, and effortless comfort. The Last Man has not embraced life, instead, he has left it behind. In fact, life for the Last Man isn't even a life at all. His life is nothing more than a necessary inconvenience. The Last Man has only succeeded in making his life, in a practical sense, nothing, and thus is the denial of everything that life can be. Although bearing some semblance to the Christian, the Last Man is really closer to the modern man of western secular society. He is a man that fails to overcome nihilism and views his life as mechanistic. Thus, the decline of life is both a threat to Christians and less mindful atheists.\n\nFrom personal experience, I have found the most common reason that theists reject atheism to be a deep-rooted fear of nihilism and an inability to successfully confront it. This results in a generally dishonest and flawed view of life and the world in general. But, as I've discussed here, it is both unreasonable and unnecessary to resort to religion to find meaning in one's life.\n\nTL;DR: Nietzsche wants us to embrace life and cherish it. He wants us to smash the \"false idols\" of religion and its pessimistic moral vestiges that still permeate our society.\n\nThoughts? I've read most of Nietzsche's books. If you have any questions about his philosophy, I would be happy to answer them to the best of my ability.",
        "created_utc": 1436902174,
        "upvote_ratio": ""
    },
    {
        "title": "Did Jesus live life on easy mode?",
        "author": "Drysaf",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3dad89/did_jesus_live_life_on_easy_mode/",
        "text": "So I've been thinking Jesus' life and works, and it hit me that Jesus might have had a life on easy mode.\n\nI have been told that Jesus understands what it's like to be human since he was one and that he doesn't have to know sin to understand the human experience. When I thought about this, it seemed that he got the benefits of the fall (having knowledge of good and evil) but would never face the punishment naturally because of the fall of man ( since he was perfect/ wasn't born in sin). It seems like he had a leg up over every human ever born, including Adam and Eve before the fall. At least that's how I see it. What are your thoughts?",
        "created_utc": 1436900841,
        "upvote_ratio": ""
    },
    {
        "title": "Define \"god\"",
        "author": "myrpou",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d9wcu/define_god/",
        "text": "",
        "created_utc": 1436894011,
        "upvote_ratio": ""
    },
    {
        "title": "Are you happy?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d9kkm/are_you_happy/",
        "text": "Generally speaking, religious people are happier than non-religious people. This is consistently supported by various surveys and studies.\n\nI've been discussing happiness with a couple of Christians lately, and they assert that *only* Christians are capable of *true* happiness. They defined this happiness as \"joy that transcends circumstances,\" e.g. in the face of catastrophic personal tragedy.\n\nI can understand how a Christian can be happy, because they can believe that God is personally working out some great plan for them (despite evidence to the contrary) and that they will eventually receive eternal life in paradise anyway. But these people are saying that, for instance, Mormons or Muslims or Buddhists cannot be happy because they are not Christians.",
        "created_utc": 1436889089,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think creationism and Hell are irrevocably linked?",
        "author": "godlessindixie",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d90ap/do_you_think_creationism_and_hell_are_irrevocably/",
        "text": "Would you say that creationism, especially YEC, is necessarily linked to a belief in Hell?  Which significantly-sized groups or traditions teach creationism but do not teach everlasting torment?\n\nI am asking because I've received significant pushback from my readers who say they are irrevocably linked, that you cannot have one without the other. Do you agree or disagree?",
        "created_utc": 1436879387,
        "upvote_ratio": ""
    },
    {
        "title": "A question about creationists who believe in evolution",
        "author": "Herrenvolk41",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d7lsl/a_question_about_creationists_who_believe_in/",
        "text": "Hey guys. Dumb but curious teenager here. I've been wondering something for a while, but didn't know who to ask since I'm afraid it's a stupid question. I thought I'd give it a try here!\n\nSo, you know how there are some ~~creationists~~ Christians that accept evolution as fact? And you know how they believe that animals don't have souls, and that only humans get an afterlife? \n\nWell, my question was, for Christians that believe in evolution, at what point in the evolutionary process of apes --&gt; humans was it believed that they would go to an afterlife after death?\n\ni.e at what point in the evolution of humans is it believed that they acquired souls and thus were able to have an afterlife?\n\nMaybe when they learned how to create/use tools? Or when they first developed language/communication?\n\nThis could be a completely pointless question but it's just something that I thought of. I'm open to any criticisms or comments explaining why this question wouldn't make sense. I might be missing something. Thanks.\n\nEdit: I made a mistake in stating that creationists accept evolution. As pointed out by a user, this is not true, I was thinking of Christians instead!\n\nEdit 2: Thanks for all of your comments, guys. I read all of them. I learned so much, not just from in response to my question, but also from many other beliefs and perspectives that all tie into the creationist vs. evolution debate. It really gave me a lot to think about. So thanks for all the interesting info and explanations. ",
        "created_utc": 1436844816,
        "upvote_ratio": ""
    },
    {
        "title": "The House Analogy",
        "author": "Drysaf",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d7bjo/the_house_analogy/",
        "text": "So I was told this analogy, I forgot the circumstances of it coming up, but I ended up having an existential crisis because of it, but felt very silly afterwards after realizing my answer. OK so here it goes:\n\nSo you wake up in this house. There is no way out and the windows are blocked so you can't see outside. In this house there are many rooms, but many people are convinced that certain rooms are going to explode. No one knows which rooms would explode, if they even explode. You choice is to pick a room. Any room. You won't know the ending circumstances. Perhaps the room you pick explodes and you die, and the survivors get to leave and experience what is outside the house. Maybe the entire house explodes and everyone dies. Maybe nothing explodes and one day the front door unlocks itself.  So what room(s) do you decide to spend your time in? \n\nThe various rooms are different beliefs. At the end of my crisis, I stuck to my atheism since there was no evidence of \"bombs\" and that even if there were a god, that I wasn't going to play his game of \"guess the right religion\" if he did have \"bombs\" in certain rooms. What are your thoughts on this?\n\nFast edit: typo\n\nNot so fast edit: typo(really hate being on mobile)\n\nEdit: you guys have a lot of questions that I'm not sure of the answers since this isn't my analogy. Next time I talk to the guy who posed this question, I'll make another edit or response to you comments with the answers.",
        "created_utc": 1436839832,
        "upvote_ratio": ""
    },
    {
        "title": "How is discrimination based on religion, discrimination?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d71gz/how_is_discrimination_based_on_religion/",
        "text": "By common convictions of anti discrimination laws around the world, it is illegal to discriminate based on things that have no effect on someone's job or skill level, and are arbitrarily given in. Discrimination based on skin color, age,.. \n\nBut how does religion fit in with this? Religion is a personal choice for people which define how their worldview is and where it collides with possibly their jobs (say a GMO company maybe wouldn't want to hire Christians as it would be a point of tension on how it is playing for God). \n\nHow is something one is completely subjective to change and is a personal choice, exempt from consequences in terms of discrimination alike other factors that have nothing to do with someone's skill and were arbitrarily given at birth? ",
        "created_utc": 1436835044,
        "upvote_ratio": ""
    },
    {
        "title": "I fully support a friend of mine going into the sisterhood.",
        "author": "MicooForYou",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d6f3c/i_fully_support_a_friend_of_mine_going_into_the/",
        "text": "My faith (or lack of faith) story is a little complicated, so I won't get super in depth. I was a retreat leader at my Catholic high school with this girl but since then I have lost my faith and she recently posted on Facebook that she was thinking of joining the religious sisterhood. I thought that with my lack of faith, I would have disapproved, but I truly believe that her decision of becoming a nun will not hurt anybody. I am genuinely excited for her and support her.  She is a nice girl and could definitely help people with that position. What are your opinions?",
        "created_utc": 1436824645,
        "upvote_ratio": ""
    },
    {
        "title": "As an atheist, how do you define what the meaning of life is?",
        "author": "fatzyp",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d5zob/as_an_atheist_how_do_you_define_what_the_meaning/",
        "text": "So I have been feeling pretty depressed lately. I am an atheist, but a part of me wishes I believed in God. Hell, a part of me wishes there was a God. It feels like life would have a purpose - that *I* would have a purpose. That if anything goes wrong, I'd have someone to turn to, something that gives me hope that things will get better - that this is all a part of something bigger.\n\nAs an atheist, I do not have that. When things go wrong, there's no hope or guarantee that they would get better. Furthermore, it feels like my life has no meaning or purpose.\n\nHow do you as an atheist deal with this? What for you, is the meaning of life? And how do you deal with hardships?",
        "created_utc": 1436818067,
        "upvote_ratio": ""
    },
    {
        "title": "What Christians SAY vs what they MEAN",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d4vq3/what_christians_say_vs_what_they_mean/",
        "text": "As of late I’ve been interested in the way that religions as belief systems shape the everyday lives of their adherents. I’ve noticed how even the language and phrases they use reflect this, but more importantly how many of these sentiments can be expressed using no religious language at all.\n\n&amp;nbsp;\n\nI used Christianity as the example because 1) it’s what I was raised in 2) it’s what I’m surrounded by, and 3) it’s probably the most familiar and relevant to the majority of you reading.\n\n&amp;nbsp;\n\nTo illustrate, I’ve started a list of things that Christians say vs. what they actually mean. Now unlike the more sardonic approach made in [this](http://www.patheos.com/blogs/unreasonablefaith/2008/05/a-guide-to-christian-cliches-and-phrases/) list, the list here is meant to be an honest and literal translation of everyday religious talk. \n\n&amp;nbsp;\n\n* SAY: “I felt like God was telling me to…”\n* MEAN: “I decided after some careful thought to…”\n\n&amp;nbsp;\n\n* SAY: “God is good.”\n* MEAN: “Life is good.”\n\n&amp;nbsp;\n\n* SAY: “God has blessed me with…”\n* MEAN: “I’m so fortunate to have…”\n\n&amp;nbsp;\n\n* SAY: “I found God when…”\n* MEAN: “I found myself when…” or “I gained some wisdom when…”\n\n&amp;nbsp;\n\n* SAY: “The Spirit moved me to…”\n* MEAN: “I was overcome with emotion and I…”\n\n&amp;nbsp;\n\n* SAY: “I’ll be praying for you.”\n* MEAN: “You’ll be in my thoughts.”\n\n&amp;nbsp;\n\n* SAY: “God made me to be…”\n* MEAN: “I’m ________ because of experiences.”\n\n&amp;nbsp;\n\n* ...\n\n&amp;nbsp;\n\nHelp me add to the list if you can think of any—I’m sure we could publish a book there are so many. The purpose of this is to reveal just how ingrained yet unnecessary religious ideas are in people's lives as a way to make sense of things.",
        "created_utc": 1436801099,
        "upvote_ratio": ""
    },
    {
        "title": "Queries regarding omnipotence and the definition of God.",
        "author": "BertulfTheWise",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d4rzx/queries_regarding_omnipotence_and_the_definition/",
        "text": "I had been involved in a long argument with this user on [r/DebateReligion](http://reddit.com/r/DebateReligion). [This](https://np.reddit.com/r/DebateReligion/comments/3cww4d/to_christians_im_a_guy_who_is_attracted_to_other/ct0ng1o?context=3) is the comment thread.\n\nHe (or She; using \"he\" henceforth) was trying to explain omnipotence and had made the following comment:\n&gt;I don't think we can consider this a logically consistent possibility until it's proven in some way. I can't claim God can make pi equal to 3.0 without demonstrating that such a thing could be logically consistent. Or you know..a rock he cannot move.\n\nTo which I said:\n&gt;The \"creating a boulder that one can't lift\" isn't a logically inconsistent demand. We can do it. It actually shows how omnipotence is logically inconsistent.\n\nBut he said that:\n&gt;If God is omnipotent, then there is no boulder that cannot be lifted by him.\nIf God is omnipotent, he can create anything.\nYou're not disproving omnipotence, you're disproving the possibility of such a boulder existing.\nSomething which can both exist, and therefore be lifted by God by definition, and its un-liftability by God are in direct conflict with each other.\n\nBasically, he is saying that **\"A material cannot exist which God cannot lift via omnipotence\"** is an axiom and from it we can derive that a boulder that can't be lifted by God can't exist.\n\nWhere did I go wrong here? Have I fallen for some logical fallacy. Please do clarify. Thanks in advance.\n\n",
        "created_utc": 1436799374,
        "upvote_ratio": ""
    },
    {
        "title": "Why I don't care about a definition of God or divine.",
        "author": "81818181818181818181",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d40mq/why_i_dont_care_about_a_definition_of_god_or/",
        "text": "I considered the problem: \"You can't say that you don't believe in Concept X if you don't tell what you mean.\" and dealt with it.\n\nSo definitions of God are not absolutely agreed upon. [There are so many different views on the 3 holy scriptures](http://000024.org/religions_tree/) that it is one of the reasons why there is such diversity in religions. There is not one ultimate definition of God.\n\nIf a statement is 'true or not true', does not depend on a definition. There is no man in the sky or a comforting deity, so we can reject it. Everyone has all different definitions of god, and the holy scripture doesn't have a strict definition that we can reject. But obviously since it claims to be holy but, but it isn't internally logical: whatever God is supposed to be can be rejected. Holy is a derived statement from god, so whatever you define holy has to come from a deity. But since that can't be defined we are back in the logical loop.\n\nBasically everytime you make up a definition of God, you are creating a God. Who says that that is what God is? Also, as Wittgenstein noted, language is not infallible in transferring ideas. So there is always a flexibility in how you percieve the definition. How can the concept of God then be absolute?\n\nIn science when rejecting a hypothesis, there is importance in defining everything correctly. But a statement can be logically refuted even though there is not an exact border to the definition. We can reject a teapot orbiting the sun, cause it has a clear definition. For example if you define santa claus as the mentality of the people to give gifts to their children and celebrate that is left over from the original person where santa claus is based on, you stretched its definition into something that is true. This is not how it works, because everyone agrees that Santa Claus is not true.\n\nSaying: 'God' to a population of people will make everyone feel and think of diverse concepts that don't neccesarily have to overlap. But the concepts are clearly false and nonfunctional in the whole population, so they are wrong.\n\nWhatever the definition, I am rejecting them all. This is my basic a-theistic belief.\n\n**TL,DR:** \n\n1. Any definition given is someone creating a concept of a God.\n\n2. These concepts are not 100% transferable through text, speech or otherwise\n\n3. You can stretch them however real you want (Like my santa claus example)\n\n4. Thus you can reject all concepts of God and be a-theistic.\n\nI don't see any other path in rejecting the believe in God, it must consider the idea of a 'definition'. You can't say that you don't believe in Concept X if you don't tell what you mean. ",
        "created_utc": 1436782062,
        "upvote_ratio": ""
    },
    {
        "title": "Christian model of marriage, merits and statistics?",
        "author": "howlinghobo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d3814/christian_model_of_marriage_merits_and_statistics/",
        "text": "At the moment I disbelieve that the traditional Christian model of dating leads to more successful relationships in the long term. Especially:\n\n- no sex before marriage\n- marriage at a younger age with a briefer period of courtship\n\nBut I have trouble finding more information on this. A google search simply blows up with church and Christian sites, all citing Christian research such as the Barna Group. \n\nAt the same time, I would find it plausible or even likely that Christians have a lower divorce rate than atheists. And that the extremely serious Christians would have an even lower divorce rate still.\n\nGiven that arbitrary happiness is unconvincing in an argument, how would you argue against the Christian model of a relationship?",
        "created_utc": 1436760416,
        "upvote_ratio": ""
    },
    {
        "title": "Will atheism eventually become a cliché?",
        "author": "AnEnormousSquid",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d1pv9/will_atheism_eventually_become_a_cliché/",
        "text": "Being redditors, I'm sure we've all seen the \"edgy atheist\" comments peddled by childish christians in response to a rational argument. Atheism itself is becoming gradually more \"mainstream\" if you will, and is quickly (or agonizingly slowly, depending on how abhorrent you think religion is) becoming accepted in modern society. \n\nBut will there come a time in America that declaring yourself to be an atheist will be equivalent to someone declaring themselves to be a hipster nowadays? How would we overcome such a negative stereotype? And would it be just another flailing in the death throes of christianity, or a legitimate grievance against a force of logic that has become so commonplace as to become a cliché?\n\n**EDIT** I seem to have misrepresented myself a little. What I meant with the hipster comment was that someone declaring themselves to be a hipster will elicit some unsavory reactions. Mostly groans and eye-rolling. I wasn't trying to compare the two directly, but rather suggesting the dreadfulness of a world where someone claiming the mantle of atheism might draw the same reactions as someone calling themselves a hipster in today's society.",
        "created_utc": 1436732736,
        "upvote_ratio": ""
    },
    {
        "title": "Cutting Off Your Family in the Name of Jesus",
        "author": "InsomniacDuck",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d1leu/cutting_off_your_family_in_the_name_of_jesus/",
        "text": "",
        "created_utc": 1436730538,
        "upvote_ratio": ""
    },
    {
        "title": "Using the idea of religion to your own benefit?",
        "author": "Kruciff",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d13w1/using_the_idea_of_religion_to_your_own_benefit/",
        "text": "Today I was running late to a project that my company was contracted to,(not mine, but the one I work for) and I contemplated stating that I had gotten out of a church service late to sate any inquiries into my timing and get to work right away.\n\nWhile certainly not true, in my defense I've worked 152 hours in the past 2 weeks for these people and was only late of being 2 hours early than when I normally start, but all that is beside the point.\n\nIt got me thinking, that religious exemptions are the norm most anywhere, in terms of holidays, or punctuality, or obligations, especially in the deep south where I have the task of working currently. Is it inappropriate to take advantage of these expectations?\n\nThe only downside I can see is it creates an expectation of religion amongst the people you are working with and the mutual contacts. Certainly I wouldn't use this excuse with *my own* boss, but for a person I am 99.5% likely to never meet again?",
        "created_utc": 1436721966,
        "upvote_ratio": ""
    },
    {
        "title": "Fear of hell",
        "author": "Timmay4798",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d0jb6/fear_of_hell/",
        "text": "Let me start by saying I hope this doesn't become too much of a wall of text but I have so much to say.  My name is Tim and I'm 27 years old.  I don't like to identify as atheist or agnostic.  I was raised to be a Christian and I live in America where Christianity is everywhere.  While going to Sunday school I was taught to believe that evolution and the big bang were bad and I associated those things with the make believe and blasphemy when I was growing up.   It wasn't until quite some time after our family stopped going to church (I don't remember when, sometime in my early teens I believe) that I started to understand the validity of these things.  I was also taught to believe that if I didn't accept Christ as my savior I would spend eternity in hell.  Now this thought torments me as Christianity no longer makes sense to me.\n\nI actually found this sub Reddit by searching fear of hell on Google.  I read multiple threads about the subject and have found some helpful information but I feel my situation is much more severe than the others and thought I should share my story.  This is only a recent problem for me (last year or 2 tops).  Before then I just never really thought about it and I was fine.  But when I began to truly critically think about Christianity (and do research), it no longer made sense to me.  And that has left me in a state of despair.  This is such a problem from me that it's the first thing on my mind when I wake up and it pretty much never goes away.  Sleep doesn't even help because I often have nightmares about dying and hell. \n\nI am a logical and reasonable person.  So when I think about what it means to be a Christian, I become lost.  I'd like to say that I am definitely not the most educated person on religion.  In fact I am far from it.  I know very little, only what I was taught growing up and what I've recently researched.  I've promised myself I am going to read the bible cover to cover but why is Christianity the only religion I am worried about?  Shouldn't I be equally worried about other religions?  Shouldn't the fact that I am pretty much only worried about the Christianity version of hell do something to ease my mind that these fears are just a product of the way I was raised?  Well it helps but to not be certain on this matter drives me mad.  We are supposed to have faith in Christ because of a book written thousands of years ago by people who knew almost nothing compared to what we know now about the universe.  We have no evidence (that I'm aware of) other than the claims of these people that this book is the word of God.  There are so many reasons that's hard to believe but again I'll try and make this as short as I can.  \n\nSo because my brain can't accept Christianity as it makes no logical sense and defies everything we know about reality I am doomed to hell no matter how good (at least how I view good, but hey I'm no God) I am during my life.  How is belief even a choice?  I don't feel this way out of any kind of rebellion or spite it's simply how my brain works.  And this is apparently how God made me so did he make me the way I am to go to hell?\n\nThis problem is severely affecting my quality of life.  All I do is worry about this.  I also have a problem with hypochondria and these two things feed off each other like crazy.  Most people advising about things like this seem to offer the same advice: time and research will make these worries fade.  Let's be honest about my theology for a second, (I mean there's no lying to God right?  I'm looking at you Pascal's Wager) atheism makes the most sense to me.  Believing in things we can observe that are backed up by evidence and admitting that we don't understand certain things YET makes the most sense to me.  Believing in talking snakes and an all wonderful God that condones slavery and sends good people to suffer in hell for eternity doesn't.  I guess I'm just having trouble admitting I'm an atheist because the thought of hell is so horrifying when you truly think about it.  I don't want to give an arbitrary % of chance that I feel there is a hell.  I'd rather just say in all my mental capacity, a place like the hell of Christianity makes no sense to me.  But because the thought is so unimaginably horrible, the thought of it being at all possible is ruining my life.  I just have to find a way to be at peace with this.  I am going to continue to try and research as much as I can but the advice about time, I am not sure is so helpful.  I could die at any time and this causes me extreme anxiety.  Anyways thanks for reading and any help is greatly appreciated.  ",
        "created_utc": 1436710312,
        "upvote_ratio": ""
    },
    {
        "title": "Fear of hell",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3d0hyz/fear_of_hell/",
        "text": "    Let me start by saying I hope this doesn't become too much of a wall of text but I have so much to say.  My name is Tim and I'm 27 years old.  I don't like to identify as atheist or agnostic.  I was raised to be a Christian and I live in America where Christianity is everywhere.  While going to Sunday school I was taught to believe that evolution and the big bang were bad and I associated those things with the make believe and blasphemy when I was growing up.   It wasn't until quite some time after our family stopped going to church (I don't remember when, sometime in my early teens I believe) that I started to understand the validity of these things.  I was also taught to believe that if I didn't accept Christ as my savior I would spend eternity in hell.  Now this thought torments me as Christianity no longer makes sense to me.\n\n    I actually found this sub Reddit by searching fear of hell on Google.  I read multiple threads about the subject and have found some helpful information but I feel my situation is much more severe than the others and thought I should share my story.  This is only a recent problem for me (last year or 2 tops).  Before then I just never really thought about it and I was fine.  But when I began to truly critically think about Christianity (and do research), it no longer made sense to me.  And that has left me in a state of despair.  This is such a problem from me that it's the first thing on my mind when I wake up and it pretty much never goes away.  Sleep doesn't even help because I often have nightmares about dying and hell. \n\n    I am a logical and reasonable person.  So when I think about what it means to be a Christian, I become lost.  I'd like to say that I am definitely not the most educated person on religion.  In fact I am far from it.  I know very little, only what I was taught growing up and what I've recently researched.  I've promised myself I am going to read the bible cover to cover but why is Christianity the only religion I am worried about?  Shouldn't I be equally worried about other religions?  Shouldn't the fact that I am pretty much only worried about the Christianity version of hell do something to ease my mind that these fears are just a product of the way I was raised?  Well it helps but to not be certain on this matter drives me mad.  We are supposed to have faith in Christ because of a book written thousands of years ago by people who knew almost nothing compared to what we know now about the universe.  We have no evidence (that I'm aware of) other than the claims of these people that this book is the word of God.  There are so many reasons that's hard to believe but again I'll try and make this as short as I can.  \n\n    So because my brain can't accept Christianity as it makes no logical sense and defies everything we know about reality I am doomed to hell no matter how good (at least how I view good, but hey I'm no God) I am during my life.  How is belief even a choice?  I don't feel this way out of any kind of rebellion or spite it's simply how my brain works.  And this is apparently how God made me so did he make me the way I am to go to hell?\n\n    This problem is severely affecting my quality of life.  All I do is worry about this.  I also have a problem with hypochondria and these two things feed off each other like crazy.  Most people advising about things like this seem to offer the same advice: time and research will make these worries fade.  Let's be honest about my theology for a second, (I mean there's no lying to God right?  I'm looking at you Pascal's Wager) atheism makes the most sense to me.  Believing in things we can observe that are backed up by evidence and admitting that we don't understand certain things YET makes the most sense to me.  Believing in talking snakes and an all wonderful God that condones slavery and sends good people to suffer in hell for eternity doesn't.  I guess I'm just having trouble admitting I'm an atheist because the thought of hell is so horrifying when you truly think about it.  I don't want to give an arbitrary % of chance that I feel there is a hell.  I'd rather just say in all my mental capacity, a place like the hell of Christianity makes no sense to me.  But because the thought is so unimaginably horrible, the thought of it being at all possible is ruining my life.  I just have to find a way to be at peace with this.  I am going to continue to try and research as much as I can but the advice about time, I am not sure is so helpful.  I could die at any time and this causes me extreme anxiety.  Anyways thanks for reading and any help is greatly appreciated.  \n \n\n    ",
        "created_utc": 1436709397,
        "upvote_ratio": ""
    },
    {
        "title": "Had a discussion with a devout Christian and would like to discuss some important points",
        "author": "throw20150622",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cz7ha/had_a_discussion_with_a_devout_christian_and/",
        "text": "Recently had a fairly intense conversation with a dude who is a devout Christian (though he says he's more like the Knights Templar, willing to raise the sword against those who threaten his religion).  He claims that his faith is solid, based on the historical accuracy of the Bible.  He says that Christianity does have a monopoly on God because it is simply fact.  Interestingly, he also says he loves science.  Now I was raised Hindu but am functionally agnostic at this point.  There are some issues I wanted to discuss with an unbiased view:    \n\n* What is the significance of the Dead Sea scrolls and the book of Isaiah?  He brought it up a couple of times as proof that the Bible hasn't been changed and thus the prophecies in the Bible about the return of the state of Israel, etc. must really be prophecies. The DSS seem to date to 200 BCE.\n\n* What are some examples of Biblical prophecies?\n\n* It appears that parts of the Bible are certainly historically accurate, but other parts aren't, such as the conquest of Ai by Joshua which apparently happens 1000 years after the city was actually destroyed.  What important parts are actually accurate?\n\n* According to [wikipedia](https://en.wikipedia.org/wiki/Historical_Jesus) it is generally accepted that Jesus existed, that he was baptized by John, and that he was crucified by the Romans.  What is the evidence that he is God/the Son of God based on the events of resurrection, rising into Heaven, performing miracles, etc.?\n\n* How much did the Bible (NT) really change over time?  Is there evidence that verses of the NT existed prior to the time of Jesus as part of Pagan traditions for example?  \n\n* It appears there is some debate over the nature of the \"Kingdom of God\" with some verses declaring it to be a place to be attained through Christ, while others imply that it already exists and is more about a state of righteousness in the world.  I found it confusing that Jesus seems to imply in one verse that Heaven can only be achieved through him but in another verse it is implied that one cannot reach Heaven even by believing in Jesus and doing [good work](http://skepticsannotatedbible.com/mt/7.html#13).  Is there any consensus on this point?  \n\nThis guy claimed that he had debated theologians and professors and 'never lost' and basically restated [Pascal's Wager](https://en.wikipedia.org/wiki/Pascal%27s_Wager) without knowing about it.  It seems to me that ultimately there is not solid evidence of the supernatural nature of Jesus or the existence of God - it comes down to faith.  I am certainly open to the existence of God and pray almost everyday, but cannot simply accept that one religion is the 'right' one and Hell is the destination for all others.  This has me frustrated but also curious to learn more.",
        "created_utc": 1436670102,
        "upvote_ratio": ""
    },
    {
        "title": "Christians and Evolution: God as Ape",
        "author": "vaipandotcom",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cxwnu/christians_and_evolution_god_as_ape/",
        "text": "I'm curious as to why they refuse to believe it (I'm in the US). Public opinion polling has something like more than half denying it. I understand that perhaps it may have something to do with our planet being, according to them, older than the universe by a few days or so (according to Genesis, the sun, moon and stars were invented on the fourth day) and all together a little younger than when historians say agriculture/civilization came about : ~6000 years?\n\nBut, deep down, it may be more simple. I'd like to look into the history of the first vitriol against it. But so, if man is made in God's image, then the fossil record clearly demonstrates that God himself descended from the ancestors to homo sapiens. That God's twice-removed cousins are chimps. If they recognize that geologists don't just make up random numbers about the age of stratification, that archaeologists and biologists make informed and highly scrutinized claims about the history of a species' natural selection, that genetics may clearly demonstrate very distant traits, origins, changes, and that deep-space telescopes aren't lying to us about the light received, then God, who \"created Man in his own image, in the image of God\" and, after eating from a tree, man became literally Godly in discernment, though a tree away from immortality, according to what \"the Lord God said, 'The man has now become like one of us, knowing good and evil. He must not be allowed to reach out his hand and take also from the tree of life and eat, and live forever,\" even the apologists must admit that God's at least aesthetic form is entirely contingent on 3.5 billion years of evolution on this specific planet, on many mass extinction events which fundamentally altered the course of life, on a giant asteroid the size of the Isle of Wight (motto: \"All of this is of God's beauty\") that wiped out more than 90% of life 65 million years ago (but whose discovery by Alvarez led to a slew of great pics of dinos looking over their shoulders, of the Barney the Dinosaur TV show, and cool science fiction by Michael Crichton), then on the coincidental environment in Africa that led our ancestors to branch into what would become apes and what would become us, to stand, to hunt, to speak, to till, to write and record breakthroughs in things like agriculture or architecture and urban planning, so that it wasn't relatively that long ago that God was covered in hair and communicated through grunts and bone flinging à la Kubrick's \"2001\", and that, if we're also \"like\" God, \"knowing good and evil,\" evolutionary psychology suggests that the origins of God's morality are much more feral than previously assumed, and ultimately, genetically, God, Jesus and the third thing are undoubtedly susceptible to cancer, seasonal affective disorder, and dementia (Gen 1:27; Gen 3:22). \n\nTL;DR \nThat the admission of the veracity of Genesis, whether by an apologetic or not, necessarily demonstrates the origin of God. God was first a primate before he was God.\n\nP.S. I'm a dilettante of linguistics. What would Noam Chomsky say about the history of etymology according to the Christian bible: Gen. 2 \"[19] Now the Lord God had formed out of the ground all the wild animals and all the birds in the sky. He brought them to the man to see what he would name them; and whatever the man called each living creature, that was its name. [20] So the man gave names to all the livestock, the birds in the sky and all the wild animals.\" Have linguists had it wrong this whole time?",
        "created_utc": 1436643674,
        "upvote_ratio": ""
    },
    {
        "title": "The Problem of Optimistic Odds",
        "author": "dorian_the_gray",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cvno7/the_problem_of_optimistic_odds/",
        "text": "Hello r/TrueAtheism, teenage atheist and exchristian here. I'd like to express my argument against intelligent design, against optimistic odds.\n\nNote: This rebuttal is not an argument for/with evolution. I support and believe that the theory of evolution is a wonderful discovery, but what I am addressing here is different.\n\nI've noticed many theists use the argument of intelligent design, of incredible odds, to argue for God. They say something like, \"Oh, but how complex and intricate the human eye is, no evolutionary process could have created that! Therefore, it must have been God,\" or, \"But look at the Earth! It's beaten insurmountable odds! It's the perfect distance from the sun, it has the perfect atmosphere to hold life, any slight deviation in molecular/elemental make-up and we would cease to exist! God made everything perfectly, this is proof of God,\" or something the like.\n\nNow, these seem to hold some weight. It is true that the human eye is incredibly complex, and it's true that the Earth is the perfect yada-yada-yada. But these arguments all contain the faulty logic of what I call \"optimistic odds\". A simple rebuttal for these 'perfectly-calibrated-creation' arguments is that were they not perfect, they would cease to mean anything. Let me provide an analogy.\n\nLet's say you're rolling a dice. You must roll a six to win. Now, you don't win anything if you roll a six, unfortunately, but here's the catch: if you lose (you throw a one, two, three, four, or five), magical dice power happens: you cease to exist, your past ceases to exist, everything disappears, nothing has ever existed, and therefore, you can never know if you've lost, let alone even have thrown the dice. So, therefore, the only outcome that you will ever get is a six. If you get anything else, you'll never know, because you will have never existed. This logic holds with a one billion-million sided dice. However incredible it seems to roll the six every time out of the innumerable odds, you always will. Now, in reality, an outside observer could watch, and would see that the dice would only hit six approximately one in one billion-million times, a very small number of times. But to you, the dice-thrower, it would seem to you that you threw six every time.\n\nTo put this back into the actual argument, the only world we can have, no matter how complex, is the only one we can be aware of. We can't be aware of a world where the world isn't able to sustain life.\nHope this helps someone!",
        "created_utc": 1436587044,
        "upvote_ratio": ""
    },
    {
        "title": "rebuttal to this argument?",
        "author": "FreedomIsHere",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cv2j2/rebuttal_to_this_argument/",
        "text": "",
        "created_utc": 1436575138,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone see Act of God on Broadway?",
        "author": "Mainstay17",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cuftn/anyone_see_act_of_god_on_broadway/",
        "text": "",
        "created_utc": 1436564208,
        "upvote_ratio": ""
    },
    {
        "title": "My defense of the existence of God",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ctepx/my_defense_of_the_existence_of_god/",
        "text": "",
        "created_utc": 1436547663,
        "upvote_ratio": ""
    },
    {
        "title": "A Christian Friend of Mine",
        "author": "mspe1960",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ctdg4/a_christian_friend_of_mine/",
        "text": "I was talking to her today, and she told me how she doesn't use Facebook any more.  I asked why, and she said, people react badly to her.  I dug further, and it comes out that it was all one incident. (she is in her 50's and kind of computer phobic - she was never a big user of FB anyway).\n\nOne of her friends posted about someone who had a serious medical condition and had a medical treatment that went well.  She responded \"Thank God\".  The OP went into what she described as a nasty diatribe about \"god had nothing to do with it!.....etc etc\".\n\nI think \"thank God\" is just an expression like \"oh my God\" and I told her the other person was completely out of line, and that was a bizarre event that she should not think is the norm.  By the way, although she is Christian, she keeps it to herself.  She is not a preacher type at all - a sweetheart middle aged lady.\n\nSo what do you all think?  Was I right?  Was the responder out of line?",
        "created_utc": 1436547092,
        "upvote_ratio": ""
    },
    {
        "title": "Basic psychology: people need something to hold on?",
        "author": "halvaresha",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3csro0/basic_psychology_people_need_something_to_hold_on/",
        "text": "I had an interesting discussion to a believer that the most fundamental psychology is that people need to have something to hold on. Therefore, those who don't have anything to believe on (atheists) won't be able to solve their own problems in life.\n\nI might reword it a little bit too far fetched because we're not speaking in English (which is why I couldn't find anything when I Google it). Do you guys have any ideas on what it is?",
        "created_utc": 1436536846,
        "upvote_ratio": ""
    },
    {
        "title": "Feminism and Atheism Info, Please",
        "author": "DigMaybe",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cqxqu/feminism_and_atheism_info_please/",
        "text": "Hey /r/TrueAtheism \r\rI'm not very up to date with what goes on in the greater atheist community. So I was wondering if anyone could give me any information they have about the conflict about feminism within the atheist community.\r\rSome questions for discussion:\r\r* What is your perception of Feminism?\r\r* What is your stance on feminism in the atheist community and why?\r\rThanks for the feedback! ",
        "created_utc": 1436492508,
        "upvote_ratio": ""
    },
    {
        "title": "I need help with an email I received from a friend about his relationship with Jesus.",
        "author": "KEGEL_POWER",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cq0mw/i_need_help_with_an_email_i_received_from_a/",
        "text": "&gt; I find all the reason I need to believe in God within myself. In my soul.\n\n&gt; My arguments for God's existence may or may not be on par with yours which go against his existence. But does this really matter? Once you tally up all the 'scores' of which argument is better for every single question you could ever ask, then you will find your answer? The scales may tip one direction or the other, but even then, how can you be sure? You simply can't. Do you see yet how futile your efforts are? You won't ever find the answer or complete certainty you're looking for on your own. \n\n&gt; You want my arguments, refutations, logic... but that's not what's going to change your mind. It takes a softening of the heart to have faith. You can't expect to suddenly find the answer. Everyone knows we can't prove or disprove God's existence. Stop looking for slips in your logic and start pondering questions within yourself and search for an even deeper and greater truth.\n\n&gt; You also managed to ignore the joy and happiness, the security and comfort that I find in Jesus. I consider his love for me to be just as 'real' (though unintelligible) as any other sensation I feel in this world, because that's how I perceive it and that's how it's affected my own living. And there's nothing you can argue that will ever change that, because it's subjectively [in the manner of being unintelligible] true for me. \n\nThis is the most recent in a long string of conversations that me and my friend have had about the existence of God/the truth of Christianity. Every time we do this, in the end he always appeals to his relationship with Jesus as a trump card to try to win the argument. From what I can tell, my friend has managed to isolate himself from all argumentation by appealing to his own feelings and experiences with Jesus as his strongest evidence for the truth of his claims. If you ask him, he will tell you that he knows that Christianity is \"unintelligible\" and that it doesn't matter---all that matters is the relationship with God.\n\nIn the past I have asked him to specifically describe his \"feeling\"s and \"experience\"s with Jesus and God, but he always dodged the question. I have never pressed for an answer, because he is one of my best friends, and I do not wish to appear adversarial.\n\nHas anyone ever successfully dealt with someone like this before? Or even succeeded in getting them to question their own experiences?\nEdit: How do I get him to question himself?",
        "created_utc": 1436476467,
        "upvote_ratio": ""
    },
    {
        "title": "What's your go to Bible verse you bring up to Christians when you want to point out how messed up the book is?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cq0fu/whats_your_go_to_bible_verse_you_bring_up_to/",
        "text": "",
        "created_utc": 1436476378,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist-themed book free through July 13!",
        "author": "Gleb_Tsipursky",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cpxqx/atheistthemed_book_free_through_july_13/",
        "text": "",
        "created_utc": 1436475186,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever successfully convinced a Christian that there would be a conflict between their god knowing the future and them having free will?",
        "author": "ianyboo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3coglz/have_you_ever_successfully_convinced_a_christian/",
        "text": "This, to me seems like one of the more clear cut cases of conflict in the average Christians beliefs. But so far I have no luck getting believers to understand the issue.\n\nI ask them if they think their god knows everything. Most say yes. Then I ask them if that includes all their future words, thoughts and actions. Again most say yes. Finally I point out that if everything they will ever say, think or do is already set in stone from before they were even born then they don't have free will in any commonly understood sense of that term.\n\nIf they quibble ovber what I mean by free will I just say to think of a Pepsi and a Coke sitting in front of them. Free will would be the ability to pick either. \n\nI tell them to:\n\n\"imagine God standing in a room, he turns to me and uses his knowledge of the future to tell me, with 100% certainty, that you will pick the Coke.\n\nCan you pick the Pepsi?\"\n\nI've tried lots of variations on that example, none have worked.\n\nWhat am I doing wrong? \n\n",
        "created_utc": 1436451777,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone ever find themselves in an un-debatable position?",
        "author": "ChrisBabyYea",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3co774/anyone_ever_find_themselves_in_an_undebatable/",
        "text": "I am not sure if this warrants much discussion, but it is an observation I have had after being in the Secular Student Alliance at my university. We often get questions from people when we do community outreach events (I live in NW Alabama) and the discussion usually end in a stalemate. But not like agree to disagree style. An example: A girl comes up to us and after trying to find the right words, basically asks us how we arrived at the position we did. To her, atheism is just as strong a belief as christianity. I argued it wasn't. We go through the motions. And She asks it again, but a little differently. I answer a little differently, and then she says,\"I still just don't get how you can belief so strongly?\" ....K. Like, I do not know what to do with that. \n\nAnother example: My aunt is discussing the gay marriage thing with me. My aunt is kinda weird. She doesn't believe we should hate gay people, in fact, we should help them come to Christ or whatever. But she doesn't believe in the additional rights the SC just granted them. I don't know if she just doesn't understand or what, And I don't know what else to say to honestly. \n\nShe also said America should be a christian nation. After I put some thought into it, I really can't argue that, or even blame her for thinking that. We live in a secular nation. And I am a secularist. So to her, the country is in tune with my \"religious beliefs\". Obviously, secularism is the exact opposite of religion, but what I see more and more is that religious persons seem to think that it is. You're christian, muslim, jew...or secular. \n\nAnyway, I was curious if anyone ever found themselves in these positions. I keep seeing people ask for \"How do I debate this?\" and I often see it as a little un-debatable at times. ",
        "created_utc": 1436446815,
        "upvote_ratio": ""
    },
    {
        "title": "This willy-nilly deletion of posts with no explanation and censorship on this website has gone too fucking far... Probably getting banned from here for this and if I do... Good riddance.",
        "author": "AmiriteClyde",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cl8vs/this_willynilly_deletion_of_posts_with_no/",
        "text": "",
        "created_utc": 1436385402,
        "upvote_ratio": ""
    },
    {
        "title": "How do I find purpose in my life without religion?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cl5xn/how_do_i_find_purpose_in_my_life_without_religion/",
        "text": "I'm a seeker of truth as it were, I've researched tens of religions and they all seem great at first until I realize the hypocrisy I'd have to endure. Maybe there is a God, but I don't know for sure. But there are so many religions, how can they be true? I don't know. But one thing keeping me away from true atheism is that it seems to offer no hope and no purpose. How do you become an atheist without becoming miserable or depressed? ",
        "created_utc": 1436384198,
        "upvote_ratio": ""
    },
    {
        "title": "Secular Student Alliance members. What does your group do?",
        "author": "ChrisBabyYea",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cl0mp/secular_student_alliance_members_what_does_your/",
        "text": "My university has a chapter of this organization, and I joined it last semester. I attended like 2 meetings, and I have been to (and organized and hosted) several events over the summer. We have both school related stuff an general community stuff. \n\nI live in Alabama, and my town has this big flea market like event every first friday of the month. It gets a lot of attention. And main street gets closed off. We usually set up a table with pamphlets from the box the SSA provides. People come up and chat about stuff. We have signed a few students up, argued evolution and gay rights with a few people (nothing aggravated though), and receive support and praise from other secular persons in the area. We also get a lot of weird looks. \n\nIs anyone else apart of this group or something similar? What does your group do? I would love to get some new ideas. ",
        "created_utc": 1436382017,
        "upvote_ratio": ""
    },
    {
        "title": "Am I the only one who can't raise enough faith to believe?",
        "author": "LustigerLeo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ckxrg/am_i_the_only_one_who_cant_raise_enough_faith_to/",
        "text": "I feel like I just can not belive in god or any other higher (religious) being. Half a year ago I realized I am an agnostic atheist. It's  like I am kinda sad or jealous of my friends which mostly believe in a god. Paradoxically I am quite happy regarding of my believe.\n\nAre there other people which don't belive in god because of themselves? What are your opinions about my ~~dilemma~~ situation?\n\nSry for my bad English...",
        "created_utc": 1436380839,
        "upvote_ratio": ""
    },
    {
        "title": "The trial jury analogy...",
        "author": "fromkentucky",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ckmnt/the_trial_jury_analogy/",
        "text": "",
        "created_utc": 1436376313,
        "upvote_ratio": ""
    },
    {
        "title": "Organized Atheism Question",
        "author": "Kurgon999",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ckgyp/organized_atheism_question/",
        "text": "How do people here feel about organizations like the freedom from religion foundation? What are some good organizations that I can look into? I have google searched, I am looking for personel opinions and refrences.\n\nEdit for clarification: I am not looking for anything church like, but maybe just being part of a larger movement. I dont feel the need for a weekly gathering. I want to be a part of an organization that is honestly pushing reason and will stand against things like religion in public schools. I also have no current opinion on the FFRF as I remain fairly ignorant about their works. I am seeking the opinions and knowledge of those who are less ignorant than I.",
        "created_utc": 1436373931,
        "upvote_ratio": ""
    },
    {
        "title": "Dear God, please rip open the heavens, poke your head through and announce to all of us that you exist.",
        "author": "AmiriteClyde",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ck4bz/dear_god_please_rip_open_the_heavens_poke_your/",
        "text": "",
        "created_utc": 1436368467,
        "upvote_ratio": ""
    },
    {
        "title": "I need help forming a title for my next ebook regarding atheism",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ciyy3/i_need_help_forming_a_title_for_my_next_ebook/",
        "text": "",
        "created_utc": 1436340755,
        "upvote_ratio": ""
    },
    {
        "title": "'People need religion' - thoughts?",
        "author": "AwesomePotato2",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ciw8w/people_need_religion_thoughts/",
        "text": "What are your thoughts on this statement? I know that usefulness of religion does not make it true and this has to do more with antitheism than atheism (I just thought I'd get more responses and more points of view here instead of r/antitheism). \n\nHowever, what do you say to people who claim that religion has brought hope and happiness to millions of poor and hungry people in developing countries now and in the past? Do those people 'need' religion? What would you give them if religion was to disappear?\n\nAnother argument I heard was this - imagine a person on a deathbed. What will bring them more comfort, the idea that they are about to stop existing, or religious ideas of an amazing afterlife? What do you think about this?\n\nThanks for your responses. ",
        "created_utc": 1436338644,
        "upvote_ratio": ""
    },
    {
        "title": "There Is Hope!",
        "author": "DigMaybe",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ciqqg/there_is_hope/",
        "text": "",
        "created_utc": 1436334595,
        "upvote_ratio": ""
    },
    {
        "title": "Abortion.",
        "author": "ChrisBabyYea",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3chnf6/abortion/",
        "text": "",
        "created_utc": 1436313406,
        "upvote_ratio": ""
    },
    {
        "title": "Is this as pejorative as it sounds?",
        "author": "whattrees",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3ch1vh/is_this_as_pejorative_as_it_sounds/",
        "text": "Hello TrueAtheism,\n\nI come here with a question for you guys. In conversations with family and close friends, I have noticed recently that the Christian often explains my lack of belief as \"Well, he is just the kind of person that needs 100% evidence to believe.\" As I'll try to explain further below, this gives me an uneasy feeling and comes across as pejorative to my ears. Am I missing something or misreading their intentions? \n\nI've always been very rational and analytical. My family, my dad especially, has a reputation for being kind of \"robotish\" in his thinking and that quickly became the label everyone put on me as well. I was often told this when my friends would explain their feelings and I would have a hard time relating, but most often I was seen as a \"Ken Jennings\" kind of guy who would get sent the questions no one else had answers for. This was a place I enjoyed while I was in the church, and the position made me feel like I was a leader and needed to know what I was talking about when I came to faith so I went off to study to become a pastor. Of course I was unable to reconcile my faith with reality and have since left the faith, but I still feel a kind of burning desire to expose the truth for what it is and explain reality to those I led away from reality over the years. \n\nAnyway, this robot reputation has never left, and even though I never identify myself as such, new friends point this out pretty quickly. I'm seen as someone who's intensely rational and able to give you both sides of a problem, but also as someone who's incapable of emotion and who can push other's buttons by not letting bullshit slide (when someone makes a totally bogus claim I feel a strong need to ask them about it and understand why they believe it). \n\nOne friend in particular, when we were discussing our beliefs last week, told me that he understood why I wasn't a Christian, \"You are just the kind of person who needs 100% proof\" with a tone that implied \"oh, poor thing.\" I didn't have a response at the time, but it's wrong on several counts. A) I don't need 100% proof for anything, that's not the burden I use anywhere. Hard solipsism means that I can never be sure 100% but I will follow where the evidence leads. B) Why is it a bad thing that my burden of proof is so high? How in world can someone live with such a low burden? C) Let's say that's true, so your God wired me incapable of doing the one thing I needed in order to be saved and I am still to blame? \n\nA similar thing was said by my dad, of all people, when I came out of the closet. He worded it more like, \"I understand and struggled with that for a long time, but I had to chose to get over myself and be grateful for God's gift even if I can't fully comprehend it.\" I didn't have much to say then either. \n\nThose are not the only two instances, it has been happening since I came out. I totally understand that Christians have to rationalize it somehow and there are far more offensive things they could assume (not that I haven't battled the occasional \"You hate God\" kinda argument) but I just can't shake the feeling that they think I've gone crazy, lost my humanity, or given into \"worshipping my brain.\"  Has anyone else had this experience? How did you deal with it? ",
        "created_utc": 1436303651,
        "upvote_ratio": ""
    },
    {
        "title": "How can I respond to this?",
        "author": "jchapma1",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cgebh/how_can_i_respond_to_this/",
        "text": "     Hey everyone, let me just preface this post with an apology in case it gets long. I just want to be sure to provide some background information. \n     A christian friend of mine sent another friend (atheist) and me (also atheist) this video to watch:\nhttps://youtu.be/U0u3-2CGOMQ\nThis friend is known for being the most belligerent Christian in our friend group, so we fully expected something ridiculous. Lo and behold, it was a Ray Comfort video where he goes around trying to catch non-religious individuals in his apologetics. It was maddeningly stupid, but we persevered and sat through the whole thing so we could reference it later. \n     A couple days ago we got together with this friend (we'll call him Steve) as well as another Christian friend (we'll call him Bob) and a few others of varying degrees of religiosity. I knew going into the conversation it would be a fact vs fact slugfest, but it was frustrating nonetheless. To give some background on my perspective: I've been an atheist for several years, and I'm aware now that I used to be the typical bitter, argumentative atheist. I've since done a lot of reading and video watching, especially of people like Peter Boghossian (A Manual for Creating Atheists) and Anthony Magnabosco on YouTube. I've had a lot more success with their more Socratic approach to religious discussion than I ever had with facts and evidence. So, after probably an hour of trading blows over the fossil layer and plate tectonics, I decided to change my approach. I asked Steve if I could ask him some questions about faith to better understand his position. Thankfully, he obliged and we began to have a more civil discussion, with me asking him direct questions intended to make him think about his stance. Steve is exceptionally stubborn and 100% knows he is right to believe in God, so I didn't have any luck budging him from his 100% certainty mark. Bob, on the other hand, hasn't studied apologetics as heavily and was more open to my line of questioning. By the end of the discussion he was able to say something along the lines of \"I don't know, man, I guess I can't really say I'm at 100%\" which was just a miracle (pun intended) to me. \n     Long story short, how do I speak to someone like Steve, who is apologetics-centric, but believes (this is a roughly exact quote) \"science proves God and history proves Jesus\"? He is on board with micro evolution but doesn't agree with macro evolution (I think that's a misunderstanding right there), he believes in a young earth despite the problems of geographical species diversity (eg how'd the kangaroos get from the ark to Australia?), and puts no stock in the fossil record. He's very contradictory, in that he says he has evidence that proves God, but the evidence is revealed to him directly by God. What can I say to him? I've seen Jaclyn Glenn's response to the Ray Comfort video, but I don't think it'd very good, nor do I think it would sway Steve at all. If he dismisses all the evidence pointing to a natural world (which he says is just a bias scientists have), is there anything I can offer him to make him think? I hate to think that people are a lost cause, but he's the most stubborn person I've ever met.\n\nTL:DR:  Christian friend is eyeballs deep in apologetics, young earth creationist, but values evidence highly and believes there is great evidence for the Christian god and Jesus. What can I give him to make him consider the other side?\n\n  ",
        "created_utc": 1436293850,
        "upvote_ratio": ""
    },
    {
        "title": "7/7 tenth anniversary commemoration",
        "author": "Rutherglen",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cfst1/77_tenth_anniversary_commemoration/",
        "text": "Today is the 10th anniversary of the 7/7 bombings in London and true to form the way it was commemorated was with a religious ceremony in St Pauls Cathedral.\n\nI suspect most of those there were only very rare church attenders. If one is not religious, how does this sort of thing provide any comfort or solace to the injured or families of the deceased.\n\nOne of those injured was a Church of England vicar--now ex-vicar!!\n\nShould this sort of thing be secular only? It is ironic that in USA, memorial ceremonies (such as for 9/11) are secular yet most attending believe in a god and in UK such ceremonies (eg Armistice day in November each year) are religious yet most attending will not be believers or adherents to a church.",
        "created_utc": 1436284961,
        "upvote_ratio": ""
    },
    {
        "title": "should i come out as a atheist?",
        "author": "atheist222234",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cek90/should_i_come_out_as_a_atheist/",
        "text": "i am 15 and atheist,no one knows not even my parents,the only person that knows my closest freind thankfuly she is cool about it and doen't tell my parents,should i tell my parents?i'm still relient on them,i need them for food,water,a house,evrething and i think if i tell them they will kick me out,help me?",
        "created_utc": 1436257130,
        "upvote_ratio": ""
    },
    {
        "title": "Non-religious argument against Same-Sex Marriage",
        "author": "mrtweek",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3cbmb0/nonreligious_argument_against_samesex_marriage/",
        "text": "",
        "created_utc": 1436203418,
        "upvote_ratio": ""
    },
    {
        "title": "My parent's argument against same-sex mariage",
        "author": "GameMisconduct63",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c9jsg/my_parents_argument_against_samesex_mariage/",
        "text": "So today I was driving my mom and dad home from my uncle's house, and my dad pulled out a newspaper article about the recent federal legalization of marriage. We started sharing our views upon such, and it eventually got pretty heated. \n\n\nIn short, both of my parents firmly and truly believe that their religious freedoms will be infringed upon due to the fact that there \"will\" be gay couples suing churches that refuse to marry them. They think that once these instances begin to happen, a future judical decision could decidedly change the legality of \"refusing the right to marry\" by churches, therefore adhering to the \"gay agenda\". \n\n\nI simply told them that A). A same-sex couple would be competent enough to research/find a church beforehand that is willing to marry them to avoid conflict and B). If a couple truly did get involved with a \"refusing\" church, that they would simply determine that they are just assholes and would look elsewhere for someone to marry them, effectively avoiding legal costs and turmoil. \n\n\nMy parents adamantly believe that one or two lawsuits will be a gamechanger for the rights churches have to refuse marriages though.\n\n\nThoughts?",
        "created_utc": 1436154934,
        "upvote_ratio": ""
    },
    {
        "title": "If a God were proven to exist, would you follow them?",
        "author": "Twoten210",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3c9e2b/if_a_god_were_proven_to_exist_would_you_follow/",
        "text": "",
        "created_utc": 1436151597,
        "upvote_ratio": ""
    }
]