[
    {
        "title": "If you were the lawmaker, what laws would you make to treat the religious problems?",
        "author": "brainburger",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/36cz2t/if_you_were_the_lawmaker_what_laws_would_you_make/",
        "text": "I think I would aim to:\n\n1. Tax income for religious ceremonial, ministry and promotional activities the same as business taxes. Purely charitable income for activities providing physical care would be exempt as now.\n\n2. Ban faith schools for children aged under 18. Comparative religious education would be mandatory in all schools, but the organised teaching to minors, of any religious doctrine as if it were true, should be a crime.\n\n3. Ban (and enforce the ban of) the genital modification of children unless for specific medical purposes. Genital modification should remain legal for adults of course.\n\n4. License the officiation of weddings and other social ceremonies, requiring that they be inclusive, offering equal access to anyone regardless of their race,disability, gender, sexual orientation. Groups which choose not to offer these services to all groups needn't, but could not then offer them to anyone else.\n\nAny thoughts? My general plan would be to allow adults to do as they please, but prevent them inflicting it on children in an organised way. It would still be acceptable for parents to teach children what they believe of course. I wouldn't put any restrictions on religious clothing.",
        "created_utc": 1431949995,
        "upvote_ratio": ""
    },
    {
        "title": "Three year old nephew asked my wife why she doesn't like Jesus this weekend",
        "author": "IntellectualEuphoria",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/36cy68/three_year_old_nephew_asked_my_wife_why_she/",
        "text": "",
        "created_utc": 1431949366,
        "upvote_ratio": ""
    },
    {
        "title": "I am an atheist, but I practice many aspects of Buddhism. Are there any other atheists who practice aspects of spiritual traditions?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/36csbo/i_am_an_atheist_but_i_practice_many_aspects_of/",
        "text": "I don't believe in any gods, a soul, an afterlife, reincarnation. I do not pray, I do not sacrifice (burn incense, paper effigies/money), I do not believe Siddhartha Gautama was anything but a smart dude, not worthy of worship by any means, only my respect. I basically don't believe in any of the \"religious\" stuff (those things that require faith). \n\nWhat I believe is that attachment to material possession causes suffering, I believe it is better not to eat animals (particularly mammals, but I'll be dammed if you try and take my fish from me), I believe that all people are equal and worthy of my love and respect, I believe I should give and accept love freely. \n\nDo any of you feel anything similar? \n\nI must mention as well that such thoughts only arose in my mind after becoming an atheist; as a child I was raised Catholic and was a self righteous, racist little shit. It was atheism that brought me to free thought and acceptance and it is now Buddhism that brings together many ideas that I stumbled upon separately during my journey from religion to atheism. I like Buddhism because it teaches love, but the version I ascribe to is a philosophy, not a religion or spiritual tradition. \n\nWhat about you guys?",
        "created_utc": 1431944618,
        "upvote_ratio": ""
    },
    {
        "title": "Do you reject the idea of thr possibly of a god/creator, or only the idea of religion/worship?",
        "author": "Nezzatic",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/36c3wj/do_you_reject_the_idea_of_thr_possibly_of_a/",
        "text": "My logic has always been that I am an atheist because I reject the idea of religion. However the idea of a creator, or some entity far beyond our own existence and comprehension seems completely plausible. Of course I wouldn't expect this being to be the Christian God or likely even resemble it, nor do I believe we would ever be able to discover it. Do you believe there could be some form of higher power, one unrelated to religion? Does believing in the possibility of a higher power mean I am not technically Atheist, or does Atheism stem from the rejection of religion rather than a feasible higher existence?",
        "created_utc": 1431924159,
        "upvote_ratio": ""
    },
    {
        "title": "3rd rail",
        "author": "ragnaROCKER",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/36azw7/3rd_rail/",
        "text": "",
        "created_utc": 1431901168,
        "upvote_ratio": ""
    },
    {
        "title": "Gonna play devil's advocate: this part of Christianity makes sense for me.",
        "author": "sfcpfc",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/36awpd/gonna_play_devils_advocate_this_part_of/",
        "text": "So, weeks ago I had a debate with the leader of my old church's young minister leader. We talked about many interesting topic, one of which was God, Satan and Hell.\n\nI'd argue with many Christians that:\n\n* If God is perfect (That means omnipotent, omniscient, etc.), \n* And God created Hell and the physic rules that define who goes to Heaven and who goes to Hell, \n* And there's nothing that happens on the universe against God's will,\n* Then God is the only responsible for sending atheists to Hell. *(reasoning sponsored by The Atheist Experience)*\n\nBut that leader was able to change my mind. He told me that God didn't create Hell. Hell is just a (dimension?) where God is not. God created Heaven and offered us to enter there. If we reject his invitation, the only other possibility is going to Hell. And I'd assume that Hell isn't a big lava pool with eternal torture, as tradition points out, but just the lack of God, as he told me. \n\nNow, my big problem here is the way of accessing Heaven. Faith is not a valid \"key\", of course. And rejecting people who want to go to Heaven for not having faith is evil. But nobody says that God must be good. There's also the possibility God's a tyrant.\n\nThe main point I'm trying to make is that God didn't specificly create Hell, according to Christian theology. That's of course assuming that it's true, and I do not believe it. \n\nWhat are your thoughts on this?",
        "created_utc": 1431899572,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism doesn't work for everyone",
        "author": "MozartLink",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/36aump/atheism_doesnt_work_for_everyone/",
        "text": "",
        "created_utc": 1431898451,
        "upvote_ratio": ""
    },
    {
        "title": "Losing their religion: the hidden crisis of faith among Britain’s young Muslims",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/36aqzr/losing_their_religion_the_hidden_crisis_of_faith/",
        "text": "[As debate rages over the radicalisation of young British Muslims, are we overlooking a different crisis of faith? Ex-Muslims who dare to speak out are often cut off by their families and fear for their lives. A brave few tell us their stories](http://www.theguardian.com/global/2015/may/17/losing-their-religion-british-ex-muslims-non-believers-hidden-crisis-faith) (Andrew Anthony, The Guardian)",
        "created_utc": 1431896544,
        "upvote_ratio": ""
    },
    {
        "title": "Wanted to share Reza Aslan's extended interview with Jon Stewart",
        "author": "wittyname83",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/369oke/wanted_to_share_reza_aslans_extended_interview/",
        "text": "I just watched [his extended interview](http://thedailyshow.cc.com/extended-interviews/8dwtnx/exclusive-reza-aslan-extended-interview) with Jon Stewart and I agree with him that there needs to be more nuance in the Islam debate. \n\nWhat do you all make of it?\n\nWe all know the point he makes early on about everyone reading into religion whatever they want. In fact, that's one of the reasons many of us think that religions as a whole are bullshit. (Ie, if you can read into any verse whatever you want, how can the verse speak to universal truth?)\n\nFurther, we all know the point that Islamic terrorists mostly kill other Muslims and still more Muslims are fighting against ISIS and other terrorist groups. But I think he falls short here because I don't know of many large, vocal groups of Muslims speaking or acting out against Boko Haram, Hamas, or other groups of \"bad\" Muslims acting against Christians or Jews. (This could be a case of my own ignorance so I'll search around google in a bit).\n\nI also agree with him that Muslims are currently going through the Reformation people like Bill Maher and Hirsi Ali talk about Islam needing. I mean, I don't think we would see this much activity and internal war if it wasn't going on. Unfortunately, the west seems to like to stick its nose in it and then get upset when said nose gets bloodied.\n\nAll in all, I think it was a good interview but I'd like to hear your thoughts on it as well. I know Reza is a somewhat sly character when it comes to making his conclusions (which seem to be off sometimes), but I don't really have much difficulty in accepting his premises. ",
        "created_utc": 1431876290,
        "upvote_ratio": ""
    },
    {
        "title": "Why do (all?) Christians pray before eating?",
        "author": "Jundarer",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3690he/why_do_all_christians_pray_before_eating/",
        "text": "I live in Germany and while most people I know are atheists, some are Christian. What I always found odd since I was a child is why they thank God for their food before they eat. Especially in first world countries it just doesn't seem to make sense. \n\nIs it just a leftover from times where you had to hope that your crops don't wither? Otherwise it just seems somewhat disrespectful to the people who actually worked to get the food on their table.",
        "created_utc": 1431856795,
        "upvote_ratio": ""
    },
    {
        "title": "Where ought I start in a morality without a god?",
        "author": "DwindlingFaith",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/368l96/where_ought_i_start_in_a_morality_without_a_god/",
        "text": "I'm not saying that it's not possible; I'd genuinely like to know if, without a god, where should I begin in forming my morality? I've never thought about this or the formation of my morals for very long, only that I was taught that they are god-given and much of it comes from the bible. If the time comes that I might lose my faith, how would I begin forming morals? ",
        "created_utc": 1431840837,
        "upvote_ratio": ""
    },
    {
        "title": "How to help my son deal with his grandpa's death",
        "author": "foxtrot78",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/368a31/how_to_help_my_son_deal_with_his_grandpas_death/",
        "text": "My 6 year old son's grandfather (my father-in-law) has started hospice care and only has a week or two left. I'm trying to figure out when and how to tell him.  He already has been exposed to the idea of heaven from an older kid he knew and looked up to at a daycare he used to attend a year ago. He was quite infatuated with her and he would sing songs about Jesus and God and the like that she taught him.  I was mildly irritated by this but I didn't overtly tell him to stop. I did, however, discuss the different ideas that various religions hold to him as well as atheist and agnostic ideas. But he was pretty latched on to the Christian ideas and remains so to this day but much more toned down since he's in school now and no longer attends that daycare.\n\nFirst, off I'm not sure if I should tell him that his grandpa is dieing or if I should wait till after he passes. Secondly, I really don't want to reinforce the heaven idea, but I'm not sure he can grasp the idea of nothing (or emotionally handle it if he does understand). So I don't know what to do. Has anyone dealt with this before with your kids?  I would love some input.",
        "created_utc": 1431832795,
        "upvote_ratio": ""
    },
    {
        "title": "Comment #1",
        "author": "qounqer",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3683nt/comment_1/",
        "text": "",
        "created_utc": 1431828604,
        "upvote_ratio": ""
    },
    {
        "title": "My New Favorite Bible Contradiction",
        "author": "MrPieMan",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/366sst/my_new_favorite_bible_contradiction/",
        "text": "I've been an atheist for a few years, but until recently I had not thought about religion much since I first deconverted. I mostly only discussed the topic if someone wanted to press me when I told them I was an atheist. A few recent conversations with my parents and with some people trying to convert me rekindled my interest in religion, philosophy, and the multitude of reason I don't believe. \n\nI've intended for a long time to read the whole Bible and the whole Koran, but I had never gotten around to it. So I started last night, and within the first few pages of Genesis, I already discovered a new contradiction I had not known about:\n\nGenesis 6:3:\n3 Then the Lord said, “I will not allow people to live forever; they are mortal. From now on they will live no longer than 120 years.”\n\nThen, two pages later, we have the following:\n\nGenesis 11:10 - 26:\n10 These are the descendants of Shem. Two years after the flood, when Shem was 100 years old, he had a son, Arpachshad. 11 After that, he lived another 500 years and had other children.\n\n12 When Arpachshad was 35 years old, he had a son, Shelah; 13 after that, he lived another 403 years and had other children.\n\n14 When Shelah was 30 years old, he had a son, Eber; 15 after that, he lived another 403 years and had other children.\n\n16 When Eber was 34 years old, he had a son, Peleg; 17 after that, he lived another 430 years and had other children.\n\n18 When Peleg was 30 years old, he had a son, Reu; 19 after that, he lived another 209 years and had other children.\n\n20 When Reu was 32 years old, he had a son, Serug; 21 after that, he lived another 207 years and had other children.\n\n22 When Serug was 30 years old, he had a son, Nahor; 23 after that, he lived another 200 years and had other children.\n\n24 When Nahor was 29 years old, he had a son, Terah; 25 after that, he lived another 119 years and had other children.\n\n26 After Terah was 70 years old, he became the father of Abram, Nahor, and Haran.\n\nAnd it continues similarly for a while. I'm only a few pages in, and it already seems like the God who is all powerful isn't even capable of making sure people die when he wants them to. Maybe the eternal God changed his mind? Maybe he lied? Has anyone else come across this contradiction?\n",
        "created_utc": 1431801569,
        "upvote_ratio": ""
    },
    {
        "title": "Do you guys get tired of talking to theists?",
        "author": "Drysaf",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3659en/do_you_guys_get_tired_of_talking_to_theists/",
        "text": "It seems that when ever I talk to a theist about God and religion, it always ends up so frustrating to me. It seems like there is no point to the discussion as it always ends up being \"we can never fully understand God\" or \"You need to have faith that God is with you\" It seems that I can never make a good point about God. It doesn't matter what points I bring up, God is real or God is faultless. No if's, and's, or but's about it.\n\nIs there a point to discussing the unfalsifiable? If something can't be tested, I don't see the point of entertaining the idea. I live in reality and if I can't find a way to test for something, to me that's worse than it being proven 100% false. I always end up thinking of this: What's the difference between an undetectable dragon and no dragon at all. As far as I'm aware the answer is that there is no difference. I don't have an interest in the unfalsifiable and I like to be able to prove things with hard evidence. Or am I relying too much on empiricism?\n\nEdit: Thought I saw a typo but I didn't. Then forgot to add edit. But none of the text has been altered.",
        "created_utc": 1431760214,
        "upvote_ratio": ""
    },
    {
        "title": "Good article calling out Christians for distancing themselves from the term religion.",
        "author": "Gleb_Tsipursky",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3654yw/good_article_calling_out_christians_for/",
        "text": "Good article calling out Christians for distancing themselves from the term religion. Basically, some Christians are starting to call their religious belief a \"relationship\" and avoid acknowledging that it's still a religion. [Here](https://richarddawkins.net/2015/04/christianity-isnt-a-relationship-its-still-a-religion/) is the article. \n\nEDIT: To expand, based on the comments, I think this article epitomizes some trends popular in modern Christianity and other religions, of trying to appeal to people through their emotions and avoiding using anything negative. It's like Christianity without a Hell, basically - all friendly, personal relationship with god, we're all going to Heaven, etc. Yet this position still empowers religious dominance of the mainstream, of course. ",
        "created_utc": 1431756255,
        "upvote_ratio": ""
    },
    {
        "title": "Using Science, Not Religion, to Find Meaning and Purpose",
        "author": "Gleb_Tsipursky",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/364tr6/using_science_not_religion_to_find_meaning_and/",
        "text": "Mainstream opinions in the United States typically perceive religions as the main source of meaning and purpose in life. However, recent research has shown that neither religion nor even belief in God are required to gain life meaning and purpose. [Here is an article](http://intentionalinsights.org/searching-for-meaning-and-purpose-in-life-religion-is-option) that briefly summarizes the findings on meaning and purpose, shows why faith in the divine is not needed for a sense of life purpose, and offers some science-based strategies to find meaning in life. What do you think?",
        "created_utc": 1431747862,
        "upvote_ratio": ""
    },
    {
        "title": "As of 1 hour ago, I no longer work at a religious institution.",
        "author": "KenBave",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/364epy/as_of_1_hour_ago_i_no_longer_work_at_a_religious/",
        "text": "I have been on staff at my alma mater (a private Christian university) for the past 3 years, and today was my last day. After about 6 months of searching, I finally found a new job at a nonreligious company. Even better - I'll be doing a lot of the same things but for more money.\n\nI left on good terms, and I still would like to keep in contact with a few of my former coworkers, but overall, I don't quite know how to feel right now. I am now \"free,\" but it's also bittersweet. Definitely have quite a few memories (many of them fond) tied to a place that almost certainly played a significant role in my move away from religion.\n\nI'm not really looking for advice. Just wanted to share and see if anyone has had similar experiences with working for religious institutions. Cheers!",
        "created_utc": 1431738211,
        "upvote_ratio": ""
    },
    {
        "title": "NPR's Diane Rehm Show polls audience on religion. Host (Tom Gjelten) is audibly shocked and seemingly putt off by the results",
        "author": "SecularVirginian",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/364cld/nprs_diane_rehm_show_polls_audience_on_religion/",
        "text": "The referenced audio can be found [here](http://thedianerehmshow.org/audio/#/shows/2015-05-13/causes-and-consequences-of-declining-religious-affiliation-in-the-u-s/110191/@34:15). The link will track you to the appropriate time mark.  Track to the beginning to hear the entire program.\n\nA recent [report](http://www.pewforum.org/2015/05/12/americas-changing-religious-landscape/) by Pew Research noted that the US is rapidly becoming less christian and more secular.  There was a panel discussing the reasons and consequences behind this trend.  An outline of the discussion and the poll can be found [here](http://thedianerehmshow.org/shows/2015-05-13/causes-and-consequences-of-declining-religious-affiliation-in-the-u-s#poll-are-you-religious).\n\nAt the beginning of the show, Gjelten asks viewers to go to the website and take a poll regarding their religion.  Towards the end of the show he is provided with the [results of the poll](https://twitter.com/drshow/status/598498526398648320) thus far.  \"We had -- a lot of people wrote in to take this little poll. Thirty six percent of you, *my goodness*, 36 percent of you say you identify as an atheist. [long pause] \"  \n\n\"Thirty percent affiliate with Christianity, and another 19 percent are agnostic, *my goodness*.\"\n\nAt first this seemed like he could just be surprised, but his continual tone and speech told a different story. Putting it into further context makes it harder to write off the above as just being startled by the numbers.\n\n\"So if you feel these survey -- these data don't reflect your view, *please* log on and join this poll. We'll post the full results of that poll tomorrow.\"\n\nNote that here he doesn't ask the audience to take the poll.  He's essentially asking for religious people to vote to fix the poll.  He also says he is going to release the full results \"tomorrow\" ... which he never did.\n\nHe goes on to specify: \"So I should say that these findings only reflect the views of people that bothered to take the poll. They don't necessarily reflect the views of this audience or the public radio audience more generally.\"  \n\nThese just don't at all sound like comments he would have made if it came back with a higher percentage of christians.\n\nHe then goes on to take questions from the audience.  One such reads as\n\n\"David tweets, are there anything in the data to suggest the proliferation of information on the Internet with a decrease in church affiliation? I guess he's meaning that, you know, as people become more attached to their computer screens, they are less likely to go to church for inspiration or information or something like that.\"\n\nHe just brushes off the point David is trying to make.  However, Gjelten is an older (presumably religious) man so I could easily chalk this up as a legitimate misunderstanding on his part.\n\nHe then goes on to take calls from pretty much entirely christians with the exception of one person who identifies as a deist.  Not one self-identified atheist or \"agnostic\" is given a chance to comment.  That was over 50% of the people in the poll.\n\nThis certainly isn't as bad as much of the right-wing rhetoric that we face.  It still caught be off guard; however, it shouldn't have.  Perhaps I was so blinded by the right that I forgot that there are still problems in my own camp.\n\nEDIT:  One more excerpt from the end: \"Father Bretzke, before we go to the phones, I want to go to you because we apparently have all these sort of unreligious people listening to this program today. And I want you to put in a good word for God here.\"",
        "created_utc": 1431736894,
        "upvote_ratio": ""
    },
    {
        "title": "Need a good response",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/363dcy/need_a_good_response/",
        "text": "",
        "created_utc": 1431718342,
        "upvote_ratio": ""
    },
    {
        "title": "What value does questioning the existence of a god(s) provide to anyone?",
        "author": "ZeusThunder369",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3633zp/what_value_does_questioning_the_existence_of_a/",
        "text": "Just wondering what the communities thoughts are on this.\n\n* What value is there in caring whether or not a god exists? Either way, there is nothing you can do about it, so why not focus on other more meaningful things instead?\n\n* No amount of discussion could ever prove or disprove the existence of a diety, so why not focus on things that could be proven instead? For example, would there not be much more value to society if we could prove intelligent life on other planets exist? NASA has made some huge advances in this process lately; Imagine how much further we'd be along if every religious donation went to NASA instead?\n\n* Why is the \"separation of church and state\" so important to some people? Is a Christian manger scene on government property really all that harmful to non-Christians? Will it negatively impact the lives of people in any way?\n\n* What value is there in attempting to change the views of people that do or do not believe in a deity? Whether or not I change their mind, it will not significantly impact my life in any way. There appears to be much more value in applying that same energy to convinving someone to quite using illegal narcotics, or committing crimes.",
        "created_utc": 1431713812,
        "upvote_ratio": ""
    },
    {
        "title": "Humanism or Objective Ethics?",
        "author": "dimarch",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/362oa2/humanism_or_objective_ethics/",
        "text": "Humanism is currently the most popular moral alternative to religion. But, in reality, it is still another religion! The true atheism should be based on objective ethics. Here is a short comparison between humanism and objective ethics, and an explanation why it is so:\n\nhttp://ethical-liberty.com/humanism-objective-ethics.htm\n\nAn extract from the conclusion: \"Humanism is [...] a faith in the New God: Human, his Reason and his Sacred Well-Being. It is based on the belief in the good nature of human. But is the human nature good? Of course, not. Humans are egoistic, violent and stupid. The only universal good they are capable of - \"love\" - has animal roots: sexuality and empathy. Human reason - their distinctive feature - is unable to come up with the good on its own, so humans use their reason for evil deeds. [...] All they want is more money, more fame, more power. This is their view of happiness which humanism seeks to preserve and promote...\"\n\nAny objections?",
        "created_utc": 1431706562,
        "upvote_ratio": ""
    },
    {
        "title": "I have no fight left in me against Christians.",
        "author": "S0me4mula",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/362m3n/i_have_no_fight_left_in_me_against_christians/",
        "text": "This happened about two years ago. I started a free HIV testing clinic. Worked with the department of public health and had a great thing going. I'm a molecular biologist, I've done research in cancer biology, HIV, and remediation studies for polluted lands (specifically in fungal/plant symbiosis). \n\nI remember somebody saying they would pray for me. PRAY for me. \n\nBecause I live a sinful life. \n\nI am a logical person. I don't understand how you can argue with someone that does not see logical. Since then I've been at a loss. I don't know what to say nor how to deal with Christians or anybody of the faith. \n\nI really feel like I needed to get this off my chest. I haven't even volunteered since it happened. ",
        "created_utc": 1431705577,
        "upvote_ratio": ""
    },
    {
        "title": "What other divisive forces are there that like religion are so immaterial or contrived?",
        "author": "scoobeee",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/362ccb/what_other_divisive_forces_are_there_that_like/",
        "text": "Are there other divisive elements out there that are as unnecessary as supernatural religious belief that result in so much violence, hate, conflict, and oppression?\n\nIn a comment yesterday a redditor mentioned many other social factors that can produce conflict like poverty, opposing politics, border regions, etc.  Also mentioned was that sport fans can become violent towards each other and riots, murders, and mob mentality over games can occur. \n\nI wondered if the atheist and anti theist outrage over religion and its divisiveness is because there is no other force like it in its power and its lack of physical necessity or basis in reality. It is culture that is based on pretend and on unfalsifiable truth claims. I understand that our countries, our politics, our economics are all contrived and come from ideas as well but to live life we can't do without them. Supernatural beliefs seem wholly unnecessary and fabricated. Most other potentially divisive factors seem to be fairly necessary things or at least based in physical reality. Things like government policies, economics, race relations, international relations, the environmental protection seem like things we just HAVE to keep improving on.\n\nI'm not sure that I'm on very solid footing with this thought so I'm curious how others see it.",
        "created_utc": 1431700827,
        "upvote_ratio": ""
    },
    {
        "title": "An interesting insight to Gender Roles and the role of God in family dynamics",
        "author": "Erin_Broccolivich",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/360c1t/an_interesting_insight_to_gender_roles_and_the/",
        "text": "",
        "created_utc": 1431650752,
        "upvote_ratio": ""
    },
    {
        "title": "Found this on Mormon dudes facebook. Joseph Smith's Golden Books found?",
        "author": "xkissitgoodbyex",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3605x5/found_this_on_mormon_dudes_facebook_joseph_smiths/",
        "text": "",
        "created_utc": 1431647465,
        "upvote_ratio": ""
    },
    {
        "title": "How Should I Feel About Abortion?",
        "author": "Domriso",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35zzce/how_should_i_feel_about_abortion/",
        "text": "I had a two and a half hour long talk with my mother today, ranging from all sorts of ideals on religion, and eventually ending with abortion, where we finally had to stop before we started arguing. I'm going to put it right out there now that I'm not entirely sure if this is the right sub to post it in, but I could not find a better fit, so I hope that is okay.\n\nMy mother believes in the sanctity of life, from which stems the majority of her feelings on abortion. I do not. I believe in personal agency, and that there is a difference between keeping a child alive due to personal responsibility versus keeping a child alive because of desire for said child. As such, I am pro-choice.\n\nHowever, my mother did present me with a flaw in my own logic that I'm having difficulty overcoming, which is why I have come to you. I'm unsure of how to decide upon my own feelings of abortion, and would like some input.\n\nI believe in the sanctity of sentience. I think that animals deserve more respect and their own form of rights, versus the current state of \"anarchy\" (quotes because I know that the word is something of a hyperbole). For a fetus, I think that even if it has nerve signals that does not by itself constitute sentience. Once there is a concrete representation of sentience, then I think personhood has been achieved, and it becomes immoral to kill it.\n\nAnd this is where my opinion becomes foggy. If a fetus can survive outside the womb, even if it needs assistance, then shouldn't this respect of sentience dictate that I protect it? Certainly, when the fetus is entirely dependent on the mother it is more of a tumor than a person, but where does this line exist, and does it actually exist? \n\nExtending the thought further, I most definitely think that there is more inherent value in the life of someone who has already gone through some pains and experience than that of toddler who has little to no experience. But, I also think there is some amount of sentience already inherent in a toddler, since there is a definite recognition of objects and persons, even at a young age. \n\nBut, if I am willing to extend this state of personhood to a toddler, shouldn't I likewise extend such personhood to an animal? Certainly, an animal like a dog will never grow to the state of a human in terms of consciousness, but neither will some mentally disabled individuals. Do they likewise lose their personhood? And, if they don't, doesn't that mean that I should be completely against all animal death, especially ones done for simple ease of humans?\n\nTo explain ease of humans, I think that we do eventually reach a point of animal existence where, to keep human society moving and under control, we must get rid of some of the population of animals. But, if I award animals with some level of personhood, does that make killing these animals to preserve human society immoral?\n\nI'm finding myself conflicted, because taking my thoughts to their logical extremes seems to produce things I don't believe in. If I believe in personhood, then shouldn't fetuses of a certain age be protected against? And, if I don't believe in the personhood of fetuses until outward experience and opinions are formed, then shouldn't it be amoral to kill a toddler or infant who has not achieved that level yet? I don't think it should be right to kill a toddler, but my logic seems to be conflicted. Then again, it could be a flaw in my own thinking.\n\nWhat are some of the other opinions, and reasons for those opinions, on the morality or lack thereof involved in abortion, and more broadly, killing? I need some assistance before I drive myself mad.",
        "created_utc": 1431644017,
        "upvote_ratio": ""
    },
    {
        "title": "Ricky Gervais view on religion.",
        "author": "Nivses",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35zsqe/ricky_gervais_view_on_religion/",
        "text": "",
        "created_utc": 1431640782,
        "upvote_ratio": ""
    },
    {
        "title": "Spirituality?",
        "author": "ThQmas",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35xrro/spirituality/",
        "text": "So in this intensive program I am taking for depression, we are combining mesicine with group therapy, where the grouo therapy helps build up social, emotional and spiritual supports.\n\nI am having some trouble with spirituality.  How do you view spirituality? As a part in a greater whole or another form? I could use some help trying to figure out this subject.",
        "created_utc": 1431605372,
        "upvote_ratio": ""
    },
    {
        "title": "How would you guys combat the argument of all the earthquakes and natural disasters going on as a sign of the bible being true?",
        "author": "gzzh",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35wxh2/how_would_you_guys_combat_the_argument_of_all_the/",
        "text": "I am surprised that I haven't actually heard this argument yet, but I am preparing for someone to say this to me. \nWhy do all these recent earthquakes not give any validity to the bible? I would appreciate help on seeing why this logic is flawed.\nThanks",
        "created_utc": 1431579321,
        "upvote_ratio": ""
    },
    {
        "title": "Free Will and Objective Morality",
        "author": "compulsive_coaster",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35vqzb/free_will_and_objective_morality/",
        "text": "Note: I just submitted a How To post on Argument Maps, but didn't want the actual chart to get lost or sidetrack the context of the post.\n\n.\n\nI find Objective Morality and Free Will to be tightly intertwined.  Specifically, if there's no Free Will, then what's the point in arguing for Objective Morality?  Conversely, if morality is not objective, specifically, if one derives his/her morality from an ultimate deity, then Free Will must therefore be considered illusory.\n\n.\n\nI've created a flowchart to work through my thoughts.  Any feedback/edits are welcome and appreciated\n\n* [Imgur](http://i.imgur.com/rvQuZIS.jpg)\n* [Draw.io](https://drive.google.com/file/d/0B6wx-5YJxfvGUjVlMUIyanBXelk/view?usp=sharing)",
        "created_utc": 1431556269,
        "upvote_ratio": ""
    },
    {
        "title": "Argument Maps - How To",
        "author": "compulsive_coaster",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35vpl6/argument_maps_how_to/",
        "text": "",
        "created_utc": 1431555597,
        "upvote_ratio": ""
    },
    {
        "title": "Well, I feel like an idiot (mini rant)",
        "author": "Drysaf",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35vjb0/well_i_feel_like_an_idiot_mini_rant/",
        "text": "Do you ever have those moments when someone says something insulting/condescending to you and it goes over your head, only for you to get what they are saying when it is much too late? Well, that just happened to me.\n\nA couple months ago, my boyfriend told me how he saw militant atheism becoming a problem in 100 to 200 years because if people really think that religion is so bad, they would do anything to get rid of it. I don't remember what my response was, but looking back, it really pisses me off. You know has been a problem for the past thousands of years? Radical religion. The most I will ever do as a \"radical\" atheist is either make a joke or chew someone out. But many radical religious people would be more than happy to see me dead. And yet we are going to be the problem. If irony had a weight, you could bludgeon someone to death with his statement.\n\nSo do you see \"militant\" atheism becoming a problem in the future? I personally don't. From my knowledge, most atheists want a secular government, not a atheist state. I want everything to be neutral. Besides, there is no point of forcing atheism on other people. I feel like people should come to these conclusions on their own. Otherwise, we would be no better than religions that we bash. \n\nEdit: typo\n\nEdit 2: Meeting requirements for submission ",
        "created_utc": 1431552676,
        "upvote_ratio": ""
    },
    {
        "title": "what are your thoughts on the syrian civil war ?",
        "author": "Adnan94",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35t2r6/what_are_your_thoughts_on_the_syrian_civil_war/",
        "text": "",
        "created_utc": 1431502060,
        "upvote_ratio": ""
    },
    {
        "title": "Had a disappointing encounter with a Jehovah's Witness.",
        "author": "madeinkorea24",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35r46z/had_a_disappointing_encounter_with_a_jehovahs/",
        "text": "So I answered the door like an idiot before I realized what I was doing. Instead of finding a lame excuse I thought I would hear what he had to say. There were two women in the car in the driveway that never got out of the car. The guy started out with a fairly weak intro of \"what societal ail would you most like to see fixed?\" From there he pulled out a section from Proverbs that said something to the effect of \"all good people will be on earth while bad people will be cut out.\" Then he made some argument about Adam and Eve being perfect until they sinned and then God had to punish them and their offspring forever. All I did was ask how Adam and Eve could have sinned if God made them perfect and the guy fell apart and actually asked to leave and come back when he thought about what I said. \n\nWas this middle aged guy being trained or was he just not used to actually talking with people? Has anyone else experienced something similar? I was expecting some interesting perspective and did not claim to be an atheist or anything. I do not really know anything about this branch of christianity and was hoping to learn something but instead I think I rattled this guy and now I feel bad, like a bully or something. ",
        "created_utc": 1431463163,
        "upvote_ratio": ""
    },
    {
        "title": "Bangladesh blogger Ananta Bijoy Das hacked to death - the third similar attack this year.",
        "author": "Hot_Beef",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35owyj/bangladesh_blogger_ananta_bijoy_das_hacked_to/",
        "text": "",
        "created_utc": 1431421084,
        "upvote_ratio": ""
    },
    {
        "title": "The Problem of \"Other\" Religions ( a continuation of sorts of my \"UFO\" post, and similarly long)",
        "author": "mothman83",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35on79/the_problem_of_other_religions_a_continuation_of/",
        "text": "So  [my post on  how no  one is angered by my no longer believing in UFO's took off](http://www.reddit.com/r/TrueAtheism/comments/350qwu/no_one_ever_gets_angry_when_i_tell_them_i_no/),  and I want to add a point of clarification. On the below  point from that post : \n\n&gt;This last point is key because logically it is obvious that at least one of those two christianities ( in my particular case the openly socialist anti-rich pro peace Liberation Theology, that Jesuit Catholics inculcated in my mother and that she then inculcated into me vs. the rabidly pro-GOP anti-poor pro war Supply-Side Jesus worshiped by the Southern Baptist church my grandmother took us to when I lived in Louisiana) had to be wrong, which meant that there where people who devoutly and profoundly believed in wrong religions through no fault of their own. Again : logically it is obvious that at least one of those two christianities had to be wrong, which meant that there where people who devoutly and profoundly believed in wrong religions.Once you realize that there are people who devoutly and profoundly and through no fault of their own believe in a “wrong” religion and have the same experiences and obtain the exact same benefits out of their religions as people that believe in “ right” religions do , well... then the idea that there is such a thing as a “ right” or “ true” religion is already doomed in your head . \n\n\n In many ways I  dislike pointing out a thing as being  key in my deconversion. I pointed out in the original post that this was one of  MANY factors. Clearly I think it is worthy of  emphasis but again I  hesitate making too much hay out of it. \n\n\n\n\nThe reason for this is because Christians ( and I assume  other religious folks, I do not wish to  pick on Christians, but in all honesty I  used to be a christian myself and every theist  I can remember debating religion  with is a Christian, so it is what I Know) have it drilled into their head that there is ONE thing that causes people to leave the faith (   the most common “ reason” I hear is that  \"A Christian  hurt them( the nonbeliever)\", causing us  to become disenchanted with the religion) and that the moment that one obstacle is neutralized the  entire edifice of faith will somehow reform itself in our heads and  we will rejoin the flock. \n\n\n Thusly one hesitates to emphasize any one experience because in doing so  Christians often latch on to  that one experience to the total exclusion of all other factors.  They think if they can fix that one problem all will be well. They stop listening to you.\n\n\n\nHaving said that , I need to emphasize this particular experience  . \n\n\n\n&gt;Once you realize that there are people who devoutly and profoundly and through no fault of their own believe in a “wrong” religion and have the same experiences and obtain the exact same benefits out of their religions as people that believe in “ right” religions do , well... then the idea that there is such a thing as a “ right” or “ true” religion is already doomed in your head . \n\n\n\n\nFor those of you  that are not familiar with evangelical Christianity ( or other religons that put a lot of weight on prosleityizing such as mormons  jehovah's witnesses and  I suppose  islam)  I  have to reiterate that what you just read is *extremely explosive* from the point of  view of these religions. \n\n\nAbsolutely key to the worldview Of these religions is the idea that everyone has a  “ god shaped” hole in their hearts. The only reason, according to these religions, that  people  exist in the world who are not members of those religions is because either they have not  heard the good news or because  these news has not been presented in such a way as to overcome the barriers ( be they cultural personal or “ demonic” ) that  stops them from accepting  this religion as the key to their salvation. \n\n\n\n\nIn other words members of other religions are deluded, but not only that , they would  KNOW   they are deluded if they   only experienced the wonder of the “ true “ religion. All other religions are superstitions, quite  probably demonic in origin. They have no chance whatsoever of filling the void that only the true god can fill.\n\n\n\n\nThis belief is reinforced continually. At one level this narrative is  insistent  and omnipresent within the culture of these religions. \n\n\n However, the main  source of reinforcement, one imagines, would be the  stream of new converts.  Religions that  both emphasize proselytization and  are exclusive (  the “ only path” to god/ salvation/enlightenment) tend to appeal to  people who are down and out and seeking something that will provide them with stability. Thus the  people who  convert all tell about how they were missing something and their lives were a shamble and finally the grace of god  found them and now they have their lives on track. Note, I don't   doubt the sincerity of what these people claim, but there are two major  problems with taking these assertions as evidence of a holy truth.\n\n\n\n Firstly there is a  self selection bias. People  for whom the message of these types of churches  does not hold an appeal  simply do not join. Therefore people within these churches only see those people for whom it does work, which, when mixed with the  constant bombardment from other elements of the church, can easily  make people  come to the conclusion that what worked for these  people would work for everyone. \n\n\n\nSecondly, I do not dispute that  for many people, becoming a member of a religious organization like this helps them find the strength to fight against  drug and gambling addictions, violent  impulses and the like. Humans are social creatures and  few things  give  people  stronger  psychological benefits than entering into a close knit social group. And as paradoxical as it seems, exclusionary “ our way or the highway” religions are precisely this.  It  turns out , psychologists tell us, that the more  difficult  it is to get into a group and the more demands this group makes upon us the more   loyal we become to the group. It is in a way, a form of cognitive dissonance ( “ I have invested so much into this  group, it MUST be true otherwise I am a fool and I know I am no fool”) This is the reason why  fraternities and sororities and  secret societies and  sports teams and elite  military units  haze new members. It, in essence solidifies group loyalty.   This  eliminates the weak links and solidifies  the bond among those who make it through, and once these bonds solidify the   ingroup becomes more loyal, each member  more loyal to each other member. This would indeed help to create the  kind of close knit community that could indeed provide an environment that would help people who  want to make dramatic changes in their lives.  The  “ testimony” of these people and the changes in their lives  serves as  further reinforcing of the “ truth” of these churches and religions. I mean  you saw how  Brother John went   from being a mean drunk to a good and attentive father due to the wonder working power of the Holy Spirit, what more evidence could you need? \n\n\n\n\nThe problem of course is when  two different Brother Johns experience the same wonder working power from two different   religions that are completely opposed to each other.  That is simply not supposed to happen.  Because how then are  you supposed to know which is the right religion? Do you just choose the one  you like the most? How is THAT a way to choose a  permanent eternal unchanging truth? \n\n\n\n\nThis is what happened to me. I experienced two religions  that were opposed to each other. And in each I found  good  confident  people who  were  devout and completely convinced that their religion was  the correct “ true” religion. \n\n\n\n\nThe first of these religions was the one “ I grew up” in. I did not attend church regularly  when I was a child ( in all honesty the  security  situation was  so bad you never really went anywhere public that you did not have to.) but  I was soaked in “ christian”  morality. The first book I learned to read was a children's bible, the first songs/poems I memorized where Hymns. My mother spoke of  Jesus as the ultimate moral authority. The son of god. But theology is not something you hammer into a little kid of preschool  or elementary age.\n\n\n\n Instead Jesus was the  friend of the downtrodden,  the poor, the enemy of the rich and callous. He was the original long haired sandal wearing rebel.  He was  born purposefully into poverty and lived a life  of poverty. My mom's jesus  is the jesus of  “ whatsoever you do to the  least of mine you do to me” and “ it is easier for a camel to  go through the eye of a needle than for a rich man to enter heaven.”.  My  Jesus was an openly socialist one  who cared about   minimizing the  plight of the  poor and the power of the wealthy. This Jesus arose from the education my mother receives at a Jesuit High school run by jesuit priests whom advocated  “ Liberation Theology”. \n\n\n\n\n\n Because liberation theology emphasized empowering the poor, the priests that advocated it were often seen as sympathetic to marxism and on the “ wrong side” of  the cold war. Several of my mother's teachers where kidnapped  and tortured to death  by Honduran security forces acting under the direct “ advice” of  United States “ diplomats”. A similar fate awaited  a friend and classmate  of my mother's  one of the first prominent student activists to face off against the right wing US backed military dictatorship that ran Honduras at the time. \n\n\n\n\nYou must understand, these priests and  activists were viewed as ***CHRISTIAN MARTYRS*** by my mother and the rest of the church establishment around them. The most currently prominent of these  is  probably  Oscar  Romero archbishop of San Salvador  who is on the track for canonization. The  people who martyred them where right wing military types  advancing the  right wing foreign policy  goals of the United States. \n\nWhen My mother and I moved to the states ( my father having to stay behind in honduras for a couple of years) we attended my grandmother's SBC church.\n\n SBC here means southern baptist convention, the largest protestant denomination in the  United States.\n\n\n\n My mother and Grandmother never became  comfortably fluent in English, whereas I had attended a bilingual school in Honduras, and grew up watching english language films and tv, listening to english language music and reading books in english. \n\n\n\n\nThusly I felt comfortable attending not  only the spanish  language services, but staying at church later ( we lived within walking distance) to attend the english language Sunday school and english language services as well.  \n\n\n\nI  am compulsive reader, and I dove headfirst into reading the bible both in english and in spanish. I have always had a knack for reading  and memorization, and  I loved public speaking. Soon I was memorizing and reciting  passages from the bible  in both English and Spanish. \n\n\n\n\n SO began  my unlikely one year reign as the “ prodigy” of the  youth  group. The youth pastor made me his special project, taking me on field trips to New Orleans Baptist Seminary, and telling me that I had a gift, and  when adult I should be either a pastor or a lawyer ( I am indeed now, one of those things). I was essentially being trained as a middle schooler, in very  basic theology, a sort of  pre pre seminary,  in the hopes that perhaps God would use me later in life  as a  Bilingual Bicultural  pastor, a liaison with the growing Hispanic  community. \n\n\n\n\n\nBut of course this meant I had to become  better educated in the  SBC brand of Christianity, and here it was the problems began.\n\n\n\n I learned these people did not “ believe” in evolution , which I seriously thought was a  joke the first ten times or so I heard it. After all, recall from my previous post, that up to now my dream job was to be a marine biologist. I  obsessively watched every David Attenborough/ David Suzuki documentary I could when I was a child. I had a subscription to National Geographic. To have an adult tell me that  Evolution was a lie was akin  to having  an adult tell me that  gravity or  photosynthesis were lies. ( recently I  saw the  excellent  documentary “ Going Clear” on Scientology, in it Paul Haggis recalls reacting to the OT3 material- you know, the stuff about Xenu- by thinking it was an “ insanity test” and they kicked you out if you claimed to  buy it. In a more unsophisticated primitive way my thirteen year old brain reacted similarly when I first heard SBC adults prattle about “darwinism”).\n\n\n\n\nI also became aware of  biblical stories and teachings that were to put it bluntly, kept away from me by my mother. My parents raised me with an emphasis on education, if they could be said to have a maxim it was “  all evil comes from ignorance, and all good comes from knowledge”. In that light it is kind of  obvious why the story of the  Apostle Thomas being ridiculed  by Jesus Christ for behaving in a completely sane   and rational manner when a person shows up claiming to be  his dear friend and  teacher who Thomas had seen be brutally murdered , well that was not the kind of story  my mother ever told me about. ( I remember when the  preacher read that story out loud in  a sermon.... until  Jesus  berated him  I was nodding along with Thomas and thought that  he would be praised... what a slap in the face it was when the opposite happened!)\n\nGiven how blatantly anti intellectual that( and so many other!) bible passage was, it is not a mystery to me why my education loving mother never mentioned it.\n\n\n\n\n\nThen of course there were things like  salvation by grace.  The way I understood the Christianity of my mother,  heaven and hell were afterthoughts, what really mattered was  what one did in the here and now to  help the poor, meek and  downtrodden.  Jesus  was  supposed to work something like  a source of inspiration,  an example to guide our work . A common saying in that group  was “ A dios rogando pero con el mazo dando” ( “praying to god but swinging the sledgehammer” ) what mattered was what you did   to help those not as fortunate as yourself, not what  God's opinion was of you. ( obviously there was the  intimation that god  would like you to  treat well “ the least of his”). The “ point” of Christianity was that it was essentially used as a tool by God to  help humans live out  the most moral life possible, and this most moral life was  one lived in service to the meek, the poor,  and the humble. \n\n\n\n\n\nThis  is in complete opposition to the  classical protestant understanding of “ salvation by grace” where god saves those who “ believe” in him  because.... well   he is god  so there is no *because*! Indeed  doctrines like “ utter depravity” made no sense and still make no sense to me (   Humanity is the masterpiece of an all mighty god.... yet we are so completely fucked up we can do nothing to fix ourselves? How in the hell are we a “ masterpiece” then? Seems to me that the all powerful all knowing creator of the universe would have flunked out of any engineering program I can think of.) \n\n\n\n\nThen there  was the fact that  the SBC is basically the religious arm of the GOP. The  bumper stickers of the cars driven by  the adults who praised my ability to memorize bible verses read “ Impeach Clinton”. They  supported the  party that wanted to drastically gut the  last remnants of the American welfare state, thus  increasing the suffering of “ the least of mine”  in the USA. What is more they admired Ronald Reagan,  a man I had grown up regarding as nothing less than a war criminal, ***the very same person  whose foreign policy created and  bankrolled the  death squads that had tortured to death the modern day Christian Martyrs of my mother's form of Christianity***! To My naive  barely teenaged  brain this seemed so outrageous that it would be almost the same as running into  Christians who considered Caiaphas and Pontius Pilate as heroes!\n\n\nNow I  want to make something very clear : I  AM NOT SAYING THAT MY MOTHER'S LIBERATION THEOLOGY IS THE “ REAL” CHRISTIANITY AND THE SBC IS “ WRONG” \n\n\n\n\nInstead  the thing I want to emphasize is that  despite the fact that they both labeled themselves  “ Christianity” these two religions  where in fact COMPLETELY DIFFERENT RELIGIONS WITH COMPLETELY DIFFERENT GOALS, THEY WERE INCOMPATIBLE  WITH EACH OTHER AND IN FACT DIRECTLY OPPOSED TO EACH OTHER. The ideal world of one religion would very much resemble the hell of the other. \n\n\n\n\n***IT WAS IMPOSSIBLE FOR BOTH OF THESE RELIGIONS TO BE TRUE. One of them, at the very least, was false***.\nAnd yet....\n\n\n\nIn  both religions I encountered “ Brother John's” whose lives were  in fact transformed  by these religions. In both religions I encountered people who faithfully and honestly believed their particular religion to be the TRUE religion, and they all had the exact same evidence for it, a relationship with god, the  numinous glory of the transcendent, the inner peace of prayer etc.  Both Liberation Theology and  SBC Christianity  provided the  EXACT SAME BENEFITS  to their believers  by and large ( there were differences of course, if you wanted help  in keeping the landlord from abusing you Liberation Theology was probably more helpful, if you were trying to quit  drugs cold turkey I assume SBC christianity was better, but these differences were *de minimis*, so small as to be inconsequential)  \n\n\nThe point though, is that  if you asked  members of both of these religions  how they KNEW their religion was real , they would have used THE EXACT SAME ARGUMENTS AND THE EXACT SAME PIECES OF EVIDENCE. Hell in this particular case they even worshipped the “ same” god (who apparently cared about completely opposite things) and shared the same (contradictory) holy book!\n\n\n\n\nThe point is that when it comes down to it, the main , perhaps the ONLY reason people were Liberation Theology vs SBC christianity was  THE PLACE THEY WERE BORN IN AND THE FAMILY THEY WERE BORN INTO. \n\n\n\n\nMy mother was into liberation Theology because that is what the Jesuits who ran her high school preached, and she was only exposed to it because  she went to that high school, and she only went to that High School because it happened to be the best High School in El Progreso, Yoro, Honduras. \n\n\n\n\n\nSimilarly  the SBC christians were born into SBC families, or in the case of converts, into a society such as the Southeastern United States where SBC and other similar evangelical Christianities where the dominant modes of religious and spiritual  expression.\n\n\n If  my  mom and the  SBC types had been born in Turkey, perhaps my mom would have become a Sufi mystic and the SBC types  would have become salafists... but there is absolutely no reason to believe that Liberation Theology or  SBC evangelical Christianity would have ever entered the picture.\n\n\n\n\n\n ( note: My grandmother was not born into the SBC but instead was also  born in Honduras  before liberation theology was a thing. So  what gives? She joined the church because it had a mission that  visited elderly spanish speaking immigrants like herself and provided them with warm meals. She met other immigrants at this mission, they became her friends and so she was now a member of the church. If you  had asked her to list the differences between the SBC and the Roman Catholics she would have  said “ no pope and no infant baptism” and  that is IT. If I had pushed  and talked about salvation through works vs salvation by  Solae fidae( “grace alone”), she would  have answered “ Oh yeah we dont sell indulgences” as if indulgences were the sum total of this crucial theological concept.  This theological illiteracy was the norm, NOT the exception among the hispanic immigrants who attended the spanish language service at our SBC church.  Indeed my grandmother was a vocal fan of Pope  John Paul the Second and  openly spoke  of him as a saint. As long as they filled seats and  tithed, no one cared that these older people were in essence still Roman Catholics) \n\n\n\n\n\n\n\n\n\nLet us focus and wrap  this up: \n\n\n\n\n\n\nThink about what   what all of this  means put together. It means that   different groups of people  who adhere to different incompatible  religions, can , through no fault of their own , be completely convinced that their false  religion is in fact  the true religion  and experience the same benefits and experiences as  those who believe in the “ true” religion,  and in no way shape or form   EVER suspect they are believers in the wrong religion!\n\n\n\n\n\n\n\nSo what? \nWell so nothing, perhaps,  if  you are say a Universalist or perhaps a Bahai. \n\n\n\nBut if you, like most  religious people in the western world,  believe  in an exclusionary religion, well then think about the untenable position  in which this places  you. \n\n\n   Assuming you are such a believer, **now you must deal with the fact that  your God apparently allows  false religions to exist, and allows these religions to be an EXACT PSYCHOLOGICAL  SIMULATION of the “ true” religions, thus causing all these people to go to hell/ be damned/ avoid salvation even though they NEVER EVEN SUSPECTED that they were doing anything wrong. In fact   this people would have WHOLE HEARTEDLY BELIEVED THEY WHERE SAVED WHILE BEING IN FACT DAMNED**.  My mother is damned from the point of view of the SBC christians. The SBC christians support anti Christian ways from the point of view of the Liberation Theologists, and My  grandma is damned under both world views  since  her viewpoints would, completely unbeknownst to her,  be heretical to BOTH of them. \n\n\n\nAnd we are not even counting the Muslims and Hindus etc  who by the billions, believe themselves to be enlightened/ saved etc, and have not the slightest suspicion of how damned they are. \n\n\n\nIf you believe in an *exclusive* religion, (and if you are reading this and are a theist chances are overwhelming that you  are a believer in an exclusive religion, since they dominate in the western/ english speaking world), then everything I have said here **HAS TO BE A LIE**. My experiences  must be mistaken. One of those two  groups MUST secretly  suspect their religion is a lie, or at the very least feel the void that would be filled if only they were to encounter the “ real” religion. \n\nBecause the alternative is too horrible for you to accept.\n\nThe alternative is that  your god  ***knowingly*** allows people to be fooled by false religions while knowing  through his omniscience  that these people are completely honest in their  beliefs and yet are doomed to damnation because, due to the accidents of birth and environment they “ picked” the wrong  religion. What is more, the  effects of these religions are indistinguishable to each other so there is nothing intrinsic to the religion that would cause people to doubt it. And of course your god refuses to  provide  extrinsic objective verifiable  evidence that would allow an  outside observer to determine which religion is “ true”. \n\n\n\n\n\nIn order words your god is a trickster god, and a MONSTER.\n\n\nMONSTER?  \n\nYes monster. Because a god who mines the field with false religions that are indistinguishable from the true religion(s) is a monster. Especially if there are more false religions than true ones. \n\n\n\nBECAUSE IF GOD IS TRICKING THEM HOW DO YOU KNOW  HE IS NOT TRICKING YOU?  In fact mathematically, it is a **NEAR CERTAINTY** that you are worshipping a false religion. After all  there are thousands of religions out there, but only one is  “true.”\n\n\n\n\nAnd there is nothing you can do about it. \n\n\n\n\nFeel confident in your faith? Under this scenario so do the followers of the false religions.\n\n\nFeel inner peace? So do the  followers of the false religions. \n\n\nHave a relationship with god? So do the followers of the false religions. \n\n\n\n\nYOU ABSOLUTELY HAVE TO  convince yourself I am wrong. You have to convince yourself that the followers of all religions but yours  feel an emptiness inside. You have to. \n\n\nBecause the moment you realize what I realized.... Is the moment the very concept of there being such a thing as a  “true religion” is *doomed* inside your mind. \n\nThat is ALL it takes.\n\n\n\n\n",
        "created_utc": 1431412567,
        "upvote_ratio": ""
    },
    {
        "title": "Any hope for my father?",
        "author": "Drysaf",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35o1e6/any_hope_for_my_father/",
        "text": "",
        "created_utc": 1431395821,
        "upvote_ratio": ""
    },
    {
        "title": "My brother is going through some pretty bad depression, and one of his friends has gotten him into \"self healing crystals.\" Is it better to let him buy into that stuff (and hope for a placebo effect) or to show him that it's all nonsense?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35nd0i/my_brother_is_going_through_some_pretty_bad/",
        "text": "Without going into too much detail, he's been admitted to psych wards twice this year already for short term stays. He's prone to self medicating with weed, which the doctor says is hurting note than helping. He is not very compliment with his medication and instead is leaning towards this crystal stuff. \n\nIs it best to let him believe it and hope it helps or tell him that he needs to listen to the professionals and not some mystical piece of quartz? ",
        "created_utc": 1431383825,
        "upvote_ratio": ""
    },
    {
        "title": "I need someone to destroy my logic regarding life and death.",
        "author": "Richard_the_Saltine",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35kcq0/i_need_someone_to_destroy_my_logic_regarding_life/",
        "text": "So I'm a bit of a transhumanist, and I'm on a pro-life binge. Help me cut the fat off my argument and perhaps make a better point, or possibly CMV. \n\nThis is for a debate I'm having with my SO about the inevitability of death. She accepts death and wants to live a full, exciting life then die content. I don't accept death, and want to live as long as I can, *and* have a full, exciting life. \n\nDisclaimers: I'm not a physicist, philosopher, or logician. I have a sneaking suspicion that I might not know what I'm talking about. Please be gentle. ",
        "created_utc": 1431320082,
        "upvote_ratio": ""
    },
    {
        "title": "I found an old hard drive about a month ago. On it was this essay I wrote in high school about evolution.",
        "author": "pianomancuber",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35k2d2/i_found_an_old_hard_drive_about_a_month_ago_on_it/",
        "text": "[[Cringe Warning]](http://imgur.com/a/C9Gex)\n\n(*x/posted from /r/exchristian because I thought you guys might like this too.  This is the power of creationism brainwashing, and why it's so important to teach kids incredulity and critical thinking.*)       \n\n\nI wrote this 10 years ago, when I was a freshman in high school. I had completely forgotten about it until just now, and I'm totally blown away by how utterly ignorant I was. Look that bibliography!! I can only imagine what my teacher thought about me and my parents.... This is why it is crucially important to teach reason, science, and evolution thoroughly to kids in school. I'm kinda pissed that I was so brainwashed.       \n\nShare your store if you've been where I was.  Is fundamentalist Christianity unique in this way?  As in, do any other religions emphasize such blatant anti-science and confrontationalism?",
        "created_utc": 1431313399,
        "upvote_ratio": ""
    },
    {
        "title": "I have concluded that electricity, water and gas are delivered to my home by God. Utilities are too complex to have happened by chance. ;-)",
        "author": "sotopheavy",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35jaxw/i_have_concluded_that_electricity_water_and_gas/",
        "text": "",
        "created_utc": 1431297794,
        "upvote_ratio": ""
    },
    {
        "title": "Thiest procrastinator up for a civil debate",
        "author": "clone448",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35itre/thiest_procrastinator_up_for_a_civil_debate/",
        "text": "",
        "created_utc": 1431288699,
        "upvote_ratio": ""
    },
    {
        "title": "Is a life promoting atheism a life well-lived?",
        "author": "Soycrates",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35ik7x/is_a_life_promoting_atheism_a_life_welllived/",
        "text": "Putting aside questions like \"Do we even have a duty to live a good life?\" and \"Is it wrong to believe there are such things as 'good' and 'bad' lives?\" (you can bring these up if you *really* want to, but I would hope that they aren't central to your argument), is a life promoting atheism a life well-lived? Atheism has come under fire for many reasons - whether it's fundamentalist Christians telling us we'll burn in Hell for denying their God, or everyday semi-religious folk who think that being openly atheist and arguing about religion is a \"waste of time\", there is always someone out there with a reason why atheism bugs them.\n\nI'm taking some of the classical view of a life well-lived into account, [originating from Aristotle](http://philosophyforlife.org/philosophies-for-life/aristotelians/#sthash.umPVcEey.dpuf):\n\n&gt; According to Aristotle, each species has its particular nature, and the good life for that species is one that fulfills its nature. So he begins his ethical inquiry, in the Nichomachean Ethics, by asking what is the nature of man. He decides man has both a rational and an irrational system in his psyche, and that human nature also has a natural drive for human society (‘man is a political animal’), for knowledge, for happiness, and for God. The good life is a life that fulfils these natural drives, and directs them to their highest end. That’s what philosophy does: it uses our rational mind to guide the natural desires of our psyche to their highest fulfillment, which Aristotle calls eudaimonia, or flourishing. Philosophy, then, is the bridge between human nature in its raw and undeveloped form to human nature at its highest.\n\nI do think that what the good life is for a being is wholly dependent on what kind of being that is. The good life for, say, a pig wouldn't necessarily be the good life for a human. But there is much more to humankind than being \"a rational animal\" - while we have the capability and desire for knowledge, we also have the capability and desire for companionship and freedom from harm. But obviously, when it comes to the good life, I think that life can be lived without God, as God is not central to our nature as human beings. I think it is our desire to feel connected to something powerful and good that is being mistaken as our \"natural drive for God\". While some people experience the desire to feel connected to something powerful and good as leading them to a religious community and a life of worship, others experience this drive as an incentive to change the world in positive ways: to be an activist, philanthropist, progressive thinker, even leader of new trends.\n\nWe might all agree that someone who has a considerable amount of knowledge, is generally free from harm, has found companionship and good social standing is living \"a good life\". But I think a case can be made that a life is not truly well lived until it achieves that elusive connection to the good and the powerful. Say a man amasses a large amount of knowledge, gains enough wealth to be free from harm (including starvation, illness, etc) and is well-liked by others. Does he do wrong if he never uses that knowledge for any purpose, if he never uses his wealth for any other reason than to protect himself and make himself happy, never uses his good social reception to influence the lives and beliefs of others in a positive way?\n\nI want to make the case that in order to live a great life, and not merely a good one, we must use our knowledge, our happiness, and our social talents in a way that seeks to change the world for the better. Additionally, we should always strive for a great life, and not merely a good one, even if we may never achieve a truly great life. We do not need to reach perfection of our goals - the act of reaching itself gives our life worth.\n\nNext, then, we have to ask: what exactly is it we do when we promote atheism? I'm not ashamed to be an atheist, or even to be an anti-theist, so from my perspective I do think promoting atheism is a life well-lived, in that it changes the world for the better - it uses the knowledge we have and our social capability to reduce stigma against non-believers, to ground our law-making and moral reasoning in tangible phenomena rather than mystical deities, to set a path for humankind where we are actively aware just how much we control our own lives and society.\n\nSome people might say that the promotion of atheism is not a direct enough \"good\" to justify devoting one's life to it. After all, instead of spending time talking about atheism, religious persecution, the harm of pseudoscience and the like, we could be spending more time providing food and shelter to the poor, raise funding to cure diseases, abolish cruel or unjust yet legally accepted practices (LGBT discrimination, wage slavery, animal abuse, environmental degradation, and so on). The counter-argument to saying that promoting atheism is a life well-lived is the claim that promoting atheism should not be considered a valid social cause. Anyone who champions this view could cite many reasons: atheists are not prohibited from getting married, atheists are not paid less for their labour than others, atheists are not routinely slaughtered or used for entertainment or experimentation, atheists do not have their homes disproportionately attacked by hate groups. In short, the idea is that since \"atheism doesn't have the short end of the stick\", we should be focusing our efforts elsewhere in order to live a good life and, ultimately, to live an altruistic one. The counter-argument could be made that even religious people do things with their lives that could be time better spent elsewhere, although I don't consider this a very strong argument - it's basically like whining \"Yeah, b-b-but you waste time too! I saw you golfing once! What does golf do for the world?\" (I also consider a moderate amount of self-relaxation and enjoyment to be integral to a good life, since an unhappy person is far less likely to be able to consistently do good for others - it's harder to get out there and be active for a cause when you're not feeling well, for whatever reason, mental or physical)\n\nTo recap:\n\n1. Do you think this view of the good life (based in Aristotelian thought, but modified to suit a secular world) is useful/accurate or not, and why?\n\n2. Do you think a life of promoting atheism can follow from that view of a good life?\n\n3. Do you think promoting atheism should be seen as on par with other social issues?\n\n4. Do you promote atheism as a social issue, or merely out of personal interest/enjoyment?\n\nAnd a controversial last question,\n\n5 . Do you think someone can lead a truly well-lived life if they are devoutly religious? (Assuming that there is no God/Gods, is it wrong to lead a life worshiping one? Does it detract from a well-lived life to be wrong about something you hold central to your identity and view of how the world works/exists?)",
        "created_utc": 1431283797,
        "upvote_ratio": ""
    },
    {
        "title": "Could you guys provide some advice regarding parental relationships",
        "author": "kentuckyfry",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35i87g/could_you_guys_provide_some_advice_regarding/",
        "text": "I'll keep this brief. It's Mother's day. My two younger brothers and I are not religious - my single mother is. For Mother's day she wanted us to spend time with her and that includes going to her Catholic mass. I'm on the way to the mass right now but I just feel like this isn't respectful of our own beliefs.. At the same time I don't want to upset my mom, I really care about her. What would you guys do in this situation?",
        "created_utc": 1431277538,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts from a rant on r/atheism: Does having an antagonist (ordered religions) allow us a common enemy to rally against in order to feel our sense of community?",
        "author": "darkthoughts_1",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35hoe5/thoughts_from_a_rant_on_ratheism_does_having_an/",
        "text": "A gentleman asked over on r/atheism if it was a smart thing to be bashing and slashing the \"enemy camp\" so to speak. My response was that it was just the expression of 2 million members free to post as wanted. The micro of the macro. \nI guess it's hard to be the hero without an arch enemy.\nHeaven needs Hell\nConservatism needs socialism\nHot needs cold\nIf only for reference huh?",
        "created_utc": 1431266083,
        "upvote_ratio": ""
    },
    {
        "title": "My perspective on spirituality and religion. Hoping for discussion and sharing. I'm leaving the serious out but please be respectful of others.",
        "author": "BiPoLaRadiation",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35gzef/my_perspective_on_spirituality_and_religion/",
        "text": "",
        "created_utc": 1431240739,
        "upvote_ratio": ""
    },
    {
        "title": "Can I redeem my choice to attend a Catholic university? (X-Post: CMV)",
        "author": "AllInTheRamily",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35fj0l/can_i_redeem_my_choice_to_attend_a_catholic/",
        "text": "I received a decent scholarship to attend a private Catholic university on the East Coast. Despite being an atheist, feminist, communist, artist-type guy, I decided to go there. Initially I thought the benefits of the city location, good academics, and the school’s reputation would outweigh the school’s religious affiliation. However, now that I’ve spent a year living on campus, I have come to view the university’s Catholicity as a major issue and I’m planning on transferring to a state school. \n\nSome concerns I have:\n\n* Paying the Church - I don’t like that, even with a scholarship, I am paying partial tuition, room/board, and fees to support this university, in turn helping to preserve the hegemonic and regressive Catholic Church. \n\n* Administration’s conservatism - Concerned above all with the preservation of the school’s Catholic values and practices, the administration only gives lip-service to student’s needs and desires. Sexual assault victims are written off. Complaints from Resident Advisors about malicious managers in the Residential Life office haven’t received comment. Flyers and events, which require administration’s approval, are often delayed to their end. I suspect the administration's abdication is the result of both a conservative, business-owning, Catholic Board of Trustees that holds stalwart to traditional rules and measures academic success by the numbers and a need to cover up for the reputation of the dying Catholic schools.\n\n* Academic focus - The school’s strongest programs are medieval history, theology, English, and business (separated into a better-funded business school). I imagine that the kind of professors and faculty who choose to teach at this school have similarly conservative, traditional interests and teaching styles. My academic interests are oppositely social justice and experimental film!\n\nMy reason for leaving is that I don’t want to give my money to support Catholicism. I could fight to change the school’s policies and student’s existing opinions, but even with the best that I do there, the school will continue to exist. It will be Catholic forever, or die after losing enough support to secular public and private schools. Giving my financial support and doing advocacy at a state school seems like a better use of my life. \n\nCan you think of any reasons why I should stay here and dismiss these worries? (I feel like my friends would be fine without me and that it’s a bad idea to stick around just for them while my academic and political interests are suppressed by the institution I want guidance from)",
        "created_utc": 1431206751,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone here done the Birthright trip?",
        "author": "Lunchboxzez1229",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35f462/has_anyone_here_done_the_birthright_trip/",
        "text": "",
        "created_utc": 1431198633,
        "upvote_ratio": ""
    },
    {
        "title": "Is Atheism a luxury of the first world?",
        "author": "darkthoughts_1",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35e01e/is_atheism_a_luxury_of_the_first_world/",
        "text": "I speak from my own experience. Having lived 55 years and gone through wealth periods to homeless and a period in jail. The periods of my life were I could not grasp why things were happening to me, were the points where I reached to that supreme being, hoping for help. Other times I would just accept that what was happening was the result of MY actions. I have lived in areas of extreme poverty and ignorance. I have lived in gated communities. Those who had no problem providing their basic needs, tended to be much less religious. \n\nThoughts?\n\n\nEDIT: I want to thank everyone who have responded so far. I am impressed by the wonderful intelligent points of view, you have all shared.. It's been nice to read all of you.",
        "created_utc": 1431174246,
        "upvote_ratio": ""
    },
    {
        "title": "How so you guys feel about wearing crosses as jewelry? The cross does predate the symbol of the cross. I never really thought it was that weird to do. What's your take on it?",
        "author": "blueberrymuffinman",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35dnaq/how_so_you_guys_feel_about_wearing_crosses_as/",
        "text": "There are some non-religious people who don't like to or shy away from wearing jewelry with religious ties/using swear words like \"Oh my God\" etc. I was just wondering how you felt about it. The symbol for the cross was around before Christianity during Egyptian times, and even of if hadn't been plus signs are everywhere anyway. I feel like even though I'm not spiritual per se I can still enjoy the culture I'm in without subscribing to it's doctrines. I'm interested in your take on it.",
        "created_utc": 1431160581,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about wearing crosses as jewelry? The symbol does predate Christianity. I never thought it was that weird until someone pointed it out to me.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35dmi9/how_do_you_feel_about_wearing_crosses_as_jewelry/",
        "text": "",
        "created_utc": 1431159676,
        "upvote_ratio": ""
    },
    {
        "title": "Current Ongoing Debate; Topic: Is Christianity Coherent?",
        "author": "linford86",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35dgnq/current_ongoing_debate_topic_is_christianity/",
        "text": "",
        "created_utc": 1431153558,
        "upvote_ratio": ""
    },
    {
        "title": "Do you ever get bored with the question of god's existence?",
        "author": "The_Archagent",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35cs8m/do_you_ever_get_bored_with_the_question_of_gods/",
        "text": "When I first realized I was an atheist, I spent a lot of time researching \"proofs\" of god's existence and the fallacies that people use to defend their beliefs. I understand why the question is important to people. But lately, I just don't find any of these questions interesting. Do you ever wish we could just let the question go and work on other things?",
        "created_utc": 1431135852,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure what to do with my family situation - looking for advice.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35btjl/not_sure_what_to_do_with_my_family_situation/",
        "text": "I'm now 21. My relationship with my Muslim family is degrading more and more as time goes on. Just for some context, I've come out as an atheist before. When I did, my dad hit the roof. He said the only thing holding him back from killing himself was his religion, because he felt somehow he failed. \n\nI live at home with my brother, step-mom (also painfully religious), and my dad. My brother's not very religious. I think it's only a matter of time before he disbelieves. He's the one I worry about most, because even though I know he can handle himself (he's financially and academically better off than me - the favorite sibling), I don't want him to go through dealing with my dad's emotional roller coaster. I don't violently fear my dad, I just will never be able to be myself with him in my life. He's made it abundantly clear. \n\nSo now for the question: Does anyone have any experience with bailing on family? Did you keep in touch with anyone? Would you recommend it? What would you change?\n\nSorry if my post is scatter-brained, I can provide any missing details. \n\nThanks. ",
        "created_utc": 1431116708,
        "upvote_ratio": ""
    },
    {
        "title": "Argument maps",
        "author": "3D-Mint",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35axkr/argument_maps/",
        "text": "Hi /r/TrueAtheism, I was reading [Sean Carroll's post-debate reflections](http://www.preposterousuniverse.com/blog/2014/02/24/post-debate-reflections/) when I thought that [argument maps](https://en.wikipedia.org/wiki/Argument_map) should be made on popular God arguments (like the Kalam or fine-tuning).\nI think this would make debating and discussing Mr.Yahweh's existence much easier. \n\nHowever, I've failed to find a site that allows a community (like this sub) to create argument maps and contribute to it, all I've found are private and unsharable and also require signing up.\n\nSo if anyone's familiar with argument maps site that allow map sharing and contribution w/o the need to sign up and log in that'd be great.\n\n**EDIT:** [Here's commonsenseatheism discussing the exact same thing, the article writer has also listed a bunch of softwares which is *great*](http://commonsenseatheism.com/?p=1903)",
        "created_utc": 1431101420,
        "upvote_ratio": ""
    },
    {
        "title": "Rant: Listening to empty religious speech at policeman's funeral",
        "author": "riddeford",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35ax0q/rant_listening_to_empty_religious_speech_at/",
        "text": "We live in the NYC area and recently a 25-year-old cop was shot in the face and killed. My wife is watching the funeral service on TV and I am listening to people reading from the bible. I just heard presumably the religious leader saying \"Jesus keeps his promises. How do we know? Because we prayed to him as children and as adults..\" something to that effect. \n\nHere people are mourning this young man being killed in cold blood and this hooplehead is talking about how Jesus keeps his promises. What promises is he referring to? If I were the family I'd be outraged that someone said this was part of god's plan. I would not want to deny someone a mechanism for coping with tragedy, but I just don't understand how this nonsense can comfort people. Sorry, just needed to rant.",
        "created_utc": 1431101148,
        "upvote_ratio": ""
    },
    {
        "title": "how did you come to terms with your mortality as an atheist?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/359s4k/how_did_you_come_to_terms_with_your_mortality_as/",
        "text": "i've never subscribed to religion and have always described myself as being an atheist. But despite only being nineteen, I've recently been thinking about mortality a lot - the idea that one day I'll no longer exist, I'll no longer be able to do the things I love, be with the people I love and so many other things.\n\nTo be frank, it's been kind of discomforting. So my question is: how did you, as an atheist who believes in no concept of an afterlife, come to terms with your mortality and the fact you'll forever cease to exist one day? ",
        "created_utc": 1431073475,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist version of hell. Could use a little help guys.",
        "author": "SouthernTeapot",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/359ccl/atheist_version_of_hell_could_use_a_little_help/",
        "text": "Note:  This isn't anywhere near finished and may not make complete sense, but I am posting it now because I feel a panic attack coming on and need help now.   Will try to update as I can.\n  \nTL:DR  Religion. Bad health.  Depression.  Drug use.  Thoughts of suicide.  Atheism.  Infinity.  Some early signs of psychosis.  Getting help but would really appreciate yours too.\n\nIf the Universe is infinite, why shouldn't we (atheists) be just as afraid of infinite suffering as anyone else?     \n\nI have always had a deep interest in science, theoretical physics, the origin of the universe, and anything related, so I am reasonably well versed in these topics.  I have a degree in psychology and a JD.  I am fully aware I need professional help, am getting it, and on meds.  \n\nThe problem is that I live in the Deep South (I don’t have the means to get out ATM) where virtually EVERYTHING triggers thoughts of religion, depression, anxiety, etc.  This is a last try at sanity before going inpatient which for above mentioned reasons I am pretty terrified of.\n\nPlease help guys!  Even if you can’t answer the actual question, I would welcome any other advice, tips, positive comments, encouragement, etc. \n\nEDIT 1:  Thanks for all the comments!  I am feeling much better, in large part due to you guys.  \n\nEDIT 2:  Relevant answer to a question below regarding my drug history and present:  I'm not currently on anything other than anti depressants, lithium, a mild benzo, and stuff for my health.\nI have previously had problems with alcohol, benzos, pain pills, adderall, and phentermine.\nI've tried a good bit. Never done heroin or any psychedelics.",
        "created_utc": 1431060492,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone help me with an argument I had with my SO? What is the difference between drawing a picture of Mohammed and burning a national flag?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/35955u/can_anyone_help_me_with_an_argument_i_had_with_my/",
        "text": "Context: My SO and I are both left on the spectrum, politically and socially. I'm a reluctant capitalist and my partner is more towards socialist end.\n\nI'm also a very strong atheist, with very strong views about Charlie Hedbo, self-censorship and the like, especially when dealing with religious sensibilities.\n\nMy partner is less so. She obviously believes in freedom of expression, freedom of speech and thought, and the freedom to draw whoever you want. However, the point at which our points of view depart is in the value of drawing Mohammed. What does this achieve? Is it purely designed (in the Texas shooting example at least) to bait Muslims? \n\nWhat does drawing Mohammed achieve apart from annoying Muslims (many of which are liberal, progressive etc)? How does it move the conversation about freedom of expression in secular societies forward? I believe it contributes to the ongoing discussion about religious codes and their inability to function in liberal-democratic societies. It is especially relevant when you add in the self-censorship displayed by people reporting on pictures of Mohammed.\n\nSo my partner presented me with this question:\n\nWhat is the difference between drawing Mohammed and burning an Australian flag? \n\nSome context: we are both Australian, and burning the Australian flag happens a lot on our national holiday, Australia Day. This is an (arguably) terrible day, as we have an awful record of dealing with our native people, a complicated relationship with our troops during the 2 World Wars. \n\nObviously both are legal, but pushing the limits of good taste, and burning flags (even if one has reason to do so) is not particularly good at forwarding one's point of view.\n\nAnyone have any particular insights on this argument? \n\nThanks in advance! Please let me know if I should clarify anything further.\n\nEdit: to clarify, my position is that depictions of Mohammed serve the purpose of normalising blasphemy (my opinion: a good thing). My partner's position is that it serves no other purpose than pissing off Muslims.\n\nEdit mach deux: Thank you for everyone's input. Between those of you who have suggested I seperate from my partner, there has been some good commentary. The problem I'm having at the moment though is seperating the feeling I have for drawing Mohammed and burning a flag - I think most people can at least accept that there is an argument for them being morally and logically similar. Why then, do I feel different about the two? Why does it seem *seem* that there is a difference?\n\n",
        "created_utc": 1431055961,
        "upvote_ratio": ""
    },
    {
        "title": "On the offchance I'm wrong, would like your feedback.",
        "author": "DaystarEld",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/356ttl/on_the_offchance_im_wrong_would_like_your_feedback/",
        "text": "So I got into an [argument](http://np.reddit.com/r/AskReddit/comments/3523cw/if_you_could_tell_reddit_to_shut_the_hell_up/cr0r5oc) with someone last night about the use of the phrase \"agnostic atheist.\"  \n\nThey've been trying to insist that \"Nobody seriously uses the label \"agnostic atheist\" anywhere but reddit and other internet atheist hang-outs,\" and only \"atheist dorks\" like Dan Barker and Penn Gillette use atheist to mean anything but absolute assertion of the nonexistence of God.\n\nHe doesn't seem particularly smart enough to make his own point properly as he keeps dismissing any examples I bring up, so I wanted to get some feedback from others on this. Obviously this is another \"internet atheist hangout\" so it's irrelevant to him.\n\nDo you guys often see others (besides religious people) using the phrase \"atheist\" to mean absolute disbelief in God, even other agnostics and atheists?  Or do you more often see it as a sliding scale, or even the combination of \"agnostic atheist\" vs \"gnostic atheist?\"",
        "created_utc": 1431015424,
        "upvote_ratio": ""
    },
    {
        "title": "Happy National Day of Reason!!!",
        "author": "DreamCheeky",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/356a7d/happy_national_day_of_reason/",
        "text": "",
        "created_utc": 1431006034,
        "upvote_ratio": ""
    },
    {
        "title": "Is the pope atheist? A short read on beliefs that are merely decorative.",
        "author": "RUSSELL_SHERMAN",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3566yb/is_the_pope_atheist_a_short_read_on_beliefs_that/",
        "text": "http://www.fooledbyrandomness.com/isthepopeatheist.pdf\n\nI don't think that the pope is actually *atheist* in the strict, classical sense -- of course not -- but it's an interesting way to look at things. If you remove all the extra, superficial things, and are left with someone's behavior, and you can't tell the difference between how they act and how another person (with supposedly different beliefs) would, then what does it say about their 'actual' beliefs?\n\nOf course, people are people, and nobody acts according to way they say they believe all the time, at a perfect 1:1 ratio. I wouldn't say this is a valid argument against theism, or for the pope's 'atheism', but it's food for thought on how words like 'faith' are essentially empty if it's not actually manifested in a way that sets it tangibly apart from 'non-faith'.\n\n**EDIT:** A couple people are sort of misunderstanding what I'm discussing -- it might come from them not actually reading the linked article. I'm not arguing that the pope *is* atheist. Rather, I'm trying to show that there are going to exist instances where beliefs and behavior don't map out (especially when there are large stakes, such as a life-or-death situation). This a sort of internal, cognitive inconsistency, and I posit that it's going to be much more present in the psychology of a religious individual when compared to that of a non-religious individual. From there, we can intuit that the non-religious stance is a clearer, more rational viewpoint to hold: in part because it prevents contradictions between speech and action, but also because it's evidently the one that a typical, healthy person instinctively resorts to when their life is on the line. Ultimately, the fact that beliefs often reveal no differences than non-beliefs when actual risks are involved might be pointing to something very, very interesting. \n\n",
        "created_utc": 1431004293,
        "upvote_ratio": ""
    },
    {
        "title": "Help me compare &amp; contrast this argument against theism, with this argument that we're all trapped in the Matrix.",
        "author": "wanttometal",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/355fzy/help_me_compare_contrast_this_argument_against/",
        "text": "Okay, this is going to be long and I am the *worst* at tl;drs. Sorry.\n\nThere's an argument against god(s) which I'm blanking on the name of, that says that the Universe looks how we'd expect it to without a(n active) god. You look at evolution, and it does some pretty cool things but is still obviously blind and has no goal. You look at morality, and it's basically just a strong belief in doing the things that happen to have kept our ancestors alive. Physics, apparently, is similar. Though people say they've witnessed miracles, there have never been any testable ones, which is what you'd expect if they never happen.\n\nWhen I heard that argument, it seemed pretty solid. It still does. It may not disprove the existence of any god, but it certainly lowers the odds.\n\nLast night I was over in /r/asksciencefiction and saw [this really good thread](http://www.reddit.com/r/AskScienceFiction/comments/34teb7/the_matrix_an_eccentric_guy_named_morpheus_tried/cqxxam6) about signs you're a sim, based in part on an SMBC comic. Basically, the world looks how it would if it were designed to save computational power. There are absolute limits on how fast or cold things can be. However much information you set out to consume, a lot of it will turn out to be repetitive and unimportant. Physics follows simpler rules on a large scale, only being calculated in full detail when someone looks at it up close.\n\nThat post was just one of those jokes that makes you think. At first I went \"holy shit, I'm in the Matrix!\" But then I considered, there would always be *something* in the world you could say saves processing power, even in the top, non-simulated reality.\n\nYet these arguments seem kind of the same. What do you think? Are these arguments both good? Both crap? Or is there some real difference between the two that I just haven't managed to put my finger on?",
        "created_utc": 1430982106,
        "upvote_ratio": ""
    },
    {
        "title": "My sister agreed to a book exchange.",
        "author": "InterestedInThings",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/354yvn/my_sister_agreed_to_a_book_exchange/",
        "text": "Even though we have opposite beliefs, my sister and I get along very well.  She agreed to exchange one christian book for one book of my choosing, but I am not sure which one I should choose.  Ideally it would be a book that is not as blunt as The God Delusion.  A little background, she is not a creationist (although I don't think she fully understands evolution), she is smart and probably just needs to be asked the right questions.  From some basic research I have been considering \n- A daemon haunted world\n- Misquoting Jesus\n- Breaking the spell\n- Sense and Goodness Without God: A Defense of Metaphysical Naturalism \n I would appreciate any suggestions you all have!",
        "created_utc": 1430969943,
        "upvote_ratio": ""
    },
    {
        "title": "A Christian teacher's view of atheism and deism",
        "author": "larrybirdsboy",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/354u6o/a_christian_teachers_view_of_atheism_and_deism/",
        "text": "I attend a Christian high school with a mandatory course on biblical scripture. In class, the teacher speaks of different philosophies and religious beliefs, and decides to critique atheism and deism.\n\nHe grasps a clock with his hands and says, \"I'm going to look at this clock as though I am an atheist.\" (I'm looking forward to this) \"Now, this clock is amazing, its pieces fit together to perfection. Now, I believe that these come from an chaotic explosion! In this explosion, things came together for no apparent reason and formed this clock in perfection.\" Everybody in class chuckles, believing this to be what atheists think. \"The only difference between this and deism is, deists believe God put the pieces there for the explosion!\"\n\nNow, since I felt like sharing this topic, what is right/wrong with his illustration of deism and atheism? Do you have any responses for it?",
        "created_utc": 1430967275,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why atheists terrify believers\"",
        "author": "juanker52",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/353zup/why_atheists_terrify_believers/",
        "text": "http://www.psmag.com/health-and-behavior/why-atheists-terrify-believers\n\nVery interesting article about a study that alledgedly demonstrates how the concepts of atheism and fear of death relate on theists' minds.\n\n&gt;Non-believers are not only distrusted; they also stir up morbid thoughts, and perhaps raise discomforting doubts about what happens after we die.\n\nTo what extent does this article correlate with your experinece?",
        "created_utc": 1430951361,
        "upvote_ratio": ""
    },
    {
        "title": "I was extremely rude and I'm not sorry for it.",
        "author": "MonkeyKing_",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/353ydk/i_was_extremely_rude_and_im_not_sorry_for_it/",
        "text": "",
        "created_utc": 1430950673,
        "upvote_ratio": ""
    },
    {
        "title": "Do you guys support physical discipline of a child?",
        "author": "AverageMidget",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/351ewm/do_you_guys_support_physical_discipline_of_a_child/",
        "text": "",
        "created_utc": 1430901569,
        "upvote_ratio": ""
    },
    {
        "title": "No one ever gets angry when I tell them i no longer believe in UFO's... ( very long but from the heart)",
        "author": "mothman83",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/350qwu/no_one_ever_gets_angry_when_i_tell_them_i_no/",
        "text": "No one ever gets angry when I tell them i no longer believe in UFO's...\n\n\n\n\n\n\nBy UFO's of course I actually mean the hypothesis that at least some UFO sightings are of spacecraft being piloted by alien beings. Clearly people see things in the sky they   honestly cant identify, and these are , of course, truly UFO's in the literal sense.\n\n\n\n\nWhen I was three years old i watched *Close Encounters of the Third Kind* for the first time. I was captivated. It became  ( and remains) my all time favorite film. The fact that at the time I physically resembled  the little boy in the movie probably helped.\n\n\n\n\n\nThe movie instilled in me a fascination with the concept of  non human intelligence. Not AI but biological intelligence, particularly the   kind that could have evolved in circumstances and environments much different than our own. One of the ways this manifested was  in a deep interest in whales and dolphins. These “ minds in the water” absolutely absorbed me  and for most of my childhood I planned on becoming a marine biologist as an  adult, spending my  life studying these creatures.\n\n\n\n\n\nThe other way this interest manifested is the obvious way. I became a UFO nut.\n\n\n\n\n\nI watched “documentaries” on tv, read every book I could on the subject etc.\n\n\n\n\nOn one occasion my mother and I actually saw a glowing plasma sphere floating in the sky ( I am pretty sure it was an example of ball lightning). This incident only spurred my ravenous interest.\n\n\n\n\nI also  became terrified with the idea of Alien Abduction. In hindsight, this was a  case of psychological sublimation, I lived in a notoriously dangerous  country were armed kidnappings of people of my socioeconomic status  level was  extremely common. I didn't know it at the time, but my parents during this period were receiving death threats that named me as the target ( “we know when your son  leaves school etc”)\n\n\n\n\n\n\nBut the point is  the fear was extremely real. Before going to bed I would  ritualistically measure the bed and  assure myself that I was in the dead center of it, in a place where there little  arms could not reach ( I suppose I never  realized that aliens who could travel  across millions of lightyears would have ways of catching a kid literally just beyond their grasp... then again M Night Shyamalan spent millions making a commercially successful movie  in which aliens could not break down wooden doors and were deathly allergic to water... so cut me a break).\n\n\n\n\n\nAfter all, of those thousands of people  who claimed to have been abducted by aliens could not be making it up... what did they have to gain? Nothing. I had never heard of anyone getting rich  making up stories of alien abduction. I saw lots of people get ridiculed instead.\n\n\n\n\n\nWhen I was  thirteen years old I moved to the USA. At this time I got my first computer and  dove headlong into the internet. It was heady times for a UFO buff. You  must remember  what the late 90's were like. This was the absolute height  of the cultural influence of “ The X Files”. This was long before “Loose Change”and  Chemtrails and Alex Jones and  InfoWars  made all conspiracy theorists the instant subject of ridicule, conspiracy had not yet worn out its welcome. ( I was not a conspiracy theorist mind you, I am just pointing out that at the time  the cultural atmosphere was ripe for this kind of thing).\n\n\n\n\n\n\nThere was also a great community within the world of Ufology. Thousands of people, independent researchers , abductees, witnesses. Many of  us  called each other   over  Microsoft Netmeeting ( Skype's hoary great grandfather) . I befriended  many of them. A  Welsh nursing student bonded with me,  a Hispanic kid living in the suburbs of New Orleans almost a decade younger than her, because I was willing to listen to her terrifying tales of being abducted by aliens, of   getting in her  car and driving  only to blank out and wake up hours later and miles away in her car parked on some solitary country lane in Wales with no memory of how she got there.  She  never told anyone in her day to day real life what she believed to be the cause of these events. She could not deal with the ridicule. She could only turn to us. What incentive did this woman have to make any of this up? She had to be telling the truth... or so I thought.  And she was only one of many I was personally in touch with.\n\n\n\n\n\nAbove all there was an incredible buzz of excitement.  We were all convinced that we were on the very edge of a mass revelation, of  the  moment when this phenomenon would truly explode into the  mainstream. The internet was allowing us to become coordinated and reach out to each other.. Already  incidents like the Phoenix Lights had shown  what   a world of ubiquitous video cameras and internet dissemination could bring to ufology . And the future looked  so bright.\n\n\n\n\n\nI dont recall people talking about cameras in cellphones, but we  all knew that digital cameras with megapixel capacity were about to become commonplace,  the kind of thing you could carry around in your pocket.\n\n\n\n\n\nThroughout the history of the UFO phenomenon, the skeptics had  put our feet to the fire  due to the lack of objective evidence.  That was a strange term to my teenage ears: “ objective”.\n\n\n\n\n\n  I mean we had thousands of honest intelligent  people who swore up and down  that they had been abducted by aliens.What more evidence could anyone want? They had encountered the unknown. And they had nothing  to gain and everything to lose from speaking up. And many of them did lose and lose hard. I personally knew people who had been fired, or who had been hit with divorce papers, because they had told people about their experiences with aliens and UFO's.\n\n\n\n\n\nBut  by objective, it became obvious , what the skeptics meant, was something verifiable and concrete that could be  verified by a disinterested third party.\n\n\n\n\n\n\nAnd that is what we were all sure  was coming. An avalanche of it actually.\n\n\n\n\n\n\nSee think about things that exist. Think about anything you know is generally accepted to exist.  Something not controversial. Like gravity. Or Cancer.  Or whatever. We have more data about this thing  or things ( whatever  you chose) now than we did five years ago. Or  Fifteen years ago. Or obviously  50. The more our technology and our technique improves the more of reality we can observe and the more data we can collect and the more  evidence we can gather.\n\n\nObvious no?\n\n\n\n\n\nAnd that was precisely the kind of evidence we were convinced was about to be gathered.  There had been many many photographs and videos  of UFO's etc. But none of these  held up to the standards of those annoying skeptics.  UFO's by definition, do not exactly  announce their flight schedules, they are there and then they are gone, often before you can get them in focus or set the right shutter speed. And then the film revelation process. There was so much that could go wrong! ( indeed  the skeptics often claimed  the alien spacecraft  captured in some of the photos were created by mistakes in the film emulsion).\n\n\n\n\n\n\nBut now user friendly digital cameras were coming, high resolution, point and shoot, low cost, in everyones glove compartment.\n\n\n\n\n\nThis is the thing you need to understand. **Everyone I knew honestly believed** that the  next ten years would bring  forth an overwhelming avalanche of high resolution  photographs of  alien spacecraft, and quite possibly of aliens themselves.  With everyone having high res digital  cameras on them  all the time, the eyewitnesses would be able to document their encounters.\n\n\n\n\n\nNo one doubted that the majority of people would  come to understand that  we were  being visited once this documentation occurred. It would be everywhere the evidence staring them in the face.\n\n\n\n\n\n\nOh you remember dont you? The avalanche of high quality  pictures and videos everywhere of alien spacecraft.\n\n\n\n\n\n\n\n\n\nYeah you dont.\n\n\nBecause of course it did not happen.\n\n\n\n\nMany other things happened though. The attacks of 9/11 filmed and photographed from literally thousands of different angles. The  rise of youtube. Battlefield videos filmed by the soldiers themselves. Vine. Snapchat. dashboard cameras.  There are entire websites and  popular message boards were people post videos of automobile accidents  filmed from inside the automobiles by  dashcam cameras. Some years back a  meteorite exploded over a remote siberian city and within hours dozens of different videos documenting this event were being watched online by people around the world.\n\n\n\nLet me  flesh out how spectacular this  change has been. In  the film *Close Encounters* a journalist character states that no camera crew has ever been able to film a passenger airliner accidentally crashing. On July 19, 1989 United Airlines flight 232 crashlanded in  Sioux City Iowa. Because the airliner sent out distress signals and had to be rerouted to this airport, there was time for a  camera crew to set up just outside the  airport, and for the first time ever( as far as I know)  a major jetliner crash was filmed.\n\n\n\n\nNow, by comparison, perhaps  a DOZEN jetliner crashes have been filmed in the last ten years alone.\n\n\n\n\nThe once impossible holy grail of photojournalism is now a commonplace. That is how ubiquitous cameras are. Want to watch a guy film from inside his house as his house is hit by a tornado and blows away around him? [That's on youtube](https://www.youtube.com/watch?v=qnl586lctzA). And so on and on and on.\n\n\n\n\nThis of course begs the question: where are all those films that we were so honestly and fervently looking forward to? With the alien spaceships and the aliens themselves?\n\n\n\n\nQuite simply the lack of proof is  quite irrefutable. Apparently we are NOT  being visited by aliens. Certainly not in the way that the thousands of abductees of the 90's would make us believe to be the case. Perhaps those blurry  alien  craft in the photographs of yore were after all, just mistakes from the  film emulsion process .\n\n\n\nIf I tell you  that this fact broke my belief in Alien piloted UFO's .. that the lack of  video proof in the  age of ubiquitous cameras and youtube, now seems to me to be  pretty good evidence that there is no evidence to  be gathered...\n\n\n\n\nIf I tell you that I no longer  believe that UFO's are piloted by aliens and that I no longer believe in alien abduction... would you get angry at me? Would you feel that it is just a phase? \n\n\n\n\nWould  you accuse me of rebelling against the order of the world?\n\n\n\n\n\n Would  you tell me that if I went back and was able to  interview the original eyewitnesses to UFOS ( perhaps in their  original language if it was a language I am not fluent in)  I would see the light about UFO's?\n\n\n\n\n\n\nOr would you instead congratulate me for “ moving on” for “ growing up” for reevaluating a  belief that was very gratifying to me ?  \n\n\n\n\n\n\nSee, I must tell you, i must confess, that  I felt  very special knowing the “ truth” about UFO's long before most people and was looking forward to the great cultural changes that would happen when everyone knew there was life in the cosmos and that it was visiting me. Like so many in  the UFO movement, I was sure that humanity would enter an era of “ global consciousness” when we realized that aliens were visiting ( and  apparently  kindnapping some of us!) how petty our differences would seem on that day!\n\n\n\n\n\nBut I gave that up. The huge mental and emotional rush, the  feeling of being special, of being privy to what was next, to being on the cutting edge of  a great new  dawn of knowledge for mankind.\n\n\n\n\n\nI gradually drew away  from a group of genuinely kind, interesting people  in which I had invested hundreds of hours and knew many people.\n\n\n\nDo you think me mad?\n\n\n\nWhy not?\n\n\nI knew dozens of people on a first name basis who were absolutely sure that they had been abducted by aliens. These people were not charlatans. They did not talk to the media or go on speaking tours. They did not run blogs or websites. Most of them would never agree to appear in one of those “ UFO” “documentaries” that air on the “ History” channel. Many had lost their families and their jobs when they told them what they perceived had happened to them. Many more , chastened by these examples were deep in the closet, confiding in no one but other members of the internet forums. Their pain, panic confusion and terror were very real. They had nothing to gain and so much to lose. Indeed so many had already lost so much. I can still hear the panic in Gemma's voice ( my Welsh Nurse friend) as she told me about her “ missing time”  over netmeeting.\n\n\n\n\nSo why is no one asking me why I am throwing away their “testimony”?\n\n\n\n\n\nWhy is everyone so ready to congratulate me in doing the logical common sense thing when I walked away from UFO's once the “ objective” evidence failed to materialize?\n\n\n\n\nOf course I am sure you know where I am going with this.\n\n\nBecause a very similar process is what drove me away from religion, but when I point this out, it raises everyone's  hackles.\n\n\n\nSo why was I right to  do so in one example and not in the other?\n\n\n\nLook I am not  hopelessly naive. I am well aware that  Religion is a rather more towering edifice than ufology. I know religion has been absolutely essential to the  human experience. It is not like one day I noticed I no longer believed in UFO's and just applied the same methodology to religion ( it wasn't until about two years ago that I realized that the processes had even been similar)  nor was this by any means THE ONLY reason I stopped being a theist. ( there where so many others: the problem of evil, the rabid anti-intellectualism of mainstream Christianity, and  of course the major trigger, my personal experience in discovering that  people could profoundly and honestly believe in Opposing Christianities that were directly and exactly opposed to one another, so that one christianity was basically the others anti-christianity. \n\n\n\n\nThis last point is  key because  logically it is  obvious that at least one of those two christianities ( in my particular case the openly socialist anti-rich  pro peace Liberation Theology, that Jesuit Catholics inculcated in my mother and that she then inculcated into me vs. the rabidly pro-GOP anti-poor  pro war Supply-Side Jesus worshiped by the  Southern Baptist church my grandmother took us to when I lived in Louisiana)  had to be wrong, which meant that there where people who devoutly and profoundly believed in wrong religions through no fault of their own. Again : logically it is  obvious that at least one of those two christianities  had to be wrong, which meant that there where people who devoutly and profoundly believed in wrong religions.Once you realize that there are people who devoutly and profoundly  and through no fault of their own believe in a “wrong” religion and have the same experiences and  obtain the exact  same benefits out of their religions  as people that believe in “ right” religions do , well... then the idea that there is such a thing as a “ right” or “ true” religion is already doomed in your head. But this is a digression, which is why it is in brackets. Back to the point...)\n\n\n\n\n\n\nI find it endlessly fascinating that  so many of the same people that basically cheer me on when they hear me tell of how I gave up believing aliens were flying around in spaceships when the evidence failed to materialize get angry when they find out I  found a similar lack of evidence surrounding the Christianity of my youth and that that was a factor in my abandoning the faith.\n\n\n\n\nThese same people then come rushing at me and ask me where I get my morality from  ( as if such a question had any bearing on the factual accuracy of religious claims!) and urge me to reconsider.\n ( should I also  reconsider my  lack of belief in the extraterrestrial hypothesis for ufo's??)\n\n\n\n\n\nThis essay is getting extremely verbose so let me  cut to the heart of it.\n\n\n\n\n\nThink again to what I said about   the amount of information we know about a fact. Think about something that is true. Anything that is true. Say the  weight of the world, or  gravity, or  any disease. Just something that is true and that it is not controversial wether or not it is true. Here is my point, we know more about these things know than we did  five, or fifteen or fifty years ago. \n\n\nAs our tools for  measuring and analyzing things improve, we can explore and understand things “ better” .\nWe get a better understanding of how things work. Reality  becomes **more “ concrete”** measureable, real, detailed, our models for understanding the world become more accurate and have ever greater predictive value.\n\n\n\n\n\n\n\nWhat reality does **not** do is become less tangible, more ephemeral, more diffusive, harder to pin down, harder to define in a coherent manner. If  a truth becomes more opaque as opposed to clearer, the more we know about the world, if we get less data instead of more, that is  pretty good  evidence that it maybe , just maybe,  wasn't true to begin with.\n\n\n\n\n\n\nOnly twice In  my life have I believed something to be true only to have it become more opaque when  our ability to gather  more  evidence  increased. Only twice have I seen “ truth” scuttle for the  protection of the shadows.\n\n\n\n\n\nOnce was the  extraterrestrial hypothesis for the origins of UFOS.\n\n\n\n\n\n\n\n\n\nThe other was the theistic concept of god.\n\n\n\n\n\nyou still hear  about  god working miracles and curing  people so the lame can walk and the blind can see, and  so on, but mostly in Africa or Haiti or  some other such place conveniently free from the omnipresence of cameras.\n\n\n\nAnd you see this \"vanishing god\" throughout the development of  religion itself.\n \n\n\n\nThe same god that  threw plagues at egypt until  it let  his people go  was oddly absent when 6 million of those same “ chosen” people went up the chimneys of  the Nazi deathcamps.\n\n\n\n\n\nThe personal god of the old testament  becomes ever more opaque as “ sophisticated theologians”  talk about the “ immanent ground of  all being” and a  creature that lives “ outside of space and time”. Out there hiding were the cameras cannot record and the instruments  cannot measure. Apologists for religions tend to  accuse  those who criticize religions for not  engaging these  vagaries, as if they were representative of the modal belief among the average religious  believer. (  my contention is  of course that  this  opaqueness is purposeful if perhaps subconscious, in other words highly educated  believers, aware of the lack of  evidence, reformulate their definition of god in other to make it unfalsifiable. To which of course I cite Sagan's “ Dragon in the  Garage” thought experiment as a rebuttal)\n\n\n\n\n\nThe really fun thing is  you can see this in the history of religion itself.\n\n\n\n\n\n\nThe ancient pagan religions that predated the axial age tended to be  very personal, full of  spirits or physical gods who  got personally  angry with you and might come kill you ( or rape you!)\nAnd yet  the more recent the religion, the more immanent and  unseeable god becomes. By the time we get to Islam ( 600 ad)  portraying  god  as a person is a  sacrilege!\n\n\n\n\n\n\nFascinatingly, one can see this “ vanishing god”in the Bible itself. In the garden of eden,god walks around in the garden. He is apparently not omniscient,  since he seems not to know that  Adam and  Eve have eaten from the forbidden tree of the knowledge of good and evil until he sees them ( implying there are times when he is unable to see them)  and notices they are ashamed of their nakedness. In Genesis 18 god appears to  Abraham in the guise of an at first glance  human  traveler.\n\n\n\n\n\n\nBy the time of  the exodus god had become less personal but still appeared in forms that were easily visible to the masses. The massive plagues would have left behind thousands of  eyewitness accounts ( exactly zero of which have survived... nor has any archaeological or even  narrative evidence that there was ever a tribe of foreigners existing in egypt as  slaves, or that an exodus ever happened),god is said to have  appeared in front of the  Israelites as a column of fire in the night time or smoke in the daytime. There was manna from the heavens which fed multitudes.\n\n\n\n\n\nInterestingly however, by the time of the  babylonian exile,  god had become rather  more small scale. Daniel in the Lion's den. The faithful 3 in the oven. The disembodied hand  writing on the wall. In each case only a few witnesses to each miracle\n\n\n\n\n\nWhat happened?\n\n\n\n\nThe exodus  is not usually held to have happened after 1400 b.c. ( historians dont think it happened at all but that isn't my point here) Consensus is that the Pentateuch ( five books of moses) were written  in stages between 1000 and 600 B.C, so they were written at least 400 years after the events they were supposed to  narrate.  This was a  society where the literacy rate was in the single digits percentage wise.  No one, of course, was still alive who was also alive  at the time the stories were supposed to have happened. (  one supposes they had been  handed down orally previous to being written down) Essentially it would be impossible for  anyone to demand proof of these events. The people reading these stories ( and possibly those writing them down) had no reason to doubt their authority or authenticity.\n\n\n\n\n\n\nThe Babylonian exile on the other hand, was THE formative event for the jewish religion . This was the time when the  Old Testament essentially came together  in the form we know it today. People  writing down the story of the Babylonian exile were writing possibly while people  still lived who would have lived through those events. Events that everyone had historical memory off ( such as the Persian invasion of Babylon supposedly prophesied by the “ writing on the wall”) could still be described as large scale offshoots of the miraculous  but the actual miracles themselves  ( such as the actual writing) now had to occur only in front of small groups that were purposefully designed (  again possibly subconsciously) so as to exclude  people who might hear the tale and contradict it.\n\n\n\n\n\n\nBy the  time of the new testament this problem had only gotten  worse. Literacy rates where  super low by present standards ( perhaps 5% in the holy land, 15% empire wide) but the Romans where  a true  parchment bureaucracy that kept meticulous records of everything. ( indeed this reverence for language is apparent among the new testament writers itself, it is not for nothing that  Jesus is so frequently described as “ logos” that is “ the word”  or even “ the  word made flesh” in the famous formulation from the Gospel of John) Furthermore the authors of the new testament where clearly literate and immersed in the new culture of literacy. \n\n\n\n\n\n\n\n\nNow, as in Matthew, when  Jesus reveals his divinity he does so by taking a small group of witnesses to an isolated mountaintop. Miracles are small scale. Water turned into wine, a leper cured, an exorcism here and there. The God who wrecked entire nations in the Old Testament has withered away.\nThe miraculous nature of  those mass events that do occur in the gospels  is often evident only to a few , for example most of the multitudes  fed by the few loaves and few fishes would have no reason to think there were only  a few loaves an a few fishes to begin with.\n\n\n\n\n\n\n In fact in all of the new testament there is only one miracle that  would have been witnessed in a mass scale AND whose miraculous nature would be evident to all : the mass resurrection of the dead after Jesus's Crucifixion in Matthew 27:52-53. \n\n\n\n\n The  modern christian  reaction to these bible verses is very telling. Despite being utterly spectacular in the way that say, the parting of the red sea is, very few Christians even remember this verse exists at ALL. It is hardly emphasized at Easter services It has in fact been described as being the most “ embarrassing” verse in the new testament. Why would such a spectacular miracle be an embarrasment?\n\n\n\n Paradoxically,the answer is precisely because it is so spectacular. The fact that no historian at all mentions this event is pretty perplexing. And it is not only Josephus et al. Who are problematic here... the young Saul of  Tarsus was in  Jerusalem at this time studying under the temple priests but when he became the Apostle Paul he kind of forgot to mention the day the dead roamed around  Jerusalem. (among many other things... after all the  gospels were written after Paul wrote his letters, so they weren't around for him to consult)\n\n\n\n\n\n\n\n\n\n\nPerhaps the most spectacular difference between the old and new testament when it comes to the  vanishing god is apparent in the differing ways that the concept of  \" testing God\" is handled.\n\n\n\n\n\n\nIn 1 kings 18:-25-40 we get this:( NIV)\n\n&gt;25 Elijah said to the prophets of Baal, \"Choose one of the bulls and prepare it first, since there are so many of you. Call on the name of your god, but do not light the fire.\" 26 So they took the bull given them and prepared it. Then they called on the name of Baal from morning till noon. \"O Baal, answer us!\" they shouted. But there was no response; no one answered. And they danced around the altar they had made. 27 At noon Elijah began to taunt them. \"Shout louder!\" he said. \"Surely he is a god! Perhaps he is deep in thought, or busy, or traveling. Maybe he is sleeping and must be awakened.\" 28 So they shouted louder and slashed themselves with swords and spears, as was their custom, until their blood flowed. 29 Midday passed, and they continued their frantic prophesying until the time for the evening sacrifice. But there was no response, no one answered, no one paid attention. 30 Then Elijah said to all the people, \"Come here to me.\" They came to him, and he repaired the altar of the LORD, which was in ruins. 31 Elijah took twelve stones, one for each of the tribes descended from Jacob, to whom the word of the LORD had come, saying, \"Your name shall be Israel.\" 32 With the stones he built an altar in the name of the LORD, and he dug a trench around it large enough to hold two seahs of seed. 33 He arranged the wood, cut the bull into pieces and laid it on the wood. Then he said to them, \"Fill four large jars with water and pour it on the offering and on the wood.\" 34 \"Do it again,\" he said, and they did it again. \"Do it a third time,\" he ordered, and they did it the third time. 35 The water ran down around the altar and even filled the trench. 36 At the time of sacrifice, the prophet Elijah stepped forward and prayed: \"O LORD, God of Abraham, Isaac and Israel, let it be known today that you are God in Israel and that I am your servant and have done all these things at your command. 37 Answer me, O LORD, answer me, so these people will know that you, O LORD, are God, and that you are turning their hearts back again.\" 38 Then the fire of the LORD fell and burned up the sacrifice, the wood, the stones and the soil, and also licked up the water in the trench. 39 When all the people saw this, they fell prostrate and cried, \"The LORD--he is God! The LORD--he is God!\" 40 Then Elijah commanded them, \"Seize the prophets of Baal. Don't let anyone get away!\" They seized them, and Elijah had them brought down to the Kishon Valley and slaughtered there.\n\n\n\n\n\n\n\n\nNote how detailed the instructions are, and how God responds with a clear and obvious miracle. Here God has  Elijah  defy another god, challenge those other gods believers, and then he PROVES through a clear miracle that he is the true god and thus  worthy of worship ( then because his God  is a Loving God Elijah has all the believers of the wrong god slaughtered ISIS style. Oh well)\n\n\n\n\n\n\n\nThe point is that asking for proof  for the existence and supernatural powers of a god is a GOOD thing, since it allows us to distinguish the true Lord of Creation  from false gods like Baal.\n\n\n\n\n\n\n\nLet us see how the new testament handles the concept of god proving he is god:\n\n\n\n\nLuke  4: 12 NIV\n\n\n\n&gt;Jesus answered, \"It is said: 'Do not put the Lord your God to the test.'\"\n\n\n\n\n\n\n\n\n\nOh.\n\n\n\n\n\nSo to conclude\n\n\n\n\n\n\n\n\nThink again to what I said about   the amount of information we know about a fact. Think about something that is true. Anything that is true. Say the  weight of the world, or  gravity, or  any disease. Just something that is true and that it is not controversial whether or not it is true. Here is my point, we know more about these things know than we did  five, or fifteen or fifty years ago. As our tools for  measuring and analyzing things improve, we can explore and understand things “ better” .\n\n\n\n\n\n\n\nWe get a better understanding of how things work. Reality  becomes more “ concrete” measureable, real, detailed, our models for understanding the world become more accurate and have ever greater predictive value.\n\n\n\n\n\nWhat reality does not do is become less tangible, more ephemeral, more diffusive, harder to pin down, harder to define in a coherent manner. If  a truth becomes more opaque as opposed to clearer, the more we know about the world, if we get less data instead of more, that is  pretty good  evidence that it wasn't true to begin with.\n\n\n\n\n\n\n\n\n\nWhen I apply this  reasoning to my   belief in UFO's and let it pierce it and extinguish it, I am praised. ( Look at this man, so logical! Look how he grows up and abandons his childish fantasies!)\n\n\n\n\n\n\nWhen I apply this reasoning to my  belief in the existence of a  theistic  personal God who interacts with humanity and let it pierce and extinguish it, I cause outrage. (Look at this man! So Arrogant! How can he fail to appreciate what god has done for us! ... I have always loved how people who believe the entire  universe was created so that god could run some kind of cosmic drama about the sin and salvation of his own creation are the \" humble\" whereas those of us who dont see evidence of this are \" arrogant\")\n\n\n\n\n\n\n\n\n\nI suppose that  is the way of the world.\n\nedit: gold? really! this screed just got me gilded. Love you all.\nEdit to edit: R/bestof! wow o wow!\n\nEdit May 12: [I have a followup sequel to this post up, in which I go further in detail on some of the issues I raise d here](http://np.reddit.com/r/TrueAtheism/comments/35on79/the_problem_of_other_religions_a_continuation_of/)",
        "created_utc": 1430883268,
        "upvote_ratio": ""
    },
    {
        "title": "\"Christianity is different because it's the only religion not based on good deeds\"",
        "author": "AverageMidget",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34zk8d/christianity_is_different_because_its_the_only/",
        "text": "One little Christian apologist at my school that validates his belief by mentioning how unique Christianity is, in that salvation is completely by grace and received purely by faith. Are there other religions that aren't merit-based that I can bring up, or possibly verses that invalidate this belief and make salvation merit-based?",
        "created_utc": 1430861414,
        "upvote_ratio": ""
    },
    {
        "title": "a \"Nation of mostly Christians\" is NOT the same as a \"Christian Nation\"",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34v78s/a_nation_of_mostly_christians_is_not_the_same_as/",
        "text": "",
        "created_utc": 1430772924,
        "upvote_ratio": ""
    },
    {
        "title": "How to confront a product of Christian Nation argument?",
        "author": "scoobeee",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34tumm/how_to_confront_a_product_of_christian_nation/",
        "text": "I'm not sure how to really get around a broad argument for the good Christianity has done for our culture in the US and I suppose the west. I could rattle off an unending list of harms done by Christians and Christianity over the centuries when arguing but when someone says that the culture we have now is the product of a country full of Christian values I'm not sure I have a great reply. I would probably say that our culture has grown and thrived despite religious influences because of a secular constitution, the separation of church and state, and freedom of speech and other underlying causes. But I think that is just kind of a shoddy answer and that I must see some truth to that claim that Christianity must have influenced our society in some fundamentally positive aspects.\n\nI suppose it is such a broad claim that it could be hard to argue fully against. Thoughts?\n\nEdit: I'll post my comment from below which perhaps better explains what I'm trying to get at.\n&gt; I think the general part of the claim is that if the majority of Americans have been Christian for hundreds of years then the country and culture is infused with and primarily a product of Christian values. Without them the country would not be what it is today.\nI suppose I just doubt that if people stopped believing 200 years ago we would be any better off now, but I would like to think so. I'd also like to think we'd be better off in the future if people stopped believing now\n",
        "created_utc": 1430750966,
        "upvote_ratio": ""
    },
    {
        "title": "Even if seeing patterns where there are none is natural, why would believing that there is a God be?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34s9gw/even_if_seeing_patterns_where_there_are_none_is/",
        "text": "And why just one? \n\nIf there is going to be a creator who made the world and dictating events, it seems like the most obvious conclusion is that there are multiple gods playing some kind of board game where they each got to make different \"humans\" based on some kind of model, so they each made a different ethnicity, and now they're competing them, and if one of them gets a bad roll or makes a bad bet, the others get to put a natural disaster or famine or something on that one's people. \n\nIf belief in God is natural, why is converting to a religion so much more common than making up your own? And why is becoming an atheist more common than converting from one religion to another?  As soon as it became common knowledge that the common religions conflict with the evidence, shouldn't they have been abandoned and millions of new ones invented by millions of people? \n\nI have OCD and I sense false patterns and superstitions everywhere, but I know they're false. People must evaluating whether or not there being a God is realistic from some other basis. It sort of bugs me when people say that people believing in God is \"natural\" (natural means \"not man-made\" btw) when in reality, it isn't common at all to see someone make up their own concept of \"the creators.\" I'll *maybe* buy that people have their beliefs *reinforced* by the \"patterns\" they see, but not that the patterns are what led them to the belief. \n\nWhat do you think? ",
        "created_utc": 1430708740,
        "upvote_ratio": ""
    },
    {
        "title": "Hey all: Need some ideas about a satire",
        "author": "iNachozi",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34s1n3/hey_all_need_some_ideas_about_a_satire/",
        "text": "Background: I go to Catholic school; mandatory theology class. \n\nFor our final project, our teacher's letting us make a video (documentary style) about anything in morality. (this meaning Catholic morality) \n\nMy group of 3 wants to make a subtle satire of the often backwards views of the church instead of just regurgitating what the class wants us to say us i.e. \"abortion is wrong etc etc\" \n\nI'd like to know topics about morality that would be easier for me to satirize without making it  completely obvious. Our teacher is pretty dim-witted so he won't catch on to minor comments, but major key points that argue against what our video is supposed to be about will probably raise some alarms. Our group still wants to pass the class, but we want to have a little fun with it. If you think it's better not to risk doing a satire, please say so, as I'd rather get a good grade than a minor victory against The Man. \n\nAny suggestions, questions, comments, go ahead and comment them/PM to me. \n\nAll/any help appreciated. \n\nAdditionally, if this is the wrong place to submit this, if you could point me in the tight direction, that'd be great. ",
        "created_utc": 1430704426,
        "upvote_ratio": ""
    },
    {
        "title": "Why I find atheism depressing",
        "author": "MozartLink",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34rep0/why_i_find_atheism_depressing/",
        "text": "",
        "created_utc": 1430691969,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a name for this argument against traditional theism?",
        "author": "goodtimes50",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34r8os/is_there_a_name_for_this_argument_against/",
        "text": "I've been keeping a sort of journal during my deconversion detailing various things that have occurred to me during the process. I had one particular thought that seems like a pretty convincing argument against an all-loving god. Here's what I wrote in my journal:\n\n&gt; Although I no longer believe, I am still fundamentally the same person I was when I believed. I still have all the same strengths and weaknesses, the same personality; the same lovable (or unlovable) qualities. If God loved me for who he created me to be, then I remain in his love. If he loved me for what I believed, then I am damned. In other words, logically speaking, the only thing that made me lovable must have been my belief. Is that really the only thing about me that made the difference between an eternity in paradise versus an eternity of torment? But that's just as well since I wouldn't want the love of someone who loved me for what I believed rather than for who I am. Would we accept this form of love from any other person?\n\nAre there any logical fallacies present in this proposition? If not, I fail to see how this is not a devastating argument against the sort of god proposed by Christianity in particular. Does god really love us because we are created in his image? Does he love us for ANY of the reasons any other human would love us? Or is it really only because of our particular beliefs? If the latter, that seems a very odd basis for love. I would even say it's nonsensical unless our understanding of love is fundamentally different from God's, which brings up a host of other problems...",
        "created_utc": 1430688883,
        "upvote_ratio": ""
    },
    {
        "title": "What Drives People to Convert to Islam?",
        "author": "mostafa37",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34q96w/what_drives_people_to_convert_to_islam/",
        "text": "",
        "created_utc": 1430670638,
        "upvote_ratio": ""
    },
    {
        "title": "Tennis Ball VS Religion.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34mj7b/tennis_ball_vs_religion/",
        "text": "Tennis Ball VS Religion: http://youtu.be/zJ3-ysTe-4Y\n\nI thought of this argument a while ago.  Today I decided to write it up and record an audio of it. It's about how a tennis ball's motion when thrown up in the air can be agreed on worldwide, whereas religion causes disagreements. Hope you enjoy it and I look forward to the discussion it spawns.\n\n\"Grab a tennis ball. Take this tennis ball anywhere on earth, and throw it in the air. Go to the other side of the World and throw it in the air. Go to a variety of different counries and throw the tennis ball up in the air.\n\nNotice a pattern? The tennis ball always falls back down to Earth. It doesn't matter what the particulars of the local culture is or what their local religous beliefs stipulate. The tennis ball will always fall back down, and at a rate proportional to the force exerted on it by the thrower. \n\nThe Earth's Gravity knows no borders. It doesn't change according to what you think or believe. It remains true wherever you are on Earth, and just like how the tennis ball's fall rate can vary, the force that gravity exerts will vary depending on the density and mass of the object it effects. Gravity can be consistently found among large objects across the universe. \n\nReligion though is not like a tennis ball and does not have the consistency of gravity. Go to the small fraction of Earth where the English people live, and the Church of England apparantly tells the truth of the universe. Go to the small fraction of Earth where the Turkish people live, and the directives of the Turkish Presidency of Religious Affairs apparantly tells the truth of the universe. Go to the fraction of Earth where the Hindus live and they'll be sure they have a monopoly on the truth. The Buddhists of Japan will say they have a better grip of the truth, with their Shinto syncreticism, than the Buddhists of Sri Lanka do with their vanilla Buddhism. Italians Catholics will disagree with Orthodox Greeks, despite both being Christian. Hasidic Jews know more about the universe than Reformist Jews, or so they claim. The ancestors of Turks were Tengriists and believe they had a better grip on the truth than their Muslim descendants, the ancestors of the Germanic peoples believed in the Nordic faiths and believed they had a better grip on the truth than their Christian descendants. The Ancient Romans and Ancient Greeks will not be pleased about the new found Christian faith among their descendants.  \n\nNotice a pattern? Religion is arbritrary. Tied to the country or ethnicity you are born into and to the particular epoch you lived in. Wherever you go on Earth, religion varies. With a time machine handy you'll notice that religion varies even more. If the extraordinary claims made by religions are true, then which one of the thousands of possibilities is true? The one you were born into of course! But take a tennis ball and throw it up into the air in any country in the world. Everyone will agree on the effect that gravity has.\"\n",
        "created_utc": 1430577617,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if religion was never invented?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34mfmn/what_would_happen_if_religion_was_never_invented/",
        "text": "I have a view where I think that pretty much the same shameful things that have happened with religion as their excuse would probably happen if religion was somehow never invented. That's because whenever someone uses religion as an excuse they are shifting responsibility. I don't think we can expect people to stop shifting responsibility if the narrative changes. Do you?",
        "created_utc": 1430575319,
        "upvote_ratio": ""
    },
    {
        "title": "[\"The Evolution of God\" -Robert Wright] Is it a good read?",
        "author": "bassshred",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34keb2/the_evolution_of_god_robert_wright_is_it_a_good/",
        "text": "I'm thinking about purchasing it. Just wondering if any of you have read it and if so, what your thoughts are on it. I'm just very curious, now that we are able to see beyond theology, to be able to get a prospective on what purposes \"God(s)\" have served to humans in various cultures. ",
        "created_utc": 1430519605,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists of Reddit: What is the most ridiculous thing an atheist has said to you when discussing religion?",
        "author": "CalmSpider",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34jyji/atheists_of_reddit_what_is_the_most_ridiculous/",
        "text": "I had one just assume that a pastor owned the expensive house with a fancy boat in the driveway simply because it was next to the church. I knew the pastor in question, and he was struggling to pay his mortgage on a much more modest home.",
        "created_utc": 1430511437,
        "upvote_ratio": ""
    },
    {
        "title": "Truly, if not a heaven, what can you logically see happening after death?",
        "author": "WharfBlarg",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34jtbj/truly_if_not_a_heaven_what_can_you_logically_see/",
        "text": "I know this such a typical question, but it interests me to hear the responses of others. I do not believe in a place of reunion or a \"heaven\", but I can simply not accept the idea of bleak nothingness after death. I do not believe in any God, but there are many things that we are not capable of comprehending and as such, what can you logically see occurring after death?",
        "created_utc": 1430508841,
        "upvote_ratio": ""
    },
    {
        "title": "Is atheism becoming cliche because it's the logical conclusion?",
        "author": "metilco",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34irg2/is_atheism_becoming_cliche_because_its_the/",
        "text": "So it seems like concept of atheism gets largely dismissed as a joke to a lot of people on reddit. Especially in default subs, it's pretty common to see \"/r/atheism\" as a sarcastic comment on anything having to do with religion, usually resulting in highly upvoted threads that paint atheists as whiny killjoys who are out to ruin others enjoyment of life.\n\nIt just seems like collective cognitive dissonance when the method used to verify truth used for literally everything else in people's lives doesn't apply to the idea of god. People seem to be obsessed with calling out bullshit in a lot of other aspects of humanity (social inequality, politics, media, etc), but refuse to look at their own religion under the same scrutiny. \n\nI think most atheists are more concerned with the truth rather than what sounds comforting to a dying human, and I get the sense that religious people take any form of criticism as a personal attack on their entire belief/comfort system. Almost akin to ICP's infamous \"scientists lying to me and pissing me off\" lyric.\n\nI think the rise in atheism in the last couple generations is partly a result of unrestricted access to information. We're taught relatively high level math and science concepts at earlier ages. You can google basically any fact based question and get a result pretty quickly. Nowadays when dealing with the unknown, the immediate response is \"Google it\" rather than \"only God knows.\" \n\nAmong my group of friends (early 20s) almost every single person leans atheist/humanist. The topic never comes up because it's just this obvious thing that doesn't even need to be addressed any further. \n\nOne of my earliest fallacy realizations was the idea that because there are multiple religions that believe they are exclusively correct, the fact there is more than one of them invalidates them all. There's tons of faulty logic that can be dissected given any effort.\n\nIt just seems to me like a lot of people are unwilling to entertain the idea of atheism because deep down they realize religion can be discredited just like anything else, and that would take away some of the nice things people take comfort in believing in such as heaven, karma, prayer, seeing dead relatives and the like. So they immediately reject the notion on that basis alone regardless of validity. Like they get so close, realize the implication and back out like it's bad news and shame the messenger. \n\nIt's obvious where I stand and I'm aware of my bias, but what do you all think? Is atheism becoming a groan-inducing cliche because of its obviousness to people who have unlimited access to verifiable information? Even to those who refuse to disbelieve?",
        "created_utc": 1430490916,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists of Reddit: What is the most ridiculous thing a theist has said to you when discussing religion?",
        "author": "Donthurlemogurlx",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34hqyk/atheists_of_reddit_what_is_the_most_ridiculous/",
        "text": "I knew someone years ago who told me he believed dinosaur bones were placed on Earth by Satan in order to fool humans. He attempted many times to convert me, but I wasn't having any of that, so he finally gave up. ",
        "created_utc": 1430462820,
        "upvote_ratio": ""
    },
    {
        "title": "Need Debate Advice and Your Opinions",
        "author": "jfuite",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34ftqy/need_debate_advice_and_your_opinions/",
        "text": "A long, civil debate with a theist is edging towards endgame.  They finally asked what I think is a fundamentally important question that provides me the polite opportunity to critically evaluate their position.  She asked, \"Is it wrong to say that my personal experience informs me that there is a God and that He has sent a Teacher to us?\"\n\nWhat should I say regarding personal, subjective experience and faith and truth?  Please offer me some points, tips, or links to articles or videos that address this issue to help me prepare a response.  Thanks in advance.",
        "created_utc": 1430424274,
        "upvote_ratio": ""
    },
    {
        "title": "The False Equation of Atheism and Intellectual Sophistication - Emma Green in The Atlantic",
        "author": "qqzqq",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34fiky/the_false_equation_of_atheism_and_intellectual/",
        "text": "[http://www.theatlantic.com/international/archive/2014/03/the-false-equation-of-atheism-and-intellectual-sophistication/284406/?utm_source=SFFB](http://www.theatlantic.com/international/archive/2014/03/the-false-equation-of-atheism-and-intellectual-sophistication/284406/?utm_source=SFFB)\n\nEmma Green argues (by way of reviewing *The Age of Athiests* by Peter Watson) that atheists create a false \"binary of Godly vs. godless\" - thus inflaming a culture war with Christian Conservatives, because of atheists' intellectual snobbery:\n\n&gt;...[Atheists like Watson assume that because] smart, respected, insightful people thought and felt their way out of believing in God, everyone else should, too. Because intellectual history trends toward non-belief, human history must, too...This is problematic for several reasons...the average believer's search for meaning and understanding is [no] less rigorous or valuable—it just ends with a different conclusion: that God exists.\n\nSo, what do you think of Green's assessment? Does atheist intellectualism trend toward pretentiousness and snobbery?",
        "created_utc": 1430419332,
        "upvote_ratio": ""
    },
    {
        "title": "\"The False Equation of Atheism and Intellectual Sophistication\" - Emma Green in The Atlantic",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34fg4b/the_false_equation_of_atheism_and_intellectual/",
        "text": "[http://www.theatlantic.com/international/archive/2014/03/the-false-equation-of-atheism-and-intellectual-sophistication/284406/?utm_source=SFFB](http://www.theatlantic.com/international/archive/2014/03/the-false-equation-of-atheism-and-intellectual-sophistication/284406/?utm_source=SFFB)\n\nEmma Green argues (by way of reviewing *The Age of Athests* by Peter Watson) that atheists create a false \"binary of Godly vs. godless\" - thus inflaming a culture war with Christian Conservatives, because of atheist's intellectual snobbery: \n\n^ ...[Atheists like Watson assume that because] smart, respected, insightful people thought and felt their way out of believing in God, everyone else should, too. Because intellectual history trends toward non-belief, human history must, too...\n\n^Watson assumes that because a group of smart, respected, insightful people thought and felt their way out of believing in God, everyone else should, too...This is problematic for several reasons...the average believer's search for meaning and understanding is [no] less rigorous or valuable—it just ends with a different conclusion: that God exists.\n\nSo, what do you think of Green's assessment? Does atheists have a greater tendency toward pretentiousness and intellectual snobbery?",
        "created_utc": 1430418243,
        "upvote_ratio": ""
    },
    {
        "title": "Which is more upsetting: the religion or the religious?",
        "author": "DivinelyMinely",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34ehbu/which_is_more_upsetting_the_religion_or_the/",
        "text": "I was listening to Pale Blue Dot on audiobook this morning, and it got me to thinking about the delineation between Christianity and Christians. What gets under your skin more? The doctrine, with its loopholes and antiquated ideology and resistance to curiosity and knowledge or the person of faith, with his or her pseudo-selflessness and pompous self righteousness? ",
        "created_utc": 1430403058,
        "upvote_ratio": ""
    },
    {
        "title": "Christ's resurrection and the 4 month old baby found alive in Nepal.",
        "author": "Thugglebunny",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34e8t4/christs_resurrection_and_the_4_month_old_baby/",
        "text": "With the recent news of the 4 month old baby found in the rubble of Nepal's earthquake. Do stories like this help the possibility of Christ's \"resurrection\", but at the same dwindle it's magnitude of it's awe and wonder that so many Christians hold to such high regards?\n\nIn short, if a 4 month old can survive such a situation doesn't it show to some degree that you don't need to be God or god like to survive under steep situations?\n\n",
        "created_utc": 1430398714,
        "upvote_ratio": ""
    },
    {
        "title": "A short 16 question (10 minute) survey on \"Religion in Modern Society\" for my high school project",
        "author": "KingMamba5",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34e6l4/a_short_16_question_10_minute_survey_on_religion/",
        "text": "",
        "created_utc": 1430397437,
        "upvote_ratio": ""
    },
    {
        "title": "I've been looking up how the books by Dawkins, Hitchens, Harris etc. have been received in the social sciences - since religion is after all a social phenomenon and scientific study of religion is concentrated there.",
        "author": "EndOfAnArgument",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34drsh/ive_been_looking_up_how_the_books_by_dawkins/",
        "text": "I found the following bit interesting, since it points to a contradiction in their books: on the one hand, they are all about how science trumps religion, but on the other hand the ideas on religion are remarkably unscientific and completely unaware of what (social) science has to say about religion (at least according to this author).\n\n&gt; The bestselling new atheist books are not academic works on religion, but popular polemics; yet the arguments are presented as if they represent a “scientific” and “rational” approach to religion. It is true that Dawkins and Dennett have contributed indirectly to naturalistic interpretations of religion and they have made some use of the cognitive study of religion, but scholars have pointed out many limitations to their knowledge claims (Geertz 2008, 2009). For example, David Wilson (2008) states that Dawkins has not done any empirical research on religion and does not show enough awareness of studies of religion conducted within an evolutionary framework, including those which present religion as a by-product of human evolution (Markússon 2007). In addition, the idea of the “meme,” developed by Dawkins and supported by Dennett, has not proved to be a particularly successful tool in theorizing religion, reflecting the very limited success of Dawkins’s work as a positive methodological influence upon those researching religious phenomena. \n\n&gt; Dawkins does not appear to be familiar with either religious studies or the sociology of religion and the same applies to the other new atheists. References to academic studies of religion are limited to Frazer and Freud in Christopher Hitchens’s work. Harris’s work appears more informed at first glance, but it is difficult to find awareness in his writings of studies in religious studies, sociology (of religion), or anthropology (of religion), although he makes bold claims about what religion is and how it functions. It is thus not surprising that responses from academics who study religion have been critical. Scholars specializing in islam and the Middle East have complained of Harris’s lack of accuracy when discussing the history, politics, and religion of predominantly islamic countries (Dickson 2010). Scott Atran —an anthropologist of religion with credentials both in the evolutionary study of religion and the profiling of suicide bombers —has pointed to several problems in Harris’s work: lack of data, ignorance of the empirical study of religion, selectivity of examples and idiosyncratic interpretations (for Atran’s views, see http://www.edge.org/discourse/bb.html, access date: 12 July 2010, Atran 2010). Other scholars have extended the list of criticisms to Harris’s apparently careless interpretation of statistics, mixing of correlation and causation, narrow or selective conceptualization of religion (Bentley 2008; Hulsether 2008; Reader 2008), and using pro-Israel activist Alan Dershowitz as an authority in analyzing the Israel/Palestine conflict (Bradley and Tate 2010: 5–6). \n\n&gt; Dennett’s chief contribution to new atheism (2007) is slightly different, because many of his views are modest and qualified. The book has been taken so seriously by scholars that a leading journal in Religious Studies, Method and Theory in the Study of Religion, published a special issue (1/2008) engaging critically with Dennett’s work. Dennett has engaged seriously with sociological applications of Rational Choice theory, mainly the work of Rodney Stark and Roger Finke (Dennett 2007: 189–98; Stark and Finke 2000), but his repertoire in that area is limited to one theory and one country (the United States). However, in the first part of the book, where Dennett tries to “break the spell”—get religion accepted as an object of scientific study—he writes as if he were the first to dare attempt an explanation of religion, although the naturalistic approach has a long tradition and although he actually develops his own views with the help of earlier naturalistic explanations. [Here is a footnote that says the following: \"Here are three examples of Dennett’s style of writing and arguing: ‘it is high time that we subject religion […] to the most intensive multidisciplinary research […]’ (2007:14). ‘The spell that I say *must* be broken is the taboo against a forthright, scientific, noholds-barred investigation of religion as a natural phenomenon among many’ (2007: 17, emphasis in original). ‘Up to now, there has been a largely unexamined mutual agreement that scientists and other researchers will leave religion alone’ (2007: 18).\"]\n\nThis is from *Teemu Taira, \"New Atheism as Identity Politics\" – Mathew Guest &amp; Elisabeth Arweck (eds), Religion and Knowledge: Sociological Perspectives (Farnham: Ashgate 2012), 97-113.*\n\nI guess I would expect that Dawkins etc. are out of their depth when discussing the science of studying religion, but not that they are completely ignorant which they seem to be... any thoughts on that?",
        "created_utc": 1430386612,
        "upvote_ratio": ""
    },
    {
        "title": "Is getting worked up about religion really worth it?",
        "author": "majani",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34dnsc/is_getting_worked_up_about_religion_really_worth/",
        "text": "From my experience most religious people are only casually religious. They only have a passing knowledge of vague summaries of their religious texts, and on a day to day basis, they make their decisions based on circumstance rather than following what their god instructs. Not very different from a non believer.\n\nConsidering this, why then do people get worked up over religion?",
        "created_utc": 1430382949,
        "upvote_ratio": ""
    },
    {
        "title": "Is Porn Wrong?",
        "author": "ZiioDZ",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34c4h4/is_porn_wrong/",
        "text": "",
        "created_utc": 1430350452,
        "upvote_ratio": ""
    },
    {
        "title": "Watched Cosmos, Dad got angry",
        "author": "persiphone",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/349xrq/watched_cosmos_dad_got_angry/",
        "text": "Dad overhead some of the third episode in the new Cosmos series while I was watching it - specifically about Newton discovering the equations that explain planetary movement. The section ends with Neil saying that everyone now knew that the planets did not move because of God's power; there was a mathematical explanation behind it.\n\nMy dad is a fairly strong Christian and he started telling me how it makes him really angry that Neil is so biased and that everyone just laps up what he says without considering that he isn't including all the information. He felt that Neil implied that Newton was no longer a Christian after discovering the formulas and as that isn't the truth, he thinks Neil is trying to make it look like discovering the inner workings removed their need for a god.\n\nI asked him if he thought that Neil being biased threatened people with weak faiths, and he said he thought so. I agreed with him that Neil did say some things against religion but that was not the focus of the show.\n\nHe also started to say that I speak in a biased way about similar topics and that I should consider intelligent design.. when he knows very well that I am no longer a Christian.\n\nSomething we also argued about a week ago: he also thinks that because peacocks' tails are so complex and that they look like eyes, there is no way that \"random\" evolution could have developed that. He used the fact that I hadn't come up with an explanation for that as evidence that macro evolution can not happen, only micro can. (Despite how many times I tell him that macro evolution must happen alongside micro evolution.)\n\n**TL;DR - Dad hates that Neil Degrasse Tyson is so biased against religion. Please read the whole thing though - I'd appreciate your help.**\n\nThanks for reading this - I'd like to know of anything I could bring up with him to help him understand these concepts better. I feel like he was reading too much into the scene with Newton but I guess it doesn't really matter anyway.",
        "created_utc": 1430315400,
        "upvote_ratio": ""
    },
    {
        "title": "The right way (Part 1) Chance or Reason? How does pregnancy happen?",
        "author": "mohamed52",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/349aqb/the_right_way_part_1_chance_or_reason_how_does/",
        "text": "",
        "created_utc": 1430299053,
        "upvote_ratio": ""
    },
    {
        "title": "The right way (Part 1) Chance or Reason? How does pregnancy happen?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3497vl/the_right_way_part_1_chance_or_reason_how_does/",
        "text": "",
        "created_utc": 1430296372,
        "upvote_ratio": ""
    },
    {
        "title": "The right way (Part 1) Chance or Reason? How does pregnancy happen?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/34979w/the_right_way_part_1_chance_or_reason_how_does/",
        "text": "",
        "created_utc": 1430295759,
        "upvote_ratio": ""
    },
    {
        "title": "Daniel Dennett in the WSJ: \"Why the Future of Religion Is Bleak\"",
        "author": "therationalparent",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/3495v2/daniel_dennett_in_the_wsj_why_the_future_of/",
        "text": "",
        "created_utc": 1430294454,
        "upvote_ratio": ""
    },
    {
        "title": "Young Earth View as a Non-Religious Person?",
        "author": "FantsE",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/348s9n/young_earth_view_as_a_nonreligious_person/",
        "text": "This was posted on my facebook wall, and accurately describes the discussion and question I'm looking for, so I'll post it verbatim.\n\n\"Hello public! I have an honest question, not intended to provoke, but honestly seeking answers. Can anyone provide me with an example of a non-religious scientist (meaning someone qualified in any relevant scientific field) who supports either the idea that the earth is less than 10000 years old, or that evolution by natural selection does not actually occur? I understand that belief in evolution and of an old earth is not exclusively reserved to non-religious individuals, but it appears to me that a rejection of evolution or of the estimated 4.5 billion year age of the earth is almost exclusively reserved to religious individuals. I have so far been unable to find any example of a non-religious individual in any relevant field (geology, biology, etc.) who believes in a young earth, or disbelieves in evolution. I would be more than willing to look into any sources any of you may have regarding specifically non-religious qualified individuals who dissent from either of these two scientific theories.\"",
        "created_utc": 1430283798,
        "upvote_ratio": ""
    }
]