[
    {
        "title": "TLOU 2: I don’t think Joel deserved to die.",
        "author": "Wing_New",
        "url": "https://www.reddit.com/r/truegaming/comments/116mhlg/tlou_2_i_dont_think_joel_deserved_to_die/",
        "text": "Everyone he killed tried to kill him with the exception of the one guard and Marlene. Who were on some greater good kick to make a vaccine out of a kids brain. The guard was a jerk let’s be honest. The doctor was a combatant and it was a combat scenario at that time. If she was my kid I’d have killed everyone and burned down the building.",
        "created_utc": 1676837072,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'd like to see Dragon Themed ARPGs like Divinity II:Dragon Knight Saga",
        "author": "lazybunny6836",
        "url": "https://www.reddit.com/r/truegaming/comments/116jnlc/id_like_to_see_dragon_themed_arpgs_like_divinity/",
        "text": "Hello everyone. Who remember this old underratted and forgotten RPG? Divinity 2:Dragon Knight Saga(Currently name is Divinity 2:Developer's Cut) but by the way not Original Sin 2,not isometric,not turn based. One and only TPP/ARPG in Divinity series(released in 2009). Everyone has favorite RPG. Divinity 2 is my favorite RPG ever and best,unique Dragon ARPG in my opinion. Our character is Dragon Knight in Divinity 2 and this Dragon Knight can also become a Dragon,fight against enemy dragons and huge weapons.   \nThere is no game like Divinity 2 nowadays. I'd like to see Divinity 2:Dragon Knight Saga Remake but it's probably impossible after success of D:OS games(unfortunately). Still I hope Larian Studios will release one day, at least sequel to Divinity 2(probably.....)and it won't be isometric. I don't like isometric,turn based games. \nActually, I don't know if there are gamers in this community who played this game or not,usually it's hard to find unfortunately. What do you think about Divinity 2:Dragon Knight Saga?",
        "created_utc": 1676830195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using imagination to complete the game itself. Anyone else did that as a kid?",
        "author": "MeehowPL",
        "url": "https://www.reddit.com/r/truegaming/comments/116b5ho/using_imagination_to_complete_the_game_itself/",
        "text": "Recently I replayed Corsairs Gold, a game I used to play a lot as a kid, and did a retroreview. Writing it, I remembered how my friend and I would imagine that we have separate fleets, towns, and whatever. This is strictly a single player game, and yet we made it semimultiplayer. We did similar things in the Grand Theft Auto series when we had our homes, our cars (based on models, not specific ones, obviously). It was just pure sandbox fun for shits and giggles, but it would last entire Saturdays.\n\nAs for playing solo, I sometimes would sort of complete the story of the game with my imagination, too. Like say, you create a character in Icewind Dale and imagine their story and relationships with other party members.\n\nSometimes I think this is precisely why I feel games are not as fun as they used to be. It may be on their part to an extent, but I'm sure it's also growing older and becoming adult. There is no going back to how things were in your childhood. That's the downside of nostalgic gaming. You're chasing a memory that is impossible to recreate. Or at least I can only smile at the memories, but sometimes  I just wonder how I found a game fun or even playable.\n\nWhat are your thoughts?\n\nIf you are curious about the retroreview I mentioned, then here’s the link: https://youtu.be/EsdEabkKv8g\nIf this is considered self-promo here, then I ask the mods to simply remove the paragraph, as I'm genuinely interested about the topic.",
        "created_utc": 1676815761,
        "upvote_ratio": 1.0
    },
    {
        "title": "check this out guys",
        "author": "zaxmcl2",
        "url": "https://www.reddit.com/r/truegaming/comments/116avuk/check_this_out_guys/",
        "text": "[https://www.youtube.com/watch?v=DPgy9293Qmg](https://www.youtube.com/watch?v=DPgy9293Qmg) please leave some feedback on my quality\n\nshould i improve it or is it enough",
        "created_utc": 1676815056,
        "upvote_ratio": 1.0
    },
    {
        "title": "NFL Imperialism in RETRO BOWL!",
        "author": "EliLovesNintendo",
        "url": "https://www.reddit.com/r/truegaming/comments/116ary2/nfl_imperialism_in_retro_bowl/",
        "text": "[removed]",
        "created_utc": 1676814723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does playing multiplayer games build confidence?",
        "author": "CrystalCrysis2848",
        "url": "https://www.reddit.com/r/truegaming/comments/1169wuc/does_playing_multiplayer_games_build_confidence/",
        "text": "1st post, I hope it turns out all right. \n\nI should explain my situation a bit, before I began my first year in a university as a senior high school student, I had the time of my life back in my province. I was considered smart and reliable back then, I was well liked, my confidence was at an all time high and I was one hell of a risk taker. But now, I feel so crushed. Every moment I spend in class, I face things that overwhelm me so easily. I have to shamelessly rely on my classmates because I have trouble understanding some topics, and the last nail in the coffin was during class elections, when I realized no one voted for me. (So much for being well liked, huh?)\n\nSo now my confidence and self esteem is shattered, and I tried escaping to video games. At first, it was just single player games. Dark souls 3, Blood Borne, Elden Ring, Sifu, I am a huge fan of these games, but now they don't give me that same ''You can do it!'' Energy as before, now they just feel more like, a cold escape from the reality that I might be lonely and stupid when placed back into my classroom surrounded by geniuses who don't give a shit about video games.\n\nBut then I tried Valorant. I will say this, I used to hate the game because I hated being competitive, I was content with being passive and being a pushover, easily admitting I can't measure up to the skills of others. But then I started playing, just casually, no special tricks or anything, I simply did my best in every game I could. And I started winning a lot. \n\nGranted I wasn't MVP or anything, but I slowly began to realize that I actually stood a chance against the very real opponents I was facing in that game. That I can face them fairly, and actually win. I never felt that feeling in uni. I always had to rely on others just to help me stay afloat in terms of grades. But in Valorant, I feel like I'm actually an essential part to the success of my team. \n\nBut I don't really know if continuing to play video games would actually help me build confidence, or if it's all just false bravado that would break the second I log out of the virtual world. So what do you guys think? Does playing multiplayer videogames (or any video games in general) actually build confidence?\n\nTL:DR - Confidence was shattered, got a bit of it back through videogames. But does it actually help self esteem?",
        "created_utc": 1676812160,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are non-business reasons for real-time games or features, e.g. Animal Crossing?",
        "author": "Gmr_Leon",
        "url": "https://www.reddit.com/r/truegaming/comments/1163rz0/what_are_nonbusiness_reasons_for_realtime_games/",
        "text": "For folks unfamiliar, Animal Crossing: New Horizon's game world after its intro/tutorial switches over to syncing its time with real world time, or more briefly, real-time. This means that if it's daytime where you are in the real world, it's daytime in the game, and same if it's nighttime. Animal Crossing: New Horizons and its predecessors aren't the only games to do this, but it's one of the most notable, popular examples to use.\n\nSome(many?) mobile games tend to use these systems for obvious business-driven reasons to compel folks to pay up so they can keep the game going, but Animal Crossing &amp; some other games it's inspired aren't designed around that business model.\n\nHowever, it's not only entire games built around real-time, there are also a few games with specific features built around real-time, even if other elements of the game, e.g. day/night cycle, clearly operate off game time. Dragon Age: Inquisition's War Table is one such example from a popular game, and a similar feature made its way into Mass Effect: Andromeda via Strike Teams. \n\nI've tried finding developer interviews to get some insight into the thinking behind these design decisions, but I've come up short, even after narrowing my search to right around the years of the games' releases. It's a very odd design decision to me, as in the case of a game built around it, it can easily alienate folks that work, have other things going on in their life, and/or tend to be nightowls.\n\nIn the case of features built around it, it just...Doesn't really add much to the gameplay? It's often a way to get some \"free\" rewards, but for it to be more compelling may mean you have to make the other activities that could get those same rewards less appealing to do, and...That seems very silly. Even if it doesn't lead to that, if the rewards outweigh what you receive from active gameplay, then it literally makes it less rewarding to play the game, and that's...Also really silly.\n\nSo ultimately for it to work, it's probably gotta be little more than a way to get some little bonuses for regularly playing &amp; winding up these timers, but what's the point of that in primarily single-player games like Inquisition &amp; Andromeda? Although, in looking back, Inquisition did have multiplayer, but it doesn't appear the War Table factored into that directly, whereas it's a little more complicated with Andromeda (what wasn't?), but I don't...Think it was directly involved. \n\nI'm sure there may be some other, perhaps better examples of games with real-time features, but these were just a few more notable ones that came to mind.\n\nSo what do you think may be non-business reasons for real-time designs like these, or do you perhaps have some interviews with developers explaining the thinking behind it?",
        "created_utc": 1676789000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark Souls: Remastered and Prey (2017) have amazing world design, and I wish more games were like this.",
        "author": "ChimpRaps",
        "url": "https://www.reddit.com/r/truegaming/comments/1161l9c/dark_souls_remastered_and_prey_2017_have_amazing/",
        "text": "Before I begin, honorable mention to Hollow Knight, since the world follows a similar structure. I just wish it were a 3D game.\n\nAlso, If you haven't played these yet, ignore this post and discover these worlds for yourself.\n\nWhat I'm referring to is level interconnectivity via alternate paths, elevators, etc, usually achieved through vertically stacked areas. \n\nFor example, in Dark Souls there are many times where you will be exploring upwards or downwards for such a long time, that you completely forget about the previous areas. However, you stumble across a door, ride the elevator inside that room, and find yourself back at an area which you surely thought you would never return to.\n\nPrey is similar, but it does have loading screens. There is an elevator you can unlock during the mid to late game, which grants you access to both early and late game areas. Also, you are free to explore the exterior of the space station, and can unlock 5 different entrances to spots all around Talos 1. And you can imagine there are other paths as well.\n\nIf you've never experienced this, it's truly amazing. There is something very satisfying about mentally mapping the layout of a game and being able to move from beginning to end game areas with ease. This allows you to quickly move around the map and find potentially new areas that you may have missed. \n\nI understand that this brings up the topic of instant fast travel, but that's kind of the point of this point. I wish more games designed their worlds vertically in order to allow for this methodical approach to exploration, instead of just laying out a flat world and adding fast travel to compensate for the vast amount of space between areas. I'm hoping there are more games like this and I just haven't found them yet.",
        "created_utc": 1676781216,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Master Thesis] Digital Mexican representation in video games Thesis Survey about Mexican Gamers",
        "author": "DaddyIsStressed",
        "url": "https://www.reddit.com/r/truegaming/comments/1161id9/master_thesis_digital_mexican_representation_in/",
        "text": "Hey everyone, I am currently a master's student at Drexel University, and I am currently working on my master's thesis in Digital Media. The purpose of this survey is to gather information on how Mexican gamers feel about how Mexico and Mexican people are portrayed in video games.\n\nResearch Question   \n1.    What do Mexican gamers feel about the portrayal of Mexican culture in video games?\n\nOften, designers take what is well-known and popular and place them inside their games without knowing the background of it all and leading to characters and places depicting Mexican culture in a very stereotypical way.  \nMy goal is to produce an interactive design website of design examples and case studies to guide designers using Mexican cultural elements through positive and negative feedback in digital media applications, focusing on but not limited to video games.  \nYour opinion will be very helpful, and any information or answers you give in the survey will be anonymous. They will only be used in analyzing data for my thesis. You won't need to share any personal at all times.  \nPlease feel free to reach out through DM, commenting or sending me an email if you have any questions.    \nMy contact information   \nName: Angel Martin Palomares  \nSchool Name: Drexel University  \nDepartment: Antoinette Westphal College of Media Arts &amp; Design   \nSchool email: [amp584@drexel.edu](mailto:amp584@drexel.edu)  \nNumber to reach me: 832-545-3256   \n[https://forms.gle/bKJK2tMv9bDihQpa8](https://forms.gle/bKJK2tMv9bDihQpa8)",
        "created_utc": 1676780953,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the point of playing a game if you don't read the lore?",
        "author": "Christerra",
        "url": "https://www.reddit.com/r/truegaming/comments/115xdh7/whats_the_point_of_playing_a_game_if_you_dont/",
        "text": "Seriously, I don't understand people who run through a game without reading the lore.  What's the point?  To get to the endgame? But then the game is over far too soon and you don't really know the context of what the game was about.  Just trying to understand what people who don't read lore get out of gaming.",
        "created_utc": 1676768612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Games that elicited such a strong emotional response you were left in literal tears",
        "author": "Diddley4209",
        "url": "https://www.reddit.com/r/truegaming/comments/115vuex/games_that_elicited_such_a_strong_emotional/",
        "text": "Due to the extended length of presentation and interactivity that is inherent to the video game genre, I have always felt as if the emotional highs can be ones of immense profoundness. Of course, being longer, there also comes the issues of pacing, ludonarrative resonance, and so forth, but when executed well, they can be phenomenal, like a story experienced directly by you.\n\nI most recently felt this with NieR: Automata. I played it during a particularly vulnerable time in my life, and felt my emotions twisted in spectacular ways that both left a hole after completion and reinforced my perspective on the artistic merit of video games (don't think any other piece of media has ever caused me to full on cry, beyond just a few tears). What games have had this impact on you?",
        "created_utc": 1676764214,
        "upvote_ratio": 1.0
    },
    {
        "title": "my thoughts on the tlou2 after taking 3 years to finish it.",
        "author": "Nihilistic-Comrade",
        "url": "https://www.reddit.com/r/truegaming/comments/115r0dg/my_thoughts_on_the_tlou2_after_taking_3_years_to/",
        "text": "This is a supremely well made game, gameplay executed to a T, and multiple times the gore system would shock with how visceral it felt, I really enjoyed the exploration in Seattle with the horse, and really felt the closest to TLOU 1. \n\nAnd yet this is such a miserable game, you rarely ever explored places with other people like you did, and if so, they died just as soon as you met them, which is why my favorite part was the exploration on Horse back. \nBut beside that, this game keeps throwing death after death at for you shock factor that you get to a point where you just don't care for the story, lacking any charm of the previous game for a message beaten into you, such a well crafted and directed game with a miserable direction that it's hard to care for the end. I really wanted to like this.",
        "created_utc": 1676753901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Memorable and memeable moments in videogames",
        "author": "Vladthesecond",
        "url": "https://www.reddit.com/r/truegaming/comments/115p7y5/memorable_and_memeable_moments_in_videogames/",
        "text": "[removed]",
        "created_utc": 1676751461,
        "upvote_ratio": 1.0
    },
    {
        "title": "How MW2 (2009) destroyed the CoD on PC",
        "author": "Melodic_Clock5730",
        "url": "https://www.reddit.com/r/truegaming/comments/115oxit/how_mw2_2009_destroyed_the_cod_on_pc/",
        "text": "[removed]",
        "created_utc": 1676751042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why you should play The Cycle: Frontier by March 29th 2023",
        "author": "boiyouknowwhat",
        "url": "https://www.reddit.com/r/truegaming/comments/115nfjf/why_you_should_play_the_cycle_frontier_by_march/",
        "text": " \n\nI'm sure all of us know why we left TCF, now let me tell you why I've come back and you should too.\n\n1. Prospect Station.[ ](https://www.datocms-assets.com/57394/1676544755-highresscreenshot00021-6.png?auto=format&amp;w=1920)\n\nProbably the least important change but still welcomed, Yager Development has completely revamped the player hub, giving it the survivalist feel that supports the theme of the game. What was once neat and tidy is now a dusty, claustrophobic, bustling environment- New factions and prospector NPCs, faction houses seep with needed personality, and drones toil endlessly. This revamp breathes life and the vibe that this isn't a comfy home, these people are trying to survive.\n\n2. The War On Cheats.\n\nAfter the second closed beta, cheating was the main issue on YagerD's minds. They hired a full Research and Development team and devoted a few of their best engineers to guide them, all on the focus of developing the best anti-cheat software they could muster, alongside it they've introduced the Victim Compensation system, once a cheater is banned the system will log every player they've killed, and return all lost loot to their sweet homes. Paired with Shielded Match-making, putting cheaters with cheaters, and a Trusted Status that ensures non-cheaters won't be wrongfully banned- You are ensured that your match will stay fair, and I'm out one more excuse for my poor aim.\n\n3. Stability issues/New player experience.\n\nAlongside the new anti-cheat software, the same team wanted to make sure once you enter a game, you stay in the game. They've greatly improved their stability infrastructure and significantly reduced the lag and frequent disconnects, for any remaining oopsies- a new re-connect button has been implemented. For their prospectors first steps, they're sure they'll enjoy the tutorials quality of life changes including better explanations on basic mechanics, how to sell items properly, and just how important PvP is to the game.\n\n4. Free Loadouts.\n\nFor people familiar with the Tarkov-Shooter genre, this is pretty self explanatory.\n\nWith random faction inspired free load-outs, any rng-junkie can get their fix a few times a day, I'd say it's safe to believe this will be linked to a new progression module in the Quarter Upgrades, a nice touch overall for those prospectors that are down on their luck.\n\n5. No More Wipes.\n\nThis is the most controversial topic for their up-to-date prospectors, you'd think there's no way this mechanic could fit in today's TCF- and you'd be right. The controversy surrounding this lies solely in the idea everything else will stay the same, but it will not- Following this update will be a complete re-vamp of the progression system, loot wise, quest wise, everything. I personally like the idea, and I think it'll be a good way to distance itself from similar games, while not straying too far from the core game-play we all enjoy.\n\n6. A New Menace.\n\nThis flying monstrosity has ensured you'll be looking for cover even without a storm over-head. A beast of a boss with a tanky health pool, experienced prospectors can profit simply by defeating The Howler- but a newer, more greener prospector may find a way to exploit this beast without a fight..\n\nWith the introduction of The Howler comes it's nests, alongside quests tied to those nests-\n\n7. Misc/Conclusion.\n\nThere'll be new things that don't need a whole paragraph to explain such as new weapons, new skins, a new fortuna pass- changes to generators, graphic tweaks and bug fixes. (#pleasetellmyshadowtogetoffthexaxis) I wanted to give some brief light to everyone who might not know about these changes, honestly because I love this game and I genuinely believe it can turn into something everyone can enjoy.\n\nMarch 29th 2023 marks the release for most of these updates if their not out already, and the beginning of Fortuna Season 3.\n\nMore details on the information above/and more can be found at thecycle.game",
        "created_utc": 1676748969,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some franchises that have mostly been on handhelds?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676747022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can video games have explicit bad protagonists?",
        "author": "WantonReader",
        "url": "https://www.reddit.com/r/truegaming/comments/115kcny/can_video_games_have_explicit_bad_protagonists/",
        "text": "This is a discussion that has been coming and going but I mostly noticed it after Spec Ops: The Line and TLOUS: Part II. How can games make horrible protagonists?\n\nIt is a good discussion. Not only because that is a new direction and consumers often want some innovation, but it is also an interesting and more complicated narrative to engage people, especially if you think video games are art. But in both cases I gave, the conclusion was pretty mixed.\n\nThe problem I often hear (for example in NakeyJakey's discussion video on TLOU: Part II) is that the things that make the protagonists horrible are forced on the player. I, the player, was forced to do X, therefore I don't sympathise with the protagonist and that is bad. Or, I don't like how the game blames me, the player, for when the protagonist did X.\n\nI don't think those are necessarily bad protests, especially when they bring up games that did make them feel like horrible protagonists without it being forced. It is often strategy games, or maybe a game like MGS3 (think the part in the ghost river). However, I have one large complain about those: it is optional.\n\nSure, the game might try to guide you to those actions or be less fun if you avoid them, but they all allow a version of events where you, the player (and often also the protagonist) isn't horrible. In fact, in MGS3, killing no one is the more prestigious route and kinda hinted to be what actually happened with no-kill achievements in other games being named after MGS3's protagonist. \n\nAnd since they are optional that also mean that the theme of you being horrible is also optional. MGS3 isn't about the protagonist being a horrible person, it is about sacrifice for a greater good, which is generally seen as a good thing.\n\nThe only other possibility is to move the actual horrible actions into a cutscene, so the protagonist does them, but not the player so there is a certain disconnect, or make the actions vague or possibly justifiable (\"it was okay for Joel to kill Marlene because he though she'd come after him for revenge so killing her is really saving himself\"). But that then removes an important aspect of the interactivity of games if all the horrible actions happen in a movie clip and not in the interactivity that makes it a game.",
        "created_utc": 1676741089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Predator Will Probably Join Dead by Daylight in June for the 7th Anniversary Chapter 28",
        "author": "WeeklyComfort1071",
        "url": "https://www.reddit.com/r/truegaming/comments/115j1fi/predator_will_probably_join_dead_by_daylight_in/",
        "text": "[removed]",
        "created_utc": 1676737555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Examples for games that replace the controls/inputs throughout it's course?",
        "author": "Available-Seat-9050",
        "url": "https://www.reddit.com/r/truegaming/comments/115gor1/examples_for_games_that_replace_the/",
        "text": "[removed]",
        "created_utc": 1676730994,
        "upvote_ratio": 1.0
    },
    {
        "title": "why arent there alot of history set games",
        "author": "HamlinHamlin-McGill",
        "url": "https://www.reddit.com/r/truegaming/comments/115e7aq/why_arent_there_alot_of_history_set_games/",
        "text": "[removed]",
        "created_utc": 1676723133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you recommend me a videogame like Civilization V but less focused on competition and victory and more focused on exploration?",
        "author": "DTMika2",
        "url": "https://www.reddit.com/r/truegaming/comments/115dih3/can_you_recommend_me_a_videogame_like/",
        "text": "Hey everyone,\n\nI'm a big fan of the exploration aspect of Civilization V and I'm looking for more games that emphasize that aspect of gameplay. While I enjoy the challenge of competition, I'm primarily interested in games that allow me to explore and discover new worlds, rather than just conquer them. I am usually sad when the game transfers from early settling stage to later micromanagement grind.\n\nIf you're like me and enjoy the early stages of a game when you're still uncovering new territory and discovering hidden resources, I'd love to hear your recommendations for similar games.\n\nSome of the features that I'm looking for in a game include:\n\n* A focus on exploration and discovery\n* A wide variety of environments and settings to explore\n* Rich storytelling that immerses me in the world\n* Strong character development and customization options\n* A sense of adventure and mystery\n\nThank you in advance for your help and suggestions!",
        "created_utc": 1676720512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fans are crazy about dismemberment in Star Wars Jedi: Survivor",
        "author": "Odd-Wing8645",
        "url": "https://www.reddit.com/r/truegaming/comments/115a7lj/fans_are_crazy_about_dismemberment_in_star_wars/",
        "text": "[removed]",
        "created_utc": 1676707203,
        "upvote_ratio": 1.0
    },
    {
        "title": "There have been many controller, and many buttons. Truegaming: What is your favorite button?",
        "author": "Romnonaldao",
        "url": "https://www.reddit.com/r/truegaming/comments/1152412/there_have_been_many_controller_and_many_buttons/",
        "text": "Buttons are an important part of gaming, but rarely are they ever discussed, unless they are terrible in some way.\n\nLet's give a little love to the buttons that allow us to play the games we love. \n\nTruegaming, what is your favorite button and why?",
        "created_utc": 1676679914,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been trying to get back into ARPGs, I mean I used to play the first two Diablo games, and it's a stagnant genre I guess?",
        "author": "SpiritualCyberpunk",
        "url": "https://www.reddit.com/r/truegaming/comments/1150rgz/ive_been_trying_to_get_back_into_arpgs_i_mean_i/",
        "text": "20 years since Diablo 2, and nothing has happened. Essentially. That's my opinion.\n\nIt's relaxing to play a click fest sometimes, which is why I return to D2, Wolcen, what have you, PoE, Grim Dawn, and so on, from time to time. But I always conclude, man those games are not much more but a clickfest.... I'm almost 40 now, and when I started to play them I was a teenager. There hasn't been much development. I'd have hoped there have been more.",
        "created_utc": 1676676158,
        "upvote_ratio": 1.0
    },
    {
        "title": "/r/truegaming casual talk",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/truegaming/comments/114yw0j/rtruegaming_casual_talk/",
        "text": "Hey, all!\n\nIn this thread, the rules are more relaxed. The idea is that this megathread will provide a space for otherwise rule-breaking content, as well as allowing for a slightly more conversational tone rather than every post and comment needing to be an essay.\n\nTop-level comments on this post should aim to follow the rules for submitting threads. However, the following rules are relaxed:\n\n* 3. Specificity, Clarity, and Detail\n* 4. No Advice\n* 5. No List Posts\n* 8. No topics that belong in other subreddits\n* 9. No \\[Retired Topics\\]([https://www.reddit.com/r/truegaming/wiki/retired/](https://www.reddit.com/r/truegaming/wiki/retired/))\n* 11. Reviews must follow \\[these guidelines\\]([https://www.reddit.com/r/truegaming/wiki/rules/#wiki\\_reviews](https://www.reddit.com/r/truegaming/wiki/rules/#wiki_reviews))\n\nSo feel free to talk about what you've been playing lately or ask for suggestions. Feel free to discuss gaming fatigue, FOMO, backlogs, etc, from the retired topics list. Feel free to take your half-baked idea for a post to the subreddit and discuss it here (you can still post it as its own thread later on if you want). Just keep things civil!\n\nAlso, as a reminder, we have a Discord server where you can have much more casual, free-form conversations! [https://discord.gg/truegaming](https://discord.gg/truegaming)",
        "created_utc": 1676671227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Games with great tech trees (or upgrades) for non-4x games?",
        "author": "Sspifffyman",
        "url": "https://www.reddit.com/r/truegaming/comments/114w82j/games_with_great_tech_trees_or_upgrades_for_non4x/",
        "text": "We've all played games where you get a new upgrade, and it's something minimal and barely noticeable like +5% damage. But what are games with really great tech or skill trees?\n\nI'll start off. Subnautica I think could use a bit of improvement in a few areas, but most of their tech tree is pretty great. You start off making basic tools, and end up building bases and vehicles that make you feel much more powerful with a lot more mastery of your environment. And most steps along the way give you a meaningful upgrade to your capabilities. Unfortunately i think it could have used just a couple more upgrades to help you automate some things, especially for item storage. But overall the game a nice satisfying progression of new techs.\n\nWhat are other games that have satisfying and meaningful upgrades?\n\nAnd I'm not generally talking about 4x games since those all kind of have this, but then again if you want to discuss it go ahead :)",
        "created_utc": 1676664447,
        "upvote_ratio": 1.0
    },
    {
        "title": "As technology improves, it seems video games get worse.",
        "author": "Ok_Entertainment985",
        "url": "https://www.reddit.com/r/truegaming/comments/114v790/as_technology_improves_it_seems_video_games_get/",
        "text": "Looking at the past and current generation of consoles, it seems to me that with the advent of better hardware, game developers try their damndest to make the biggest game they can. Because of this, video games have become extremely costly and time consuming. \n\nPersonally I believe that gaming as a whole peaked with the 6th and 7th gen. In this era, the hardware wasn't necessarily the most powerful, but because of that, the limitations brought about much more creative strategies to create immersive and believable worlds. \n\nWith new hardware, gamers have placed this expectation on the AAA gaming industry that everything has to have the most incredible and amazing graphics. In the 6th and 7th gen, AAA games could be made with at least few million put into them, nowadays it's close to a few 100 million. This is a problem that pretty much means the gap between indie games and AAA is absolutely astronomical, that wasn't a problem 10 years ago!\n\nMoral of the story, game devs think they should push hardware to it absolute limit, and this is making AAA games too expensive to make.",
        "created_utc": 1676661883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Valorant Glitch Causes Killjoy's Turret to Run Rampant Across Map",
        "author": "Gamer091999",
        "url": "https://www.reddit.com/r/truegaming/comments/114arzo/valorant_glitch_causes_killjoys_turret_to_run/",
        "text": " \n\nThe Killjoy turret bug has no fascinating history in Valorant. At Champions 2022, a contentious turret error forced a replay of a round between XSET and Funplus Phoenix because the turret fired in the wrong direction, prompting XSET players to offer false information.\n\nHowever, this glitch is not as severe as what occurred on Ascent that day, instead, this bug on the new Lotus map allows turrets to run around the map swiftly.\n\nSource: [https://gamecheckup.com/valorant-killjoy-turret-glitch/](https://gamecheckup.com/valorant-killjoy-turret-glitch/)",
        "created_utc": 1676608783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find a game i played in my childhood but forgot the name",
        "author": "SparklyCola",
        "url": "https://www.reddit.com/r/truegaming/comments/1149qld/trying_to_find_a_game_i_played_in_my_childhood/",
        "text": "As the tittle says i am trying to find a old racing game which i sadly have almost forgot everything about besides a few small things.   \n\n\nNumber 1: I played it on the original XBOX somewhere between 2008-2012  \nNumber 2: there was a game mode where half the team raced in the normal direction but the other half of the team raced in the opposite direction and the goal was to survive and finish the race without crashing into the people racing in the opposite direction  \n\n\nNumber 3: The crashing physics and the damage it did to your car were extremely good for it's time and if your car got hit on certain spots you would see the oil spill out of it or even lose it's wheels and those effect would stay during the whole race, even cars from others (AI and Player) that had already broken down and could no longer move stayed till the end.  \n\n\nNumber 4: This one might be useless but i remember the main menu background screen and the car customization screen were inside some sort of Parking lot complex but other then that i don't remember much  \n\n\nI'm sure a lot don't know which game i am talking about and neither do i because i have forgotten the name and everything but if someone knows something that could be the game i played as a child please let me know.",
        "created_utc": 1676605343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let’s talk localization and dub (and the pet peeves of your local language)",
        "author": "Da_reason_Macron_won",
        "url": "https://www.reddit.com/r/truegaming/comments/1149grn/lets_talk_localization_and_dub_and_the_pet_peeves/",
        "text": "Recently I tried playing Marvel Midnight Suns taking advantage of the free weekend. Only to quickly discover that the game does not let your change the audio language without also changing the entire game’s text language. On top of that the game also doesn’t have a Latin American Spanish dub, so my remaining options were to either re-download the entire game in English and play as that, or endure a European dub that would make the entire experience unplayable to me. I choose the magical third option and just uninstalled the thing.\n\nThat got me thinking. This is one of those problems that looks completely obvious to anybody in Hispanic America, but probably didn’t even cross the minds of the Anglo developers.\n\nSo let’s have a little discussion about what non-obvious pet peeves you have about translations to your own language that developers may be completely clueless about.",
        "created_utc": 1676604480,
        "upvote_ratio": 1.0
    },
    {
        "title": "In order for there to be a healthy and competitive console market, are console exclusives a necessity?",
        "author": "BOfficeStats",
        "url": "https://www.reddit.com/r/truegaming/comments/11460rl/in_order_for_there_to_be_a_healthy_and/",
        "text": "Most people would agree that three major console manufacturers (Nintendo, Sony, Microsoft) are effectively competing with each other which benefits the consumer and ensures that no single company is controlling the console market.  However, would this competitive environment exist if exclusives were limited to non-existent?  \n\nHere are some thoughts I had:\n\n* Certain consoles would probably be affected in different ways.  Weaker systems such as the Nintendo Switch would be likely be significantly hurt since most of their games are from big name franchises and don't require especially powerful hardware to run well.  Many people would greatly prefer to play Nintendo's currently exclusive games on their much more powerful home consoles or PC.  Consoles which offer the best price-to-computing-performance ratio like the PS5 and Xbox Series X would massively benefit from such a change.\n\n* Different hardware decisions would become harder to justify.  Consoles have become more homogenized in controls and hardware but we occassionally see console manufacturers spend a lot to push out new ways of gaming.  It is difficult to see controllers like those of the Wii or peripherals like the Kinect ever releasing since they relied so much on first-party software developed specifically for those systems when those systems were not guaranteed to be successes.  VR might show that there will be some developers for unique hardware/peripherals but it is likely that virtually all major developers will refuse to develop software for these systems/hardware unless they are already proven to be hugely successful (VR has struggled with this problem for years).  \n\n* I'm not sure where the console market would head but it certainly would be more directly affected by consumer demands for hardware.  I think this is where people worry the most: people don't want to buy multiple consoles that largely do the same thing so we might see one console dominate in the home and/or handheld space.  Also, we might see console manufacturers changing their approach to selling their systems.  The Xbox Series S demonstrates that consumers are willing to pay for a cheaper version of a \"next-gen\" system so we might see more hardware revisions that cut costs and features or add them.  \n\n* More available games means more competition among developers.  Competition among developers would increase significantly which could mean better games at better prices for consumers.  However...\n\n* Big console exclusives would become even bigger as their audience increases.  This might consolidate attention and sales in certain genres among certain developers.  For example, indie developers of party games on PC, Playstation, and Xbox might have a more difficult time finding a player base if they have to now compete with Mario Party.  The same likely holds true for other genres like third-person, action-adventure. \n\n\nWhat do you think about console exclusives regarding their effect on the competitiveness of the console market?",
        "created_utc": 1676594243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any games like Hyper Light Drifter?",
        "author": "Unifish1",
        "url": "https://www.reddit.com/r/truegaming/comments/1142vyc/any_games_like_hyper_light_drifter/",
        "text": "I genuinely enjoyed Hyper Light Drifter. I love the boss fights, the exploration, the lore. Are there any games people could recommend to me that are like HLD?",
        "created_utc": 1676586028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are people so against about cloud gaming?",
        "author": "Snoo-75663",
        "url": "https://www.reddit.com/r/truegaming/comments/1141tvz/why_are_people_so_against_about_cloud_gaming/",
        "text": "When people say I won't own my games anymore, well do you own music and movies. It works really for me and I guess there are a lot of people who have a good enough internet for it. You don't have to buy a console, there is no waiting to download, no jet sounds coming out of hardware. Yes it's not like playing native, but surely in a couple of years it can get great, streamable music doesn't sound as good as native and movies don't look as good as blu ray but most people do it. Look at nvidia geforce now and their 4080 plan. I don't understant the hate and I like that xbox is pushing cloud gaming.\n\nDo you guys think cloud has a future and do you use it?",
        "created_utc": 1676583399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could a new console competitor have a chance in the current industry?",
        "author": "HevyMetalBakesale",
        "url": "https://www.reddit.com/r/truegaming/comments/114089r/could_a_new_console_competitor_have_a_chance_in/",
        "text": "This is something that I have been thinking about for a while. The current console platforms have largely remained the same since the 6th generation. Nintendo, Playstation, Xbox. The only \"competitor\" that has tried enter the race since then was Google...and I have too many thoughts about Stadia that would just end up derailing this entire post. \n\nWith Nintendo starting to raise prices and pushing subscription services, Xbox and Sony squabbling over this mega acquisition of Activision-Blizzard, and a plethora of other issues, I just have this overwhelming feeling that a new competitor would be healthy for the industry at this point. Someone to come in and shake things up so the big three don't get complacent.\n\nI think we're due for another SEGA-like moment where a company shows up with console that's sold at a competitive price compared to the established platforms. It would establish new first party IPs and probably experiment with newer technologies in our sector. I think of how Playstation wasn't the first CD based console, but is largely credited with popularizing the idea. Xbox popularized internal storage and online console gaming. This new competitor would need to do something similar. \n\nI keep thinking that maybe the Steam Deck fits as a \"competitor\" of sorts, but I only really see it as a sort-of competitor for Windows as the OS is linux-based (though you can install Windows). \n\nI'm not sure if a competitor would be viable today, but I'd sure love to see one. A company that has the can-do attitude of Sega of America back in 90s that took on the seemingly undefeatable Nintendo. A company like Sony back in the 90s that created one of the most successful consoles of all time almost out of spite for Nintendo and Sega. I just want to see a platform with some honest ambition that doesn't think that the solution is to either acquire so many developers that you box out your competition (Xbox) or chase the live service trend in some desperate attempt to land the new cash cow (Playstation). \n\nI'm probably just an old man yelling at clouds. What do you all think?",
        "created_utc": 1676579360,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to deal with 100% completion ocd",
        "author": "Affectionate_Lab8129",
        "url": "https://www.reddit.com/r/truegaming/comments/113xdns/how_to_deal_with_100_completion_ocd/",
        "text": "Every game I play and have installed I feel compelled to get all the achievements and 100% complete the game and it is just way to time consuming and for some games a chore. I find it difficult to play anything without having this mindset. Any suggestions to help deal with this? It's getting to the point where I'm considering to just quit gaming all together",
        "created_utc": 1676572055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Vampire Survivors overrated?",
        "author": "Hironai99",
        "url": "https://www.reddit.com/r/truegaming/comments/113xd3j/is_vampire_survivors_overrated/",
        "text": "I played it on phone. This game is not bad, but I don't understand why many people are crazy about it? It's just a game where you walk and choose upgrades while you grind on monsters. This videogame stealed some Castlevania and RPG Maker assets. And it doesn't have a plot. In comparision to other indie games, Vampire Survivors looks lame.\n\nI heard that it's because streamers hyoed this game. But why Vampire Survivors? There are many indie games with similar quality of development. I know, this game is extremely cheap, which makes it's attractive. I guess this is because Vampire Survivors is great for casual auditory. And, maybe, because it's fashionable in gaming community to hate AAA games and worship indie, regardless of their quality.",
        "created_utc": 1676572012,
        "upvote_ratio": 1.0
    },
    {
        "title": "The romance ending of Life Is Strange just comes off as psychotic to me.",
        "author": "CreepyAssociation173",
        "url": "https://www.reddit.com/r/truegaming/comments/113ueby/the_romance_ending_of_life_is_strange_just_comes/",
        "text": "In Life Is Strange you tend to go around using your powers helping people. You can help multiple people throughout the game and you're led to feel as if you're making some kind of impact. I just find it so crazy that you can save someone like Kate Marsh from suicide but if you choose the run away romance option in the end, you take her life away from her anyway. I didn't piece it together at first but over the years realized how fucked that was. You give a girl a new found hope in life but can take it away from her with Max &amp; Chloe not giving a damn. \n\nBasically turning your back on everyone you've saved. That ending will never make sense to me Because Chloe had never once showed her life was worth more thank everyone else's. It's not like you're letting a town full of terrible people die for the life of the only good person. You're letting a town that is full of plenty of good innocent people die for the life of a girl that manipulates and gaslights you. Characters like Kate don't deserve to die for that. I know you can just pick the other option, but the romance option being so glorified within the the fan base and the game itself is crazy to me. Its just like...what about Kate? What about Joyce? What about Warren? They were good innocent people. \n\nI had a friend similar to Chloe in middle school and part of highschool. Cut ties with her when I was a junior and she was a senior. So much manipulation. Making me feel like i had to do what she wanted to do or would gaslight me about not wanting to do it. Life Is Strange came out at around the time when we stopped being friends and I cut ties with her. Around a year after. I just can't stand Chloe because she reminds me so much of my old friend. I'd rather be friends with Warren and Kate over Chloe because they're not manipulative assholes.",
        "created_utc": 1676564403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where are all the mature AAA multiplayer games?",
        "author": "Amerikaner",
        "url": "https://www.reddit.com/r/truegaming/comments/113u49g/where_are_all_the_mature_aaa_multiplayer_games/",
        "text": "Outside of maybe Hunt: Showdown, there's a serious lack of adult oriented, mature multiplayer games in AAA gaming.  There's only one authentic war shooter on the console market and it's indie: Hell Let Loose.  Modern Warfare is Call of Duty's most well regarded and best selling entry in the series.  It's the one most grounded in reality yet they still add in mall ninja / anime cosmetics shortly after release.  Similarly, BF1 is the most well regarded Battlefield as far as atmosphere goes yet they pivot to cartoony, historically inaccurate action hero design in the next two entries.  And then you have Red Dead Redemption 2, widely regarded as a masterpiece.  Online though?  No hardcore mode (default design discourages anything but mindless, low effort PVP), filled with goofy cosmetics, and abandoned.   For medieval warfare we have to go to another indie studio for Mount and Blade: Bannerlord.  Even that has barebones multiplayer.  It's not like there isn't a market for these games.  DayZ, arguably another indie considering its mod roots, continues to be very popular.  Arma, Hell Let Loose, Squad, Tarkov, Ground Branch, Ready or Not and Post Scriptum have loyal fanbases.  You can't mention the already mentioned RDO these days without someone talking about the missed opportunity and huge potential it has.\n\nI don't think the movie industry has this same problem.  Sure, cgi-filled super hero blockbusters dominate the box office.  But there's still room for more grounded movies with big name stars and/or big budgets.  The Last Duel, Banshees of Inisherin, The Lighthouse, The Northman, All Quiet on the Western Front, Dunkirk, The Forgotten Battle, 1917.  The average age of a gamer is 33 years old now so what is wrong with the gaming industry?",
        "created_utc": 1676563665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Survey: brand loyalty and consumer expectations in the video game industry",
        "author": "Professional_Bore",
        "url": "https://www.reddit.com/r/truegaming/comments/113phqr/survey_brand_loyalty_and_consumer_expectations_in/",
        "text": "Hey everyone, I'm a masters student at the University of Southern Denmark, and I'm currently working on my master's thesis in Webcommunication about how underdelivering in terms of promises that have been made during the marketing process of a video game influence the consumers loyalty towards the brand. I've made a survey to gather data, and I would be really grateful if any of you could take some time to fill it out :) Any information or answers you give in the survey will at all times be anonymous, and will only be used in the context of analysing data for my thesis. You will not be required to share any personal info, other than your age and gender, which is strictly for demographical purposes.\n\nFair warning though, there are a few questions where you will need to write down your own answer, as I really want to delve into a the thoughts and feelings behind the consumers of video games.\n\nIf you have any questions concerning the survey, do let me know in the comments!\n\nLink to the survey: [https://forms.gle/Ecwaais4KszNskSZA](https://forms.gle/Ecwaais4KszNskSZA)",
        "created_utc": 1676550579,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think about it?",
        "author": "Strict-Chard-5744",
        "url": "https://www.reddit.com/r/truegaming/comments/113p6km/what_do_you_think_about_it/",
        "text": "After all of the scandal and people cancelling the author of the Harry Potter books, people are still buying the game, like me. I'm such a nerd for Harry Potter since I was a child.\n\nNow, for those who have play it, what do you think about, do you like it, you don't?\n\nI personally feel like is one of the best games I've played, the fact that I can live that fantasy and learn more about that story, it's amazing to me.",
        "created_utc": 1676549542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scanner App APK For android",
        "author": "Fit_Kaleidoscope_709",
        "url": "https://www.reddit.com/r/truegaming/comments/113p33k/scanner_app_apk_for_android/",
        "text": "[removed]",
        "created_utc": 1676549220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Games that you loved reading/listening to additional lore (notes/audio files)?",
        "author": "kazuma_fat233",
        "url": "https://www.reddit.com/r/truegaming/comments/113n8c3/games_that_you_loved_readinglistening_to/",
        "text": "[removed]",
        "created_utc": 1676542125,
        "upvote_ratio": 1.0
    },
    {
        "title": "What, in your opinion, is the worst AAA game ever made?",
        "author": "samc2022",
        "url": "https://www.reddit.com/r/truegaming/comments/113mh53/what_in_your_opinion_is_the_worst_aaa_game_ever/",
        "text": "[removed]",
        "created_utc": 1676539059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hogwarts Legacy: Yet another game that tells you the solution to puzzles before you even have a chance to solve them.",
        "author": "fupa16",
        "url": "https://www.reddit.com/r/truegaming/comments/113jn2g/hogwarts_legacy_yet_another_game_that_tells_you/",
        "text": "This is, by far, my biggest pet peeve in modern gaming. This issue is prolific amongst modern AA and AAA titles. Some guilty parties: Horizon: Zero Dawn, God of War, Hogwarts Legacy, and many others. Whenever a player is presented with a puzzle, they're given no more than about 10-15 seconds to figure it out before the player character just blurts out the solution or a massive hint. It's absolutely infuriating. Sometimes in Hogwarts Legacy I'm not even solving the puzzle, but instead trying to figure out how to get to a chest when my character just tells me the solution to a puzzle I haven't even started.\n\nBack in the day, games didn't assume every player was just a braindead moron barely able to manipulate their controller. If faced with a challenge or a puzzle, there were no hints. No help. No one was coming to hold your little baby hand and walk you through it. You had to rely on yourself and use your actual brain to figure something out. This is one of the key principles behind why games are actually good for people as a form of entertainment. They are dynamically putting people into difficult situations that they have to get out of. Too many enemies, puzzles to solve, terrain to navigate, these are all things that cause us to actually use our brains, as opposed to staring at some trash reality television or watching eye makeup videos. If we take away one of the most important aspects of what makes gaming good for people, we're causing them to lose some of their intrinsic value to us.\n\nThe solution to this is obvious: there needs to be a trend of these games implementing a gameplay option to \"Enable puzzle hints\" or whatever. Default it to true if you want, but for people like me, I'd love a chance to actually solve the puzzles before the answer is just spelled out for me. Besides, it's not like everyone doesn't just have a cellphone right next to them if they really wanted a solution, it doesn't need to be in game.\n\nI would be remiss if I didn't mention some of the games that approach this right, and actually let players think for themselves: Valheim, the Arkham series, Breath of the Wild.",
        "created_utc": 1676527713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Console subscriptions &amp; changing value propositions",
        "author": "Gmr_Leon",
        "url": "https://www.reddit.com/r/truegaming/comments/113i3a3/console_subscriptions_changing_value_propositions/",
        "text": "Microsoft was arguably among the first, or at least first majorly successful, companies to sell folks on paid online multiplayer on consoles across most/all games on the Xbox, and as the years have gone on, they've adjusted this to enhance what subscribers receive in return, e.g. Games with Gold &amp; Game Pass. The competition's tried to emulate their success with their own approaches, e.g. Sony's PS+ monthly games &amp; games collection, &amp; Nintendo's Switch Online multiplayer &amp; retro games collection.\n\nHowever, as each of these subscription services have grown (besides Nintendo's...typically unique approach), it seems like the value proposition has shifted significantly from where it began, paid online multiplayer, to monthly games and/or an entire catalog of games to choose from to play, &amp; deeper discounts on occasion.\n\nWith this in mind, it seems like at least for Microsoft &amp; Sony that paid online multiplayer isn't really as much of a selling point as it once was, and so one may be inclined to ask, what are the odds that they drop paid online multiplayer altogether in favor of subscriptions simply for monthly games, access to large parts of their games catalog, &amp; better discounts? \n\nAdmittedly, Microsoft basically already does this with Console Game Pass, &amp; to a much, much lesser degree so does Sony with PS Now. In general though, I don't think I've read of nor know all that many folks that even *think* of online multiplayer as part of *why* they subscribe to either company's subscription services anymore, especially on the Xbox side of things, and so it seems strange that consoles (besides Nintendo being Nintendo) keep it as part of their subscriptions.\n\nWhat do you think though?",
        "created_utc": 1676522257,
        "upvote_ratio": 1.0
    },
    {
        "title": "3DS Nostalgia Overload 🥺",
        "author": "EliLovesNintendo",
        "url": "https://www.reddit.com/r/truegaming/comments/113e5go/3ds_nostalgia_overload/",
        "text": "[removed]",
        "created_utc": 1676510062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hogwarts Legacy: Phenomenal World Design, but overall underwhelming",
        "author": "Diddley4209",
        "url": "https://www.reddit.com/r/truegaming/comments/113972p/hogwarts_legacy_phenomenal_world_design_but/",
        "text": "As a child I was quite a dedicated fan of Harry Potter. I read the books and watched the movies several times each, and fell in love with its world. That being said, Hogwarts Legacy really wasn't on my radar until the extensive praise it received, prompting me to try it out if nothing more than to satisfy my past self.  And I feel.. disappointed?\n\nTo preface this, there are few things I enjoyed from what I've played. the world design is certainly phenomenal. The layout of Hogwarts feels completely accurate, with the small details all beautifully realized. The art direction and sound design encapsulate this beautifully, really making me feel like I'm \"in Hogwarts.\" Additionally, the gameplay is actually fairly well-executed, and combining spells in a strategic manner makes for very enjoyable and engaging duels. \n\nDespite all this, the overall game feels lifeless. During after hours the common rooms are empty, and conversations between yourself and other students are rarely had (any interaction with fellow students seems to boil down to being praised as this yet unbeknownst prodigy). The \"random encounter\" events are generic and uninspired.\n\nThe characters are one-dimensional, without any additional complexity beyond \"good\" and \"evil,\" and the dialogue seems ridiculously childish. One of the first quests in the game was dueling some slytherin boy, and upon doing so, the main character receives extensive praise from him and immediately become best friends. There's no actual chemistry between these two characters, no realistic interactions, the game's plot just decides they have to be friends and so they become close friends. Even more jarring, he portrays himself as this flawed troublemaker, supposedly escaping detention and sneaking off regularly, but in dialogue with you, is nothing of the sort. \n\nSpeaking of dialogue, the dialogue feels just... weird? I'm aware this takes place in the late 19th century, so contemporary language shouldn't necessarily be expected, but Professor Fig speaks as if he's using a thesaurus with every word, talking with eloquence for the sake of eloquence alone, while the rest of the dialogue feels barbarically simple, including the options for you to choose (choices offer no real choices or complexity). The main character doesn't really have any roleplaying depth besides immense optimism and selflessness and is ultimately just a generic self-insert chosen one protagonist, who gains nothing from being a self-insert due to their already realized personality.\n\nEven your status as a \"student\" is completely inconsistent with the gameplay and power fantasy plot. You're this immensely powerful wizard who ventures into \"forbidden\" areas while casting \"forbidden\" spells, but are supposedly under the constraints of a student at Hogwarts, with none of these plot holes explained whatsoever. Even a few hours in, my ability to suspend my disbelief was being tested, quite a significant issue in a game as narrative-focused as this.\n\nI hope this didn't come across as too much of a rant --- as a licensed game Hogwarts Legacy certainly delivers, and it does as much as could be reasonably expected from this studio, but the extensive praise it's receiving just feels quite disconcerting to me. It just feels overall, mediocre, with some merits, but also a ton of flaws, and nothing that really sets it apart besides the Harry Potter aesthetic, suffering from many of the issues that plague open world RPGs while also taking significant steps back in the actual \"roleplaying\" facet.",
        "created_utc": 1676496888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hogwarts Legacy Cheap",
        "author": "agile_high",
        "url": "https://www.reddit.com/r/truegaming/comments/1135uct/hogwarts_legacy_cheap/",
        "text": " I found a website where we can buy hogwarts legacy for a more cheap price heheh im very excited to play the game 😁\n\nhttps://www.g2a.com/n/hogwarts-legacy-order-now",
        "created_utc": 1676488110,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think are the key differences between an 8/10 and 9/10 video game experience for you?",
        "author": "PuzzleheadedBee6",
        "url": "https://www.reddit.com/r/truegaming/comments/1134oa1/what_do_you_think_are_the_key_differences_between/",
        "text": "I've always felt that the difference between these two scores, when reviewing a video game, can be blurry. For me, personally, the hardest scores for me to be satisfied with giving are the ones that I think are somewhere between an 8 or a 9.\n\nEssentially, for me, an 8 is something that I think is \"great\", but a 9 is \"more than great\" while also not being so phenomenal that I find it to be a masterpiece. It's tough for me to define, so I'm curious how some of y'all make that choice if you also enjoy reviewing/scoring the games you play.",
        "created_utc": 1676485151,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why design bosses as amorphous neon monstrosities?",
        "author": "timmytissue",
        "url": "https://www.reddit.com/r/truegaming/comments/1133pz0/why_design_bosses_as_amorphous_neon_monstrosities/",
        "text": "Just eminating colour and particles. Maybe looking like a big ball of goo or a vaguely humanoid shape.\n\nA recent game did this which I won't bring up to spoil, but also botw. I feel like there are lots of other examples I can't think of at the moment.\n\nUsually it's that some dark energy is taking over and making all the bosses, do they all look the same. Kinda like Mario Sunshine with the goo.\n\nContrast this with games like Elden ring or sifu or hollow knight where the bosses look like physical creatures that exist.\n\nI also generally dislike enemies being like this too such as in games like control and Alen wake where the enemies are these semi formless humanoids. \n\nI guess I just want to fight things with skin if you know what I mean. \n\nIs there a good reason to do this that I'm missing?",
        "created_utc": 1676482709,
        "upvote_ratio": 1.0
    },
    {
        "title": "MINECRAFT: Steve Has Gotten Even Stronger.",
        "author": "ConfidentGaming",
        "url": "https://www.reddit.com/r/truegaming/comments/1131vku/minecraft_steve_has_gotten_even_stronger/",
        "text": "[removed]",
        "created_utc": 1676478315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it so rare for a game series to receive more than 3 installments nowadays?",
        "author": "AnyPassenger9466",
        "url": "https://www.reddit.com/r/truegaming/comments/1130xro/why_is_it_so_rare_for_a_game_series_to_receive/",
        "text": "With most IPs made in the last 15 years, one thing I've noticed is how quickly they get abandoned. If they're successful enough they might get a sequel, maybe even a trilogy if they're lucky, but then the publisher calls it quits and moves on to something new. If a fourth installment *does* get announced, it's either put on the back burner for many years or ends up being super mediocre (see: Mass Effect Andromeda, Just Cause 4, Postal 4). When was the last time we saw a new game series receive 4, 5, or even 6 titles? The newest one that I can think of is Five Nights at Freddy's, and that series has been losing steam for quite a while now. Who knows if/when we're ever gonna see a Bioshock 4, Borderlands 4, Dead Space 4, or Witcher 4. If you count games that haven't gone beyond a sequel, the list goes even further...",
        "created_utc": 1676475814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Narrative difficulty options - is it even possible?",
        "author": "ConceptualizedPotato",
        "url": "https://www.reddit.com/r/truegaming/comments/112zska/narrative_difficulty_options_is_it_even_possible/",
        "text": "[removed]",
        "created_utc": 1676472731,
        "upvote_ratio": 1.0
    },
    {
        "title": "“VALORANT Patch Notes 6.03: A Comprehensive Guide to the Latest Update”",
        "author": "Gamingplane_com",
        "url": "https://www.reddit.com/r/truegaming/comments/112x5fu/valorant_patch_notes_603_a_comprehensive_guide_to/",
        "text": "[removed]",
        "created_utc": 1676465002,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Fortnite]: \"The Ultimate Guide to Mastering the Popular Battle Royale Game”",
        "author": "Gamingplane_com",
        "url": "https://www.reddit.com/r/truegaming/comments/112x1kf/fortnite_the_ultimate_guide_to_mastering_the/",
        "text": "[removed]",
        "created_utc": 1676464642,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Valorant: The Ultimate Guide to Mastering the Popular Competitive Shooter Game”",
        "author": "Gamingplane_com",
        "url": "https://www.reddit.com/r/truegaming/comments/112wiaa/valorant_the_ultimate_guide_to_mastering_the/",
        "text": "[removed]",
        "created_utc": 1676462794,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finished Elden Ring and I need to vent",
        "author": "Lazlowi",
        "url": "https://www.reddit.com/r/truegaming/comments/112vmc6/i_finished_elden_ring_and_i_need_to_vent/",
        "text": "TL; DR: I did it. I beat Maliketh, I beat Godfrey, I beat Radagon and destroyed the Elden Beast. I brought the Age of the Stars in the Lands Between. I'm not even sure how I feel - or if I wan't to keep going.\n\nAt the start, stepping out in Limgrave was amazing. The huge tree in the middle, the colors, the wonder. Meeting Renna, upgrading my weapon, clearing out the camp next to the gate a few times, just to practice the combat and get some gear, getting strong enough to beat Margit and Godwyn was actually amazing. The exploration, the wonder, the world.\n\nThis was the point where I had to look up how can I use the Great Rune I found. I opened the wiki and read about it, found that I missed a whole ass area in Stormveil Castle, even though I was already in Liurnia of the Lakes, trying to figure out how do I get to the Academy in the middle. I found a YouTube video, and another one, and the next one, I started paying attention to the stats, picked up some items that I thought would complement my playstyle, killed Rennala rather easily (however I found the Academy itself horribly annoying with the machine gun asshats). I got the medallion parts (after attempting to pass the mine, as I had no idea where the second half of the Dectus medallion was, and I got shot down by ballistae and killed by the crazy tower trying to approach it) - I had to cheese the fort and run past all those bastard bats to get it, but I got it. I got to Altus Plateu, explored a bit, then saw the bigass castle in the northwest on the map, met Ranni, half followed her questline, half read it on the Wiki, got my ass handed to me by Astel a few times, re-specced at Rennala to a jump-attack based strength build, handed Astel's ass to them, then Blaidd's, then everyone elses - the mimc tear is OP AF.\n\nI went through the second half of the game, and I still have no idea why I did all these things, what did I achieve. I basically ran around trying to survive in the Mountaintop of Giants and the Consecrated Snowfields, but rather easily killed both Niall and the Fire Giant. I read about the Deeproot Depths when I looked up if I'm strong enough for where I woke up, so I looked up where it was and how to get there - I wouldn't have found it without a guide after being abused by the singing horny ladies in the upper parts of Siofra River. I had fun there again, exploring, fighting what the game threw at me - except the insta-death mist.  Then I had some more fun in the Crumbling Farum Azula, when I had to fight 1-on-1, and not being jumpscare-ganked by hairy ass beasts. This was the most gorgeus place I have seen in a game, absolutely awesome. Then I ran through Ashen Capital in basically 1 hour and that's it. \n\nWhat was the point? What did I achieve? The world looks exactly as terrible, the mobs can still gank and gut me at level 131. I didn't even bother going to the Haligtree after a few attempts of surviving the god damned snipers in the gaol. I met Millicent, gave her the golden needle, defeated the dude in the middle of Caelid, but I never want to go there again - those dogs and birds are god damned assholes, never mind the rot and the constant depression. I wouldn't want to explore that by myself. I found Rya of Volcano Manor after I beat Morgott and was curious how do I get to Volcano Manor, who kindly explained to me how I can go around the Grand Lift and that I should go to Altus Plateu... Well, thanks, I guess? I still didn't find the fat rolling dude in Volcano Manor, beat the duo on first attempt in 3 minutes in Farum Azula.\n\nI'm not sure I want to go back, but still I can't keep thinking about trying Malenia, getting to the Haligtree, exploring the areas I didn't complete (mostly the northern parts of the Altus Plateu). I killed every shard bearer except Malenia, beat the game, and I feel kind of disappointed. All I learned was through youtube videos and item descriptions. The narrative of the game was basically non-existent. This was exceptionally disappointing after being advertised with GRRM taking part in the story. I can't comprehend how this game was nominated for best narrative, even though I completely understand how it won every best game of the year. It's huge, extremely sophisticated, detailed, rich, it's just wonderful. A true magnum opus of From Software. As a work of art, it is amazing. As a virtual world to immerse yourself in - it is too stressful and annoying, most of the time, which really takes away the incentive to explore and enjoy.\n\nI'm really curious what's left in this game, but I'm pretty sure I won't find good story or lore, just more vague item descriptions. I'm pretty sure compared to the enjoyable moments and wonderful scenes will be far outweighed by the amount of surprise ganks, anxiety and annoying deaths. I kind of want to go back to the Lands Between and continue exploring and at the same time I get nervous even when I think about it. I believe it's time to move on. I'm not sure I'll play any FromSoft game ever, again.",
        "created_utc": 1676459459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a logical reason to add a 'scan' mechanic which you can't use while moving?",
        "author": "GeekdomCentral",
        "url": "https://www.reddit.com/r/truegaming/comments/112lktw/is_there_a_logical_reason_to_add_a_scan_mechanic/",
        "text": "Like many posts, this will be about Hogwarts Legacy, but we're not going to get into the actual game or Harry Potter itself. It's a hot topic right now, everyone has an opinion, and that's not the point of this post so please let's not get sidetracked.\n\n For those that haven't played, you have a 'scan' spell that you can cast, which will reveal hidden collectibles/puzzles and the like (almost any open world game from the past decade has some form of this, whether it's a toggle that you can permanently enable or just a button press to scan. It sends a 'pulse' out from the player that highlights things in the environment). \n\nThe trouble in Hogwarts Legacy is that casting this spell stops you in your tracks. You cannot use it while moving, and if this were a spell that weren't used very often then it wouldn't be a big deal. But this is a spell that you're encouraged to cast often, because it's mainly how you find secrets, collectibles, and puzzles in the world, and I find it maddening. Instead of just raging online though, I thought that maybe it could be turned into a potential discussion about game/mechanic design. These are all of the potential reasons I could come up with for the developers implementing it in this way, and these are all completely hypothetical, and some are unrealistic. But I was trying to think of every different scenario that I could:\n\n - Simple oversight, where it just never happened to get brought up during development\n\n - It was on an internal 'feature list' to add but was low priority, and just hasn't been added yet\n\n - For some gameplay reason they don't want the player to be able to cast it while sprinting, so it was added explicitly to stop them\n\n - It's a technical issue, where perhaps the computational power required to scan the environment while moving through the environment at a higher speed caused issues?\n\n - They couldn't decide 'where' to cast the spell 'from'. What I mean by this is that if you're sprinting and cast the spell at point A but are at point B by the time the scan really happens, do you send the scan out from point A? Or do you wait and send the scan out from point B? \n\nI know that none of us worked on the game, so we won't ever actually KNOW why it was done this way.  But as I stated earlier, I thought potentially turning it into a discussion could be more interesting than just ranting online.",
        "created_utc": 1676423161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should modern developers cut their losses, plow through, or try, try again when a game misses its console window?",
        "author": "aploc",
        "url": "https://www.reddit.com/r/truegaming/comments/112f1qm/should_modern_developers_cut_their_losses_plow/",
        "text": "Mulling it over, I realized that several games that received high-profile criticism share one thing in common: bloated dev times cause them to miss their console window, and development is restarted from scratch. That's rarely the full story, but it's a funny coincidence, isn't it? For some examples, Duke Nukem Forever, Cyberpunk 2077, and Final Fantasy XV spring to mind as particularly infamous for this problem. The Last Guardian criticism sort of came and went, but people were extremely disappointed with it, as well.\n\nRarely, we get a look at what might've been if development had simply continued on. Recently, we got access to the 2001 build of Duke Nukem Forever, and, with a little more time in the oven, it seems clear that it would have easily competed with contemporaries like Half-Life. In 2001, DNF had dynamic glass shattering that's still impressive today, gorgeous skyboxes, and plenty of the kind of clever traps Duke 3D is known for. It seems beyond question that this game would've not only been a more respectable part of Duke's legacy, but probably strongly influenced the FPS genre moving forward. Certainly, its design wasn't any fresher in 2011.\n\nSurely, it's often a case of armchair game development and hindsight being 20/20, but how many games start development over entirely and end up being remembered positively? Surely from a budget perspective it's gotta be better to drop the game entirely or just see through what you've already finished.\n\nReleasing the game in a seemingly-unfinished state is definitely a plague I'd prefer to do without, but games like Cyberpunk 2077, YIIK, and No Man's Sky have shown that, so long as the developer doesn't give up on it, it's possible to rehabilitate the bad reputation and give the game's sales legs.\n\nIn the PS2 era and earlier, development cycles were short enough that this wasn't too much of a problem. Capcom could afford to scrap Resident Evil 4 four times, and still get what is arguably the best entry in the franchise and one of the best action IPs of all time out of the deal, and still release the game in only four years.  Ocarina of Time moved from the 64DD to the Nintendo 64 in only 4 years' time, and, as far as I'm concerned, only benefitted from the decrease in scale. I mentioned Half-Life earlier, which was completely rebuilt in just one year.\n\nPerhaps an outdated mindset is to blame. A lot of these developers have been in the industry since the timeline to complete a game was only months. What do you think?",
        "created_utc": 1676405938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some advice on a game to play",
        "author": "YoureMrLebowskidude",
        "url": "https://www.reddit.com/r/truegaming/comments/112a4ov/need_some_advice_on_a_game_to_play/",
        "text": " \n\nAlthough a plus, I don't care about graphics or high production or whatever. I don't care about multiplayer. I cherish gaming for high-quality immersive single-player experiences with AI.\n\nAs a child, my favorite games were Zelda OOT, metroid snes and NES version of Maniac Mansion. Why? I was totally in awe and immersed in the possibility. I didn't feel like I was playing a game on my couch. It was live and real. There is a real sense of possibility in these games. i was totally immersed and the world felt alive. The secret felt alive. It didn't feel like a script or cliche.\n\nAs an adult, my favorite games are hitman Bloodmoney and replaying Deus Ex 1, KOTOR 1 and Planescape torment. I also like CIV 4 and roller coaster tycoon. i don't think I've ever had a better gaming journey than the ride that is KOTOR 1.\n\nI have a switch and xbox series x. I don't think I've played a new game that has brought me the wonder and adventure that I experienced as a kid with OOT. I've basically just given up on gaming. every time I start a new game I just can't get into it. I played Skyrim, it had its moments, I tried Witcher 3 - I could not get passed the mini map. it completely ruined the game for me. Whereas in skyrim there is an arrow compass in witcher I just ended up staring at the mini map the whole time. I tried mass effect series and found it nothing like KOTOR and was really disappointed.\n\nPlease - suggest some games for me. I want a game that completely immerses me that keeps me up at night that I can't solve a situation so I spend hours researching every aspect of it through the game manual or online wiki. I remember being a kid an spending hours reading the OOT or Majoras Mask game manuels or game books. it was so much fun.",
        "created_utc": 1676393601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some help finding a game to play",
        "author": "YoureMrLebowskidude",
        "url": "https://www.reddit.com/r/truegaming/comments/112949f/need_some_help_finding_a_game_to_play/",
        "text": "Although a plus, I don't care about graphics or high production or whatever. I don't care about multiplayer. I cherish gaming for high-quality immersive single-player experiences with AI. \n\nAs a child, my two favorite games were Zelda OOT, metroid snes and NES version of Maniac Mansion. Why? I was totally in awe and immersed in the possibility. I feel like I was playing a game on my couch. It was live and real. There is a real sense of possibility in these games. i was totally immersed and the world felt alive. The secret felt alive. It didn't feel like a script or cliche. \n\nAs an adult, my favorite games are hitman Bloodmoney and replaying Deus Ex 1, KOTOR 1 and Planescape torment. I also like CIV 4 and roller coaster tycoon. i don't think I've ever had a better gaming journey than the ride that is KOTOR 1. \n\nI have a switch and xbox series x. I don't think I've played a new game that has brought me the wonder and adventure that I experienced as a kid with OOT. I've basically just given up on gaming. every time I start a new game I just can't get into it. I played Skyrim, it had its moments, I tried Witcher 3 - I could not get passed the mini map. it completely ruined the game for me. Whereas in skyrim there is an arrow compass in witcher I just ended up staring at the mini map the whole time. I tried mass effect series and found it nothing like KOTOR and was really disappointed. \n\nPlease - suggest some games for me. I want a game that completely immerses me that keeps me up at night that I can't solve a situation so I spend hours researching every aspect of it through the game manual or online wiki. I remember being a kid an spending hours reading the OOT or Majoras Mask game manuels or game books. it was so much fun.",
        "created_utc": 1676391028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do all our arguments lose weight if sales say otherwise? Hogwarts Legacy has PS5 exclusive content &amp; $20 DLC, yet still broke records on steam.",
        "author": "ichi000",
        "url": "https://www.reddit.com/r/truegaming/comments/1127jpc/do_all_our_arguments_lose_weight_if_sales_say/",
        "text": "I see people say they refuse to buy games that are broken/buggy/unoptimized on launch, yet this game is outperforming everything on the market.  \n\n\nMy question is, doesn't all these arguments fall flat, when people end up buying the game anyway?  Like why would developers listen to anyone after Hogwarts Legacy success.  It even has Denuvo, so any argument against DRM loses if you bought it anyway.  A lot of protesting I seen from gamers, criticizing developers.  Whole community went back on their word and bought this game.",
        "created_utc": 1676387090,
        "upvote_ratio": 1.0
    },
    {
        "title": "UK retail chart: Hogwarts Legacy started 80% better than Elden Ring",
        "author": "Odd-Wing8645",
        "url": "https://www.reddit.com/r/truegaming/comments/111x3o1/uk_retail_chart_hogwarts_legacy_started_80_better/",
        "text": "[removed]",
        "created_utc": 1676360849,
        "upvote_ratio": 1.0
    },
    {
        "title": "All the main facts about Atomic Heart",
        "author": "Odd-Wing8645",
        "url": "https://www.reddit.com/r/truegaming/comments/111wx1f/all_the_main_facts_about_atomic_heart/",
        "text": "[removed]",
        "created_utc": 1676360105,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most fun games for the Switch?",
        "author": "BigBambooStick42",
        "url": "https://www.reddit.com/r/truegaming/comments/111v6dj/what_are_the_most_fun_games_for_the_switch/",
        "text": "I’m not sure if this is the correct place to ask this (I’ve asked elsewhere too), but what do you think are the most fun games you’ve played on the Switch?\n\nI’ve played some of the bigger titles over the years (BoTW, Super Mario Odyssey, Scarlet/Violet, etc.), but I’m wondering what games have the highest “fun-factor” (while also acknowledging that I’m finding it difficult to define what “fun” means here). \n\nFor example, I enjoy RPGs, and Divinity Original Sin 2 is one of my favorite games [and it is often very fun (when you’re not totally engulfed in flames)]. But I don’t always feel like playing it. On the other hand, there’s an indie rogue-like called Skul: The Hero Slayer that I’ve found to be very easy to pick up and play, has a lot of replayability, and is just simply pretty fun. I don’t necessarily think Skul is a better game than DOS2 (not in a lot of ways; DOS2 is a very impressive and enjoyable game), but Skul scratches a different itch: to boot up a game, get right into the gameplay/combat mechanics (with very minimal story), and start having fun quickly. \n\nI’m wondering what games, if any, do something similar to this for you. Thanks.",
        "created_utc": 1676353657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question: First Person for Player and Third Person for Bike?",
        "author": "johnadaniels",
        "url": "https://www.reddit.com/r/truegaming/comments/111sj0z/question_first_person_for_player_and_third_person/",
        "text": "Hello,\n\nDo you think it would be ok to have the main player be in First Person and then when he rides his motorcycle, it is in 3rd Person?\n\nThe bike has to be in 3rd person, so would it be better to have both in 3rd person or do you think it would enhance the game play to have both?\n\nI like both First Person games and 3rd Person games so I thought it might be cool to have both in one game.\n\nThank you,\n\nJohn",
        "created_utc": 1676345057,
        "upvote_ratio": 1.0
    },
    {
        "title": "does this sound like a good idea for a cover shooter",
        "author": "NorthPermission1152",
        "url": "https://www.reddit.com/r/truegaming/comments/111l58x/does_this_sound_like_a_good_idea_for_a_cover/",
        "text": "I had an idea for making a cover shooter and the protagonist is armed with a revolver he personally owns and at the beginning of each level he's put into he has around 60 rounds of ammo to put into a 6 round chamber. If he/the player decides to reload before using all the shots in the chamber he drops all the bullets and loads a completely new chamber.\n\nHe can pick up other weapons from dead enemies but he cannot reload them and will only be able to use the ammo that's left in the gun's chamber to take out enemies.\n\nNot every level has healing items you can pickup from the environment, you never start with healing items but you're always starting with full health.\n\nI thought about putting in slow mo and shootdodge like the Max Payne games.",
        "created_utc": 1676325158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for feedback on a game-based learning project: using points earned by students to upgrade characters and engage in post-quiz battles. What are your thoughts and suggestions?",
        "author": "aditya11electric",
        "url": "https://www.reddit.com/r/truegaming/comments/111hmas/looking_for_feedback_on_a_gamebased_learning/",
        "text": "Combining gaming and education has been a challenge for many in the past, with many failing to fully utilize the potential of game-based learning. Despite this, I've been working on a similar project for the past two years, with nearly eight iterations under my belt. I'm happy to say that I think I'm finally on to something. \n\nWe're hosting an esports league based on our product, where users can collect points to unlock special powers and moves for their characters. Teams will compete against each other in their respective educational domains through MCQ quizzes, with each question affecting the player's health, attack capability, animation, and power moves, including a game-changing \"god move.\"\n\nAfter the quiz, users will see the results of their post-quiz battle simulation, which will last less than a minute. The goal is to motivate and engage students by offering a range of easy to application-based questions. All you have to do is solve questions and watch as your character battles it out. \n\nIf things go well, I plan to develop an app that allows students to create their own characters by solving quizzes and unlocking power. They can then challenge other students or schools, with their power level determined by their quiz scores. The more you solve, the more powerful you become. \n\nSuggestions are welcome, and I'm happy to share our website and registration link as well.",
        "created_utc": 1676316472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever play tested a game at a big studio? How was it?",
        "author": "AsteroidSnowsuit",
        "url": "https://www.reddit.com/r/truegaming/comments/111f9um/have_you_ever_play_tested_a_game_at_a_big_studio/",
        "text": "I am going on a play test this Friday and I am wondering how the playtest will go.\n\nIt’s from 9 to 17, so I am wondering what I will do during these 8 hours.",
        "created_utc": 1676310680,
        "upvote_ratio": 1.0
    },
    {
        "title": "What compels companies to make lengthy games if only a fraction of the player base actually finishes them?",
        "author": "TyleNightwisp",
        "url": "https://www.reddit.com/r/truegaming/comments/111buh5/what_compels_companies_to_make_lengthy_games_if/",
        "text": "I had this on my mind after checking some trophies/achievements of some popular games. I realized only an average of 40% of players actually finished GTA 5, and even less than 20% of players beat Elden Ring. Even acclaimed shorter games like Hi-Fi Rush only has a tiny amount of players actually reaching the end, which I assume is the case because the rhythm gameplay is a bit more niche and harder to get used to.\n\n\nAt first, I thought it could be because the games are challenging, but then again a lot of these have easy/accessible modes which can help the majority of people to reach the end, save for perhaps Elden Ring. So having that in mind, why do most people simply give up? \n\n\nNot only that though, but devs also have those statistics, so it surprises me that there is still this push in the industry to make massive, lengthy single player experiences, that only a tiny amount of the player base actually gets to experience. Going from a business aspect only, why is it worth investing huge dev time on making lengthy games if they know the majority is *not* going to play it to the end?",
        "created_utc": 1676302121,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"git gud\" vs bad design",
        "author": "Akito_Kinomoto",
        "url": "https://www.reddit.com/r/truegaming/comments/110wvxn/git_gud_vs_bad_design/",
        "text": "when do you decide a game wants you to play by its rules and when do you decide something's design is actually bad?\n\ndiscussions about difficulty always seem to get contentious since folks observing bad design might be ignorant of the \"rules\", while those who know the \"rules\" might forget how they've worked around bad design. IE, treated as mutually exclusive when they aren't. But instead of litigating how those discussions should go, I want a more precise picture of when *you* decide \"skill issue\" or \"game issue\"\n\nwhen do you decide a game wants you to play by its rules and when do you decide something's design is actually bad? *Examples* are not only welcome...they're allowed\n\n1. &gt;!Dark Souls--aside from the ghosts in New Londo Ruins, there's nothing that can't be \"scouted\" ahead. Bosses are straightforward except Bed of Chaos. Definitely playing with the game's rules instead of the game's problems 95% of the time!&lt;\n2. &gt;!Dark Souls II--and unfortunately, this game has a habit of throwing multiple strong enemies your way. The most prominent example being several baldr class knights flooding a doorway in the Lost Bastille. Also, bosses on merry-go-rounds. 15% of the time the game has no rules!&lt;\n3. &gt;!Code Vein--this seemed fairly straightforward. And then there were fat guys moving as fast as attack dogs. And then there are times enemies will spawn out of nowhere when the player walks into the wrong \"tile\". The enemy design making less than no sense is one thing, randomly shoving a character designed for a slower game into Dynasty Warriors is not. Dropped fairly early!&lt;\n4. &gt;!The Surge 2--there's an early area called Port Nixon where enemies can use a buff to make themselves stagger resistant. The \"tutorial\" area before, the zones after, and even the late-game areas don't do this. It might be trying to teach not to attack recklessly, but the only enemies that won't get staggered in later areas are literal statues or bosses. Very skilled based otherwise. It's take on parrying is great btw!&lt;\n5. &gt;!Astral Chain--Cerberus has a roar attack that stuns nearby characters long enough for a follow-up and can only be stopped by wave slash. It's meant to be the first challenging fight of the game, except 1) wave slash is preemptive, not reactive 2) the enemies that need wave slash are passive and 3) the player has no real ranged attacks at this point. It's a File 09 boss that shows up in File 03 and not the other way around; none of the other C9-class enemies have an instant stun-into-damage combo. Missions like R3 B3 are a lot harder, Cerberus is just a failed teaching tool in the story and a ranged check in bonus missions. It's such a bad mark on a game whose moment to moment combat \"tiles\" are otherwise superb!&lt;\n6. &gt;!Neptunia: Sisters vs Sisters--there's an enemy type called mecha doll that can decide, whenever she wants, to power out of a combo and start smacking the active character for massive damage. Battle tanks, large dragons, big horses, and humongous mech suits, however, can't break out of combos. While the game isn't particularly hard at all, mecha doll enemies seem to exist solely to exhaust healing items!&lt;\n7. &gt;!Dragon's Dogma--1/2 the time, combat encounters can be planned ahead with simple observation. The other 1/2, mooks spawn on areas either just walked past or only when stepping onto a certain \"tile\". But for all the cheap shots it takes, it still can't afford difficulty, even on hard!&lt;\n8. &gt;!Dynasty Warriors 8--the Heaven, Earth, and Man affinity on weapons does a great job in ensuring the player has to think about officer fights, as they can only bring 2/3 for any given stage. Unfortunately, Musou attacks can, or should, only be used defensively. Because for whatever reason, when an enemy officer uses a Musou attack, the player's character is locked in place and will get one-shot unless they also use a Musou attack of their own. That part of the arsenal is basically locked out because of that!&lt;\n9. &gt;!Monster Hunter World--there's a quest called Pandora's Arena that requires the player to repel a lunastra within 15min. In a pit that makes avoiding her nova impossible. In a mission that disables farcasters. On a monster with bad hitzones and a tail whip from Marvel vs Capcom. Lunastra has a bunch of tools that have their solutions effectively sealed from the player, which doesn't happen in a real quest against her. The quest against teostra and lunastra together is astronomically less arbitrary than this. Actually, the Arch-Tempereds are better than this!&lt;",
        "created_utc": 1676254746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Perhaps other games can learn less from Elden Ring than one might think. (Spoilers)",
        "author": "Halo_Is_Pretty_Gud",
        "url": "https://www.reddit.com/r/truegaming/comments/110wlkm/perhaps_other_games_can_learn_less_from_elden/",
        "text": "\\*\\*\\*(Can skip to the stars for my main point)\n\n&amp;#x200B;\n\nBefore Elden Ring, the game developed by FromSoft which was said to have the best overall story was \"Bloodborne\"\n\n&amp;#x200B;\n\nAnd it works.  You are in some dreamworld created from a Lovecraftian deity.  Within that dream, civilization has somehow managed to work, to a small degree.  But the citizens are mostly in hiding for now until an unusually dark time passes, which is why you don't see too many normal folk outside.\n\n&amp;#x200B;\n\nElden Ring appears to make much more sense as a \"dreamworld\" of some sort, rather than anything naturally occurring.  Why in the world does nearly everything you meet aggro on you?  Why, when you defeat Radahn, cure Millicent of Rot, and \"free\" Miquella from Mohg...why can you not even attempt communication to Milenia?   Why is nearly everyone you meet an aggressive zombie, who somehow also can get dressed, stay in formation, and sharpen their blades on a regular basis?\n\n&amp;#x200B;\n\nA lot of games try making their story elements fit like a puzzle piece.   Elden Ring works in a more dreamlike fashion, where the story elements only work if you melt the puzzle pieces into their corresponding positions.  \n\n&amp;#x200B;\n\nElden Rings overworld is amazing to explore, but the games...unreality really shows itself.  There are no farms. You get to the snow area by taking an elevator DOWN. Heavenly Limgraves sky turns into Hellish Caelids sky with a single step. A general who can summon undead warriors is just...chilling on a small piece of land in a poisonous lake, and immediately attacks you instead of saying absolutely anything or giving any form of warning.\n\n&amp;#x200B;\n\n NPC's are somehow greatly afraid of death, but there is not death. Until there is again!    You supposedly defeat Maliketh, the black blade and restore death.  But you can respawn even if you die, once again.  Or, perhaps only you can now actually kill others.   I am not entirely sure, and the game tries hard to not really explain its undead/respawning mechanic because when under scrutiny the only explanation is \"This is a game and this is the game mechanic\" \n\n&amp;#x200B;\n\n\\*\\*\\*\n\nSince games like Skyrim/Witcher/Dragon Age/other RPG's try building up what is a coherent world state, they will never have the freedom in enemy placement and overworld creation like Elden Ring.  \n\n&amp;#x200B;\n\nTo me, the insight of this game is:  The more fluid you let your story and overworld become in terms of logic, the greater variety of enemies you can place in the overworld.  But if you want a story that MAKES sense, you have less freedom in terms of art and enemy placement.  \n\n&amp;#x200B;\n\nI'm not sure how much other RPG's can actually learn from Elden Ring, assuming those RPG's are going for something more clearly concrete than \"You are a character in a dream world\"  \n\n&amp;#x200B;\n\nPerhaps the takeaway is this.   There are several parameters a game can optimize for.  The \"peak\" of \"consistent logical world state\"  will take away from the peak of \"enemy placement and art of overworld for human psychology\".",
        "created_utc": 1676253850,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fav discord game servers",
        "author": "Significant-Grand662",
        "url": "https://www.reddit.com/r/truegaming/comments/110rnom/fav_discord_game_servers/",
        "text": "[removed]",
        "created_utc": 1676239530,
        "upvote_ratio": 1.0
    },
    {
        "title": "I miss the thick plastic game cases from the ps2 era",
        "author": "Lopsided_Grub",
        "url": "https://www.reddit.com/r/truegaming/comments/110q053/i_miss_the_thick_plastic_game_cases_from_the_ps2/",
        "text": "I was going through some of my older ps2 games and realized how much more durable those cases are compared the stuff we get today on ps4/5 and Xbox. The old cases hold up so much better and some of mine still look like they're brand new, mint condition. I know they make the ones they do today because it's cheaper, but if we're talking about preservation for the long run, the old way is 100% better",
        "created_utc": 1676235264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep on Witcher 3 next gen or change to hogwarts or play both dividing time",
        "author": "JLPM98191",
        "url": "https://www.reddit.com/r/truegaming/comments/110po7g/keep_on_witcher_3_next_gen_or_change_to_hogwarts/",
        "text": "Hi everyone yeah i know its such a dumb thread lol but i wanted another one opinion. Im about 70  of the witcher completed but just got hogwarts what will you do in my place play the 2 bit by bit or just finish one. Dying to try hogwarts but love witcher so much yeah im undecided.",
        "created_utc": 1676234417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hogwarts legacy (and most open world games) is held back by the amount of hand holding.",
        "author": "laughpuppy23",
        "url": "https://www.reddit.com/r/truegaming/comments/110pc7u/hogwarts_legacy_and_most_open_world_games_is_held/",
        "text": "This game is reminding me why i hadn’t touched open world games in years besides breath of the wild and elden ring. \n\nThere is a quest, similar to the painting in elden ring, where ai am shown an imagine and I have to find the location. Great! Sounds fun! Except the game immediately show’s me exactly where to go to find it…? So what is the point?\n\nA girl asks me to find her gobstones scattered around the school, kind of like korok seeds, cool! Except, again, the game tells me exactly where to go for each one. \n\nIf they literally just let me look for these things myself the game would be a million times better. \n\nI thought would for sure be done away with after the two aforementioned games showed how much better a game is without it.\n\nI get that the devs don’t want you to miss any morsel of content, but that just means you turn your brain of and the game becomes a series of chores.\n\nHow hard would it be to give us the option to just turn that off? That alone would elevate these sorts of games by a lot!",
        "created_utc": 1676233569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guitar Hero 2 is a project so passionate that it makes the game a masterpiece to me.",
        "author": "maestriaanal",
        "url": "https://www.reddit.com/r/truegaming/comments/110l94x/guitar_hero_2_is_a_project_so_passionate_that_it/",
        "text": "Now listen. I love guitar hero, I've played GH1, GH2, GH80, GH3, RB and RB2 to death. In most games i Had FC'd (100% without breaking combo) most of the songs. They are all incredible and to me everything else of the series is just a cash grab.  \nI'm sure that a lot of people will know what I mean with this post\n\nGuitar Hero 2 to me is something surreal. It's something that's so truly special that there aren't many words to explain how. Games that to me are the Original GOW, God Hand, Dark Souls, Elden Ring, Doom Eternal, Disco Elysium, GTA San Andreas, Vice City, IV.... and many others. These games have a lots of analisis and critique of them but we can all agree that they have some kind of magic. Now my points are:  \n\\-the aesthetic of the menus, the drawings, the sounds, everything was so smooth. Every button you pressed had the 'cshhhh' 'twang' 'caszha' 'tuuUuU' of their own, while the menu and the background images were very dynamic.  \n\n\n\\-this game singehandedly made me more interested in how music worked, even if I was a kid playing. I started playing guitar and listening to a lot of music because of the game  \n\n\n\\-\\*EXPLOSION\\* you rock!\n\n\\-When you use star power to pass a hard section by a scratch and you have that hard pounding feeling of attention and volition. And then the relief and the feeling of being a rockstar  \n\n\n\\-You could buy guitars, guitarrists, basses, bonus songs etc with the money you won from the gigs\n\n\\-all the setlist songs are covers of Wavegroup. They had these bonus videos that showed they in studio playing and singing the songs, just having fun while working, that video made me see the instruments and people singing and changing gear and I was OOOH MAN THATS HOW THEY DOOO ITTTT  \n\n\n\\-in the menus there were songs playing in the background with different filters that made them so cooool damn   \n\n\n\\-the setlist was written on a notebook that had drawings in them similar to the ones I drawed on school tables and books. The progression was 4 songs and then the encore, every time in another place that had more complex songs and more complex venue too  \n\n\n&amp;#x200B;\n\n\\-theres not much to say about guitar hero gameplay, low skill floor and infinite skill ceiling. Something for everyone I guess.  \n\n\nI think that maybe the magic of this game is the feedback. Everything that you press makes something cool happen, and the game is about pressing buttons in cool patters. It's just a game after all  \n\n\nI have a lot more to say, so maybe we can discuss about guitar hero and rock band I guess?",
        "created_utc": 1676223225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pokemon Scarlet and Violet's 20.68M Copies",
        "author": "No-Buyer-3509",
        "url": "https://www.reddit.com/r/truegaming/comments/110ejkl/pokemon_scarlet_and_violets_2068m_copies/",
        "text": "[removed]",
        "created_utc": 1676204653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Back from a long break from current gen games, uncanny valley.",
        "author": "Weird_Surname",
        "url": "https://www.reddit.com/r/truegaming/comments/11089w8/back_from_a_long_break_from_current_gen_games/",
        "text": "I never really noticed this until I took an extended break where I played mostly retro and cartoony games, i.e., most of Nintendo’s library, for a few years.\n\nNow back playing current gen games ps5, pc, late ps4 games.\n\nThe uncanny valley is hitting me when watching most cutscenes, it’s a bit unsettling. \n\nPerhaps I’ll got used to it over time again. Anyone ever think about or experience this?\n\nI think this will be one of the biggest leaps in gaming if we ever get past the uncanny valley.",
        "created_utc": 1676180581,
        "upvote_ratio": 1.0
    },
    {
        "title": "MafiaKings",
        "author": "AntiGoofyShit",
        "url": "https://www.reddit.com/r/truegaming/comments/1107f7p/mafiakings/",
        "text": "[removed]",
        "created_utc": 1676177533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any info on a War of the Monster reboot for current gen?",
        "author": "J-Kp",
        "url": "https://www.reddit.com/r/truegaming/comments/1102gqb/any_info_on_a_war_of_the_monster_reboot_for/",
        "text": "[removed]",
        "created_utc": 1676161848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any info on possible War of the Monster reboot for current gen?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1676161576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you consider using items in a 1vs1 boss battle cheating?",
        "author": "Nino_Chaosdrache",
        "url": "https://www.reddit.com/r/truegaming/comments/10zyx21/do_you_consider_using_items_in_a_1vs1_boss_battle/",
        "text": "Personally, I do. A boss battle is supposed to be a fair challenge, a test of the skills you've learned so far and for me, using items during these encounters feels like it cheapens the experience.\n\nNoteworthy examples for me would be the Vergil boss fights in Devil May Cry, the Jetstream Sam battle in Metal Gear Rising, the final boss in Metal Gear 3 or most Jeanne fights in Bayonetta, because they are set up as no bullshit gimmick, mano-e-mano fights to determine who's better. And when I use items during these encounters, it didn't feel like I won the duel fare and square, but that I simply cheated, like the Boss in Saints Row 2 at the end of the Ronin story.\n\nOn the other hand, I'm more than happy to use items when the boss starts cheating themselves. Like when they use healing mechanics themselves or when they call in Trash Mobs during the battle. If they don't want a fair fight, they don't get it, simple as that.",
        "created_utc": 1676152144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Playing Hogwarts Legacy and I just realized that QoL features shouldn't be talents 99% of the time.",
        "author": "championofobscurity",
        "url": "https://www.reddit.com/r/truegaming/comments/10zvxyp/playing_hogwarts_legacy_and_i_just_realized_that/",
        "text": "SPECIFICTY: Specifically talking about the Core Tree and being able to set more spells to a palette. With a game that doesn't let you respec (which with every sufficiently complex RPG system you should just include respec into your game.)\n\nAdding menus to use is typically a really lazy way to frame talents. Granted HL isn't that inspired in the talent design. It plays out like pretty much any other \"Chosen One\" game in the last 15 years.\n\n1.)Add a Finisher mechanic.\n\n2.)Add talents that Charge the Finisher.\n\n3.)Sleep through the game.\n\nDETAIL: Could I challenge myself? Sure. But I'm not challenged by not having extra menus, which means those talents are essentially something I think most people would never spend on. Not absent games with degenerate builds where you can utterly dominate the game with just 2-3 talents. Then maybe yeah sure. But if I want to rub a few brain cells together the first thing that goes into \"Not spending on that\" pile are the dumb little QoL Talents.\n\nCLARIFICATION: I just don't understand why developers continue to include these (as talents) and maybe that's my issue. I could definitely understand expanding spell slots as a menu option in the options settings.\n\nThis is all crafting notwithstanding as well, I understand games with crafting mechanics might include QoL talents which I do think is more reasonable. I.E. \"Occasionally don't use materials\" is a QoL mechanic that is fun, and also not that deep. So there's definitely room for them to exist, I just don't think they ought to belong in Combat Trees.",
        "created_utc": 1676144320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regarding the (non)-equivalence of time and difficulty:",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1676142602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Playing Hogwarts Legacy and I just realized that QoL features shouldn't be talents 99% of the time.",
        "author": "championofobscurity",
        "url": "https://www.reddit.com/r/truegaming/comments/10zrxvx/playing_hogwarts_legacy_and_i_just_realized_that/",
        "text": "Specifically talking about the Core Tree and being able to set more spells to a palette. With a game that doesn't let you respec (which with every sufficiently complex RPG system you should just include respec into your game.)\n\nAdding menus to use is typically a really lazy way to frame talents. Granted HL isn't that inspired in the talent design. It plays out like pretty much any other \"Chosen One\" game in the last 15 years. \n\n1.)Add a Finisher mechanic.\n\n2.)Add talents that Charge the Finisher.\n\n3.)Sleep through the game.\n\nCould I challenge myself? Sure. But I'm not challenged by not having an absence of menus, which means those talents are essentially something I think most people would never spend on. Not absent games with degenerate builds where you can utterly dominate the game with just 2-3 talents. Then maybe yeah sure. But if I want to rub a few brain cells together the first thing that goes into \"Not spending on that\" pile are the dumb little QoL Talents.\n\n\nI just don't understand why developers continue to include these (as talents) and maybe that's my issue. I could definitely understand expanding spell slots as a menu option in the options settings.\n\nThis is all crafting notwithstanding as well, I understand games with crafting mechanics might include QoL talents which I do think is more reasonable. I.E. \"Occasionally don't use materials\" is a QoL mechanic that is fun, and also not that deep. So there's definitely room for them to exist, I just don't think they ought to belong in Combat Trees.",
        "created_utc": 1676134043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deus Ex: Human Revolution - Trailer #1 (Remastered 8K 60FPS+Сolor Сorrection) Resolution upscaled with neural networks",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676112545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Youtuber \"Harenko\" Runs Trending Smear Campaign on Atomic Heart.",
        "author": "Ahri_Best_Girl",
        "url": "https://www.reddit.com/r/truegaming/comments/10zg77c/youtuber_harenko_runs_trending_smear_campaign_on/",
        "text": "He has censored/deleted all disagreeing comments. (118k dislikes vs 47k likes)\n\nThe video is trending heavily, getting 1.5+ mil views in under 4 days for a very small channel. I really hope this doesn't hurt their development or morale in any way.\n\n[https://youtu.be/zs7QEo3LmVE](https://youtu.be/zs7QEo3LmVE)",
        "created_utc": 1676104352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Youtuber \"Harenko\" Runs Trending Smear Campaign on Atomic Heart. Censors and removes all disagreeing comments. (118k dislikes vs 47k likes)",
        "author": "Ahri_Best_Girl",
        "url": "https://www.reddit.com/r/truegaming/comments/10zg5h4/youtuber_harenko_runs_trending_smear_campaign_on/",
        "text": "[removed]",
        "created_utc": 1676104183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dailymotion APP APK",
        "author": "Fit_Kaleidoscope_709",
        "url": "https://www.reddit.com/r/truegaming/comments/10zd76q/dailymotion_app_apk/",
        "text": "[removed]",
        "created_utc": 1676093268,
        "upvote_ratio": 1.0
    },
    {
        "title": "It really is painful to see titans like: Halo, CoD, and Battlefield fail massively with their new titles.",
        "author": "LogiBear2003",
        "url": "https://www.reddit.com/r/truegaming/comments/10z8m8m/it_really_is_painful_to_see_titans_like_halo_cod/",
        "text": "We've all had memories on each of these specific franchises, and it's truly depressing seeing each of them completely miss the mark and fail their core audience. Each current title a complete slap in the face to those who supported the IP for years; even when some past releases flopped or didn't perform as expected, their was still people that cared. Now look lmao, bare bones and a shell of their former mechanics and gameplay, that rose these franchises to the titans they are now/used to be. \n\nDo better.",
        "created_utc": 1676078606,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do is stop being so competitive",
        "author": "Prime_account333",
        "url": "https://www.reddit.com/r/truegaming/comments/10z7wnq/how_do_is_stop_being_so_competitive/",
        "text": "So for a couple of months after getting overwatch 2 I was terrible. It wasn't uncommon for people to tell me that my main wasn't for me, and it wasn't unusual for me to miss someone standing still, but as we all do I eventually got better. Genuinely after like 2 days of being better then everyone, diffing the other hanzos, carrying us to victory and getting praised by even the enemy team I started to become toxic. Whenever I had a bad game where I missed shots I should have hit id feel pathetic and try and blame my fps or latency. Now I'm higher into the ranks and being average in my team, and ik I should be happy with that but I cant be, I have a constant desire to be far better then everyone and feel worthless if I'm not.\n\nHow do I go back to enjoying the game like when I was bad",
        "created_utc": 1676076490,
        "upvote_ratio": 1.0
    },
    {
        "title": "/r/truegaming casual talk",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/truegaming/comments/10z4akh/rtruegaming_casual_talk/",
        "text": "Hey, all!\n\nIn this thread, the rules are more relaxed. The idea is that this megathread will provide a space for otherwise rule-breaking content, as well as allowing for a slightly more conversational tone rather than every post and comment needing to be an essay.\n\nTop-level comments on this post should aim to follow the rules for submitting threads. However, the following rules are relaxed:\n\n* 3. Specificity, Clarity, and Detail\n* 4. No Advice\n* 5. No List Posts\n* 8. No topics that belong in other subreddits\n* 9. No \\[Retired Topics\\]([https://www.reddit.com/r/truegaming/wiki/retired/](https://www.reddit.com/r/truegaming/wiki/retired/))\n* 11. Reviews must follow \\[these guidelines\\]([https://www.reddit.com/r/truegaming/wiki/rules/#wiki\\_reviews](https://www.reddit.com/r/truegaming/wiki/rules/#wiki_reviews))\n\nSo feel free to talk about what you've been playing lately or ask for suggestions. Feel free to discuss gaming fatigue, FOMO, backlogs, etc, from the retired topics list. Feel free to take your half-baked idea for a post to the subreddit and discuss it here (you can still post it as its own thread later on if you want). Just keep things civil!\n\nAlso, as a reminder, we have a Discord server where you can have much more casual, free-form conversations! [https://discord.gg/truegaming](https://discord.gg/truegaming)",
        "created_utc": 1676066409,
        "upvote_ratio": 1.0
    },
    {
        "title": "The amount of times i've said to myself \"Wait, why am i doing the videogame thing?\" while playing Prey is ridiculous in the best possible way",
        "author": "prossnip42",
        "url": "https://www.reddit.com/r/truegaming/comments/10z27u6/the_amount_of_times_ive_said_to_myself_wait_why/",
        "text": " \n\nFor those of you who don't know \"Doing the videogame thing\" is a term where a player inadvertently or on purpose respects the boundaries that a game sets for them at a time. Basically the brain, after playing so many different videogames, is basically wired to go \"Oh, that door can't be accessed now, your lockpicking/hacking skill isn't high enough, move on\" or \"Oh, this pathway is blocked and you don't have the required strength to pass through it, move on\" or \"Oh, that platform's too high to reach, move on\" It's these little things that your gaming brain goes \"The game doesn't want you to be here yet, move on\"\n\nHowever, Prey isn't a \"videogame\" videogame. Not even by a long shot and i've had to loose and forget about so many \"Doing the videogame thing\" habits that i have hardwired into my brain even with other RPG games like Fallout or Skyrim. Cause no, you don't need to do the videogame thing with Prey.\n\nHacking too low for the door? Well just break the nearby window and use your toy crossbow to hit the touch panel on the inside and let yourself in, or turn into a coffee cup and break through the broken window.\n\nStrength too low to move the objects standing in your way? Just use your Recycling grenade and turn the debris into crafting parts and move on through or, if you don't have one, just take an easier object to carry and throw it into the desk blocking the doorway with full force till physics does it's thing and the desk falls away from the pathway\n\nPlatform too high to reach? Fucking make platforms with your glue gun and Super Mario your way up there my man, sky's the limit when you make your brain stop doing the \"Videogame thing\"",
        "created_utc": 1676061125,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does \"early access\" right before a game's official release day affect how games are released, financed, and consumed?",
        "author": "BOfficeStats",
        "url": "https://www.reddit.com/r/truegaming/comments/10yzyn2/how_does_early_access_right_before_a_games/",
        "text": "With Hogwarts Legacy's huge early access player numbers (480,000+ concurrent users on Steam) prior to its official launch day, it is clear that many people were willing to spend an extra $10 on the Digital Deluxe version in order to play it up to 72 hours before its official release day.  \n\nWhile the business model of allowing users to pay to experience exclusive features or content before the official release day was not created by Hogwarts Legacy, it's success demonstrates how this model is much more lucrative and widespread than ever.  The developers and publishers are likely generating millions, if not tens of millions, of dollars in additional revenue from allowing people to buy early access to their game. This caused me to think about how this model of releasing games impacts how consumers, developers, and publishers. \n\nIn theory this model could overall be beneficial to everyone but it could also lead to some problems.  Allowing people to pay extra for early access generates more revenue for developers and publishers at very little cost.  In addition, it allows servers to be stressed earlier on and should smooth out the peak concurrent player count since there will be two smaller groups of players logging on rather than one huge group.  Also, consumers could benefit since it allows for potentially millions of consumers to explore a newly released game and give their general impressions.  This would give later potential purchasers more information.\n\nHowever, I could also see this release model creating some issues if it is abused.  For example, a game could technically have early access but limit it to only a small portion of the game.  Thus, concerns about other parts of the game might be crowded out by positive buzz over one specific mode or section.  I could also see this model creating issues if a game is narrative driven and it's story can be easily spoiled.  Fans might feel pressured to pay up the extra cash for a better experience even though it is technically optional.  \n\nWhat do you think about this release model?",
        "created_utc": 1676055802,
        "upvote_ratio": 1.0
    },
    {
        "title": "To a Modern Gamer, Goldeneye 007 is Hard… and Yet Incredibly Fun",
        "author": "ptags12",
        "url": "https://www.reddit.com/r/truegaming/comments/10yzv3e/to_a_modern_gamer_goldeneye_007_is_hard_and_yet/",
        "text": "[removed]",
        "created_utc": 1676055594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Games that achieve 10/10 worldbuilding (“Shandification”)",
        "author": "Izzhov",
        "url": "https://www.reddit.com/r/truegaming/comments/10yubna/games_that_achieve_1010_worldbuilding/",
        "text": "Inspired by [this classic MrBtongue video](https://www.youtube.com/watch?v=eZ3GDcMXBFI), which I consider one of the best video game analysis videos ever, and is #1 on my list of things to show to people who don’t consider games to be art. Check it out if you haven’t seen it, but be warned that it does have some (pretty mild imo – it doesn’t go in depth into plot details) spoilers for Fallout New Vegas.\n\nI’ve been thinking a lot about shandification lately because I’ve come to realize it’s one of my absolute favorite qualities for a game to have, but the number of games I’ve played that have actually achieved it is shockingly small – in fact, I can almost count them on one hand! Other than Fallout New Vegas and Mass Effect mentioned in the video, I’ve played 5 games that I would argue are super-effectively shandified. In alphabetical order:\n\n1. **Caves of Qud**: This game is unique on this list in that the shandification partially results from a procedurally-generated world history – much like Dwarf Fortress if you're familiar with that game's world generation system. But Caves of Qud goes a step further in two ways. First, it mechanizes your character's factional reputations using a system qualitatively similar to what Fallout New Vegas and Morrowind do. Second, whereas Dwarf Fortress is set in a fairly standard swords and sorcery fantasy world, Qud is a mind-boggling, Dune-inspired psychedelic science-fantasy madhouse that has to be experienced to be believed. It also contains the only example of \"math fiction\" (the math equivalent of science fiction) I've read in a story. If you wanna see some wild game worldbuilding, play this game.\n2. **Disco Elysium**: Unfortunately, I cannot breathe a single word about what makes Disco Elysium's worldbuilding so great without massively spoiling it. Play Disco Elysium.\n3. **The Elder Scrolls III: Morrowind**: Endless amounts of digital ink have already been spilled about the world of Morrowind. This game's world is so good and unique compared to most fantasy settings that (false) rumors have persisted for decades that Michael Kirkbride was on a shit-ton of mushrooms when he came up with it. To put my own spin on it, then, allow me to briefly directly compare this game's world to Skyrim's. Skyrim actually has a somewhat shandified world of its own: it passes MrBtongue's \"what do they eat?\" test with flying colors, and it has some factions that vie with each other in some simple ways. Morrowind's setting, however, is plainly *much* more nuanced and well-thought out: more factions with more complex webs of interaction and more interesting tangled histories with each other. The best example of this can be seen in how each game handles the three main guilds: the Fighters Guild (Companions in Skyrim), Mages Guild, and Thieves Guild. In Skyrim, there are absolutely zero interactions between these three guild questlines. But in Morrowind, if you're not careful, you can actually piss off a guild just by following another guild's questline, because the guilds have a much more meaningful and shandified presence in Morrowind's world than they do in Skyrim's. There are countless examples like this, but I'm going to stop here because this is already the longest writeup in this list by far.\n4. **Star Control II**: Ok, sure – Star Control II's universe is kind of silly and simplistic in a lot of ways. Mechanically the game is pretty simplistic as well. But underneath the pulp of the sci-fi lies an eye-opening amount of forethought and worldbuilding effort, from aspects like the evolutionary history of each species to how the complex factional interactions between the different sentient races has shaped the trajectory of the game's harsh political situation. As I played this game, I constantly found hidden little nuggets of lore that connected to other parts of the universe I had explored in unexpected ways, all coming together to paint a vibrant and full picture of that world that even caused me, at times, to think about certain aspects of the real world in a new light.\n5. **Tactics Ogre**: This one's an outlier from the others on this list because it's not an open world that you're free to write your own story in completely as you choose (though it does have a bit o' branching and multiple endings). But I would argue it still deserves to be here by virtue of the sheer effort it puts into the history and political dynamics of its (admittedly much-more-standard-than-the-other-games-on-this-list) world. Without that effort, the emotional weight of the few moral decisions the game *does* place upon your shoulders would not hit nearly as hard as it does.\n\nIt's interesting to think about the commonalities between these five games (and FONV + Mass Effect). All of the games, to some extent, are about *politics*: groups of people (or other sentient beings) coming together and forming alliances and factions which come into conflict with each other for material, ideological, religious, and other assorted reasons. It is perhaps somewhat revealing, in a meta sense, of how real human society works and what we value.\n\nI'm always on the lookout for new shandified games to try, so I highly encourage other people to write a bit about their own favorite examples of worldbuilding in games in the comments ~~(looking for new games may or may not secretly be the main reason why I made this post in the first place)~~.",
        "created_utc": 1676041779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fav discord gaming servers",
        "author": "Significant-Grand662",
        "url": "https://www.reddit.com/r/truegaming/comments/10ynbga/fav_discord_gaming_servers/",
        "text": "[removed]",
        "created_utc": 1676022667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sell me your favorite game in 5-7 paragraphs.",
        "author": "Yes_I_Fuck_Foxes",
        "url": "https://www.reddit.com/r/truegaming/comments/10yl3ex/sell_me_your_favorite_game_in_57_paragraphs/",
        "text": "I'll get us started.\n\n-------------------------------------------\n\nSplatoon 3\n\nIt's a 4v4 third-person shooter, bright and colorful, and has a heavy emphasis on movement and stealth. Your character is a humanoid, shape shifting squid called an 'Inkling' (or an octopus called an 'octoling') with weapons that shoot and spread ink. Once your ink has been spread on the ground (or walls) you can turn into squid-form to submerge for stealth and swim through your ink. Your ink will cover up enemy ink as well as damage and kill your opponents, and vis a versa. Touching enemy ink greatly inhibits your movement, and it cannot be swam through.\n\nYour load-out (kit) consists of three parts, a Main weapon, a Sub weapon, and a Special weapon. Your Main and Sub weapons draw ink from a tank on your characters back, and ink is replenished by swimming through ink you have already spread. Special weapons have to be charged up by painting a certain amount before they can be used.\n\nThe main weapons consist of guns called 'shooters', sniper rifles called 'chargers', gatling guns called 'splatlings', dual wields called 'dualies', and inventive classes like umbrella-shield shot guns, buckets, brushes, swords, and (paint) rollers. Sub weapons consist of various grenades and bombs, as well as enemy marking tools, and beacons that you drop on the map which you and your teammates can jump to at any point during the match from anywhere on the map. Special weapons consist of outrageous missile strikes, vacuums that suck up enemy ink, drinks that buff you and your teammates movement stats and respawn time temporarily. . . And a tank. . . And Goku's Spirit Bomb.\n\nThen there's Gear. You dress your character with a head-piece, shirt, and shoes. The Gear you choose to wear has ability modifiers like buffing running or swimming speed, improving the rate you recover ink, saving on ink consumption for you Main and Sub weapons, or improve your respawn time. The more you wear of a certain ability the more effect there is, but there are diminishing returns. (And of course you can dress for style)\n\nThe quick-play mode is called 'Turf War'. It's a 3 minute bout where the objective is to paint the floor of the arena majority of your color before the round ends. Kills are irrelevant, but dead squids can't paint.\n\nThen there are the four objective-based competitive modes. Splat Zones, a king-of-the-hill style mode where you need to maintain majority control of a set, highlighted area on the arena to count down a timer; Rainmaker, which is like capture the flag except the flag is a powerful but movement inhibiting grenade launcher and has to be pushed into the enemy base instead of returned to your base; Tower Control, there is a mobile tower that starts in the center and moves slowly along a set path into enemy territory while a player rides on top of it vulnerable and exposed; and lastly Clam Blitz--an absolutely one-of-a-kind mode that's very unique to Splatoon--Clams spawn in groups of 3 around the map, collect 8 clams to build a 'Power Clam' which is capable of temporarily opening the enemy basket, once the basket is open you can throw in individual clams (or more Power Clams) to score points.\n\nThere's also a PvE horde/zombie mode called Salmon Run where you need to kill 'Boss Salmonids' which drop 'Golden Eggs' which you have to shuttle to a collection point.\n\nIt's a phenomenal game (franchise) which I've sunk thousands of hours into and I can't recommend it enough.",
        "created_utc": 1676018444,
        "upvote_ratio": 1.0
    }
]