[
    {
        "title": "My mother told me she was okay with God killing the unbelieving children mentioned in the Old Testament. How do I approach this?",
        "author": "MarieAntwatnette",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/41h8km/my_mother_told_me_she_was_okay_with_god_killing/",
        "text": "As many of you know, the God of the old testament loves killing people. And as a section of it mentions, God commanded some Isrealites to kill the unbelieving people of their rival tribe when they were at war, explicitly stating to kill the men, women and children. \n\nSome added context: We were having lunch together, my mother and I, and she mentioned an email her church friend sent her which stated God has done some terrible things in the bible and listed some examples. The email then says but that's okay because who are we to question or try to understand God's mysterious ways or reasons. She read this to me perhaps thinking I'd agree with her but I instead seemed horrified. I debated with her a bit, asking why she'd be okay with God doing this and it went nowhere of course. She stuck to her guns and flat out said if God wants to kill unbelieving children then that's his plan and we aren't to question it. \n\nI knew my mother is deeply religious but whenever there was some crazy shit said from her religion I trusted her to understand the difference and maybe not be so blind. But now I know for a fact her religion (Baptist) is making her into a sheep! One that's okay with killing children at that! \n\nI don't know how to deal with this. It deeply disturbs me and I don't know how to go from here with my atheism and her disturbingly blind faith. \n\nNot only that but for the first time I mentioned my atheism to her and she burts into tears, claiming Satan has a hold of me. I feel awful for making her this upset but on the other hand her religion is making her mind not sane.\n\nI apologize if this doesn't fit the community rules but the family that I live with are all believers and I have no one to talk to about this. \n\nr/trueatheism, what advice do you have for me?\n\n*EDIT: Guys, I really really reaaaally REALLY doubt my mom's planning on murdering children or me*",
        "created_utc": 1453090281,
        "upvote_ratio": ""
    },
    {
        "title": "MRW I meet a religitard",
        "author": "SuperiorAntitheist",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/41h7z9/mrw_i_meet_a_religitard/",
        "text": "[removed]",
        "created_utc": 1453090022,
        "upvote_ratio": ""
    },
    {
        "title": "Who are the most intelligent evangelicals or zealots that we know of?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/41g2vl/who_are_the_most_intelligent_evangelicals_or/",
        "text": "[removed]",
        "created_utc": 1453073302,
        "upvote_ratio": ""
    },
    {
        "title": "\"365 days closer to heaven\"",
        "author": "rmg22893",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/41fh4k/365_days_closer_to_heaven/",
        "text": "[removed]",
        "created_utc": 1453065323,
        "upvote_ratio": ""
    },
    {
        "title": "What are your views on liberal Christians and/or religious moderates?",
        "author": "Tunesmith29",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/41fae5/what_are_your_views_on_liberal_christians_andor/",
        "text": "Do you view liberal Christians as being a stepping stone toward atheism (or at least secularism) or as enablers of their more extreme brethren?\n\nI kind of go back on forth but tend to lean toward the former for Western Christians and Jews and the latter for moderate Muslims. To be clear, I don't think that is a virtue inherent to Judaism and Christianity but more about the pressure that Western secular society has put on them. Islam has not had that same pressure put on it.",
        "created_utc": 1453062874,
        "upvote_ratio": ""
    },
    {
        "title": "Are humans naturally monogamous beings or did early religion push toward that way of thinking? Or is a combination of both?",
        "author": "Roacher21",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/418j47/are_humans_naturally_monogamous_beings_or_did/",
        "text": "Not looking to ask a controversial question. Just curious because we've been learning about the Catholic meaning of marriage at the Catholic School I go to. Not that it matters too much but I'm an atheist myself so don't worry about converting me.",
        "created_utc": 1452953101,
        "upvote_ratio": ""
    },
    {
        "title": "Was I too harsh? [long]",
        "author": "somethingrather42",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4181lk/was_i_too_harsh_long/",
        "text": "Using a throwaway. Well reddit, I just had a debate with someone on the internet. Things got pretty heated, and after a long pause at the end, my opponent left. I'll post a link at the bottom.\n\nMy question is, was I too harsh? I got the feeling that I may have upset this guy. I don't ever wanna hurt someone's feelings going into a debate. Also, as a side question, did I make any factual errors? I'm pretty confident with 95% of what was said, but you never know. \n\n[LINK](http://logs.omegle.com/508a702)\n\nIt's kind of long. Feel free to skip the part about aliens; it doesn't really go anywhere. ",
        "created_utc": 1452944360,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to understand my parents' theism.",
        "author": "Pinkie056",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/416uyu/trying_to_understand_my_parents_theism/",
        "text": "They claim that everyday things (my sister being born, my survival (I was at risk for lots of health problems), etc.) are miracles, but I don't understand this line of thinking. It has an explanation, why does it need god?\n\nMy step-dad has also said that his experiences with life and \"looking at things\" convince him that there is a god. But that doesn't really seem to mean anything to me other than \"I believe in god\".\n\nMy problem with understanding them is that it seems silly to me. I've never once seen something in my life that could not be explained. If there is a natural explanation, then there need not be a god (unless said god created the universe to operate on natural laws. However, in such a case, he would not be doing himself any favors concerning believers.) \n\nMy mother then says that faith doesn't require evidence, but if there is no evidence then why should I believe something? \"Because it's true\" is probably what she would say, without any further justification.\n\nThen they tell me that when I talk to them, they just hear me repeating things I've read on the internet (that is their favorite dismissal).\n\nI asked my mother at one point what she thought of the billions of people who are as sure in their beliefs as she is in hers. She said that \"they are deceived by the devil\", but I pointed out that there is exactly as much evidence (none) to support them. She ignored that part.\n\nI guess I'm looking for you guys' thoughts to help me make sense of things and to give me some outside perspective that I can't get on my own.",
        "created_utc": 1452918872,
        "upvote_ratio": ""
    },
    {
        "title": "Are humans naturally monogamous or did early religions push such a way of thinking? Or is it a combination of both?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/416tm4/are_humans_naturally_monogamous_or_did_early/",
        "text": "[removed]",
        "created_utc": 1452918174,
        "upvote_ratio": ""
    },
    {
        "title": "From the Westboro FAQ - Is their response to \"But that was the Old Testament\" as bullshit as it seems?",
        "author": "TheFriffin",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/414d8i/from_the_westboro_faq_is_their_response_to_but/",
        "text": "Is there actually a clear distinction between \"Moral\" and \"Ceremonial\" Laws in the Old Testament? This is one explanation of \"but that was the old testament\" I don't think I've ever seen addressed.\n\n\n&gt;The Mosaic Code consists of two types of laws: moral and ceremonial. (Analogous to modern law's mala in se and mala prohibita, respectively). Moral laws are included in the Mosaic Code because they are in and of themselves wrong (e.g., murder, adultery, human sacrifice, sodomy, etc.). Ceremonial laws are included in the Mosaic Code because they were shadows of things to come. They were ceremonies that represented something (e.g., not eating certain types of animals, not wearing clothing of mixed fibers, etc.). These ceremonial laws foreshadowed Christ, and certain other eternal concepts. These ceremonial laws were done away with when Christ came. See Colossians 2:13-23. The moral laws, however, always have been and always will be in effect. We are supposed to follow the moral laws.\n\n&gt;The context of the verses in the Mosaic Code that forbid sodomy is important. Leviticus 18:22 says \"Thou shalt not lie with mankind, as with womankind: it is abomination.\" This verse is part of a list of abominations that were done in Egypt and other nations, for which the Lord spued the people out. In other words, He punished other nations for these abominations. This means that these abominable acts were not only forbidden to the ancient Jews, but to ALL nations (whereas the ceremonial laws in the Mosaic Code only applied to people in the Jewish nation). Any nation that engages in these abominations will be destroyed. To paraphrase the context of Leviticus 18:22 - don't have sex with a menstruating woman, don't commit adultery, don't sacrifice your children, don't commit sodomy, don't commit bestiality. The question is: why are all of these things still abominable, except sodomy? Why is sodomy suddenly OK? If you claim to believe the Bible, and you're at all logical, it makes no sense to say that sodomy is OK.\n\n&gt;Leviticus 20:13 says \"If a man also lie with mankind, as he lieth with a woman, both of them have committed an abomination: they shall surely be put to death; their blood shall be upon them.\" What's the context of this verse? To paraphrase - don't commit adultery, don't have sex with your step mother, don't have sex with your daughter in law, don't have sex with other men, don't have sex with your mother in law, don't have sex with animals. Once again, all of these verses condemn things that are morally wrong, as opposed to ceremonially wrong. It makes no sense to suggest that all of these are still wrong - except sodomy.\n\n&gt;Finally, people ask this question to try to prove a point. And the point is \"the Mosaic Code contains lots of stuff that we don't follow anymore - why should we still follow the verse that forbids sodomy?\" For example, \"if it's OK to eat pork, why isn't it OK to commit sodomy?\" I believe I've answered this above, but I'd like to point out that the above statement makes about as much sense as \"if it's OK to eat pork, why isn't it OK to murder?\"",
        "created_utc": 1452882765,
        "upvote_ratio": ""
    },
    {
        "title": "I'm breaking away from Christianity. I needed to vent a little so i just spilled my thoughts in the text box. Can't talk to anyone else about this.",
        "author": "usernameiswaytoolon",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4108nv/im_breaking_away_from_christianity_i_needed_to/",
        "text": "All my life I've been taught that the bible is true, and now I'm starting to realize that a lot of things just don't make sense. Such as how the bible teaches its wrong to have sex before marriage, or that its wrong to be gay, but no matter how hard i try, i can't see how either one of those things are actually wrong. My main reason for questioning Christianity is the completely outrageous things that happen in the bible. Like, Jesus rising from the dead, Jesus being just a man but also god at the same time, a talking snake, Jesus walking on water, and on and on and on. (If ANYONE today said that a snake talked to them, or that they were sent to earth by God, 99% of people would automatically think they're crazy. But, people believe crazy shit JUST because its in the bible? Okay then) That all seems like complete craziness, right? Just physically impossible. I try to explain that to my father, but he says \"anything is possible with god, he's god\". Yeah, okay there buddy. Good proof. I notice that most Christians COMPLETELY ignore tons of Scientific studies that claim things which easily disprove the bible. SO many people who say they believe in god just BLINDLY follow and believe anything they're told without asking any questions whatsoever and they don't want anyone to even start to question what they believe. And then so many self righteous assholes have the nerve to call non Believers \"Sheep\". Its fucking annoying. The other day, i found a video on youtube where some guy claimed that all Science if faked, and that gay people are brainwashed into being gay...\n\nAlso i noticed that atheists are generally more intelligent than theists. I think that says something. I was talking to my friend about a week ago and i asked him how he knows god is actually real. He said something along the lines of \"Because i pray to him and he answers\". I asked him exactly how the fuck that is so. He tells me that he prays that god will protect him from getting murdered, and he doesn't get murdered, so it must be God. I tried to explain to him how unlikely it is for him to just be randomly murdered one day ANYWAY, and that praying DOES NOT change the likelihood of it happening. He still insists that he hasn't been murdered because he prays about it. I felt like saying \"I can come to your house RIGHT NOW and kill you, what would you say then?\", but i didn't wanna creep him out, lol. That's just one example of how Christians tend to be completely fucking retarded fucks with NO LOGIC. Oh, and on Facebook, there are always these spam accounts who post pictures like [this](http://www.slate.com/content/dam/slate/articles/technology/future_tense/2013/10/131030_FT_Christ.png.CROP.promo-mediumlarge.png.). Over 100k likes. Holy shit. I've seen countless people i know like/share/comment on these posts, and it honestly just pisses me off. How could you possibly believe that shit? The people who run those accounts are making money from those likes/comments/shares. People are just so fucking retarded sometimes. anyway, I've been looking into evolution and why people are Atheists and i see how much more reasonable things are on the other side. Theists just don't want to look at the other side of things. I'm no psychologist or anything, but i feel like a reason for people blindly believing is that they want to have a sense of hope in their lives, and they use religion as a coping mechanism. I could be wrong, but i feel like that makes pretty good sense. Today was the first time i really strongly felt disconnected from religion. Multiple times i thought to myself \"What if god is real, and the reason i don't believe is because i'm just not chosen. Then, i'll die and end up burning forever and ever and i can't change it\". That really scared the shit out of me. But i still understand why i'm finally finding religion ridiculous, and i was probably just being paranoid. So, to wrap things up, if any of you could leave some links to some articles or videos about Atheism and Evolution, that would be great. I genuinely want to learn about the universe and how things REALLY are. What i love about science is that a most of the time you don't have to blindly accept things, you can find your own proof, so there's never any questioning once you actually put in the effort and do your research. Also, i have a really big interest in the beginning of the universe and how everything actually got here. Like, what caused the big bang? Are there any other universes out there? So, if you guys know of any interesting articles, books, videos, about that subject specifically, would you mind linking them? For those who actually took the time to read this, Thanks! Sorry if my grammar is shitty throughout this, i wasn't really paying any attention to how i was writing. Just needed to vent.\n\nEdit : Hey, thanks for the comments everyone! I appreciate all the advice!",
        "created_utc": 1452813589,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Good Debates for Uni Club",
        "author": "bjlmag",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40yd2p/looking_for_good_debates_for_uni_club/",
        "text": "I'm trying to rekindle my school's SSA club and/or start a debate club. I'm thinking of hosting a viewing of a good debate in my Union building and I'm looking for a solid debate on a religious topic that is interesting and not overly one-sided. I've seen a few debates where certain people (William Lane Craig) just use the same arguments over and over and they aren't very good for a post-viewing discussion. I'm looking for something where the arguments from both sides are interesting even if we don't agree so that the people that come to the event can have a good discussion following and hopefully come to another. My school also has large Christian and Muslim populations, so either  subject would be fine as long as the dialogue is fair and civil. Any particular videos come to mind? Thanks for the help. ",
        "created_utc": 1452789747,
        "upvote_ratio": ""
    },
    {
        "title": "What would evidence of Intelligent Design look like?",
        "author": "Kozmik",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40xgcq/what_would_evidence_of_intelligent_design_look/",
        "text": "A family member is a strong Evangelical who is trying to assert that science supports intelligent design. He sent me a video from Prager University. I almost threw my monitor across the room when I read in the description how science \"says that the chance life exists at all **is less than zero**\"\n\nSo this got me thinking. What would actual evidence of intelligent design look like? I find it unsatisfying to assert that because life is really really unlikely then a designer must be at work. That's not positive confirmation of an intelligent design, that's just making an assumption. I want to tell him that nothing in science supports intelligent design, but conceptually here is what we would look for if we were looking for positive confirmation.\n\nHere's that batshit video:  \n\nhttps://www.prageru.com/courses/religionphilosophy/does-science-argue-or-against-god",
        "created_utc": 1452776254,
        "upvote_ratio": ""
    },
    {
        "title": "Question. Philosophy professors says there is 100% evidence of god but not an intelligent god (prime mover).",
        "author": "Johnny_Horsecock",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40vj6p/question_philosophy_professors_says_there_is_100/",
        "text": "Bear with me. In class the other day my professor and I essentially debated the existence of god. I stated that the burden of proof lands on him, he needs to prove that a god or as he puts it, prime mover, exists. He said easy, it took energy to create the big bang that did not previously exist, that that had to come from somewhere which means a god (prime mover) exists, according to the laws of physics. I'm absolutely butchering this conversation but I don't remember it that clearly, just that it didn't seem right. FYI he has a degree in chemistry and philosophy from an Ivy League school so he isn't some dunce. ",
        "created_utc": 1452738431,
        "upvote_ratio": ""
    },
    {
        "title": "Not only does my uncle have brain cancer, he also is going to Hell.",
        "author": "VaccusMonastica",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40t210/not_only_does_my_uncle_have_brain_cancer_he_also/",
        "text": "I work in the Bible Belt and I was raised in religion, but broke away at 33. I am 42 now. \n\nAnyway, the place I work is full of religious people. I never bring up atheism here or anything. I just think work is not the time nor place.\n\nThe president of HR is a great woman. I like her and we've become friends over my time here sharing all kinds of things about the struggles we each go through. I am certain she believes that I am a Christian because, well, everyone's a Christian right?\n\nLast week we got the distressing news that my uncle, a second father to me while growing up, had a glioblastoma, brain cancer, and 6 months to live.\n\nI have sickly parents too in their 70s and 80s and this was just one more thing, you know. \n\nI am talking to her about it and she asks if my uncle is saved. No, he's not. My uncle has been an atheist since I've been born. A smart, smart guy secure in logic and critical thinking. I think a little of that rubbed off on me.\n\nShe wanted me to get a preacher or clergy to go in and talk to him. He is in a very precarious spot. Not only will he die of brain cancer, but he will go to hell too. \n\nI am past getting angry at this mentality. It saddens me more than anything now. I know she is trying to be helpful, but really, when you think about it's the most unfeeling, cold, unloving thing to say to family of the dying individual or to the individual himself.\n\nI pay her little attention and just nod or change the subject.\n\nIt would do little for me to try and explain how infinite punishment for a finite time is totally insane, illogical, and done only for vengeance. Hell does not rehabilitate you. It serves only to torture you forever.\n\nAgain, it matters not to her that my uncle is the most moral and upstanding guy I've ever known. It matters not that he had a rough life with a step-father, but overcame all that baggage. He's a good guy full of caring for everyone and love for everyone. As he lay there with his speech reduced to just strings of words, those few sentences that got through were only to ask how others were doing and what he had to do for them when he got better. He's not hurt anyone in his life and has always sought to do the most good, so of course this man is deserving of Hell. \n\nHe is doing well now, better. He can talk and make sense. He seems to be taking the news with nonchalance a \"If this is how it's suppose to be, then so be it.\" kind of attitude. \n\nI told her I was going to see him today and again she reminded me that now he is coherent he needs to think about the health of his soul. \n\nAgain, this just makes me sad for her that she thinks this is helpful, but it's almost crossing the line of being cruel. ",
        "created_utc": 1452706333,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else see The Revenant and think it was an argument for theism?",
        "author": "ethernetcord",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40sgfo/anyone_else_see_the_revenant_and_think_it_was_an/",
        "text": "Pretty big spoilers if you haven't seen the film yet:\n\nGlass had absolutely no reason to continue living, I kept putting myself in his shoes and had the feeling that I would have just let myself die with no wife or son to go home too, specifically when laying with the dead frozen son, I would have just chose to die there. But oddly enough his visions of an afterlife are what kept him going (which seems completely counterintuitive, but for some reason putting myself in his shoes it worked). Then the scene and visions in the collapsed church seemed to really give me the feeling of lifes pointlessness with a strong desire to just give up if there was no afterlife (Also counterintuitive, but I felt this as I watched the film), AG Inarritu is a gifted filmmaker, these are feelings I have never really had as an atheist.\n\nThe scene that I really hated was Fitzgerald talking about how his dad thought a squirrel was God so he killed the squirrel and ate it, to me strongly suggesting the \"bad guy = god hating atheist\", idea which annoyed me.\n\nThen of course the last part of the movie is completely up to interpretation and I don't currently have a good one. He didn't take his revenge because \"revenge is in God's hands\". And then him crying at the end as he sees the vision of his wife walking away from him, did he lose her forever for acting so vindictively or were those tears of joy? Where is the son? etc.\n\nThose who have seen it, did you get these same feelings that I did, a very pro-theistic film?",
        "created_utc": 1452698553,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists Dismiss The Lore Of A 1000 Cultures And Would Do The Same If They Were Ever Let Loose On Beings Of Other Worlds",
        "author": "WhiteHarem",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40rmh9/atheists_dismiss_the_lore_of_a_1000_cultures_and/",
        "text": "[removed]",
        "created_utc": 1452684139,
        "upvote_ratio": ""
    },
    {
        "title": "Just want to rant.",
        "author": "Orgosynthesis",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40p18b/just_want_to_rant/",
        "text": "[removed]",
        "created_utc": 1452640454,
        "upvote_ratio": ""
    },
    {
        "title": "I'm starting to realize that I was gaslighted and emotionally bullied into belief by a campus ministry group. Disgusted with myself.",
        "author": "throwaway197t",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40n6a0/im_starting_to_realize_that_i_was_gaslighted_and/",
        "text": "I have been a Christian for roughly two and a half months. It's a really long story, but to keep things brief, I started attending a campus ministry group out of curiosity, (stupidly) told them that I was an atheist, and (stupidly) thought that they wouldn't do what they subsequently did. \n\nThe thing is, a few coincidences had happened that sort of made me interested in going, but after I started attending, really crazy, highly improbable/seemingly impossible stuff started to happen to me; Nothing that defied the laws of physics or anything, but just really crazy stuff that seemingly pointed me towards them, and towards Christ. It was enough for me. I'm sure that seems stupid to most here but my only explanation is that it's different when it's a personal experience\n\nAlso, if I'm being completely honest, I was pretty lonely and insecure. At this point, I'm pretty sure they recognized this more than I did and exploited it. \n\nI was vaguely aware of some of the above throughout the semester, but not aware enough. Over the break some things have come to light that essentially prove they've been lying to me about their lack of involvement in my 'experiences'. Furthermore, as I continue to reflect, I'm just starting to recognize all of the ways they used, emotionally abused, and manipulated me towards Christ.  \n\nI'm disgusted with myself. I didn't see any of this, and worst of all, I was complicit. I feel like I deserve it because I didn't see it, see them, for what they were. \n\nYou're probably thinking \"Well just leave!\". The thing is, I'm worried what they will do. If they are willing to do the above, what are they willing to do when I try to leave? I haven't been all that secretive. They know where I live, where I go to school, etc. They probably know who my family are. They have the power to make my life pretty bad, at least for awhile. I'm really afraid of what they will do.\n\nSpecifically, I'm afraid that they will contact/harass me/my family. Harass me on campus, provoke me, talk to my professors, etc. I'm also afraid they will publicly shame me. ",
        "created_utc": 1452617239,
        "upvote_ratio": ""
    },
    {
        "title": "Reminder: Chris Shelton Will Be Doing an AMA in /r/Scientology Tonight, Beginning at 8 PM EST.",
        "author": "ellaraitch",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40jfbo/reminder_chris_shelton_will_be_doing_an_ama_in/",
        "text": "AMA Thread is now live! https://www.reddit.com/r/scientology/comments/40ju0x/i_am_chris_shelton_a_scientology_for_27_years_now/\n\n---\n\nPlease join us [tonight, at 8 PM EST](http://www.timeanddate.com/worldclock/fixedtime.html?iso=20160112T01&amp;amp;p1=%3A&amp;amp;ah=4), in /r/Scientology, for an AMA with one of Scientology's most knowledgeable and insightful critics. This post will be updated with a direct link to the AMA thread as soon as it goes live.\n\nIn his newly published first book, [Scientology: A to Xenu: An Insider’s Guide to What Scientology is All About](http://www.amazon.com/Scientology-Xenu-Insiders-Guide-About/dp/1522879323/), Chris Shelton gives an insider account of the secretive and controversial Church of Scientology, drawn from his 27 year career in the Church. After joining as a teenager, Shelton rose through the ranks of Scientology’s paramilitary monastic order, the Sea Org, to eventually oversee the delivery of L. Ron Hubbard’s “technology” for the entire Western region of the United States.\n\nSince leaving in 2013, Shelton has become an incisive critic of the Church of Scientology and high demand religious groups, and a forceful advocate for the virtue of Critical Thinking. His video logs and podcasts can be found at his website [Chris Shelton – Critical Thinker at Large](http://mncriticalthinking.com) and on his [YouTube channel](https://www.youtube.com/channel/UCF326xyA0QHI7Z5xAwKQDJg).",
        "created_utc": 1452553018,
        "upvote_ratio": ""
    },
    {
        "title": "What good did religion do ?",
        "author": "Maistry",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40iyz0/what_good_did_religion_do/",
        "text": "[removed]",
        "created_utc": 1452547386,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone give me proof of God not existing because I'm an Agnostic",
        "author": "Maistry",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40iucp/can_someone_give_me_proof_of_god_not_existing/",
        "text": "So I want to make a choice about religion and God, I need help making such a big decision  about faith and stuff, I mostly believe that God may not exist but need help.My crazy family believes Jesus can heal my abusive narcissistic alcoholic father  so they gave him another chance, its my final straw.I need the evidence \"God\" is either imaginary and used to f*** the masses or weather it exists.My thoughts points to atheism but I'm not sure.thanks.",
        "created_utc": 1452545813,
        "upvote_ratio": ""
    },
    {
        "title": "Harmless poll - with discussion and clarifications",
        "author": "QuakePhil",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/40i1xp/harmless_poll_with_discussion_and_clarifications/",
        "text": "I've recently made the rounds with [this poll](http://strawpoll.me/6509690) on /r/atheism and /r/agnostic\n\n(One point of clarification, the poll's \"Probably not\" is meant to be synonymous with \"I believe God probably does not exist\")\n\nPersonally, I believe if you are an agnostic atheist, you are *still an atheist*.  Similarly, I believe the only way to really be a theist, is to answer an unconditional yes to the question \"Do you believe God exists?\"\n\nDo you guys think that every other answer to that question (such as \"no\", \"maybe\", \"don't know\", etc) means the person is an atheist (including agnostic atheist, etc) or is there an \"agnostic\" position that is a middle ground on the question of belief, that is, a middle ground between atheism and theism?\n\n(Full disclosure: I don't believe agnosticism to be such a middle ground; rather I think agnosticism has much more to do with questions such as \"Do you know God exists?\" or perhaps \"Is it possible to know if God exists?\" rather than with the poll's question \"Do you believe God exists?\" and I'm interested as to how I could be mistaken here)",
        "created_utc": 1452536472,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else not afraid of losing consciousness forever? (But afraid of external obstacles to living?)",
        "author": "Aoea",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/408mf0/anyone_else_not_afraid_of_losing_consciousness/",
        "text": "So, I'm not a Westerner (I'm an international student in US, from Ukraine, which has always been fairly irreligious in a natural kind of way), and since [my previous post here](https://www.reddit.com/r/TrueAtheism/comments/3v17qa/hi_a_nonwesterner_here_a_cultural_question_arent/) I've really got interested in the Western perception of death and existence and fears pertaining to them.\n\nSo here is my external view on how Christianity - and even if you get over it you still retain the subconscious intuitions - perverts understanding of death. I'm interested in whether you - presumably all Westerners - find this anthropological/cultural/psychological assessment right and helpful.\n\nAs I see it, a person has two default expectations - zero consciousness=existence and zero external obstacles to life/health. So that, pertaining to the first thing, dying is just resetting to default, which is still not too bad and everything more is even better (better unless it's painful suffering etc). And pertaining to the second, any sort of infection, accident, trauma, is strictly below expectation and is very very scary. But intrinsic variation in livelihood be it from heart attack or cancer is still all above or equal to zero and not scary in any case (but the more health obviously the better). This is sort of my default intuition and also the one native peoples all over the world have, and also the one agreeing with evolutionary psychology.\n\nBut it definitely doesn't agree with Western mentality, as I've noticed. So I have two questions to you guys:\n\n1) Does the above make sense? (I may be a bad writer, sorry if it's the case - English is my 3rd language.)\n\n2) In case if it does, and you were afraid of death as such, does it help?\n\n3) In case if it does but your intuitions are not like that, do you agree with the following hypothesis of mine why: \n\nIn Christianity, you is your soul, a sort of shiny singularity, a passenger trapped in your body as in a plane about to crash - and this crash will kill the soul (or God will save it, if you believe in God). Even if you *became* an atheist, if you're a Westerner you still retain all basic moral/cultural/worldview intuitions of Christianity, this one included. And thus, in this view, death/dying is an event like plane crash that is itself an obstacle to the livelihood of your \"soul\" - and so very scary - as opposed to being the process of vanishing to zero of the soul itself, which is what it really is (and which is just losing consciousness completely without regaining it later).\n\nWhat do you guys think? It would be very interesting to hear any thoughts, because when I study any cultural/anthropological/moral/worldview comparisons etc, the Western one is always taken for default, but for me it's the Western one that is weird :)",
        "created_utc": 1452381142,
        "upvote_ratio": ""
    },
    {
        "title": "What do you guys think about the statement \"The existence of a higher power necessarily precludes the possibility of free will\"?",
        "author": "znh1992",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4047v8/what_do_you_guys_think_about_the_statement_the/",
        "text": "To me, it seems that if a God (omniscient, omnipotent, omnipresent) does exist, there cannot also exist a free will. \n\nLet us say God is real, God knows what going to happen to you before it does (omniscience). God has the power to change it, but you do not. So if you cannot change the predetermined path, do you really have free will?\n\nI could see a rebuttal about something like God existing outside of time, so for some reason our linear understanding of time means we can't truly understand how they coexist. But I can't even bull shit something that makes sort of sense. ",
        "created_utc": 1452303378,
        "upvote_ratio": ""
    },
    {
        "title": "An Olive Branch to Atheists",
        "author": "SpiritUnifier",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/403vap/an_olive_branch_to_atheists/",
        "text": "[removed]",
        "created_utc": 1452297946,
        "upvote_ratio": ""
    },
    {
        "title": "Interest in Religion",
        "author": "Pinkie056",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/402upl/interest_in_religion/",
        "text": "Let me be the first to say that I am a staunch atheist (as well as a former Christian), but I find religion to be a fascinating subject. I love studying world religions and their effects on history and their followers.\n\nI suppose it's similar to, or an extension of, a lifelong love for mythology. I guess it's easy to be angry about the destructive/oppressive influence religion has on parts of the modern world, and I'm just as bothered by it as most of you would be, but I can't help but love reading the mythology.\n\nFeel free to post your thoughts here if you want. I'd love to hear them.",
        "created_utc": 1452284225,
        "upvote_ratio": ""
    },
    {
        "title": "Lawrence Krauss made a point that interests me.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/402dqs/lawrence_krauss_made_a_point_that_interests_me/",
        "text": "[deleted]",
        "created_utc": 1452278233,
        "upvote_ratio": ""
    },
    {
        "title": "Just wondering if anyone to talk to me about my situation",
        "author": "Leaguefizzics",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zyf6j/just_wondering_if_anyone_to_talk_to_me_about_my/",
        "text": "[removed]",
        "created_utc": 1452212305,
        "upvote_ratio": ""
    },
    {
        "title": "What arguments do you hear your fellow atheists make that you wish would be retired?",
        "author": "Mr_Subtlety",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zxbjk/what_arguments_do_you_hear_your_fellow_atheists/",
        "text": "I, for one, always wince when I hear atheists try and argue against religion via the morality of God's actions (killing children who make fun of a bald guy in Kings: 2:23, for example). This might be a compelling argument for people who haven't much thought about their faith, but a educated apologetic will tear this argument to pieces every time. Getting into this kind of philosophical debate just puts the whole discussion back in their comfort zone, where you can pick your own assumptions and argue endlessly and without any facts. Moreover, it feeds into the pernicious myth that atheists are \"angry with God\" because it suggests that the problem with religion is with God, not with the factual basis of the whole claim. It's simply a weak argument, and I wish people would stop making it.\n\nWhat other arguments do you hear out there that you wish people would stop using?",
        "created_utc": 1452198330,
        "upvote_ratio": ""
    },
    {
        "title": "Does anybody dislike and sort of resent the term \"atheism\"?",
        "author": "TormundGianstbane",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zwo8n/does_anybody_dislike_and_sort_of_resent_the_term/",
        "text": "So for a bit of context, I was raised in a \"culturally Jewish\" home, and though my father considers himself a Jew, he doesn't believe there's a God, and thinks the Old Testament is a horrifying, evil document. My mother, whose father left Ireland in the wake of the sectarian violence, has always resented religion, but never expressed her opinions to until I approached her with my own as a teenager.\n\nI sort of came to the \"New Atheism\" way of thinking of my own accord, but quickly outgrew the main writings. Dawkins wrote far better about Science, Hitchens wrote far better about Politics and History, Harris and Dennett both wrote far better on Philosophy. The God Delusion, for example, I could see why it was attractive to my sixteen-year-old self, but I don't much care for it now (though I can't recommend Dawkins' other writings to highly - he really is a beatuful writer).\n\nAnyways, I've long thought describing one's self in terms of things I don't believe in to be strange and I don't really like how many atheists have been lumped together in the group like this. Knowing that someone is an \"atheist\" is knowing pretty much *nothing* about them - it's pretty much devoid of content. I've long compared it to Astrology - there is no word for someone who doesn't believe in Astrology, for example, nor should there be. \n\nHowever this claim seems rather fatuous and condescending to many of my religious friends, so the debate never went very far. But I'd like to refer you, if you haven't seen it, to [this](https://www.youtube.com/watch?v=ODz7kRS2XPs) great speech from Sam Harris, who realizes this same thing, where he draws an excellent comparison that I wish I thought of:\n\n&gt; If the comparison with astrology seems too facile, consider the problem of racism. Racism was about as intractable a social problem as we have ever had in this country....  we can now ask, how have people of good will and common sense gone about combating racism? There was a civil rights movement, of course. The KKK was gradually battered to the fringes of society. There have been important and, I think, irrevocable changes in the way we talk about race—our major newspapers no longer publish flagrantly racist articles and editorials as they did less than a century ago—but, ask yourself, how many people have had to identify themselves as “non-racists” to participate in this process? Is there a “non-racist alliance” somewhere for me to join?\n\nI'm curious as to what your thoughts are on both the word \"atheism\" itself, and this analogy.",
        "created_utc": 1452190253,
        "upvote_ratio": ""
    },
    {
        "title": "Chris Shelton Devoted 27 Years to Scientology. Now He’s One of the Church’s Fiercest Critics, as Well as an Author and Vlogger. He Will Be Doing an AMA in /r/Scientology Next Monday, at 8 PM EST.",
        "author": "ellaraitch",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zso2i/chris_shelton_devoted_27_years_to_scientology_now/",
        "text": "[Monday, January 11, 8 PM - 12 AM EST](http://www.timeanddate.com/worldclock/fixedtime.html?iso=20160112T01&amp;p1=%3A&amp;ah=4) at /r/Scientology\n\nIn his newly published first book, [Scientology: A to Xenu: An Insider’s Guide to What Scientology is All About](http://www.amazon.com/Scientology-Xenu-Insiders-Guide-About/dp/1522879323/), Chris Shelton gives an insider account of the secretive and controversial Church of Scientology, drawn from his 27 year career in the Church. After joining as a teenager, Shelton rose through the ranks of Scientology’s paramilitary monastic order, the Sea Org, to eventually oversee the delivery of L. Ron Hubbard’s “technology” for the entire Western region of the United States.\n\nSince leaving in 2013, Shelton has become an incisive critic of the Church of Scientology and high demand religious groups, and a forceful advocate for the virtue of Critical Thinking. His video logs and podcasts can be found at his website [Chris Shelton – Critical Thinker at Large](http://mncriticalthinking.com) and on his [YouTube channel](https://www.youtube.com/channel/UCF326xyA0QHI7Z5xAwKQDJg).\n\nPlease join us at /r/Scientology this [Monday at 8 PM EST](http://www.timeanddate.com/worldclock/fixedtime.html?iso=20160112T01&amp;p1=%3A&amp;ah=4) for what promises to be an important and informative AMA.",
        "created_utc": 1452124843,
        "upvote_ratio": ""
    },
    {
        "title": "Could a case be made that modern Christianity is polytheistic?",
        "author": "TucaTuca",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zryq7/could_a_case_be_made_that_modern_christianity_is/",
        "text": "[removed]",
        "created_utc": 1452116020,
        "upvote_ratio": ""
    },
    {
        "title": "Why not treat religiousness like a sexual kink or sexual preference?",
        "author": "troyaner",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zqu4r/why_not_treat_religiousness_like_a_sexual_kink_or/",
        "text": "I was remembering the movie [Pride](http://imdb.com/title/tt3169706) as the simple idea caught me:  *\"I am being discriminated against, you are being oppressed by the same people - let's join forces.\"*\n\nAtheism used to be (and is) oppressed and defamed by the same people as the e.g. LGBT community or BDSM. So think, \"you are into trinity, I'm into chance and physics laws\", same way as \"I'm into toy play, you are into threesomes\". \n\nThe principle is the same: you do whatever you want with whoever is comfortable with it and let others enjoy their stuff. \nIf there are people seeking comfort in religion and community, who am I to prevent them from this comfort. If I cannot believe into a theistic world, you don't need to explain how great it feels.\n\nBasically you should be as comfortable to show your sex toys/kinks in public as discussing your religion in public. I'd like to know more about e.g. Judaism from the literature point of view, but not if it's \"showed down my throat\" as [/u/OctagonalHumanist](https://www.reddit.com/user/OctagonalHumanist) has put it.\n\nEDIT:\n\nI'd like to add a differentiation I apply myself: There is **belief**, **religion** and **church**(institution).\nThey are completely different, very often related but in their selves independent things.\n\nI think respectfully of the first, mildly interested in the second and despise the third. Many people don't make this distinction and lot's of butthurt is originating from it.",
        "created_utc": 1452101832,
        "upvote_ratio": ""
    },
    {
        "title": "So I can't discern morality anymore, huh?",
        "author": "Kazakuf",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zoxvv/so_i_cant_discern_morality_anymore_huh/",
        "text": "Background: I'm a pretty solid atheist raised in a very Methodist family. (Preachers kid what what?) While my parents are still very practicing Christians they accept that I can make my own choices and they love me regardless. I'm definitely very \"blessed.\"\n\nSo I broke up with my very Catholic girlfriend the other day mainly due to our incompatibility regarding religion. I was Christian when we started dating, and deconverted halfway through. My mom was upset about it because they got along really well and what not. Come to find out today, my mom's upset for a couple more reasons. 1.) She was kind of hoping that I would convert back due to my Christian girlfriend. And 2.) she's afraid that now I'm dating again as an atheist I'm going to bring home some \"tatted up, alcoholic loser.\" \n\nI just kind of had to laugh but I was really taken aback. I know my mom didn't mean anything by it but it's interesting that Christians in general (even the fairly liberal and loving Christian like my mom) view non-Christians as degenerates. It's like my mom forgets that I'm still the good man she raised and I won't bring home a criminal because I don't believe in God anymore, (can't promise the no tattoos though, those things are sexy). \n\nWhat do you guys think? Do people treat you different or have lower expectations after you've come out as a non-theist?",
        "created_utc": 1452068809,
        "upvote_ratio": ""
    },
    {
        "title": "Classmate in med-school who do not believe in evolution and is against abortion",
        "author": "not_sure_aboutstuff",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zn4er/classmate_in_medschool_who_do_not_believe_in/",
        "text": "I am studying medicine in a Scandinavian country. As most people know who hang out in this reddit is that the population as a whole isn’t especially religious. I personally didn’t know about Jesus’s 'existence' until 2nd grade in elementary school because my family is atheist. I don't talk about religion a lot because in my country talking about individual's beliefs is a bit of a taboo and is considered by many to be a very personal intimate topic, thus my inexperience in these topics. \n\nWe have studied reproduction and parts of embryogenesis, and I recently engaged in a conversation with a classmate and friend of mine who is practicing Protestantism e.g. going to church every week and active in a lot of church/religious activities. \n\nMy classmate has controversial opinions regarding abortion and evolution, relative to the general population. \n\n* My friend believes that all the species except for humans has gone through evolution. \n\n* My friend is okay with condoms and birth control pills, but not morning-after pill and abortions. \n\nMy friend is a kind and smart guy. Like all med-students, my friend has good grades and I am confident that my friend knows the basics of evolution theory and the social benefits of abortions, because we are taught that in elementary and high school. \n\nThis is the first time in my life I have known someone who explicitly said that they do not believe in evolution (at least for humans) and I am wondering how I should handle it, because I have never had to argue for the ’proof’ that humans has evolved from other species. Until now I have let it slide and joked around with my friend about this, but I feel like I might have to confront my friend someday. \n\nThe other subject is abortion which my friend is against and compared it to incest (I have no strong opinions regarding incest but I know that my friend finds it disgusting) and that he/she thinks that the general population share his/her opinion on the abortion issue, which is not true. There was a huge public backlash when some people suggested shorten the *18 weeks free-no-question-asked-abortion period*. Both of us are know the basics behind everything e.g. how likely/unlikely it actually is that a morning-after pill ’kills life’. My friend has not expressed her opinion whether he/she is against ’preforming' an abortion. \n\nWe are constantly being taught how we should treat our patients based on research and science but to me these two controversial opinions goes against that dogma, and I as a friend I am afraid sounding like an irritating preacher of my atheism if I chose to confront and in the process losing a friend. But I feel like it is necessary because of my friend's opinions in combination with her future role as a physician who will have to ’preform’ abortions because its a part of the job ~~(can’t escape it legally as it is a part of your duty)~~ (*clarification:* will get fired by her employer). \n\nI would be happy for any insights from people regarding this matter as I wish to understand my friend's point of view better, because I think that understanding his/her opinions is the first step. I am also wondering how I should approach these matters. \n\nSorry for my bad English. It was at least enough for a good English grade in high school. \n\n**tl;dr:** See title. I am atheist. Friend will probably have to preform abortions. We are taught in med-school that we treat patients according to science and research, which goes against my friend’s view on evolution. How does my friend think and what should I do?\n\n*EDIT:* formatting, spelling stuff and more info\n\n*EDIT2:* Maybe people don't quite understand but where I live most people don't chose which physician you go to, just like how physician don't chose which patients they get. Almost everything is payed using tax money so the doctors have a responsibility to treat/not harming patients each time an appointment is made, and not waste precious tax money on 'no I cannot take care of this patient after meeting him/her once' because then the doctor will lose his/her job as the hospital will get in trouble if it uses tax money carelessly. There is also little tolerance in the society for public workers, nursers, doctors who are not able to do their job due to such beliefs regarding abortion. And my friend wants to become a gynecologist, and if he becomes one there is no avoiding abortion. One day it will come, don't know when but it most likely will. ",
        "created_utc": 1452039984,
        "upvote_ratio": ""
    },
    {
        "title": "[x-post r/exmuslim] Only in Islam would this make sense",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zlc6d/xpost_rexmuslim_only_in_islam_would_this_make/",
        "text": "[removed]",
        "created_utc": 1452017327,
        "upvote_ratio": ""
    },
    {
        "title": "Treat religion/atheism like a sexual kink and expect it from others?",
        "author": "troyaner",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zjsq0/treat_religionatheism_like_a_sexual_kink_and/",
        "text": "[removed]",
        "created_utc": 1451993890,
        "upvote_ratio": ""
    },
    {
        "title": "I want to think of a creative way to dispose of my body after I die since I don't believe in the 2nd Coming resurrection anymore. Any ideas?",
        "author": "JeffreyArrrHolland",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zh0pk/i_want_to_think_of_a_creative_way_to_dispose_of/",
        "text": "[removed]",
        "created_utc": 1451946385,
        "upvote_ratio": ""
    },
    {
        "title": "\"There is only one God, and all religions are different interpretations of the same entity.\" Refutations?",
        "author": "Anonymischief",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zgwvf/there_is_only_one_god_and_all_religions_are/",
        "text": "I was discussing the validity of a single religion with someone, who I'm close with. My point was that there is no way to tell which religion is the correct one. I asked why Jesus Christ was more probable to be the correct God than say Vishnu or Odin. I was met with a point I'm not familiar with. \n\n\"There is only one God, and different religions are just different interpretations of the same God.\" I was stumped, and couldn't come up with a disagreement to this point at that time. \n\nI've since come across some material about this very topic that I thought was interesting. For example, there is an analogy about 4 blind men who come across an elephant, and their conclusions when encountering different parts of the animal. One man feels the trunk and concludes that it is a snake, one man feels the tail and concludes that it is a piece of rope, one man feels it's side and concludes it is a wall, and the other man feels it's leg and concludes that it is a tree. \n\nEach describe the same thing, an elephant, but in a different way. At first it sort of sounds like it is in agreement with the opinion I initially stated (all religions point to the same God). In fact, it proves the opposite. It overlooks the fact that although they are attempting to describe the same thing, they are all incorrect. They have all misinterpreted what it is that they've come across. \n\nIf this issue comes up again, I will definitely bring this argument up, but I was wondering if you guys have ever heard this before, and if you have any other ideas on how to respond to that question. \n\nEdit: What also, would you say if they attempted to argue that the disparity is caused by individuals who are trying to make God's word to fit what they want (e.g Indian tribes smoking tobacco and taking Peyote religiously, while Mormons can't even drink coffee).",
        "created_utc": 1451944920,
        "upvote_ratio": ""
    },
    {
        "title": "\"12 Days of Evolution\" Youtube series",
        "author": "polygraphy",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zg44u/12_days_of_evolution_youtube_series/",
        "text": "We all know that atheist subreddits are not a substitute for /r/askscience, as much as some theists fail to grasp that... but for any atheists out there who has to deal with ignorance of evolution, [this Youtube series](https://www.youtube.com/playlist?list=PLsmqeqKj7M-rZe1C9PUon8V-VQ1tZj5NF) may prove useful.\n\nIt's obviously not specifically geared to religion/religious issues, but you'll notice right away that a number of the episode titles go directly to the heart of some of the dumber theistic \"critiques\" of evolution, especially:\n\n* 3: Have we ever seen evolution happen?\n\n* 4: Can evolution make an eye?\n\n* 5: Have we ever seen a new species arise?\n\n* 8: Does evolution violate the Second Law of Thermodynamics?\n\n* 9: Can evolution create information?\n\n\n* 10: Why are there still monkeys?\n\n\n\n\n",
        "created_utc": 1451934138,
        "upvote_ratio": ""
    },
    {
        "title": "the need for confession",
        "author": "looper10",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zcplb/the_need_for_confession/",
        "text": "[removed]",
        "created_utc": 1451873051,
        "upvote_ratio": ""
    },
    {
        "title": "I want to think of a creative way to dispose of my body after I die since I don't believe in the 2nd Coming resurrection anymore. Any ideas?",
        "author": "JeffreyArrrHolland",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3zaxk3/i_want_to_think_of_a_creative_way_to_dispose_of/",
        "text": "[removed]",
        "created_utc": 1451847410,
        "upvote_ratio": ""
    },
    {
        "title": "What's a good way to refute Christian's claims that the silly Old a testament don't apply, and therefore don't make them hypocrites?",
        "author": "dont_make_cents",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3z9ku5/whats_a_good_way_to_refute_christians_claims_that/",
        "text": "This is just a point that I've heard that I'm having difficulty refuting. For example, if I said something like:\n\n&gt;God commanded his followers to put women outside the city in there periods, not eat shrimp, , etc. \n\nA Christian might reply:\n\n&gt;When Jesus came we weren't bound by the Old Law anymore.\n\nMost contradictory verses and laws from the Bible are Old Testament. Many of the silly laws that are used as an example of Christians cherry picking, and being illogical and hypocritical, are not supposed to be followed, according to Jesus. Jesus didn't follow the Sabbath, for instance, and said that Moses's law was unnecessary. When I was Christian, I believed that Christian's were exempt from the old laws. What's a good way to refute the New Testament reasoning for not being responsible for all the old, silly laws and verses. Just found this sub and really enjoy it. If anybody could help me out or point me in the right direction, I'd appreciate it. \n\nEDIT: Thank you everybody. This has been great. ",
        "created_utc": 1451822550,
        "upvote_ratio": ""
    },
    {
        "title": "Secular Organisations in Ontario",
        "author": "LuxTenebrae",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3z94yg/secular_organisations_in_ontario/",
        "text": "Recently I found myself watching a TED talk featuring a Mormon woman named Chelsea Shields. She spoke about her involvement within the church, and how she was working to promote accountability for the systematic discrimination of women that goes on inside the Mormon church. She went on to explain how religion should be looked at critically yet fairly, and should be held accountable for its actions. The final line in her speech, \"I'm working on my people, what are you doing for yours?\" made me question what actions atheists, myself included, can do to open up discussion. As a 19 year old college student, I've begun to explore what it means to be active voice in the adult world, and in my country of Canada. If anyone has any information on secular organisations based in Ontario I would gladly appreciate it. \n\nI've done a bit of research and come up with a couple of links;\n\nThe Canadian Secular Alliance  http://secularalliance.ca/\n\nCanada Student Campus Groups CFI http://centreforinquiry.ca/get-involved/cfi-canada-student-campus-groups/\n\nIf anyone has any inside information on Ontario chapters that I've linked, or of ones that aren't mentioned I would love to see it.\n\nAlso the link to the TED talk I mentioned: https://www.ted.com/talks/chelsea_shields_how_i_m_working_for_change_inside_my_church#t-732600\n\n",
        "created_utc": 1451809610,
        "upvote_ratio": ""
    },
    {
        "title": "My mom told me a while ago that \"without a religion, there is no love and that you can't love.\"",
        "author": "Vengeance417",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3z2hnm/my_mom_told_me_a_while_ago_that_without_a/",
        "text": "This was probably around 2 or 3 years ago. I haven't forgotten what she said, and it still kinda depresses me when I think about it. I'm Atheist. I don't believe in a higher power such as God or Jesus, but I still feel like I have the ability to love my family, and even though my mom said that, I still love her to death. \n\nI don't really know why I posted this to be honest. I just feel down at the moment :/\n\n\n\n\n\n",
        "created_utc": 1451688824,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else kind of hope to see ghosts when they're alone?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3z0ezl/does_anyone_else_kind_of_hope_to_see_ghosts_when/",
        "text": "[deleted]",
        "created_utc": 1451648735,
        "upvote_ratio": ""
    },
    {
        "title": "Currently need responses for my research project at college",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3yyaxi/currently_need_responses_for_my_research_project/",
        "text": "[deleted]",
        "created_utc": 1451595750,
        "upvote_ratio": ""
    },
    {
        "title": "AU vs. FFRF?",
        "author": "Dr_Solfeggio",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3yxis2/au_vs_ffrf/",
        "text": "In 2016 I plan to be more serious and active about advocating for a public life void of religious materials. What's the difference between Americans United for Separation of Church and State and the Freedom From Religion Foundation? If I wanted to financially support just one, which would you recommend? ",
        "created_utc": 1451582836,
        "upvote_ratio": ""
    },
    {
        "title": "What do you say to evolution deniers about common design?",
        "author": "Mikey0",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3ytwuk/what_do_you_say_to_evolution_deniers_about_common/",
        "text": "So recently chatting to a friend about evolution, he is in the camp of \"something can not come from nothing, look at the Bombardier bettle and wood pecker that just happened by chance mutation?\" camp.\n\nSo I sent him a photo of a monkey with perfect human like teeth, and said \"see those canine teeth in your mouth, they match perfectly tooth for tooth with this monkeys teeth.\"\n\nHe responded with \"cats have two eyes, nose mouth same as a dogs, so cats evolved from dogs?  A common designer would create similar features in his creation.\n\nCant really argue with that sort of ignorance, but I'm interested what is the best argument to use when people say this common designer thing.  They ultimately just say \"God did it that way...\"  But is there any arguments that help? \n\nUpdate: \nThanks you all for your feedback, some good points all around for me to look into further.",
        "created_utc": 1451510032,
        "upvote_ratio": ""
    },
    {
        "title": "Uncle read Ray Comfort",
        "author": "MatteLiF",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3ypqr2/uncle_read_ray_comfort/",
        "text": "[removed]",
        "created_utc": 1451431847,
        "upvote_ratio": ""
    },
    {
        "title": "A Thought Experiment on Morality and Religion.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3yn500/a_thought_experiment_on_morality_and_religion/",
        "text": "[deleted]",
        "created_utc": 1451384738,
        "upvote_ratio": ""
    },
    {
        "title": "I finally stood up for myself in front of my ultra religious family.",
        "author": "inflated_waffles",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3ymp18/i_finally_stood_up_for_myself_in_front_of_my/",
        "text": "It's been a hard few years to say the least. \n\nI grew up in a household where my mother was devoutly christian. I was home schooled because she felt that I \"would be corrupted by public schools.\" She felt that she had messed up raising my siblings. \n\nI was always introduced as the miracle child. Which made set the bar extremely high for me from the beginning. I was obviously indoctrinated into christianity (the non-capitalization is purposeful, being one of my ways of saying that I no longer respect that lifestyle).\n\nI was a member of Awanas and have just about every jewel you can imagine. \n\nAnother thing I would like to mention at this point is that I have a high level of social awkwardness because I was so isolated. I have problems being part of a group, conversing with a group or even introducing myself to a group. \n\nMy father was there, but being a trucker he was gone most of the time and when he was home on church days, he stayed home to watch Nascar. \n\nWhen I was 16, my mother died of cancer. It was a long time coming toward the end it was church or some prayer group every day. She believed god would heal her. At this point my father became slightly more active in the church. \n\nAfter she died, within months he was married again. It's a bad story as to how it happened that isn't really relevant to the story, but what is relevant is the bitterness it caused. \n\nHe remarried about 7 years ago now, and it has been an uphill battle the entire time.\n\nDuring this time I left the church. I tested other religions here and there because I felt like something was missing. It was the only social interaction I knew, so I basically ran to whatever I could find that made me feel better about my situation. \n\nAnd then I realized that it's all a load of garbage. I'm 26 and I will proudly say that I am an atheist and have been one for a couple years now. \n\nBefore this christmas, I would tell some, and others I would avoid the question to get out of conflict. Not anymore. I know my stance and I will stand up for myself.\n\nI got married to my amazing wife in May and my family has made no effort to get to know her. This christmas was the first family gathering that we were invited to.\n\nIt's important to note that I've told my father my stance on the church, so he knows that I don't accept it. \n\nWe go to the christmas gathering and my wife is stressed out, it's overwhelming to her and I understand where she is coming from. There are 30+ people in the house that she has never met before. \n\nAs is christmas tradition, the story of the birth of jesus is told.... for a full hour and a half. I almost lost it at that. \n\nThen, my dads friend from church who is telling the story, asks all the christians to stand on one side of the room. Luckily my wife is in the restroom at this point. \n\nThis leaves me and my older brother on one side and about 28 people on the other.\n\nThey ask why he isn't a christian. He gives his answer about being busy and how he wants to go to church but doesn't have time.\n\nThen it's my turn. \n\nNo argument, rude tone or hostility. I calmly stated \"I am an atheist\" and left it at that. \n\nI was then asked if I would like to be prayed for. \n\nSome of you may disagree with this part, but my response, again calm was \"if you would like to.\"\n\nI have nothing to hide. I am confident in my stance. I am immune to that kind of behavior. I am not ashamed to be the only outsider in my family.\n\nThe rest of the night was awkward to say the least, but not for me. They visibly felt uncomfortable. I'm too busy living a good life to give a damn what they think of me. \n\ntl;dr: Family tried to save me with jesus on christmas and I stood up for myself. ",
        "created_utc": 1451372979,
        "upvote_ratio": ""
    },
    {
        "title": "How is faith different then believing in magic?",
        "author": "AcclimateToMind",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3ymg70/how_is_faith_different_then_believing_in_magic/",
        "text": "It seems that most religious people I hear speak about their faith use language differently then just about any other topic that can be discussed. What I mean by that is that said language manages to be so sure and seemingly specific about the mechanisms of their purposed model of the universe while still remaining so vague, leaving spaces for your imaginations to fill when otherwise it falls apart.\n\nIf you directly ask how they think a god made everything, they use words like 'will' or 'power', or sometimes that they 'spoke' the world into being. Its almost as if they imply some sort of physical mechanism that is in use my a creator, a tool or a force of creation at its disposal or a part of the being itself, to make things. They try to give us the sense that because of the nature of the god, he is capable of making anything and everything; and he has. \n\nBut here's the question. What would their reply be if you asked if the god they believe in used 'magic' to make everything? Would they wave that word away because of the unbelievable quality is has, or concede that his 'will' of 'power' is, in fact, magic? If the former is the case, how would the power the god used be separate from magic? What would be the missing defining property/quality?\n\nI ask not because I expect anything here to know what a religious person would think on this question (though I am interested to hear your thoughts) but instead merely to raise the question in your minds. I almost never hear the claims of the worlds faiths to be described or worded as 'magic' and that's pretty much exactly what it is, just in other words... right?",
        "created_utc": 1451368328,
        "upvote_ratio": ""
    },
    {
        "title": "Declining invitation to a religious ceremony?",
        "author": "throwaway_groomsman",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3ykzdv/declining_invitation_to_a_religious_ceremony/",
        "text": "I was recently asked to be a groomsman at a close family member's wedding. And the ceremony will be religious, including prayers and praising to god.\n\nI am EXTREMELY uncomfortable at such events. Due to an unpleasant religious upbringing (which the groom knows about), I have a pretty strong anxiety response to religious events. So a few years ago, I decided to avoid them them altogether.\n\nI emailed the bride and groom saying that I am not comfortable attending the main ceremony, but I'd be happy to attend the subsequent party or any other event celebrating the two of them. The groom said he is deeply upset by the response and that it puts our relationship in jeopardy because these rituals are an important part of his identity.\n\nMy question is, am I being too picky or obnoxious? Should I (as the groom said) \"stop being selfish and put up with it\"?\n\nI'm not sure of a way out of this without severely damaging our relationship. Any advice would be appreciated.\n\n\n*P.S. The closest reverse situation I can think of is an atheist being upset that a religious person won't attend a \"there is no god\" chanting ceremony.*",
        "created_utc": 1451344570,
        "upvote_ratio": ""
    },
    {
        "title": "I'd like to know what the difference between /r/atheism and /r/trueatheism?",
        "author": "SicSemperTyrannis123",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3ykpmf/id_like_to_know_what_the_difference_between/",
        "text": "I'm curious about the the differences between these subreddits are, is it just the amount of people who populate it? or is it the behavior of those who go on the subreddits? For example, I know there may be some biased but is one subreddit more open minded towards those defending religion than the other? \n",
        "created_utc": 1451340252,
        "upvote_ratio": ""
    },
    {
        "title": "What's the difference between /r/atheism &amp; /r/Trueatheism?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3yknrt/whats_the_difference_between_ratheism_rtrueatheism/",
        "text": "[removed]",
        "created_utc": 1451339454,
        "upvote_ratio": ""
    },
    {
        "title": "Other nonbelievers who don't see what's so sublim about the universe?",
        "author": "houndoftindalos",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3ykaxj/other_nonbelievers_who_dont_see_whats_so_sublim/",
        "text": "A common train of thought I see among nonbelievers is that with God out of the way, we start the see the universe as this beautiful mysterious thing we can meditate upon.\n\nFor me, I spend about one second thinking about it and then go back to reading a book or something as I quickly get bored. I'm not ever going to travel to space. Going to Mars sounds like a lot of hard, dangerous work that I'm never going to do assuming the option was available. I'm also not going to be a scientist solving science problems as I always found doing science problems in science class pretty boring even though I always got good grades in science and math. I'm actually mostly interested in what people do (literature, art, politics) and what people have done (history). If it doesn't have a human context, I often don't care. \n\nContemplating the awesomeness of human thought and human creation often gets me to thinking about how everyone and everything eventually fades into the mists of history, which makes me feel sad and nihilistic about existence. It honestly makes me want to give religion a try since religion says that God/universe is very interested in us as opposed to us just being tiny beings in a big cold universe that is incredibly hostile towards human existence.",
        "created_utc": 1451334096,
        "upvote_ratio": ""
    },
    {
        "title": "What's r/trueatheism responser to this argument about morality and god?",
        "author": "WorldCitizen1",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3yjjxj/whats_rtrueatheism_responser_to_this_argument/",
        "text": "Discussion about this video https://www.youtube.com/watch?v=mE3GP32IA1I\n\nPerson 1 ) \n\n\"Animals with a moral intuition increases the probability that their species will survive. Animals which don't have this intuition don't. Morals have survival advantage. Morals are not linked to religious values. Moral intuition has nothing to with religion. \"\n\nPerson 2 \n\n\"Animals have survival instincts. Unlike humans, animals do not have moral systems. This poor man moral code is stronger than his dire materialistic (and maybe survival) needs. This was the message.\"\n\n\"Moral codes are based on convictions NOT instincts. I don't think any true scientist claim that animals have intellectual convictions. God instilled certain instincts in the human and animal psyche that keep the survival of the species. This man moral code got him to take this actions, there were others that took a negative role and did not help. It is an optional behavior NOT instinct.  \"This includes protecting the offspring and sticking with the clan or family. In the case of this video segment, This is a man with a moral code who SELECTED to take this kind and honorable action, and he even put himself in danger allowing the couple to step on his body in a muddy unstable terrain. There were other humans around him that SELECTED to take a negative or neural role and hence did not help. It is an optional behavior NOT instinct. Comparing such act of sacrifice to save strangers cannot in any way or form be compared to animals' behavior with strangers, even from the same species.\"\"\n\n \"If it is a survival instinct act as you suggested, wouldn't it be more efficient for this poor fisherman to steal the rich couple property and sell them to feed his family, rather than saving them and not even ask for a commission?\"",
        "created_utc": 1451322929,
        "upvote_ratio": ""
    },
    {
        "title": "Have any of you had the chance to read David Silverman's new book, \"Fighting God\"? What are your thoughts on it?",
        "author": "Pitrestop",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3yj1aw/have_any_of_you_had_the_chance_to_read_david/",
        "text": "I've only ever (fully) read God is not Great out of the atheist litterature out there, and I thought Fighting God was pretty interesting.\n\nThe time he spends exposing the ways in which religion (Christianity) seeks privilege through government sponsorship was informative, and as a Canadian, I had no idea how rampant this was in the States.\n\nThat being said, the book is a little irrelevant to any non-American reading it, considering how it's target audience is almost exclusively American.\n\nWhat do you think?",
        "created_utc": 1451314606,
        "upvote_ratio": ""
    },
    {
        "title": "I'm having a existential crisis, what happens to my consciousness after I die?",
        "author": "OnwardRebs",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3yi8vn/im_having_a_existential_crisis_what_happens_to_my/",
        "text": "Do I just cease to exist for all eternity? I feel like for all the experiences that we go through in life that such an ultimate end is.... very scary. Trying to imagine nonexistence causes me to panic. I know that I never knew life before I was born, but death frightens me so much.",
        "created_utc": 1451295566,
        "upvote_ratio": ""
    },
    {
        "title": "Came out to my Christian wife, finally.",
        "author": "Rationalizationer",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3yi06m/came_out_to_my_christian_wife_finally/",
        "text": "I'm sorry that this gets kind of long, but this is a significant event for me, as I finally came out to my Christian wife.  \n\nWe were both active Christians going into our marriage four years ago, but I realized I was an atheist a year ago to the week.  \n\nIt's been a scary year with lots of thinking.  I've slowly been ramping up the intensity of conversations with her, presenting issues I have with Christianity, and religion in general.  I feel those conversations helped her not feel completely blindsided today.\n\nShe was sad, but she had a feeling I had become an atheist.  We had a good, short, open conversation about it.  She definitely won't be taking off with our two young children any time soon, we both agree that we're in this for the long haul, even though some difficulty is likely to arise.\n\nI'm still anxious for the future, but the big, scary conversation is out of the way.  \n\nI love my wife, and we have a loving marriage that I value greatly, so this is the scariest coming out.  The rest of the \"coming outs\" don't really worry me, if they even happen.  My family is incredibly conservative Christian, so their reaction could and likely will, be negative, but I still have my lovely wife :)\n\nI wanted to thank the members of this subreddit, your conversations on coming out have helped guide me to what appears to be a successful coming out.\n\nAlso, if I haven't lost your interest by now, I wanted to ask those of you who have gone through this with a religious spouse some questions.  Did your spouse seem fine at first but then change how they felt?  What were some things that came up?  I can think of obvious issues, but I'm sure there are some less than obvious things that come up in a case like this.",
        "created_utc": 1451289404,
        "upvote_ratio": ""
    },
    {
        "title": "All evidence points to duality: Universe &amp; Soul. 3rd Ed.",
        "author": "SpiritUnifier",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3ygpwg/all_evidence_points_to_duality_universe_soul_3rd/",
        "text": "[removed]",
        "created_utc": 1451265618,
        "upvote_ratio": ""
    },
    {
        "title": "Why not consider the existence of God?",
        "author": "know_o1n1e",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3yghys/why_not_consider_the_existence_of_god/",
        "text": "[removed]",
        "created_utc": 1451261952,
        "upvote_ratio": ""
    },
    {
        "title": "Why not give belief in God a chance?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3ygdes/why_not_give_belief_in_god_a_chance/",
        "text": "[removed]",
        "created_utc": 1451259858,
        "upvote_ratio": ""
    },
    {
        "title": "Way of thinking I just don't understand.",
        "author": "mybrosteve",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3yakou/way_of_thinking_i_just_dont_understand/",
        "text": "I found this text pop up from a mega church preacher on my Facebook:\n\n&amp;nbsp;\n\n\"Positive people know that God is in control. They choose to bloom where they’re planted. Don’t wait for the situation to change for you to be happy. Be happy while God is changing the situation.\"  \n\n&amp;nbsp;\n\nI don't understand this kind of submission. Why can't you take it upon yourself to change the situation to one you're happy with? To me, this just removes all responsibility for your own life and situation. Makes no sense to me.",
        "created_utc": 1451144250,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone have any experience starting up a chapter of SSA on a campus that could help me out?",
        "author": "Canadian_donut_giver",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3y966q/does_anyone_have_any_experience_starting_up_a/",
        "text": "I go to school in the Bible Belt and would really like to start something because my pretty large school does not have a similar organization anymore unfortunately.\n\nIf anyone has done this before could you post some advice? As well as your best words of wisdom for getting people involved and for things to do such as charity and getting speakers from around the campus.\n\n",
        "created_utc": 1451105299,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Xmas history article recently posted in comments",
        "author": "FilmYak",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3y6vmw/looking_for_xmas_history_article_recently_posted/",
        "text": "[removed]",
        "created_utc": 1451059611,
        "upvote_ratio": ""
    },
    {
        "title": "How do we know Julius Caeser existed and not Jesus?",
        "author": "nanajamayo",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3y66n3/how_do_we_know_julius_caeser_existed_and_not_jesus/",
        "text": "[removed]",
        "created_utc": 1451038100,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to believe if you've been atheist your whole life?",
        "author": "coldgears",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3y5yzd/is_it_possible_to_believe_if_youve_been_atheist/",
        "text": "I would love to believe in religion, because I think the idea of life just ending is a really, really shitty reality.\n\nBut I honestly do not believe it possible to convince yourself to believe something you fundamentally don't just because it's an appealing thought.\n\nWhat do you guys think?",
        "created_utc": 1451031093,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think there is any harm in pretending to believe?",
        "author": "frayedbuttons",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3y50i4/do_you_think_there_is_any_harm_in_pretending_to/",
        "text": "I suppose this question is oddly relevant this time of year, but ultimately do you think it is harmful to pretend to profess a belief in God? \n\nI mean, yes, perpetuation of ignorance and irrationality... but as an individual, my (false) belief or (true) lack thereof isn't going to change anything. Statistically, everyone here knows that people are very unlikely to alter their belief systems if they've been brought up as believers. In other words, we are very unlikely to change any minds. I have no doubt that many politicians, scientists and executives are closeted atheists.\n\nDo you think there is any real harm in pretending to believe? ",
        "created_utc": 1451006833,
        "upvote_ratio": ""
    },
    {
        "title": "Recommend a cocktail of titles for me.",
        "author": "mistahARK",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3y3zw0/recommend_a_cocktail_of_titles_for_me/",
        "text": "[removed]",
        "created_utc": 1450986168,
        "upvote_ratio": ""
    },
    {
        "title": "To paraphrase Abed Nadir:",
        "author": "drkesi88",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3y3ehp/to_paraphrase_abed_nadir/",
        "text": "[removed]",
        "created_utc": 1450974793,
        "upvote_ratio": ""
    },
    {
        "title": "Belief in Atheism",
        "author": "Sethdare",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3y3a0v/belief_in_atheism/",
        "text": "I constantly hear Atheism called a belief system and some theists seem to argue that our lack of belief in a god is equal to the opposite belief that there is no God.   My main rant here is that while I find this accusation pretty idiotic, most of us do hold very strongly to anti theistic establishment i.e. organized religion. \nWhenever I have had to argue with someone on this point it is easy to find common ground and have a productive argument by directing it to what is usually meant and what is important to the theist.   The don't, in my experience, truly care about a generic creator of our universe but hold dearly to a very specific personal God that conforms to their chosen (or not chosen) religious beliefs. \nTldr: I'd love more thoughts on my idea to avoid an, in my opinion,  mostly semantic argument of atheism as a belief system to an argument in a belief in the negative realities of organized religion. Am I just naive to the importance of the argument or maybe there are a lot of atheists who couldn't care less about organized religion. Let me know if you get a sec and happy freaking holidays you filthy animals!",
        "created_utc": 1450972330,
        "upvote_ratio": ""
    },
    {
        "title": "I tried to be a true Christian, and that's why I couldn't be one at all.",
        "author": "zarch",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xxz00/i_tried_to_be_a_true_christian_and_thats_why_i/",
        "text": "&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;First, I'm writing this, I guess, for the sake of discussion. I'm not here for internet points or advice, but I thought my story could lead to some thoughtful/interesting discussions. Secondly, I want to say I'm not the best writer. I'll try to keep rambling to a minimum, but just going to a give a forewarning that I may go off topic. Anyway... some back story first.\n\n&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;I went to a very fundamental Christian school from kindergarten through high school. I was taught everything Christian during my time there, but surprisingly I didn't really feel a \"calling\" to God until I was fifteen. So I finally accepted Jesus as my savior and began my walk with Him. I have to say I felt very good about myself.\n\n&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;The “eternal” happiness I felt from being a new follower of Christ was only short lived though. I went from a relatively happy and carefree teenager to an extremely depressed teenager, with suicidal thoughts, in only a matter of three months. The problem being that I was under so much stress to serve God. He saved me after all. He died for me. The least I could do would be to serve him and be as Christ-like as possible! \n\n&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;What did this mean though? Well, for starters, I had to stop masturbating. That was pure devil’s work according to my school; anything involving the flesh was. For a fifteen year old boy, that was extremely hard to do. I don’t think I ever went longer than two weeks without masturbating, and I HATED myself when I did do it. I punished myself. Never physically, but I severely emotionally beat myself up. I thought I was showing God how sorry I was. \n\n&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;To add to this, my sexuality began to blossom around the same time. I never really payed much attention to girls (I just masturbated because it felt good, didn’t use porn at first). But suddenly I was becoming increasingly attracted to guys. God forbid! What did I do to deserve this? I tried to fight it, but I just kept looking at guys in my classes. I couldn’t stop myself; it was honestly harder than not masturbating. I tremendously hated myself for this. I thought God was punishing me for something or maybe he was challenging me, but I just kept failing him! I would pray for hours. I would read the Bible… for hours. So much time wasted trying to please someone who only seemed to want to continue to challenge me to do better.\n\n&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;I also took the Bible very literally. It was God’s word, I was a Christian, and therefore I need to follow it. After all, what is faith without good works!? For example, the Bible says not to lie, correct? Well, me being a big PC gamer, I came across a lot of EULA’s and term of service agreements. One day I noticed when you check the box you’re agreeing to that you READ and understood the conditions. Well fuck! I rarely read those, and therefore now I’m lying! And technically, I am correct. I was lying. I still think if you’re a Christian you should read those if you want to fully be following your own religion. Nonetheless, I would actually sit down and read those dreadful agreements. \n\n&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;I would look around at my fellow Christians at school and wonder how they all seemed so content and stress free. I was constantly finding little things I had to do to fully follow the Bible. I wish I remembered some of the verses now, as I would cite them to show just how devoted I was and yet how that devotion was killing me mentally/emotionally. I mean, I honestly thought what was the point of school or a job? Many times in the Bible, people dropped everything to go out and teach God’s word. I should just do that! God will provide for me, as long as I fully devote myself to spreading His word. I could never bring myself to do it though… so I hated myself more.\n\n&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;I did this for three years. I truly gave my all to follow God and only felt like it was never enough. I could always do more and I should! I was a Christian, God wouldn’t give me a challenge I couldn’t handle; so I needed to push harder! Eventually I cracked. I told God to give me a real sign. An indisputable sign that I was doing what he wanted, that he actually existed. I told Him if he really loved me, he could do this one thing and I would continue giving EVERYTHING for Him. \n\n&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;I waited months, but it never came.  Finally, one day with tears in my eyes (I was crying over not doing enough again), I just said “fuck you God… in the past three years I have given more to you and followed your Word better than many Christian have in their entire life. The fucking least you could do is give me something back; a little fucking appreciation. Fucking tell me I’m on the right path and I’ll continue down it. Do it fucking now or I am done!” Of course nothing came. It was funny, that was the first time I cussed in three years. That’s how careful I was to follow God. I had never even let a “vile” word slip from my mouth.\n\n&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;So I abandoned Christianity and began to look after and follow myself. I accepted myself as gay and began to study other thoughts on Christianity/world views. I felt so free. So happy. The depression left almost immediately. About a year after this, I came out to friends and family. Thankfully most of them were very supportive. Another year after my coming out, I met the best thing ever. Ironically I met my now fiancé in the bottom of a church. We hit it off immediately. We were both gamers and super star wars nerds. I thought he was the most adorable thing ever, and I honestly never thought I could be with someone like him. He is the only person I’ve ever dated and two and half years after we started dating, he asked me to marry him. That was about six months ago and I couldn’t be happier.   \n\n&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;I guess the point of all this, to try and tie it into my title, is that if anyone truly tried to follow the Bible, they would go mad like I did. There are so many little rules hidden within even the NT that it makes it almost impossible to completely follow the whole Bible and live a modern life, if any life at all. I’m thankful though that I escaped from it. \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Anyway, thank you for reading this! Sorry it is so long. Hope it was somewhat interesting!\n",
        "created_utc": 1450860693,
        "upvote_ratio": ""
    },
    {
        "title": "How to politely decline a request for helping the church?",
        "author": "sfcpfc",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xuopm/how_to_politely_decline_a_request_for_helping_the/",
        "text": "Hi! I don't really know if this is the best place to post this, but I don't know where else I would. So, a bit of background: I deconverted when I was 16 (I'm 17 now) and I left church months later when I \"came out\". Prior to that, I had been involved with them. I was one of the responsible guys for an area they call \"production\". Essentially, they managed the sound, lighting, and the things that were projected on a screen (i.e: the lyrics of the songs that are sung during the worship time. I don't know if that sounds familiar to you; they sing Christian songs and then the pastor gives his speech after. They project the lyrics on the screen so that the crowd can sing along).\n\nAlso, I only told my parents that I'd cease to attend the church. I haven't talked with any of its members about it. But I go to special meetings like dinners from time to time; they're still my friends, after all. Last week, it was the church's Christmas celebration and my parents were interested on me being there, so I attended. Then, one of the members from the production area told me that the next week there would only be one member that could attend the church, and that they needed me because only one person wouldn't be able to control everything.\n\nI told him to find a replacement, or to train somebody to project the lyrics on the screen (It isn't at all a difficult task, with a 5 minute explanation and a 30 minute practice session, almost anyone could control it). But I never truly declined the petition; I'm a shy guy myself and it's really hard for me to just say \"no\". Instead, I told him to message me if they failed to find someone and \"we'll see\".\n\nNeedless to say, he messaged me and aksed it again. It's not that I can't be there, I rarely have anything else to do on a Sunday morning other than stay at home playing videogames. But I'm afraid that they'll be pissed off if they ever find out that I declined the proposal just to do that.\n\nWhile they're my friends and I enjoy their presence, and talking to them after the church is over, they need me to project the lyrics on the screen, and most of them talk about how they give God the control of their life, or how happy they are to give up this life and be rewarded with eternity, or how they don't understand God's ways but they still mantain their faith. I'm really disgusted by hearing them, let alone contributing to the worship session.\n\nSo I guess that everyone would agree that the right thing to do is decline (but it may be interesting to see this from other perspective). Assuming that I should decline, how to do so without upsetting them?\n\nMany thanks for reading, and for your help.",
        "created_utc": 1450803163,
        "upvote_ratio": ""
    },
    {
        "title": "How did human morals originate? And did the morals we already had influence the writing of religious texts?",
        "author": "Roacher21",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xtutb/how_did_human_morals_originate_and_did_the_morals/",
        "text": "The way I see it human morals are rooted in the conditions we first dealt with. Since we were groups of wanderers it was vitally important we stay in our group. If you did something that could compromise or hurt the group, let's take murder, you would be kicked out or killed. So it would be in your best interest to cooperate with everyone else. I go to a Catholic highschool and my religion teacher said that because we can act good means that we answer to a higher authority. Being atheist, I find it ridiculous to believe that there is no other reason why we do good other than because a supernatural being made us do that.",
        "created_utc": 1450788090,
        "upvote_ratio": ""
    },
    {
        "title": "What draws people to Islam? I see that it's population projected to eventually outnumber Christianity, but why?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xsy3j/what_draws_people_to_islam_i_see_that_its/",
        "text": "[removed]",
        "created_utc": 1450764761,
        "upvote_ratio": ""
    },
    {
        "title": "When is the death penalty justified?",
        "author": "nameerk",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xetot/when_is_the_death_penalty_justified/",
        "text": "[removed]",
        "created_utc": 1450485385,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for book that seriously discusses the possibility of a god.",
        "author": "mrconter1",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xeflw/looking_for_book_that_seriously_discusses_the/",
        "text": "[removed]",
        "created_utc": 1450478493,
        "upvote_ratio": ""
    },
    {
        "title": "Peter Boghossian and Dave Rubin: Critical Thinking, Atheism, and Faith [Full Interview]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xdlhx/peter_boghossian_and_dave_rubin_critical_thinking/",
        "text": "[removed]",
        "created_utc": 1450465393,
        "upvote_ratio": ""
    },
    {
        "title": "Creationism vs Evolution - Is Not This Debate About If We Are Here For A Purpose Or Not As Well As How We Ended Up Here?",
        "author": "littlesaint",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xd0s9/creationism_vs_evolution_is_not_this_debate_about/",
        "text": "I guess I put it all in the title - pretty straight forward. But what I'm saying is that to make people understand that evolution thru natural selection not god as a guide does not only go against creation stories - it also go against god/gods with us as the centre, that we came to be with a meaning in mind. Some people think that god/gods wanted a person to come alive, so that person then could have been 'called' to do things like - become a priest, but this view does not makes sense as evolution thru natural selection makes it clear that we have no calling, are not special in that sense, we are just part of nature.",
        "created_utc": 1450456874,
        "upvote_ratio": ""
    },
    {
        "title": "Creationism vs Evolution - Is Not This Debate About If We Are Here For A Purpose Or Not As Well As How We Ended Up Here?",
        "author": "littlesaint",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xcz89/creationism_vs_evolution_is_not_this_debate_about/",
        "text": "[removed]",
        "created_utc": 1450456210,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on meaning of life (repost)",
        "author": "troyaner",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xcai0/thoughts_on_meaning_of_life_repost/",
        "text": "[removed]",
        "created_utc": 1450444260,
        "upvote_ratio": ""
    },
    {
        "title": "RIP Richard Dawkins 3/26/41-12/18/2015",
        "author": "Test_Sucks",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xbz3o/rip_richard_dawkins_3264112182015/",
        "text": "[removed]",
        "created_utc": 1450436615,
        "upvote_ratio": ""
    },
    {
        "title": "Can a creator harm his creations?",
        "author": "mathius777",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xb1um/can_a_creator_harm_his_creations/",
        "text": "I am debating a theist on facebook currently(the best place to do it, to be sure:) and he has made the claim that a creator can do whatever he wants to his creations.\n\nI gave a counter example using parents and children. Mothers grow babies in their wombs, but they are not allowed to torture/murder them at their whim. The only difference between the Mother and God in this case is that God created the atoms.\n\nDo creators have a moral obligation to do no harm to their creations? If we someday created sentient life, either in a tube or by way of artificial life, would we be able to do whatever we wanted to them?\n\nThanks!\n",
        "created_utc": 1450413866,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on the (atheistic) universe goal",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3xaph4/thoughts_on_the_atheistic_universe_goal/",
        "text": "[deleted]",
        "created_utc": 1450407257,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists/Agnostics of Reddit, do you attend church when visiting your families for Christmas?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3x7zpl/atheistsagnostics_of_reddit_do_you_attend_church/",
        "text": "[deleted]",
        "created_utc": 1450365056,
        "upvote_ratio": ""
    },
    {
        "title": "Would I be wasting my time if I started reading C.S. Lewis' Non-Fiction books?",
        "author": "Drysaf",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3x70ov/would_i_be_wasting_my_time_if_i_started_reading/",
        "text": "So, I started looking into books on philosophy, theology and religion in general. I have been aware for a while now about Lewis' non fiction work, and I know Christians LOVE it, and would recommend it (particularly \"Mere Christianity\"). But it seems like so many atheist do not care for it at all. Why is that? Do you guys feel that way? Are the arguments used in the non-fiction works so bad? The only experience I have with C.S. Lewis is his fiction work. I have read \"The Chronicles of Narnia\" twice, read \"The Screwtape Letters\", and I have gained an interest in \"The Great Divorce\". I really enjoy his fiction work. I know they have Christian themes, but are those same ideas in his non fiction work? \n\nSo how do you feel about C.S. Lewis' work?",
        "created_utc": 1450343598,
        "upvote_ratio": ""
    },
    {
        "title": "Logical Proof of a Soul",
        "author": "SpiritUnifier",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3x19px/logical_proof_of_a_soul/",
        "text": "[removed]",
        "created_utc": 1450237973,
        "upvote_ratio": ""
    },
    {
        "title": "Does anybody actually enjoy Christmas?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3x16ns/does_anybody_actually_enjoy_christmas/",
        "text": "[removed]",
        "created_utc": 1450236543,
        "upvote_ratio": ""
    },
    {
        "title": "Hispanic",
        "author": "dez_caught_it",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3x102x/hispanic/",
        "text": "[removed]",
        "created_utc": 1450233548,
        "upvote_ratio": ""
    },
    {
        "title": "Been an atheist until recently. Now I would have to admit I believe in god.",
        "author": "1tepa1",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3wyt51/been_an_atheist_until_recently_now_i_would_have/",
        "text": "I have gone through a very big shift of perception. It is not done yet but what I have seen and been has been enough that I can no longer be classified as an atheist.\n\nI started getting into spirituality, the kind that was \"neutral\" in terms of god. This was because I felt there was no meaning in life. Back then it was important that there was no god since I was so opposed to any kind of god or deity concepts. \n\nI started meditating. After a while I read a few books by people who are widely considered to be enlightened. This was what really struck me in the heart. I connected to them on a very deep level. I recognised the truth that they were pointing to, even though I didnt know what it was. I simply did what they suggested and started to question my identity and thoughts. I found stillness, peace that has always been here. It is untouched by identity, personality. It is the pure sense of \"I\" with no concepts added to it. As that silent stillness I have remained for the last months. The person and old identity is still here, but I feel separate from it. Thoughts happen sometimes but it is like I am somewhere else. There is a distance between the \"mind\" and me.\n\nThen something absolutely unimaginable happened. I will try to describe it but it can not be understood or grasped with thoughts. It is so paradoxical that words can not describe it without contradicting each other.\n\nWhat happened is that I was for some reason able to drop even the last remnants of my identity and personality, I let the image I had of myself die while I was still alive. In that moment the sense of \"I\" that was anchored to the identity was free. It didnt anchor itself to anything. It was everywhere. Total unity. What ever I looked, it was me. I was everywhere. There was no \"I\" that was looking, there was only oneness and that oneness was looking. Even that phrasing is not true. The looker, the looking and the looked were the same. No separation between anything. I dont mean that all looked the same, the forms were different, but all were one. If I looked at a chair I had the experience of being the chair. Or the chair had an experience of being a chair. There was only the ONE. Whatever that one was, all was it. There was no \"I\" that was looking that was separate from the ONE. I came \"back\" from that a couple of times. Or a couple of times my old identity came back and each time the ONE vanished. They can not coexist. And every time I remember how absolutely alien and different it was when compared to being a \"human\". There was no humanity left in that. None at all. And yet it was infinitely more. Infinitely better. Although in that state there was no \"better\". All were one. Good, bad, all were \"IT\". And all was good. Even if pain would have happened to the body, it would have been \"IT\". It would not have been suffered. Time didn't exist. And that \"ONE\" is what I believe almost all religions are pointing to. Not some personal god, but god that is not separate from its creation. Of course you could use any name for that. You dont have to use the word god. Universe would work just as well. \n\nEven now that I am back to duality I know that in reality I am not in duality, it is just percieved that way because of some identification that is anchoring the sense of self. \n\nI was actually suprised to find this talk by Sam Harris to be true to what I experienced : https://www.youtube.com/watch?v=fajfkO_X0l0",
        "created_utc": 1450202166,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for good books disputing religious claims/history",
        "author": "Gossipmeng",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3wybfk/looking_for_good_books_disputing_religious/",
        "text": "I've been reading a few of the posts here lately - I've been quite impressed with the level of religious knowledge and your ability to dispute religious claims. I'd like to learn more about religion from an historical standpoint along with all the inconsistencies/plot holes.\n\nI was hoping I could get some recommendations an any books/essays/etc. which would fit the bill. I also have tried reading the bible recently just to get the other side of the story, but I've been struggling to make it through genesis (king james version) - I was wondering if there are any recommended condensed versions that tell you the main points/stories/timelines?\n\n\n",
        "created_utc": 1450195355,
        "upvote_ratio": ""
    },
    {
        "title": "Is King David the Messiah of Hebrew Myth?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3wxq2c/is_king_david_the_messiah_of_hebrew_myth/",
        "text": "[removed]",
        "created_utc": 1450186038,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on the Classical (religious) Christmas carols....",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3wvem2/thoughts_on_the_classical_religious_christmas/",
        "text": "[deleted]",
        "created_utc": 1450147453,
        "upvote_ratio": ""
    },
    {
        "title": "To [50+] redditors: my[29] parents[50+] insist, that once I get as old as they are, I would become religious for sure. Really?",
        "author": "troyaner",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3wutk3/to_50_redditors_my29_parents50_insist_that_once_i/",
        "text": "not sure their monotheism flavour is important, but they got into it quite intensively since ~2 years now and cannot stop playing superiority card. I have been raised without theistic pressure and think for myself since ~10 years.\nwould really like to know how it is to have lived a long godless life.\n\nEDIT:\n\nthanks everyone for sharing your personal stories! sorry, if a hurtful memory was recovered due to me. \nI've got a great outlook and a different perspective compared to a one-sided standpoint, it was really helpful and calming.",
        "created_utc": 1450137402,
        "upvote_ratio": ""
    },
    {
        "title": "To my fellow Atheist, why do you still celebrate Christmas?",
        "author": "Ryangonzo",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3wu1k2/to_my_fellow_atheist_why_do_you_still_celebrate/",
        "text": "I have been an atheist as long as I can remember. Yet I have never been at odds with this religious holiday. As an adult with two little ones I love Christmas time, Christmas decorations, Christmas songs almost everything associated with Christmas except for religion. \n\nI have found my own meaning in the holiday. I get excited for it because I use it to show my family how much I care about them. Not just by overspending on gifts but by spending time with them, celebrating each other and ourselves. I think that makes the holiday so much more meaningful. I get to enjoy this time of year because of what it means to me, not because what it means to Christianity. \n\nIn my mind it's a family holiday not a religious one. \n\nWhy do you still celebrate or not celebrate the season? ",
        "created_utc": 1450126971,
        "upvote_ratio": ""
    },
    {
        "title": "Did Jesus believe what he was saying?",
        "author": "windlep7",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3wplrf/did_jesus_believe_what_he_was_saying/",
        "text": "Some Christians often use \"Jesus said we'd be hated by the world\" to rationalise away the criticism they receive, for being hate-filled bigots.  This makes me wonder if Jesus knew what he was saying was crazy and that most people would figure it out eventually, so he said that to help keep the \"believers\" indoctrinationed. \n\nEDIT: It seems some people have trouble thinking in hypotheticals and having a personal opinion on something. I wasn't trying to reach a scientific consensus, I just wondered if anyone had any thoughts on the matter other than \"we couldn't possibly know\".  I'm not a complete idiot, I know we can't know with complete certainty.   Take Constantine for instance, he claimed to have a vision from God. Now, obviously, we can't look inside his head and see what he was thinking, but when I learned about it my first thought was \"he probably made that up to inspire his army into war\". I'm aware I can't actually know with any certainty, but I can have an opinion on it. Same way I don't believe in an afterlife even though I can't actually know until I die.\n\nEDIT 2:  I admit I've had my eyes opened though. I thought most atheists thought some guy called Jesus/Joshua/whatever existed and went around preaching in Galilee 2000 years ago.  He just wasn't performing miracles or God made flesh.  However, I don't see why you still couldn't answer even if you don't believe Jesus was an actual person. Obviously someone wrote about him - have you never wondered whether they believed what they were writing about?",
        "created_utc": 1450049734,
        "upvote_ratio": ""
    },
    {
        "title": "family is christian, took me to supposed spiritual conference, felt nothing when \"healed\".",
        "author": "YungJamin",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/3wm5oe/family_is_christian_took_me_to_supposed_spiritual/",
        "text": "(family is christian, by the way)\n\nI don't really identify as an athiest, but most of you guys seem like you know what you're talking about. I used to when I was younger, but honestly I'm considering that there is no hope, no god, nothing. \n\nI honestly want to believe that there's an afterlife, a heaven, a higher power. Just something better than what I'm living through now. \n\nMy family always says they pray to god, and he replies to them. My mom says that he talks to her and them through their heart.\n\nWhenever I pray to \"god\", I hear nothing. Feel nothing. No prayers of mine have been answered, and the darkness, depression, and pain I feel from life hasn't changed.\n\nWhy do they \"hear\" from \"god\"? What are they hearing that I'm not? Is it all in their head? Is this some type of phenomenon?\n\nAll my life, I've pretty much questioned everything. I've never just accepted what people tell me and believe it just because they tell me to. I've always looked for reasoning, proof, and the logic of what's behind everything. I know everything can't be explained, but there's just so many problems with Christianity.\n\nReading the bible made it worse. What I read was a bunch of contradicting nonsense. A god who killed millions of people, sometimes for no reason. Who seemed like a cold blooded killer in the old testament, but a peaceful loving god in the new? It didn't really add up.\n\n\nAbout 8 months ago, I've went to a christian conference thing in Pennsylvania with my family. I had just broken up with my long-term girlfriend at the time. I was suffering a bit of depression. My family really convinced me that this stuff is legit. I could feel good again, they can fix whatever spiritual problem I'm having.\n\nThere was a woman named Kathie Walters. You may have heard of her, you can look her up. She apparently has some \"annointings\" and \"healing powers\". My sister had a bunch of problems, she went to a conference before. Kathie apparently healed her of a bunch of spiritual curses, issues, and things that was passed down in our family. I was honestly sold.\n\nShe apparently had powers to heal everyone. When she was touching everyone, I saw all these people freaking out and doing things as she \"healed\" them. But when she touched me, prayed for me, casted all these \"demons\" out of me, I felt nothing. I pretended to be happy afterwards, but nothing changed. \n\nIt sucked because I was thinking \"Finally, my suspicions would be ever, I would truly be healed, feel god\". Sadly, I would be truly mistaken.\n\nI thought, does god hate me? Why can't I feel anything like these other people are? These people are freaking out on the floor having \"spiritual\" seizures, being healed, and I feel nothing. Am I damned? Am I cursed? Or do I just see past the nonsense?\n\nI didn't see a woman who god was working through. I saw a woman who was trying to make money off of people who didn't know any better. It made me upset.\n\nMostly what I got out of it was GOD LOVES YOU, THERES SPIRITUAL CURSES, BUY MY BOOKS AND CDs PLZ. I feel like most of these people holding christian conferences are just there to sell their products and make money off of people as confused as I am, and playing them for fools.\n\nEven after the conference and my doubts, I would pray to him. I would hear, see, and feel nothing. So my conclusion is either God hates me, or he just doesn't fucking exist and all of this is bullshit to give life some meaning for people who need hope.\n\nWhy is it that they felt something, all those people who were being \"healed\", yet I felt nothing? \n\nIs my family crazy? What are they seeing and feeling in this that I'm not? Is god truly a lie? Can someone please explain to me this. Maybe some information on Kathie that I don't know about? \n\nI'd really love to see what you guys have to say on this. Maybe help me out, explain some things. ",
        "created_utc": 1449985580,
        "upvote_ratio": ""
    }
]