[
    {
        "title": "Off-Brand DVD art irritates me unreasonably badly..... there should be a single cover art for every movie.",
        "author": "FatPajamas",
        "url": "https://www.reddit.com/r/TrueFilm/comments/973pmz/offbrand_dvd_art_irritates_me_unreasonably_badly/",
        "text": "[removed]",
        "created_utc": 1534206282,
        "upvote_ratio": ""
    },
    {
        "title": "Why do movies rely on scare chords for a scary scene?",
        "author": "Viburus",
        "url": "https://www.reddit.com/r/TrueFilm/comments/972i5f/why_do_movies_rely_on_scare_chords_for_a_scary/",
        "text": "Mostly on scary (broad term for horror/thriller/suspense and more genres under that term) movies of sorts, why do certain scenes have to have a scare chord/sudden noise? I understand barging around trashcans and shooting a gun would make loud noises, but a human/monster just simply standing there needs to have a loud noise since it's classified as an \"intense threat\" for the audience. The latter just feels kind of cheap to me, if the purpose was to build up tension on that scene.\n\n\nI don't get how being startled equals \"creepy\", but it works in a sense...since well, the audience got startled anyway by the loud noise even though its not *scary*.\n\n\nAlso, has there been any scenes that work without a sudden noise or sound? I guess scenes that work with the soundtrack alone counts too here.",
        "created_utc": 1534196746,
        "upvote_ratio": ""
    },
    {
        "title": "Spider-Man 2",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9729rc/spiderman_2/",
        "text": "[deleted]",
        "created_utc": 1534195019,
        "upvote_ratio": ""
    },
    {
        "title": "Is Drug Use a Cliche?",
        "author": "the_kid1337",
        "url": "https://www.reddit.com/r/TrueFilm/comments/970060/is_drug_use_a_cliche/",
        "text": "Greetings Cinephiles!\n\nI am currently a film student attending college. This upcoming spring I'm going to be working on my first film! Like most film students we're supposed to focus on social issues. Having gone through the current opiate crisis first hand, I wanted to record my accounts through this visual medium. But I have my concerns that heroin/opioids have become cliche over time-- espically for students. Or could I be completley wrong?\n\nTo give a little more info it was going to be minimial dialogue, non-linear with overly expressionistic lighting (think Kieslowski or Kar-Wai) \n\nI'd love to hear your thoughts!!",
        "created_utc": 1534179410,
        "upvote_ratio": ""
    },
    {
        "title": "Would you agree that comedy is more subjective than any other genre?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96zs7b/would_you_agree_that_comedy_is_more_subjective/",
        "text": "[removed]",
        "created_utc": 1534177866,
        "upvote_ratio": ""
    },
    {
        "title": "Rear Window: The language of Cinema",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96zqsv/rear_window_the_language_of_cinema/",
        "text": "https://i.redd.it/jhvo31a31wf11.jpg\n\n**In honor of Alfred Hitchcock 's birthday**\n\nall the pictures, side by side comparisons, and etc at the link [https://thefilmera.com/2018/08/13/rear-window-the-language-of-cinema/](https://thefilmera.com/2018/08/13/rear-window-the-language-of-cinema/) Enjoy\n\n**A**lfred Hitchcock is often accused of being entirely subservient to the whims of the audience; to him, every creative choice is run through the prism of his imagined spectators and weighted based on how much it will satisfy them. There are, as you can imagine, great benefits and great drawbacks to such an approach, but at the very least you can never accuse Hitchcock of not doing his damnedest to entertain you. But Hitchcock’s mastery of control over the movie-going audience at times extends beyond pure entertainment and becomes something altogether more powerful, exhibiting a deep understanding of not how a particular story will affect an audience, but on the entire perverse and powerful nature of movie watching in general. *Rear Window* is just such a picture, a perfect example of Hitchcock as a master of suspense and a scribe of cinematic history. Cinema is often said to be a mirror, but in this case, it’s a window.\n\nThe film opens much as a theater screening of old might: with the curtains rising from our screen. This particular screen, for invalid photographer L.B. Jefferies (Jimmy Stewart), is his titular rear window, looking out upon the courtyard of his apartment complex-cum-prison and, crucially, into the windows of his neighbors. Within each of these windows is an ongoing narrative thread that Jefferies, and us as viewers, spy upon and eagerly anticipate developments on. These prefigure the rise of television programming—weekly installments covering different genres, all from the comfort of your own home—as much as they convey the art of visual storytelling. Each thread is a captivating little vignette into the personal space of lives we shouldn’t be watching and are developed almost entirely without sound—an expression of Hitchcock’s deep love and understanding of the unique language of cinema.\n\nJust as each of these neighborly vignettes occupies their own windowed framing, they have their own genres as well. The ballerina across the way has sex appeal, the couple who sleep on their fire escape up high are a real laugh, the lonely woman on the ground floor is a tragedy, and the struggling piano player to the right is a real underdog story. A newlywed couple to the left draws their shade when they know they’re being watched, a crucial reminder to us that cinema is an inherently voyeuristic activity, something Jefferies’ supporting characters are quick to rebuke him about. However, the apartment smack in the middle is the most compelling story of them all, one even Jefferies’ erstwhile critics can’t resist (nor can anyone for that matter, as its always been the most powerful draw the movies have to offer since the beginning): the story of mystery, suspense, and drama. The story of murder. Mr. and Mrs. Thorwald across the way begin as a sordid tale of an unhappy marriage, but some midnight excursions by the mister and the sudden disappearance of the missus transforms domestic drama into a thriller. This piecemeal tale of intrigue and horror is picked apart across the way, quickly ensnaring a rapt audience of Jefferies’ nurse Stella (Thelma Ritter) and his girlfriend, Lisa (the always luminous Grace Kelly), making for crucial water-cooler discussions in the palpable heat of the summertime atmosphere.\n\nBut watching stories unfold has consequences, because as much as we want to think it is at times, watching movies is never a fully passive experience. Sometimes we take things home with us. If we didn’t, dictators and censors would never have bothered with slicing up or silencing mere “entertainment.” And when Raymond Burr’s lumbering and malevolent Mr. Thorwald looks straight into our eyes—which are also Jefferies’ eyes through Hitchcock’s canny use of subjective camera—it’s about as unnerving a cinematic experience as you can get.\n\nMr. Thorwald eventually enters the darkened interior of Jefferies’ home theater, and it’s a perfect representation of the confrontations of our deepest fears that occur in the cinema. Everyone is afraid of murder, but this confrontation is personal to Jefferies’ story on a deeper level—as are all the apartment stories. Jefferies is afraid of commitment and the struggles and compromises that come with it, and all his neighbors are windows into that fear, but Mr. Thorwald most of all. After all, a marriage so bad it ends in murder is the logical extreme, is it not? But by confronting his fears and coming out the other side (mostly) unscathed, Jefferies and his fellow tenants all get their happy endings, the cathartic experience of the externalized trauma of cinema having run its course. I wonder if Jefferies would be quite so happy in the end if he knew he was being watched as well? I imagine he’d at least be jealous of the close-ups.\n\nthank you for reading. Article by Member Graham Austin",
        "created_utc": 1534177595,
        "upvote_ratio": ""
    },
    {
        "title": "Has Heroin/Drug use in films become cliche?",
        "author": "the_kid1337",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96zi1v/has_heroindrug_use_in_films_become_cliche/",
        "text": "[removed]",
        "created_utc": 1534175942,
        "upvote_ratio": ""
    },
    {
        "title": "i’ve made a pretty cool discord server for movies",
        "author": "dabdabyeahman",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96yvdc/ive_made_a_pretty_cool_discord_server_for_movies/",
        "text": "[removed]",
        "created_utc": 1534171432,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (August 13, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96yn0r/casual_discussion_thread_august_13_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/)\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1534169668,
        "upvote_ratio": ""
    },
    {
        "title": "Jeanne Moreau worked with Antonioni, Godard, Truffaut, Welles, Demy, Malle and Buñuel in the span of 3 years.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96yb4r/jeanne_moreau_worked_with_antonioni_godard/",
        "text": "[removed]",
        "created_utc": 1534167019,
        "upvote_ratio": ""
    },
    {
        "title": "Why Tarzan is Disney's G.O.A.T",
        "author": "FreetheDevil",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96y4mo/why_tarzan_is_disneys_goat/",
        "text": "Having just re watched Bambi, which is considered the peak of atmosphere in Disney, Beauty and Beast, what is considered the peak of story in Disney, and Tarzan which i feel surpasses both, I feel prepared now to explain why i find it to be the greatest of Disney films. The Lebron(sorry mj) of Disney animation. Rather than waste your time with an intro, I'm going to get right to the specific elements that I find most pertinent to the comparison.\n\n1. **Animation:**\n\n*Bambi*, *Fantasia*, and *Pinnochio* are considered the peak of disney animation because of\n\nA. How realistic they look\n\nB. The synchronization of music and movement\n\n[https://www.youtube.com/watch?v=gSh1eLrxiqs](https://www.youtube.com/watch?v=gSh1eLrxiqs)\n\nBambi's footsteps sync perfectly to the notes of the soundtrack. While other films do this in spurts, *Bambi* does this for all but 30 seconds of the film, and that silence has thematic purpose, it's the perfect sound(or lack there of) to signify death. No recent or Renaissance disney film does this so thoroughly (including *Tarzan*) Additionally, the aesthetic is as close to real life as hand drawn animation can get.\n\nIt has two weaknesses:\n\nA. Limited Depth\n\nB. Lack of Detail\n\nHence one might find *Treasure Planet* as a remedy:\n\n[https://www.youtube.com/watch?v=ZD4HjmWLkq8](https://www.youtube.com/watch?v=ZD4HjmWLkq8)\n\nOff course, this remedy comes at the expense of realistic animation. This doesn't feel anything close to real life.\n\nEnter, the G.O.A.T:\n\n[https://www.youtube.com/watch?v=x3u1\\_181N7g](https://www.youtube.com/watch?v=x3u1_181N7g)\n\n*Tarzan's* aesthetic is arguably even closer to real life than bambi's, and it retains treasure island's depth and detail. The only weakness would be that it's synchronization isn't quite as thorough as bambi's(though tarzan does sync movement and music for the vast majority of the film), but i'd argue that's a worthy trade off for everything else it does better. That should just about conclude tarzan vs bambi because atmosphere is really all bambi has to offer. If you feel otherwise, feel free to identify any personal motivation or traits bambi has that aren't derived from \"young\" and \"deer\". Heck, feel free to find a motivation at all, there aren't any. He just does and learns what he's told to do and learn.\n\nI'd touch on music, but aside from synchronization, there's not much objective difference. Both use the soundtrack to signify tonal changes and reveals. I like tarzan's better, but it's subjective I suppose(collins did get an oscar though). I'll simply say that \"trashing the camp\" is about as imaginative a music piece can get, well, one that doesn't have Robin f...king Williams improvising.\n\n**2. Show Not Tell(Feat. Dialogue)**\n\nThis is really where Tarzan shines. Simply put, *Tarzan* has virtually no exposition, save for, and this is the lone exception, Kerchak's last words. Every line of dialogue is perfectly natural for what situation the characters are in, as well as the established characterization of said characters. Furthermore, the key emotional, and character beats aren't ever told, they're all shown.\n\n[https://youtu.be/zc3MnoSS5Hw?t=1m14s](https://youtu.be/zc3MnoSS5Hw?t=1m14s)\n\nWe are, shown, tarzan and Jane falling in love. We don't have the two sing about it. An owl doesn't go giving a heavy handed speech on the matter. The characters don't make sudden, physics defying, movements who only make sense int he context of what the movie can't help beat you over the head with, no. We can implicitly infer what is happening through clever visual transitions(tarzan watches film and sees a dude with a rose) and a verse seamlessly put in the soundtrack which never mentions \"love\". Love is only mentioned, once in the film, and it's well after the romance established with, prof, quite naturally, telling Jane so that she considers her own feelings rather than what society expects of her(note how the meaning here isn't really love, but something you can infer from the use of the term)\n\n[https://www.youtube.com/watch?v=8cLelpq424A](https://www.youtube.com/watch?v=8cLelpq424A)\n\nTarzan's desire to conform is expressed through Tarzan wordlessly painting himself with mud and his --visual-- reaction to the physical differences between him and kala still being present. Kala doesn't tell Tarzan that conformity doesn't overule identity, no, she tells him to focus on what he feels rather than what he sees. The hand and heartbeat tell us her point, she doesn't have to. We can tell Tarzan has started accepting his differences when he proudly swings past the gorillas he tried to emulate, terk doesn't have to point this out (compare with the tablewear in beauty and the beast conversing on how beauty and beast are falling for each other). We infer tarzan is desperate for external approval when he goes and gets an elephant hair to be accepted in the friend group, not when a figure of authority, points it out.\n\n[https://youtu.be/-WcHPFUwd6U?t=2m18s](https://youtu.be/-WcHPFUwd6U?t=2m18s)\n\nI could go all day about this sort of storytelling in *Tarzan*, but I feel I've established *Tarzan's* commitment to natural storytelling where characters are characters rather than thematic utility.\n\nLet's compare this to best picture nominee, *Beauty and the Beast* which, tells you exactly what Beast needs to do to satisfy his character arc via *narration*. Tells you Beast's character flaw via, *narration*. Has multiple characters explicitly mention beast's anger issues(because beast loudly growling isn't enough apparently). The aforementioned is filled with nice visual storytelling(which is basically facial expressions), but the impact is limited when supporting characters and opening narration tells you what's going to happen or is happening, over, and over, and over, and- you get the point.\n\nSo that this doesn't become an endless rant, i leave you with these two clips:\n\nB and B:\n\n[https://www.youtube.com/watch?v=x2rDrKUb6bM](https://www.youtube.com/watch?v=x2rDrKUb6bM)\n\nTarzan:\n\n[https://www.youtube.com/watch?v=x3u1\\_181N7g](https://www.youtube.com/watch?v=x3u1_181N7g)\n\nI'll let you decide which one feels like a story, and which one feels like a wikipedia summary\n\n**3. Characters**\n\n*Tarzan's* characters aren't breathtakingly complex. Tarzan, accepting who he is and outgrowing the need to appease, isn't something new. But the execution of this arc is what sets it apart from its Disney contemporaries. Whereas B and B tells you what's going to happen with narration, and tells the audience what it's character has to learn, *with narration,* Tarzan shows you characters doing their thing, and you can use that brain of yours to make inferences. I've outlined many examples of this in part 2, so let's move to the supporting characters.\n\nThe supporting cast in B and B is static. Belle starts of nice, rejecting conformity, and proud of her thirst for experiences. She ends, exactly as she started. Gaston is a cocky jerk with a superiority complex, he dies a cocky jerk with a superiority complex. You get the idea. The characters in B and B are all tools for the main character;s arc, Aside from that, they have nothing of their own aside from symbolizing themes which come to a head through how they interact with the protag, not their individual characterization. Tarzan's supporting cast is full of characters whose interactions with tarzan flesh out their own independent arcs, They're fully realized characters who change. Jane starts binded by society's expectations, and decides to prioritize her wants over other's expectations(love isn't the point, it's an expression of the point). Tantor starts very fearful and ends up overcoming his fear as he rescues Tarzan. Terk starts trying to distance himself personally, but ends up emotionally invested in other people, like tarzan. The arcs aren't as in depth as the protags, but they are there, which is more than i can say for b and b.\n\nFinally, let's talk motivation. We're told Beast is selfish because he's spoiled. We aren't actually shown a thing about why he's like this. Hence there's no reason to be as invested in Beast as in Tarzan, who we are shown clear motivations for (he wants kerchak's approval). As Tarzan has shown motivations, we can understand him, and hence are invested. Beast's motivation is mentioned in passing by through narration. We don't really understand him, as we're told why rather than shown why, and hence beast is a less relatable, and less compelling protagonist.\n\n**Conclusion:**\n\nTarzan is the best disney film ever!, if you disagree, go watch frozen!\n\n(Sorry i'm too lazy to write a conclusion)",
        "created_utc": 1534165490,
        "upvote_ratio": ""
    },
    {
        "title": "Trying out a new style of reviewing things, and in need of feedback - would love to know your thoughts and critiques going forward!",
        "author": "matthewmcorry",
        "url": "https://www.youtube.com/watch?v=CEbGKWaLfec",
        "text": "",
        "created_utc": 1534160671,
        "upvote_ratio": ""
    },
    {
        "title": "All About Office Space",
        "author": "HairyDavid",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96wjcg/all_about_office_space/",
        "text": "I watched *Office Space* for the first time in years because I wanted to show it to my Korean girlfriend.  She's well aware of shitty office culture, so I wanted to give her some dark laughs.  It brought back a lot of feels for me.\n\n(Her quick review was that it was interesting, but the ending fell flat.  Which oddly seemed to be the general critical consensus at the time.)\n\nI first discovered *Office Space* when I was 17 and on video shortly after the brief theater run.  I remember looking forward to it because it was done by Mike Judge, who I already liked thanks to *Beavis and Butthead* and *King Of The Hill*.  If I can give myself an ounce of credit in anything, I at least used to be a tastemaker when it came to comedy.  I dragged my fairly square best friend to both *Pootie Tang* and *Anchorman* in the theater, based on the involvement of Chris Rock and Louis CK in the former and the short films of Adam McKay in the latter.  For a less intellectual reason, I liked Fatboy Slim and they played \"The Rockafeller Skank\" in the trailer, which in 1999 was the height of hip.  I bought it on video because I'm old, and for my senior year it was my ultimate comfort movie.  I would wake up in the middle of the night and put it on until I fell back asleep.\n\nI was always surprised they didn't make a television spinoff of that movie.  It resonated *huge* with the IT/office drone demographic, a demo that later flocked to shows like *The IT Crowd* and both versions of *The Office*.  It wrote itself, as the show could continue to follow Michael Bolton and Samir Nagheenanajar as well as Lumbergh, with possible appearances by Peter Gibbons as he saw fit (he's a busy actor, although not as big as landing another leading role in a movie again).  The British version of *The Office* came out in 2001, perhaps a bit too soon for any studio to capitalize on the *Office Space* Comedy Central and home video cult, but honestly?  I think *Office Space* works better as a satire of work life.\n\nThere's no wacky coworker you engage in prank wars with.  No mousy-yet-attractive receptionist you mutually flirt with.  No flailing, tryhard boss.  No, the world of *Office Space* is pastel work shirts, khakis, drab office parks in nondescript suburbs and chain restaurants.  It's more middle-aged and old people, more bare-boned apartments with IKEA furnishings and no decorations.  People chide the American *The Office* for not being as grim and realistic as the British version, but I'll chide the British version for not being as monotonous and deadening as the American film, *Office Space*.\n\nIt's quite a coincidence that this movie came out the very same year as *The Matrix* and *Fight Club,* all three movies at least touching on how trite and meaningless modern life was.  *The Matrix* dipped a toe in it before going into wish fulfillment of being special and having superpowers and knowing how the world *really* works, and *Fight Club* went just... even dark and satirical with a narrator surrounded by mental illness and self-loathing.  But it does speak into what must have been a meme around that time in its purest form, a common idea shared by people all over.\n\nThere's a ton of great small moments of humor and character work here.  All of Peter's friends knowing just how he feels when he suspects his girlfriend of cheating on him.  Lawrence's blunt honesty (\"no thanks man, I don't need you fuckin' up my life, too\").  Drew's \"O Face,\" and cynical envy of the crippled Tom Smykowski.  The running soundtrack of gangster rap.  \n\nI did have a random thought that this film would probably be seen as \"problematic\" by the same audience (college educated and film literate) that initially discovered it.  There's numerous jokes on prison rape, Lawrence playfully calls Peter a fag in the end credits, and Peter chastises Joanna in what would now be known as a slut-shaming, although the film was surprisingly progressive in how Joanna fiercely pushed back on that.  \n\nI do think that, had Mike Judge thought of it, it might've worked better as a TV series.  The stakes are lower than that of a movie.  It feels like he had a lot to observe and say about work culture, but not exactly enough to make a well-plotted out movie, but you know what?  It still works for me.  Yeah, the ending was kind of a deus ex machina, but it's an observational comedy, and I can't think of a better ending besides Peter just getting fed up and quitting, and that's anti-climactic as well.\n\nI know they came out with a special edition DVD in 2005, but it seemed kinda bare bones.  I've love to see a really nice anniversary DVD, maybe next year for the big 20th (Jesus...).  Director's commentary, cast commentary, and hell... a full-on hourlong doc.  You could *easily* do at least an hour on the impact *Office Space* had.  People coming up to Ron Livingston saying he inspired them to quit their jobs.  There was an article about the movie in Entertainment Weekly that mentioned how office workers would immediately ask new hires if they saw that movie and what they thought, and if they didn't like it \"we don't like that person.\"  The demand that brought the red Swingline stapler into action and the quiet rebellion it represents.  \n\nI was about to suggest Mike or someone do a modern day followup, and then I remembered *Silicon Valley* was a thing.  Now, I know this puts me in the minority but... I saw a few episodes and it just didn't click with me at all.  Maybe it's my severe aversion to TJ Miller, maybe it just didn't work for me.  I like Kumail, Middleditch and Woods so maybe I'll give it another shot.  But I feel like there's great comedy to be mined from gentrification, \"hip\" workplaces looking for \"rock stars\" and \"ninjas,\" and the race to the bottom for the average American worker.  It's kind of sad that, on looking at the world of *Office Space*, the idea of having stability and a regular paycheck almost makes it seem... aspirational.  \n\n",
        "created_utc": 1534148080,
        "upvote_ratio": ""
    },
    {
        "title": "Three Identical Strangers left me completely speechless",
        "author": "dcruse22",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96vrfh/three_identical_strangers_left_me_completely/",
        "text": "If you don’t know the premise of this documentary, I highly encourage you to just go in completely blind because it’s a story I somehow had never read about or come across and the film was so effective at feeding all of the information to me in a way that kept me on the edge of my seat. \n\nSpoilers below for the documentary \n\nI had zero idea what to expect and the revelations that their separation was part of a psychological experiment and that even their sisters were basically planted there by the researchers for the study were so disturbing and interesting to me. I am still not over this movie. The reveal that not just Eddy, but multiple subjects involved in this twisted experiment had committed suicide was so impactful. \n\nThis documentary was incredibly well made and I felt they told the story in a beautifully cohesive way. Each twist or turn was alluded to or foreshadowed just the perfect amount so we never really knew what was coming. \n\nThe story of these 3 guys and the fallout of these revelations is incredibly profound and truly has me questioning the very fabric of reality and how much of who we are is determined before we are even old enough to recall anything. Clearly, splitting the children up after they spent around half a year together as babies had long lasting mental effects and it’s so crazy to me to consider separation anxiety in a baby continuing to grow and spiral into severe depression once that person grows older. Imagining finding out your entire life has been an experiment set up by people you’ve never even met is terrible. This story was a rabbit hole that just kept getting deeper and deeper \n\nThe fact that there may be up to 6-8 more twins out there who still haven’t discovered each other is so strange to me. I know I’m rambling all over the place but I can’t even begin to explain how many questions and thoughts I’ve had about this film but it’s definitely one of the most profound documentaries I’ve ever seen and now one of my favorite films of the year so far. \n\nWhat did you guys think of Three Identical Strangers and are there any other documentaries you’ve seen that will cause me to re-evaluate my entire existence within this society like this one has. ",
        "created_utc": 1534138841,
        "upvote_ratio": ""
    },
    {
        "title": "Now that you’re older",
        "author": "youngSvenVanderwater",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96ujhv/now_that_youre_older/",
        "text": "[removed]",
        "created_utc": 1534126889,
        "upvote_ratio": ""
    },
    {
        "title": "Locke (2013): How did it cost $2 million?",
        "author": "ScotchEssayThrowaway",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96tpkg/locke_2013_how_did_it_cost_2_million/",
        "text": "First off, I hope I'm not breaking any rules by starting a discussion of the production process and budget of a film in this sub.\n\nI saw Locke and really enjoyed it, but I was blown away upon finding out that the budget was $2 million. I looked at the information that's available online to come up with some possible explanations, but I'm still hundreds of thousands of dollars short.\n\n- Tom Hardy is an expensive ask, but I don't think he alone would wipe out the budget, especially when you read about how committed he was to bringing this film to fruition. The voice actor roster has some big names, but paying them for over-the-phone shooting over roughly a week doesn't seem like it would break the bank.\n\n- The whole film was shot over eight days, with each work day being six to eight hours long. The cameras were mostly fixed in place. I didn't see any prohibitively expensive shots.\n\n- The runtime is 85 minutes. Cuts down the editing work quite a bit.\n\n- The score was very ambient and didn't have any live instruments that I could hear. Most experienced composers could knock it out in a week for $10-20k.\n\n- I'm sure that the BMW was used by the production team for free or at least at an extremely discounted rate.\n\n- The color grading work is very uniform in the film. I can't imagine running into many major difficulties when the lighting is consistent throughout.\n\nSo after taking all of this into account, how could this film possibly cost $2 million unless they were just lighting hundred dollar bills on fire in between takes? Help me understand.\n\nEdit: words.",
        "created_utc": 1534119388,
        "upvote_ratio": ""
    },
    {
        "title": "Still Haunted by A Ghost Story",
        "author": "OrzhovDunn",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96t5ei/still_haunted_by_a_ghost_story/",
        "text": "https://youtu.be/6THAPxMDeSA\nIts been several months since I first viewed A Ghost Story by David Lowry. Why can't I still shake it out of my brain. Hi. I'm Jon. I do YouTube reviews and yada, yada...insert self promo here. I really don't think I would/could have the patience to attempt a written explanation for any other film I've reviewed but again for whatever reason I can't stop thinking about this movie and the emotional roller coaster I've been on since watching this on Amazon VOD. \n\nI'm bad at emotion. Within the last 10 years I've gone through losing both parents and supported my wife through two miscarages. I didn't cry at my fathers funeral which was only this last December (they even used what I will call chemical emotional warfare by blasting \"Hey Jude\" at his grave site...nope, couldn't squeeze one salty drop out) but could not turn off the old waterworks while watching a movie which was deemed by most as boring &amp; contrite. \n\nA Ghost Story was not a film to me. It was therapy. Long tracking shots (not the super flashy hallway walks of PTA or the flawless boxing match of Creed) but hovering shots of...well nothing really. A married couple cuddling in bed. A quite hospital. 8+ MINUTES OF EATING PIE!!! All things that most deem flashy and unnecessary. Not to mention that our POV charecter is wearing a bedsheet. Did I mention that there are long gaps of no dialogue. Besides JK's A Quite Place, this might be the most muted film since the 1920's. \n\nIt's not really about the actor performances either. Casey Affleck is fiiiiine? Rooney Mara has a little more to do but not much. Oh yeah did I mention KESHSA is in the film. Excited yet? It's almost as if I'm talking you out of giving this movie a shot. Maybe I am. Maybe I just want to selfishly hold on to it as my own. My precious. Like if more people saw it or talked about it maybe it would be less special to me? Told you I'm bad at emotion. \n\nOn paper this film is hipster trolling at its finest. However. For whatever reason it's pulled off with such nuance and touch that it works on some strange alien level. You see the take away is this is not a love story. Its about time. The world goes on when tragedy strikes. People are still going to get their Venti Vanilla Latte's on the day your mother dies. It's just that feeling of non importance that makes people feel so uncomfortable. But its also beautiful in a way. That even though your world comes crashing down sometimes, in that moment it's pure serenity for another. It's also not a spirtual experiance either because if I say I'm bad at emotion than holy crap I suck at spirituality. \n\nWell thats it for today. I guess I'll see if anyone likes or cares in the great sea of content that is this modern era of media. But at least I got my free therapy for the day. Please let me know what you think so I won't ever do something like this again. ",
        "created_utc": 1534114526,
        "upvote_ratio": ""
    },
    {
        "title": "My Favorite Film of the Last 5 Years",
        "author": "[deleted]",
        "url": "https://youtu.be/6THAPxMDeSA",
        "text": "[deleted]",
        "created_utc": 1534112798,
        "upvote_ratio": ""
    },
    {
        "title": "I Saw the Devil and what revenge can do to people. (SPOILER ALERT)",
        "author": "LiftedDemon",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96sqjb/i_saw_the_devil_and_what_revenge_can_do_to_people/",
        "text": "This korean movie has been on my list for a while. Everybody always talked about how it was a film that differed from other revenge movies, so I had to check it out (specially considering how good koreans are at making this type of movie).\n\nIt all starts out typically, there's a murder...the killer and the revenge seeker to hunt him out. Soo-hyun is the avenger that had his fiance killed by Jang, the psycho killer (maybe the most intense and scary representation of a chaotic psychopath that I've ever seen being in movies).\n\nThe movie develops both chracters well as it starts, specially Jang, as we are forced to see the details of his killing spree and twisted mentality not only at the beggining of the film, but as it progresses as well. That's the aspect I liked the most about this character, his desire to kill is so powerful that he does not stop even while being chased by Soo-hyun, it seems like something he has to do every now nd then, which only adds to his scary and disgusting aura (that was already pretty stablished once we found out he would rape a teenage girl if he was given the chance).\n\nSoo-hyun's most interesting charateristic is his approach for revenge. He's not the type of avenger that gets sattisfied on finishing the job at once, he wants to keep hunting his prey, something the movie brings out brilliantly as a mistake, because it allows Jang to keep collecting victims and turns Soo-hyun into a sadistic animal...just like Jang.\n\nThat's the movie's message and what I liked about it the most: it does not want to represent revenge as something to be entertained about, but as it is in real life, something that rottens your soul. During his seek for revenge, Soo-hyun looks less and less like a hero (I couldn't even see him as an anti-hero sometimes) and his revenge starts to look more and more like something that should not be happening. People who were dear to him suffer because of it, people who had nothing to deal with his girl's death suffer because of it, he turns his back on the organization he was suppose to serve because of it...and all that for a pay off that is unsatisfying (as Jang said, he won the whole thing) and brought him to tears at th end of the movie.\n\nI cannot say it is my favorite revenge movie ever, after all, Confessions, Kill Bill and Old Boy also talk about it, but I guess it is my favorite approach about this theme that I've ever seen. After all, pain and hate will always generate more pain and hate.",
        "created_utc": 1534111056,
        "upvote_ratio": ""
    },
    {
        "title": "King Kong vs. Godzilla: Looking back at the American Version",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96rphu/king_kong_vs_godzilla_looking_back_at_the/",
        "text": "https://i.redd.it/0ezguh6utpf11.png\n\n[https://thefilmera.com/2018/08/12/king-kong-vs-godzilla/](https://thefilmera.com/2018/08/12/king-kong-vs-godzilla/) for all photos, links, and rating. Enjoy the read!\n\n**W**hen I started the Filmstruck *Godzilla* marathon, I looked up the series as a whole and saw this was a relatively early entry. Unfortunately, this was not available as part of the selection on the streaming service. I guess whoever holds the rights for it hasn’t let go. So, since I have now finished that marathon, I decided to go out and buy the missing pieces. The whole series really has grown on me quite a bit and this was, quite honestly, the one I have really wanted to see since the beginning. This is two major movie monster icons pitted mano a mano well before the likes of *Freddy vs. Jason* or *AVP: Alien vs. Predator*. How could I not be interested in seeing it?\n\nJust like the original *Godzilla*, there is an original Japanese version as well as a heavily edited American version of *King Kong vs. Godzilla*. What I ended up buying was the American version. At some point, I’d like to see the original Japanese version because if the edited version of the original *Godzilla* is any indication, this was drastically altered. I’m not terribly upset over it though. I think just being able to see some version is worthwhile. Also, from what I’ve read, there were edits made to the Japanese version and what’s available these days is a ragged copy. I guess some attempts to fill in parts from the American version have been made, but that didn’t really get it back to one hundred percent.\n\nIn the American version, we flip back and forth between added news coverage and original Japanese movie. I’m not entirely sold on the news coverage aspect because it really feels tacked on, much like the Raymond Burr footage in the American version of *Godzilla*. However, I think this was presented in the way I’d have liked to have seen Burr’s parts in the original. The way his parts were integrated into the original *Godzilla* film felt strange. They had actors with their backs turned so you couldn’t see their faces acting like the original Japanese cast. In this Americanization, we just flip back and forth from original movie scenes to news coverage which seems a bit more natural.\n\nThe downside of the news aspect is that some strange ideas were put in place. There’s some sort of a broadcast satellite we get shown every so often which is obvious matte work and looks a lot more like a space station than a satellite which was a tad confusing because I wasn’t ever quite sure if someone was up there broadcasting or if it really was just a signal relay. The thing was shown multiple times as if it was integral to the story. Probably filler I’m guessing. Even worse were the reporters themselves. If you were to ask me to describe a 1960’s journalist, I wouldn’t use the words disconnected or wooden, but that’s what they are here. Tacked on in the worst way. That’s quite a few words to discuss the news parts of this, but since they were featured so prominently, I feel it’s warranted.\n\nOnce we do get to some actual monster action, we start with Kong although there is a brief bit with a submarine encountering a frozen Godzilla in an iceberg. A pair of guys that work for some sort of pharmaceutical company is dispatched to the island Kong lives on to drum up some advertising. Here we get some islanders who definitely do not look native. At this point, I would say it’s your typical Kong story. People go to the island, get into it with the Islanders, wonder why there is a giant wall, find out Kong is real, and grab him from the Islanders to go put him in the circus or some such thing. The big exception to this is the giant octopus Kong fights off. That was a real feat of effects however it was done. There was some average quality green screen type work, but however, the actual octopus was done was amazing to watch. The octopus even lands on Kong’s face *Alien* facehugger style at one point! Kong drives the giant sea monster off and spends some quality time with this berry concoction that knocks him out.\n\nSomehow, the hapless duo ends up capturing Kong even though they were held captive by the Islanders at one point. This isn’t really ever shown. So did these guys commission the crew of the ship they came in on to murder the islanders and take Kong or was there some sort of peaceful trade? We don’t find out. Next thing you know, Kong is laying on a barge getting towed back to Japan. Except the authorities stop the ship and tell them to turn back. They want nothing to do with a giant monster lumbering around their cities.\n\nIn the meantime, we find out Godzilla has made his way over to start terrorizing the country. Kong wakes up and breaks through the ropes holding him down, and then he also makes his way over to do his bit of damage. Eventually, the two meet and have a brief battle. Kong tosses some boulders, but Godzilla blasts him with the atomic breath a few times which causes Kong to leave. Somewhere along the way, we get a news break with a scientist discussing the two monsters. Kong is the more intelligent where Godzilla has a small brain and is really just dumb brute force. So the initial battle plays out pretty much as you’d expect. Godzilla swats away Kong’s attacks and blasts away with his bad breath. Kong wisely retreats and lives to fight another day, leaving Godzilla for the humans to deal with.\n\nwon’t go into the rest of the details of the story, but this really does play out like you’ve already seen in *Freddy vs. Jason* and *AVP: Alien vs. Predator*. Humans get in the way, and the big monsters fight. Is it worth it? Absolutely. This was a fun movie to watch. I have to say, I hyped myself up for it and was not let down. I’m not sure how many other “versus” movies there were at this point in time, but this has got to be one of the first monster mashups. I give this one 3/5 stars. It’s very entertaining, but you’re not going to get the best acting or story here.\n\n**My thoughts on all the Godzilla Showa Era films so far along with pictures and ratings**\n\n[https://thefilmera.com/2018/07/27/godzilla-showa-era-spotlight-followup/](https://thefilmera.com/2018/07/27/godzilla-showa-era-spotlight-followup/)",
        "created_utc": 1534102886,
        "upvote_ratio": ""
    },
    {
        "title": "How BlacKkKlansman Examines Racism in American Cinema",
        "author": "Steven526",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96rlad/how_blackkklansman_examines_racism_in_american/",
        "text": "BlacKkKlansman, Spike Lee's latest indispensable work, opens with a shot lifted from Victor Fleming's iconic Gone with the Wind. In this shot, Scarlett O'Hara surveys massive Confederate losses at the Battle of Atlanta. As the camera pans upwards, a Confederate flag enters the frame, billowing in the wind. In BlacKkKlansman, Lee is concerned with puncturing the mythology around American moviegoing, showing audiences that Hollywood is as responsible for upholding white supremacy as other American institutions.\n\n\nThe film dramatizes the true story of the Colorado Springs Police Department's infiltration of a local Ku Klux Klan chapter. Rookie detective Ron Stallworth (John David Washington) contacts the Klan by phone after seeing a newspaper advertisement recruiting new members. He sends a Jewish detective, Flip Zimmerman (Adam Driver), to make contact with the Klan in person. Talk of violence among the Klan members allows the investigation to continue, and Stallworth continues to speak with the Klan over the phone as Zimmerman meets them face-to-face.\n\n\nRacism and representation in American film percolates throughout the course of the picture. Stallworth's first assignment as a detective is to attend a meeting of the Colorado College Black Student Union, where civil right activist Kwame Ture (Corey Hawkins) is set to speak. Ture engages the audience with an anecdote about attending Tarzan movie serials as a young child. He describes how Tarzan would fight off and kill the native Africans, and how Ture would cheer him on. The power of the cinema and its ability to affect attitudes, Lee and Ture are telling us, is such that a young African-American boy would cheer for the denigration of his own race on screen.\n\n\nAt this meeting, Stallworth meets the president of the Black Student Union, Patrice Dumas (Laura Harrier), and a relationship blossoms between them. On a walk in the middle of the film, Stallworth and Patrice discuss blaxploitation films of the early '70s. Stallworth appreciates the representation of black heroism on screen, he feels empowered by it, but Patrice is quick to point out that his cinematic heroes are often portrayed as drug dealers and pimps, a damaging depiction of black communities.\n\n\nLate in the film, Klan leader David Duke (Topher Grace), comes to Colorado Springs in order to attend Stallworth/Zimmerman's initiation into the Klan. In a truly stunning scene, Lee portrays Duke and the rest of the Klan members watching and cheering on the Klansmen in D. W. Griffith's Birth of a Nation. At the same time, an aging black activist describes the violence white men were able to enact against African-Americans with impunity during his youth. Lee cuts between the two scenes, underscoring how the actions and attitudes portrayed by Birth of a Nation directly resulted in violence against the black community.\n\n\nBlacKkKlansman concludes with an epilogue depicting the events in Charlottesville last year, including the death of Heather Heyer. The film draws a direct throughline from the Klan of the '70s to the white supremacists of today, underscored by David Duke appearing in footage from Charlottesville. By concluding with these powerful and discomforting images BlacKkKlansman eschews cinema's history of racism and hopes to become, instead, a galvanizing force for audiences today. America's institutions have been complacent in the rise of white supremacy, Lee lets us know that it's up to us to stop it.\n\n",
        "created_utc": 1534101960,
        "upvote_ratio": ""
    },
    {
        "title": "How BlacKkKlansman Explores Racism in American Cinema",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96rgcr/how_blackkklansman_explores_racism_in_american/",
        "text": "[deleted]",
        "created_utc": 1534100866,
        "upvote_ratio": ""
    },
    {
        "title": "Hiring writers for film zine",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96r9mp/hiring_writers_for_film_zine/",
        "text": "[removed]",
        "created_utc": 1534099429,
        "upvote_ratio": ""
    },
    {
        "title": "Is Wes Anderson Overrated?",
        "author": "conorsullivan124",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96q6md/is_wes_anderson_overrated/",
        "text": "The answer for me is yes through and through, I highly enjoyed The Grand Budapest Hotel because whilst it was stylisticly influenced it had enough substance for me to enjoy it, every other one of Anderons films follow this simple regime.\n\nThey are either all style and very little substance, for example Moonrise Kingdom or The Fantastic Mr Fox.\n\nOr they go more for substance but because Wes Anderson's style is all that really seperates him the films that go for substance are just average at best for example Rushmore.\n\nOf course this is all my opinion, Wes Anderosn is dearly loved and I have only seen 5 films but I think that's enough to get a grasp of him, I'm writing this in the hopes someone can change my mind and make me begin to love Wes Anderson because even though I hate when his films are no substance and all style, I do actually love his style, the cinematography of films like Moonrise Kingdom is absolutely beautiful but I just can't give the film a good rating because the characters and plot execution are all so average.\n\nSo please, try and convert me to an Anderson lover.",
        "created_utc": 1534090768,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of August 12, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96q47q/what_have_you_been_watching_week_of_august_12_2018/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1534090222,
        "upvote_ratio": ""
    },
    {
        "title": "Taxi Driver: Confining you, masterfully, with a highly dysfunctional Travis Bickle | Direction style and its psychological impact",
        "author": "allthingsfascinating",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96of4r/taxi_driver_confining_you_masterfully_with_a/",
        "text": "[Video](https://youtu.be/1KN6d3Rvihg)\n\nTaxi driver disturbs me. The violence of course, but what affects me even more is how the film forces me in this visceral manner to be at close quarters with a highly dysfunctional mind – Travis Bickle.  \n\nAlmost every thought he has, I can relate to it in some degree. The only difference I see between us, is that I have a lot more control over my thoughts, whereas he becomes a slave to them, and it eventually shows up in his actions, in how brutally he kills the people he loathes.  \n\nI am forced to ponder upon the madness and the cruelty of a society that breeds such minds. After all a society is nothing but a collection of minds influencing each other.\n\nAnd this is what fascinates me so much about Scorsese’s filmography. His principal characters are almost always unconscious people perpetuating violence in the society. If not physical violence, then mental violence (e.g. The Wolf of Wall Street). He makes us live the lives of these characters, but what’s strange is that instead of becoming more unconscious like them, I always end up feeling more conscious of myself and the society. That’s rather strange, but I think that happens because there is this element of truth in his filmmaking.  \n\nIn the video above, I have discussed the techniques used to put the viewer inside the  disturbed mind of Travis Bickle. Let me know what you guys think about it.",
        "created_utc": 1534071598,
        "upvote_ratio": ""
    },
    {
        "title": "Martyrs (2008) and sensualised violence: a schizoanalysis",
        "author": "robotfunkychicken",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96lq70/martyrs_2008_and_sensualised_violence_a/",
        "text": "Previous Post [here](https://www.reddit.com/r/TrueFilm/comments/94eav4/new_french_extremity_episode_2_in_my_skin/)\n\nMartyrs premiered at the 2008 Cannes Film Festival, and was ominous for its first audiences to such a degree that incidents of viewers passing out and vomiting were widely reported Indeed, the depiction of violence is truly sickening in Laugier’s film and undisputedly rivals the gore of slasher film such as Hostel (2005), The Texas Chainsaw Massacre (1974), House of 1000 Corpses (2003) or Saw (2004). But there’s something more about Martyrs that doesn’t allow the viewers to forget about it for days. It’s the feeling of immense emptiness and numb darkness it evokes. What the film does successfully is inflect humans interiority with something that we escape from the moment our subconscious is formed, something beyond kitchen nihilism and its radical scepticism: the nothingness, the void, the primal blackness . Martyrs reminds us of this eternal nothingness, the one that exists before we are born and after we die. Therefore, the film courageously addresses the illusion that Western cultures feeds itself with while trying to escape from thoughts of the void. Martyrs brutally exposes these lies and confronts the viewer with the horrors of contemporary Western civilisation manifested in the film’s universe. In an interview with Virginie Sélavy, Pascal Laugier (2009) revealed the genesis of Martyrs and the main motifs that were in his focus:\n\n&gt;The film is a personal reaction to the darkness of our world. And I like the paradox within horror film: take the worst of the human condition and transform it into art, into beauty. It’s the only genre that offers this kind of dialectic and I have always found this idea very moving – to create emotion with the saddest, most depressing things in existence. I’ve always felt that horror was a melancholy genre.\n\nRomanticising violence is one the defining characterise of New French Extremism. Martyrs’ violence, despite being overwhelming, graphic, and extensive, is also intimately erotic. Moreover, it doesn’t provide catharsis or the peculiar pleasure of following well known narrative mechanisms as most horrors do. Instead, it destroys all familiar schemes as it takes aim at what holds Western civilisation together: capitalistic values, the inability to confront the shameful past and guilt it creates, and politics organised in favour of those in power. Martyrs is not a film designed for mindless escapism. In contrast, it doesn’t allow the viewer to relax even for split second, the tension is constant, omnipresent, and multilayered. It is not based on cheap generic techniques such as jump scares or a high dosage of CGI effects combined with thoughtless bloodshed. The critics who consider Martyrs as ‘kind of all-torture-all-the-time movie’ ( Ebert, 2016) choose to ignore its ambitious and vastly successful attempt to portray the critical state of not only French, but Western society as a whole. \n\nWhile aspiring to articulate and analyse the sensations and impression Martyrs provokes, I re-discovered Deleuze. As in the case of In My Skin, his notion of flesh, Affection-Image, Becoming, Time-Image and Schizoanalysis become extremely helpful while looking at this type of highly sensualised violence.\n\nSchizoanalysis has been grounded in the work of unconventional psychoanalyst William Reich in his 1933 book, The Mass Psychology of Fascism in which he explores the psychology of the masses and proposes that psycho-somatic structures of society are what ‘make fascism possible at the outset’ (A.T. Kingsmith, 2016). Its definition was evolving through the philosophic research of Nietzsche, Marx, and Freud, as well as Deleuze and Guattari. All of these thinkers, however, would see schizoanalysis as a revolutionary political process that seeks to expand upon Reich’s materialist-psychiatric. The schizoanalytical approach gives deeper meaning and justification to the Donato Totaro’s analysis in which he views Martyrs as ‘evoking France’s cinematic and historical past’ including the guilt and shame inflicted by close collaboration of Vichy government with Nazi Germany and France’s failures during II World War. \n\nDeleuze’s approach to schizoanalysis draws on the clinical definition of schizophrenia as proposed by Jean Laplanche and J.B Pontalis: \n\n&gt;The pathological condition reveals ‘incoherence of thought, action, affectivity’ It involves ‘discordance, dissociation, disintegration’, accompanied by detachment from reality in ‘a turning in upon the self and predominance of a delusional mental life given over to the production of phantasies’ (autism) and ultimately ‘intellectual and affective “deterioration”’ (Powell, 2005:19)\n\nMartyrs feels like the product of a troubled mind. Not just the filmmaker’s mind but the collective, social mind. It brings me back to Reich’s study of mass psychology of fascism: it is not the ‘schizophrenic’ Laugier who produced this utterly depressing vision of humankind. It is Western society, the masses, that desire and created it. \n\nThe film starts with a young, horribly abused girl escaping from an abandoned factory where she was kept by her perpetrators. The image clearly evokes the famous picture that became the symbol of Vietnam: a little Vietnamese child running from death down an apocalyptic road. As the girl, Lucie, is unable to communicate with anyone, she is transferred into psychiatric institution where she befriends Anna. The girls become and stay inseparable for another 15 years when we meet them again in even more dramatic circumstances. Lucie brutally disturbs the breakfast of a regular, wealthy family by breaking in and slaughtering them all. As she phones Anna, asking for help with cleaning the murder scene, we find out that the family were Lucie’s abusers who traumatised and tortured her and left scars on her body and mind.  The domestic space is befouled with the blood of its inhabitants. Consequently, film changes direction and becomes a bloodcurdling study of Anna’s martyrdom. The camera lingers on Anna’s beaten up body, circulating around her in hand held, shaky movements. When the woman internally lets go of any remaining ego and immerses herself in her anguish, the pace of the film changes, it slows down. Deleuze distinguishes ‘internal time of the spirit from historical one’. Therefore, in Martyrs the ‘dual nature (…) of physical and metaphysical experience are expressed through cinematography and powerful performance by Morjana Alaoui.' \n\nUntil this point the depiction of violence is graphic but not so controversial. Patricia Pisters noted the representation of violence on screen is treated dually. The first approach sees violence as immoral as well as causing and reinforcing negative social behaviour. The other one barely notices violence and inflicts it into the film’s universe as a natural ingredient. Martyrs, in contrast sees the poetry of violence as an artistic expression without judging the violence itself through the eyes of a socially constructed God. Deleuze claims that ‘there is no Good or Evil in Nature in general, but there is good and sadness, useful and harmful, for each existing modes’ (Pisters, 86).\n\nMartyrs illustrates this view by breaking the narrative structure and drastically changing the premise of the story. The film starts as the revenge slasher horror with viewer identifying with Lucie and justifying her brutal murder. That certainty, however, is questioned while Lucie’s mental state worsens. We are not convinced anymore if Lucie took the lives of the right people. The situation gets complicated when Lucie’s guilt manifests itself through a Freudian monster of the id, the Creature that haunts the woman and inflicts serious physical injuries and eventually causes Lucie to kill herself. In this moment, the story takes an unexpected and drastic twist that evokes Hitchcock’s murder of his heroine in the first part of Psycho that truly traumatised the viewers. After Lucie’s death, it is her ultimately devoted friend Anna who becomes the film’s focus. While she tries to escape the murder scene, she discovers the basement in which a battered and tortured woman is kept. From this moment, the violence that will unfold in front of our eyes will be beyond judgement. In another selfless, desperate attempt to help a human being, Anna is caught by the sinister organisation lead by Mademoiselle (Catherine Bégin). The group catches and tortures young woman to the point when, through intense suffering, they will be able to experience a transcendental vision which will reveal what is waiting for us in the afterlife. \n\nThe most traumatic image in the film is that of Anna, resembling a laboratory-created Christ, after being skinned alive. Her martyrdom transformed her into an archaic body-without-organs, ‘mutated beyond fixed gender oppositions’ (Powell, 2005: 79) exhibiting the flesh: the deepest hidden ‘I’. The ‘true’ body that is replaced by the dominant system’ through an ‘organised body on which God can exercise his judgement’ (Powell, 2005: 78). Interestingly, the fact that Anna’s face wasn’t skinned serves as an alluring analogy to earlier French horror that evokes France’s war traumas - Les Yeux sans Visage (Eyes Without A Face (1960)) - in which Christiane was robbed of the skin from her face. According to Anna Powell, ‘skin is the most sensitive bodily organ and the facial features it covers are most intimately connected to our social self of selfhood (…)’ (2005:147). Would that be a hint provided by film for the audience that the martyrdom Anna endured was not full, not real? Would that mean that she lied to Mademoiselle in order to stop the vicious cycle of violence? That may indicate that the real martyr was in fact Mademoiselle, who died to keep alive the organisation she dedicated all her life for. This is, however, only one of many possible interpretations of film’s ambiguous ending. There were rumours that the real reason for Martyrs’ enigmatic conclusion was the lack of funds and time to finish the film as initially planned. Whatever the cause, the ending provides an invitation to further debate, and moves the real meaning of this disturbing film from destination to the journey that the viewer experiences. \n\nThis article only slightly touches the motifs, symbols, and allegories hidden in Martyrs. There is still so much to say about the racial and gender issues of the film but my main aim was to demonstrate the usefulnesses of Deleuze’s thought in order to decrypt the films of New Film Extremism.\n​\nIf you guys enjoy this one, next week I am going to continue using Deleuze’s ‘neo-aesthetic’ philosophy to explore cinematic extremes in Gaspar Noé’s Enter The Void (2009).\n\nIf you want to read an expanded version of this, or various other pieces I’ve written [you can find them here](https://www.filmosophy.co.uk/home.html) ",
        "created_utc": 1534038224,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking out movies like Lobster, Coherence, Lost in Translation, Chungking",
        "author": "deersloth",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96l0jg/seeking_out_movies_like_lobster_coherence_lost_in/",
        "text": "[removed]",
        "created_utc": 1534031513,
        "upvote_ratio": ""
    },
    {
        "title": "Film to check out: The Other Side of the Underneath (Film Discussion as well)",
        "author": "TakedaKershaw",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96kok9/film_to_check_out_the_other_side_of_the/",
        "text": "The Other Side of the Underneath is a British surrealist film by Jane Arden and I believe it was the only female directed film in the UK during the 70s. The reason I have decided to make this post, is to make this fantastic film aware to you guys as it is quite obscure with only 263 views on letterboxd. If you are a fan of surrealist cinema with disturbing visuals then this is definatly a film I would recommend. This films main theme is mental illness and it feels like you are witnessing a nightmare. It was a really captivating watch and stylisticly it felt very disorientating. I have truly never seen anything like it and would urge any fan of weird and unusual films to give it a watch. If you decide to watch the film feel free to post your thoughts in the comments, i'd love to hear your take on the film!",
        "created_utc": 1534028519,
        "upvote_ratio": ""
    },
    {
        "title": "Tom Ford's second film was otherworldly yet relatable",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96jlch/tom_fords_second_film_was_otherworldly_yet/",
        "text": "I know Nocturnal Animals gets some love, but I rewatched it and found it more enjoyable the second time round. Susan and Edward are like the parts of ourselves that we wrestle with - caring about money/lifestyle, or being idealistic and wanting the creative gamble. That being nice can conflict with being strong, and also that once one is legitimately strong they are no longer available for you. Themes of being forgotten, and wanting the last laugh. I liked that the violent deaths of the literary family was a similar kind of death in divorce. I do wonder if Tom Ford felt like people had left him after he finished his main fashion design work, and wanted to triumph in his pure creativity of filmmaking. In any case a lot of people were just saying 'lol what's tom gonna do now after Gucci'.\n\nI do especially like his very stylised settings. It makes the character of Susan seem like an ascetic, but of course she has all the human qualities of dissatisfaction and disillusionment with work and her new guy.\n\nFelt like a cautionary tale of who we choose to be and how we shape ourselves.",
        "created_utc": 1534019227,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone help me find a copy of Eureka (2000), A.k.a. Yurika in Japanese?",
        "author": "blackblackbody",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96i9um/can_someone_help_me_find_a_copy_of_eureka_2000/",
        "text": "[removed]",
        "created_utc": 1534008607,
        "upvote_ratio": ""
    },
    {
        "title": "The Academy Announces New Award for “Best Popular Film” – My Thoughts",
        "author": "cacb3995",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96hkb6/the_academy_announces_new_award_for_best_popular/",
        "text": "You’ve probably heard that a few days ago the Academy of Motion Pictures Arts and Sciences announced some changes to their regular Oscar agenda, the most significant one being a new category to award outstanding achievements in “popular” films. Though it hasn’t yet been made clear what the factors that’ll be taken into account for this award, many seem to believe that it will basically look at box office numbers. This has been met with a good amount of criticism from casual film goers, film enthusiasts and real cinephiles, and I must say I agree with most of them. There’s a lot to be said about this new development -and hardly anything positive. I was planning on doing a new review after my last couple of LOTR articles, but this bit of news is really worth discussing.\n\nFirst of all, we have to try and understand the reasoning behind this decision on part of the academy, and it may not be as complex nor surprising as one may think at first. People have called this as an attempt by the academy to stay relevant with the times, since they’ve been losing viewership exponentially for quite some time now, so this might be read as a misguided attempt to cater to a wider demographic of film goers, who might not be really interested in the Oscars because their favourite films, like the latest “Star Wars” or “Avengers”, weren’t really in contention for anything “important”. But if we look a little deeper the pictures grows a little darker. There’s a reason a used the two examples above, and not mainly because they’re probably the most popular franchises right now, but also because they’re owned by the very same company. See, the official broadcaster of the Oscars in the US is ABC, and can you guess which mega company owns it? Exactly, the house of mouse. There track record with the Oscars isn’t really impressive, besides technical categories and Pixar’s domination over the Best Animated Picture category. They’ve only been nominated twice for Best Picture this century, for “Up” and “Toy Story 3” back in 2009 and 2010, respectively, and that was after the format was exapanded to ten elligible films. So this move by the Academy does feel like an attempt to create a consolation prize that would rather be used as a adevertisement for films that are already turning in billions at the world box office.\n\nhttps://breakingthefourthwallsite.wordpress.com/2018/08/11/the-academy-announces-new-award-for-best-popular-film-my-thoughts/",
        "created_utc": 1534003055,
        "upvote_ratio": ""
    },
    {
        "title": "What are some great performances in otherwise mediocre/bad films?",
        "author": "auditormusic",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96hhmj/what_are_some_great_performances_in_otherwise/",
        "text": "I have rewatched Shaft (2000) countless times simply for the excellent performance by Jeffrey Wright as \"Peoples\" Hernandez. https://www.youtube.com/watch?v=Z_dQOIrGhwI\n\nThe movie is laughably bad in some areas, and never rises above \"ok\" anywhere else, in my opinion. The original is much better by most accounts, and even though Sam Jackson and Christian Bale are very skilled actors, they don't exactly bring much more than phoned in performances in Shaft. \n\nWhat are some other great performances in films that you don't think are very good?",
        "created_utc": 1534002473,
        "upvote_ratio": ""
    },
    {
        "title": "Great performances in otherwise mediocre films",
        "author": "auditormusic",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96hfak/great_performances_in_otherwise_mediocre_films/",
        "text": "[removed]",
        "created_utc": 1534001971,
        "upvote_ratio": ""
    },
    {
        "title": "I watched In the Mood For Love and I have a question.",
        "author": "thiha9ng",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96ggm7/i_watched_in_the_mood_for_love_and_i_have_a/",
        "text": "[removed]",
        "created_utc": 1533993241,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Tom Cruise and the Mission Impossible franchise",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96for6/thoughts_on_tom_cruise_and_the_mission_impossible/",
        "text": "[deleted]",
        "created_utc": 1533984117,
        "upvote_ratio": ""
    },
    {
        "title": "Donnie Darko: a look at its messages and themes",
        "author": "nola-vanella",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96b9ng/donnie_darko_a_look_at_its_messages_and_themes/",
        "text": "I really recently just watched Donnie Darko and I was super blown away by it. I loved the movies originality, atmosphere, and complexity. All of the characters were interesting and I cared about them. Particularly the acting from Jake Gyllenhaal was truly amazing.\n\nThe reason why I’m making this post is to examine the message and themes of Donnie Darko. Because the plot in itself is so complicated, I feel people are too focused unraveling that to really talk about the actual themes and message of the film. Usually, looking up the analysis of a film would reveal its message and meaning. But doing that with this film only lead me to websites talking about the time travel aspect of the movie. \nThis is my first watch of my film, so I think I still need to pick up on a lot. What I saw was a theme of isolation and selflessness. \n\nDonnie starts out as an isolated, resentful kid who’s cold towards his family - even calling his mother a bitch solely because she calmly corrected him for rude behavior. He also discusses with his therapist about dying alone, saying he fears it but also feels it’s unavoidable. I found this interesting as Donnie is quite clearly the cause of his own isolation as a result of his antisocial, cold behavior. He hates being so alone, but is also the cause behind such loneliness. \n\n\nI think selflessness/sacrifice is another theme present in the film. \n\nDepending on which theory you follow about the time travel stuff, it can be interpreted that Donnie willingly allows himself to be killed by the jet engine that falls through his bedroom. \n\nI also noticed that when Donnie and Gretchen are exiting the theater, the camera clearly focuses on the movie titles. While most are Halloween based, there’s also the movie title of “The Passion of Christ” - which isn’t a Halloween-y movie at all. I feel this was sort of foreshadowing of Donnie, a chosen person given special gifts who ultimately has to sacrifice himself. \n\nHis mother also embodies this theme. Rather than be resentful of her son for his issues or his various outbursts, she completely loves him and accepts him - even saying “it’s wonderful” to have a wacko son. She sacrifices her reputation and a life of normalcy in exchange for being a loving mother to Donnie. \nJim Cunningham, meanwhile, is the opposite of selfless. He poses as this wise, benevolent motivational speaker, when in reality he’s a pedophile who uses motivational speaking to mask his darker issues. The same can be said about Kitty Farmer, who is a dance coach that isn’t looking for the girls best interests but is only caring about them succeeding and her living vicariously through them. \n\nUltimately, these themes of isolation and sacrifice connect to form the theme of “destruction leads to creation”. In the ending of the film. Donnie is afraid to die alone, but seconds before being hit by a jet engine - he starts laughing. He is dying alone, but he’s doing it for a selfless cause - one that will save Gretchen and everyone else he loves. In his destruction, he’s leading to the “creation” of everyone else continuing to live. The idea of “destruction leads to creation” is also discussed in Donnie’s literature class. \n\nDo you guys agree? What else did you guys pick up on? ",
        "created_utc": 1533938319,
        "upvote_ratio": ""
    },
    {
        "title": "The Crescendo of Whiplash",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96b96p/the_crescendo_of_whiplash/",
        "text": "https://i.redd.it/k3o6st1gccf11.png\n\nThis is the first time I have ever written a two-part article, but this film deserves it. For the first part, I will be discussing the rising action and build up to the latter half of *Whiplash*.\n\n[https://thefilmera.com/2018/08/10/film-frame-friday-whiplash-crescendo/](https://thefilmera.com/2018/08/10/film-frame-friday-whiplash-crescendo/) link for all the pictures and videos\n\nI will never forget how amazing 2014 was and I owe that largely to *Whiplash*, written and directed by Damien Chazelle. The funny part is Miles Teller’s involvement is what made me so invested in this film. I loved him in T*he Spectacular Now* (2013), so when I heard about *Whiplash* my heart fluttered.\n\nI honestly can’t get enough of *Whiplash*, and the soundtrack is stuck in my head. I must apologize in advance if this article detours into my love for this film instead of a strict analysis. After all, I never know when I will get to write about my second favorite film of all time again.\n\n*Whiplash* is simple to summarize: it is about the abusive relationship between a jazz student (Miles Teller) and his instructor (J.K. Simmons). That is honestly all you need to know going into this film.\n\nThe movie starts with a bang, as we are ushered into our first meeting between Andrew Neiman (Miles Teller) and Terrance Fletcher (J.k. Summons). Fletcher walks in on Andrew playing the drums and tells him to keep playing because he is looking for drummers. The framing and contrast between the two are brilliant in this scene. The weak, inexperienced, and youthful Andrew wearing white, and the experienced, stern, and powerful Fletcher wearing black. From the start, we see timidness and uncertainty in Andrew, and the downright dominance Fletcher oozes. Of course, Fletcher is unimpressed and walks off angrily. Here begins one of the most abusive relationships between student and master to grace this decade of film. Andrew now has something to prove and will go to any lengths for recognition.\n\nLater on, Mr. Fletcher himself walks into Andrew’s class recruiting students for his studio band. His presence creates an atmosphere of intense pressure. Everyone knows Fletcher is the big dog on campus and the man who can fast-track them to success. For Andrew, this is his second chance to pursue his dreams of being a drummer. Of course, when Andrew is asked to play again, he is stopped within seconds. When it feels like all hope is lost, Fletcher starts walking away and says “Drums with me.” Andrew is now invited to practice with the real players, and the look of happiness on his face won’t last. I love this scene because the framing and editing clearly show that Fletcher is in command, and everyone is there at his whim.\n\nThere is one phrase in this film that is so iconic that the scene is named after it:”Not quite my tempo.” When anybody asks what is *Whiplash* about, or why this film so great at what it does, show this them scene. Not only is it the first major scene in the film, but it also, no pun intended, sets the tempo for what is to come. The scene begins the way most classes start: the instructor walks in and happily greets his class, wishing for a productive day. The audience and the veteran students in the room know what Fletcher is, but Andrew believes in Fletcher’s sincerity.\n\nThere is a whiplash effect when Fletcher goes from nice and easy-going to drill sergeant within minutes. Fletcher’s physical body is terrifying; it makes him look like an instructor and nightclub bouncer combined. The way he quietly walks up to the other characters is like a predator circling prey. When Andrew can’t quite hit the tempo, Fletcher throws a chair at Andrew. The editing is fascinating here because when the chair is thrown the camera actually shakes as if we were hit by the chair. Fletcher gets up close and personal to Andrew again like that of a drill sergeant and repeatedly ask him “Are you rushing or dragging?” This moment is powerful because the camera zooms in on them and captures the downright fear of Andrew. When Andrew can’t tell the difference he is slapped several times and asked: “Am I rushing or dragging?” The scene only intensifies as Fletcher gets more and more personal. His barrage of insults drives Andrew to tears. When it is all over, Fletcher goes right back to his stand and resumes practice as if nothing happens.\n\nThere are key framing moments that are vital in this scene. One is the up-close camera work at play, which takes us from a room of people to just two within moments. The second is how the camera uses the actor’s physical position and posture to set a tone. Fletcher standing over Andrew or having his arms crossed gives off the sense of immense pressure on Andrew. When Fletcher rapidly or throws a chair it is startling and outright fearsome. Chazelle does this by moving the camera as a reaction to Fletcher instead of Fletcher moving with the camera. This shows how dominating Fletcher can be; even the camera is moved as if frightened by Fletcher.\n\nThank you for reading and don’t forget part two of this article next Friday, where I discuss the latter half of the film and analyze the framing of one of my favorite endings of all time.",
        "created_utc": 1533938227,
        "upvote_ratio": ""
    },
    {
        "title": "Theatre vs photographic style",
        "author": "omg_itsa_throwaway",
        "url": "https://www.reddit.com/r/TrueFilm/comments/96a9ng/theatre_vs_photographic_style/",
        "text": "Sorry for having a hard time to put this into words.\nTL;DR: Looking for other directors that fit the more \"photographic\" or \"audiovisual\" approach of directors such as Kubrick and (to a certain degree) Lynch\n\n\n\nI am sorry if some of the following sounds biased. I tried to make it as non-biased as possible, but as someone enjoying the \"photographer\" over the \"theatrical\" approach, there might be innate bias.\n\nDirectors come from all sorts of life. Certainly, the have different background that influence what they emphasize in their movie-making, and what components they feel most at home at.\nI want to make the distinction between photographers and \"theatricalals\".\nThe theatricalals come from a background of \"classical theatre\": they tend to focus on dialogue and how the interaction between characters drives the plots.\nThe photographers have a more visual approach. They will value how the scenery is set up to reflect the framework in which the actors are bound to the world that influences them.\n\nA theatrical director will focus on the inner life of his actors, and will reflect their inner state by means that are appropriate to theatre plays, that is, reflect them in dialogues with other characters, or (very occasionally) as monologues.\nNaturally, almost all theatre-style movies will focus on certain specific persons and their struggles or development.\nA photographical director will reflect actions and narrative by using visual cues; the environment of a character, and the staging as a (moving) picture, are consindered as important, if not more, as the action and dialogue of the characters.\n\nExamples of the theatrical approach, in my mind, are directors such as Bergman and Wilder, and to a certain extent, even Kurosawa or Hitchcock. For as different as they are, they focus on their specific characters and their dialogue to create tension and make their point.\nExamples of the photographical approach (again, in my mind), are Kubrick and Lynch. Many of their films feature ensemble casts, and even if they feature strong main characters, the point seems to be more on the environment and how they interact with it.\n\nPhotograhic actors tend to favor a shot that with theatrical actors is very rare: the very long observing shot. Dialoge is secondary. The waltzing spaceships of 2001, the duel scenes in Barry Lyndon, the long scenes without dialogues in Mulholland Dr.\nThere is also a tendency to mix photography and music: as dialogue's importance wanes, music fills the void, either as music that accompanies the visuals and produces and audiovisual appeal, such as the spaceship scenes in 2001 (where the occasional absence of all music forebodes disaster), or Lynch's almost fourth-wall-breaking use of music that appears to be background, but gets yanked into the diegetic reality, like \"In Dreams\" in Blue Velvet and \"Llorando\" in Mulholland Dr.\n\nLong story short:\nAfter watching a bunch of films, I feel like I connect more to the \"photographic\" approach. I adore the synesthetic approach when visuals and music meld together. I feel like dialogue is an almost clumsy way to reflect state and progression in a film, compared to the more audiovisual representation of the environment independent of actors and their interaction. \nI enjoy well-made \"theatrical\" movies.\nBut I enjoy well-made \"photographical\" movies even more. I connect to them more, find more profoundness in them.\n\nSo I'm looking for more quintessential photographic directors to watch.\n\nThanks for suggestions!",
        "created_utc": 1533930953,
        "upvote_ratio": ""
    },
    {
        "title": "The Stigma of Anime",
        "author": "toyismyturtle",
        "url": "https://www.reddit.com/r/TrueFilm/comments/968nqk/the_stigma_of_anime/",
        "text": "So I was frequenting r/criterion and I saw a thread for release of Perfect Blue by Satoshi Kon through some other publisher. I am someone who thinks that Perfect Blue is eligible to be given the Criterion treatment. It's out of print, before it never had a Blu-Ray version outside of Japan I think, and it's generally a movie that has favorable reviews and background history. Darren Aronofsky apparently owns the movie rights and ended up creating \"Black Swan\" which has a direct homage and in general very similar themes to Perfect Blue.\n\nOn r/criterion the idea of giving Perfect Blue I think is generally favorable but I want to say in a larger scale people generally don't appreciate anime as a form. Let me say right now I'm not someone who lives the anime lifestyle in anyway. I enjoy a series here and there that's well made and thought out, to me it really is just another form of filmmaking to enjoy and experience. I do think there is a lot of potential in anime that is overlooked. First of all I see a lot of it as an extension of Japanese cinema and a direction it took. Obviously it has a lot of cultural influence that we see through video games, American TV shows and like I said something even critically well recieved like Black Swan finds its source in anime.\n\nI think anime and in general animation is an interesting medium because it allows for more creative freedom that live action cannot emulate. The reactions, how the characters act, certain styles of story telling. I'd imagine something like the series FLCL couldn't be given a live action treatment without it just coming off really offbeat weird. But it's through animation we're able to accept that universe for what it is and it's able to tell its story through it's own unique techniques with minimum distractions. Not that all anime utilizes techniques like that because something like Gundam, Perfect Blue or even Attack on Titan is grounded in a lot of realism which I think will translate. But it's the idea that there is form of filmmaking that is able to utilize an immense amount of creative freedom that I think is amazing.\n\nBut it seems like outside of anything directly associated with Studio Ghibli, anime finds itself unable to really be taken seriously at all. There's been numerous times where a very well crafted anime story will not even be nominated by the Oscars. Some say it's cause the voters are out of touch with that realm of cinema. Others say it's just because animation in general is still viewed as a medium for children which isn't entirely untrue. But at the same time I think with the rise of comic book movies (another medium that was considered childish for the longest time), we see something like an R-rated Logan and its given a certain amount of fair treatment in being evaluated as a story in itself which I think anime lacks at least in Western audiences.\n\nI say anime specifically cause honestly I can't think of a single Western produced animated movie or series where it's not geared towards children entirely. I mean you have stuff like Sausage Party but that only mocks Pixar's content. Pixar in itself has really done amazing work in creating very layered stories but ultimately they are still very much child orientated just with more universal appeal. There's plenty of anime that is absolutely not child orientated.\n\nI'm 28 right now and I remember when Pokemon crossed the seas. It really took the whole world by a storm. It opened up the floodgates of anime to a western audience. People picked up different animes like Dragon Ball Z and Gundam Wing then Toonami/Adult Swim really pushed different more serious forms of like Cowboy Bebop and Initial D to a certain audience. I'd argue this was largely culturally successful to a lot of the younger generation, maybe I'm unable to see it from the other side but I do think that a lot of people in my generation are able to see anime as something more than child's show.\n\nI'll be candid with the cons of anime which I think holds it back. The culture that surrounds is at times very strange and childish. It's hard to disassociate anime and it's fandom of people who wear Naruto headbands. It's got a lot of nerdom and while that's certainly more acceptable these days with the popularity of Star Wars and Marvel.. not to that extent I think. Not to hate on it's culture in anyway cause I think a lot of is very positive and even though a bit strange, welcoming to that strange which I think reflects the nature of anime in itself.\n\nHentai is also another big thing. Because of the very open ended nature of anime and it's ability to be adult orientated, it's also created it's own form of pornography which is very much taboo and itself and naturally associated with anime culture. Then you have the further reaching aspects of hentai like tentacle porn and lolis. Which the argument can absolutely be made that this can only exist in anime because of the open ended nature of it's form and community.\n\nThere is an underlying notion that keeps anime from being taken seriously cause the noticable community comes off largely childish and some parts even depraved. I guess the questions is, will there be a time where anime is seen as an extension of what Japanese cinema became and not some fringe aspect? We see a huge drop off what Japanese cinema was after the Kurosawa and Ozu time and we don't see anime as something that has taken it's place.\n\nWill it ever be taken in a more seriously light? I personally suspect as people my generation get older and take over the power positions of media, a lot of us will be more open to it. Will the community ever grow up and be able to be taken seriously? Or because of it's very nature, will anime always be dominated by fringe figures who dress up like cat school girls. Cause I can't see something like steampunk being taken seriously outside of it's own community which I think anime can relate to but at the same time anime has much more growing and change potentional than something like steampunk. I just want to hear your thoughts and see where this discussion goes.",
        "created_utc": 1533919925,
        "upvote_ratio": ""
    },
    {
        "title": "The Usual hint",
        "author": "gurnflurnigan",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9684lp/the_usual_hint/",
        "text": "[removed]",
        "created_utc": 1533916404,
        "upvote_ratio": ""
    },
    {
        "title": "Need some info about Takeshi Kitano's work",
        "author": "Hideo-Mogren",
        "url": "https://www.reddit.com/r/TrueFilm/comments/967fnw/need_some_info_about_takeshi_kitanos_work/",
        "text": "Hi r/TrueFilm\n\nI am writing a report on Takeshi Kitano's work, and would like some know some infomation about very apparent Japanese cultural influences in his films? I'm planning on discussing Sonatine and Dolls, since those are some more popular examples.\n\nI know that Noh theatre comes into play, and it's sort of like method acting, though I'm not sure how to put it into words. Also, I'm aware of the concept of \"ma\", but I don't know to really explain it. Maybe I could bring up the concept of \"mono no aware\", but maybe I'm losing track at this point.\n\nI would very much appreciate the help. ",
        "created_utc": 1533911569,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (August 10, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9679zq/casual_discussion_thread_august_10_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1533910425,
        "upvote_ratio": ""
    },
    {
        "title": "How Jean-Luc Godard Liberated Cinema (Video Essay)",
        "author": "[deleted]",
        "url": "http://youtu.be/JZGLhgW6Rwc",
        "text": "[deleted]",
        "created_utc": 1533906400,
        "upvote_ratio": ""
    },
    {
        "title": "Sports movies Tropes - Who started the \"new uniforms\" trope?",
        "author": "_AO_",
        "url": "https://www.reddit.com/r/TrueFilm/comments/963rvz/sports_movies_tropes_who_started_the_new_uniforms/",
        "text": "[removed]",
        "created_utc": 1533875012,
        "upvote_ratio": ""
    },
    {
        "title": "BEYOND HUMAN (Full Movie)",
        "author": "samboshard",
        "url": "https://youtu.be/uhp6RRgiHlU",
        "text": "",
        "created_utc": 1533859797,
        "upvote_ratio": ""
    },
    {
        "title": "Do you advice someone to learn about a movement before watching a film from a director in that movement?",
        "author": "Asumos",
        "url": "https://www.reddit.com/r/TrueFilm/comments/960wbw/do_you_advice_someone_to_learn_about_a_movement/",
        "text": "In advance excuse my English. It’s not my native language.\n\nI’m wondering if it’s better to learn about a movement beforehand. Maybe you “get” the film , but is getting a film want you want out of a film? Is it even possible to fully understand a film? I’m dwelling off. The 3 possible experiences are vastly different (watching without knowing the movement at all, watching with knowing the movement exists, watching with knowing the ideas/ideologies  of the movement). Maybe the “best” experience vary between different movements, Maybe for French new wave the third option is the most pleasureful, Maybe for German impressionism going in without any knowledge is the best option? Maybe not. I don’t have answers only questions. I’m not searching for answers because it can differ between people, its a personal matter. But i’m intrested in ideas and discussion to learn not to win.",
        "created_utc": 1533851794,
        "upvote_ratio": ""
    },
    {
        "title": "The Women of The Godfather",
        "author": "OliveBranchStudios",
        "url": "https://www.reddit.com/r/TrueFilm/comments/960us4/the_women_of_the_godfather/",
        "text": "So this is been a question that I have been bumping around in my head for a few months now, but does anyone else think that the female characters in the Godfather (I'm just talking part I and II here) were grossly under utilized? I mean Connie was more of a plot device than an actual character and Kay primarily served to echo the sentiments of the segment of the audience unfamiliar with Italian-American culture. To go even further, I think of how in the Godfather part II, Carmela Corleone (wife of Vito) was one of the few characters to extend from the prequel to the sequel and yet she had no more than 10 minutes of screen time. I do not think this is an attempt to capture the different attitudes towards women at the time because there is honestly nothing more sacred to an Italian than his mother. \n\nBut anyway, just wondering if anyone has anything thoughts/insights on this; I haven't really found too much mention in regards to this in any professional reviews, so I'm just curious what other people think. ",
        "created_utc": 1533851481,
        "upvote_ratio": ""
    },
    {
        "title": "I think Notebooks on Cities and Clothes is Wim Wenders most under appreciated documentary.",
        "author": "TakedaKershaw",
        "url": "https://www.reddit.com/r/TrueFilm/comments/960r2r/i_think_notebooks_on_cities_and_clothes_is_wim/",
        "text": "After binge watching four of Wim Wenders documentaries I must say that I feel like Notebooks on Cities and Clothes is extremly under apreciated. Its current average on Letterboxd is 3.4 but I ended up giving it a 4.5 as I thought that it was so well put together and so well executed. Because i'm lazy I will just post my review from letterboxd, I hope that I can make some people appreciate this film more as I feel like it deserves it. \n\n\"Wow this film seriously blew me away, I found it so emotional and so cleverly crafted that I couldn't help but love it. I am so suprised this movie isn't loved or hailed as one of Wim Wenders best documentaries because it is so clever and is filled with passion and emotion. For anyone who knows me they know I have no fashion sense or even the slightest intrest in fashion, my wardrobe consists of black jeans and skull t-shirts that you find for a tenner in cheap markets. \n\nYet this film really encapsulated my intrest, and I think it's because this film is so much more than what you see on the surface level. On the surface this is just a film about a fashion designer and the process of designing clothes, but I feel this film is so much more than that. This feels like a movie talking about identity the human condition, how clothes change a person and coming to terms with change. \n\nI liked how I was made to feel intrested by Yohji and his craft because of the parallels created by Wim. He presented Yohji as an artist like himself someone so dedicated and passionate about his craft that he works night and day to make the best product possible, and I think that sentiment applies to all crafts. I feel like we learn with Wim about the intrinsic artistry that goes into fashion and how many of the emotions and thought process that goes into the clothing reflects the mind set of the film maker.\n\n I loved all the talks between Wim and Yohji about the nature of people and how clothing and technology has developed and changed over the years with Yohji showing how clothing has changed through the book of people photographed in the 19th century and how their clothing reflected their profession instead of individualistic expression, and Wim showing how cameras have evolved from celluloid cameras that have a feeling of intrusiveness to video cameras that have a more natural feeling.\n\n I also loved the beginning when Wim was talking about originality and how throughout the film we caught glimpses of his fear of the future and how he feared that an art would be lost in the digital age and him wondering weather digital artistry would be something that would come about in the future. \n\nI also loved how this fear of the future contrasted with Yohji's mindset of living in the present and working as hard as you can in the present without fear of the future. Once again Wim made this documentry have such a personal feel to it.\n\n It dosen't feel manufactured or emotionless like alot of documenteries but instead felt emotional and personal like we were going on a journey with Wim and seeing how his perspective changed along the way. I thought it had a very chilled out atmosphere. I especially loved the scenes of Wim and Yohji talking casually whilst playing a game of pool it felt really natural.\n\n I also loved how it was filmed it felt very experimental, especially the shots of Yohji on a little monitor Wim is holding whilst the rest of the camera is showing him drive around the city. I didn't expect that a style like that could work but instead it heightened the emotion and made it feel all the more real like we were sat with Wim as he was filming. \n\nThe composition was stunning, some of the exterior shots of Tokyo and Paris were absoloutly gorgeous and in some cases took my breath away. That soundtrack was kickass as well, the main theme was so good I had to go and download it straight away!\n\n I think this film is a truly under appreciated gem and may even overtake Tokyo GA in my eyes as being the best Wim Wenders documentry, I would suggest anyone to watch this movie and keep an open mind because this one is so so so much better than most people give it credit for.\"",
        "created_utc": 1533850787,
        "upvote_ratio": ""
    },
    {
        "title": "What are the \"Tasteful Palette\" time periods for cinematography?",
        "author": "therealbeezer",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9606gz/what_are_the_tasteful_palette_time_periods_for/",
        "text": "If anyone listens to the Apple Beats 1 podcast Time Crisis with Ezra Koenig from Vampire Weekend, you know co-host Jake is adament about the tasteful palette of the early 70s. Meaning, production styles were at a peak due to their tangible recordings and crisp layering. \n\nDo you consider there to be time periods of \"tasteful palettes\" when it comes to cinematography? If so, list the criteria:\n\n* Year of general origin to year of general conclusion \n* Notable films in this period\n* Characteristics of period ",
        "created_utc": 1533846829,
        "upvote_ratio": ""
    },
    {
        "title": "Picnic at Hanging Rock (1975) - The atmosphere is the film.",
        "author": "MellotronSymphony",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9603e7/picnic_at_hanging_rock_1975_the_atmosphere_is_the/",
        "text": "One of the most common criticisms I've seen of Peter Weir's acclaimed 1975 drama/mystery *Picnic at Hanging Rock* is that it has no resolution.  \nA group of schoolgirls picnic at a mysterious and ancient landmark in the Australian wilds - Hanging Rock. Four girls take a walk up to the top, but only one returns. The other three were seen to enter a bizarre, almost trance-like state, and wander off out of sight - never to be seen again.  \nThis is the central premise of the film, and the novel from which it is based.  \nThe film unravels at a slow pace, with pieces of the mystery slowly being revealed as it goes on. However, the greatest mystery of all - what actually happened to the girls - is never revealed. Some criticism I've read reacts negatively to this, and I can understand that to an extent. After all, having invested yourself in the story you want some kind of explanation. But it depends really on how the film is made and what you are expecting coming into it.  \n    \nPeter Weir is clearly far more concerned with the strange, supernatural qualities of the source material. Joan Lindsay obviously has some kind of weird connection to Hanging Rock (I believe she conceived the plot after a number of strange dreams about the place, and many elements of her book emphasise the weirdness of the place). In fact, while the actress playing Miranda (Anne-Louise Lambert) was taking a walk in the woods during a filming break, she found herself being pursued by the book's author, who proceeded to embrace her in a state of high emotion, exclaiming \"Oh, Miranda!\"  \nEven the film's producer, Patricia Lovell, admitted to being so frightened by the rock that she has only revisited it once, and has vowed never to return.  \n  \nSo the mystery of the girls' disappearance is obviously linked to some inexplicable force of nature, that has the power to affect people in weird ways (in the novel, and apparently in real life). The atmosphere created by Hanging Rock *is* what the film is about. The disappearance is the premise of course, but the way it is told is what's important. Some sections of the film are hypnotically weird and eerie. A moment that sticks in my mind is when Albert is searching for Michael, who stayed at the rock overnight to search for the girls. When he reaches the top he spins round to see Michael staring at him in a state of exhaustion from a gap in the rock, and the camera zooms in with an eerie noise that could be a high-pitched note from a Mellotron, but also could be the girls' screams. It's probably the closest the film comes to a jumpscare, which is no bad thing.    \n  \nHanging Rock features more in the book than the film. At several points in the book characters think back to the rock at random moments, imagining its shadow looming over the countryside in the setting sun and whatnot. This gives the impression that it is always with them, that they are connected to it, and that it affects things even far away. An example of this in the film would be the final shot (of the director's cut) in which Mrs Appleyard's clock stops - echoing one of the weird happenings during the picnic itself.  \n  \nSo what I'm trying to say in an incredibly diffused and long-winded way is that tacking on an explanation as to what happens to the girls would somewhat spoil the story. The mystery of Hanging Rock, its inherently primeval evil and ability to make time stand still, is the actual premise of the film - the disappearance is just an occurrence in its million-year history. It feels as if any explanation would be disappointing - alien abduction is out of character for the film, and a kidnap/rape/murder too human and ordinary.  \nHanging Rock is the antagonist, and given what happens to most of the characters in the film it is about the triumph of a weird, ancient evil over the Victorian society that finds itself at odds with an alien landscape it does not understand.  \n  \n  \n  \nThere are many more fascinating theories about the film and story, and if you are interested what actually happened to the girls was explained in the final chapter of Lindsay's original draft, which her editor advised her to remove. &gt;!A weird time anomaly if I remember rightly, where the girls disappear into a hole in the rock which is then covered by a large boulder. Greta McCraw turns into a crab (!?) and follows Miranda and Marion inside!&lt;  \n",
        "created_utc": 1533846274,
        "upvote_ratio": ""
    },
    {
        "title": "Jurassic World Fallen Kingdom",
        "author": "DiamondMinerMorrison",
        "url": "https://youtu.be/zznFh53ULCg",
        "text": "",
        "created_utc": 1533844848,
        "upvote_ratio": ""
    },
    {
        "title": "Understanding \"Hiroshima Mon Amour\" (1959)",
        "author": "rx033",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95yelz/understanding_hiroshima_mon_amour_1959/",
        "text": "I watched this a few days ago and am still trying to figure out the meaning behind the film. It's a very complex film, and it's open to multiple interpretations for sure. The nature of memory and forgetfulness is a major theme I think everyone can agree on; how we tend to forget things and how they creep back into our lives later.\n\nI listened to the Criterion commentary track with Peter Cowie and I was surprised that he didn't touch on what I find to be the most significant aspect of the film: that the Japanese man is continually probing the French woman and unrelentingly forcing her to uncover the painful memories of World War II for one specific reason... so that we can ensure that an event like the war or like Hiroshima does not happen again. The pain and the suffering that we remember ensures that we don't forget the horrors of war, and thereby ensures that we don't attempt war again in the future. He wants her to accept the memory, and then move on; much like the city of Hiroshima which has events (portrayed in the film) to commemorate the victims of Hiroshima and remember the tragedy, but has since rebuilt itself and moved on. By burying the memory of her German lover and the pain she endured, she is forgetting the tragedy; he is there to help her remember, help her accept it, and live with the memory. I think all of this is encapsulated nicely in her beginning monologue (which I presume is her conscience talking) where she fears not remembering the whole point of remembering the war, \"It will happen again, a whole city lifted off the earth and back down in ashes... I need you, you're good for me... destroy me, to the point of ugliness... I need you, you're good for me.\"\n\nWhat do you guys think about the meaning of the film? Is my point valid?",
        "created_utc": 1533835031,
        "upvote_ratio": ""
    },
    {
        "title": "Fight Club and Old School and informal remakes",
        "author": "HairyDavid",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95vhih/fight_club_and_old_school_and_informal_remakes/",
        "text": "I remember reading, perhaps in an interview with the director, that *Old School* was a take on *Fight Club.*  It makes sense, both movies are about an existentially lost, broken modern man who feels displaced among society, and relearning how to be proactive and feel again with the thanks of a secret society of other men.  \n\nHonestly, as stupid as it sounds, this made me appreciate *Old School* a whole lot more.  I realized that, in addition to being funny (I admit, it's funny) it's kind of an unusual thing... a satirical take on a fairly recent movie.  \n\nThe only other thing that springs into my mind is that this year's *Game Night* was in a sense a parody of *The Game,* the David Fincher thriller from 1997.  (Jeez, what is it with Fincher and later satires of his work?  Actually, I could see a really good satire coming from *Panic Room,* *Benjamin Button* or *Gone Girl*.)\n\nDoes anyone else know of any movies that are somewhat based on others?  It's especially interesting to me if the genre is different.  ",
        "created_utc": 1533812885,
        "upvote_ratio": ""
    },
    {
        "title": "Does this film exist?",
        "author": "DrunkenFist_Lee",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95ty05/does_this_film_exist/",
        "text": "[removed]",
        "created_utc": 1533795381,
        "upvote_ratio": ""
    },
    {
        "title": "Charlie Kaufman, Spike Jonze and Michel Gondry",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95rta0/charlie_kaufman_spike_jonze_and_michel_gondry/",
        "text": "[deleted]",
        "created_utc": 1533775556,
        "upvote_ratio": ""
    },
    {
        "title": "Blood Simple: Convention and Creativity in Noir",
        "author": "BuildMyGallowsHigh",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95rel7/blood_simple_convention_and_creativity_in_noir/",
        "text": "Next to Orson Welles, the Coen Brothers probably have the most fantastic debut film of any filmmaker. Despite its low budget and inexperienced directors, *Blood Simple* is an amazingly macabre masterpiece. Undoubtedly, this is because the Coens expertly utilize the conventions in film noir to craft their film. *Blood Simple* has all the hallmarks of classic film noir with the cynical tone, world-weary characters, and dark chiaroscuro lighting, but it really stands out from other great neo-noirs like *Chinatown* and *L.A. Confidential*. Instead of a typical detective story in the seedy city streets, the Coens set their noir in rural Texas, which immediately makes for an intriguingly different setup. What really sets the film apart, though, is how it remains faithful to the noir style while incorporating more exploitative material for wider appeal. The Coens took inspiration from a string of low-budget horror films that were seeing considerable success in the early 80s. The bloodier and more violent aspects of *Blood Simple* allowed it to bring the unruly subjects of classic noirs to its fullest potential. The burial scene in particular is disturbingly brutal as it drags on and on, delaying Marty's death more and more. *Blood Simple* is one of my favorite Coen films and I love how they use the fantastic aspects of film noir to tell a wholly different, but unmistakably, neo-noir classic. \n\nI wrote a more in-depth look at the noir aspects of *Blood Simple* [here](https://thefilmera.com/2018/08/08/blood-simple-convention-and-creativity-in-noir/).",
        "created_utc": 1533772282,
        "upvote_ratio": ""
    },
    {
        "title": "I Need Help",
        "author": "FilboTheDerp",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95qrwb/i_need_help/",
        "text": "[removed]",
        "created_utc": 1533767430,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else feel that Michael Biehn (Kyle Reese) doesn't get the props he deserves for Terminator?",
        "author": "FormerMeeting",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95qf7e/does_anyone_else_feel_that_michael_biehn_kyle/",
        "text": "[removed]",
        "created_utc": 1533764858,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on the academy adding a “Best Popular Film Award”",
        "author": "mraqbolen",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95pjzf/thoughts_on_the_academy_adding_a_best_popular/",
        "text": "I came into this subreddit thinking there would already be a thread on this but I was mistaken, so here it is! I think this is really interesting in that it shows the mindset of the academy and how they are trying to “get with the times”. However, I also think it’s a bad idea and kinda defeats the purpose of The Oscars. For me The Oscars shine a light on and recognize smaller and more independent films so that they are able to grow and earn some more money while also recognizing just the best films in general. They don’t need a whole category recognizing films that already make hundreds and millions of dollars world wide. Half the films that would be nominated aren’t even that good in my opinion. (Every marvel movie). Anyway, what’s your thoughts on this?",
        "created_utc": 1533758933,
        "upvote_ratio": ""
    },
    {
        "title": "A Legend or Was It? -deserves far more recognition than it currently receives.",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95oq80/a_legend_or_was_it_deserves_far_more_recognition/",
        "text": "(Also known as *Legend of a Duel to the Death*)\n\n[https://thefilmera.com/2018/08/08/a-legend-or-was-it/](https://thefilmera.com/2018/08/08/a-legend-or-was-it/) for the amazing pics, and contrast.\n\n***A****Legend or Was It?* tells the story of the Sonobe family who take refuge in Hokkaido near the end of the Second World War. When the daughter, Kieko, turns down a marriage proposal from a war criminal who happens to be the mayor’s son, the already suspicious villagers become more and more hostile, leading to a downward spiral of violence and tragedy. The Shimizu family sympathize with the Sonobes’ plight, but when they try to help they are drawn into the conflict as well.\n\n The film opens in lush color on an idyllic valley in Hokkaido, with farmers going about their daily routines accompanied by a soaring string score. The whole affair is overly saccharine and simplistic. But then a narrator tells us that a “nightmare” occurred in this beautiful valley, one that the villagers now refuse to talk about. From the opening credits onward, the film shifts to bleak black and white cinematography, and the soaring strings are replaced by the most ominous jaw harp you’ll ever hear. \n\n The contrast between the black and white cinematography and the color that preceded it makes the film’s grit stand out that much more, almost like a reverse *The Wizard of Oz*. Fields, trees, and mountains that only a moment ago were beautiful, warm, and colorful are suddenly cold, foreboding, and full of shadows. This is the true tone of the film. \n\n At the end of the film, we are shown another brief color scene set in the present day. This bookend reminds the audience how easily the villagers have forgotten, or refused to acknowledge, the horror that rocked their peaceful valley.\n\nNot only does the juxtaposition of color and black and white emphasize the film’s tone, it also portrays the black and white portion as a flashback to an earlier time—a legend, as the title and the narrator suggest. Whether this decision was the result of artistic brilliance or financial necessity, or a combination of the two, it works marvelously.\n\n There is one particularly memorable chase scene that dramatically changes the course of the story and effectively divides the narrative into two halves. The scene begins with two people passing each other on the road, and it’s immediately tense just based on the relation between these two. The tension continues to rise to a fever pitch over the next several minutes. Rain begins to pour and thunder cracks as the events escalate, propelled by that relentless jaw harp. Then, in an instant, it’s over, and it becomes clear that the Sonobes’ situation is about to get much worse. With its impeccable pacing and execution, this is definitely the best scene in the film. \n\n If *A Legend or Was It?* has one flaw, it’s that it is too melodramatic at times, betraying the stark shift after the first scene. There are a few points—especially during the climax—where the performances become too corny, and it feels like the film is reveling in the tragedy and overtly moralizing rather than depicting it in a more detached manner, to its detriment. With a little more control in this regard, the film could have been a masterpiece. \n\n Nonetheless, *A Legend or Was It?* is still a formidable accomplishment that manages to feel ahead of its time with its bleak, brutal atmosphere, its lean runtime, its minimalist score, and its tight pacing. It’s an immensely overlooked film that deserves far more recognition than it currently receives. ",
        "created_utc": 1533753471,
        "upvote_ratio": ""
    },
    {
        "title": "what are your favorite \"critical\" youtubers?",
        "author": "CircleHideout",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95nfid/what_are_your_favorite_critical_youtubers/",
        "text": "[removed]",
        "created_utc": 1533744936,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people divide movies into epochs (the 60s, the 70s, the 80s). Are there any really any noticeable differences?",
        "author": "JusticeForA11",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95mlk0/why_do_people_divide_movies_into_epochs_the_60s/",
        "text": "[removed]",
        "created_utc": 1533739406,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (August 08, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95mcsd/casual_discussion_thread_august_08_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1533737625,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good films that explore the nature of love, relationships and break-ups?",
        "author": "JamesDorms",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95l2zz/what_are_some_good_films_that_explore_the_nature/",
        "text": "Hi, i'm going through a sad break up. And I want to watch some films that resonate with my situation haha. What are some films you've watched that deal with the nature of relationships and love, relationships and subsequent break-ups or loss?\n\nFor extra discussion, explain why you think the film(s) you've chosen do a good job at exploring these themes and ideas. or even just explain why it is the film resonated with you?\n\nI'd love to hear about some obscurer films as well. Or foreign/classic films (i.e French New Wave, European, Russian films etc) or indie films (i.e Weekend (2011) or A Single Man (2009) ) Since I know the obvious ones that are suggested are films like Her, or Eternal Sunshine of the Spotless Mind and other Spike Jones/Charlie Kaufman films. Or Blue Valentine. (But still feel free to discuss why those particular films do such a great job, and are referenced so frequently in threads like this) ",
        "created_utc": 1533726749,
        "upvote_ratio": ""
    },
    {
        "title": "What am I missing with Mission Impossible: Fallout? (Spoilers)",
        "author": "sheburns",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95kj1c/what_am_i_missing_with_mission_impossible_fallout/",
        "text": "I skydived in to this with huge expectations. The reviews were stellar and I was a big fan of the last two movies. Now, I feel like I need to take crazy pills for having a minority opinion. \n\nI don't think the movie is remotely deserving of the amount of praise it's been getting.\n\nThe original Bourne trilogy, Skyfall, Casino Royale, even The Raid and Die Hard. They are all far more compelling action movies than this! It's absurd to me that people are already calling it the greatest action movie ever made. \n\nI think it's about on par with Die Hard 4.0, which still has a more interesting premise!\n\nIt's the kind of movie that, after watching, you leave the cinema and say to your friend(s), \"Hey, that was pretty cool. Right?!\", and they agree, enthusiastically. Soon after, when you have time to reflect, you realise that it was just another heavily contrived action movie with little to no plot, sloppy dialogue and expensive set pieces.\n\nHow many times have we seen grand chases through the city of Paris? How many times have we seen bombs being defused at the last second? There were so many unnecessary (and predictable) plot twists here, and Henry Cavill was probably the most boring, monotonous villain in the franchise.\n\nThe HALO stunt didn't really impress me either, and I thought it was completely unnecessary; did they really need to jump from that high up just to land on the roof of a building? The highlight of the movie for me, was the fight in the toilet, which was exceptionally well choreographed. I'll probably forget about everything else in a few months to a year.\n\nI'm going to rewatch Ghost Protocol and Rogue Nation just to see if I have indeed gone insane for finding this possibility the weakest entry in the franchise since MI2. Maybe I've been viewing the whole series with rose-tinted glasses...\n\nDoes anybody feel the same way, or care to point out why this film is so revered? I just fail to see how it has critical acclaim.",
        "created_utc": 1533720650,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Bonnie and Clyde (1967) considered a landmark film?",
        "author": "horigen",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95k2sb/why_is_bonnie_and_clyde_1967_considered_a/",
        "text": "Bonnie and Clyde is pretty blatantly inspired by Pierrot le fou which came out 2 years earlier and it is inferior in every aspect, but especially regarding the acting and artistic merit. Yet critics praise Bonnie and Clyde for its revolutionary display of graphic violence. Roger Ebert even calls it \"milestone in the history of American movies, a work of truth and brilliance\". So I'm a bit perplexed what's happening.",
        "created_utc": 1533715127,
        "upvote_ratio": ""
    },
    {
        "title": "Don’t Worry, He Won’t Get Far On Foot",
        "author": "dcruse22",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95imha/dont_worry_he_wont_get_far_on_foot/",
        "text": "I just caught this movie at my local arthouse theater and I absolutely loved it. \n\nThe camerawork was really interesting at times. I really loved the sequences that were animated around some of Callahan’s cartoons, and I loved the music but the thing that worked the most\nin the movie for me was the acting. Joaquin Phoenix’s performances was wonderful. And Jonah Hill too, didn’t expect that from him as I haven’t seen him do any dramatic acting besides maybe a few scenes in This Is The End. \n\nI was really impressed with Hill, and Phoenix hasn’t really disappointed me ever. He’s becoming a quick draw for me because with Don’t Worry and You Were Never Really Here, he’s now starred in 2 of my absolute favorites of 2018 so far, playing incredibly different characters. He truly transforms from role to role and I’m going to be seeing any project he does going forward. \n\nI always like to listen to/watch a review about a film after I see it and I noticed none of the youtube reviewers I normally would check out reviewed it or mentioned it at all. I wonder why the movie isn’t getting as much buzz because it’s got some pretty big names and it was pretty inspiring and sobering, both literally and metaphorically speaking. \n\nOne of the better biopics I’ve seen in a long time and it’s got me very interested in the works of John Callahan. What are some other good biopics you guys would recommend and what did you think about this movie? ",
        "created_utc": 1533699935,
        "upvote_ratio": ""
    },
    {
        "title": "Gaspar Noe - Love: symbolism/analysis",
        "author": "TwoBitTyler",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95htjn/gaspar_noe_love_symbolismanalysis/",
        "text": "Sorry if this is the wrong place to ask this I’m a first time poster here. Anyways I couldn’t find any info on a certain scene that stuck with me.\n\nI’m late to the party watching the film and I’m familiar with Noe’s other works. \nMy question is their any meaning to the scene where Murphy takes the ayahuasca and the focus is on the light bulb? We see the bulb again near the end of the film.  What if all the scenes after him taking ayahuasca is just a trip? Or maybe I’m over thinking this. \n\nI would like to hear any interpretations of the film.\n\n\n\n",
        "created_utc": 1533693012,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"Sullivan's Travels\" overrated?",
        "author": "ilovetwee",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95hmt8/is_sullivans_travels_overrated/",
        "text": "I don't get it.\n\nSupposedly this film is a \"comedy classic\" but aside from some cheap/dated/slapstick jokes, the audience wasn't laughing much during the screening I went to. Didn't seem very witty. Audiences didn't like this film back in the 1940s. Should we like it now?\n\nSupposedly this is \"good writing\" but the film seems so discursive and directionless.\n\nSupposedly this is \"good film making\" but a lot of things seemed telegraphed. \n\nThis movie was trying to be a lot of genres at once. Maybe that's a sign of its genius, being torn between the tragedy of suffering and the salvation of humor but for me it just made the move seem scattered. I wasn't on the edge of my seat because I didn't know what would happen next, I was bored because the film didn't seem to be going anywhere.\n\nI think the thematic target of class and entertainment is an interesting one, but other than the heavy-handed scene where the poor people are watching Disney in the church, I didn't feel like it tied the film together much. I feel like this movie was so heady and progressive (postmodern even) in some ways but never really hit its target. (I feel like a much better movie could be made with the same premise that explored these themes more) It didn't seem to rise above \"hey-look-a-rich-guy-is-going-to try-being-poor\". And that's called shtick. \n\nAm I a philistine or is this movie grossly overrated? Prove me wrong.",
        "created_utc": 1533691454,
        "upvote_ratio": ""
    },
    {
        "title": "Big Fish &amp; Begonia - Another Animation film to talk about Truefilm",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95h5qy/big_fish_begonia_another_animation_film_to_talk/",
        "text": "**R**eleased in China on July 8, 2016, Liang Xuan and Zhang Chun’s long-gestating animation feature has finally arrived in North America.[https://thefilmera.com/2018/08/07/big-fish-begonia/](https://thefilmera.com/2018/08/07/big-fish-begonia/) for all the gorgeous stills and rating.\n\nHighly anticipated in its native China and scoring big at the box office, *Big Fish &amp; Begonia* has been garnering little fanfare over here, but it deserves a larger audience. The film is a unique and singular work of animation, an enthralling adventure story that succeeds despite some narrative shortcomings and potential cultural barriers.\n\n*Big Fish &amp; Begonia* tells the story of Chun, an inhabitant of a mystical realm, who is about to enter adulthood by participating in a ritual journey to the human realm. On this journey, she encounters Kun, a young fisherman from a small village. During a storm, Chun—who has taken the form of a dolphin—gets trapped in a net and inadvertently causes Kun to drown when he comes to her rescue. Wracked with guilt and hoping to repay Kun, Chun returns home and makes a bargain with the Soul Keeper to retrieve Kun’s soul and return him to the human realm. This is just the beginning of a much larger and more perilous journey.\n\nThe journey is exciting but admittedly uneven. The opening segments are deliberately paced, going a long way to establish atmosphere and tone but perhaps too unhurried when it comes to moving the plot. Once the journey is well underway, plot twists and developments quickly pile up, often overwhelming and cluttering the narrative. The structure of the film is a little too loose in the first half and a little too haphazard in the latter. Some scenes end abruptly or feel incomplete, lacking internal rhythm. One particularly interesting subplot—involving a sewer-dwelling Rat Matron who tends to the souls of sinners—is ultimately left dangling. The Rat Matron provides a contrast to the Soul Keeper, performing a similar function (both have unique roles in the ferrying of souls and provide assistance to our heroes with potentially dangerous costs), but with vastly different motivations. Her sudden appearance at a pivotal plot moment is simply a contrivance to prevent our heroes from achieving their goals and prolong the journey; her departure has broad and potentially dire implications for the human world, but the film decides to ignore them and promptly forgets this character ever existed.\n\nDespite these narrative shortcomings, the film is a spellbinding work of animation. The world of *Big Fish &amp; Begonia* is realized with a large and gorgeous color palette, and richly detailed backdrops that are often stunning and breathtaking. The animation itself is clean and fluid, owing in no small part to the contributions of Studio Mir (if that name rings a bell, it’s probably because of their work on the popular Nickelodeon series, *The Legend of Korra*). The film also boasts a wonderful musical score, the best one I have heard so far this year, courtesy of composer Yoshida Kiyoshi (most famous perhaps for composing the score for Hosoda Mamoru’s *The Girl Who Leapt Through Time*).\n\nA big part of the appeal of *Big Fish &amp; Begonia* is its cultural specificity, with its visual designs and story rooted in Chinese myth and legend; it’s a novelty in a field otherwise dominated in the collective consciousness by Japanese animation (it is unsurprising, but also unfair, that the film has repeatedly drawn comparisons to Studio Ghibli). The film also assumes a Chinese audience, however, so that specificity could also be a barrier. The stories and myths that Liang Xuan and Zhang Chun draw upon might be familiar to the movie-going public in China, but unfamiliar to a Western audience, rendering elements of the narrative obscure or confusing. The distributor, Funimation, seemingly anticipated a niche appeal; the film was only given limited engagements in various American cities, and in Canada, the subtitled and dubbed versions were each given a single screening, as part of the Cineplex Events program, instead of a theatrical release. This is a stark contrast to the popularity of last year’s domestic release of *Your Name*, which saw a lot of repeat weeks in Toronto, or the popularity of Japanese animation in this market in general.\n\nChun’s journey is about the value of each individual life and fighting for what you believe is right. Moreover, it is a journey about responsibility and self-sacrifice. These broader themes provide an accessible avenue into the film’s deeper world and specific cultural background, and should help the film find a larger international audience. *Big Fish &amp; Begonia* is a flawed film, stumbling through some story structure and pacing problems, but it’s also admirable in its ambitions and largely successful in realizing its artistic vision. It’s an easy recommendation for animation fans, but on the strength of its aesthetics, the wonderful music and richly detailed world, and the epic scale of its adventure, it’s worth a look by anyone.\n\n**What animation have you watched recently Truefilm??**",
        "created_utc": 1533687505,
        "upvote_ratio": ""
    },
    {
        "title": "One of the best films in the last 30 years also had one of the best scenes in movie history, and I want to talk about it, then I want to hear about your overlooked favorites.",
        "author": "unclefishbits",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95gntb/one_of_the_best_films_in_the_last_30_years_also/",
        "text": "Big Night was a profound film during the height of the rise of independent film.  I saw it in the theatre, and having been in food/beverage in my life (hotels, restaurants, bars, etc), it immediately touched me.  In the following years, it certainly developed a cult status, and got well deserved praise.  Not just for the period, food, or immigrant angle, but the internal struggle between Tucci and Shalhoub as brothers with different ideals and definitions of \"success\" is akin to the struggle artists and actors have of being true to themselves vs accomplishing some level of commercial or recognized success.  So many legitimate artists/actors and people in Hollywood struggle with this every time they get a script or role.  I always think of the many actors that embraced their superhero roles, vs the actors who had their career swallowed up by the machine, in the prime of their life.  Tony Shalhoub was talking about this on Fresh Air the other day---&gt; [https://www.npr.org/2018/07/31/634299761/tony-shalhoub-on-mrs-maisel-and-questioning-his-worth-as-an-actor](https://www.npr.org/2018/07/31/634299761/tony-shalhoub-on-mrs-maisel-and-questioning-his-worth-as-an-actor) \n\nI think about this movie all the time, and it was such a joy that the episode of Fresh Air actually dwelled on Big Night, and the final two scenes of the film.  The final scene is glorious, and it is a silent homage to brotherhood and family being bigger than business, dreams, failure, etc.\n\nHowever, the scene I am talking about is the fight on the beach, and it's a scene that is almost haunting to me. It is so powerful, and I constantly feel as if Tony Shalhoub was absolutely robbed of an Oscar for that entire role, but his acting against Tucci was just as glorious as anything I've ever scene in modern cinema.\n\nAnd it got me thinking.... there's other scenes from other films I have definitely missed or forgotten, and I would love to know what your favorites are! I posted this on /r/movies, and I assume they won't dig into this like you will. Don't hate for double posting! =)\n\nSo let me know some of your favorite films that may or may not be overlooked, and what scenes sort of haunt you or stay with you for how brilliantly they were filmed or acted?  Cheers and thanks!",
        "created_utc": 1533683515,
        "upvote_ratio": ""
    },
    {
        "title": "Figuring out confusing endings",
        "author": "hennyV",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95elor/figuring_out_confusing_endings/",
        "text": "I'm sure we've all seen this type of film: A difficult to follow plot capped off by a seemingly nonsensical ending. I've often noticed this in some asian films (a few Wong Kar-wai films threw me off). Rather than getting frustrated over the ending, I try to understand the ending as best as possible. \n\nInternet forums can be valuable, but I usually dislike mechanical explanations of what certain scenes mean (A meant B). It feels like cheating myself of solving a puzzle. I prefer clues and hints, but that can be difficult to find. A good, but rare, example of this is this [site](http://www.mulholland-drive.net/studies/10clues.htm) about Mulholland Drive. \n\nA popular film studies book, \"A Short Guide to Writing about Film\", covers some easy note taking techniques that I have not tried out. \n\nLastly, an obvious approach is to simply watch the film over again, with the confusing scenes in mind. \n\nWhat methods do you use to try to understanding endings or unclear plotines?\n\nedit: grammar and some wording\n\n",
        "created_utc": 1533669074,
        "upvote_ratio": ""
    },
    {
        "title": "Winnie the Pooh (2011) is an underrated gem",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95e25i/winnie_the_pooh_2011_is_an_underrated_gem/",
        "text": "[removed]",
        "created_utc": 1533665456,
        "upvote_ratio": ""
    },
    {
        "title": "I've been wondering about anthology films after seeing that the Cohen Brothers were making one. Is there a theory behind how they should be put together and what are some of the notable examples of the style done well?",
        "author": "Hackson_Pollock",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95c19i/ive_been_wondering_about_anthology_films_after/",
        "text": "Later this year the Cohen Brothers are releasing \"Ballad of Buster Scruggs\" which is an anthology movie born out of their original idea for a six part anthology series for Netflix and it has me wondering about how the anthology style works.  \n\nPart of the problem is that I can't come up with very many examples of the form.  Obviously the first one that springs to mind is \"Pulp Fiction\" but I'm not even sure that it counts and after that I quickly start only being able to come up with things like \"Kentucky Fried Movie\" and \"Movie 43\" which hopefully are not too emblematic of the best of the style.   \n\nI'd love to hear a discussion about anthology films and hopefully get some recommendations of some to check out.  ",
        "created_utc": 1533651595,
        "upvote_ratio": ""
    },
    {
        "title": "Nocturama (2016): When reality undermines art",
        "author": "arrow-s",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95bv9p/nocturama_2016_when_reality_undermines_art/",
        "text": "Spoilers for Nocturama and Fight club to follow.\n\nBertrand Bonello's Nocturama features a group of young French men and women, from all walks of life, who plan and execute a series of coordinated terrorist attacks in Paris. They plant a bomb in the Ministry of the Interior, set a statue of Jeanne d'Arc on fire and murder a bank executive point blank, among other things. Their motivations are not discussed but the choice of targets and the targets they regret not choosing (the employers' union) suggests that they are on a crusade against the capitalist elite. Lockdown of Paris ensues, during which the protagonists hole themselves in an empty department store and kill time by trying the designer clothes, jewellery, go-karts and speaker systems they find in there. They invite a homeless couple to join them, and they all get caught in the middle of the final showdown as the police storms the store killing everybody they find.\n\nAccording to the director, the film was written in 2010 and filmed in summer 2015. Then, while editing the film in November 2015, something happened that would change the fate of the film. A series of terror attacks hit Paris, eerily similar to the one depicted in the yet-to-be-released film. Coordinated attacks in several parts of the city. Performed by radicalized youth (albeit with very different motivations). Abandoned cell phones. Lockdown of the city. Interventions of police special forces. Despite this, Bonello and his team decided to go on with the editing and release the version of the film that they had intended.\n\nThe film went on to get a very lukewarm response in France, for example Le Figaro calling it a film that had been surpassed by the reality. And indeed it was. The discomfort of glorifying domestic terror attacks less than a year after the real life events did, and still does, distract from the films's themes. The film was eventually dropped from the Cannes lineup, flopped at the box office and ended up on Netflix.\n\nNocturama was meant to be provocative, there's no question about it. In much the same way as many Nouvelle Vague films, or more recently, Fight Club were provocative. But would Fight Club have been seen in a different light had it been released a little later, right after 9/11? The final scene of skyscrapers collapsing might have struck a similar note with the American public as Nocturama did with the French audiences years later. On the other hand, if Nocturama was released three years earlier, the audiences might have been more receptive to the film's themes of anti-capitalism, civil disobedience and yes, domestic terrorism. They also might have been able to appreciate the masterful kinetic editing, keeping the film in motion even when little is happening on screen.\n\nWhat do you think, would the film be viewed differently if it came out in a different zeitgeist? Will the film be viewed more positively in 10 or 20 years, when the connection to the real life attacks is not the first association the viewer has?",
        "created_utc": 1533650373,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think Woody Allen's movies are 'traditional' or 'theater-like'?",
        "author": "eroticnungu",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95bf3g/do_you_think_woody_allens_movies_are_traditional/",
        "text": "I was listening to this interview of Kubrick wherere he pointed out that so much of modern cinema is still rooted in theater and does not make full use of the potential that this art form  provides its makers. Then he used Woody Allen as an example and said that even though he (Kube) liked his recent work he did but found the films rooted in 'traditional structure'.\n\nOkay, let me confess that the Woody Allen part was just a pretense for this post and I actually wanted to discuss how cinema is made and perceived as a audio/visual form in today's world. In fact, the interview with Kube is actually about this topic and the Woody part comes towards the end purely as any example. On my side I am a bit confused because from the few Allen films I've seen from the 70s (Annie Hall, Manhattan and Zelig), I think he is a pretty innovative filmmaker, particularly in the place of Zelig which I think is pretty revolutionary considering the way it was made. \n\nIn the same video Kubrick referred to some Michelob commercials from the 80s and he said he found them incredible. I checked out those commercials and they seemed quite inventive as well. From this I feel what Kube is pointing out towards not towards the 'plot' or the 'story' but the way and the methods through which the story is told to the audience. On a similar note I remember reading a quote by Scorsese on Kube where he says something like   *Kubrick told stories* in a *way* \"antithetical to the *way* we are accustomed to receiving *stories.*\n\nI haven't seen Passion of the Joan of Arc yet but its on my list butfrom that one powerful trial scene that I saw randomly and read more about the film, its also an amazing example of how cinema is so unique and how most filmmakers just do not explore its possiblities. If you dont know about the movie its filmed almost entirely in closeups which made the film pretty pathbreaking for its time and still seems to be the case.\n\nEDIT: This is the interview I was talking about. https://m.youtube.com/watch?v=31CdxnXAxiQ\nAnd here is an AMAZING 2 hour interview with him from which the excerpt was selected. You are my darlings Eyes on Cinema and Movie geeksUnited!!! https://m.youtube.com/watch?v=ehQf0LJVOHQ",
        "created_utc": 1533646870,
        "upvote_ratio": ""
    },
    {
        "title": "Characterisation in \"The Lord of the Rings\" Trilogy (part 2)",
        "author": "cacb3995",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95b67a/characterisation_in_the_lord_of_the_rings_trilogy/",
        "text": "[removed]",
        "created_utc": 1533644737,
        "upvote_ratio": ""
    },
    {
        "title": "Have our expectations of blockbuster films fallen over the past few decades? Or, why is Mission Impossible: Fallout so highly rated in comparison with the original 1996 film?",
        "author": "kiefer-reddit",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95agqu/have_our_expectations_of_blockbuster_films_fallen/",
        "text": "It's commonly said that \"modern movies are all terrible\" which is a different discussion entirely (and not one I want to discuss in this topic.) Instead, I specifically want to talk about \"blockbuster\" films and whether our expectations of them have fallen. \n\nRecently, I saw the overwhelming number of positive reviews for MI: Fallout and figured it would be worth seeing. The original 1996 film (which was based on a TV show), while still a big-budget action movie, managed to be subtle and invoke an interesting Central European \"espionage\" mood. So, I had hoped that maybe the new film would be along these lines. See [this scene](https://www.youtube.com/watch?v=yDs8li2_AO8) or [this scene](https://www.youtube.com/watch?v=sd_I5ez3jwg) for an example of what I mean.\n\nOf course, I was disappointed. To my mind, it was yet another poorly-written, poorly-acted by-the-numbers action movie. There is absolutely nothing special or unique about it. And yet it currently has 97% on Rotten Tomatoes.\n\nAm I missing something? It seems that we, the audience in 2018, have come to tolerate mediocrity from big budget action films. And from my perspective, this absolutely *did not* used to be the case.",
        "created_utc": 1533637887,
        "upvote_ratio": ""
    },
    {
        "title": "Christopher Robin Officially Owned By DC",
        "author": "Sanskari_Nervousness",
        "url": "https://www.youtube.com/watch?v=QooYmcHDOjE",
        "text": "",
        "created_utc": 1533630420,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on sad music over emotional scenes?",
        "author": "Bigman5021",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9596q7/thoughts_on_sad_music_over_emotional_scenes/",
        "text": "I know some people view sad music over emotional scenes cheap because it is the music that brings out the emotion instead of the actual scene itself but is it necessarily bad if music is added to increase the level of emotion? Not a movie but the show The Leftovers has an incredible theme song that is used over many scenes and people who have watched the show know how emotional those scenes are because the music is so incredibly beautiful but so dark at the same time. If the music were to be taken out I think a lot of the emotion would be taken out as well but why would that mean the scene is cheap? Music is a major part of movies so I don’t think adding emotional music is inherently a cheap directing method. However, there definitely are examples of cheaply used music to add emotion such as in Vanilla Sky, I thought the scene where the song “Ladies and Gentleman We Are Floating In Space” played only drew emotion from me because I knew and liked the song already, not because of the emotion of the scene. And of course there are emotional scenes where no music is played such as the phone call scene in Brokeback Mountain where I think no music is needed. I guess that I think scenes that are in overly dramatic (not a criticism) movies usually has music over emotional scenes that add to the emotion that don’t feel cheap while movies that are more realistic depicting the regular drama of life can have scenes that feel more cheap by using emotional music over them. What are your thoughts and opinions on the topic though and do you have any examples of cheap scenes with emotional music or great emotional scenes with no music?",
        "created_utc": 1533623032,
        "upvote_ratio": ""
    },
    {
        "title": "Blue Valentine: Dean summed up his own relationship",
        "author": "paulruddsnuts",
        "url": "https://www.reddit.com/r/TrueFilm/comments/95903x/blue_valentine_dean_summed_up_his_own_relationship/",
        "text": "Early on in the film, during a flashback sequence, Dean is talking to his new co-workers about women. He makes the statement, “I feel like men are more romantic than women. When we get married we marry, like, one girl, 'cause we're resistant the whole way until we meet one girl and we think I'd be an idiot if I didn't marry this girl she's so great. But it seems like girls get to a place where they just kinda pick the best option... 'Oh he's got a good job.' I mean they spend their whole life looking for Prince Charming and then they marry the guy who's got a good job and is gonna stick around.” While this quote is interesting in its own right, it was brilliant writing by Cianfrance. Cindy settled for Dean. I'm not saying that she never had any feelings for him, as he certainly made her feel good, but he clearly loves her and it's not clear the other way around, as their story closely mirrors the quote. Dean is the idealistic romantic who promised to stick around for Cindy when she was pregnant and struggling and she chose the best option by picking him instead of someone like Bobby. She realizes this and it upsets her, leading her to question why he has a steady job instead of doing something artistic, cringe at his touch, and ultimately state her desire for a divorce. Maybe their relationship was doomed from the start. ",
        "created_utc": 1533621041,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"Mouchette\" an inaccessible movie?",
        "author": "murmur1983",
        "url": "https://www.reddit.com/r/TrueFilm/comments/958p4y/is_mouchette_an_inaccessible_movie/",
        "text": "Hello, everyone. I watched \"Mouchette\" last week, and I loved it, but it's occurred to me that it can be a difficult film to watch. For starters, the movie is a quiet, but deliberate effort; there is no music for most of the film, and it moves along at a slow, but measured pace. \"Mouchette\" is a restrained, but understated movie that has brief snippets of dialogue, and it sort of relies on context &amp; subtleties for the viewer to pay attention to. \n\nAlso, \"Mouchette\" is......depressing, to put it lightly. The titular protagonist's name means \"small fly\", and the film depicts mistreatment by a schoolteacher, isolation from society, a possible murder, and an abusive, alcoholic father who is involved in illegal activities. \n\n\"Mouchette\" is a grim movie that doesn't let its protagonist achieve true happiness, as well. [SPOILER ALERT] I mean, right from the start of the movie, her mother worries about what will happen to her family when she is gone, and she is sick. The mother dies, and Mouchette doesn't have friends at school. Her clothes are in poor shape, and she gets raped by a man. People in her community insult &amp; demean her, and Mouchette kills herself at the end of the film. \n\nOverall, I think that \"Mouchette\" is a great movie, but it isn't an easy movie to view, and it can be a tough nut to crack. What would you guys say about this? ",
        "created_utc": 1533617912,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Highlander such an under appreciated film?",
        "author": "c_o__l___i____n",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9589ur/why_is_highlander_such_an_under_appreciated_film/",
        "text": "The 1986 classic Highlander is one of if not my favorite movie of all time and I don’t get why it is not in the light it deserves. It’s got everything you’d want in a movie action, romance, tragedy, thriller, good vs evil, and Sean Connery. It sets up an interesting world of immortals and a worldwide fight for an unknown reward. Sean Connery gives a great performance (only notch against him is he’s obviously not an Egyptian or Spaniard), Christopher Lambert does well with the action and is good even with the language barrier, and Clancy Brown as one of the most intimidating villains I have ever seen in movie history intimidates me every time I watch it. The directing is very love it or hate it from the reviews I’ve read about the movie, the camera is very spastic when they’re in New York, but is very grand when they’re in the Highlands which was always a touch I liked. Last but not least is the masterful score by the rock band Queen and composer Michael Kamen, that has to be seen with the movie for it to be truly experienced.",
        "created_utc": 1533614083,
        "upvote_ratio": ""
    },
    {
        "title": "Christopher Nolan: Questioning reality",
        "author": "johnonamous",
        "url": "https://www.reddit.com/r/TrueFilm/comments/956uun/christopher_nolan_questioning_reality/",
        "text": "Christopher Nolan is someone whom I greatly admire as both a writer and a director. I believe he has a unique methodology in his creative process that is integral to his success in the industry. Myself and many others have enjoyed many of Nolan's films over the years and I'd like to share my opinions below on why I think that is.\n\nNolan has the ability to create a world around an audience where the impossible becomes tangible fact. Against common sense, the fiction the viewer is presented and the reality they have left appear to be indistinguishable from one another. It is through this that audiences find their hearts pounding, tugged and broken by the projected image. The viewer develops organic bonds with the real lives of unreal characters in impossible worlds. As if sensing this over-familiarity, Nolan reintroduces the impossible to his film continually, defying the rules in a reality of his own design. At the films end the viewer is refused the pleasure of conclusion and an answer is obfuscated beyond reach.\n\nThe screen goes black before answers sorely sought are given. Unlike the gentile allure of entry into the impossible, true reality is violent as it collides with the world the viewer has accepted. The connection to the impossible is severed and the shock of returning leaves the mind reeling as it grasps for answers. Throughout the film however, such questions are posed without such a response. These questions paradoxically increase the tangibility of the world with the cycle of resolution being accepted as but another quirk of the perception of the observer. Questioning the reality is met with excitement at the resolution and the truth of the projected reality is never questioned.\n\nWhen the final question is posed the audience ruminates upon it, unaware of what is to come. Unaware they have been conditioned for this moment. Small at first, the question worms its way into the mind. It grows and metastasizes like a cancer as its reality is ripped away. More and more questions with larger and larger implications fill cognition and refuse to be ignored. It's as if the remnant hopes resolution will return what is lost and restore the connection to its dead reality. Make the impossible - possible again.\n\n\\*Spoilers for Memento ahead\\*\n\nImpossibility and questions come in many forms and can certainly be subjective. In Memento the audience wishes understand the impossible enigma of the reality they are presented and are constantly asking the question “What happened before?” The impossible way time is portrayed is both accepted as reality and as the natural order of progression required to the resolve questions posed. Wanting continuation to the progression of events is integral to almost all viewing experiences. It is only after the audiences realises that “What happened before?” has been a meaningless question to both the viewer and Leonard that the only satisfactory conclusion for both is “What next?”.\n\nAt the end of the film the audience realises that Leonard's goal had been resolved a long time before they began observing him. The audience was not only invested in a goal that was pointless and fabricated, but it is revealed that this lie was instigated by Leonard himself so as to still feel like his life has meaning. Finding his wife's killer is the only true constant between his episodic memory lapses that gives him direction. He realises this and understands what the consequences of knowing that he may have killed her accidentally would be. For the first time in the film Leonard is seen choosing to forget. Someone obsessed with storing permanent memories externally as tattoos and photographs forges a lie for himself and burns away the truth he has just discovered. Shortly after the audience observes this Leonard forgets the illegitimacy of his own reality and the film ends as he accepts an impossible reality. The audience is left with the consequence of no longer knows what is truth in this world. More and more questions as to the legitimacy of the previously accepted facts of this reality arise without answer as the audience cannot forget what has been revealed.\n\nThe new reality also poses a plethora of existential questions as to the meaning of Leonard’s continued life and parallels that can be drawn to the audience themselves. The observer is emotionally invested in the goal of catching John G despite our equal lack of memory of this world much like Leonard. When the meaningless nature of the events is discovered and we are returned to our reality we too realise that the film was only so enjoyable because we we're invested in the lie and were oblivious to the truth. We aren't cursed with the amnesia Leonard has but perhaps we wish we could forget the truth and re-live the experience. Don't we do the same? Re-watching films only after a time has passed and our memories have faded somewhat?\n\nIs it better to face reality or to ignore the truth and be happy? A question that stays with viewers long after the credits. This conflict between accepting a lie or facing the truth of reality is in all of Nolan's films to an extent. Often the characters can also be seen as but a reflection of the observer. It is only through enticing the viewer into his world so convincingly that the viewer can't help but take something from the impossible with them as they return.\n\nNote: Where I say impossible in this piece I more mean something which would occur in the viewers perception of their reality rather than the more literal meaning(Although both are certainly true)\n\nI could give similar short analysis for almost all of Nolan’s films, I just thought it best to stay away from Inception where the parallels to my appraisal would probably increase the size of this post 10-fold (And no-one wants that). I hold it against no-one to dislike a film or to completely disagree with everything I said and think I'm a muppet. In fact I’d love to hear opinions regardless and would enjoy the discussions.\n\nThat being said, if anyone has a problem with the film Hot Fuzz I'll see you by the bike rack after school &gt;:(",
        "created_utc": 1533601983,
        "upvote_ratio": ""
    },
    {
        "title": "I’m still generally new to film, and I’m sure this is a common post but",
        "author": "bukeleebe",
        "url": "https://www.reddit.com/r/TrueFilm/comments/955cd7/im_still_generally_new_to_film_and_im_sure_this/",
        "text": "[removed]",
        "created_utc": 1533590555,
        "upvote_ratio": ""
    },
    {
        "title": "My Facebook Group dedicated to film fans in Sheffield UK, please join and contribute!",
        "author": "JasonRedux",
        "url": "https://www.facebook.com/groups/285977225295723/",
        "text": "",
        "created_utc": 1533585955,
        "upvote_ratio": ""
    },
    {
        "title": "I watched the killing of a sacred deer",
        "author": "chris9933",
        "url": "https://www.reddit.com/r/TrueFilm/comments/954mp3/i_watched_the_killing_of_a_sacred_deer/",
        "text": "[removed]",
        "created_utc": 1533585655,
        "upvote_ratio": ""
    },
    {
        "title": "Boogie Nights &amp; Goodfellas: When Karma Comes Around",
        "author": "FilmRadar",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9536sq/boogie_nights_goodfellas_when_karma_comes_around/",
        "text": "*What follows is a script for a video that I produced, a clickable link will be at the bottom if you'd rather watch than read. Be warned, spoilers for both films follow. Thank you.*\n\n\"I like stories with good old-fashioned roots that obey the rules—you know, 'the gun on the wall in the first act goes off in the third,' and so forth. My favorite directors are the ones who know and embrace those rules, then pile something completely punk rock on top of them.\"\n\nThat was a quote from Paul Thomas Anderson in an interview about his film \"Boogie Nights\". And I have to say that I agree with him. Often the best films aren't the ones that completely break the mold, but rather films that know and embrace those that came before it, by delivering good old fashioned storytelling. If we were to compare Anderson's \"Boogie Nights\" and Martin Scorcese's \"Goodfellas\" we can find a lot of common ground. They both follow the rise and fall of two young and ambitious men, who find themselves a sense of belonging within a surrogate family, and whose greed and ego ultimately lead to their own self-destruction. But while they may share much of the same DNA, each film does plenty to establish itself as its own unique film, showing us how a film can borrow many of its thematic or structural elements and still maintain its own creative voice. \n\nAct One: The Gun on the Wall\n\nIn both Boogie Nights and Goodfellas, we start with a young protagonist with a difficult life at home, seduced by a new world and all of its possibilities. There's a kind of romance happening, for the lifestyle, the community, and it's understandable to see why. From both Henry and Dirk's perspective, these people have it all, the women, the cars, the house, the money, the connections, and they just want to get a piece of that for themselves.\nBefore long, they're more than just a participatory member, but a rising star whose come to earn the respect of everyone who surrounds them. They find something they're good at and embrace it, as Karen puts it in a line from Goodfellas, \"these guys aren't brain surgeons, they're regular blue collar guys\" so they claw their way to success the only way they know how, even if it means losing their real family in the process. But everything is working out for our protagonists, or so it seems at first glance. Many seeds are planted in the first act of Boogie Nights that foreshadow the darker turn the film will ultimately take. At every point it's all kept light, even breaking for moments of levity despite the darker context of some of the scenes. \n\nScorcese employs some foreshadowing of his own, if you can even call it that. Mostly we just see character traits established early in the story that become important later on, like Maury and Jimmy's money issues, or Henry's lack of empathy towards Karen. But one scene in particular stands out as a great bit of foreshadowing. The \"how am I funny scene\". Demonstrating Tommy's odd sense of humor and erratic, often violent behavior that we'll see make a return in the next section. The intensity builds and we're thinking that Henry might be in real danger here, until he realizes it's all a big joke. \"I almost had him!\" But even when the scene quickly turns violent after the owner asks Tommy to pay his overdue bill, the laughs only get louder. Which brings us into Act Two. \n\nAct Two: It's All Fun and Games...Until Someone Gets Hurt\n\nThe first act has gone quite well for our characters, the money is coming in, the family bond still strong and everyone's happy. They're living the dream, just like they always wanted, until around the half-way point of each story, when the metaphorical gun on the wall finally goes off. What started out as all fun and games has quickly turned into something completely different, with what Paul Thomas Anderson would call \"karmic debt\" starting to be paid back in full. \n\nThis too is true for the characters in Goodfellas, though they don't seem to be as aware, until it's far too late. Despite everything that's happened, Henry and Karen are in shambles after she finds out about his mistress. Henry's drug addiction worsens and he lies to Paulie's face to continue his Pittsburgh operation, and of course we all know what happens with Tommy's erratic behavior. But even worse than killing Spider, Tommy took out a made-man, something that you just don't do in the Mafia. But Henry and the others still live in blissful ignorance, their karmic debt remaining unpaid, and after successfully pulling off the biggest heist in American history, their egos remain unchecked and life continues on as normal, for a time. Until paranoia sets in and Jimmy and Tommy start taking out everyone involved in the heist so they can keep the cops off their trail, and hold on to the majority of the money. And even as the body count continues to climb, the lies, the betrayals, Henry still can't see the downfall of everything he helped to create, at least not yet.\n\nAct Three: A Sobering Wake-Up Call &amp; Returning Home\n\nUp until this point in both films, the characters have their taste of reality, but still continue to live in denial. Whether from pride or ego, or a desperate attempt to retain their old lifestyle, they continue to make the same mistakes that led them down this darker path to begin with, until they both receive a sobering wake-up call in a pivotal scene that perfectly captures feelings of anxiety and paranoia of two sleep deprived drug addicts desperately clinging on to what power they still have, with Dirk and Henry finally receiving some karmic justice for their actions. And in these scenes, Scorsese and PT Anderson are able to perfectly communicate these feelings of Anxiety and Paranoia in their main characters to the audience through their deliberate choices of cinematography, music, writing, and editing. A fast moving camera vs. a slow methodical camera. Fast cuts vs. long takes. Diegetic vs. non-diegetic music. It’s these types of decisions that create a mood of anxiety and paranoia in Goodfellas and utter dread and claustrophobia in Boogie Nights. \n\nImmediately following these incredibly tense scenes that challenge Dirk and Henry more than ever before, they return to the patriarch of their respective surrogate families, in desperate need of their help. \nDirk is forgiven and warmly embraced, welcomed back into the family, but Henry is turned away, only given a bit of cash to help him with his troubles. And this is where the two films really diverge. In Goodfellas, the family has all but fallen apart, with most of the crew already dead, and the few remaining unsure of who they can still trust. So Henry enters a plea deal that will keep him out of prison, and get him into the Witness Protection Program to keep his family safe, turning his back on the closest thing to a family that he ever had. But in Boogie Nights, the characters have suffered through the worst of it, and we see something of a happy ending for everyone. Reed performing his magic act, Buck and Jesse opening up their stereo store and welcoming their first child into the world, Rollergirl goes back to school, with Jack and Dirk mending fences and renewing their working relationship. \n\nBoth films can teach us a lot about the potential dangers of ego, pride, and selfish tendencies. They each certainly have a lot to say about consequences, and how they may not always be right around the corner, but one way or the other, karma is coming for you in the end. It serves to comment on the importance of family, and that even if they're not blood it doesn't make those connections any less meaningful, and that you should never turn your back on them. But most of all what I love about comparing and contrasting these two films is what it can teach us about writing, how if you boil a story down to its fundamental parts, most of the greatest stories ever told follow a similar pattern or structure, and these two films in particular certainly have more in common than most, but you'd be hardpressed to find anyone claiming that Boogie Nights is a carbon copy of Goodfellas. Because while they are made up of many of the same ingredients, from its tonal balancing act that mixes big laughs with extreme violence, sometimes even in the same scene, to their similar protagonists whose character arc follows roughly the same path, or its overlapping cinematic language like the infamous long-takes or the era appropriate pop soundtracks, they both earn their place in the history of cinema as some of the finest works from two virtuoso filmmakers at the top of their game. \n\n\n*Here's the link for those who'd rather watch this in video form*\n\nhttps://www.youtube.com/watch?v=IZ3wXzYrxd0\n\nAs always, I'll be here to discuss further in the comments! ",
        "created_utc": 1533575905,
        "upvote_ratio": ""
    },
    {
        "title": "Foreign Noir recommendations?",
        "author": "thechodiya",
        "url": "https://www.reddit.com/r/TrueFilm/comments/951wqa/foreign_noir_recommendations/",
        "text": "[removed]",
        "created_utc": 1533566961,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (August 06, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/951mrs/casual_discussion_thread_august_06_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/)\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1533564888,
        "upvote_ratio": ""
    },
    {
        "title": "Any strange stories about subtitle tracks that don't match the film?",
        "author": "120percentNick",
        "url": "https://www.reddit.com/r/TrueFilm/comments/9506sg/any_strange_stories_about_subtitle_tracks_that/",
        "text": "[removed]",
        "created_utc": 1533551729,
        "upvote_ratio": ""
    },
    {
        "title": "The archive.org copy of 'Le Roman de Renard' (1930) has some really weird subtitles.",
        "author": "[deleted]",
        "url": "https://archive.org/details/LeRomanDeRenardTheTaleOfTheFox1930LadislasStare",
        "text": "[deleted]",
        "created_utc": 1533550785,
        "upvote_ratio": ""
    },
    {
        "title": "I Just Watched the Nazi Propaganda Film 'I Accuse!' 1941",
        "author": "arctofire17",
        "url": "https://www.reddit.com/r/TrueFilm/comments/94zc33/i_just_watched_the_nazi_propaganda_film_i_accuse/",
        "text": "The Third Reich had a powerful propaganda machine that they used to justify unspeakable horrors. Watching films made by the Nazi regime I simply wanted to gain an understanding of the nature of propaganda and how it can be used to control populations. For this reason I had already seen Triumph of the Will and The Eternal Jew, both served the purpose of propaganda and whilst impressive from that angle, were nothing more than that.\n\nHowever, at what point should we say that a film should be judged on its own merits? You could say that all Disney films should be banned because Walt Disney was a Nazi sympathiser. You could say the same thing with far more credibility about Birth of a Nation, which glorified the KKK explicitly. Same with a lot of Iranian cinema which is still under the control of a fascist regime. There are loads of films made that were made to put across an agenda, had certain ideologies behind them, and were made by governments who we absolutely do not agree with. However, we should still study and admire films for their technique, storytelling, acting, and production value, as well as separating the study of film from the study of politics.\n\nI Accuse, to me is one of those films. Made in 1941, it was a film made to try and justify the T4 Euthanasia Programme the Nazi government had implemented a few years previously, which had more than 70,000 disabled people, many of them children, regardless of severity of illness or deformity, sent to gas chambers, a precursor to what would happen in 1942 to the Jews with the Final Solution. This is obviously utterly abhorrent, but I do not believe the film tries to put across the message that mass killing of disabled people is morally justifiable, and if it did, it failed in that regard.\n\nThe story is of a brilliant doctor, Dr Thomas Heyt, who's wife Hanna, a lively, witty, and beautiful woman, is diagnosed with Multiple Sclerosis. He tirelessly attempts, and fails to find a cure, and so his wife begs him to end her life so that she may be remembered for the person who she is. This ends with a debate on euthanasia, as Heyt stands trial for the murder of his wife.\n\nThis film is brilliantly made. The acting and direction is absolutely superb, and you can really sympathise with the character's motivations. Heidemarie Hatheyer does an excellent job playing Hanna, and you fall in love with her right from the moment you see her on screen, her liveliness, playfulness, independence, energy. It makes the progression of her illness even more tragic and sympathise with her husband, played by Paul Hartmann, in what he does. I can see myself doing the same thing, if my wife whom I loved more than anything in the world asked for her suffering to be ended.\n\nAll the more, I think this film is still extremely relevant today as euthanasia is still illegal in most of the world. I have first hand experience of degenerative illnesses with my Grandfather, who has Parkinson's Disease and cannot do anything, even speak, without help, which breaks my heart because I had such a close relationship with him. I do think euthanasia should be allowed, of course not in the way it was done by the Nazi's, but I do feel that our society puts too much emphasis on 'life at all costs' and will never pull the plug even if it is their own desire.\n\nThe film has very little Nazi imagery. Only the title screen and a few shots are swastikas shown. But I do believe this film to be timeless and universal, and it is a shame that because it happened to be made by a certain regime, we should reject any artistic merit that this film might have. Of course the viciousness of the Third Reich makes objective view difficult, especially for those who were among the persecuted groups, but nevertheless I still would recommend it not only as historical research but also for being an all around great film.",
        "created_utc": 1533541450,
        "upvote_ratio": ""
    },
    {
        "title": "The Human, the Machine and Spike Jonze",
        "author": "Rugby11",
        "url": "https://vimeo.com/206048543",
        "text": "",
        "created_utc": 1533522980,
        "upvote_ratio": ""
    },
    {
        "title": "Lawrence of Arabia DVD is 39% off",
        "author": "IndependentNectarine",
        "url": "https://twitter.com/Alice786453/status/1026190955240673280",
        "text": "",
        "created_utc": 1533506480,
        "upvote_ratio": ""
    },
    {
        "title": "Help me deconstruct DePalma's Carrie",
        "author": "ASeriousUser",
        "url": "https://www.reddit.com/r/TrueFilm/comments/94tbqh/help_me_deconstruct_depalmas_carrie/",
        "text": "Just watched Carrie for the first time since I was pre-pubescent, and I'm not sure I've ever seen it in full uncensored. I can't stop thinking about it.\n\nI always thought DePalma was a hack. I've enjoyed a few of his movies, but when I was in my early 20s/late teens discovering directors, he was at a low point (Snake Eyes, Bonfire) or doing work for hire (Mission Impossible). Tarantino was always gushing about him and I didn't get it. I get it now.\n\nThe sexuality exhibited by HS children in Carrie is disturbing. They do not behave like awkward teenagers and they are supremely confident in their sexuality. They don't appear to conflate love and sexual desire as children are apt to do. \n\nSue Snell directs her boyfriend to seduce Carrie, to ease her conscience. Collins calls it out - \"nobody believes you, not even Carrie\". Sue's motives are unclear, but she doesn't display malice towards Carrie.\n\nEvery time William Katt is on the screen, I want to vomit. I only know Katt from The Greatest American Hero, a show I watched religiously, so for me, he's playing against type. What's nauseates me is how  genuinely \"aw shucks\" charming he is, when we already know he's disingenuine.\n\nDavid Lynch looms heavy over this movie. Sissy Spacek and Jack Fisk (her husband and the production designer) are long time personal friends of Lynch and both were integral in getting Eraserhead made. Fisk and Lynch were childhood friends. Carrie is responsible for restoring the career of Piper Laurie, who had been out of show business since the early 60s.\n\nIt got me thinking, why hasn't Spacek worked more with Lynch, aside from a cameo in The Straight Story? Then it occurred to me that Carrie has some standard Lynch tropes - high school, sexually precocious teens, proms, the inexplicably supernatural, weird girls in trouble, filicide, matricide...\n\nI'm interested in reading your thoughts. Please refrain from referencing the book. The movie is a standalone work, if the filmmakers left a plot element out, then they had a good reason.\n\n\n\n\n\n",
        "created_utc": 1533488529,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of August 05, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/94sy0d/what_have_you_been_watching_week_of_august_05_2018/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1533485428,
        "upvote_ratio": ""
    },
    {
        "title": "Question for the class",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/94st48/question_for_the_class/",
        "text": "[removed]",
        "created_utc": 1533484365,
        "upvote_ratio": ""
    },
    {
        "title": "“The State”. Humanizing the enemy and maybe making ISIS propaganda by accident.",
        "author": "Atimo3",
        "url": "https://www.reddit.com/r/TrueFilm/comments/94rveb/the_state_humanizing_the_enemy_and_maybe_making/",
        "text": "A 3 hours miniseries counts a film if I watched it in one sitting, right?\n\n“The State” is a BBC show about ISIS, ISIL, Daesh or those asshole who pervert Islam; whatever you want to call it. It follows the lives of four British fellows who decide to join the proto-state for various reasons: Shakira (a female doctor who wants to threat the fighters), Jalal (who wants to follow on the footsteps of his martyr big brother), Shavani (a woman who wants some of that sweet fundamentalist dick) and Ziyad (who wants to become “Paki Rambo”).\n\nIt’s by far the most humanizing portrait of Islamic extremism that I have seeing in western media, and I am not sure if that’s a good thing.\n\n**1- The alarmist bullshit.**\n\nA quick googling showed me that there was some controversy in the UK about the production. Everybody’s favorite not fascist but number one with fascist magazine The Daily Mail straight up accused the show of being “a recruitment video to rival Nazi propaganda of the Thirties calling young men to join the Brownshirts” without a hint of irony. So, for the sake of keeping a civil conversation let me assure that this is not what I am doing here. I don’t know how serious the controversy was as I am not British nor follow UK press closely, but it seems like a good disclaimer to make.\n\n* *[The Mail shouldn’t be talking shit about extremist propaganda anyway.](https://nationalvanguard.org/wp-content/uploads/2015/05/hurrah-blackshirts2.jpg)*\n\n“The State” is unambiguously an anti-Daesh piece, it was made as such and it will generate a sentient of “these people are horrible” among most viewers. But, what made me uneasy during my watching was not most viewers, but rather a potentially dangerous minority.\n\n**2- Humanizing Daesh**\n\nHere is the crux of the argument. The show was absolutely brilliant, the characters felt real, their reactions felt real, the only thing that didn’t felt real were the death people props but it’s BBC, so that’s normal. And from a purely artistic point of view, that is great, it provides a fascinating perspective about the Middle East.\n\nBut from a moral point of view I can’t avoid the feeling that the ISIL presented by the show may still be tempting for some. All of our four main characters find themselves into tragic situations, but these tragic situations are the result of them acting against the precepts of Daesh or failing to see the “virtue” that others claim is their situation.\n\n* *[Bad for you and me doesn’t translate into bad for everybody.]( https://d1u4oo4rb13yy8.cloudfront.net/article/66826-xiplqxiysw-1503812016.jpg)*\n\nWithout diving too much into spoilers the Syrian conflict as presented by BBC will be absolutely rewarding if you want to be a martyr or the wife of a martyr, in the same way if your definition of an innocent is “a fundamentalist Sunni Muslim and no one else” then you probably don’t have to kill any innocents, and if you are just greedy and horny, well, there is money and sex slaves for you as well.\n\nIt’s certainly not the same level of unintentionally telling people that being the bad guy is great and you should totally do it as *The Wolf of Wall Street*, it’s much more filled with brutality and suffering. There is only a couple of moments of absolute barbarism that I felt would hit anyone regardless of cultural background, but they appear only at episode four, at that point it would be easy for an extremist viewer to just dismiss it as Western propaganda.\n\n**3- Conclusion, whatever I am babbling about.**\n\nI don’t think anybody actually joined ISIL because they watched this show, for starters it came out in late 2017. By then Daesh had already being reduced to a couple of shit towns in the middle of nowhere, today they don’t even hold that. The days of ISIL recruiting large amounts of Westerns are long pass as they no longer have a state to use as bait.\n\n* *[“There's no such thing as an anti-war film” - François Truffaut]( https://static4.libertatea.ro/wp-content/uploads/2017/08/The-State-serial-2.jpg)*\n\nThis is more of an attempt of discussing the responsibility that an artist has when portraying a dangerous group in abstract. Would have being justified to make a movie humanizing the Nazis in the 30s? Could one make in good conscience a TV show giving understanding to the apartheid regime during the 80s? At want point is too soon to portrait the conflict with honesty? At want point is some group inhuman enough that they shouldn’t be portrayed as human? Does that point even exist?",
        "created_utc": 1533475937,
        "upvote_ratio": ""
    }
]