[
    {
        "title": "Lets talk about the concept of collectivism in multiplayer gaming.",
        "author": "SecretDragoon",
        "url": "https://www.reddit.com/r/truegaming/comments/8dzyi5/lets_talk_about_the_concept_of_collectivism_in/",
        "text": "First off, I would like to define the terms \"Collectivism\" and \"Individualism\" if you are unfamiliar with them.\n\n**collectivism**\n\n* the practice or principle of giving a group priority over each individual in it.\n* the theory and practice of the ownership of land and the means of production by the people or the state.\n\n**individualism**\n\n* the habit or principle of being independent and self-reliant.\n* a social theory favoring freedom of action for individuals over collective or state control.\n\nIn short, I want to use some terms we use in political discussions, and apply them to gaming. Here specifically, I want to talk about the emphasis on the *group* in online multiplayer games, instead of emphasis on the *individual* in these cases. You will also see groups in multiplayer games be commonly compared to *sports teams* (hell that's why we have the whole \"eSports\" thing now right?), which are also collectivist in nature.\n\n##In MMORPGs\n\nMMORPGs were the main reason I wanted to write this post up. For over a decade now, the driving force behind many games in this genre is how the player interacts with a *group*. It is common for much if not all of the \"end game\" content in these games is driven by an individual player joining a larger *group* of players to tackle some content *as a team*. A lot of the earlier games in the genre did not have \"looking for group\" queues, and mainly required the player to seek out a long term group (a static, guild, clan, what have you), or encourage their own real life, or otherwise online friends to play with them and create a community in the game.\n\nAn interesting mechanic was born as a result: The meaning of the \"R\" in Role Playing Game had changed. When I think of the term \"Role Playing Game\", I frequently think of the term \"Roleplaying\", which to me means \"to act like someone or something else\". For example *the player plays the role of a traveling bard* in the D&amp;D sense. However, the word \"Role\" in this context is not one in the same, it has instead turned into \"Playing a specific Role in a group\", i.e. embracing the \"Trinity\" archtype of MMO combat where as a player you fill a \"role\" in your \"team\", that being a DPS, a Tank or a Healer. \n\nI am bringing this up because it brings to light a comparison to sports. Sports Teams are structured in the same way, very much how a Baseball (give me a break here, Sports are not my forte) has different fielding positions, so doesn't an MMO group.  Sports are inherently collectivist, just like groups in MMOs - There is no \"I\" in team as the old adage goes.\n\nRewards are also frequently given to both the *individual* as well as shared among the team. A cool sword drops in the dungeon? Well the system was designed for a coordinated team to decide who gets it (like the DPS). What do we get instead? A system that randomly give rewards out to players if they are in a pick up group. However, many MMOs also give a mission reward (e.g. for clearing the entire dungeon) which rewards each player on the team with something at the mission's end (like currency).\n\nBut surely, there must be some MMO that is individualist in nature you might ask? Well  there really isn't *anymore*. The best example I can think of is Runescape, which for better or for worst, did individual-focused combat for around a decade before moving onto the more collectivist approach. Some MMO-\"lite\" games like Warframe and Path of Exile simmilarly do well in rewarding individuals, but they are pretty far from the MMORPG genre.\n\n##In MOBAs and Similar Team Based Games\n\nIt can be pretty obvious that a second talking point when it comes to collectivism in gaming is centered around MOBAs. We have huge esports communities around these games, and whether or not people classify them as such, I think that games like CSGO and Fortnite also can classify as being a \"Multiplater Battle Arena\", However in the classic definition (i.e. games like DotA and League of Legends) a players' success frequently comes down to his team, despite certain prolific members in the community stating that the individual can \"carry\" their team (but then again, a Designated Hitter or Pitcher can carry their team in Baseball), Much of what I explained in the above section about positions can be applied here as well (following the traditional Carry-&gt;Support farm priority archtype), except we kick things up to 10 and add another layer of collectivism to the mix - people actually compete *as teams* in tournaments to earn prizes. Something that has driven this community from its inception.\n\nNow, what about the Individualist approach to MOBAs? I don't think it's there unless you consider outliers in the genre (Games like PUBG and Fortnite if you classify them as MOBAs). I played this type of games for many years with the individualist approach and I never felt like I was going anywhere. Maybe I am an exception.\n\n##Conclusion\n\nDo you have any input on this subject? Have you had any experiences with collectivism (or individualism) in games? Would you like games to be less collectivist in nature? I probably lost the main idea of why I made this thread - I have played games mainly as an individual all my life, and despite really liking both the MOBA and MMO genre, I could never get into them because I frankly, like to play solo and do not like to rely on others. I was wondering if anyone else could share their experiences with this. I think the biggest point I want to make is that **in many of these games the individual simply feels too weak unless he is in a team - and I hate this feeling**.",
        "created_utc": 1524358207,
        "upvote_ratio": ""
    },
    {
        "title": "God of war 4 kratos vs zeus Ps4 PRO full HD 60fps",
        "author": "vermadonprateek",
        "url": "https://www.reddit.com/r/truegaming/comments/8dztiy/god_of_war_4_kratos_vs_zeus_ps4_pro_full_hd_60fps/",
        "text": "[removed]",
        "created_utc": 1524356745,
        "upvote_ratio": ""
    },
    {
        "title": "MyGamesList -- I created a free program to allow you to view your gaming collection and various stats on your gaming habits!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8dzoh7/mygameslist_i_created_a_free_program_to_allow_you/",
        "text": "[removed]",
        "created_utc": 1524355328,
        "upvote_ratio": ""
    },
    {
        "title": "Wow, Celeste is difficult and satisfying.",
        "author": "ctarbet",
        "url": "https://www.reddit.com/r/truegaming/comments/8dzhw8/wow_celeste_is_difficult_and_satisfying/",
        "text": "[removed]",
        "created_utc": 1524353430,
        "upvote_ratio": ""
    },
    {
        "title": "What are level themes you almost always like?",
        "author": "Patchpen",
        "url": "https://www.reddit.com/r/truegaming/comments/8dz26n/what_are_level_themes_you_almost_always_like/",
        "text": "[removed]",
        "created_utc": 1524349045,
        "upvote_ratio": ""
    },
    {
        "title": "Just started a Gaming Channel",
        "author": "BigKahunaAtl7",
        "url": "https://www.reddit.com/r/truegaming/comments/8dxbs7/just_started_a_gaming_channel/",
        "text": "[removed]",
        "created_utc": 1524332856,
        "upvote_ratio": ""
    },
    {
        "title": "What is in the law or illegal? downloading pirated videogames? or there is a law not to record pirated videogames?",
        "author": "junzss9",
        "url": "https://www.reddit.com/r/truegaming/comments/8dwx5h/what_is_in_the_law_or_illegal_downloading_pirated/",
        "text": "[removed]",
        "created_utc": 1524329152,
        "upvote_ratio": ""
    },
    {
        "title": "7 epic ucoming games worth waiting for",
        "author": "1Game",
        "url": "https://www.reddit.com/r/truegaming/comments/8dvaof/7_epic_ucoming_games_worth_waiting_for/",
        "text": "[removed]",
        "created_utc": 1524311551,
        "upvote_ratio": ""
    },
    {
        "title": "Optimal settings BenQ RL 2455",
        "author": "Robinated",
        "url": "https://www.reddit.com/r/truegaming/comments/8dvaah/optimal_settings_benq_rl_2455/",
        "text": "[removed]",
        "created_utc": 1524311402,
        "upvote_ratio": ""
    },
    {
        "title": "Do you keep count to how many video games you have played?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8dtwh0/do_you_keep_count_to_how_many_video_games_you/",
        "text": "[deleted]",
        "created_utc": 1524289410,
        "upvote_ratio": ""
    },
    {
        "title": "Farcry 5 and the Savage Man",
        "author": "Steelquill",
        "url": "https://www.reddit.com/r/truegaming/comments/8dqpa5/farcry_5_and_the_savage_man/",
        "text": "Ever since this game was announced it has pissed me off. See ever since the shot in the arm that was Far Cry 3, all of the Far Cry games have been linked by a similar motif. Enlightened man butting up against savagery. The games have dealt with this in a number of ways and not all of them have been met with praise but even when they weren't, it was usually an upset. Remember how Farcry 4 was accused of racism because the (apparently) white villain was sitting dominantly over an apparent native? And then it turned out the villain was from Hong Kong, half British, and while the \"native\" depicted, Ajay, was the hero and an American? Oops.\n\nEven then though. The ideas were firmly established that those who are born to or trapped in places like Rook Island or Kyat must embrace a life of violence and moral compromise in order to survive. They can't rely on the systems and comforts of the modern and connected world so must use the tools and skills of generations past. The locations are characters themselves. Places where there is no rule of law. Where justice is defined by the hand that takes it. Where people try to survive by whatever skills makes them unfit or outlaws in society.\n\nAnd now that locale of the savage man includes . . . the modern United States. My enmity for this decision can't be put into polite terms.\n\nAlso adding to this fact is that Ubisoft is a French developer. This further angers me because it seems like Ubisoft is looking over the ocean at us and they see something that would fit right alongside human trafficking pirates and genocidal warlords. Choosing sensationalism and the worst possible version of us rather than truth and the best version of us. I'm not against satire, I do however wish for people to actually be a part of the place or thing they're satirizing.\n\nJust speaking as a proud patriot of my country, this troubles me. I would like to get this game because everyone says it's very good. I don't want to play an experience though where I'm being insulted by proxy for two hours or more a session.\n\nI invite discussion on this. Would love to be proven wrong, even. What I only ask for is that no spoilers be said. I don't need another reason not to buy the game.",
        "created_utc": 1524255822,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible that we might see games like Last of Us and the recent God of War game in the near future?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/truegaming/comments/8dpmll/is_it_possible_that_we_might_see_games_like_last/",
        "text": "So bear in mind that video games come in all different forms of art and everyone has their own tastes about video games \n\nSome do not care about heavy themes and only care about the fun.\n\nSome do not care about story and only about the multiplayer.\n\nWith that being said, there is no denying on the impact on that the recent video games like Last of Us and God of War have left among gamers and also non-gamers alike and quite possibly so, there are a few games released lately that rely a lot on what these games offer.\n\nBoth the Last of Us and the recent God of War game rely on putting heavy themes in their games and the relationship between the two characters in both games show a lot of thought, emotion and experiences that the characters from both games learn from each other and rely mostly on substance rather than  style\n\nJoel is a cynical, angry and battle-hardened survivor who is just trying to survive and cope with the loss of his child 20 years prior while Ellie is a curious teenager who did not what was life before the outbreak and there are is an increasing father-daughter relationship between the two and the game focuses on heavy themes like love and hate, survival and unity, the importance of life and living and family and also of death and the things that people need to do to survive.\n\nThe recent of God of War is almost the same.\n\nWhile Kratos wants to hide from his past, he has a lot to teach to his son but also his son has a lot to teach him. Kratos teaches his son how to survive and control his own anger and furiocity and how to be a effective warrior in this unforgiving and brutal world while his son also teaches him how to be in touch with his human side as Atrius is more altruistic and curious about the world around him unlike his father who is more grumpy and cynical yet also wise in his own way. Both these characters have to work with each other and also learn from one another too and the relationship between them also changes.\n\nThere is a lot of focus on substance rather than spectacle in these two games. Not just from their themes and stories but also from their mechanics.\n\nGameplay choices are limited and not that many focus on many options or cool combos (Like in the previous God of War games and the over-the-top feeling that kratos did) like the survival elements in the Last of Us were limited than had purpose and the player had to choose his options wisely especially on higher difficulties. This is similar to God of War as the weapons are more limited and also what Kratos and Atrius can do in combat but also have a lot of weight in them too especially in higher difficulties\n\nIt is very curious how we are also seeing these elements in other games recently too like the game  Horizon Zero Dawn with its speculator art design, the theme of hope and human survival, speculator and compelling story.\n\nEven the recent Legend of Zelda game has this. While there is not much story in it, the story is basically what the player does so technically, the story is created by the player along the way. The gameplay elements in the Legend of Zelda game are also impactful like the dynamic gameplay elements like the weather system or the use of the elements for certain puzzles and enemies (Even though these gameplay elements existed in previous Legend of Zelda games).\n\nEven the recent Assassin's Creed game, there is a lot of focus on spectacle and attention to detail of the historical authencity of the era which is a big triumph after the criticisms against Ubisoft as of late becuase of how they treated the Assassin's Creed franchise, and it even goes it a few certain heavy themes such as the morality between right and wrong which led to the creation of the Brotherhood (which is  somehow fitting given the era of the time with the Roman conquest of Egypt and the complicated politics between Cleopatra, Caesar and Augustus even though the story in the game is mostly fictional)\n\n(Heck, there is even an \"educational\" segment made by the developers for educational purposes, apart the controversy in a few areas of that segment)\n\nSo ... It is pretty clear that these kinds of games have a lot of impact on gamers worldwide and provide a lot of insight on how video games can be made to tell impactful and memorable stories or even heavy stories that may not be able to told in any other medium, or maybe provide elements in a video game that has impact on the player that you may not have the same impact in films or t.v. or books. \n\nSo it is no surprise that after all that work and passion behind the developers to make these games that they will eventually gain a lot of critical acclaim from both critics and gamers alike\n\nSo it brings me this question ... is it possible that future games will try to be released in this same manner? Are publishers and developers willing to put this much effort and budget to provide these kinds of games that may later by given a legendary and life-changing impact on how games are developed or even the players are impacted by these games",
        "created_utc": 1524247184,
        "upvote_ratio": ""
    },
    {
        "title": "Segmentation of game developers",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8do8pd/segmentation_of_game_developers/",
        "text": "[removed]",
        "created_utc": 1524236494,
        "upvote_ratio": ""
    },
    {
        "title": "How do we express a \"Middle Ground\" Opinion as strongly as people who love or hate a game? How can we express our complex love, hate, &amp; meh mixtures of opinions we have for 1 game vs others who imply they have a simple LOVE or HATE opinion?",
        "author": "oridjinn",
        "url": "https://www.reddit.com/r/truegaming/comments/8do8bd/how_do_we_express_a_middle_ground_opinion_as/",
        "text": "When speaking about Breath of The Wild on release day nearly everyone who spoke up was simply in absolute love with the game.  \n\nI was not. I had a complex opinion about the game. I would not insult myself by applying a score or a single word to it. (For the sake of argument and dealing with idiots I did apply these terms. But my personal feelings would never lock into these single minded ideals.)  \n\nBut.. there is the problem.. How can someone who other wise enjoys a game speak about it and not be attacked? And be able to defend themselves when they have no strong opinions on the  matter?  \n\nI mean. this is an issue that extends into our everyday lives.  \n\nWhen I say I go to Starbucks. I am attacked by multiple Dunkin Donuts lovers with a variety of reasons why they suck. They feel so strongly about it. But I cannot defend myself (Nor do I feel a need to, but I am just using an example)   \n\nPart of the problem is people are not used to \"Meh\" Opinions. They cannot handle it. and they tend to treat a meh opinion as the other person failing to defend themselves. And thus they win.  \n\nGood for them, they win and I am just sitting here drinking my coffee.    \n\nOr politics. Every single election (Well most) I sit there going \"Gee each one has such a variety of Pros and Cons. Who do i vote for?\"   \n\nAnd guess what, if I sit down and talk to people they tend to have this absolute LOVE for the 1 person thy want to win.. Which is fine i guess.. But it ALWAYS is because the person they hate did 1 thing wrong. 1 fucking thing.. Like... WHAT!?!?!?!  \n\nOk so they downvoted that bill that affects your father. Do you know why they voted against it? do you know what they did instead? Do you know what got that thing you dad has into place? Do you know what the other things that bill would do? aka Do you understand the complexities?  \n\nAnd almost always. ALMOST ALWAYS!!! These people did zero research. They only care about 1 piece of info with absolute ZERO context. And then they vote for the other person.  \n\nJust.. Like... WHAT THE FUCK!?  \n\nAnd that is exactly what I see with games.People just want to numb everything down to the most simplistic point fucking possible.  \n\nAnd this means that I need to come here, and MAYBE I will find a good conversation about a game... Unless there happens to be X number of these supporters or detractors for that game who find my post or comment first.  \n\nThen I am either swept up in a circle jerk of love or hate for that game. OR downvoted to hell by the same circle jerk. with maybe a dozen ignorant replies and maybe 1 or 2 guys i end up having a good conversation with.  \n\nBut why? Why the fuck can't people just... Not be that way?  \n\nI mean I can come into a room and say I and really enjoying something, and mention 1 thing I disliked and then people will attack me for hating that thing!!!  \n\nI just clearly stated \"I love this thing and really enjoy it.\" But they focus on the 1 or 2 negative points...  \n\nHaving a complex opinion about something tends to piss off the lovers and the haters of most things. And I have a long LONG history on my account of just being in the middle of most things.(when you do see a simply opinion from me it is either to keep things simple, because I do not want to fight, or because I know my audience.)     \n\nHere is what i think.. Reddit has 300+ million users? Well i think 15 Million are the vocal haters. 15 million are the vocal lovers. And the rest are normal people.. Who understand that there are complexities in everything. And we know when and how to express these feelings, and see no reason to argue with these other 30 million people.  \n\nBUT 98% of what we see are those 30 million people posting these extreme views, and 98% of what those people see is extreme views... and it makes it seem like that is all there is.   \n\nI am at that point where I am too afraid to post this.. I know I have a lot of things to clean up and clarify, but seeing as I am hitting this wall where i realize I do not want to fight about this.. I will pick a new option.. I will just go ahead and post this. As is. And take it from there.\n\n\n\n",
        "created_utc": 1524236410,
        "upvote_ratio": ""
    },
    {
        "title": "The state of progression systems in RPG style games.",
        "author": "Ky1e205",
        "url": "https://www.reddit.com/r/truegaming/comments/8dlgap/the_state_of_progression_systems_in_rpg_style/",
        "text": "Some friends and I recently started playing Tera with it's release on console.  The leveling rate in game is insanely fast compared to anything else I've ever played which lead me to looking into what the community of the game thinks in regards to the purpose of leveling in the first place.\n\nAfter finishing writing my post in the Tera subreddit where I basically ask the community how they feel the leveling speed affects their thoughts of the game it lead me to question the purpose of levels in RPGs/MMORPGs on the whole.  A character gaining levels in an RPG is meant to indicate progress and basically provides the player with opportunities to make the character they're playing as stronger or to unlock new abilities to use.  Now I'm beginning to wonder if we should be making more of an effort to move away from using leveling as the sole way for our characters to get stronger especially since it seems like communities who play these types of games are beginning to if not are already completely tired of the process.\n\nThe only MMO I've seen that manages to combine leveling with complete freedom to explore is Elder Scrolls Online.  Your level doesn't matter when it comes to engaging with content.  All that matters is your gear and your abilities as well as any modifications you make to them and your actual personal level of skill with playing your character.  Full disclosure I've haven't played ESO anywhere close to completion, but I still own it and probably will get through it one day.  It's the easiest MMO to just pick up and play with friends.  While not perfect, I feel like the sense of freedom that this game's progression system provides is a very good step in the right direction.\n\nHow does everyone here feel about leveling up characters as the core basis of progression?  Is it something we should be trying to completely do away with or should we be trying to retool it in a way that feels more engaging?  What ideas do you have that could be an innovation for progression systems in future RPGs?  What RPG style game have you played that have the best feeling progression system?",
        "created_utc": 1524204652,
        "upvote_ratio": ""
    },
    {
        "title": "How do you get over a disappointing game or movie?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8dl1ow/how_do_you_get_over_a_disappointing_game_or_movie/",
        "text": "[removed]",
        "created_utc": 1524199839,
        "upvote_ratio": ""
    },
    {
        "title": "Cant bring myself to replay Farcry 5.",
        "author": "CuriousMF1996",
        "url": "https://www.reddit.com/r/truegaming/comments/8dk4bi/cant_bring_myself_to_replay_farcry_5/",
        "text": "[removed]",
        "created_utc": 1524190204,
        "upvote_ratio": ""
    },
    {
        "title": "Dark souls's battle VS AC : Origin's batlle.",
        "author": "arries93",
        "url": "https://www.reddit.com/r/truegaming/comments/8djeqr/dark_soulss_battle_vs_ac_origins_batlle/",
        "text": "[removed]",
        "created_utc": 1524182890,
        "upvote_ratio": ""
    },
    {
        "title": "What game was the most rewarding/enjoyable to platinum for you?",
        "author": "Mysticedge",
        "url": "https://www.reddit.com/r/truegaming/comments/8dj1e2/what_game_was_the_most_rewardingenjoyable_to/",
        "text": "[removed]",
        "created_utc": 1524179463,
        "upvote_ratio": ""
    },
    {
        "title": "Where has Skyrim been all my life?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8dixfo/where_has_skyrim_been_all_my_life/",
        "text": "[removed]",
        "created_utc": 1524178489,
        "upvote_ratio": ""
    },
    {
        "title": "Should I buy mount and blade warband/any other game that’s kept you playing forever",
        "author": "AtomicAJ",
        "url": "https://www.reddit.com/r/truegaming/comments/8di8qb/should_i_buy_mount_and_blade_warbandany_other/",
        "text": "[removed]",
        "created_utc": 1524172668,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else find Ubisoft games exhausting?",
        "author": "Cynic_Mimic",
        "url": "https://www.reddit.com/r/truegaming/comments/8dha17/anyone_else_find_ubisoft_games_exhausting/",
        "text": "I've been trying to play Far Cry 5. I gave it about 6 hours and I'm done. I'm just done. I have no desire to continue. I think I've worked out my problem with these games though: Pacing. Not story pacing, but the pacing of the gameplay itself. Ubisoft studios seem to have no idea how to do that anymore. Far Cry 5 never gives you a moment of peace, it just gives you constant chaos. You're constantly being attacked, or doing the attacking yourself, and no-matter where you are, there is always action going on around you. There are always people chasing you, people screaming for your help, and I quickly got inundated with more missions than I knew what to do with. There's always someone calling you over for a side mission, multiple voices speaking at once, advising you to do a thousand different things, while gunshots crack through the air all around you and explosions go off in the distance. It's just a sensory overload of multiple activities happening at once, all the time, with little meaning behind any of them. \n\nThe problem with this design philosophy is that if all a game offers me is constant action, how can I be expected to keep appreciating that for 30 hours? There has to be a balance, and there has to be downtime. Downtime gives the action meaning, because it keeps things surprising, it keeps things interesting, and it gives you time to breathe. It lets you explore and take in the scenery, collect yourself, and prepare for the next encounter. But if all that's happening is constant action, then the action doesn't really mean anything. The action quickly gets stale because there's nothing to supplement it.\n\nConsequently, I find the game predictable and repetitive, and just utterly exhausting. Don't get me wrong, it's an adequate game, I suppose. Everything works as intended and the gameplay at its core is still fun, it's just that the design is so damn cluttered, which just drags everything down hard, at least for me. This is a problem I've had with Ubisoft games in general, Far Cry 3 (which I enjoyed) suffered with it too, but to a lesser extent. It's gotten worse and worse over the years, and fuck me, this is the worst so far. Ubisoft's obsession with filling the map with \"stuff to do\" and \"things happening\" has reached critical mass, to the point where none of it is even the slightest bit immersive or engaging.\n\nAC: Origins seemed to be improving things. The bloat was still there, but it felt less messy, a bit more cohesive, and they trimmed it all down. It seemed like things were getting a bit better with the bloat in Ubi open worlds, but now FC5 is ridiculous in this regard. It's like \"Instant Gratification: The Game.\" So maybe not? I don't know, but surely other people will get sick of this eventually. ",
        "created_utc": 1524165289,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion about the state of video game journalism",
        "author": "WardenAkatosh",
        "url": "https://www.reddit.com/r/truegaming/comments/8dfo53/discussion_about_the_state_of_video_game/",
        "text": "Something I've been thinking about recently is the lack of more historical or feature type content from mainstream video game outlets like IGN. Instead, YouTube channels like Super Bunnyhop, NoClip, or Gaming Historian are my go to places for interesting feature type content. Since these channels are supported by Pateron, there is clearly a need and a want for this type of content. Thoughts?\n\n",
        "created_utc": 1524153070,
        "upvote_ratio": ""
    },
    {
        "title": "Tales Of Berseria On Low End PC Test",
        "author": "jakesuperstar10",
        "url": "https://www.reddit.com/r/truegaming/comments/8df7v1/tales_of_berseria_on_low_end_pc_test/",
        "text": "[removed]",
        "created_utc": 1524149536,
        "upvote_ratio": ""
    },
    {
        "title": "Toxic ban",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8de912/toxic_ban/",
        "text": "[deleted]",
        "created_utc": 1524140824,
        "upvote_ratio": ""
    },
    {
        "title": "Riskopoly",
        "author": "ollehar",
        "url": "https://www.reddit.com/r/truegaming/comments/8ddzpx/riskopoly/",
        "text": "[removed]",
        "created_utc": 1524138008,
        "upvote_ratio": ""
    },
    {
        "title": "Underworlds in games",
        "author": "hollowcrown51",
        "url": "https://www.reddit.com/r/truegaming/comments/8ddts4/underworlds_in_games/",
        "text": "One think I love about both Skyrim and Baldur's Gate 2 is the presence of an \"underworld\" in these games which I feel make their open worlds more compelling and interesting and feel more interlinked.\n\nIn Baldur's Gate 2 you have a bunch of levels to the underworld area which I think is pretty cool. Most of the city areas will have a sewers map, with areas of the sewers either connecting to basements of buildings in the area or going deeper into secret lairs of thief organisations or ancient crypts, or even worse things. The further you go down, you get even more nasties, including lairs for demons, beholders, evil wizards and mindflayers which you can just stumble into. It's mainly confined to the city but later in the game you gain access to the Dark Elf homeland, the Underdark, which is connected to the overworld and contains its own settlements and areas for various monsters, which connect to a dungeon on the overworld and\n\nSkyrim obviously has a few \"cities\" with sewers which have multiple entrances and exists which is quite cool, as well as Blackreach which is a huge cavern connected to many entrances in the overworld as well as a bunch of dungeons. I think it's one of the best areas in Skyrim because it feels a bit otherworldy and as well as incredibly dangerous. First time you get down there you really feel like you are going somewhere super deep under the world into a forgotten and dangerous land which is magical. There's a bit of this in Oblivion and Morrowind but nothing as ambitious as Blackreach. \n\nI think the addition of a lower layer or layers to the game is something that has a lot of potential and can really make a game world feel more seedy, more deep, and more rewarding to explore. Do you know of any games which do a similar thing with an underworld, and do you think the concept could be expanded to make an entire game with an equally balanced underworld and overworld?\n",
        "created_utc": 1524136079,
        "upvote_ratio": ""
    },
    {
        "title": "What is the most powerful cinematic scene in a game?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8ddky3/what_is_the_most_powerful_cinematic_scene_in_a/",
        "text": "[deleted]",
        "created_utc": 1524132856,
        "upvote_ratio": ""
    },
    {
        "title": "What are indie games in development you must keep track of?",
        "author": "mastocklkaksi",
        "url": "https://www.reddit.com/r/truegaming/comments/8ddf89/what_are_indie_games_in_development_you_must_keep/",
        "text": "[removed]",
        "created_utc": 1524130672,
        "upvote_ratio": ""
    },
    {
        "title": "Games with a lobby where you can chill?",
        "author": "putifarrix",
        "url": "https://www.reddit.com/r/truegaming/comments/8dcajg/games_with_a_lobby_where_you_can_chill/",
        "text": "[removed]",
        "created_utc": 1524114991,
        "upvote_ratio": ""
    },
    {
        "title": "Will There Ever Be Another Game Like the First Guild Wars?",
        "author": "ELR198",
        "url": "https://www.reddit.com/r/truegaming/comments/8dbgtm/will_there_ever_be_another_game_like_the_first/",
        "text": "That video game was an integral part of my childhood and adolescence. I absolutely loved the combat mechanics, skill system, and general gameplay. Most importantly, and I stand by this opinion, it had the greatest PvP of any MMO full stop. If twitch had been a thing ten years ago, Guild Wars would have been very, very popular.\n\nI have yet to even hear of another MMO that plays in a remotely similar manner. If you never played the game, then you obviously won't be able to understand. It's just the amazing complexity that was afforded to the game through the interaction of skills such as hexes, enchantments, energy denial, acrivation denial, recharge denial, snares etc.. The amount of strategy involved in build making and cooperation was really off the charts. The number of builds and group compositions created over the course  of the game that performed effectively in one role or multiple is really immeasurable.\n\nThe modern MMO market is pretty stagnant. We've got the big four (WoW, GW2, ESO, FFXIIII) and that's about it. Are there any developers out there that are currently, or could conceivably, create another MMO that is similar to GW1? \n\n",
        "created_utc": 1524106032,
        "upvote_ratio": ""
    },
    {
        "title": "MMORPG Mobile?",
        "author": "Lujose",
        "url": "https://www.reddit.com/r/truegaming/comments/8d9s9q/mmorpg_mobile/",
        "text": "[removed]",
        "created_utc": 1524090523,
        "upvote_ratio": ""
    },
    {
        "title": "Is there something that you miss in the gaming industry? Or is there anything that makes you really angry about current gaming services? How can I help you?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8d9buo/is_there_something_that_you_miss_in_the_gaming/",
        "text": "[removed]",
        "created_utc": 1524086775,
        "upvote_ratio": ""
    },
    {
        "title": "Is VR just a gimmick?",
        "author": "9funnydude",
        "url": "https://www.reddit.com/r/truegaming/comments/8d8ugy/is_vr_just_a_gimmick/",
        "text": "[removed]",
        "created_utc": 1524083049,
        "upvote_ratio": ""
    },
    {
        "title": "Snatcher: Thirty Years On",
        "author": "Superbeanietoon",
        "url": "https://www.reddit.com/r/truegaming/comments/8d8gh6/snatcher_thirty_years_on/",
        "text": "[removed]",
        "created_utc": 1524080031,
        "upvote_ratio": ""
    },
    {
        "title": "Breath of the Wild: The Most Conflicted I've Ever Felt About a Video Game",
        "author": "neversleepsthejudge",
        "url": "https://www.reddit.com/r/truegaming/comments/8d89ap/breath_of_the_wild_the_most_conflicted_ive_ever/",
        "text": "Well, it's been over a year now, the hype has dwindled, all the DLC is out, I'm about half way through a slog for all 900 korok seeds...\n\nI've really wanted to talk about this game for a long time, but it's taken me a full year, (no exaggeration) to really pin point my thoughts on it. Around the anniversary of the game (last month) it finally hit me!\n\nThis is the most conflicted I've ever been about a video game in my entire life.\n\nNow don't get me wrong, there are games that took me a while to appreciate and there are games I loved initially and later cooled on, but I've always been able to sort of land on a score (out of 10) for how I felt. Well, I just can't with this game.\n\nI am one of the biggest Zelda fans I know. I own every single game and have completed each 100% and that includes the less than awesome ones. I just want to state that up front.\n\nNow to start with what I love, it's really kind of useless. What I love about this game is what everyone loves about this game and what every outlet, news or otherwise, professional critic, or armchair neckbeard has already waxed poetic about: the open world is a masterpiece with very little filler that feels natural and necessary and molds itself perfectly with the gameplay, the game doesn't guide you and allows you to craft your own narrative as you discover the world literally at your own pace - taking on challenges much too difficult out of \"order\", etc. the beautiful scenery/aesthetics, and ultimately, the experience as a whole and the freedom within.\n\nEven now, I can recognize all of these things in particular moments, like when I beat the final Master Sword challenge, or just watching a sunrise over an ancient cliff with sedimentary rock showing ages I truly believe could have come before the artificial time I am supposedly living in.\n\nBut all of these things cannot overcome this feeling in the pit of my stomach--this sort of pit that I couldn't quite place the origin of. Well, I think I can sort of better explain myself, now. Unfortunately, it’s going to have to start with a list of the things that I think detract from the game:\n\n* The dungeons: When I think of Zelda, I think of big, diverse dungeons with unique themes and puzzles. BotW’s dungeons were… subpar. Full stop these were a homogenous mess of short, quick dungeons that had a single good central mechanic, but then threw out everything else that makes Zelda dungeons great. They were ugly, there were next to no enemies to fight, even the bosses all melded together. This, to me, was easily the “worst” or “least good” part of BotW, even a solid DLC dungeon at the end couldn’t make up for this.\n\n* The lack of towns: There were 3-4 major towns I the entire game and compared to the sheer size of it, that’s kinda pathetic. Not only were there so few of them, but they were minuscule in their own right. I get that they were going for a desolated kingdom, but it doesn’t even really feel like that given how healthy and fine the existing towns are - the only hints being a few burnt houses the closer you get to the castle - it just feels like a HUGELY missed opportunity and makes the world feel kind of empty\n\n* The items: They got rid of all of the key items that you needed to collect. One of my all time favorite aspects of the Zelda series is collecting necessary items that can be combined to solve puzzles, defeat enemies, and create truly unique gameplay experiences. Instead, they give us everything we need up front, taking away some of the thrill of hunting them down and watching your collection grow as you accumulate the tools needed to open up new areas - unnecessary largely since all areas are basically open from the get go\n\n* Too much repetition in quests/shrines: I mean, this is self explanatory. A huge world with a small amount of quests, most of which were, frankly kinda garbage! If any other series had some of the “quests” that make up Botw’s they’d get the shaft in review - and yet there’s a whole world to explore and the potential for quests was huge! The shrine’s themselves were a bit too numerous and repetitive as well - not nearly as much as the what’s required for the padding that is the korok seeds: spend hours doing exceedingly trite activities such as picking up a rock for the 234th time or picking up a rock and *placing it on an unfinished circle* for the 102nd time.\n\n* I have so many more in a short list as well:\n* Broken armor and weapons can’t be fixed and have ridiculously short lifespans\n* Story is almost nonexistent and what is there is… not good\n* Gannon was a joke of a boss\n* The graphics are gorgeous from afar… and absolutely muddy up close\n* The music, while beautifully ambient, was nothing compared to the orchestrated absolute MASTERPIECES of previous entries\n* Unable to complete both hearts And stamina is a completionist’s version of hell\n\nAnd yet, with all of this criticism, I still had this *feeling* numerous times, that I was playing something absolutely masterful. I will never forget the first time I left the plateau, or climbed Mt. Lanayru to try to jump on the back of an ENORMOUS dragon, or flew into the lava-filled fissures of Death Mountain; the first time I entered the expansive desert and saw the overbearing statues… these experiences… were almost like being a kid again. Like the first time I stepped out into Hyrule Field in OOT. And hell, the gameplay - my GOD I had so much fun and the challenge felt so good almost the entire way through. The dungeons, while not Zelda dungeons as I know them, were still a fun challenge as well and their central gimmicks were welcome puzzles even if they were short…\n\nI think all in all, it was just… I mean… I’m still playing this game all the time! It’s such a wonder - a true open world in a sense I’ve literally never felt with any other video game. Ever.\n\nSo here I am, halfway through the korok seed collecting, 1 year later. Still playing, still loving it, but still so conflicted on how to score it, still unable to ignore that pit in my stomach. Every time I read a review giving it a 10/10 and calling it a masterpiece I can’t help but cringe. It’s not a voluntary action. I WANT Zelda to be a masterpiece, but this, wherever it stands, is not a masterpiece to me.\n\nIf I were to give it a score right now, it’d be between an 8-9/10, but I know there are moments that make me feel it is closer to 9.5/10 or 7.5/10 and you know what? I’m ok with that, now.\n\nOne of the best video essays I’ve seen on this (I’ll have to find it again) summed up my thoughts perfectly when he said that BotW was the first, revolutionary step for a new type of Zelda. It’s flawed but the flaws can be overcome and polished off.\n\nThis game may not be a masterpiece, but it is revolutionary in a way VERY few games today are. \n\nI really hope they take the few criticisms BotW’s gotten to heart and run with them for the next game, because I can’t wait to see how this revolution develops.\n\nSorry again for the rambling thoughts, all, I just had to get that off my chest.",
        "created_utc": 1524078491,
        "upvote_ratio": ""
    },
    {
        "title": "Reccomendations for stealth games?",
        "author": "bigmoist-ChrisHansen",
        "url": "https://www.reddit.com/r/truegaming/comments/8d86fm/reccomendations_for_stealth_games/",
        "text": "[removed]",
        "created_utc": 1524077902,
        "upvote_ratio": ""
    },
    {
        "title": "This had me dead😂😂😂",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8d6x08/this_had_me_dead/",
        "text": "[removed]",
        "created_utc": 1524068516,
        "upvote_ratio": ""
    },
    {
        "title": "What's the gaming world coming to ?",
        "author": "rexcor11",
        "url": "https://www.reddit.com/r/truegaming/comments/8d6ajr/whats_the_gaming_world_coming_to/",
        "text": "[removed]",
        "created_utc": 1524063803,
        "upvote_ratio": ""
    },
    {
        "title": "Just wanted share this with you guys",
        "author": "TEAMEMAR",
        "url": "https://www.reddit.com/r/PS4/comments/8d061u/trophy_i_have_100_platinum_trophy_for_far_cry_5/",
        "text": "",
        "created_utc": 1524054169,
        "upvote_ratio": ""
    },
    {
        "title": "Fellow gamers: i don't see what's so special about COD series all i see is a game is a game &amp; be warned this may or may not be a long rant/vent",
        "author": "lordscot",
        "url": "https://www.reddit.com/r/truegaming/comments/8d2iih/fellow_gamers_i_dont_see_whats_so_special_about/",
        "text": "[removed]",
        "created_utc": 1524020924,
        "upvote_ratio": ""
    },
    {
        "title": "how to invite friends?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8d21o2/how_to_invite_friends/",
        "text": "[removed]",
        "created_utc": 1524016365,
        "upvote_ratio": ""
    },
    {
        "title": "Xbox Gamertag List , Hmu on kik: @Pattern.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8czuvo/xbox_gamertag_list_hmu_on_kik_pattern/",
        "text": "[removed]",
        "created_utc": 1523997574,
        "upvote_ratio": ""
    },
    {
        "title": "Im getting neck pain using my new gaming chair",
        "author": "gamerukali",
        "url": "https://www.reddit.com/r/truegaming/comments/8cz9xs/im_getting_neck_pain_using_my_new_gaming_chair/",
        "text": "[removed]",
        "created_utc": 1523993134,
        "upvote_ratio": ""
    },
    {
        "title": "I worry that some incredible gameplay experiences are being lost in major studio releases as large developers become more interested in making gameplay maximally accessible than in pushing the interactive nature of games as a means of directing player experience.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8cyfxu/i_worry_that_some_incredible_gameplay_experiences/",
        "text": "For instance (and I list these not as definitive evidence of how right I am but more as a way of explaining what I mean), the way the player controls a character. Take the Resident Evil saga for instance; early Resident Evil games were well-known for their difficult controls, making the player feel cramped and trapped, whereas the last couple of games have taken a much more straight-shooter, we-don't-want-anyone's-toes-stepped-on approach. And this in games which take pains in every other respect to make gameplay have that claustrophobic feeling manifest in earlier games. Tomb Raider is another example I could bring up; compare the games of old, which made use of their game's difficult controls and incorporated that into their puzzles, with the modern series which feels a bit like you're pushing around a brilliantly generated movie set that the developers want to make DAMN SURE you see every inch of.\n\nNow, am I *attacking* games like this for desiring accessibility and a certain ease of control for the player? No. Do I think they are inherently *bad* and *unfaithful* for trying to move in that direction? Not at all. Do I think it's somehow *wrong* to have quickly-navigable controls in action-horror games? Not in the slightest. I know there are counter-examples that could be provided, and I want to make it clear that I'm speaking in a broad way about many developers as an aggregate and list the above examples more to explain my point than to provide definitive evidence.\n\nWhat I am saying, is that it feels sometimes as though many AAA developers have lost touch with a certain player-level sense of challenge and struggle, and I worry about losing some of that as gaming enters a period of maximized graphics, access, and profit power. I think the way many developers approach concepts like difficulty is being increasingly pushed towards \"let's make our game more challenging by altering a weapon's damage or adding more enemies\" and in many cases away from \"let's make our game more difficult by forcing the player to interact with our game's mechanics in a new or more complex way.\"  I am hopeful in many ways as I think VR brings a whole host of new possibilities to the table and I'm excited to see what major developers bring to the table as the platform becomes better understood.",
        "created_utc": 1523986892,
        "upvote_ratio": ""
    },
    {
        "title": "I finally found a copy of Operation Flashpoint, it's called ARMA: Cold War Assault",
        "author": "Riekopo",
        "url": "https://www.reddit.com/r/truegaming/comments/8cxt0p/i_finally_found_a_copy_of_operation_flashpoint/",
        "text": "[removed]",
        "created_utc": 1523982037,
        "upvote_ratio": ""
    },
    {
        "title": "Curated Matchmaking for competitive games",
        "author": "zeddyzed",
        "url": "https://www.reddit.com/r/gamedesign/comments/8cw9ba/curated_matchmaking_for_competitive_games/",
        "text": "",
        "created_utc": 1523969908,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about maximum level boosts in MMORPG?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8cw95q/how_do_you_feel_about_maximum_level_boosts_in/",
        "text": "Two of the biggest MMORPGs, WoW and GW2 both offer max level boosts if you purchase an expansion.\n\nDo you feel like you still relate to your character even though you haven't played their journey to maximum level?\n\nDo you feel like its stupid to skip the levelling part and skip straight to the endgame? Does that mean the game is only endgame? Is endgame even still \"end\"game when its the entire game?",
        "created_utc": 1523969318,
        "upvote_ratio": ""
    },
    {
        "title": "\"Deal with the Devil\", or: Psychological Analysis in Games (and instances of Faustian themes)",
        "author": "WASDtalk",
        "url": "https://www.reddit.com/r/truegaming/comments/8cuw72/deal_with_the_devil_or_psychological_analysis_in/",
        "text": "Hey /r/truegaming, it's been a while! [WASDtalk](http://i.imgur.com/Y0GYtHu.png) is intended as a smorgasbord of different topics and discussions involving games and game developers, what's good, what's bad, what's ugly, and what's interesting!\n\n\n\nThis go-around, I wanted to talk about psychological implementation in games, how developers do it, and examples of which succeeded and which didn't. Games are primarily a source of entertainment, a creation of art and technology that allows us to interact with it, whether it's a linear pathway or a world of exploration tied into it. And in a lot of these, the psychology behind it is fairly direct and basic, making it easy to follow and not hard to engage with the multitude of aspects that are involved in the game. There are, however, a few games that break the fourth wall to jump into your mind, per se, and make you question and think about your own decisions. In the highlighted examples, I look into the aspects of psychology centered around the insatiable quest for knowledge of the player, consequences be damned.\n\n\n\nThe first example of a game that does this would be **Undertale**. Undertale, while fairly limited in the actual pathing of the game's plot, has a variety of endings and implications that the actions you take as the main character are either good or bad, and specifically asks you why you take those actions. Even if you try to re-do it and take away those actions, the game remembers you. In a few of the endings, the game (more through creative means than psychology) makes it feel like it takes control of itself rather than accepting your choices, closing the program altogether or booting up to specific screens that are a continuation of your previous choices. At that point, the game is interacting less with the main character, and more with you, as the player. It's an interesting look into how you play the game, as with other games, if your character turns into a homicidal maniac, the other characters turn against your character, and generally tied to notions of the game's setting and the background of your character. In Undertale, the antagonistic entities of the game directly question the purpose of your actions, and at times, express their revulsion at the morbid curiosity of you, the player.\n\n\nThe second one is a little more out of place, which would be **Stellaris**. This example is actually much more specific, and though is even more limited than the first one, still pleads for the player to turn back. The game has an event that is called [\"The End of the Cycle\"](https://stellaris.paradoxwikis.com/Crisis#The_End_of_the_Cycle), where you communicate with an ethereal being to commit yourself to a Covenant that gives you a significant increase in resources and turnaround time, but with a hidden consequence. The game, in bold, red letters, says **\"Do not do this.\"** But, curiosity and lust for power being what it is, the player presses it anyways. At the end of 50 in-game years, your entire empire is consumed by The Shroud, the worlds you settled on can never be settled on again, and the remainder of your empire (which consists of a single planet randomly selected out of any that are available) becomes hated by everyone for your actions. Again, this is a fairly minor example, but the idea that you willingly submit your entire empire for a chance at destroying your enemies is an interesting concept.\n\nThe last example I'll use here has a very peculiar story behind it; what started as a concept by one of the writers for the game attracted a significant crowd of like-minded individuals who were willing to give everything to explore the unique path before them. **Fallen London**, a browser game that later provided a setting for the spinoffs Sunless Sea and Sunless Skies, had a storyline in the game known as [Seeking Mr. Eaten's Name](https://www.failbettergames.com/seeking-mr-eatens-name/). In this storyline, in order to seek the name, you take on increasingly burdening tasks that result in you giving up all your connections, turning on others seeking the name, ruining your character's stats, and in the end, your character is rendered unusable, everything associated with it is lost. Along the way, you are repeatedly warned to not seek the name. At certain points, you're presented opportunities to turn back, and even at the very end, you have the chance to walk away from it. Most people don't, considering everything they've given up to this point. The storyline was so popular the writer had to shut down the storyline for a time, due to it being buggy, but the overwhelming amount of people who enjoyed the self-destructive nature of it was noted by the developers.\n\n\nThough these games only look at a single direct aspect of psychological analysis in games, the unusual premise of each gives a more introspective view into playing them. They make you look beyond just being the \"good guy vs. bad guy\", giving you a chance at asking the question: *Why? Why kill everyone? Why sacrifice everything I worked for? [Should I have turned back?](http://gifimage.net/wp-content/uploads/2017/06/i-dont-know-what-i-expected-gif-10.gif) Was this worth it?* The cause and effect scenarios that reach beyond the direct implications and into the seat of the player are rare instances, but when they appear, they can be powerful.\n\n\nSo let me ask: **What other examples of this do you know of? Are there any other psychological aspects/facets in games that are interesting to you? How could developers explore these opportunities better?**\n\nAlways love to hear your guys' thoughts. There's probably a lot of instances/games I'm missing altogether, but those stuck with me for the reasons listed above. I'm interested to see what pops up!\n\n",
        "created_utc": 1523952066,
        "upvote_ratio": ""
    },
    {
        "title": "Breathing New Life into Skyrim By Walking Everywhere",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8cun28/breathing_new_life_into_skyrim_by_walking/",
        "text": "As someone with around 550 hours of Skyrim played, I think I'm somewhere in the above average playtime category.  Far from some, with thousands of hours, but enough to say I've thoroughly played Skyrim (for me 500+ hours in any game is phenomenal replayability).  300 of those hours, at least, have to be from false starts.  A failed experiment to make an Argonian assassin, or the umpteenth \"True Dragonborn\" Nord Warrior.  All with a vast assortment of mods changing and improving the game.\n\nI found that I was nevertheless stumbling into a major obstacle in the way of my enjoyment:  the feeling of having done everything before.  I'd been the Dragonborn, the Harbinger, the ArchMage and so on, so doing it all again seldom felt exciting.  Likewise, the various familiar dungeons became dull, especially as I developed a routine of locations to visit at the start of a new game.  About a year ago I tried a new playthrough after a year's hiatus from the game, but it fizzled out almost immediately and I concluded I was done with Skyrim forever.\n\nA week ago I got the itch to play it again, but was doubtful based on past experiences.  The itch persisted, so I reinstalled the game with a new batch of mods and decided to just try it.  I'd roll a proper mage with no armour and no weapons, which I'd never actually tried before.  I'd delve into alchemy, which was a type of crafting I'd neglected.  I'd roll a Breton for a change.  I always felt that the game just made sense for a Nord character, and that roleplaying was required to give other races a sense of purpose.  And so, I roleplayed.  My Breton was someone heading out into the world in search of knowledge, magical power and riches.  The arrest by the Imperials and attempted execution only enhanced my drive to become strong.  Discovering I was Dragonborn was just icing on the cake.  Perhaps I'd even investigate vampirism as a source of immortality and greater powers.\n\nSo far so good.  But, and this cannot be overstated, the most important change has been my house rule to never, ever fast travel (even by carriage!) anywhere in the game.  I'm just pretending the feature doesn't exist, and so forcing myself to walk everywhere.\n\nAt first, I feared this would be frightfully boring.  I based this on my reactions to receiving quests that sent me to the other end of Skyrim.  Before, I'd have a situation like the quest line with Delphine when she asks you to meet her in Kynesgrove.  Usually, I hadn't been over there yet, so I'd have to fast travel to Whiterun, carriage to Windhelm, then run to Kynesgrove.  A pain in the ass.  Or a quest way the hell off the beaten path so that not even a carriage could shave much time of the journey.  \n\nAnd yet, I'm enjoying it.  I've had to adjust my game.  Before, I played Skyrim questlines like I eat a bag of chips/crisps:  I just shovel them in to my mouth until I grope around in an empty bag and realize, to my surprise and dismay, that I'm done - that's it, nothing left.  I was not alone in lamenting the \"short\" quest lines like the College of Winterhold.  Showing up at level 4 and then, after three hours of play, donning the robes of the Archmage at level 9.  How silly and unrealistic.\n\nBut now, I'm doing quests as if they were errands.  I left the college after the Saarthal quest with the instructions to fetch books for the librarian.  I had a couple of other quests for college members as well as the Jarl of Winterhold.  I decided I would not return to the college until I had all of those quests completed.  And now, I'm just getting back with the books, with Shalidor's writings, with the Helm of Winterhold, with the completed bounty for a dragon.  I'm also a good 5-6 levels higher than I had been when I'd left, because other errands from other cities had occupied me while I was on the road (killing bears for Temba Wide-Arm, or retrieving the Horn of Jurgen Windcaller).  My main magical skills have actually gone up, and I haven't had to intentionally train them.  By the time I actually finish the College questline I'll probably be level 30+ and actually a powerful mage with expert level spells, instead of some talentless hack who showed up on his first day and left that same night as the boss.\n\nWandering and doing quests in a location-based errand system has breathed new life into the game.  I'm not blowing through questlines in a single evening, and left wondering, \"That's it?\"\n\nWhat's more, I'm discovering things I hadn't experienced in 550 hours of gameplay.  How often can anyone say that?  For example, I learned by following Delphine all the way to Kynesgrove on foot that she had some dialogue pertaining to the journey.  I'd never heard it.  Before she used to always annoy me, but the little bits of travel dialogue actually grew her character just enough that I found myself respecting her.\n\nI'm also appreciating the landscape more.  Don't get me wrong - I loved wandering around in the past, but I always did it in short bursts.  \"I'm just going to walk for an hour and see what happens.\"  Going on foot 100% of the time has caused me to start to memorize landmarks as I do when walking someplace in real life.  I relied on the map and fast travel so extensively before that I never learned the Skyrim landscape even in 550 hours of play.  I've honestly never fully explored the Reach or the furthest northern reaches in all that time.  I'll correct that in this playthrough.\n\nThese thoughts have made me wonder about game design, but I don't find myself insisting that RPGs should get rid of fast travel, or reward players for exploring more than if they just played as they please.  I thought I would, but I don't think that's reasonable.  Just as there are players who introduced no fast travel house rules from day 1 and loved it, there are players who really enjoy the \"wolf down a bag of chips\" style of gaming.  I certainly did, as at least 200 of those 550 hours of Skyrim were very much enjoyed by me.  \n\nInstead I just think that people should attempt to broaden their horizons once in a while if they find parts of a game lacking, or wish they could forget a game to experience it again.  I used to believe the College questline and others sucked because I was almost immediately finished and in charge, but now I don't get that sense from padding my game with actual adventuring (adventuring!  In an RPG!  What a novel concept!).  \n\nI don't blame the developers for \"hiding\" this more in-depth experience under fast travel icons and features of convenience, since perhaps a majority of players definitely want and appreciate those features.  I just blame myself for having kept my mind so narrow for all of this time.  If anything, perhaps the developers could put a disclaimer up when you start a new game:\n\n\"FYI:  This game has been designed for you to make use of fast travel points and other conveniences, but has also been designed to allow you to roleplay and take the long way between destinations.  For those wishing to experience as much as possible in limited time, we recommend the former playstyle.  For those wishing for a more intimate experience with the game, we recommend ignoring features like fast travel.  Enjoy!\"  ",
        "created_utc": 1523948452,
        "upvote_ratio": ""
    },
    {
        "title": "Something I recently noticed about myself: I find grinding fairly theurapeutic and satisfying. Anyone else? Is there a point where it cuts off for you if so?",
        "author": "AnokataX",
        "url": "https://www.reddit.com/r/truegaming/comments/8cuftf/something_i_recently_noticed_about_myself_i_find/",
        "text": "[removed]",
        "created_utc": 1523945779,
        "upvote_ratio": ""
    },
    {
        "title": "Games like Resident Evil 4 for Windows",
        "author": "Gamewastasty",
        "url": "https://www.reddit.com/r/truegaming/comments/8cu69a/games_like_resident_evil_4_for_windows/",
        "text": "[removed]",
        "created_utc": 1523942445,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know of a good mobile mmorpg which is preferably player based economy?",
        "author": "Lujose",
        "url": "https://www.reddit.com/r/truegaming/comments/8cu5o7/does_anyone_know_of_a_good_mobile_mmorpg_which_is/",
        "text": "[removed]",
        "created_utc": 1523942238,
        "upvote_ratio": ""
    },
    {
        "title": "Undertale in 15 Years and the nature of games like it",
        "author": "Purpletofucrate",
        "url": "https://www.reddit.com/r/truegaming/comments/8csyk4/undertale_in_15_years_and_the_nature_of_games/",
        "text": "I have been thinking lately, and I was wondering what Undertale will look like fifteen years in the future.  As we all know, Undertale was hugely successful, grew a large following, a toxic fan base, and the majority of the internet is incredibly divided about it now. Looking back on it, will it seem stupid? A classic? Will the divisiveness be forgotten and it be evaluated on its merits? This also got me thinking about something else. Were there other games similar to Undertale in the past? What games were those? How do we evaluate them now? And what does this mean for Undertale's future?",
        "created_utc": 1523929641,
        "upvote_ratio": ""
    },
    {
        "title": "Your very own evolution as a gamer.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8csuvm/your_very_own_evolution_as_a_gamer/",
        "text": "[deleted]",
        "created_utc": 1523928669,
        "upvote_ratio": ""
    },
    {
        "title": "What Are Some Fun Free PC Games",
        "author": "ByoFrost",
        "url": "https://www.reddit.com/r/truegaming/comments/8cs6iq/what_are_some_fun_free_pc_games/",
        "text": "[removed]",
        "created_utc": 1523922452,
        "upvote_ratio": ""
    },
    {
        "title": "Xbox Tag Store , Hmu on kik: @Pattern.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8cs1u3/xbox_tag_store_hmu_on_kik_pattern/",
        "text": "[removed]",
        "created_utc": 1523921257,
        "upvote_ratio": ""
    },
    {
        "title": "Is there something like a steam community market on android? Some place where you can sell/buy/exchange your in game items?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8crpv4/is_there_something_like_a_steam_community_market/",
        "text": "[deleted]",
        "created_utc": 1523918345,
        "upvote_ratio": ""
    },
    {
        "title": "Is there something like a steam community market on android? Some place where you can sell/buy/exchange your in game items?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8crm5d/is_there_something_like_a_steam_community_market/",
        "text": "[removed]",
        "created_utc": 1523917459,
        "upvote_ratio": ""
    },
    {
        "title": "Ideas for beat 'em up gameplay.",
        "author": "Grim_Ork",
        "url": "https://www.reddit.com/r/truegaming/comments/8cqrin/ideas_for_beat_em_up_gameplay/",
        "text": "[removed]",
        "created_utc": 1523910637,
        "upvote_ratio": ""
    },
    {
        "title": "\"Masterpiece\"; and the replayability of games",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8cp5qt/masterpiece_and_the_replayability_of_games/",
        "text": "With the upcoming release of God of War this Friday, the reviews have been astounding in terms of critical praise and overall reception from both critics and the hype of fans. One excerpt floating around is, \"Game of the Generation,\" however, it feels like we've heard this since the release of the 8th generation. Uncharted 4, Horizon, Yakuza 0 and so forth are all recommended with high praise, claiming how they push forward the medium of gaming and put the maturity into the art form.\n\nThere's an issue that I've had, particularly with Yakuza 0, Uncharted 4 and the upcoming God of War is with the current storytelling trend. With Yakuza 0, I've seen praise all across the board about how great the story and characters are with a meaty crime story but ended up being a very long, drawn out and wacky version of what was claimed, with very poor gameplay accompanied with it. Uncharted 4 on the other hand felt like a complete remake of 3 without much drama and arc to it - tons of plot points brought up and resolved in this game while also giving us a very boring first half without any of the signature moments of an Uncharted game. Horizon as well wasn't very good and didn't deserve much of the praise it got - it had a wonderful color template and a nice looking open world, but that's as far as the praise should go; the plot was poor, the gameplay was okay and the open world was a typical checklist of things to do without much depth. We all have our differing opinions, but why do these games get a pass when there are obvious problems?\n\nI've noticed that time and time again, it feels as if replayability in games are dwindling in favor of \"cinematic storytelling\" without remembering that they're still a game at heart. With the reviews given, you would think these games would be replayed over and over again but it seems most of the time, even with the fan base, that it's a one time run and a completionist run, partly because the game just doesn't hold up well. I keep going back to TLOU to replay because I genuinely think it has some great gameplay and the story has the pacing just right to where I want to continue to be invested in the world. The game continues to shine with every replay and picking up on the foreshadowing and various bits of lore that I may have forgotten or glossed over.\n\nWith all that being said, with the term \"masterpiece\" being given like candy, does it demote the phrase to be less of a prestigious claim or are we praising mediocrity because we are less accustomed to the glaring issues present without the hype and on a second playthrough? or am I missing something in these games that propels it from mediocrity to where it's claimed to be?",
        "created_utc": 1523898646,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we get that feeling of not knowing what game to play?",
        "author": "GTR_Helix",
        "url": "https://www.reddit.com/r/truegaming/comments/8cok1w/why_do_we_get_that_feeling_of_not_knowing_what/",
        "text": "[removed]",
        "created_utc": 1523894045,
        "upvote_ratio": ""
    },
    {
        "title": "Ubisoft gets a bad rap",
        "author": "SpookyLlama",
        "url": "https://www.reddit.com/r/truegaming/comments/8cocxr/ubisoft_gets_a_bad_rap/",
        "text": "**Disclaimer: I play on console so I don't have a PC perspective on things**\n\nUbisoft seems to get a lot of flak on reddit and on the internet in general.  Google 'ubisoft sucks' and you'll see the hate they get.  I know that circlejerks are just that and they tend to over exaggerate, but I absolutely love Ubisoft games and don't understand any of the hate that they get.\n\nUbisoft has made most of my favourite franchises, and I think they consistently pull out some of the most enjoyable AAA titles out there:\n\n* Prince of Persia\n* Far Cry\n* Assassin's Creed\n* Rainbow 6\n* Rayman\n* Splinter Cell\n\nI've never had a bad experience (outside of what is expected) with a ubisoft title, and I've also never had a bad experience with uPlay, which only exists to give me free stuff from what I've seen.\n\nAnyone else think that they are far better than they get given credit for?  Or am I missing reasons why ubisoft aren't as great as I think they are?",
        "created_utc": 1523892486,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of Blizzard issuing bans for false reports.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8cnpxg/what_do_you_think_of_blizzard_issuing_bans_for/",
        "text": "[removed]",
        "created_utc": 1523887277,
        "upvote_ratio": ""
    },
    {
        "title": "Twitch live stream",
        "author": "Dekaln360",
        "url": "https://www.reddit.com/r/truegaming/comments/8cnp8z/twitch_live_stream/",
        "text": "[removed]",
        "created_utc": 1523887109,
        "upvote_ratio": ""
    },
    {
        "title": "Migration and political refugees in video games",
        "author": "Two_Eyes",
        "url": "https://www.reddit.com/r/truegaming/comments/8cn4sk/migration_and_political_refugees_in_video_games/",
        "text": "[removed]",
        "created_utc": 1523881671,
        "upvote_ratio": ""
    },
    {
        "title": "If you guys haveapp nana or nana web please enter my code it is ......a25544614",
        "author": "abking1254",
        "url": "https://www.reddit.com/r/truegaming/comments/8cm6zn/if_you_guys_haveapp_nana_or_nana_web_please_enter/",
        "text": "[removed]",
        "created_utc": 1523869683,
        "upvote_ratio": ""
    },
    {
        "title": "Which PC games are best played with a controller?",
        "author": "generally-speaking",
        "url": "https://www.reddit.com/r/truegaming/comments/8cltih/which_pc_games_are_best_played_with_a_controller/",
        "text": "[removed]",
        "created_utc": 1523864006,
        "upvote_ratio": ""
    },
    {
        "title": "Xbox Tags ! OG &amp; Semi OG Hmu on kik",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8cl67a/xbox_tags_og_semi_og_hmu_on_kik/",
        "text": "[removed]",
        "created_utc": 1523855250,
        "upvote_ratio": ""
    },
    {
        "title": "New FPS titles",
        "author": "Unicorns669",
        "url": "https://www.reddit.com/r/truegaming/comments/8cinas/new_fps_titles/",
        "text": "[removed]",
        "created_utc": 1523829896,
        "upvote_ratio": ""
    },
    {
        "title": "VR gaming survey for university project, please help me!",
        "author": "joohndooe",
        "url": "https://www.reddit.com/r/truegaming/comments/8cikiu/vr_gaming_survey_for_university_project_please/",
        "text": "[removed]",
        "created_utc": 1523829221,
        "upvote_ratio": ""
    },
    {
        "title": "The Biggest Problem with movie adaptations of games: Games are too long.",
        "author": "SYZekrom",
        "url": "https://www.reddit.com/r/truegaming/comments/8cig3i/the_biggest_problem_with_movie_adaptations_of/",
        "text": "I don't have some in depth analysis or anything like that. I just felt like mentioning this because I've seen this surprisingly little. Perhaps its because movies divided into parts are looked down upon, but I feel most games, if they were ever made into a movie, would make much better sense as a series of movies.\n\nTake Twilight Princess for example. Go on YouTube and search up \"All Twilight Princess Cutscenes\".\n\nThree and a half hours. All the cutscenes in the game take three and a half hours. And quite obviously, there's a lot more to the story found in the gameplay that can't be ignored. Howlongtobeat.com says the game's 28 hours to beat on a rushed playthrough. The Bug Limit Any% Speedrun (Limited glitches allowed, all dungeons need to be beaten) takes 6 hours. Yet with all these video game movies, I'm supposed to believe they do an entire game justice in a  two and a half hour movie?\n\nIn my eyes, A game like Twilight Princess needs a minimum of three movies, possibly four or five to be comfortable.\n\n* One for the beginning of the adventure up until the end of the first dungeon, where the plot is Link must learn to become a hero and save his village's children. This is the movie which establishes the world and culture of the people, the lore.\n\n* One continuing from then onto fixing the Fused Shadow for Midna and freeing the Light Spirits from the Twilight.\n\n* One for retrieving the pieces of the mirror.\n\n* One for the Palace of Twilight and Hyrule Castle. \n\nWhen you think about it, a small section of a game has more than enough plot surrounding it to make a full movie. The average video game that people want to see as a movie is much more than a movie can handle. Just look at the length of the average movie synopsis and compare it to a video game synopsis. A game like Kirby: Planet Robobot has thirty minutes of cutscenes. That's a game that could fit into a single movie. ",
        "created_utc": 1523828127,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone ever feel pressure to put a lot of hours into console initially to justify its price?",
        "author": "MakeADamnSchedule",
        "url": "https://www.reddit.com/r/truegaming/comments/8cifh8/does_anyone_ever_feel_pressure_to_put_a_lot_of/",
        "text": "[removed]",
        "created_utc": 1523827987,
        "upvote_ratio": ""
    },
    {
        "title": "Why don’t open world game maps exist as a sphere?",
        "author": "aschulz90",
        "url": "https://www.reddit.com/r/truegaming/comments/8chlkr/why_dont_open_world_game_maps_exist_as_a_sphere/",
        "text": "[removed]",
        "created_utc": 1523820976,
        "upvote_ratio": ""
    },
    {
        "title": "Rise of the Tomb Raider Timed Exclusivity Hate",
        "author": "zwgmu7321",
        "url": "https://www.reddit.com/r/truegaming/comments/8chivx/rise_of_the_tomb_raider_timed_exclusivity_hate/",
        "text": "It's been over 2 years since the games was released, but I still stumble across threads and comments bitching about Rise of the Tomb Raider's one year exclusivity deal with Microsoft. Why does this one game in particular get so much hate when exclusives and timed exclusives are fairly common throughout the industry?\n\nHere are some comments I found from the recent Shadow of the Tomb Raider teaser.\n\n* https://www.reddit.com/r/PS4/comments/84ma71/video_shadow_of_the_tomb_raider_announcement/dvrcjae/\n* https://www.reddit.com/r/Games/comments/84m9qp/shadow_of_the_tomb_raider_teaser_trailer/dvre8kb/\n* https://www.reddit.com/r/PS4/comments/84ma71/video_shadow_of_the_tomb_raider_announcement/dvsxzu5/\n* https://www.reddit.com/r/PS4/comments/84ma71/video_shadow_of_the_tomb_raider_announcement/dvqvkk7/\n\nI also remember reading a comment from a guy who said he was going to boycott Shadow of the Tomb Raider due to Rise's one year exclusivity agreement. I can't seem to find it right now.",
        "created_utc": 1523820344,
        "upvote_ratio": ""
    },
    {
        "title": "Just finished Shadow of Mordor, anyone else disappointed with the ending?",
        "author": "theiansider",
        "url": "https://www.reddit.com/r/truegaming/comments/8chho9/just_finished_shadow_of_mordor_anyone_else/",
        "text": "[removed]",
        "created_utc": 1523820070,
        "upvote_ratio": ""
    },
    {
        "title": "The \"you're wasting your life\" argument...",
        "author": "tylercoder",
        "url": "https://www.reddit.com/r/truegaming/comments/8cf360/the_youre_wasting_your_life_argument/",
        "text": "[removed]",
        "created_utc": 1523798495,
        "upvote_ratio": ""
    },
    {
        "title": "It's time for Telltale Games to mature as a studio",
        "author": "Odins-left-eye",
        "url": "https://www.reddit.com/r/truegaming/comments/8cf00w/its_time_for_telltale_games_to_mature_as_a_studio/",
        "text": "I really enjoyed the first season of The Walking Dead. It was a new type of experience, well written and acted, with some of the best characters seen to date in the medium. Even though I was being funneled through a preset sequence of events, the developers did a good job of making me believe that my choices were the reason we ended up in the situations that we were presented with. Lately, though, the studio seems content to just keep making the same game with a new skin. There are still some quirky, fun times to be had, such as with Tales from the Borderlands, but the style of game is beginning to wear thin.\n\nTelltale has done nothing to address the two largest criticisms leveled at them: shallow gameplay mechanics and fake choices. At this point they really should be looking to incorporate collision detection into the action sequences, rather than simply relying on quick time events. There's no reason a story-driven game cannot feature at least some rudimentary combat that has a one-to-one input/output from the player. And the lack of real substantive outcomes to choices is getting more transparent with each game of theirs I have played. It came to a head in the climax of the first episode of Game of Thrones, which I consider to be the all time low point for the studio **(mild spoilers ahead.)**\n\nThere's a point in this game when you are given the choice whether to let Ramsey Bolton bring his armed guards into your gate. Having watched the TV show, I'm not a moron, so of course I refused. The game then pulls the \"Dost thou love me? But thou must!\" bullshit, and says \"No, sorry. You actually decided to let them in.\"\n\nWhen branched decision making **is literally the only mechanic in your game** then it had damn well better be done properly! If Telltale wants to make movies, they should make movies. Game of Thrones is in no way, shape, or form a video game. I'm not even going to finish this one. I was so irritated by this transparent attempt at gameplay, the equivalent of letting your little brother hold a controller that isn't plugged in while you rescue the princess, that I uninstalled the game. \n\nI know you really want everyone to see all the assets you worked hard creating, Telltale, but come on. What would it really take to have entire areas that only get visited if certain decisions are made? What would it take to have entire plot points discarded if a certain character dies, instead of all deaths being predetermined and unavoidable? Make the game shorter if you have to, but make it so any two people have a substantively different experience that is actually impacted by choices. \n\nTelltale needs to decide what kind of studio it's going to be in the future. At some point they are going to have to evolve and begin adding new mechanics and real choices, or they'll probably go out of business within the next few years.\n\n",
        "created_utc": 1523797492,
        "upvote_ratio": ""
    },
    {
        "title": "Exclusives and the Availability of Art",
        "author": "ClubChaos",
        "url": "https://www.reddit.com/r/truegaming/comments/8ceau3/exclusives_and_the_availability_of_art/",
        "text": "God of War will soon be released and has been universally praised as the best game of this generation. God of War is exclusive to the Playstation 4.  \n\nThis is not a new thing.  If we look back Ocarina of Time was exclusive to the N64, Halo was exclusive to the Xbox, etc..  It seems to go hand-in-hand with video games.  The biggest and best titles are almost always attached to one brand and one console.  \n\nAs video games mature and the industry attracts more talent, games become a more accepted form of art.  Video gaming is an industry and these are products.  Commercial art is common throughout history, for many years the only place to see great pieces of art were in the place where that actual piece of art existed and was commissioned.  You could say the Mona Lisa was \"exclusive\" to France.   Film and Music by extension also were very similar until technology and methods of distribution removed these types of barriers.  \n\nIdeally for anyone selling a piece of art, film or music they want to get it into as many peoples hands as possible on as many formats/platforms as possible.  The games industry is unique that it completely depends on the computer and the various software to support whatever tools we are using.  Because of the inherent nature of software development it is not only a lucrative opportunity for companies to get you into their ecosystem but also sometimes a necessity to only develop on one platform because of the difficulty in porting a game to a different one.\n\nAs far as humanity is concerned, truly great art should be available to everyone.  As far as games as a commercial entity is concerned we won't be seeing the nature of exclusives changing anytime soon.  The only real \"thing\" there is preserving the integrity of games as art is emulation.  Emulation allows for these experiences to be preserved and available for as many devices/os the developers choose to support.\n\nDo you think the nature of commercial video games will forever detract from video games being accepted as art by the general public?  Are the alternatives to emulation to \"freeing\" these titles from their commercial nature?  What is the long-term scenario for video games?  Will popular video games follow the same path Disney is taking by keeping a stranglehold on their IP?",
        "created_utc": 1523787308,
        "upvote_ratio": ""
    },
    {
        "title": "best gaming moment in gaming history , change my mind",
        "author": "shpat123",
        "url": "https://www.reddit.com/r/truegaming/comments/8cdnth/best_gaming_moment_in_gaming_history_change_my/",
        "text": "[removed]",
        "created_utc": 1523776345,
        "upvote_ratio": ""
    },
    {
        "title": "Iron Spider Help me Subscribe my youtube channel",
        "author": "Regurus94",
        "url": "https://www.reddit.com/r/truegaming/comments/8cdj4f/iron_spider_help_me_subscribe_my_youtube_channel/",
        "text": "[removed]",
        "created_utc": 1523774280,
        "upvote_ratio": ""
    },
    {
        "title": "My Warcraft 3 friend slanders me, is racist and abusive, and blocked me on Steam",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8cd5ob/my_warcraft_3_friend_slanders_me_is_racist_and/",
        "text": "[removed]",
        "created_utc": 1523768800,
        "upvote_ratio": ""
    },
    {
        "title": "Is handheld gaming as we know it dying?",
        "author": "o_controverso",
        "url": "https://www.reddit.com/r/truegaming/comments/8cctd1/is_handheld_gaming_as_we_know_it_dying/",
        "text": "By \"handheld game\" I mean a type of games specifically made of due to the limitations and strengths in handheld hardware\n\nGames that used their hardware unique features, were made to be played in smaller sessions, had smaller budgets and teams, were more experimental, etc... Games like Warioware, Professor Layton, Ace Attorney, Rhythm Heaven, The World Ends With You... I loved all those different and even wacky titles you could only find on handheld, they are experiences you simply don't get in a console\n\nPersonally, I like best these type of games rather than ports or poorly done recreation of things that already exist in consoles. It's one of the reasons the PSP and Vita never sounded as appealing to me compared to the DS and 3DS. Sony market their handhelds as slightly weaker versions of their consoles, while the DS/3DS couldn't be more far apart from what a normal console is like\n\nBut now with the introduction of the Nintendo Switch which blurs the line between console and handheld it seems clear to me that we will lose those style of games. With the power the device and the type of games it's getting, it's very clear this machine is more than capable of dealing with modern AAA games without too much sacrifices\n\nIt would be a shame to see handheld games stop being made as playing some of them made me really impressed on how they helped push the medium forward:\n\nDo you know which game first had Mario do a triple jump and an arc-like jump when you made a sudden turn? If you think Super Mario 64 you were wrong, it was actually Donkey Kong for the Game Boy\n\nA more obvious example: Mario 3D Land experimented with the Mario formula and was so successful they made a way more polished sequel for the Wii U\n\nI think with the Switch we will have less of those lower scope games and I can't help but feel a little sad. Zelda on the 3DS feels so much different from Zelda on the Switch and both are such awesome ganes in their own way\n\nSo what do you think? Will handheld games stop existing or will they go on? I certainly hope I'm wrong on this one",
        "created_utc": 1523764384,
        "upvote_ratio": ""
    },
    {
        "title": "How have games set in your town, if any, affected you?",
        "author": "Kompanion",
        "url": "https://www.reddit.com/r/truegaming/comments/8ccryf/how_have_games_set_in_your_town_if_any_affected/",
        "text": "As someone who lived in Dubai, I loved spec ops the line. Most of the time in the game was spent  recognizing street signs and familiar landmarks. But the already serious story hit me even more hard [not spoiling anything] when I saw firsthand the conditions under which Dubai itself is set in, with places I usually walk through on the weekends reduced to ruins covered by sand. (Great attention to detail by the way).\n\nBut in the end, what got me was the fact that the enemies I fought in the game early on were literally Dubai residents, showing the same cultural mannerisms and nationalities as people I know in the city myself rather than being from some faceless evil.inc organization. What really immersed me was the fact that oddly, in some way, there was a subconcious feeling that the game was a bit too real, and that the events portrayed in the game would actually have some possibility of happening(alright not to the extent the game portrays, but my point still stands)\n\nHow about you guys, have you ever played a game that hits a bit close to home?\n\nSorry if I sounded a bit obnoxious, I've been lurking here for a while but thought of actually posting for once.\n\nEDIT:Town, city, maybe even country or state...etc.",
        "created_utc": 1523763918,
        "upvote_ratio": ""
    },
    {
        "title": "In any shooting games &amp; horror/survival horror games what moment made you say,go or think oh shit when &amp; if you are running low on ammo or ran out of ammo",
        "author": "lordscot",
        "url": "https://www.reddit.com/r/truegaming/comments/8cb990/in_any_shooting_games_horrorsurvival_horror_games/",
        "text": "[removed]",
        "created_utc": 1523747377,
        "upvote_ratio": ""
    },
    {
        "title": "You have the opportunity to give the Pope or Dalai Lama one game, what would it be and why?",
        "author": "AZTERIX_",
        "url": "https://www.reddit.com/r/truegaming/comments/8c7sgp/you_have_the_opportunity_to_give_the_pope_or/",
        "text": "Historical/political/religious reason with your answers welcome.  What sort of game could open an old religious leader up to the possibilities of gaming as a medium.  It's tough to say and I was inclined to say it was impossible without solid knowledge of gaming controls, but this comment\n\n&gt;I personally believe that Tetris on a Gameboy Color would have been the perfect choice for both the symbolic and practical reason. Not only could it be played immediately by the Pope would qualifying as a small gift, but it also represents how gaming unites people of completely different parts of the world and culture, in a way that can transcend language unlike all any other forms of media. It was developed in the USSR yet managed to gain popularity internationally, despite the Cold War, showing how gaming can work in both communism and capitalism.\n\ninspired me to ask you guys to think out of the box and come up with some more clever answers, maybe more specifically about the play itself, rather than external theory.\n\nPlease pick better than matpat. (J/k), dont kill me.",
        "created_utc": 1523715270,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for a shooter where you can build and command an army.",
        "author": "Red_wretch",
        "url": "https://www.reddit.com/r/truegaming/comments/8c7ddf/im_looking_for_a_shooter_where_you_can_build_and/",
        "text": "[removed]",
        "created_utc": 1523710583,
        "upvote_ratio": ""
    },
    {
        "title": "Which games have the most accurate weather in your opinion my friends?",
        "author": "BlooFlea",
        "url": "https://www.reddit.com/r/truegaming/comments/8c7b7q/which_games_have_the_most_accurate_weather_in/",
        "text": "[removed]",
        "created_utc": 1523709823,
        "upvote_ratio": ""
    },
    {
        "title": "How fine is the line between being toxic and a trash talker?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8c780l/how_fine_is_the_line_between_being_toxic_and_a/",
        "text": "In combat sports, trash talking is expected and you have to be mentally tough enough to not let the opponent get in your head. \nI know that the majority of people play these games as a hobby and want nothing to do with that attitude and therefore, the competitive players are in an ocean of casual players and hobbyists. \nCut racism, sexism and homophobia, and maybe this would make it more clear that it's all about pure trash talking and nothing more. \n\nI'm talking about trash talking certain opponents and teammates who have a real meltdown while yelling at the mic. \n\n\n\n\n",
        "created_utc": 1523708678,
        "upvote_ratio": ""
    },
    {
        "title": "Need some advice",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8c5u5m/need_some_advice/",
        "text": "[removed]",
        "created_utc": 1523687211,
        "upvote_ratio": ""
    },
    {
        "title": "Guest Characters in Fighting Games",
        "author": "WestG1992",
        "url": "https://www.reddit.com/r/truegaming/comments/8c5mjd/guest_characters_in_fighting_games/",
        "text": "Hey all, it occurs to me that I don't know what goes into getting a guest character into a fighting game. Take Geralt appearing in Soul Calibur 6. Would Bandai-Namco discuss getting the rights from CD Projekt Red? Would CD Projekt visit Bandai-Namco and see if they'd like to take on Geralt? Would money exchange hands either to purchase the rights in the first case, or have your character appear in another developers game in the second? Would developers on good terms do this for free? Is that legally viable?\n\nTl;dr: I've realized I don't know what would even need to be done to get Geralt into Soul Calibur 6, or Noctis and Geese Howard into Tekken 7.",
        "created_utc": 1523684172,
        "upvote_ratio": ""
    },
    {
        "title": "What's some of the weirdest things you've seen in games?",
        "author": "KokosCommunity",
        "url": "https://www.reddit.com/r/truegaming/comments/8c3j9g/whats_some_of_the_weirdest_things_youve_seen_in/",
        "text": "[removed]",
        "created_utc": 1523661606,
        "upvote_ratio": ""
    },
    {
        "title": "I have no skill whatsoever when it comes to FPS. I can’t aim, and i’m constantly choking.",
        "author": "Zavetrix",
        "url": "https://www.reddit.com/r/truegaming/comments/8c2v93/i_have_no_skill_whatsoever_when_it_comes_to_fps_i/",
        "text": "[removed]",
        "created_utc": 1523655667,
        "upvote_ratio": ""
    },
    {
        "title": "When do you have gotten your money worth with a game?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8c2sft/when_do_you_have_gotten_your_money_worth_with_a/",
        "text": "[deleted]",
        "created_utc": 1523655010,
        "upvote_ratio": ""
    },
    {
        "title": "Sea of Thieves: Player Generated Content vs Game Generated Content, and 'Is a Sandbox Enough?'",
        "author": "echolog",
        "url": "https://www.reddit.com/r/truegaming/comments/8c20y5/sea_of_thieves_player_generated_content_vs_game/",
        "text": "Today. Rare put out their '[Content Roadmap](https://www.seaofthieves.com/news/sea-of-thieves-content-plans)' for Sea of Thieves, detailing (vaguely) the next few months of updates. I figured this would be a good time for some discussion on what this game is, where it is going, and whether or not it is worth a full $60 price tag. Since launch, this game has been incredibly divisive. One camp of players says it is the most fun they have ever had, while another camp says there simply isn't enough to do within the game. I like to think they are both right in their own regards.\n\nIn my experience as an Alpha/Beta tester over the past few months, the game is a lot of fun just to play. You can log in, go sailing, and kind of do whatever you want. There are no rules that say \"you have to play the game a certain way or you're doing it wrong\", and that's great. The events that occur organically within the game between you and other players is incredibly memorable and honestly just includes some of the best player interactions I've ever had. That being said, is that enough? Is it enough to just \"be a pirate\" and make your own fun? Or does the game need to provide some content of its own to keep you going?\n\nTo better understand the situation, let's break down the question and define what this game truly has to offer:\n\n-----\n\n**Question 1**: *What can you experience simply by jumping in your ship and sailing out to sea?*\n\nLet's say you spawn in on an outpost, either by yourself or with a group of people. You don't pick up any voyages and you just head out to sea. What exactly can you do? Essentially your experience is going to boil down to two things: *Player Generated Content* and *Game Generated Content*. The player generated content includes you pretending to be a pirate, and you interacting with other players who are also pretending to be pirates. The player interaction starts any time you see another ship and decide to either engage or avoid them. You can go after them, try to sink/kill them, steal their stuff, etc. That right there is technically a source of 'unlimited content' just from PvP (or more rarely, friendly cooperation). If you try to avoid PvP, you're left with the content that the game actually provides for you. Outside of voyages, this content is basically limited to island/ocean exploration, randomly generated shipwrecks, skull forts, and the Kraken (which currently exists only to hinder you, and offers no rewards for defeating it).\n\n**TL;DR**: *Player Interaction = Unlimited Content. Otherwise you can explore, search shipwrecks, and attempt skull forts.*\n\n-----\n\n**Question 2**: *What other content does the game itself provide for you to do?*\n\nThe answer to this question is basically voyages. Voyages are the primary means of acquiring loot, which you can then turn in for gold and reputation, which you can then use to purchase cosmetics. Loot (chests, skulls, etc) also exists as an incentive for PvP in order to steal it from other players. Eventually the reputation from these voyages allows you to become a Pirate Legend, which is the end-goal of the entire game (aside from fun for the sake of fun, of course). The voyages are provided by three reputation vendors: Gold Hoarders, Order of Souls, and Merchant Alliance. All three of these vendors send you on essentially the same kind of fetch quest. You pick up a voyage, head to an island, get a thing (either dig for a chest, kill skeletons for their skulls, or collect animals and supplies), then head back to an outpost and turn in that thing for gold and reputation. You do all of this while either engaging in or avoiding PvP, as mentioned earlier.\n\n**TL;DR**: *You go on a voyage from one of three reputation vendors, all of which contain the same 'go to island, do a thing, go to outpost' gameplay loop.*\n\n-----\n\n**Question 3**: *Other than fun for the sake of fun, what goals are there to achieve in this game?*\n\nMost will argue that the primary goal of this game is just to have fun, and that's fair. That's the true goal of any game if you think about it. However, most games will try provide you with some kind of objective, and rewards for completing those objective. In Sea of Thieves, the primary goals are to acquire cosmetics to make a unique Pirate and Ship, and to eventually reach Pirate Legend status. You achieve these goals by participating in voyages (or stealing other players loot), which reward you with gold and reputation. You use gold to purchase cosmetics, and as your reputation increases you gain access to more cosmetics. This is the main progression system in the game and it gives you a general guide on how you can spend your time within the game.\n\n**TL;DR**: *You can acquire gold and reputation to purchase cosmetics, and eventually hit Pirate Legend, which has a few more cosmetics.*\n\n-----\n\n**The Big Question**: *Is a sandbox enough? Is player generated content all you need in a $60 AAA title?*\n\nI believe the answer to this question is entirely subjective, and it's up to you to answer it for yourself, but let's discuss in the comments below!\n",
        "created_utc": 1523648783,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think about battle royal games? How often do you play this genre?",
        "author": "CryptoSoul_",
        "url": "https://www.reddit.com/r/truegaming/comments/8c0f1j/what_do_you_think_about_battle_royal_games_how/",
        "text": "[removed]",
        "created_utc": 1523636311,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think about battle royal games? How often do you play this genre?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8c0a0n/what_do_you_think_about_battle_royal_games_how/",
        "text": "[removed]",
        "created_utc": 1523635263,
        "upvote_ratio": ""
    },
    {
        "title": "You know Fortnite and other Battle Royale games are truly a fad when the only reason everybody plays the game is because everybody is playing the game.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/8bzr1j/you_know_fortnite_and_other_battle_royale_games/",
        "text": "[removed]",
        "created_utc": 1523631160,
        "upvote_ratio": ""
    },
    {
        "title": "Joystick and Mouse Combo",
        "author": "ScarletFace",
        "url": "https://www.reddit.com/r/truegaming/comments/8bzo81/joystick_and_mouse_combo/",
        "text": "When I first got in to gaming years a go I noticed some of the \"better\" players at the local lans used to fetch a joystick to use whilst playing fps/tps games.\n\nThey would use the joystick in their left hand, and the mouse in their right.\n\nToday this popped in to my mind, but I don't know anyone who does this now. None of my friends do and I haven't noticed them used by streamers or professionals.\n\nDoes anyone here use them, or know someone who does?\n\nIn theory it would make playing some games easier, but in practice I'm not so sure. What do you think? ",
        "created_utc": 1523630559,
        "upvote_ratio": ""
    },
    {
        "title": "Pokemon's Immersion Paradox",
        "author": "OdaibaBay",
        "url": "https://www.reddit.com/r/truegaming/comments/8bzmcx/pokemons_immersion_paradox/",
        "text": "Like many people on here I've grown up with the Pokemon franchise. The games have had an immense impact on my life, starting me down the road to many of my hobbies and interests. Connecting with fans of the series was the main reason I started using the internet and I continue to love it to this day. This impact can be a double edged sword though, since any discussion of such an influential game is liable to lead to accusations of 'nostalgia' or 'rose-tinded glasses'. This isn't unique to me, analysing a game which came out 20 years ago is always going to require careful parsing.\n\nWith this in mind I'd like to discuss an interesting conflict which has developed within Pokemon. Something which I believe causes a lot of conflict when discussing the direction of the series. This can lead to people talking over each other, and is where a lot of the swamp of supposed 'nostalgia' comes from. I'm going to call this 'Pokemon's Immersion Paradox': The more the game gives you, the less immersed the player becomes. \n\nThe first set of Pokemon games, the ones which captured not just the first Pokemon generation but the entire world, were Red and Blue. By way of their existence on the Game Boy these games couldn't really show you everything they wanted to. A lot was implied by very basic graphics- bubbles, flames, screen shaking, character sprites. But this simplicity didn't seem to impact many people's interaction with the world. Granted this was helped a lot by the super-popular anime helping stoke imaginations. But it's almost like the more simplistic the graphics the more space there was to insert the players own interpretation into the world.\n\nSince the game didn't explicitly articulate what your character thought, felt or wanted- and didn't show your Pokemon moving and shakin' in the actual battles, this meant that it was easy to project onto the game and essentially 'role-play' as whoever you or your Pokemon wanted. Even your character's appearance (only shown fully drawn a handful of times (2?) throughout the game) was up for debate- since most of the time you appeared as a squat pixel blob.\n\nThe Pokemon themselves were laden with often quite goofy, silly or even ugly looking sprites. And yet they managed to evoke very real and powerful emotions in a generation of gamers.\nWhat does it really matter whether you like red derpy dragon who does the fire attack or puffy round turtle who does the wave attack? Well it mattered a lot. Again, this goes back to filling in the gaps- it's up to you to imagine what your Charizard or Blastoise looked and acted like, and their relationship they had to you. \n\n*As another example, of course when you used 'Fly' to move from city to city you'd be doing it on your mighty Moltres- not on the weird burd thing shown in the actual game.*\n\nThis trend started waning with later generations, each one lessening the grit of the previous ones and thickening the world they presented. G/S introduced clean sprites and bright colour- bringing the game inline with the anime's aesthetic, R/S brought in a detailed, complex overworld, D/P added pseudo-3D aspects- making the game appear more rounded, and so on. Characters became bouncier, chattier, Pokemon battles more exciting, and the world around you began to look just like it did for Ash in 1997. Right up til the most recent generation Sun and Moon.\n\nIn Sun and Moon Pokemon has shed almost all its grit. You play the game as part of a cast of well-rounded anime-style characters intimately involved in a dense storyline. While your character doesn't speak, they react and respond to those around them constantly. At the start of the game you explicitly define what your character looks like- in full colourful 3D, with the option of further customisation throughout the game. Pokemon attacks are now almost a mirror of the anime, with huge blazing flames and crashing water in real time. The world is more varied and better looking than ever before. \n\nSo what does this development mean to Pokemon? I'm going to posit that while the world of S/M could be read as captivating and immersive, to others it can feel dry and stale. This isn't just related to S/M, but the general trend Pokemon has taken. When everything is laid out for me, what can I fill in myself? When people complain about S/M's 'handholding', cutscenes and story, part of this dislike is driven by the lack of space the game gives for interpretation, mystery, or even projection. \n\nThink of it like the difference between reading a book and watching a film. Both are just as valid forms of art, and debating which is 'best' is a complete fools errand. Yet why would someone want to read a book, full of words and nothing more, when a film can give you sights- sounds- spectacle, direct you through the story itself with perfectly organised story-beats? Well reading involved filling in the gaps between words, imagining what is left unwritten, debating subtext and creating mental images without them being explicitly given to you. That's what keeps reading alive. The same is true for why someone may in (good faith) prefer earlier Pokemon games \n\nWhat people miss about Pokemon isn't really any specific element of 'nostalgia'. People don't want to have to slog through Kanto for the 17th time using the same old team from 20 years ago. *In fact, and this is a story for another day, the Pokemon franchises over-reliance Generation 1's Pokemon to connect with fans is a noticeable flaw*. But people miss having some degree of independence, or prerogative themselves, whether real or perceived.\n\nInstead of giving a framework to play within Pokemon games increasingly tell you story. You join in, rather than forge your own path. The reasons for this aren't a mystery- Pokemon games look a lot better now, and in order to compete you have to update. But it's this difference which causes people to blithely say they prefer the earlier generations, without really thinking exactly why. And it's why fans of the newer games look back at Gen 1 and 2 and see a lopsided grungy mess, compared to the smooth polish of Gens 6 and 7 and think ' &gt;_&gt; genwunners'.\n\nNow to my question. Is there a way to marry these two warring houses? Is it possible for Pokemon to maintain a level of ruggedness, to allow mystery and space for role-play, while keeping the accessible polish of newer games? Was this aspect destined to recede with time? Was it all just a mistake derived from the Gameboy hardware? Is it just not possible to create such gaps these days- we expect our games to be as professional and holistic as possible. \n\nWith the upcoming Pokemon Switch Game I'm interested to see what Game Freak is cooking up. \n\n",
        "created_utc": 1523630132,
        "upvote_ratio": ""
    }
]