[
    {
        "title": "How do you counter the types of arguments that start with: \"Among all the religions in the world ONLY Christianity &lt;insert blank here&gt;\"",
        "author": "ianyboo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f9xh1/how_do_you_counter_the_types_of_arguments_that/",
        "text": "Common examples/variations would be:\n\n* \"Only Christianity has a god who loved humanity enough to come down to earth, live as a mortal man, and die for our sins\"\n* \"All other religions provide salvation thorough works but Christianity offers it as a free gift to those that believe\"\n\nI often find myself not familiar enough with the claims of other religions to really feel comfortable trying to take apart the idea that Christianity is unique, special, or otherwise stands so far above the rest that it simply *must* be true. \n\nIt's frustrating and one of my weakest areas when in discussion with folks. How do you handle these sorts of claims? ",
        "created_utc": 1409678774,
        "upvote_ratio": ""
    },
    {
        "title": "What are you top 5 arguments?",
        "author": "czah7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f9vya/what_are_you_top_5_arguments/",
        "text": "Maybe a quick ELI5 version with links to a more in depth explanation of the argument.\n\nMine are, in no specific order:\n\n1.  [**The problem of Evil**.](http://en.wikipedia.org/wiki/Problem_of_evil) - How can evil exist with an omnipotent, omniscient, omnibenevolent God.\n\n2.  **Evil in the bible**.  Some verse sources(there are more): *Hosea 13:16, Exodus 12:29, Joshua 6:20-21, Deuteronomy 2:32-35, Deuteronomy 3:3-7, Numbers 31:7-18, 1 Samuel 15:1-9, Numbers 5:12-24*\n\n3. [**Noah's ark**](http://www.talkorigins.org/faqs/faq-noahs-ark.html#georecord) - Too much evidence that it didn't happen.  And it's a story not meant to be taking as a parable.  According to the bible if you really don't push your own words into it...It was a global flood that wiped out everything on earth.  This cannot have happened.\n\n4.  **Hell** - logically inconsistent with any Christian teachings.\n\n5. **Other Religions** - So many other religions have their own stories that differ from each other.  And, mostly, each person in each religion has had some personal experience with their described deity.  \n\nObviously there are more.  And probably better ones that can convince more people.  But for me personally these hold the most weight.\n\nWhat are your top 5?\n\nEDIT:  I get that there is a lack of evidence and the onus is and should be on the theist to prove their claim.  But just pretend you are supposed to provide an atheist debater 5 of the best arguments to use to dismantle religion, Christianity, and or God.\n\nI'm also asking /r/DebateAChristian the same question.",
        "created_utc": 1409677983,
        "upvote_ratio": ""
    },
    {
        "title": "Need help refuting a creationist",
        "author": "johnnypaperclips",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f9aqk/need_help_refuting_a_creationist/",
        "text": "A creationist friend watched a Ken Ham video and now claims evolution cannot be true because:\n1) Life has never been observed to come from non-life.\n2) There is no observable process in which new genetic information can be added to an organism's genetic code.\nRefutation?\nEdit: Great answers from everyone here. Thanks so much for your help.",
        "created_utc": 1409665517,
        "upvote_ratio": ""
    },
    {
        "title": "Reconciling the fully devout, rational theist",
        "author": "Salemz",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f8oz7/reconciling_the_fully_devout_rational_theist/",
        "text": "*[Disclaimer: I debated whether or not to post this. I worry it's the atheist equivalent of questions like \"How can an atheist be moral/good without God?\" which drives me nuts. But I post with completely positive intention - it stems not from a desire to look down on theists, but to better understand something I see quite often: the devout, rational theist.]*\n\nSome of the best and smartest people I know are sincerely religious. Just one example is a guy who attended Catholic school all his young life, married a Catholic wife, is raising four kids who are all going to Catholic school, attends church regularly, and as best I can tell seems to genuinely believe.\n\nHe's also a brilliant guy who fully accepts modern science, accepts people for who they are rather than based on a particular label (gay, atheist, whatever), and never falls back on explanations like 'it's just God's plan'. He's somewhat of a mentor in my field and I definitely consider him better at making logical connections and recognizing patterns in information than I am. I feel lucky I've had the opportunity to work with and learn from him.\n\nI realize a rational theist is far from a unique phenomenon, but I use him as an example because he stands out to me as a veritable beacon of rational thought. And I struggle to reconcile that approach to knowledge and understanding with what seems to be a fairly large exception to the rule: belief in religion.\n\nHow is the discrepancy created and justified? Why is religion / faith / God the one thing exempt from an otherwise critically logical mindset? Is it something one chooses not to examine because it's considered separately and outside of that framework? Or is it logically justified in some way?\n\nI can even somewhat understand having a generic belief in there being a god or higher power/intelligence, but I can't figure out how or why that would turn into subscribing to a particular religion and sect, with all the attendant highly specific ritual and all-too-human history, both good and bad.\n\nIn response to anyone quite rightly thinking \"Uhh, why don't you just ask him?\", although we're reasonably good friends, since I know him mostly through work I don't feel it would be appropriate to randomly dig into personal questions about religion. And, knowing myself, I'd end up awkwardly blurting out something like \"You seem smart, so what's up with the religious stuff?\", which is why I've never really brought it up with anyone I know.\n\nAlso, I've decided it doesn't actually matter. It's a puzzle that I don't fully understand and would like to, but finding an answer doesn't really impact how I feel about people one way or another. Well, unless the answer is he's just biding his time for a signal from the Pope and then he's going to swiftly slaughter me and the rest of the godless heathens. But I'm willing to risk it. ;)\n\nI doubt I'm the first person to think about this, so I'm very curious to hear about others' perspectives - particularly people who have had a similar discussion with believers, or someone who considers themselves a rational theist, or even former believers who reconciled the two, though they've since stopped believing. (Or anyone with a point of view, really.)\n\nTL;DR: Procrastination hits level 99 - now disguising itself as thoughtful philosophical discussion. ",
        "created_utc": 1409643810,
        "upvote_ratio": ""
    },
    {
        "title": "My World History Teacher: A Rant",
        "author": "TheOtherCollin",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f8bqe/my_world_history_teacher_a_rant/",
        "text": "Okay.  So, I am a Sophomore in High School taking AP World History.  The teacher, being the teacher, is teaching us, obviously, about World History, which includes, in the early units, the evolution of mankind, the development of religions, and a diverse amount of religions.  She claims to be teaching us to critically analyze the present information to draw conclusions.\n\nWe were discussing evolution in the class and its relationship to mankind.  She, in the middle of teaching, starts a sentence with, \"The way I see it, God...\".  At this point, though I should have just listened, I tuned out.  (I also suspect that another individual in the class did as well, because he and I both set out pens down and just about facepalmed when she started this.)  She knows how religions developed over time and how diverse religions are; she also claims to know how to critically analyze information, and that information, at least from my perspective, leads to the idea that religion is very man-made.  However, her religious position, is obviously at least Deistic or Theistic.  Though, I suspect she is a Christian, because it is the Bible Belt.\n\nEarlier that week, we had to do a mandated thing on Freedom and America.  The preamble to the Declaration of Independence, as known, makes mention of a Creator.  The teacher twists this and says that our founding fathers were obviously God-fearing men.  The previously mentioned other guy in the class spoke up.  He mentioned the fact that many of the founding fathers, including Thomas Jefferson, were, in fact, Deists rather than Christians as the teacher was implying.  The teacher kind of shrugged it off.\n\nThe reactions of this individual kind of lead me to believe that he is an Atheist like myself.  It is nice to know there is another sober person in the car, but that just means that two sober people die in a car crash, because neither of us can drive.\n\nSorry, I just had to rant about that.  The teacher, given her knowledge and claims, in my opinion, should not hold the views she does nor should she attempt to use history as justification for her claims when she is factually incorrect.  This all happened within the first week of school.  \n\nIs there anything I can do to survive the foreshadowed religiousness of my World History class this year?  I know me and that other student can correct her if need be and back each other up (or I can back him up, since we never talk to each other).  We also have assignments every week that we choose a current event and do an assignment on it.  I though about making the majority of them about religion in some way.  I do not know, really, what to do.  I just want to be able to live with sanity through the class.\n\nTL;DR:  World History teacher is religious and attempts to inject her views into lessons; I rant.  How can I survive the year?",
        "created_utc": 1409631759,
        "upvote_ratio": ""
    },
    {
        "title": "A Visit From Jehovah's Witnesses. Have you ever talked to these guys?",
        "author": "EJ7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f7ryg/a_visit_from_jehovahs_witnesses_have_you_ever/",
        "text": "",
        "created_utc": 1409618821,
        "upvote_ratio": ""
    },
    {
        "title": "As an atheist, I am honestly terrified of death...",
        "author": "mrtest001",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f7ii0/as_an_atheist_i_am_honestly_terrified_of_death/",
        "text": "What happens after you die? I believe nothing happens to 'you'.  No evidence for it, so I don't believe there is an after life.  But I also don't believe it will be nothingness either.  The only proof I have is the fact 'I' am here right now - experiencing the world.  Somehow a consciousness that I call 'me' is tied to this body.  I am lucky that I wasn't born in North Korea, or as a lab animal, or some other poor creature.  However, after I die...I think there is a good chance I will play the concious 'lottery' again.  And 'I' will experience another existence.  Seeing how badly most of the world lives (lets put aside being born into another world/universe)...I am very scared that there is a good chance I will have a terrible fate.  And repeat the process endlessly.  Of course it won't be 'me' because what I call 'me' which is collection of memories and certain arrangement of atoms, will be completely destroyed when I die.  However, when atoms are put in a certain arrangement (through forces such as evolution) they become concious and can experience the world.  There is no choice in the matter.  When the switch is flipped, you come alive and have to run through your life till the end.  You might be in an abusive environment, you might end up a serial killer, you might take foolish risks, it's mind numbing.  Given what I believe, the only logical outcome is to free the world of pain and suffering while I am alive, as to reduce the chance my next 'lottery' will end up in a bad place.  Imagine if you have the power to end poverty and destroy dictatorships, then after you die, you are guaranteed not to be born into a poverty stricken country.  ",
        "created_utc": 1409612885,
        "upvote_ratio": ""
    },
    {
        "title": "No answer satisfies me",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f7hpb/no_answer_satisfies_me/",
        "text": "So, I was an atheist for quite a while, and now I believe that I am gnostic.. I was reading a debate on youtube (stupid place to view debates I know) between an atheist and a Christian and atheist said:\n\n\n\"You believe in talking snakes, you support child slavery, mass murder and rape\"\n\n\n\nthe Christian guy responded:\n\n\n\"Oh yeah? And you  believe that nothing made everything, you believe that matter just spawned out of nowhere for no appareant reason\"\n\n\nAnd his answer, which is so much used by Christians just made me a gnostic atheist.\n\n\nThe thought of matter spawning out of nowhere for no reason seems.. weird, doesn't feel right, you get what I'm saying?\n\n\nBut also, the thought of a creator seems exactly as stupid as matter spawning out of nowhere. Not even more stupid. The exact stupid.\n\n\nNeither of these answer satisfies me, an average mind would be satisfied with the thought of creator, but I and as many other people can't be satisfied with a creator.\n\n\nImagine how much does it suck to be a creator of everything. You have unlimited intelligence, unlimited power, I don't think you could even function properly, like you would just... explode from so much information. Would you have feelings? Imagine you can give yourself unlimited pleasure, like we love dopamine now imagine that unlimited times more... Would a creator have a personality like we do, how can someone with unlimited intelligence have a personality, it doesn't make him unique. Maybe the 'creator' is just a robot?  Just blows my mind how much would it suck to be a creator of everything, and then you get, \"what the fuck created me?\" Imagine being the creator but you will never be sure what created you, you obviously can't create yourself, sounds stupid.\n\n\n\nPlease help me clear my mind out, I've been thinking about this for days.",
        "created_utc": 1409612390,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why I no longer believe religion is a virus of the mind\" - Sue Blackmore",
        "author": "zergl1ng",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f5eq5/why_i_no_longer_believe_religion_is_a_virus_of/",
        "text": "What do you think about this?\n\n&gt; Are religions viruses of the mind? I would have replied with an unequivocal \"yes\" until a few days ago when some shocking data suggested I am wrong.\n\n&gt; (...)\n\n&gt; So it seems I was wrong and the idea of religions as \"viruses of the mind\" may have had its day. Religions still provide a superb example of memeplexes at work, with different religions using their horrible threats, promises and tricks to out-compete other religions, and popular versions of religions outperforming the more subtle teachings of the mystical traditions. But unless we twist the concept of a \"virus\" to include something helpful and adaptive to its host as well as something harmful, it simply does not apply. Bacteria can be helpful as well as harmful; they can be symbiotic as well as parasitic, but somehow the phrase \"bacterium of the mind\" or \"symbiont of the mind\" doesn't have quite the same ring.\n\n&gt; http://www.theguardian.com/commentisfree/belief/2010/sep/16/why-no-longer-believe-religion-virus-mind",
        "created_utc": 1409554145,
        "upvote_ratio": ""
    },
    {
        "title": "A song with an explanation of the lyrics about how I feel religion effects everyone as a whole.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f4fli/a_song_with_an_explanation_of_the_lyrics_about/",
        "text": "",
        "created_utc": 1409527687,
        "upvote_ratio": ""
    },
    {
        "title": "Religion isn't bad. It isn't a lie. It's not by nature scientifically incorrect.",
        "author": "Flamdini",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f3z3p/religion_isnt_bad_it_isnt_a_lie_its_not_by_nature/",
        "text": "",
        "created_utc": 1409517258,
        "upvote_ratio": ""
    },
    {
        "title": "Intercessory prayer studies",
        "author": "A3gis",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f3u57/intercessory_prayer_studies/",
        "text": "I was under the impression that the [Templeton Foundation study](http://www.ncbi.nlm.nih.gov/pubmed/16569567) was the final word on the subject, but then I found [this wikipedia page](http://en.wikipedia.org/wiki/Studies_on_intercessory_prayer#Studies) that lists other studies. Five of which report that prayer had a positive effect. I looked at a few of the studies in depth and couldn't find any glaring issues.\n\nWhat's going on here?",
        "created_utc": 1409514198,
        "upvote_ratio": ""
    },
    {
        "title": "What are some developments in atheism that I should pay attention to?",
        "author": "ccbeef",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f3lrb/what_are_some_developments_in_atheism_that_i/",
        "text": "- I am interested in the future of atheism. I'm interested in the increasing popularity of secularism. \n\n- I'm also interested in how certain prominent atheists shape the belief systems within the atheist community.\n\nWho or what should I be paying attention to?",
        "created_utc": 1409509044,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Law of Large Numbers misused in debates?",
        "author": "zergl1ng",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f3k43/is_the_law_of_large_numbers_misused_in_debates/",
        "text": "",
        "created_utc": 1409508054,
        "upvote_ratio": ""
    },
    {
        "title": "This was left on my door today.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f12ht/this_was_left_on_my_door_today/",
        "text": "",
        "created_utc": 1409428840,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the oft-ignored rules that a person must adhere to, if they claim that they live their life according to the Bible?",
        "author": "bizniss_time",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f0qt9/what_are_some_of_the_oftignored_rules_that_a/",
        "text": "There are of course many people out there who choose to live by certain rules because the Bible tells them so. Some of the more common ones are refusing to acknowledge same-sex marriages as \"marriage\", don't use the lord's name in vein, etc. Most of the Ten Commandments seem to cover a lot of the popular ones, since it's arranged in a nice concise list.\n\nBut it's obvious that there are many rules of the Bible that people choose to ignore. I haven't read the Bible personally, but I do understand that the Bible states that eating shellfish is a sin (correct me if I am wrong). I've never seen someone *actually* avoid shellfish on the grounds of adhering to the Bible.\n\nSo what are some of the more overlooked \"rules\" of the Bible that people choose to ignore? \n\nAdditionally, *why* do people only choose to obey certain rules over others? Do people take the Ten Commandments more seriously than the rest of the Bible?",
        "created_utc": 1409421148,
        "upvote_ratio": ""
    },
    {
        "title": "If there is in fact a Multiverse, would that mean that at least one of the infinite universes has a God?",
        "author": "mattyross11",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2f0qly/if_there_is_in_fact_a_multiverse_would_that_mean/",
        "text": "",
        "created_utc": 1409421011,
        "upvote_ratio": ""
    },
    {
        "title": "I refuse to preach atheism/actively spark debates with the religious and believe that we shouldn't. Those of you who do preach/attack (many on this subreddit?) how is this justified?",
        "author": "houseofwinsor",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ez8sr/i_refuse_to_preach_atheismactively_spark_debates/",
        "text": "So long time atheist here.  Long time as in I've never been to church, believed in god, any of that stuff.  The rare lucky breed of american who's parents are agnostic and decided to let me figure things out (and to nobodies surprise, god seemed quite ridiculous even when I was 10 years old).\n\nAll that aside, I used to try and preach atheism to the religious back in high school and to a degree at university as well, but in the past few years I've decided that preaching atheism is going about it all wrong.  Back in that time it was merely for the purpose of some bizarre enjoyment, to lure in and debate with the religious, mainly because their beliefs held far more importance to everything they did (will talk about this further along).  Science and logic were on my side and I couldn't be offended while they had mystical reasons and everything to lose, certainly one sided.\n\nMany of those who believe in god believe it with such faith that they feel the need to preach it to others.  Even the more moderate and even hardly religious folk who don't preach their religion themselves, find it justly permissible for the more faithful to do so.\n\nAs someone who has never even known what it is to believe in god, go to church, etc. I find it ridiculous when someone walks up to my door and preaches damnation and the whole routine.  Many of you would agree?\n\nHowever, in many social situations I've also seen an atheist preach to a religious person (I'm not talking cases of defense, which are more than justified) and in these cases when people look at me to support them I just can't (well sometimes I do, but I don't feel good about it).  \n\nAtheism isn't something that dictates our lives.\n\nIs statement above wrong?  For me this is very true, but does anyone feel the opposite and believe that atheism defines them?\n\nAmongst many of the religious, their religion defines who they are, so of course they preach their way of life.  Yet for me atheism has very little to do with most things in my life.  If someone attacks my belief that there is no god, no flying spaghetti monster, or what have you...well I just don't care.  My reaction is nothing like that of a faithful person.  Sure I can give a defense, but I don't feel like you just made a personal attack on me or anything (if you question someones religion, who is actually religious, that is very much an attack on them).  If a religious person defends themselves they are saving face and not to mention also saving face of the faith at large.  Fellow atheist do you feel as I do, in that our defense is mere passing of knowledge than saving face?\n\nWith more education being spread to more of the world population, the number of atheistic people will increase.  Present children with more science and logic and reason, and the result will people who don't believe things on faith, but on things that have been observed.  Teach children to question things and want to learn how things work, and religion won't be an answer.  In my opinion this is key right here, if you want to increase the number of atheists you maybe want to assess your political beliefs honestly.  \n\nSorry for the tangent there, but is my thinking wrong here?  Do you have any justifiable reasons to preach atheism or actively challenge the beliefs of religious people?  At the moment the best solution I can come up with is defending atheism when being attacked and also being a resource for religious who want to talk about my lack of belief (if a friend wants to come to me I'll gladly talk, but I won't actively try to make a religious person question their beliefs).\n\nI want to hear your opinions on this, what do you guys think?\n\nEDIT:  Everyone thank you for the responses.  Starting to understand a little bit that my lack of understanding what it is like to go from religion--&gt;atheism (from a personal experience) has brought about a bit of complacency.  Seems many of you questioned into your atheism and things worked out that way.\n\nEDIT EDIT:  Sorry if I can't respond to everyone, but I'm reading them on my phone right now.  Some great dialogue here and everyone has solid arguments.",
        "created_utc": 1409369761,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Embryonic Stem Cell and Sperm?",
        "author": "CVL080779",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eyelb/thoughts_on_embryonic_stem_cell_and_sperm/",
        "text": "",
        "created_utc": 1409348473,
        "upvote_ratio": ""
    },
    {
        "title": "An argument about disbelief",
        "author": "the_leedar",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ey2pv/an_argument_about_disbelief/",
        "text": "As an atheist, doesn't your entire worldview revolve around God? That being the disbelief in him? If there were no God, then there would be nothing to not believe in right? If there were no God, then there would be no atheists. What's your argument against this point?",
        "created_utc": 1409341413,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of this quote from my poli sci textbook's chapter on science?",
        "author": "electric_eclectic",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2exedb/what_do_you_think_of_this_quote_from_my_poli_sci/",
        "text": "\"Although we should never close our eyes to the harm that is sometimes done with science, we believe that it is as much a mistake to blame science for what some scientists have done in its name as it is to blame religion for what some believers have done in its name.\"\n\nMy knee jerk reaction is that this is a false equivocation because religion doesn't have a built-in self-correcting mechanism like science does. I am I right? Am I off-base? What do you think?\n\nEdit: Someone pointed out that I'm using mistaking an equivocation fallacy with a false equivalence, which are different. My mistake. ",
        "created_utc": 1409327616,
        "upvote_ratio": ""
    },
    {
        "title": "If atheism is true why shouldn't I kill myself? Why should atheists live?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ewdqh/if_atheism_is_true_why_shouldnt_i_kill_myself_why/",
        "text": "",
        "created_utc": 1409295757,
        "upvote_ratio": ""
    },
    {
        "title": "Religion's \"let there be light\" = Infinite Acceleration",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ew9gq/religions_let_there_be_light_infinite_acceleration/",
        "text": "",
        "created_utc": 1409291441,
        "upvote_ratio": ""
    },
    {
        "title": "Debating Christians",
        "author": "MermaidMan0",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ew2kc/debating_christians/",
        "text": "My friend lives in the deep south where everybody is a hardcore Christian. Him and I are both atheists and find the basis for religion completely absurd. With people in his school knowing he is atheist they always start arguing with him about the origin of the universe and evolution v. creationism. We have our own points we bring up, but we never get mad while discussing these things and that seems to anger the Christians whose religion is based on kindness (if I'm not mistaken).   But I want to know some of the things you guys might use while discussing these topics since its getting old repeating everything we know all the time.\nThanks",
        "created_utc": 1409285601,
        "upvote_ratio": ""
    },
    {
        "title": "AMA with Steve Wells of the Skeptic's Annotated Bible going on right now on Youtube",
        "author": "wellsphil",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2evvxl/ama_with_steve_wells_of_the_skeptics_annotated/",
        "text": "",
        "created_utc": 1409281076,
        "upvote_ratio": ""
    },
    {
        "title": "Help in a Christian-oriented Philosophy class",
        "author": "debonairflair",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ev27l/help_in_a_christianoriented_philosophy_class/",
        "text": "First, a bit of background info... I am a high school junior at a Christian/[classically oriented](http://www.welltrainedmind.com/classical-education/) school and am taking a Philosophy of Religion class. The teacher (also my headmaster) is teaching us philosophy from a Christian perspective, specifically [Presuppositionalism](http://rationalwiki.org/wiki/Presuppositionalism). I have already raised all of the objections listed in the link but have made little to no progress. It's like trying to hold a slippery eel... Are any of you aware of any refutations/objections to this argument? I'm not making much headway. Any help is appreciated.",
        "created_utc": 1409262945,
        "upvote_ratio": ""
    },
    {
        "title": "Short story and reflection on education (USA)",
        "author": "Shiredragon",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eudby/short_story_and_reflection_on_education_usa/",
        "text": "I was helping a fellow coworker pack up to move. My brother and I were talking to him and his wife during a break and religion came up. They brought up how the USA was founded as a Christian nation. I was surprised. I politely informed them that they were wrong. I told them that, while it can be argued that the USA was formed from a Christian cultural context, it was not founded as a Christian nation. I told them of research I did in the explicit nature of it. You can find a high definition scan of the Constitution and Bill of Rights online with a transcript (right word?) since it is hard to read the writing for me. No God, no Christianity. In fact, the only mention of God, comes in the form of a treaty later. Not in any of the founding documents. \n\nThese were both college graduates. I am disappointed that educated people can still hold these horrible uneducated views about their own country. The very basis of it in fact. But they took it in stride and made some discussion about it but did not hold fast to their original statement. I was glad they they listened.\n\nJust a story. Not a lot of point. Just a reflection. \n\nTake care everyone.",
        "created_utc": 1409249410,
        "upvote_ratio": ""
    },
    {
        "title": "Good way to learn about the bible without necessarily cringing through it?",
        "author": "Fapacwl",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2etev6/good_way_to_learn_about_the_bible_without/",
        "text": "",
        "created_utc": 1409228861,
        "upvote_ratio": ""
    },
    {
        "title": "My thoughs on Islamic moderation and extremism(And Islam in general)",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2est33/my_thoughs_on_islamic_moderation_and_extremismand/",
        "text": "First off i think Islam is a violent religion compared to others. At least it is not like Jainism and bhuddism in being very strict about non-violence and resolve through conflict. Both Christianity and Islam are religions that have gotten to increase their influence through conquest. \n\nBut suddenly by 1800 something happened. Nationalism. In many countries it was suddenly not enough to be chosen by God to be a ruler. The rise of secular nations in Europe and US arrived. \n\nSee nationalism is often made by those in power to justify their seat. Oh, im not chosen by God? Well i am competent and we claim this land because we have this history, and this culture and this religion. Now we own that geographical spot. \n\nAnd from there Islam vent from a tolerant religion, a tool used by Muhammed to be a conqueror into a tool for the nation. A nation from 1800 century and forward wants to strengthen their inside community through propaganda and extremism. \n\nIn 500. A.D and until 1800 your rule of power was assured through royal rule. So people could be tolerant of other religions, and would benefit from doing so. This time being an era where we didn't see the world as nations, but separate seats of power. If you had the seat you were happy. \n\nSo suddenly we become interested by later 1900 century with politcal interests. Israel is formed and westerners set up people who with extreme views in their seats. And they use the tools that Muslims already believe in, Islam. And the people being scared of their government end up becoming extremists. And then the common populace either has to comply or feel the wrath of those in power. If extremists didn't have the Quran they would have to find other ways to justify their rule or actions. \n\nBut religion has a strength. The majority of muslims acts as a cover for the actions of extremists and the common people will defend them if opposition critiques their claims(religious ones). Can you use Bhuddism to justify violence? Can you use Bhuddism to justify a seat of power? I think not. \n\nI don't think religion is the main source of human conflict and ignorance. But it is a great tool and enhancer of those things. Both because we have been learned to respect religion and to separate the cause and effect of religion. Which is why even with all these bad things happening in the middle east now, we say \"well not all muslims\" while ignoring that those majorities or muslims are also victims and puppets of the religion. As if the non extremity of the populace is a convincing argument of how Islam is \"not that bad\". Its obvious that religion, especially Islam was not made for today's society. And it is often ignorance or the need to defend ones own religion that makes people blind to see how their religion is a big part of creating problems around the world. Both extremists and moderates of a religion are partly responsible for the consequences of their religion. \n\nAnd it is sad that this point cant be made enough or taken more publicly because it is not the politically correct view or in some cases people think its racist. Because we try to hard to please a group who, yes have been stigmatized and experienced hate since 9/11. \n\nAlso Islam usually(and also other religions) takes criticism badly and denounce religion the wrong way. Scholars and moderates usually condemn terrorism, which people would think is a good thing. Except one it doesn't change anything, and two is their way of trying to separate themselves further from those they would not like to portray them. Instead of admitting that their religion has a part in their actions, and they are sorry for being a part of a worldview that can lead to dangerous extremism. Its one thing to admit flaws in your own religion and another to try and separate yourself to save face. \n\nAlso, i think we in general underestimate the harms of Islam even among those who live in western communities. If it is things like shaming people for their own sexuality. It does not help of that all religion is bullshit. It creates a lot of confusion, wasted effort, chaos, war, prejudice and hate. Especially Islam, both in its original form and the way it is used today in our global stage. ",
        "created_utc": 1409206068,
        "upvote_ratio": ""
    },
    {
        "title": "Hooray, semantics! New word? Let's discuss.",
        "author": "FlamDukke",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2er5mk/hooray_semantics_new_word_lets_discuss/",
        "text": "Despite what some dictionaries and theists claim, I think most of us would agree that \"atheism\" merely means an absence of belief in a god or gods, not an active disbelief in any particular god or gods. BUT! The modifiers \"gnostic\" and \"agnostic,\" which would seem to indicate the certainty or lack thereof, respectively, in a claim being made, seem to imply that the term \"atheist\" does refer to a claim being made. Otherwise, to claim \"certainty\" or \"uncertainty\" in one's lack of a belief in gods would be unintelligible. Do we need a new word that means \"a believer in the claim, 'there is no god'\"? (\"Strong atheist,\" IMHO, makes no more sense than \"gnostic atheist.\" To use the classic comparisons, would you ever claim to be an *avid* non-stamp-collector? Or say that the TV is off *in HD*?)",
        "created_utc": 1409168493,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists vs Anti-Theists",
        "author": "czah7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2er4au/atheists_vs_antitheists/",
        "text": "To both of you.  Simple question.  What makes you one and not the other?\n\nEDIT: Clarification.  I realize most all anti-theists are also atheists.  (Some may be deist though)\n\nWhy are you an anti-theist and not just an atheist?\n\nWhy are you an atheist and not also an anti-theist?",
        "created_utc": 1409167788,
        "upvote_ratio": ""
    },
    {
        "title": "Daughter(8) started praying before meals.....thanks, Grandma. Any good secular or Atheist books/literature that she could read?",
        "author": "DreamCheeky",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eqtsc/daughter8_started_praying_before_mealsthanks/",
        "text": "So, last night at dinner, my oldest daughter(8) prayed before the meal.  She has done this probably 4-5 times over the last 6 months.  I'm fairly certain it came from her Grandmas whom are both quite religious (Christian).  But, last night, she got her middle sister(5) to join her in the prayer.\n\nAfter she was done praying, she said \"Dad doesn't believe in Heaven\".  To which I replied, \"Nope, I sure don't.\"  She then asked \"Mom, do you believe in Heaven?\"  My wife replied \"Less and less each day.\"\n\nWe have never prayed before meals, we don't attend church, we don't read biblical stories, etc.  I want my children to grow up rational thinkers so that perhaps in their mid-teens or early-20s, they can formulate their own thoughts on religion.  But, it looks like Grandmas are starting to have an affect on them and I'd kinda like to counter it.  Not smother them with Atheism, but atleast counter all of Grandmas arguments.\n\nMy daughter loves to read, and I thought the best intro would be a secular or Atheist book aimed more at children.  I can't seem to find a whole lot.  She's pretty advanced reader for her age, so I wouldn't be afraid to step outside her comfort zone just a bit with something like Richard Dawkins' [Magic of Reality](http://smile.amazon.com/dp/1439192812/ref=wl_it_dp_o_pC_nS_ttl?_encoding=UTF8&amp;colid=A8B135EXS13B&amp;coliid=I1FHMV2OFTLXW2)  or something to that effect.\n\nDoes anyone have some youth reading suggestions for children beginning to embrace religion and/or question it?\n\nTL;DR -- Any secular reading suggestions for youth?",
        "created_utc": 1409162163,
        "upvote_ratio": ""
    },
    {
        "title": "Reincarnation: Those of you who have read more into the alleged evidence of reincarnation, what do you think of it?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eqld2/reincarnation_those_of_you_who_have_read_more/",
        "text": "I found this article: http://www.spiritscienceandmetaphysics.com/does-the-soul-exist-this-ends-the-debate/ but it is not the first time I come across supposedly well verified claims of reincarnation.\n\nHave there been interesting alternative psychological explanations for this phenomenon? Or are they just generally dismissed as straight lies? I think this could be an interesting discussion.",
        "created_utc": 1409157642,
        "upvote_ratio": ""
    },
    {
        "title": "What is a God",
        "author": "BAtrogit",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2epx25/what_is_a_god/",
        "text": "",
        "created_utc": 1409142707,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism and unhappiness: Subreddit think tank",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2epnem/atheism_and_unhappiness_subreddit_think_tank/",
        "text": "Atheists tend to be less happy than religious people. \n\nPeople in developing countries, who face a lot of traumatic non-psychological struggle in life, are often religious.\n\nWhy do you reckon this is?\n\nHere is what I think: When you're in such a good mood most of the time that you're not afraid of your own thoughts, and you're even content while realizing how pointless life is (we're all going to die anyway, and atheists who try to construct a \"real purpose\" for themselves in other abstract ideas are also just trying to protect themselves mentally), when something does get you down, you have no over-arching story that this is part of to look to. There's no important meaning to shitty things that happen, they're just shitty things that happen. No light at the end of the tunnel.\n\nIt seems a lot of atheists are really interested in morality or our species \"as a whole\" or even the idea of being part of \"the story of the Universe.\" I think those things are just more stories we create for a sense of purpose. I mean, is any of that really related to the stuff that makes us feel the happiest, or is it just what makes us \"feel God\" (aka frisson)? Someday none of this will exist, or any evidence of it ever having been here, and it will be like that forever. The moment you die is no different to you than 1 billion years later, and all of whatever purpose you came up with is going to die with you. I don't buy the idea that you get to transfer your \"purpose\" (which is mental) to someone else when you die. It doesn't make any sense. It seems like the happiest atheists are the ones who don't wander into their minds enough to realize that though. It's like people who say they're not religious but that they're \"spiritual\" and that they believe in God in a complex, hard to explain way. I guess it's nice to have that to hang onto for when you're not in a good mood, but you know you're kidding yourself. \n\nWhat do you think? ",
        "created_utc": 1409133040,
        "upvote_ratio": ""
    },
    {
        "title": "\"But why'd they go against both Jewish &amp; Roman traditions to gain popularity? Or why do all that work for a silly scam?\"",
        "author": "BenGeezy",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eoa3v/but_whyd_they_go_against_both_jewish_roman/",
        "text": "Currently on the topic of the \"birth\" of Christianity. \n\nI understand how religious thinking works, and the conditions under which they arise. \n\nThis person is arguing that the people MUST have witnessed the miracles, or they would never have gone along with it. \n\nI'm more into epistemological arguments,and arguing the points of how religions emerge is new to me. I'm looking around Google for more information on this, but I'm mostly finding religious material. Wondering what you guys know about this argument/any secular resources.\n\n**Thank you all for the fantastic responses. You've provided me with a ton of resources, and things to think about. ",
        "created_utc": 1409094928,
        "upvote_ratio": ""
    },
    {
        "title": "If we blame religion for perpetuating violence and intolerance, must we not implicitly praise it for positive achievements? To what extent should atheism be legitimately concerned with religious outcomes?",
        "author": "Mr_Subtlety",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2enjb2/if_we_blame_religion_for_perpetuating_violence/",
        "text": "The atheists subreddits are usually rife with articles pointing out horrifying acts carried out at least marginally in the name of religion. Bombings, child molestation, intolerance, scientific ignorance, and so forth. Notably, these are almost exclusively Christian or Muslim issues, and the comments are inevitably filled with snarky variations of \"what would Jesus do?\" or \"religion of peace, ha!\" Either way, the inevitable charge is almost always (particularly in the case of Islam) \"religion made them do it!\"\n\nFair enough, that's a seeming reasonable charge for an atheist subreddit to make. But the problem is, blaming religion as a motivating factor in action *must* work both ways -- if religion can be the sole reason people can commit horrible acts, it must inevitably also be the sole reason they commit *positive* act. After all, all religions --yes, even Christianity and Islam-- strongly promote pro-social behavior, and they do so on an order of magnitude more than they typically promote anti-social behavior. Yes, you can read passages condoning violence in most religious texts, but to get to them you have to make it through a lot more text promoting cooperation, respect, peace, charity, etc.\n\nMoreover, anytime you see these religions (especially Islam) being criticized, you're likely to see at least one or two comments suggesting that other religions --usually Jainism or Buddhism-- are inherently better, that their religious doctrine discourages this kind of behavior and their adherents would never engage in violence. In other words, these religions are fundamentally better aligned with what we consider to be peaceful, positive outcomes.\n\nSo, the case against religion often seems to come down to an *outcome* based model. Jainism and Buddhism are good, they encourage positive behavior, Christianity and Islam are bad, they encourage negative behavior.\n\nProblem is, if you accept that logic, it brings you to an uncomfortable place where if you could demonstrate that the net gain of a religion motivating pro-social behavior outweighed the net loss of negative behavior it caused, religion would actually be utilitarian *advantage* to the world. I don't know that I'm willing to make that case, with all the complexity it implies, but it's certainly a case that *could* be convincingly made. After all, for all the child molestation and bombing that goes one, those activities are CLEARLY a minority of the behavior motivated by religion that goes on in the world. In the US alone, 73% of charitable giving was religious, with [55% of all Americans reporting, \"that their religious orientation (a weird locution, but one the study chose) motivates their giving.\"](http://religiondispatches.org/new-study-three-quarters-of-american-giving-goes-to-religion/) Just to name one obvious example of religiously-motivated pro-social behavior on a huge scale.\n\nNow, you can quibble with that, you can argue that most of it just goes back into the religious institution rather than doing real good in the world, Mother Teresa was history's greatest monster, I know, I know, I've heard all that. But with 2.2 billions Christians, 1.5 billion Muslims, 1 billion Hindus, hundreds of millions of Buddhists, and so on... well, with all of these practicing some kind of charitable giving and encouraging at least some degree of pro-social behaviors, it'd be hard to argue there isn't at least SOME net gain. Weighed against the comparably tiny percentage of people who commit religiously motivated violence, even an inefficient system of charity might well add up to a net advantage for humanity. Of course, there are other factors, too; religiously motivated cultures that deny opportunities to women, for example, certainly contribute to a net drain of human productivity, even absent any moral concerns. Obviously, it's not a simple juxtaposition of violence vs charity, as religiously motivated behavior comes in an enormous variety of forms, both good and bad, subtle and obvious.\n\nThe question of what the balance ultimately is between benefits and detriments of religiously motivated outcomes is probably ultimately unanswerable. Too many nuances, too many hypotheticals. But that's not really my point anyway. Because if this is the case, the real question becomes: *is this a productive argument for atheists to make in the first place*?\n\nConsidering the popularity of the \"negative behavioral outcomes of religion\" argument on these subreddits, I think it may be time to question the value of that criticism, and even the possibility that it might well be a losing argument. Even if we could make a compelling case for religion doing on average more harm than good, the argument itself demonstrates the complex motivations (religious, personal, cultural, contextual, environmental) that ultimately result in a behavioral outcome. If religion is capable of influencing some people to act very badly but other people to act very altruistically, maybe religion *in itself* is not the problem. Plenty of cultural artifacts are *capable* of negatively influencing behavior, but are not legitimate subjects for wholesale criticism in the same way religion is. \n\nTherefore, I find these sorts of arguments counter to the best interests of atheism as a movement, and strongly believe that these subreddits ought to devote more time and more effort to develop other philosophical underpinnings for atheism. I'd be very curious what you guys think.\n\n\nEDIT: TL/DR\n\nMy point is this:\n\n* Many atheists cite religion as a major motivating factor in antisocial human behavior (abortion clinic bombings, 9/11, science denial), and criticize this sort of behavior as inherently negative.\n* If religion is a motivating factor for behavior, it must necessarily motivate *various* kinds of behavior, not strictly anti-social behavior.\n* We acknowledge that both pro and anti-social behavior are possible *without* religion, but that religion can be a motivating factor in both kinds of behavior. This is inherent in our initial criticism of religion for motivating undesirable religious action.\n* One of religion's major organizational goals is the promotion of *pro-social* behavior.\n* Since we have no problem criticizing the role religion plays in facilitating antisocial behavior, we have no choice but to also acknowledge that it has both the ability and the inclination to motivate people towards pro-social behavior as well, and, possibly on a much larger scale. This inevitably leaves open the possibility that religion has the capacity to ultimately contribute a significant net gain of pro-social behavior to society.\n* All this acknowledged, we must consider whether this sort of behavioral-outcome based critique of religion is a practical approach for atheism as a movement.\n\nEDIT 2:\n\nI understand there are other reasons to be atheist, i.e. the lack of evidence for religion, the difficulty it raises in conducting meaningful public discourse, etc. I AM AN ATHEIST, YOU DON'T NEED TO CONVINCE ME THAT THERE IS NO GOD. THIS IS A POST STRICTLY DISCUSSING THE VALIDITY OF A CRITICISM OF RELIGION BASED ON *RELIGIOUSLY MOTIVATED BEHAVIORAL OUTCOMES*.",
        "created_utc": 1409080181,
        "upvote_ratio": ""
    },
    {
        "title": "Treatment of atheists in the US, and the UK (insight)?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2emwv1/treatment_of_atheists_in_the_us_and_the_uk_insight/",
        "text": "Hey all. \n\nI'm currently living in the UK. There seems to be a lot of complaints regarding the mistreatment of atheists in the US, yet this isn't so evident in the UK. I thought it might be interesting to get atheists from both nations to give a brief autobiography of how they are treated. \n\nOddly enough, from my own personal experience as an Arab Christian, the treatment of atheists in our relatively conservative community is rather passive, and yet the US (which, mind you, appears more liberal than the Arab Christian community) seems to be more deeply offended by the presence of anyone who isn't like them. Is this a historical issue, or?",
        "created_utc": 1409068370,
        "upvote_ratio": ""
    },
    {
        "title": "definite definition of atheism",
        "author": "dathoedezt",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2emmzk/definite_definition_of_atheism/",
        "text": "How can atheism be defined as \"without god\" when \"god\" has no meaning and being without a \"god\" assumes one exists?\nHow can a person who believes in ghosts, aliens (until proven) or anything supernatural be considered an \"atheist\" when any of those things could potential be a \"god\" if they did exist?\n\nI propose that \"god\" be a direct synonym to \"supernatural\" thus making atheism relevant to reality.",
        "created_utc": 1409062875,
        "upvote_ratio": ""
    },
    {
        "title": "\"The good Lord sent you full recovery [from the measles].\" \"But Daddy, don't forget: in the first place, he had sent me the measles.\" What's missing in the last argument?",
        "author": "sirsecret",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2emjaq/the_good_lord_sent_you_full_recovery_from_the/",
        "text": "Upon reading Viktor E. Frankl's *Man's Search for Meaning*, I stumbled upon a section that treats a standpoint, which I hitherto has adhered to without much thought.\n\n&gt; A psychiatrist who goes beyond the concept of the super-meaning will sooner or later be embarrassed by his patients, just as I was when my daughter at about six years of age asked me the question, \"Why do we speak of the good Lord?\" Whereupon I said, \"Some weeks ago, you were suffering from measles, and then the good Lord sent you full recovery.\" However, the little girl was not content; she retorted, \"Well, but please, Daddy, do not forget: in the first place, he had sent me the measles.\"\n\nThe author does not elaborate any further on this specific point, and as I  honestly don't get why and how the little girl's reasoning is failing, I'd appreciate some help in understanding both sides, as well as hearing your thoughts on the matter.",
        "created_utc": 1409060596,
        "upvote_ratio": ""
    },
    {
        "title": "Why do you think atheism should be encouraged?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2em9re/why_do_you_think_atheism_should_be_encouraged/",
        "text": "Now first off i want to say that what was supposed to be a topic became a rant. So i encourage people to do the same, and preferably add their very own reasons as to why the non-belief in God actually matters. \n\nRant: \n\nI think atheism is one of the most rational beliefs to hold. Many people lie to themselves, but the way people practice religion, defend it and live their religion makes it self evident. If people were more honest with themselves they would probably be able to admit it. \n\nI see atheism as a view you should implore people to have. Its not a purely practical reason for me. For me the truth matters. I implore people to see that all religion, magic, fairy tales and supernatural is bullshit. The same way i expect people to know that the world is round. Few flat earth really damage our society, but many people would facepalm after a conversation with them. \n\nBut being correct is often not enough. And about 2 years ago a trend started. Atheists are assholes, we are correct \"but such assholes about it\", \"Dawkins is an asshole\", \"Sam Harris is obnoxious\". And don't get me started on Theamazingatheist. Even i have been called an asshole by people who call themselves atheists. \n\nAnd i think i know several reasons why. I think people follow religion, defend it and preserve the taboo to criticize it for one reason. They don't genuinely care. People just want to go through life with no intention of standing for principles as long as people will like them for the views they hold. Im an asshole because i actually care if God exists or not. Its so infuriating to hear from so called religious people who should just call themselves deists.  Or atheists that never even sat down to think about the issue to call you an asshole because you happen to care and state the obvious truth. Im an asshole for stating the obvious, just because a bunch of people are going to disagree and be butthurt about it. \n\nAnd that is why i think encouraging atheism is important. Its important for us to grow in numbers. So that we can say the obvious without people thinking we are dicks about it, we have all the disadvantages of a minority, and few benefits of it. \n\n I think atheism should be encouraged because its simply the most rational explanation with the information humanity currently holds. And we should never be discouraged to say the truth. \n\n\n\n\nBackground: \n\nNow, to give some background into how i became an atheist or agnostic atheist. When i became about 9 years old i started to really like philosophy, i was a loner so i liked spending time alone thinking about pointless shit. I became an agnostic theist all on my own. My parents were wholly secular and so was my community. I had a christian phase when i was 15, which ended soon because i soon realized my religion was bullshit. I still cared. Even today im very interested in religion, but i am emotionally distant from it. I came to my conclusion on my own, no pressure from anyone. No real incident or sudden change. I was just suddenly able to admit that i didn't really believe what the bible said. I cant say my change was wholly rational. For example i was against Jesus view on society, because i saw capitalism as the optimal way for society to work, both ideologically and practically. That was one of the big reasons, i didn't think the son of God had such views. Which is why to this day i think its funny that in the US many who consider themselves real Christians are republicans. Its kind of like being a gay catholic or muslim woman. \n\n\n\n\n\n\n\n",
        "created_utc": 1409053139,
        "upvote_ratio": ""
    },
    {
        "title": "Using logic/philosophy to prove -without a doubt- that a god exists?",
        "author": "Pandoras_Boxcutter",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2em3ca/using_logicphilosophy_to_prove_without_a_doubt/",
        "text": "What I don't understand is how it's often posited that a logical argument would somehow prove without a shadow of a doubt that a god exists instead of it just being a logical **possibility**. I mean, even if the popular arguments for a god were actually sound at all (Cosmological, First Mover, Fine-tuned, etc.), it would only prove that it would be *possible* that a god existed, not that one *does*. Does it actually prove anything? Am I seeing this wrong?",
        "created_utc": 1409046146,
        "upvote_ratio": ""
    },
    {
        "title": "Harmony of the OT and NT:",
        "author": "BenGeezy",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2elos2/harmony_of_the_ot_and_nt/",
        "text": "So this conversation has gone from archeology to scriptural harmony. Aside from the fact that there is little harmony in the scriptures, any perceived \"harmony\" can be easily explained by the fact that the Jewish authors were familiar with Jewish prophecies.\n\nI just had [This Brilliant Piece](http://carm.org/new-testament-writers-conspired-together-gain-power-and-influence) thrown at me.\n\nYou may remember [Bullied Christian Matt Slick and gay friend Jim](http://thedailyshow.cc.com/videos/oyuwm8/left-behind) from The Daily Show.\n\nAnyways, just wondered what your thoughts are on this argument. \n\nThanks.",
        "created_utc": 1409030641,
        "upvote_ratio": ""
    },
    {
        "title": "At my mother's church, there has been a constant string of serious illnesses or deaths. How do I confront her about this?",
        "author": "Gyossaits",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2elge4/at_my_mothers_church_there_has_been_a_constant/",
        "text": "Hi /r/TrueAtheism. I want to say up front right now that this \"problem\" isn't something \"tangible\", for lack of a better term. It's rather illogical. It's a \"gut feeling\" type of problem.\n\nAbout two or three years ago, my mom decided to go to church again. She's always been religious and stopped going for a long time but something inspired her to take up the bible again and what have you but that's beside the point.\n\nEver since she's started going again and befriended other churchgoers, it seems like every month she'll hear from a friend that someone has become seriously ill or died. At first I thought nothing of this but then I couldn't help but notice this was happening constantly. Sickness. Illness. Sickness. Death. Illness. Death. Sickness. Sickness. And so on.\n\nFor the most part, this seems to occur with the older folk. I've heard two younger patrons got killed in accidents. Yeah, people die every day but to have all this happen *within the same group of people*?\n\nI am not worried about my mother's health, despite the litany of ailments she's been dealt (diabetes and arthritis are at the top of the list) but she keeps up her job as a housekeeper and I'm forced to tag along. She's free to take days off because her schedule is flexible and she will rest if she isn't up to things.\n\nIt would be unreasonable to believe all these bad cases are giving off some silly aura or \"bad mojo\" and pass it on to my mom. But I am concerned about the frequency it's happening. I don't know how to approach my mom about this nor what should she do about it. I'm not looking to make her atheist or anything, I just don't like my mom going somewhere where so many bad occurrences are happening so frequently.",
        "created_utc": 1409024493,
        "upvote_ratio": ""
    },
    {
        "title": "How does one respond to the argument that it's impossible to find out how the universe/life was created?",
        "author": "RhinoMan2112",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2el0v3/how_does_one_respond_to_the_argument_that_its/",
        "text": "So I'm often in small arguments with people over religion/theology and stuff like science vs. religion, and how there's some things science 'cant explain'. \n\nI often use the argument that even though some things are in comprehendible now doesn't mean they cant be discovered in the future. The ancient Greeks, for example, used gods to explain many unfathomable events, such as the sun 'moving across the sky' (Helios). They used gods to explain things that were entirely out of their grasp of understanding. \n\nYet now science has easily explained those things an now we're in essentially the same exact position but with bigger questions, like how life and the universe started. Yet whenever I say this people understand, yet still use the argument that it's simply impossible to answer those questions. \n\nWhat is a good response to this? ",
        "created_utc": 1409014776,
        "upvote_ratio": ""
    },
    {
        "title": "I'm hashing out an idea for a pro atheist argument and maybe you can offer advice",
        "author": "plasticpony256",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eikej/im_hashing_out_an_idea_for_a_pro_atheist_argument/",
        "text": "if you can humor me that would be great, it's not for any serious thing, just something I'm working out in my head.\n\nbasically it goes like this:\n\npremise 1: the human mind makes inaccurate assumptions about what it experiences and manufactures much of the information it collects\n\npremise 2: any external depictions of those memorized experiences and the manufactured data, expressed by writing them down or telling them out loud would be equally inaccurate or even less accurate than the actual experience \n\npremise 3: no experience can be accurately expressed\n\npremise 4: theist's claim to have an experience with a personal god\n\npremise 5: atheist's claim to have no experience with god\n\npremise 6: theist's have an inaccurate experience with their personal god\n\npremise 7: atheist's accurately have no experience with god\n\npremise 8: theist's can not with any accuracy relay their experiences with god\n\npremise 9: atheist's can accurately relay their inexperience with god\n\npremise 10: theist's are not relaying an accurate depiction of their experiences with god\n\npremise 11: atheist's are accurately expressing their inexperience with god\n\n(12. theist's are lying)\n(13. atheist's are telling the truth)\n\nSo break it up, knock it down and tell me if this is sound reasoning or not.\n\nLike I said this is more of just a mind game for me and I'm not actually thinking of submitting it in a serious debate. \n\n \n\n   ",
        "created_utc": 1408957268,
        "upvote_ratio": ""
    },
    {
        "title": "Help me survive a semester with a creationist Bio I instructor?",
        "author": "prattastic",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ehgs3/help_me_survive_a_semester_with_a_creationist_bio/",
        "text": "I recently started a new semester of school, and on the first day, as my Biology teacher introduced himself, he declared that he was a \"strong christian man\" and when we reached evolution he intended to \"teach the controversy\". Throughout the rest of the period he also indicated that the story of Noah and the ark was true and that he takes the seven day creation story as being literal. Now, obviously I'm taking Bio I, I have a lot to learn about science, I know enough to know just how much I don't know. Which is a hell of a lot. But throughout the rest of the course, when he's dismissing everything I hold to be true, I'd really like to be able to hold up a few irrefutable facts to back up my position. Can anyone suggest to me some of the finer points that I should know? Sourced material that I can hold up in class and not simply be told that he knows better?\n\nEdit:I'd like to add that I've contacted FFRF and ACLU as some have suggested. ",
        "created_utc": 1408924746,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else find themselves fascinated by lesser-known religions?",
        "author": "carlisl",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eh8t1/anyone_else_find_themselves_fascinated_by/",
        "text": "I have identified as an atheist for about 8 years now, and I largely ignore anything religion-related in my everyday life. \n\nHowever, I find myself incredibly fascinated by the lesser known religions of the world. Scientology or Wicca, for example, are so interesting to me. \n\nI find it especially hilarious that members of other (more well-known) religions refer to them as 'pseudoreligions'. I personally don't see the difference. \n\nI guess I largely view a religion as a fascinating phenomena (something to say, \"Wow, that's interesting\") rather than an ideology to either accept or reject.\n\nI was just wondering if anyone else viewed religion the same way...If so, which religions do you find most fascinating?",
        "created_utc": 1408919478,
        "upvote_ratio": ""
    },
    {
        "title": "I want to ask you all, how bad is really the situation where you live?",
        "author": "juanker52",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eg8oy/i_want_to_ask_you_all_how_bad_is_really_the/",
        "text": "Hello. I've been lurking in this subreddit for quite a while and finally felt like posting something. I'm from a small city from spain, where religion is mostly just a set of traditions. People here just don't seem to take faith as seriously as in any other place i've ever heard about. I've been a self-proclaimed atheist since I was 14 (about 5 years ago) and I've always felt a passion for science but I don't usually talk about these things out of my group of friends. When I grew up and took some interest in this kind of things (religion, belief, reason), I started watching richard dawkins videos and that was the first time I ever heard about creationists and I felt really shocked.\n\nThe thing is that I've never seen something like those 'god hates fags' guys around here. Taking the bible literally is a totally alien concept for me (and I was raised in a catholic school). Many people who are older than me just call themselves catholics without giving much importance to it, and most of the people around my age and younger are just atheists or kinda 'deists' (they feel like there's something superior but they say don't know or care).\n\nWhat I mean is, religion seems to be agonizing around here if you compare it to the US. indoctrination is nigh inexistent and almost no young people go to church anymore. Actually, the only Interaction i've had with religion out of the internet in this year was the moment in which an American missionary gifted me a copy of the new testament while I was walking home from university.\n\nNow, I want to ask you all, how bad is really the situation where you live? I'm specially interested in the USA, because of all the stories about crazy fundamentalists, creationists, bible belt, preachers, mormon missionaries and so on that I've been reading lately. (People won't even trust their vote to an atheist)\n\nSorry for the wall of text, bad english etc.\nPls respond",
        "created_utc": 1408895831,
        "upvote_ratio": ""
    },
    {
        "title": "Atheists Are Just Butthurt Over Church Bulletin Discounts (Facebook)",
        "author": "newbuu2",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eg80p/atheists_are_just_butthurt_over_church_bulletin/",
        "text": "",
        "created_utc": 1408895334,
        "upvote_ratio": ""
    },
    {
        "title": "a middle finger of light! the only perspective that makes sense",
        "author": "chasefarler",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2efeta/a_middle_finger_of_light_the_only_perspective/",
        "text": "here are 4 perspective options when dealing with the end of the universe and my advice:\n1. accept life as a thrilling adventure that will self destruct (mission impossible style)\n2. accept that we don't know how everything is connected so play it out in a \"good\" life kinda way. (leave it to beaver style)\n3. laugh at life and be a rock star who embraces chaos going into the abyss with wheels burning (andy kaufman style)\n4. ignore, don't think be dumb and happy (homer simpson style)\n\nmy advice : \naccording to scientists the universe will enter something called the deep freeze where it will be so cold that all matter will stop moving ,... forever. no more change, no possibilities of life, light cant even exist. and that's the give away. its like knowing the ending at the beginning of the book. dude make light! that's the big eff you to this whole thing. let me introduce you to your reason to live ... vengeance!!! the universe sucks and wants to create a space where things don't change and light goes dark.... sooo you can either help this bastard or say eff it im going to continue to change and light up my space as bright as I can get it! granted the universe wont notice nor would the ocean notice a sailor holding up the middle finger as he gets swallowed up by the sea - but its way cooler than going out in the fetal position. so change your matter around (ive selected to change it into a beer belly and gray hair and would like to offer it up as an option) and give out awesome amounts of energy to the people you care about. that's the biggest middle finger you can give to this unloving piece of crap (although kind of pretty in a weird way) universe! ",
        "created_utc": 1408862587,
        "upvote_ratio": ""
    },
    {
        "title": "Question: What is the best way to counter the \"archeological evidence\", when you know that the individual will not be interested in actual archeological evidence?",
        "author": "BenGeezy",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ef4xc/question_what_is_the_best_way_to_counter_the/",
        "text": "Example:\n\nQ.\"How can we be sure that the Bible is true?\"\n\nA. \"The archeological evidence proves the Bible is true.\"",
        "created_utc": 1408853426,
        "upvote_ratio": ""
    },
    {
        "title": "Can Physics Explain a God like power? Part 1 of 7",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eexq7/can_physics_explain_a_god_like_power_part_1_of_7/",
        "text": "",
        "created_utc": 1408847821,
        "upvote_ratio": ""
    },
    {
        "title": "An explanation on the difference between science and religious \"faith.\"",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eeltx/an_explanation_on_the_difference_between_science/",
        "text": "So there's an AMA going on right now on the great show Extra Credits, which talks about video games and video game design. It's something I love to watch and recommend to anyone who enjoys video games.\n\nBut they once made an episode where, while talking about faith and religions in video games, they equivocated religious faith with \"faith in science,\" and obviously I took huge exception to that.\n\nI posted [this](http://www.reddit.com/r/IAmA/comments/2eecag/we_make_extra_credits_and_extra_history_ask_us/cjyntaf) in the AMA to try and help explain the difference, and was curious to know if you guys have any additional arguments to add, or think any of my points were off or can be improved?",
        "created_utc": 1408838676,
        "upvote_ratio": ""
    },
    {
        "title": "An explanation on the difference between science and religious \"faith.\"",
        "author": "DaystarEld",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2eelsp/an_explanation_on_the_difference_between_science/",
        "text": "So there's an AMA going on right now on the great show Extra Credits, which talks about video games and video game design. It's something I love to watch and recommend to anyone who enjoys video games.\n\nBut they once made an episode where, while talking about faith and religions in video games, they equivocated religious faith with \"faith in science,\" and obviously I took huge exception to that.\n\nI posted [this](http://www.reddit.com/r/IAmA/comments/2eecag/we_make_extra_credits_and_extra_history_ask_us/cjyntaf) in the AMA to try and help explain the difference, and was curious to know if you guys have any additional arguments to add, or think any of my points were off or can be improved?\n\nEdit: This was accidentally posted twice, so anyone who posted in the other version, sorry if your comment was lost when I deleted it.",
        "created_utc": 1408838650,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking Atheists Dating Believers (and Vice Versa?)",
        "author": "warebec",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ed7td/seeking_atheists_dating_believers_and_vice_versa/",
        "text": "I give [all the details of what I'm doing in this blog post](http://completehistory.me/2014/07/15/dating-a-christian-isnt-necessarily-a-bad-idea/), but here's the part that says what I'm looking for.\n\n&gt; I want to make a whole series of stories like this, possibly collecting them into an anthology sometime down the road. I would prefer to focus on happy stories where the relationships are ongoing, but if you have something you want to say about a failed relationship, especially if it might help others, please share that, too. If you wish to tell the whole story in a comment, go ahead; if you wish me to dedicate a post to your story, please let me know through the comments below or by sending an email to mixedyokes@gmail.com. You can also send your stories to that email if you simply want to share but dont want me to share them with anyone else, just let me know; I will assume all stories sent to that address are meant to be shared unless told otherwise.\n\n&gt; Im aware that not every relationship can or even should be salvaged; sometimes, a breakup is for the best, especially if the Christian is using emotionally abusive or manipulative tactics such as ultimatums to force the atheist to believe or vice versa. My goal for this project is to show that relationships dont have to end just because there is a mixed yoke.\n\n&gt; Enough about me. What are your stories? What advice would you give to couples of believer and unbeliever?\n\nI hope people here are willing to share their experiences!",
        "created_utc": 1408804155,
        "upvote_ratio": ""
    },
    {
        "title": "I need some advice on how to respond to something...",
        "author": "AwwMangoes",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ebzrc/i_need_some_advice_on_how_to_respond_to_something/",
        "text": "Earlier today I saw an image on Facebook and decided to share it with my friends. The image basically is about homosexuality and the bible and how things like divorce, money, menstruating women, etc. are also talked about in the bible (and states how many times they are mentioned) as being sinful but are never really frowned upon. That image is [here ](http://imgur.com/M0fA3SV) in case you'd like to see it.\n \nI tend to be more on the side of not really caring what religion other people associate with so long as they don't push it on me. I have a really diverse friends list and most people usually just like something or ignore it and move on. \n\nBut I have this one friend who always has something to say when I post something like the above image. He's apparently extremely Christian and always has some kind of snarky Christian-esq comeback to my somewhat against religion posts. \n\nAnyway, to this image he replied: \"Don't, unless you can prove it.\"\n\nHow would you guys and gals respond to something like this? I usually just let him say whatever and don't bother responding but I'm kinda tired of doing that. What would be a good way to respond to him? Surely he must know these things are mentioned in the bible...hell, I know these things are mentioned in there and I've never read the bible. They might not be mentioned as much as the image states but I know they're there. \n\nI figured I'd ask here because I've always lurked this subreddit and you all seem to be much more down to Earth and level headed than pretty much anywhere else. So, if you have any advice on how to go about responding to him, I would really appreciate it! \n\nThanks!",
        "created_utc": 1408759298,
        "upvote_ratio": ""
    },
    {
        "title": "what if the source of western monotheism was just a bad translation?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ebx02/what_if_the_source_of_western_monotheism_was_just/",
        "text": "2013 Phi Beta Kappa video series  \n  \"What is a god?\"  [24:00] by [Dr. James J. O'Donnell](http://en.wikipedia.org/wiki/James_J._O'Donnell)  \n  http://youtu.be/mN-TfQrly90",
        "created_utc": 1408757299,
        "upvote_ratio": ""
    },
    {
        "title": "Context for the FFRF post.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ebqk1/context_for_the_ffrf_post/",
        "text": "Originally posted in /r/atheism. [Check it out](http://imgur.com/a/wTRTC). \n",
        "created_utc": 1408752610,
        "upvote_ratio": ""
    },
    {
        "title": "I haven't browsed this subreddit in a while, but I've been thinking about some stuff, and this is one of the only venues I have to speak my mind.",
        "author": "Kinetik_Inferno",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ebbuu/i_havent_browsed_this_subreddit_in_a_while_but/",
        "text": "I'm not a person who likes religion. I am not religious. To be honest I would describe myself as a gnostic atheist at best. Pretty much a 7 on the Dawkin's scale.\n\nAnyway, getting to my point.\n\nA few years ago I was much less mature and went through an 'angry atheist' phase which I'm sure many people can relate to. Eventually I stopped because I was told that I would make no friends if I behaved militantly about it. I stopped being such a dick and thought to myself 'everyone is entitled to their opinion, and I might be wrong.' \n\nI tend to understand other opinions if I can see how that person reached them. If someone values certain political ideals over others, I can see why. \n\nWhen it comes to religion, however, the only way I can understand how someone else reaches theistic opinions is through a failure of understanding, effort to consider, or emotional dependence on the nature of their religion. If someone sits down and examines the history of a belief system I don't see how you can get through that properly and come out still believing in deities we have practically no comprehension of. \n\nBut why do I care? I don't really know. Religion does good things and bad things. People always point to the good when I point to the bad, but I'm not sure the former outweighs the latter. But the reality of it is that launching a crusade against religion will stress me the hell out and won't even do that much so I just shut up about it. \n\nI think it just makes me uncomfortable. I don't understand the logic of belief. I don't see how someone can analyze it objectively and still believe. Even if religion does good, I don't like that its benefits come through spiritual motivation by something we really shouldn't have belief in. It makes me uneasy. I don't know why it does this. \n\nI don't like that billions of people maintain belief and structure some of their lives around something we have little to no reason to believe. Maybe some people need it? Maybe it sates some inner psychological thirst for inspiration and meaning. I don't know. It didn't do that for me but I am but one mind and I'm certain other people don't require identical motivation. So I try to be nice. I don't judge. But I don't like it.\n\nA bit of a long winded post but this is one of my only places to have anonymous discussion and writing helps me gets my thoughts together.\n\nSo I suppose what I'm asking is, if assuming that there are no deities, is it appropriate to have billions of people doing a lot of good things and some bad things in the name of faith? \n\nand, is there something I'm missing about the thought process behind belief?",
        "created_utc": 1408742946,
        "upvote_ratio": ""
    },
    {
        "title": "Suspended for saying \"Bless you\"?",
        "author": "WhiskeyFF",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e9tzb/suspended_for_saying_bless_you/",
        "text": "Just trying to get everybody's opinion on this, as a TN resident it's been all the rage lately especially with that movie coming out on RedBox this week.\nhttp://www.tennessean.com/story/news/local/2014/08/20/tennessee-teen-in-trouble-for-saying-bless-you-after-sneeze/14366865/",
        "created_utc": 1408711613,
        "upvote_ratio": ""
    },
    {
        "title": "[AMA] Roman Catholic Deacon",
        "author": "deakannoying",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e8fm6/ama_roman_catholic_deacon/",
        "text": "Howdy! After lurking on /r/atheism and then coming across this subreddit, it seems that many (most?) folks here actually use logic and reason in their philosophical / (a)theological pursuits, unlike many other locales in the internet ther. \n\nI typically come across nothing but vitriol for all things religious from self-avowed atheists, due to their being slighted in the past by said religion. Here I have seen a pittance of that, so I feel more comfortable that we can all respect the opinions of all.\n\nAs I stated in the title, I am an ordained, practicing, Roman Catholic deacon. I was born-and-raised Catholic, but fell away from the church for nearly a decade due to philosophical struggles with dogma, until I had a conversion experience which led me back to the church, even so far as to become a cleric (unfortunately not the D&amp;D type).\n\nCurrently, I am getting a Master's in (Christian, obviously) theology, and am particularly interested in the points of intersection and commonality within quantum physics, philosophy, metaphysics (ontology), and theology, such as those discussed by Spitzer, Jaki, and deChardin.\n\nAdditionally, I am exploring the idea that many atheists today seem to have a theology - in the true sense of the word: the study of God. Obviously they arrive at a different conclusion than I have, but in my mind, this still falls in that realm.\n\nMay I get some well-founded thoughts on this idea?\n\nAdditionally, I'm happy to answer any other questions y'all may have.\n\nEDIT: Sorry for the posting delay. My kids were running around screaming and I had to get them in baths and in bed. In retrospect, I should have waited to post until this morning, but kids have a way of creating unforeseen circumstances. Apologies, I will get to these today (between Mass and work). :)\n\nEDIT1: Thanks for the replies everyone. There were a couple that were quite interesting, a couple that were the typical \"you're stupid and fallacious and we are soooo more sophisticated, etc.\", but all in all I had a good time wasting away my day when I should have been doing something productive. Thanks for the food for thought - I gotta take a break and make some supper!\n\n",
        "created_utc": 1408668454,
        "upvote_ratio": ""
    },
    {
        "title": "Sam Harris: Waking Up - A Guide to Spirituality Without Religion. Chapter One [text, audio]",
        "author": "Secular_Response",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e8b6m/sam_harris_waking_up_a_guide_to_spirituality/",
        "text": "Sam Harris has posted the first chapter of his new book, Waking Up - A Guide to Spirituality Without Religion, on his blog. There is an audio version which is ~87 minutes.\nhttp://www.samharris.org/blog/item/chapter-one",
        "created_utc": 1408665669,
        "upvote_ratio": ""
    },
    {
        "title": "Post office religious materials. Originally posted on r/atheism by myself. Any suggestions?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e89yo/post_office_religious_materials_originally_posted/",
        "text": "[Original post](https://pay.reddit.com/r/atheism/comments/2d3vqh/ffrf_comes_through/)\n\n[email sent to the offending paper](https://pay.reddit.com/r/atheism/comments/2e84vi/kindasortaupdate_ffrf_action_in_texas)\n\nWhat else can I do? I don't foresee the local post office employees giving a crap about it one bit, including the branch manager. \n\nI'm still waiting on the response via the FFRF.  ",
        "created_utc": 1408664903,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for advice for a friend...",
        "author": "LatchoDrom42",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e6ydk/looking_for_advice_for_a_friend/",
        "text": "As the title says. I'm looking for advice for a friend of mine. I'm looking for rational, productive, and level headed advice. Not emotional responses and snap judgments that will only hurt her situation.\n\nShe lives in Oklahoma, a heavily religious area if you didn't already know. She's having serious problems with the public school system. I'll refrain from getting into longwinded explanations of each issue as this only what I've gathered over the last year. I'm sure I'm missing stuff and I may be misrepresenting stuff. To summarize:\n\n-Last year her kids(ages 10 and under) were heavily bullied, physically and mentally, in school over their lack of religion. Other kids have told them that it's a \"Christian school\" and if they don't like it they should leave.\n\n-The school has moments of silence each morning as many do. They call it their morning \"prayer\" and end it each day with \"amen\". The kids have been bullied by other kids for not bowing their heads and praying during these times and saying \"amen\" at the end.\n\n-The school has a bible on open display in the public office on a stand next to a paper outlining the schools \"core values\". My friend even showed me a picture of this one...\n\n-The school sends home church flyers practically every week in their folders.\n\n-The principle basically plays dumb over the entire thing and doesn't understand why the kids think it's a \"christian school\" despite what I said above. \n\nI'm sure the school does more things as well I just can't recall off hand. They did nothing last year to stop the bullying.\n\nIt got bad enough to where my friend tried to pull her kids from the school. Transfer requests to both other public schools in the area were denied. She attempted a home schooling route but the only internet available to her is too crappy to do that so it didn't work out. She has no choice but to send her kids to that school. Moving is not an option.\n\nShe doesn't like the idea of suing a school if it can be at all avoided as that takes away money from the district that should be going towards educating the children. She doesn't want to make more of an issue than it absolutely needs to be.\n\nShe's giving the school a chance this year to do something about any issues that arise. It wouldn't be a surprise to anyone if things didn't change from last year, though. \n\nSo, /r/TrueAtheism, should things not get better this year what suggestions would you guys recommend for a poor working mother to resolve this situation in the best way possible?\n",
        "created_utc": 1408638995,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling empowered and superior through death",
        "author": "DrakeX7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e6iri/feeling_empowered_and_superior_through_death/",
        "text": "I am a hedonist who feels that pleasure is the only thing that matters in life and that if I don't have it, then I and this life are both worthless. I am also an atheist who knows that, even though life is about not giving up and ending your life, I actually feel otherwise and I will present a compelling reason as to why:\n\nThere is something in life that I absolutely hate and wish to be superior to which would be acceptance of major problems in life (such as if I had to live the rest of my life in a hospital bed with cancer or live my entire life with little to no ability to experience pleasure from a mental condition known as anhedonia or depression). This sense of superiority can come in 2 forms: 1.) Having delusional fantasies and living a happy life not having to deal with these problems or 2.) Actually using a hard cold fact of reality to my advantage such as that, since there is no point in living and that we are just all going to forever die in the end anyway, instead of being someone who accepts major problems in life and continues to live on anyway, I will become a cold hard bastard and decide to do what I want by ending my pointless life. The cold hard fact of reality that since we are forever going to die in the end and that we might as well just kill ourselves, this is actually something liberating to me and I can use this fact of reality to become superior to acceptance of realitys major problems. I would have given up and died. But at least I have given up and died as someone superior. I would actually feel empowered and superior for deciding to have given up and killed myself and feel that this cold hard fact of reality I stated is my best friend since I can use it to my advantage here.\n\nMost people would not only consider those who give up and end their lives to be cowardly (weak), but they would also consider those who dont deal with such problems and escape such problems through delusional fantasies to be cowardly as well.  But I, on the other hand, do not feel cowardly (weak).  Instead, I feel the opposite which would be feeling empowered by those things.  Therefore, since I feel empowered instead of cowardly (weak), this is what makes me the opposite of cowardly (weak) in that I would instead be a powerful human being.",
        "created_utc": 1408630143,
        "upvote_ratio": ""
    },
    {
        "title": "Why does \"atheist\" seem to implicitly contain \"adeist\"?",
        "author": "brokething",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e60wz/why_does_atheist_seem_to_implicitly_contain_adeist/",
        "text": "Just something I have noticed, I don't know if it's accurate. But I have seen sentences like \"he's a deist, not an atheist\".\n\nIn my head, it seems like it should be 'all deists are atheists', but it seems like the actual relationship is 'atheists do not believe in god, interfering or not'.",
        "created_utc": 1408614751,
        "upvote_ratio": ""
    },
    {
        "title": "I am skeptic about the upcoming European Skeptic Congress in London",
        "author": "ergotum",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e5zzn/i_am_skeptic_about_the_upcoming_european_skeptic/",
        "text": "Hello everyone.\nI read the event page of /r/atheism and saw there is an event coming up in London on September 11-13th. I will be in London for my university studies so I am interested.\nHowever the website linked (http://euroscepticscon.org/) doesn't provide a lot of information. And the webpages of the organizers seem to be very outdated. Does anyone know more information about it? Is anyone going?",
        "created_utc": 1408613640,
        "upvote_ratio": ""
    },
    {
        "title": "A message of purpose",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e52ra/a_message_of_purpose/",
        "text": "I find it absolutely fascinating that most of the wolds population has been indoctrinated by some sort of religion.  It is a telling sign that culture is a great predictor of religion.  Anglo Saxon the past 1500 years has been dominantly Christian, after eroding away Paganism and Greek Mythology.  The spiritual Taosim and Jainism of the far East, the Hindu and Buddhism of Asia.  The Islamic religion of the Midle East.  On and on we can go, different cultures, different eras, different faiths.  The evolution of mankind from a nomadic wanderer, ignorant of the universe, produced a lot of fables, legends, myths and tales and continued to do so, including today.  It is typical of human nature to make up such stories and even lies and one way or another, people end up believing them, fully.  It becomes an escape from reality, the product of the human capacity for fantastical imaginations, to cope with our ignorance and inability to grasp how we exist and why  we have to die, or what happens to us when we die. These existential questions are coped with through beliefs, human ingenuity is able to thrive off of this, to provide hope.  Yet this hope is all belief based, due to the complexity of knowledge.   It was only a few centuries ago in which Kant produced his ground breaking work, a critique of Pure reason, or Humes Treatise of Human Nature.  Certainly other cultures have their validity in philosophy, yet none as so distinct, thorough, and clear, than these two works just mentioned.  Then of course, there is the progression of modern science, born of the philosophy of the scientific method.  After millions of years of evolution, we are finally grasping at actual knowledge and eliminating the need for guessing, myths, and beliefs.  Knowing and achieving a good understanding of human nature is still in the process of becoming, primarily with cognitive science. \n\nThere are benefits to believing in fables and legends, myths and fairly tales.  They provide humanity with a purpose, that they are incapable or unwilling to assign for themselves as a whole,  With fervor and belief comes purposeful intent, however good or bad.  When the majority population of a culture believes in it, it multiplies through reproduction, indoctrination.  Through religion however, people of a culture believe they have obtained all the answers needed for life.  We were created and Zeus, God, Buddha, Allah, wants us to do this, and this we shall.  Regardless of the multiple interpretations that exist, sects, they are all one in the same.  The populace finds solace in believing they know about existence and the majority goes on in not seeking further answers, or truth.  Yet there is a minority lineage, even in believers, in which curiosity is never satisfied.  These thinkers and truth seekers transcend beyond what the mainstream believers are satisfied with and end up with successful revelations, adding to the totality of human knowledge.  For them all, I am truly thankful and in debt to.  The majority has progressed on the minds and backs of an unwavering, critically thinking minority.  The majority, has an entirely different story to them, and they are subject at times to my pity and scorn.  From the brutal dictators, the liars, mystics and deceivers, the conformists. The unthinking majority, who think they think as well as anyone, which this is certainly a product of the success of their constant propagation of the planet.  Of course, can I really blame them?  Now I dontn want to sound too biased in this yet what I say may come across some criticism, I will back it up in comments as needed, if there is anyone who wishes to challenge what I have stated here.  For that, I am all for.  Please criticize my words, for the sake of clarity for yourself, or me, or both.  I will proceed based on this incomplete picture of civilization that I have presented above.\n\n \n\nThe majority of human nature can be deemed slavish, subject to rule and whim by a minority, fooled, duped.  Its always been that way, yet it was obviously not a necessity for humanity to know of knowledge.  After all, animals do just fine, populating the earth with not even a thought of god, or conformity.  Perhaps I misjudge some of the more intelligent animals, to that I  am open to, but insects, plants, surely are lacking in mental faculties that are capable of producing such abstract thoughts, yet there are more numerous than our own kind.  The subjugation of humanity to belief based ideology of reality can be obviously seen as problematic and inept to the most enlightened minds of our current society.  Knowing, that we do not know, and could not know, whether God exists, is half the battle to defeat such a tyrannical liar that religion is, duping society to believe in fantasy, to cope with death and ignorance.  Perhaps even to control, out of fear of eternal damnation or unimaginable suffering by powerful gods that are simply figments of imagination.  Lightning, being sent down by Zeus, surely was a punishment to those evil doers.  Whether we know of their evil was irrelevant, because if they were struck down, the gods certainly knew why.  Peace by fear may have some benefit in order and control over the slavish unthinking majority of populace.  Yet not all can be blamed as unthinking.  The problem of religion and human nature over all, isnt that thinking is foreign to believers of myths and fairy tales, its indoctrination from birth, years upon years of being told how it is, at a naive young age, is very damaging to any intelligent mind to fully understand reality as could have been, had indoctrination not taken place.  To anyone who has broken free from these chains of indoctrination, I am honored to have you read the words I write.    As you walk into the world among the people that believe everything you were told, hold your head up high, surely you are a rare breed, with a powerful independent mind.\n\n \n\nWhile the slavish sheep like mentality of humanity walks around spouting prejudices and bigotry, I urge the rest of us to not engage in the same.  It is imperative to not treat those the same way they may have treated us, the ones who didnt believe.  It is simply counter effective to the progress of all of humanity to engage in such ignorant, slander.  Human psychology tells us that the mind is not capable of changing its entire frame of reference when presented with logic and counter evidence to a comprehensive belief system that religion is.  Yet dont worry, perhaps a seed may be planted, that one day will blossom into understanding that their entire perspective of reality is belief based, not knowledge based.  Fear based, not education based.  We as a species arent capable of such drastic change, it is damaging to our purpose, and purpose is what brought us so far, yet I can see that this future may be brighter than ever, if we proceed carefully and thoughtfully about how the education and knowledge sharing, of the totality of human knowledge can be spread, much of which is right at our fingertips. Peace by fear is ultimately an inept strategy.  Happiness through fantasy just the same.  Education can provide knowledge based peace and knowledge based happiness.  Yes it is possible to teach values to our young, to tell them the moral ways of how to act based on key values of the progression and betterment of humanity.  The core value, is the value of life, not the eager yearning for death and the apocalypse, or the second coming and heaven, but the preciousness of the one life we likely all have on this earth together.  Through education we can achieve peace by fear, a greater peace than the deceptive lies of religion has ever brought, with no need for the wars that religion brings with it as well.  With knowledge, even therapy, psychology and philosophy, one can achieve happiness, knowledge based happiness.  Happiness of course comes from within, but with a knowledge based contentment, instead of fantasy based happiness, we can truly achieve great things as a society.  The totality of human knowledge truly eliminates the need for believing, as our archaic ancestors once had. I ask that you all join me in learning about all things, as much as possible, so that you too may enjoy the understanding and peace that I have.  Hopefully you have already achieved it, many of us have.\n\n \n\n",
        "created_utc": 1408586119,
        "upvote_ratio": ""
    },
    {
        "title": "I still love my extremely religious family, but being around them especially for an extended time period is quite uncomfortable. DAE share this experience?",
        "author": "warebec",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e3q78/i_still_love_my_extremely_religious_family_but/",
        "text": "I spent some time with family over the last few days, and though I still care about them dearly, it's increasingly difficult for me to be around them because religion so permeates their lives. (I moved away for a job after college so I have to drive about two hours to see them.)\n\nFor instance, my sister, a sister-in-law, and I all had birthdays this month, and because my sister and I are both living out of town (though she is states away), we celebrated all our birthdays together when my sister and I were visiting our parents. My mom gave my sister-in-law a DVD of *God's Not Dead*, and my oldest nephew (13) was interested in watching it. Everyone seemed to be saying what a good gift it was and how eager they are to see it. I had to bite back comments about using it to play Spot the Fallacy and pointing out how it misrepresents atheists so grossly. (I haven't seen the film myself, but as a lurker on this sub, I've heard a lot about it.)\n\nAnother example is my family peppers essentially everything they say with \"Thank the Lord\" or other \"ejaculations\" (that is the real term for short prayers like that; hilarious, right?). My niece broke her arm over the weekend falling off a chair (toddlers are fragile) and it was \"thank the lord\" that she required only a cast and not surgery. God could have arranged things so she never broke her arm in the first damn place! Dad mentions a guy who died and said \"god rest his soul\". That man could have not gotten cancer (disclaimer: might have been different disease) and died were god really there and loving. I pointed out to my other sister-in-law that vegetarians see meat as murder because they see animals as having a level of personhood, and she said \"God designed us to eat meat\", although she had the decency when I made a face or something to correct herself.\n\nI can't talk about my boyfriend as someone living with me in front of my nephews, so I have to be really careful not to say \"we\" have pets. He isn't invited to family gatherings, although when it is Thanksgiving or Christmas I bring him anyway. Family members get upset when I talk about him as someone living with me or even as my almost-husband (financially bad decision to marry right now, or we almost definitely would be).\n\nI feel like a total outsider among my own family. I don't think they have any idea how ostracizing their behavior can be, and I don't know how to tell them. I'm sure they notice that I tend to distance myself; I made plans to stay with a friend rather than sleep at my parents' house this weekend. They do know I'm an atheist, except for the nephews and niece, some of whom are too young to understand. What I've been doing is just not going to visit unless there's a birthday (there's a lot of those) or some other event, and it hurts because my niece doesn't even know who I am and I really miss being a part of the family. On the other hand, the distance is a convenient excuse to stay away from what is an extremely uncomfortable environment.\n\nDoes anyone else have a similar situation? Should I be more assertive about how distressing this is for me?\n\nTL;DR see title",
        "created_utc": 1408558683,
        "upvote_ratio": ""
    },
    {
        "title": "Response: 5 Lies Atheist Tell",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e3adz/response_5_lies_atheist_tell/",
        "text": "TodayChristian.net recently published an article title, 5 Lies Atheist Tell. The following is my response to that article: http://exm.nr/1pCdXRg ",
        "created_utc": 1408550418,
        "upvote_ratio": ""
    },
    {
        "title": "What news story(ies) about Atheism/Atheists do you think got significantly less media coverage than they deserved?",
        "author": "AskTheElites",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e2v3t/what_news_storyies_about_atheismatheists_do_you/",
        "text": "**Disclosure:**  I'm the mod of /r/UnderReportedNews and will (hopefully) be posting many of the articles posted here to /r/UnderReportedNews.",
        "created_utc": 1408541292,
        "upvote_ratio": ""
    },
    {
        "title": "I have this emotional desire to be a part of religion. Please help...",
        "author": "TheOtherCollin",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e1u01/i_have_this_emotional_desire_to_be_a_part_of/",
        "text": "So, when it comes to actual thinking rather than emotional drive, I am an Atheist and I know I should not want to be in religion for many reasons.  However, the emotional side of me is so very attracted to religion, and this troubles me; it puts me into a state of extreme stress and unhappiness.  How can I escape this and learn to both mentally and emotional accept life without religion?",
        "created_utc": 1408506438,
        "upvote_ratio": ""
    },
    {
        "title": "Is gnostic atheism a defensible position?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2e1enx/is_gnostic_atheism_a_defensible_position/",
        "text": "",
        "created_utc": 1408496787,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone recommend a book like Dawkins's The Greatest Show on Earth that's not... Dawkins?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dz6kb/can_someone_recommend_a_book_like_dawkinss_the/",
        "text": "My dad has been open to scientific thought for a while and is really a rational person. However, when it comes to evolution, human evolution specifically, I always hit a wall. He is obsessed with this idea of a \"kind\" as many YECs are, even though he himself is not a YEC in full. I considered getting him that popular Francis Collins book which seems to show how religion and science aren't inherently at odds with eachother, but in further research of the book I realized that the heavy compartmentalization that Collins seems to have isn't the kind of thought I want to be promoting in my father. \n\nHe's simply averse to the name Dawkins, and I'm afraid that his book would tie in some anti-religious themes into it (considering it is Dawkins). \n\nI realize this is more of a scientific question but I know this kinda thing plays into discussions between atheists and theists all the time. I want something that's not overly religious but not overly antitheistic either. Thanks!",
        "created_utc": 1408451496,
        "upvote_ratio": ""
    },
    {
        "title": "Questions for a Debate",
        "author": "wertyou2",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dyoc3/questions_for_a_debate/",
        "text": "**Note: I apologize if I shouldn't be posting this here. If this is the case, please point me to the appropriate subreddit.**\n\nSo I was debating with a friend of mine about God, intelligent design, evolution, etc. He's a pretty smart guy, had a lot of information to back up his beliefs (primarily historical which I know jack squat about), but his scientific reasons I had never heard before/I know very little about. So, I'd like to give a few things he said so I know if they're true, how to respond, etc.\n\n(please note I'm paraphrasing here, it's a bit late so I may be mis-remembering (is that a word?) what he said, but I'll try not to)\n\n1. \"Stephen Hawkings has said that before the universe there was absolutely nothing. Because something can't come from nothing, there had to be a being intelligent enough to create it.\" (**I tried to bring up that he can't use that argument but then not explain where the being came from. He just said that \"you can't have an infinite amount of causes to account for all the effects in the universe. Because god exists outside of science, he doesn't need a scientific explanation.\" He used a similar argument for miracles, saying \"god created science, so he can make exceptions.\")**\n\n2. \"The chances of abiogenesis occurring is 1 in 10^40,000. Most statisticians agree that these chances are far too improbable for such a thing to occur that it's essentially impossible.\"\n\n3. \"Nearly all genetic mutations are big and negative, therefore evolution having mutations that are small and positive is nearly impossible.\"\n\n4. \"Everything in nature seems perfectly designed for human beings. There's no way to explain that/the complexity around us with mutations. There had to be a creator.\"\n\nAgain, he's a great guy and he wasn't trying to force his belief or anything, he just likes debating about it. He just said that from what he knows, he's decided that God makes the most sense. Can't really fault him for that.\n\nThough he did keep arguing that if I look at it from his perspective, then it all makes sense, therefore god exists, which I don't think is the best argument for actual scientific existence. Course, I'm an idiot, so who knows.\n\n\n\n**EDIT**: This is exciting, I'm learning things! Here's another thing he asked that I'm curious to as well:\n\n\"DNA is far too complex to have evolved through chemical processes. How can evolution explain the formation of data?\"",
        "created_utc": 1408432462,
        "upvote_ratio": ""
    },
    {
        "title": "As an atheist I see no reason not to lie. Is there something inherently wrong with lying?",
        "author": "thename226",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dxnqx/as_an_atheist_i_see_no_reason_not_to_lie_is_there/",
        "text": "Will x-post in /r/debateanatheist.\n\nhttp://www.reddit.com/r/DebateAnAtheist/comments/2dxoot/not_the_usual_post_for_this_sub_as_an_atheist_i/",
        "created_utc": 1408406695,
        "upvote_ratio": ""
    },
    {
        "title": "My ground rule for discussing the evidence for gods",
        "author": "SerialAntagonist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dxli2/my_ground_rule_for_discussing_the_evidence_for/",
        "text": "When I'm drawn into a one-on-one discussion about belief with a theist, I state that if I were given compelling evidence that a god existed, I would try to discover *what* god or gods existed and then what actions if any I should take based on that revelation.\n\nThen I ask, \"What would *you* do, and how would it affect your life, if you found evidence that *your* belief is incorrect?\"\n\nIf they can't or won't answer, I tell them that there's no point in continuing the conversation; both of us can't be right, but only *one* of us is prepared to deal with the possibility of being wrong.\n\nIf they have a reasonable answer, and they're at least *somewhat* prepared to live longer than their faith, then I'm happy to continue.\n\nWhat are *your* ground rules?",
        "created_utc": 1408405349,
        "upvote_ratio": ""
    },
    {
        "title": "Would you let your atheism hamper your career?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dxbyo/would_you_let_your_atheism_hamper_your_career/",
        "text": "I've come across a job opportunity that almost sounded too good to be true. I'm well qualified, it's in an industry I'm familiar with, and it's the big step up financially and socially that I've been looking for. \n\n*However,* the job is at one of a large network of Catholic hospitals in my area, and the listing made it exceptionally clear that a potential employee's faith would be important in any hiring decision. \n\nWere you in my shoes, would you fake reverence to get the job, apply and be up front about your atheism, or not apply at all? Thanks for your thoughts and input. ",
        "created_utc": 1408399770,
        "upvote_ratio": ""
    },
    {
        "title": "Religion serves a useful survival purpose",
        "author": "DrakeX7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dxbln/religion_serves_a_useful_survival_purpose/",
        "text": "For those of you who think that religion is completely useless, pleasure is something meant for survival. Therefore, if you receive pleasure from delusional fantasies (religion and such), this is obviously a survival mechanism.  If it were truly something useless, then why would we even receive pleasure from these things in the first place?  Evolution would obviously deem those things as useless and not even encourage us through pleasure to survive through these delusions.",
        "created_utc": 1408399554,
        "upvote_ratio": ""
    },
    {
        "title": "Frank Sinatra beautifully articulated his own progressive, atheist beliefs in this Playboy interview from way back in 1963!",
        "author": "Eveverything",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dw6zj/frank_sinatra_beautifully_articulated_his_own/",
        "text": "[Full text can be found here](http://sinatrafamily.com/forum/showthread.php/29275-Frank-Sinatra-s-1963-Playboy-Magazine-Interview)\n\n&gt;Playboy: All right, let's start with the most basic question there is: Are you a religious man? Do you believe in God? \n\n&gt;Sinatra: Well, that'll do for openers. I think I can sum up my religious feelings in a couple of paragraphs. First: I believe in you and me. I'm like Albert Schweitzer and Bertrand Russell and Albert Einstein in that I have a respect for life -- in any form. I believe in nature, in the birds, the sea, the sky, in everything I can see or that there is real evidence for. If these things are what you mean by God, then I believe in God. But I don't believe in a personal God to whom I look for comfort or for a natural on the next roll of the dice. I'm not unmindful of man's seeming need for faith; I'm for anything that gets you through the night, be it prayer, tranquilizers or a bottle of Jack Daniel's. But to me religion is a deeply personal thing in which man and God go it alone together, without the witch doctor in the middle. The witch doctor tries to convince us that we have to ask God for help, to spell out to him what we need, even to bribe him with prayer or cash on the line. Well, I believe that God knows what each of us wants and needs. It's not necessary for us to make it to church on Sunday to reach Him. You can find Him anyplace. And if that sounds heretical, my source is pretty good: Matthew, Five to Seven, The Sermon on the Mount. \n\n&gt;Playboy: You haven't found any answers for yourself in organized religion? \n\n&gt;Sinatra: There are things about organized religion which I resent. Christ is revered as the Prince of Peace, but more blood has been shed in His name than any other figure in history. You show me one step forward in the name of religion and I'll show you a hundred retrogressions. Remember, they were men of God who destroyed the educational treasures at Alexandria, who perpetrated the Inquisition in Spain, who burned the witches at Salem. Over 25,000 organized religions flourish on this planet, but the followers of each think all the others are miserably misguided and probably evil as well. In India they worship white cows, monkeys and a dip in the Ganges. The Moslems accept slavery and prepare for Allah, who promises wine and revirginated women. And witch doctors aren't just in Africa. If you look in the L.A. papers of a Sunday morning, you'll see the local variety advertising their wares like suits with two pairs of pants.      \n\n&gt;Playboy: Hasn't religious faith just as often served as a civilizing influence? \n\n&gt;Sinatra: Remember that leering, cursing lynch mob in Little Rock reviling a meek, innocent little 12-year-old Negro girl as she tried to enroll in public school? Weren't they -- or most of them -- devout churchgoers? I detest the two-faced who pretend liberality but are practiced bigots in their own mean little spheres. I didn't tell my daughter whom to marry, but I'd have broken her back if she had had big eyes for a bigot. As I see it, man is a product of his conditioning, and the social forces which mold his morality and conduct -- including racial prejudice -- are influenced more by material things like food and economic necessities than by the fear and awe and bigotry generated by the high priests of commercialized superstition. Now don't get me wrong. I'm for decency -- period. I'm for anything and everything that bodes love and consideration for my fellow man. But when lip service to some mysterious deity permits bestiality on Wednesday and absolution on Sunday -- cash me out. \n\n&gt;Playboy: But aren't such spiritual hypocrites in a minority? Aren't most Americans fairly consistent in their conduct within the precepts of religious doctrine? \n\n&gt;Sinatra: I've got no quarrel with men of decency at any level. But I can't believe that decency stems only from religion. And I can't help wondering how many public figures make avowals of religious faith to maintain an aura of respectability. Our civilization, such as it is, was shaped by religion, and the men who aspire to public office anyplace in the free world must make obeisance to God or risk immediate opprobrium. Our press accurately reflects the religious nature of our society, but you'll notice that it also carries the articles and advertisements of astrology and hokey Elmer Gantry revivalists. We in America pride ourselves on freedom of the press, but every day I see, and so do you, this kind of dishonesty and distortion not only in this area but in reporting -- about guys like me, for instance, which is of minor importance except to me; but also in reporting world news. How can a free people make decisions without facts? If the press reports world news as they report about me, we're in trouble. \n\n&gt;Playboy: Are you saying that . . . \n\n&gt;Sinatra: No, wait, let me finish. Have you thought of the chance I'm taking by speaking out this way? Can you imagine the deluge of crank letters, curses, threats and obscenities I'll receive after these remarks gain general circulation? Worse, the boycott of my records, my films, maybe a picket line at my opening at the Sands. Why? Because I've dared to say that love and decency are not necessarily concomitants of religious fervor. \n\n&gt;Playboy: If you think you're stepping over the line, offending your public or perhaps risking economic suicide, shall we cut this off now, erase the tape and start over along more antiseptic lines? \n\n&gt;Sinatra: No, let's let it run. I've thought this way for years, ached to say these things. Whom have I harmed by what I've said? What moral defection have I suggested? No, I don't want to chicken out now. Come on, pal, the clock's running.",
        "created_utc": 1408377497,
        "upvote_ratio": ""
    },
    {
        "title": "The ethics of evangelical anything",
        "author": "slam7211",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dvwh8/the_ethics_of_evangelical_anything/",
        "text": "So I often hear, on both sides of the religion debate, that one side despises, or hates the evangelical or militant wing of the other side. I have always be a default atheist, my parents introduced me to religion, never forced it, and it never stuck. I live in NE america, which is pretty atheistic IMO, or at least religion isn't on display in the public square everywhere. Religion has always been a personal private thing up here. I almost never have to deal with missionaries, or people trying to convert me, and I never try to convert anyone to atheism. I really find pushing your unprovable beliefs on others to be harmful to society. I feel like we should just let people come to their own decisions and move on. ",
        "created_utc": 1408371089,
        "upvote_ratio": ""
    },
    {
        "title": "Creationism -&gt; Agnosticism?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dvgit/creationism_agnosticism/",
        "text": "I wasn't sure what to put as the title so I just winged it. I roughly created a theory about two minutes ago involving Creationists and Agnostics. Now, remember this is all in theory and this scenario will most likely never occur, but here goes. Say a flaw was found in the beliefs of Creationists that severely decreased the odds of a deity existing, but did **not** disprove anything completely. Would this event cause widespread conversion to Agnosticism? More specifically Agnostic Theism? What would be the backlash? I'm a newbie to all this so that's why I would like some feedback. This is all just out of curiosity so there's really no point to it.",
        "created_utc": 1408356568,
        "upvote_ratio": ""
    },
    {
        "title": "Living up to the quote, \"We are a way for the cosmos to know itself.\" ~Carl Sagan",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dv9vw/living_up_to_the_quote_we_are_a_way_for_the/",
        "text": "**If you're an atheist, I'm going to make some assumptions about you.** First of all, you likely accept the scientific evidence for our origins. You think as Carl Sagan is oft quoted, that \"We're made of star stuff. We are a way for the cosmos to know itself.\" You accept the profound truth that if we were to take apart ourselves atom by atom, we would be left with a fine atomic dust that was produced in the furnaces of the stars. All of it us, but none of it alive.\n\n**There is something unique to our human existence, that is our self-awareness.** Sometime in the last 100,000 years or so we evolved a consciousness that permitted us to plan and conceive of our own existence, and our own death. It leads to existential dread in some, and profound joy in others. The only thing we can really know for sure about this existence, is that we, each of us reading this, has it. \n\n**A lot of us are not really sure what to do with it.** We sit around eating copious amounts of delicious treats, binge watching tv shows, and engaging in behaviours not befitting someone who knows that they are literally a way for the cosmos to know itself. But that truth is something easily forgotten.\n\n**For along with this marvelous consciousness, we also have this 3 pounds of matter contained within our skulls that produces that consciousness.** This matter in our skull (let's call it a brain since we both know that's what i'm talking about), operates with a complex network of patterns. Think of the surface of the brain as a sheet of jello. Now imagine when you were a child and you were first being told things and behaving certain ways. Those thoughts and behaviours are like hot water being poured onto the jello. They make grooves within the jello. The next time thoughts or behaviours get poured onto the water, some of them may filter down the same holes as last time digging deeper and reinforcing themselves (as an aside, this also explains why childhood indoctrination of god is so powerful, because new information is filtered through the information we already believe).\n\n**This in a very simplistic manner is how your brain is working right now.** You've built these deeply entrenched thoughts and behaviours, and without even thinking about them, have let them run their course. You react to situations rather than respond to them. If someone cuts you off in traffic, you run through a series of expletives that didn't even pass the level of a rational decision,  you just blurted out screw you asshole. You're out with a friend for coffee and suddenly your phone is in your hand and youre browsing some bullshit that doesn't matter and you'll forget about tomorrow. You get to the point where you stop living your life and responding to what happens, and are an automaton that has foregone his consciousness in lieu of a passive existence. \n\n**I sense some rantiness going on so I'm going to dial it back a notch and focus on the point.** The point is, you have forgetting that profound truth that you know is true about your existence. You are an evolved consciousness. You are not your thoughts, or the patterns of behaviour that are endlessly playing out in a perhaps depression and anxiety riddled existence. You are the awareness of those thoughts. \n\n**However, the way the game is set up right now, people have become convinced that they are their thoughts.** When they think something horrible or offensive, it may even prevent them from sleeping because they ruminate on it as thought it's real. Not just that, but a random thought can ruin our day. Think about something in the past, or that you might have to do in the future, and suddenly you just want to avoid thinking and hide in away. This may be something you struggle with. You're afraid of so many things, failure, rejection, what might happen when you pick up the phone and call someone, that you let your consciousness drift away from you and absorb itself in whatever form of digital distraction currently available. \n\n**It doesn't have to be that way.** You don't have to be on the sidelines of your life, thinking you can't change it, that you're powerless to move forward and start living the existence you feel is rightfully yours to live. First though, you have to recognize that you are not these negative thoughts and behaviours, and patterns of habit that may currently be plaguing your existence.\n\n**All it takes is 5 minutes.** Turn off whatever distractions are around you, and for the next five minutes, just close your eyes and focus on your breath. Breath in, notice the pause between inhale and exhale, breathe out, and notice the next pause. Pick a spot to focus on the sensation of the breath, like your nostril. You will notice almost instantly that your concentration will depart from the breath and some random thought will pop up, and it may even turn into a train of thought until you bring your attention back to the breath. This is going to happen guaranteed, and you can just observe it, and ponder how it seemingly came from nowhere. Then take your attention back to your breath. \n\nIt only takes 5 minutes, set an alarm, close your eyes and do this. Take a little look inside for a bit and see what's really going on in there. \n\n**This is not anything mystical or weird, it's just taking a moment to recognize what your consciousness is and what it does.** There is so much in this world that we miss out on, that we get anxiety or depression over, that we endless stress about, that has no bearing in the reality of right now. All you have is this moment, and this one, and this one. That's it!\n\n**I started out making some assumptions about you as an atheist.** Being an atheist doesn't necessarily mean you're a skeptic and don't believe in the supernatural, but there's a good bet those things are also true. If they are, then you know that the nature of ego, this sense of self we have cultivated, is also based on an illusion. The truth is that we are just a stream of consciousness, that we are awareness in the present moment.\n\n**I'm not religious, I don't like pseudoscience or any deference to the supernatural.** But you don't have to accept pseudoscience or any of the bullshit that comes with it to meditate, and to understand your true nature. This is a natural stepping point from being an atheist and understanding the evolution of the brain and the consciousness, and the nature of our being. \n\n**We are literally a way for the cosmos to know itself.** Don't view life as you're one individual faced with a whole universe, you are the universe and you get to exist and learn about yourself. For all we know, we're it as far as intelligent life is concerned in the billions and billions of galaxies in the universe. It's unlikely, but right now, we're it. So if you're not happy, if you're sick of what you're doing with your life and are tired of being lazy and unmotivated, be the change. Become aware of what you truly are and put that information to use to better yourself, and better this pale blue dot we call home. \n\n",
        "created_utc": 1408348665,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any evidence that human religion is based on an evolutionary adaptation?",
        "author": "curtisb21",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dv32h/is_there_any_evidence_that_human_religion_is/",
        "text": "Maybe it emerged to facilitate cooperation, to unite people together in an effort to increase survival of the population.",
        "created_utc": 1408341463,
        "upvote_ratio": ""
    },
    {
        "title": "Delusions make the human mind that more amazing",
        "author": "DrakeX7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dv0ry/delusions_make_the_human_mind_that_more_amazing/",
        "text": "People with either delusions of grandeur or the delusional belief in a God or afterlife should not be frowned upon because mental delusions are just one of the many amazing functions of the human mind.  I'm sure many atheists admire the beauty of knowing how things scientifically work and such.  Therefore, you should acknowledge the fact that anyone with a delusional belief has a beautiful scientific inner working of their minds and you should not frown upon it and convince them otherwise of their beliefs and such.  I realize that atheists value the truth that there is no God and afterlife, but you should also value the fact that any attitude or delusional belief a person has is just something scientifically meant for survival.  You should not try to change how things work according to science in this specific situation (which means not trying to change this person's beliefs).  However, when it comes to the beliefs either causing harm to themselves or anyone else, that's when it's time to intervene.  But other than that, if this person's belief just simply brings them personal pleasure in life, then it should not be frowned upon at all and should be acknowledged as an amazing function of his/her mind that makes this person that more amazing.  I have delusions of grandeur and I don't have the intention of harming anyone or halting scientific progress.\n\nEdit: There are innocent people here just living their own fantasy world not harming others or causing wars and we should just leave these people alone and never tell them the truth of reality as long as they are happy with their fantasies. We should encourage their fantasies to make them even more happy. If your attitude is that we should convince these people otherwise because the more people we have who realize the facts of reality, the more progress we have in science and such, then what if they never wanted to be that way and being that way makes them disappointed and depressed? Not to mention, some people don't even care about science and supporting it--they are just fine living their own innocent happy lives. Therefore, it's not worth it at all to tell them the truth of reality just for the possible sake of getting a more few people here and there to support science when the fact is that science is already being well supported by many people.\n\nFinal Edit: Many people think that those who live in a fantasy world are somehow weak or useless to society, but this couldnt be further from the truth. I am using my living in a fantasy world mindset to compose music. Composing music is something that greatly contributes to society (even pieces of music that have fantasy-like emotion to them since even these types of music are honored by many people whether it just be instrumental or even with lyrics and such). The mindset that I wish to live in a fantasy world is very important to me because I use that in composing music that has beautiful fantasy-like emotion to it and such and I do not want anything in reality to interfere with it. Although there are people who do use inspiration from reality and use that to compose music, I am not this type of person at all. I can use my inspiration from fantasy to achieve greatness and success in life just as good (if not better) than those people who do with inspiration from reality. Therefore, this right here says that my personal delusions of grandeur through fantasy will not have negative consequences and are just as good (if not better) than reality itself. Instead, I will be someone great and perhaps very successful in life through being a composer.",
        "created_utc": 1408339333,
        "upvote_ratio": ""
    },
    {
        "title": "How do you plan to have your funeral?",
        "author": "thicknprettypanda",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dttem/how_do_you_plan_to_have_your_funeral/",
        "text": "Im young enough where it shouldn't be too much of a worry but iv made sure my s.o.and family know i dont want a priest or religious speaker at my funeral. But im not sure what else would be good for an atheist funeral. Any ideas or personal plans?",
        "created_utc": 1408309356,
        "upvote_ratio": ""
    },
    {
        "title": "Why people are better off believing in heaven",
        "author": "DrakeX7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dtk2p/why_people_are_better_off_believing_in_heaven/",
        "text": "Now heres a main reason why I feel people are better off with the delusional belief of there being a God and an afterlife (including me) because there is the ultimate mockery of all of you as a human being which is that, in the future, they might find a way to become immortal and eliminate many types of suffering (diseases and such). Everyone in the future might live a nice life of immortality while you and everyone else are unfortunate in that you will not only live lives of suffering and possible disease, but will die and remain dead in the end after all that suffering and no special reward for that suffering in the end. All of it was for nothing in the end. One might have the attitude of At least I did my best in life or that At least Ive helped others suffering, but even that will be all for nothing in the end because when you are dead, the fact that you made the best of your life would no longer matter and also that anyone youve inspired or helped in lifethey will just die in the end as well. No, it doesnt matter how much of a person you are and what your desires are in life, this pathetic universe considers you unfortunate and, for that very reason, you are going to suffer and die and remain dead. Therefore, this is one of the main reason why I consider this life a pathetic joke and an utter mockery to us as human beings. This is why I wish I instead wasnt an atheist and believed there was a God and an afterlife of immortality and eternal joy and feel that people are better off with this delusional belief.  The only thing they are not better off with would just be the morals of religionthose are something I am against.",
        "created_utc": 1408303381,
        "upvote_ratio": ""
    },
    {
        "title": "How do you handle anger towards religious platitudes in regards to death",
        "author": "JesusAtTheGloryhole",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dtaul/how_do_you_handle_anger_towards_religious/",
        "text": "I just found out a friend of mine died suddenly. It's tough and he's young, he was just going into his last year of college. \n\nI saw a facebook post notifying friends who hadn't found out already of what happened and it had lots of \"pray for the family\" and \"god's plan\" type of stuff which is fine but for some reason when I saw the first comment someone made it made me furious. \n&gt;\"Thank god we serve a god where whoever believes in him has eternal life.\"\n\nI understand people use religion to cope with death and I respect their right to do so. I feel like it's wrong of me to be mad about this but it feels like they're cheapening his life by just writing it off as just the beginning of a journey and that he's not really gone. I can't help but be filled with anger when I see stuff like this and honestly don't know if I'll be able to go to his funeral because of this. \n\nMy girlfriend's family and many of her family friends will likely be there and I am not \"out\" to any of them. I don't want to just smile and nod while I pretend their bullshit doublespeak about heaven and better places is at all comforting and I also don't want this to be when my nonbelief becomes a topic.\n\n\n\n\n\nHow do you handle it when religious people say things to you like this? \n\nIs it right of me to be upset? \n\nAre there any polite ways to respond that aren't overtly anti-religious but still don't feel like you're just agreeing with one of these religious statements to avoid conflict?\n\nEDIT: I remembered a show of The Thinking Atheist where he talked with the lady who started [Grief Beyond Belief](http://www.griefbeyondbelief.org/). They have a section specifically on some of this which I found helpful. Just though I'd share for anyone unfortunate to need it in the future. ",
        "created_utc": 1408297411,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a de facto gnostic atheist. Well, shit.",
        "author": "axehomeless",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dst76/im_a_de_facto_gnostic_atheist_well_shit/",
        "text": "Just wanted to put it out there, seeing all these talks about atheists just makes me feel very alone because everybody is agnostic. I'm not. Not at all.\n\nI have always been an atheist, I have become and antitheist when I read the whole lot and watched the more lot, and then I god Victor Stengers god: the failed hypothesis.\n\nI am somewhat of a scientist and somewhat of a philosopher and I am pretty well versed in this, and I know we probably never will \"know\" anything empirical, wen can only try to come close to objectivity to the best thinking tools of intersubjectivy.\n\nThe problem is, the concept of god or gods we have in today's and yesterdays mythology don't make any sense at all and there is no evidence at all where there should be tons. This hypothesis is falsified. I'm certain of it as I have ever been certain of anything in my life. \n\nThere people who wrote the bible didn't have some cosmic supernatural inspired thing in them, the archangel gabriel never said a word to the businesman in the desert and the sons and daughters of isaac don't have a covenant with evil space grandpa.\n\nThere is *NOTHING* that would suggest otherwise and there should be if there was a remote possibilty of any of it being true.\n\nI just wanted to get it out there, I feel pretty alone in that view, all the \"enlightend\" atheists stressing that they're explicitly not what I am. I'm sorry.",
        "created_utc": 1408284609,
        "upvote_ratio": ""
    },
    {
        "title": "Need a tip: Downloadable long atheist/skeptic text? Bible and Quran: No prob. Atheist/Skeptic: Void.",
        "author": "king_of_the_universe",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dslg4/need_a_tip_downloadable_long_atheistskeptic_text/",
        "text": "I'm making a text adventure game and am currently working on a television object. There will be a few channels. Just because it's so easy, I thought to put in a Bible channel where random excerpts are read to the audience. Same for Quran, was equally easy.\n\nI would like to add a skeptic/atheist channel, too, but couldn't find a nice long text as material for this.\n\nDo you guys have any suggestions?\n\n(While we're at it: Any suggestions for other channels?)",
        "created_utc": 1408276468,
        "upvote_ratio": ""
    },
    {
        "title": "My Philosophy of Life",
        "author": "Philsofer1",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2drti4/my_philosophy_of_life/",
        "text": "Over the past few years, I have formulated my philosophy of life, a 14-page document that may be found at the following site:\n\nhttp://philosofer123.wordpress.com\n\nIn the first half of the document, I present and defend the following positions: atheism, afterlife skepticism, free will impossibilism, moral skepticism, existential skepticism, thanatophobic irrationalism and negative hedonism. The second half of the document is devoted primarily to ways to achieve and maintain peace of mind.\n\nI have found the entire exercise to be very beneficial personally, and I hope that you will benefit from reading the document.\n\nI am posting my philosophy to solicit feedback so that it may be improved. I welcome any constructive criticism that you may have.",
        "created_utc": 1408245280,
        "upvote_ratio": ""
    },
    {
        "title": "By sticking to rhetoric engineered by encounters with an intransigent dogmatic minority, are we costing ourselves the 'on-the-fence' majority?",
        "author": "ModerateDbag",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dr8ht/by_sticking_to_rhetoric_engineered_by_encounters/",
        "text": "[Atheism is certainly on the rise in the US](http://www.telegraph.co.uk/news/worldnews/northamerica/usa/10626076/Is-America-losing-faith-Atheism-on-the-rise-but-still-in-the-shadows.html), but like the title says, are we neglecting the forest for the trees?\n\nSome background:\nI live in a STEM bubble (Just over a year away from a pure math degree! Woohoo!) and I've been an atheist since I was too young to remember. However, there's something that's kind of been bothering me lately. \n\nWhile most of individuals I've encountered throughout my academic journey in the STEM world have been unambiguously secular, there have also been plenty of brilliant, unambiguously religious minds. Historically speaking, the vast majority of important thinkers and blinkers have been at least somewhat religious. \n\nObviously, I'm not arguing that religion had anything to do with their impact on the worldand many of them were, of course, threatened by the monolithic religious institutions of their time. Instead, I am drawing attention to the fact that one can be religious and still influence the secular world in a profoundly positive way.\n\nThis makes me wonder if the use of science as the go-to method of countering inane literalist arguments has at least contributed to the unhealthy opposition of science by the religious. To clarify, I'm talking less about Carl Sagan calming explaining the issues with the \"stopwatch in the sand\" argument, and more about Richard Dawkins telling people to \"go fuck themselves\" if they don't like science.*\n\nThe problem I see is this: by claiming science as solely \"our thing\" the way Dawkin's does, *we are communicating to the mildly spiritual/passively religious that the most important thing they should know about science is that it is a direct threat to their values*. Now we have a new age movement, an anti-vaccine movement, and news organizations which, upon inviting a scientific perspective of an issue, must also invite a perspective *defined by being distinctly religious*.\n\nI think that last point is the most telling: if the media consider science and religion a classic pair of enemies, then that is a reflection of what kind of narrative the public *expects* to see. \n\nMaybe we never draw attention to the fact that there have been loads of great thinkers who were also religious because we're afraid it will somehow be used against us, or maybe we've blocked that fact from our collective psyche because we also subscribe to the simplistic hero/villain dichotomy. In any case, I don't think it's a stretch to suggest that we do more to welcome the [casually-spiritual majority](http://www.pewforum.org/2014/07/16/how-americans-feel-about-religious-groups/), so they don't get snatched up by the preventable death-causing anti-vax and new age movements simply because their rhetoric is less threatening. \n\n*Compare Dawkins to Hitchens: Even though Hitchens could be kind of a dick, everything he ever said was to the benefit of the \"religion has been a terrible force throughout human history\" argument, and he didn't relegate himself to one field of evidence. He could switch between history, medicine, science, literature, rhetoric, etc. on the fly. He never needed to fall back on a Dawkin's-eque \"the REAL problem with people who don't like science is that they haven't fucked off yet\" type of ad hominem. I consider the distinction important. ",
        "created_utc": 1408229513,
        "upvote_ratio": ""
    },
    {
        "title": "I know the pastor featured in this article!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dr5pl/i_know_the_pastor_featured_in_this_article/",
        "text": "[Atheist, minister discuss viewpoints at downtown bar](http://www.gainesvilletimes.com/section/199/article/103384/)\n\nI know Will Dyer, the minister featured in this article!  He and I went to college together.\n\nSounds like he and the atheist in this article had a good conversation.\n\n",
        "created_utc": 1408227515,
        "upvote_ratio": ""
    },
    {
        "title": "Is the American occupation a bigger act of terrorism than the actions of Islamic terrorists?",
        "author": "GrubbsTavern",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dqszu/is_the_american_occupation_a_bigger_act_of/",
        "text": "This question comes from a video I just saw that popped up on my newsfeed.\n\n[Who's The Real Terrorist](https://www.youtube.com/watch?v=Tv4iBGjJbaw)\n\nI'll admit that there are a few good points that Riyaaz makes. The U.S. was partially responsible for the creation of the Taliban (Mujaheddin), the U.S. never found weapons of mass destruction, and the death of innocent civilians were very much real. I'm not sure if Riyaaz was being completely honest with his statistics. Can anyone find these numbers he's spitting out?\n\nHowever, I don't really see him, or the teacher, answer any of the students' questions. Every time a legitimate concern is brought up, the question is deflected and answered with a version of \"Well your people are worse because of so-and-so\". This whole video is basically a giant finger pointing session to determine who's the one responsible for everything.\n\nI also find it a little humorous that Riyaaz is very adamant about \"meddling in other people's countries\" but the U.S. initially stepped in to protect Kuwait and Saudi Arabia from Saddam Hussein \"meddling\" in these countries.\n\nWhat are your guys' thoughts on this video?\n",
        "created_utc": 1408218886,
        "upvote_ratio": ""
    },
    {
        "title": "Is the American occupation a bigger act of terrorism than the actions Islamic extremists?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dqm2q/is_the_american_occupation_a_bigger_act_of/",
        "text": "This question comes from a video I just saw that popped up on my newsfeed.\n\n[Who's The Real Terrorist](https://www.youtube.com/watch?v=Tv4iBGjJbaw)\n\nI'll admit that there are a few good points that Riyaaz makes. The U.S. was partially responsible for the creation of the Taliban (Mujaheddin), the U.S. never found weapons of mass destruction, and the death of innocent civilians were very much real. I'm not sure if Riyaaz was being completely honest with his statistics. Can anyone find these numbers he's spitting out?\n\nHowever, I don't really see him, or the teacher, answer any of the students' questions. Every time a legitimate concern is brought up, the question is deflected and answered with a version of \"Well your people are worse because of so-and-so\". This whole video is basically a giant finger pointing session to determine who's the one responsible for everything.\n\nI also find it a little humorous that Riyaaz is very adamant about \"meddling in other people's countries\" but the U.S. initially stepped in to protect Kuwait and Saudi Arabia from Saddam Hussein \"meddling\" in these countries.\n\nWhat are your guys' thoughts on this video?\n\n",
        "created_utc": 1408213898,
        "upvote_ratio": ""
    },
    {
        "title": "Why people who are religious are better and more special",
        "author": "MozartLink",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dq4hr/why_people_who_are_religious_are_better_and_more/",
        "text": "",
        "created_utc": 1408201786,
        "upvote_ratio": ""
    },
    {
        "title": "What's the worst argument for atheism you've heard?",
        "author": "19283123",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dpx37/whats_the_worst_argument_for_atheism_youve_heard/",
        "text": "Not all arguments for atheism are good, so do you remember any of the bad ones?",
        "created_utc": 1408195331,
        "upvote_ratio": ""
    },
    {
        "title": "[Cross-post:] AMA from an ex-scholar of Buddhist philosophy over in the Religion dept.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2dp2eb/crosspost_ama_from_an_exscholar_of_buddhist/",
        "text": "Some participants over here in Philosophy might be interested:\n\n**[Link to the AMA:]** http://www.reddit.com/r/religion/comments/2dotir/casual_ama_exscholar_of_buddhism_cambodia_laos/\n\n**[Quoting the description posted to the other group:]**\nI lived and worked in Cambodia, Laos, Thailand, various parts of China, and worked on various languages, with [the scriptural language Pali](http://2.bp.blogspot.com/-qDo6LFnks0Q/T7nLxNWgOgI/AAAAAAAAALI/TgM9sWIrJ4s/s1600/Khmer-Pali+Chrestomathy.jpg) being the most important for Buddhist scholarship.\n\nI guess if you want a quick \"co-sign\" here's a link to a lecture I was invited to deliver at Oxford, U.K., still online (so, uh if I'm qualified to deliver that lecture, I'm qualified for a casual A.M.A.?): http://www.ocbs.org/lectures-a-articles-ocbsmain-121/73-language-hierarchy-buddhism-and-worldly-authority-\n\nIf you want to know what I look like when I'm talking about Buddhism, I'm also on youtube.\n\nIf, instead, you'd like to see a list of boring articles, here's what that looks like (scroll down, they aren't all in Chinese): https://medium.com/@eiselmazard/latest\n\nBuddhism is a religion with a long history, plenty of ongoing political conflicts, and a tremendous geographical scope. There's a lot to talk about, and perhaps some interesting questions will come in, given the diverse participants in a general religion forum [or a general **atheism** forum!].\n\n**[Link to the AMA:]** http://www.reddit.com/r/religion/comments/2dotir/casual_ama_exscholar_of_buddhism_cambodia_laos/",
        "created_utc": 1408160988,
        "upvote_ratio": ""
    },
    {
        "title": "Even if you're atheist, why not raise your children as Christian because of Pascal's Wager?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2doy2e/even_if_youre_atheist_why_not_raise_your_children/",
        "text": "There is no doubt Pascal's Wager is flawed. One of the main points that make it flawed is that God (if he exists) will know that you are only worshipping Him for the reward. So this makes the Wager pointless for an atheist to follow and become a Christian. However, a child would not be aware that God doesn't exist, so, if raised Christian, they would faithfully follow and receive the true benefit of the Wager. If they become atheist like you, oh well, you tried. Almost nothing lost, but they could've gained so much. There are other arguments against Pascal's Wager, but regarding this one alone, why not raise your children as Christian in case you are wrong? \n\n\nEDIT- I am aware of the Judeo-Christian bias. But Jews and Muslims both believe that Christians go to heaven. And Hindus and Buddhists basically believe religion doesn't matter as long as you respect all living things and are a good person. So, of all major religions, it's logical to apply Pascal's Wager to Christianity. I am also aware that this is Argumentum ad populum, but it isn't rational or practical to believe one would be able to search every religion on the face of the Earth to apply the Wager too, and even if someone did find a religion claiming you had to believe in their god to get to heaven, what would make it any better than Christianity logically?  ",
        "created_utc": 1408157674,
        "upvote_ratio": ""
    }
]