[
    {
        "title": "Early Riser Looking for the Perfect Morning Gaming Experience - Suggestions Wanted !",
        "author": "rayurayurayurayu",
        "url": "https://www.reddit.com/r/truegaming/comments/10yio89/early_riser_looking_for_the_perfect_morning/",
        "text": "Good morning Reddit! I hope everyone is having a great day.   \n\n\nI'm an early riser and I like to make the most of my mornings before the  rest of the world wakes up. One of my favorite ways to relax and unwind  is by playing video games. I usually go for competitive or story-driven  games, but now I'm looking for something more laid back and  stress-free.  While I'm  sipping my coffee in the morning, I'd love to dive into a new and  enjoyable game. I want to feel like I'm making progress and moving forward  in the game, but without having to be too focused or intense.   \n\n\nDoes anyone have any recommendations for games that fit this  description? I'm playing on PC and open to all genres, as long as it's a  good fit for a morning gaming session.   \n\n\nThank you in advance for your  suggestions!",
        "created_utc": 1676012026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it bother anyone else when games don’t acknowledge or disregard weapons?",
        "author": "Tr101748",
        "url": "https://www.reddit.com/r/truegaming/comments/10ygoc4/does_it_bother_anyone_else_when_games_dont/",
        "text": "It triggers my OCD and breaks the immersion for me. A game that I recently saw this in was last of us. Now to be fair most cutscenes include your weapon you have equipped but some will either change your equipped weapon or they’ll just completely vanish.",
        "created_utc": 1676004993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations for a hacking-focused “found phone” iOS game?",
        "author": "Pony13",
        "url": "https://www.reddit.com/r/truegaming/comments/10ydogx/recommendations_for_a_hackingfocused_found_phone/",
        "text": "I’ve recently gotten into the “found phone” genre of iOS games (you comb through a virtual phone to solve some kind of mystery), and I’m looking for something new. I liked the story &amp; supernatural element of Simulacra and Sarah Is Missing, but the puzzles could’ve used more of a “hacking” flavor (like Hack RUN &amp; its sequels).",
        "created_utc": 1675995745,
        "upvote_ratio": 1.0
    },
    {
        "title": "About Nintendo's marketing strategy for the Metroid series",
        "author": "aanzeijar",
        "url": "https://www.reddit.com/r/truegaming/comments/10y9m88/about_nintendos_marketing_strategy_for_the/",
        "text": "...or the lack thereof. In case you missed it, Nintendo simply dropped a remaster of Metroid Prime for the Switch yesterday. As far as I could find, they simply put it into their Nintendo Direct, and it was in the online store a few hours later. No previous announcement, no hype, nothing. There were rumours about remasters being ready to release months ago, but nothing further than that.\n\nThey already did the same with Metroid Dread, which was simply announced a week before release. \"Here, new game for you, have fun.\" Or rather, they did it even more this time, since judging from the hastily cobbled together articles on various game sites they didn't exactly tell reviewers about it either.\n\nThis is a stark contrast to Ubisoft and EA who make sure you know about their games years in advance. It feels deliberate, like Nintendo not daring or caring to hype up something they know will be spread by word of mouth anyway.\n\nAs a vocal critic of building hype around games, this is exactly what I wanted - even if it feels confusing to wake up and some reddit post talks about a new Metroid game I didn't even know existed.",
        "created_utc": 1675984828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why has the Switch sold so well?",
        "author": "BenettonLefthand",
        "url": "https://www.reddit.com/r/truegaming/comments/10y4s11/why_has_the_switch_sold_so_well/",
        "text": "Nintendo released their financial report recently, which included the Switch selling 8.4 million units in Q4, upping the amount of Switches sold to 122.5 million. The Wii U and the 3DS sold a combined approx. 85 million so where did these extra 40 million people come from? Many people have the impression that people are attracted to Nintendo's consoles because they want to play their exclusives. This comes without mentioning that the Switch has been out for 6 years and has sold more than the PS4 in a shorter time period, this means that they would've sold 20m Switches on average per year (which is more than what the Wii U ever sold). I'm asking this because a console hasn't sold this well since the DS and PS2 (I own a Switch btw).",
        "created_utc": 1675973387,
        "upvote_ratio": 1.0
    },
    {
        "title": "What game has the worst horse mechanics?",
        "author": "asjonesy99",
        "url": "https://www.reddit.com/r/truegaming/comments/10y41ni/what_game_has_the_worst_horse_mechanics/",
        "text": "I’m playing the Shadow of the Colossus remake and I’m finding the horse incredibly annoying. \n\nOff the top of my head I can count RDR1/2 and the Assassin’s Creed series as having *decent* horse mechanics, but what games have the worst?",
        "created_utc": 1675971700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people say 3D collect-a-thons are outdated, but 2D platformers are retro?",
        "author": "pancake_boy",
        "url": "https://www.reddit.com/r/truegaming/comments/10y1oen/why_do_people_say_3d_collectathons_are_outdated/",
        "text": "This is a follow up to my Yooka-Laylee post. Because in all honesty, I've been obsessed with this topic for years. A lot of you told me that Yooka-Laylee isn't actually what people wanted. That it brought back some bad aspects of the genre. To that I say this: Why do people say this genre is outdated? All I want is to relive my childhood, I don't care about \"objective\" quality. Is that fine? I feel like I can't enjoy this or that because people are criticizing it. And they're not gonna make more of these games I like because it failed. Can y'all just answer this question and make me happy: Why do people call this genre outdated but not the 2D platformer genre? Everybody loves 2D because of how represented in the media it is! The whole \"80's aesthetic\"! In contrast, the late 90's and early 00's don't really have an aesthetic, or at least not one related to videogames. Also, I know some people say 2D games are easier to make, which is one reason they're a dime-a-dozen. Also, I know some people have the sentiment that 3D graphics don't age as well as 2D. I get it. And I bet if I played Banjo-Kazooie today, it would feel clunky. I feel like I have rose-tinted glasses because the one game from the N64/PS1 days that I thoroughly played was Spyro, and that had surprisingly good controls for that time, don't you agree? So please tell me if my thoughts are valid, because I'm getting obsessed with this. Why don't people acknowledge this type of nostalgia?",
        "created_utc": 1675966380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Now that we've seen a lot of evolution in the JRPG Genre, in an objective and contextual vision, why Chrono Trigger was the Master Piece of it's era ?",
        "author": "Le_Draax",
        "url": "https://www.reddit.com/r/truegaming/comments/10xvgb0/now_that_weve_seen_a_lot_of_evolution_in_the_jrpg/",
        "text": "It's all in the Title.  \nIt came out the year of my birth so i discovered it MUCH later and loved it to the core.  \nBut i know that it's one of the best (if not THE) JRPG of it's own time.  \n\n\nWhy ? What norms did it move ? What extra dit it add ? What was the essence of CT in 1995 that no one foreseen ?",
        "created_utc": 1675951249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Celeste is overrated",
        "author": "Hironai99",
        "url": "https://www.reddit.com/r/truegaming/comments/10xtry8/celeste_is_overrated/",
        "text": "Okay, listen up. This game is good, but it's overpraised in gaming community. People love to say that this game is understimated hidden gem, despite it's already popular thanks to speedrunning community. I just don't understand why it got 10/10 by IGN? It's just a Super Meat Boy clone. It didn't provided something new.\n\nOkay, let's talk about the plot. The plot of this game is predictable. So, we have a mentally ill girl who went to adventure so she could improve her spirit. She meets an old trickster mentor and potential hipster boyfriend who will support her? Oh, and her evil twin that it's actually her Carl Yung's Shadow. Moral of the story? Accept what you are and JUST! DO IT!\n\nMan, the game's aesthetics is just bad. It feels like it was created by soy-boy hipster with pseudo-retro graphics. Color palette and too big size of pixels are hurting my eyes. In contrast I played The Messenger. It's a videogame which is based on Ninja Gaiden titles. It has much better pixel art. \n\nAt least this videogame has good gameplay.",
        "created_utc": 1675946406,
        "upvote_ratio": 1.0
    },
    {
        "title": "6 years later, why did folks hate Yooka-Laylee when it was exactly what fans of the genre asked for?",
        "author": "pancake_boy",
        "url": "https://www.reddit.com/r/truegaming/comments/10xr0w7/6_years_later_why_did_folks_hate_yookalaylee_when/",
        "text": "I'm a fan of those old 3D collect-a-thona from the late 90's and early aughts. I actually never played Banjo, but I loved Playstation games like Spyro, Ratchet and Jak. I actually heard of YL a couple years before it's release. And I was excited. I thought this would be the beginning of a Renaissance for 3D platformers and collect-a-thons. But unfortunately, as we all know, drama ensued. If you don't know about it, just look it up. I don't wanna get into it. But I just feel like the drama detailed everything. It brought new eyes into this game that weren't even the target fan base. But to me, I felt like it was a breath of fresh air, it was so cute and reminded me of my childhood mascot friends. I know y'all are gonna say A Hat In Time did it better, but I think YL did a better job at calling back to that era where all the characters were animals and the level designs were themed on like forests, or a volcano, etc. And that's the part I enjoyed, I just wanna relive my childhood. Eventually Spyro got a remake, and people liked that. But I wish they'd make a new original game in that old style that people actually like. I've learned that there's one called Super Lucky's Tale that was pretty well received, but it's not that mainstream. Also, I know these aren't animals but a couple of similar style games called Sackboy's Adventure and Astro's Playroom eventually came out! And of course, the new Ratchet game is fire. So you see? This is what I want from games now. Honestly, to me, it's not even about objectively quality, I just wanna relive my childhood. Maybe it's time to realize that games are so much more nowadays. Also, why do people get annoyed when a 3D platformer is tryna be \"retro\", but don't bat an eye over 2D retro callbacks to the 80's or early 90's? Not naming any names. Please somebody help me because this has been bothering me for almost 6 years and I just want someone to acknowledge my thoughts and how I'm feeling.",
        "created_utc": 1675936778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why was Last of Us Part 1 remake disliked more than Dead Space remake?",
        "author": "ManyHallways",
        "url": "https://www.reddit.com/r/truegaming/comments/10xdnle/why_was_last_of_us_part_1_remake_disliked_more/",
        "text": "This seems to be the case on Reddit and some reviews on YouTube.\n\nThe Last of Us Part 1 for PS3/PS4 had worse ai and less accessibility settings than its remake.",
        "created_utc": 1675896946,
        "upvote_ratio": 1.0
    },
    {
        "title": "My absolute favorite element of Deep Space remake design is the fact ammunition and upgrades actually feel valuable",
        "author": "jspsfx",
        "url": "https://www.reddit.com/r/truegaming/comments/10x8sqo/my_absolute_favorite_element_of_deep_space_remake/",
        "text": "Forgive me if this has been covered. I havent read any reviews yet.\n  \nIn simple economic terms, the game seems to have about as much supply as I have demand. In most games these days items, ammunition etc seems to be overabundant in supply. \n   \nIn Dead Space I find myself running out of ammunition for my favorite weapon even when trying to ration it out. And I love that. I never completely run out of ammo for all weapons but I get low enough that I am made to switch around. I avoided the Ripper for a while but I got to the point where I needed to use it and I ended up loving it!",
        "created_utc": 1675885788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why has maplestory's legacy been largely forgotten?",
        "author": "iedaiw",
        "url": "https://www.reddit.com/r/truegaming/comments/10x7mae/why_has_maplestorys_legacy_been_largely_forgotten/",
        "text": "I want to preface this by saying i have not played many mmorpgs, like eso, swtor, lotro.\n\n  \nMaplestory was one of the most popular MMORPGS of all time. It had a very strong casual appeal that allowed it to capture an audience that almost every MMO since has failed to do so (FFXIV being the exception imo). While one could argue that its gameplay was relatively simple, it was relatively unique in the field of tab battle made popular by WOW.\n\nSo why has the community at large (Mainly mmo, but gaming altogether), never talk about maplestory and its impact/legacy. In the lists of top MMOs of all time, it is pretty uncommon to find any mention of maplestory. The only lists that mention it are usually those of player counts/revenue. Even in online discussions, one rarely hears about maplestory. \n\nIn the golden age of MMOs, Maple would rank 2-4 (god damn wow) in terms of popularity. It was also very successful in terms of revenue generated. Its legacy can also be felt today via its popularisation of lootboxes aka \"gachapon\" aka \"gacha\".  The whole reason an entire gaming genre  \"Gacha\" can be  basically attributed to maplestory speaks to its impact on gaming. It also helped to popularize MTX in the west. While many mmos in the east started and popularized aggressive MTX, the success of maplestory in the west, meant many games since then copied such P2W models. It also introduced and broke the ice on a korean game making it in the western market. Leading the way for many other games from korea to spread throughout the world. \n\nBut of course noone remembers Maple for their aggresive MTX. While i cant speak for others. Maple to me was about the community, about its cutesy charm, 2d artstyle, its anime-esque settings, its interesting worlds, party quests, trading in free market, spamming emotes, ability to change ur characters looks through it wide variety of cash shop offerings. \n\nWhile I largely stopped playing like many others after Bigbang update slowly killed the game. I still believe for that 4 years it changed gaming forever.\n\nDo you think it belongs on such lists as \"top 100 games that changed gaming\" or \"top 10 MMOs of all time\"? Or am i just blinded by nostalgia?",
        "created_utc": 1675882957,
        "upvote_ratio": 1.0
    },
    {
        "title": "My solution to anger on (mostly multiplayer) videogames: writing down a credo",
        "author": "SparerThought",
        "url": "https://www.reddit.com/r/truegaming/comments/10x77vm/my_solution_to_anger_on_mostly_multiplayer/",
        "text": "I´ve just come up with this idea, let´s see if it works for me.\n\nFirst of all: like most people, I don´t get too angry over little things in the rest of aspects of my life, just at videogames.\n\nI don´t yell to others, I don´t insult tohers, i don´t throw or break controllers... etc. It´s just that the more old I get, the less capacity of managing anger at multiplayer videogames I have. And suddenly    I´m in front of the TV, trying spend some time on my favourite hobby and instead of having fun, I am internally slapping and punching all the people in the lobby. It really ruins the for me. It doesn´t happen always, but it happens more than I wish.\n\nAnd right now I was just thinking about it (because today I got mad because I had several games in a row with teams don´t playing the f\\*\\*\\*ing objective) and I though maybe, if I have a little note in my pocket to read when I´m starting to feel that way, I could make the anger disappear.\n\n&amp;#x200B;\n\nSo I´ll do it, I´ll write things like: \"Remember to play for fun - Play for fun, not in retaliation to any one - doesn´t matter if they bother, you are here to be cool... etc\" to read it when the time comes. My goal is to play only for having fun, trying to win but in a healthy mindset. You think is a good idea?",
        "created_utc": 1675881987,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being a completionist is a waste of time",
        "author": "Agent_Buckshot",
        "url": "https://www.reddit.com/r/truegaming/comments/10x63d0/being_a_completionist_is_a_waste_of_time/",
        "text": "Back when I was young, I'd always try to 100% every single game I played on the hardest difficulty before moving onto the next game. My mentality was that I was getting my money's worth out of the games I bought, and that whatever issues I'd have were all skill related. Eventually this killed my enthusiasm for gaming though, and drove me to take a 3-4 year hiatus altogether from gaming.\n\nNow that I've been playing video games on &amp; off again for the past year &amp; some change, I find myself having a lot more fun than I used to now that I enjoy gaming as a hobby rather than a chore. I've especially noticed this revisiting games that I played as a kid like Wind Waker, where the last third of the game ends up being a cheap fetch quest due to rushed development. Many games that claim to have \"x hours\" of content I find are padded out with shallow content like: fetch quests, \"brick wall\" hard modes, and loot boxes just to name a few trends. As long as I'm having fun with a game that's all that really matters, and when the fun stops it's time to move onto the next.",
        "created_utc": 1675879224,
        "upvote_ratio": 1.0
    },
    {
        "title": "With 70$ games becoming the norm, what’s the highest amount of money you’d pay for a game and why?",
        "author": "King_Sam-_-",
        "url": "https://www.reddit.com/r/truegaming/comments/10x5vfy/with_70_games_becoming_the_norm_whats_the_highest/",
        "text": "To be honest, I just had a discussion with someone who said that if games were priced at 150$ **everyone** would still buy them. Needless to say I thoroughly disagree and for many reasons. I somewhat assume that everyone is in the same page but i’m not completely sure so, what’s the highest amount you’d pay for games if prices started to increase? At what price point would the new price “norm” retaliate you from buying games continuously. How many do you buy a year now and how many would you buy at such an increased price point?",
        "created_utc": 1675878704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Playing another game before finishing the first one",
        "author": "JLPM98191",
        "url": "https://www.reddit.com/r/truegaming/comments/10wyvf3/playing_another_game_before_finishing_the_first/",
        "text": "Yeah i know its a dumb question but just finish this month exams at my university and im on break trying to figure out how to spare my time and enjoy playing games. So i already started a while ago witcher 3 next gen in my ps5 and it is not that im bored but hogwarts legacy im getting it on saturday. Was wondering if i ahould finish up witcher  first or spread my time into both. Any thoughts on the matter wanted a second opinion i known its a db question thanks in advance for replies.",
        "created_utc": 1675868454,
        "upvote_ratio": 1.0
    },
    {
        "title": "HUGE BATTLE - Hogwarts Legacy",
        "author": "LittleBrookie29",
        "url": "https://www.reddit.com/r/truegaming/comments/10wfk4g/huge_battle_hogwarts_legacy/",
        "text": "[removed]",
        "created_utc": 1675809703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for participants for my gaming survey!",
        "author": "GoToSleep19",
        "url": "https://www.reddit.com/r/truegaming/comments/10wfbuy/looking_for_participants_for_my_gaming_survey/",
        "text": "Hi everyone! I'm looking for potential contributors to a very simple empirical study that I'm doing for my BSc Psychology dissertation. It's a total of 44 questions but it shouldn't take any longer than 10-15 minutes. Please only take part if you're at least 18 years of age.\n\nLink provided in the comments\n\nThanks!",
        "created_utc": 1675809152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made a bookmarking website for games",
        "author": "Honor_SP",
        "url": "https://www.reddit.com/r/truegaming/comments/10w9sx4/made_a_bookmarking_website_for_games/",
        "text": "I've recently finished making a website to keep track of games, the idea is that you have a list that you can share with people with a link (your game list) and you can add games to it and give them a status (e.g. Finished) and a rating. This is a final year university project, it would be helpful if you could check it out and share with your friends. And if you can go a bit further, it would be helpful if after testing the site you could fill out the form that can be accessed by clicking the Form button (It's very short). The link: [gamelist.site](https://gamelist.site)",
        "created_utc": 1675796055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has a video game ever predicted the future?",
        "author": "GamesClub9",
        "url": "https://www.reddit.com/r/truegaming/comments/10w9lbd/has_a_video_game_ever_predicted_the_future/",
        "text": " There is a futuristic dystopian cyberpunk video game, Deus Ex.\n\nThe video game says that the twin towers were destroyed in a terrorist attack.\n\nPredicting a terrorist attack destroying the towers 1 year before the attack, was a damn spooky coincidence.\n\nHave you seen such games?",
        "created_utc": 1675795545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Multi-player Online Combat Games",
        "author": "GodzeallA",
        "url": "https://www.reddit.com/r/truegaming/comments/10w9bto/multiplayer_online_combat_games/",
        "text": "I searched on xbox store for Trending Games looking for some online pvp games and found it was pretty much just Call of Duty. I'm wondering why isn't there are any trending pvp games currently? \n\nI'm playing Paladins and Splitgate at the moment for my online pvp cravings but it doesn't feel like enough so I searched for more and didn't find much. I'm not going to play overwatch. Really there is just halo master chief collection as an alternative, but it's actually really similar to splitgate. \n\nWouldn't you think there'd be more popular games designed around online pvp? You know like 2v2s or 1v1s or 3v3s or 4v4s or 5v5s etc. There was this one game I was excited to play called Gigantic but they canceled themselves. There's so many single player games out there and I'm having fun with them but sometimes I just wanna fight others in pvp. \n\nHalo, League of Legends, Battlerite were my main pvp games in the past.",
        "created_utc": 1675794922,
        "upvote_ratio": 1.0
    },
    {
        "title": "StrangerZ Free to Play Multiplayer Horror Game - New Generation of Horror",
        "author": "Will_Codes",
        "url": "https://www.reddit.com/r/truegaming/comments/10w7u9x/strangerz_free_to_play_multiplayer_horror_game/",
        "text": "I am so happy to show my new FTP project coming to steam later this year, with a goal of revolutionizing the horror genre and creating a mix of horror, multiplayer, progression, and competitive aspects.\n\nGame short description:\nStrangerZ is a Free to Play Multiplayer Survival Horror game. Play as or survive against the \"Stranger\" with your teammates until dawn. Level up your stats and rank by either surviving or killing all players.\n\nWishlist now (learn more): [https://store.steampowered.com/app/2293600/StrangerZ/](https://store.steampowered.com/app/2293600/StrangerZ/)\n\nStrangerZ Official Teaser Trailer\n[https://youtu.be/6h6gArLyz7c](https://youtu.be/6h6gArLyz7c)\n\nAbout me:\nI am a student developer in my senior year of highschool! This is my third steam game and hopefully the best yet, I’m excited to release a free game to build an amazing community and have people enjoy my work!\nIt’s is not at all necessary but if you want to help support development and get some perks check out my patreon, it really helps me out! [https://patreon.com/LostFrameDevelopment](https://patreon.com/LostFrameDevelopment)",
        "created_utc": 1675791447,
        "upvote_ratio": 1.0
    },
    {
        "title": "College students designing storage space geared towards gamers",
        "author": "ibecap2023",
        "url": "https://www.reddit.com/r/truegaming/comments/10w7kpw/college_students_designing_storage_space_geared/",
        "text": "Hello! I am working on a senior engineering capstone project at a large American university. My team and I are designing a storage space that address gamers' needs for our client, a luxury commercial and consumer furniture company. To better understand the needs and priorities of gamers such as yourselves, we'd really appreciate if you could fill out this two-minute survey on the gaming accessories you own and your opinion on our initial design. Thanks you!\n\n[https://forms.office.com/r/YJXvjUff91](https://forms.office.com/r/YJXvjUff91)",
        "created_utc": 1675790842,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Meta] On the nature and purpose of this sub",
        "author": "TooDriven",
        "url": "https://www.reddit.com/r/truegaming/comments/10w66b0/meta_on_the_nature_and_purpose_of_this_sub/",
        "text": "This sub aims to achieve a higher level of posting than in some other subs, which is a great goal. \n\nHowever, I feel that this goal is interpreted very narrowly. This is surprising to me because the sub aims to promote discussion (as stated in the rules), yet some topics are closed and banned precisely because they are too popular or common. \n\nI also don't understand why the rules are interpreted so strictly. Other subs, like patientgamers, show that discussion subs without spam, memes, pictures are possible even without countless retired topics. \n\nTherefore, my question is: Why are the restrictions on posting enforced so heavily here? There is after all not a single other sub that actually focuses on quality debate on gaming (aside from patientgamers, but it has the \"games older than a year\" restriction).",
        "created_utc": 1675787549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is modding culture so prevalent in gaming?",
        "author": "TyleNightwisp",
        "url": "https://www.reddit.com/r/truegaming/comments/10w621w/why_is_modding_culture_so_prevalent_in_gaming/",
        "text": "You don't really see attempts at editing movies to remove or add desirable content, at least not as often as you see with games. Same with music, and many other forms of media. So why is it so common within the gaming community?\n\n\nOne would argue this violates that piece of media, especially if we're thinking of games as art. You don't see people asking for Monalisa to be edited, since that would sound sacrilegious. But when it comes to games it's even embraced by some companies, such as Bethesda.\n\n\nMy thoughts also go beyond of why it happens, and more into *should* it happen. Should this method of \"hands on\" approach with games where clients edit a product to fit their needs be encouraged? It feels somewhat unique to gaming as a medium.",
        "created_utc": 1675787269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Games, consoles, etc with achievements that can't be cheated?",
        "author": "BigChillingClown",
        "url": "https://www.reddit.com/r/truegaming/comments/10w5oyb/games_consoles_etc_with_achievements_that_cant_be/",
        "text": "I've been playing World of Warcraft and love farming achievements in that game (almost 100% after 14,000 hours!) and looking for a new goal when I'm done.   \n\n\nWas going to try Steam achievements, but it seems they're easily cheated which makes it kind of lame to me.   \n\n\nIs there any launchers or games with large achievement systems that I can put the next few years grinding?",
        "created_utc": 1675786387,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Meta] Why does this sub heavily restrict people posting well-intentioned threads that the OP put significant effort into?",
        "author": "TooDriven",
        "url": "https://www.reddit.com/r/truegaming/comments/10w4tfg/meta_why_does_this_sub_heavily_restrict_people/",
        "text": "This is not a hate post, just a genuine question. \n\nI fully understand the aim to achieve a higher level of posting than in some other subs. However, I feel that in the strive for higher quality, many well-intentioned threads are closed or removed, even if the OP put significant effort into them. And even if there is a lot of discussion generated. \n\nThis is particularly surprising when reading the sub description: the goal is to promote discussion, but seemingly over half the topics that achieve that get locked. In fact, some topics are \"retired\" precisely because they are popular! \n\nThe description, to me at least, indicates this sub aims to promote discussion rather than spam, memes, pictures, cartoons or screenshots. This would already be a worthy goal! I for one am not interested in news aggregator or meme-based gaming reddits. \n\nBut in practice, it seems this sub is aimed more at game devs (or those who want to become ones). That is also fairly disappointing because there is in fact a lack of high quality discussion reddits for gaming. Ones in which you can also discuss \"popular\" topics without them becoming retired. \n\nThe common counter argument is of course that this would lead to a drop in quality. Yet eg patientgamers shows that you CAN have a discussion based subreddit with mostly high level posting even without extremely strict rules. \"Why don't you just post there, then?\" - patientgamers sadly has a  restriction on posting about newer games which limits discussion. \n\nGoing to directly game related subreddits is no alternative, for one because they are often heavily picture and meme-based. And secondly because any sort of critical or analytical approach is often not welcome there.\n\nTl;dr: There is basically not a single subreddit that focuses on high quality posting by well-intentioned redditors who put in some effort. Why does truegaming not want to be that? Currently, we only have subreddits for news and memes (r/gaming), for advanced game mechanics talk mostly relevant for game devs (truegaming) and for in-depth discussions, but limited to games older than a year (patientgamers). If you want to discuss, analyze and compare newer games, you are out of luck.",
        "created_utc": 1675784250,
        "upvote_ratio": 1.0
    },
    {
        "title": "PvE Survival Game (Nightengale) and it’s unconventional approach.",
        "author": "Nightmode444444",
        "url": "https://www.reddit.com/r/truegaming/comments/10w4qzl/pve_survival_game_nightengale_and_its/",
        "text": "I recently picked up Valheim and have been completely blown away by the game. I think all of the hype is warranted and I won’t rehash it here. Last night I did some research to see if any other developers are working to replicate that games success with a more swipes budget. The answer is yes. The developers are a moderately sized 100 person team with many ex BioWare employees. \n\nThe game is Nightengale. Here is the trailer. https://youtu.be/wVzai6zZM6A\n\nThis is in no way a normative judgement, but the trailer has a very feminine energy to it. Almost all of the characters are women. The clothes are all Victorian. There is Bloodbornesque “eldrich” cosmic space horror monsters. Even the male characters (few and far between) are extremely thin and stylized. \n \nThey seem to be trying to differentiate themselves from Valheim. Valheim is a conventional male fantasy. Hunting deer, chopping down trees, building forts, exploring the seas. Vikings. I think a lot of the Valheim success is due to it tapping into this primal urge hardwired into our brains. I imagine nearly all young boys build some sort of fort as a kid.\n\nIt strikes me as a very risky bet to eschew all of this and go for a Victorian lady flying with her umbrella like Mary Poppins over to the forest to go chop down trees. \n\nIs this the type of adventure players are looking for. It seems like a very risky bet to me. There also seems to be some shady stuff here. The game is going to be released in EA. I don’t know why a team of 100 people with funding from Tencent need to release in EA. Seems like they should be going a more conventional route. \n\nI often wonder if it’s even possible for large developers to make\nGames like this. Or does the institutional structure make it impossible.",
        "created_utc": 1675784073,
        "upvote_ratio": 1.0
    },
    {
        "title": "100% Live Stream",
        "author": "weeb_hero01",
        "url": "https://www.reddit.com/r/truegaming/comments/10w3ker/100_live_stream/",
        "text": "Hey, i'm going live on twitch 7pm BST, I finished Breath of the wilds main story and looking for help during my live to roughly 100% the game, Come and join me live [https://www.twitch.tv/dedzedofficial](https://www.twitch.tv/dedzedofficial)",
        "created_utc": 1675781132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Freya die in Forspoken?",
        "author": "EffectLongjumping988",
        "url": "https://www.reddit.com/r/truegaming/comments/10w37z2/can_freya_die_in_forspoken/",
        "text": "[removed]",
        "created_utc": 1675780222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Important Information for Everyone",
        "author": "jimgreen123",
        "url": "https://www.reddit.com/r/truegaming/comments/10w29mz/important_information_for_everyone/",
        "text": "[removed]",
        "created_utc": 1675777728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ok I'm very confused, what's up with the Need for Speed and Forza community and it's hatred for mods or cheats?",
        "author": "Ballistica",
        "url": "https://www.reddit.com/r/truegaming/comments/10vy31i/ok_im_very_confused_whats_up_with_the_need_for/",
        "text": "Ever since I was a child I modded games I owned, my first one being the Desert Combat mod for Battlefield 1942. Since then mods have always caught my interest, especially from ones coming from fans with lots of passion who genuinely want to make the game better.\n\nI've modded games such as XCOM, Halo 1 PC, Company of Heroes, Total War, Crusader Kings 2 and many many more, though weirdly not Skyrim as it felt too daunting.\n\nSo now that my 3 year old is into games, particularly car games, I decided I wanted to craft a game experience just for him. He loves 2 things, open world and driving a cop car. But finding those two things is quite tough. Need for Speed Hot Pursuit is his current favorite but he wants to drive off road. We have Heat but as far as I know it doesn't have cop cars and runs into the same problem I am about to describe.\n\nNow racing games are (or used to be?) The pinnacle of mods, I have a folder there somewhere of hundreds of Race 07, rFactor and Assetto Corsa mods, cars and tracks. It's a community that loves to tweak and edit to get the cars looking just right. Dammit I remember so many tire mods subtley adjusting physics debating about who nailed the most realistic interpretation.\n\nMost importantly I want the ability to mod the game to add cop cars or at the very least unlock the ones already there, maybe just an unlimited money/experience mod because I have no intention of actually playing the game.\n\nA friend of mine suggested Forza Horizon 5 as a good game with both open world and cop cars. I looked up the game, it honestly looks perfect, I think I played Forza 2 on Xbox 360 a long time ago and briefly tried one of the Horizons for like 30 minutes. On paper it looks exactly what he is after.\n\nBut I have asked around for mods, or a good trainer or anything to get what I want out the game I am willing and happy to purchase at full price.\n\nAnd been met with vitriol.\n\nWhy?\n\nComments like this:\n\n\"GTFOH...your 3yr old...you're so  full of it...go find your modded account somewhere else\"\n\nI genuinely don't understand, worse is that the mods have made it clear I'm not even allowed to ask this for clarification on the subreddit or even ask why I'm not allowed to talk about mods.\n\nIf I go now to the Assetto Corsa subreddit, a game I am familiar with and have put many hours into, I will be met with a long list of people's favourite mods, cars and tracks, Guides, everything.\n\nIt was the same on the Need for Speed subreddit (but they were nicer about it).\n\nWhy am I not allowed to mod Forza? And why is it a forbidden topic like it's Voldemort. Is it because it has an online mode? So do almost every game I've modded, that's fine I'll just play offline, I have no intention of putting my 3 year old online anyway.",
        "created_utc": 1675763698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not being able to avoid combat in Hogwarts Legacy would be a huge disappointment for me",
        "author": "Hot_Writing_7882",
        "url": "https://www.reddit.com/r/truegaming/comments/10vj3cd/not_being_able_to_avoid_combat_in_hogwarts_legacy/",
        "text": "The more I see of Hogwarts Legacy, especially now with the reviews out, the more I dread buying it although I am a huge Harry Potter fan and would love to play a great game in the universe.\n\nI fondly remember the old Harry Potter series from EA that focused mainly on puzzles and, believe it or not, had Quidditch in them and it was great. It still boggles my mind how they didn't find a way to put Quidditch in this game while the flying mechanic looks great but that's a different story altogether.\n\nThis universe is tailor made for a great RPG with lots of dialogue, interesting quests, puzzles and fun Hogwarts stuff without violence. And while that might still be a big part of it it bugs me that combat seems to be an essential part of the experience. I'm not talking about duels, those are fine, but rather about Hogwarts students beating up hordes of enemies with magic and throwing barrels on their heads or even worse. If any RPG should give us the option to not use violence but rather a peaceful approach it's this one but it looks like that's either not possible or extremely difficult. I'm not opposed to violent games in general btw, and I would be open to roleplay a violent Slytherin student or something, but not having other options would be a huge disappointment. I simply can't imagine a violent Hufflepuff student. \n\nI already voiced this opinion on a few occasions but it seemed like I'm part of a tiny minority that would like to play a pacifist. What do you guys think? Maybe I'm mistaken and the game does offer you these options. If you have any insights on it, please enlighten me.",
        "created_utc": 1675719713,
        "upvote_ratio": 1.0
    },
    {
        "title": "2023 could be a monumental year in gaming",
        "author": "WeeWooPeePoo69420",
        "url": "https://www.reddit.com/r/truegaming/comments/10viuse/2023_could_be_a_monumental_year_in_gaming/",
        "text": "First of all I'll say I'm only talking about single-player focused games. \n\nIt's kind of astounding how many games are being released this year that could potentially be landmark titles. Games that in ten years will be getting remasters and remakes. I'm pretty sure almost every medium to large well-respected developer is releasing a major title this year. Here's a list of games (roughly ordered by release date) that to me could be huge if they get good reception, and I'm including large DLCs. \n\nHogwarts Legacy (already getting great reviews and is what made me make this post)\n\nWanted: Dead\n\nWild Hearts\n\nAtomic Heart\n\nLike a Dragon: Ishin\n\nHorizon: Call of the Mountain (could be the next Alyx for VR)\n\nHorizon: Forbidden West Burning Shores\n\nOctopath Traveler II (could see improvements from its predecessor that skyrocket it)\n\nDestiny 2: Lightfall (this game is kinda single-player? I don't play it)\n\nWo Long: Fallen Dynasty (maybe will be the greatest non-Fromsoft soulslike?)\n\nResident Evil 4 Remake\n\nResident Evil Village VR\n\nStar Wars Jedi Survivor \n\nSuicide Squad: Kill the Justice League\n\nMeet Your Maker (who knows if this'll be good but the concept could be revolutionary)\n\nDead Island 2 (again, this could be great if it improves on its predecessor)\n\nStreet Fighter 6\n\nDiablo 4\n\nFinal Fantasy XVI\n\nAlan Wake II\n\nArmored Core VI: Fires of Rubicon\n\nCyberpunk 2077: Phantom Liberty\n\nDeath Stranding 2\n\nLies of P (despite all the juggernauts this could be my goty)\n\nLike a Dragon 8\n\nThe Lords of the Fallen\n\nMarvel's Spider-Man 2\n\nMarvel's Wolverine\n\nRemnant 2\n\nPrince of Persia: The Sands of Time Remake\n\nRise of the Ronin\n\nSilent Hill 2 Remake\n\nStar Wars: Knights of the Old Republic Remake\n\nSystem Shock Remastered\n\nTekken 8\n\nAmnesia: The Bunker\n\n\nAny others?",
        "created_utc": 1675719139,
        "upvote_ratio": 1.0
    },
    {
        "title": "A comparative analysis between Tunic and Hyper Light Drifter",
        "author": "Magma57",
        "url": "https://www.reddit.com/r/truegaming/comments/10vfisu/a_comparative_analysis_between_tunic_and_hyper/",
        "text": "Tunic and Hyper Light Drifter(HLD) seem very different on the surface with very different aesthetics, but dig a little deeper, and they're very similar games. They both have similar gameplay, atmospheres, and narrative techniques. I haven't seen any comparisons between the 2 games, so I thought I would write something on it. Also this will basically spoil both games.\n\n**Gameplay:** Both games have isometric hack and slash combat where the player must learn the enemies' attack patterns to find openings to attack. Both games place an emphasis on being nimble and dodging attacks rather than blocking them, although Tunic has a shield, so does this less. Both games have secrets strewn about their levels for attentive players to find, although HLD is more linear and combat focused while Tunic is more non-linear and exploration focused.\n\n**Atmosphere:** Both games are what I'm going to call \"lofi post-apocalypse\" where society has long since collapsed and we're existing in it's ruins, which are now beginning to host new life. They both have moments of incredible calm where the player is just walking through and soaking up the environment, which is contrasted with a burst of energy with the fast paced combat. There is a loneliness in both games, but not a depressing loneliness, it is a freeing loneliness where there are no others to constrain you anymore.\n\n**Narrative Technique:** Both games have little to no dialogue or writing. In HLD there is no text outside of the tutorial and all dialogue is done through pictures. In Tunic most text is in the game's unique script meaning that most people won't be able to understand it. Although some words are in English, there are no NPCs in Tunic until the last section of the game. As a result, both games use visual and environmental storytelling to convey their narratives. The player often has to piece the story together by studying the level design and enemy placement. One particular moment they have in common is in the structure of their major reveals. In HLD, in the southern area, the player walks in on an underground factory where the titans were constructed. Similarly in Tunic, in the Rooted Ziggurat, the player sees an underground factory which shows how the monoliths are constructed.\n\nTo conclude, Tunic and Hyper Light Drifter are 2 games that I very much enjoyed and I enjoyed them for many of the same reasons. I haven't seen many people compare the games, so I thought that it would be interesting to compare them. Tell me what you think of my analysis.",
        "created_utc": 1675711536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone Remember This Game?",
        "author": "PaintedBlack777",
        "url": "https://www.reddit.com/r/truegaming/comments/10vdo69/anyone_remember_this_game/",
        "text": "There was this educational pc game from the early 2000s on school computers where the characters had musical horns as mouths, big eyes and bowling pin shaped bodies with stripes. Can anyone please identify what this game is?",
        "created_utc": 1675707299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Battlepasses and FOMO Tactics, truly do hurt the overall longevity and reception of games.",
        "author": "LogiBear2003",
        "url": "https://www.reddit.com/r/truegaming/comments/10vcwza/battlepasses_and_fomo_tactics_truly_do_hurt_the/",
        "text": "As the title suggests, I think live service games or any games that implement said features are objectively hurting their games in the long run. \n\nNow I don't necessarily think battlepasses are terrible, I just think 90% of games nowadays either don't need them or they just don't handle said pass/content correctly. \n\nHalo Infinite, Apex, Overwatch 2 and CoD for example, these games have FOMO in which all content from each BP/season is completely gone. Imagine going back to MW19 after a few years and realizing there's genuinely not much to do or grind for other than simply playing matches. I'm sure there are countless other games, but I mentioned these few just as an example.They either completely get rid of the content after that relevant season is done, make it extremely grindy to even finish, or have poor cosmetics and unlocks that most players deem valueless. Each pass has their own issue in each game, or several issues depending on how special the developers are. \n\nCall me a weirdass, but I think personally Rocket League, Halo MCC, Minecraft Dunegons and Deep Rock did their BPs right. These are the games my friends and I have previously played and had positive overall experiences with it.  2/4 games I mentioned allow access to these passes at any time with no time limit, the unlocks are actually worth unlocking and putting the time in to unlock the content isn't a 2nd job. Speaking of that, these games make it much easier to pick up and play, while not having the \"2nd job\" feeling looming over your shoulder.(I think Knockout City is another game that has acceptable live service practices, I just didn't include it with these ones because the unlocks *are* time limited. \n\nWhen playing Multiversus or any of the recent CoD since MW19, I felt as though I was only playing to *grind out said pass* and not even for the actual enjoyment of the game mechanics and gameplay loop. Not only did it become a chore, the time actually needed to complete said passes was excruciating. Not to mention each game having multiple season and hundreds of tiers to grind for - which sure that sounds great, but again FOMO and other bs. \n\nNow you may not give a single shit about battle passes, live service games, or any of the practices that come with them, but I wanted to bring this topic up to show how much a battle pass can effect how the game is either received or the longevity of the game after its peak. I don't think the issue is necessarily giving players content through a progressive pass by playing a game. It's how they are implemented and how sooooo many games include them now. My brother, I'm sorry, but I cannot sit down and grind out all 100 or more tiers for your game, when there are 10-15 other games asking me for their time with the same practices. I know I've mentioned like 6 games I've played that have battlepasses, but my friends and I have come nowhere near close to finishing them all.  (Lets not even mention the backlogs we all have💀) I was going to say this begs the questions as to why developers make the content time limited them, but we all know why.\n\nGames as a service are often all focused on the present revenue. This means that these developers prioritize getting players to grind their ass off like it's on a grinding wheel, rather than letting players keep the content THEY paid for. So instead of getting a shit ton of games with seasons and season of new content to grind for, possibly making the game playable for years to come, is all thrown out the door thanks to short term profiting. \n\nIt's kinda bleak when you look at it that way. Imagine picking up a game like Overwatch 2 or a CoD you liked and all the content that used to be there is now completely dead and empty. Now obviously the passes are not the only reason to play said game, but I mean seriously go to MW19 if you have it and look how empty and soulless it is. It used to be full of life when each season was rolling out but now it's aching for life. \n\nI don't think companies will magically change this, but I truly wish after a games life cycle, they'd either put back all content and allow it to be unlocked, or yk not take it out in the first place. \n\nNow most of this stuff is in Live Service MP games, so I don't think anyone will be passing their pants in 10 years when they log onto Rocket League and they can't grind out a Battlepass from 2020 or something lmfao, but I think it's worth mentioning. \n\nAt the end of the day, these passes require resources, assets, and time that was to make all of that content; and to see it disappear after a certain time limit is not only negative for a developer, it's definitely not consumer friendly either. \n\nI just wish we had more co op or single player games. I'm tired of the *now* games. Boohoo I didn't play  when it was at its \"peak\", guess I can't unlock the guns, camos, skins, etc etc that developers worked hard on🤡\n\n\n\nI brought this up because clearly BPs and time limited unlocks/abandonware are here to stay and they clearly do have some sort of positive feedback with to their relevancy in modern gaming; but while they are arguably better than gambling loot boxes or unfair P2W bs, everything has its own unique issues and can always be improved upon.",
        "created_utc": 1675705617,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've never played Assassins creed games. Where do I start?",
        "author": "Nils92Persson",
        "url": "https://www.reddit.com/r/truegaming/comments/10v38i0/ive_never_played_assassins_creed_games_where_do_i/",
        "text": "[removed]",
        "created_utc": 1675678803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are there almost no team based battle royale games? Such as 50v50 assuming 100 players.",
        "author": "CaspianSeaDragon",
        "url": "https://www.reddit.com/r/truegaming/comments/10uv8bh/why_are_there_almost_no_team_based_battle_royale/",
        "text": "I know Fortnite has the 50v50 mode, but it seems to be a limited time thing rather than fundamentally part of the game.\n\nIt's almost always solo, duo, or squads. I understand that in a team based game, a win isn't as big of a deal since it's a 50:50 chance. However, I've noticed that team based play introduces some unique upsides to gameplay, especially for more casual gamers.\n\nIn games where everyone spreads out around the map (like in solo battle royale, or in a game where respawn locations are more random and not at two distinct ends of the map) there's no directional element to the game. You have to be looking around in all the directions the whole time since an enemy can come from anywhere. In a team game however, you know roughly which direction the enemy is coming from, so you can spend more time running and make better use of cover. Overall making the game more predictable.\n\nTake for example, a Call of Duty map vs a Battlefield close quarters map with a linear design (like lockers). In CoD, enemies originally come from one end, but after that they can respawn from almost anywhere. So both teams end up all over the place. In Battlefield, because you can only spawn at your base, on a friendly objective, or on a squad mate/spawn beacon, you know that the enemy will be mostly approaching from one direction the whole time. It's unlikely that they'll spawn behind you or on your flank.\n\nIt would also be good for map design too. Instead of having cover randomly dotted around, cover could be oriented in a way to deflect fire from a certain direction. And a dividing line between the two teams down the centre of the map could allow for some interesting map designs.",
        "created_utc": 1675650801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canonically in your mind, where do weapons go when they just “appear” and “disappear” in games like GTA 5?",
        "author": "Tr101748",
        "url": "https://www.reddit.com/r/truegaming/comments/10uubec/canonically_in_your_mind_where_do_weapons_go_when/",
        "text": "\nIt’s something I’ve never really put much thought into until now but what do you guys think? As someone who pays very close attention to details in game I’m just surprised it took this long for that question to cross my mind.",
        "created_utc": 1675648251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Playing Cultic made me realise why I love Blood so much.",
        "author": "Kaidanovsky",
        "url": "https://www.reddit.com/r/truegaming/comments/10uquxr/playing_cultic_made_me_realise_why_i_love_blood/",
        "text": "Cultic is great, but it's not BLOOD. I'm sorry but I have to make the comparison because playing Cultic and facing my own expectations made me realise one aspect that made Blood so unique.\n\nThis isn't as much criticism towards Cultic per se, but just some thoughts I had , when I wanted to vocalise what it is that made Blood my favourite FPS ever - and what it makes it different to modern games. \n\nPlease don't misinterpret this comment as me dissing Cultic, as I said, I think it's great but I have a really special place in my gaming history for Blood and hence I just wanted to write this. \n\nWhat Blood gets right is that it's not afraid of being more goofy, more old school game where unrealistic physics aren't a problem.\n\nWell, it is OLD. But what I mean is that Blood has insanely fun dynamite -lobbing and rag doll mechanics. I feel that this is something many reviewer's and critics seem to miss about Blood.\n\nPoint being, Blood was the most fun Build engine game thanks to the fact that it didn't try to hide it that it's a video game and concentrated on the fun game play loop. Modern games seem to miss this. \n\nI don't understand why game maker's don't try to replicate more of the completely outrageous physics of Blood. It's unrealistic to make a zombie or cultist to fly across the screen with gore chunks with crazy speed, but that is FUN. I like Cultic but it's not fast, floaty and outrageous like that.\n\nI admit that Cultic has the unenviable position to be compared to Blood, mostly due to the references it wears on it's sleeve itself. Blood was fun, probably the most fun I've had with an old school FPS. It's more tongue in cheek but not only that - the physics are much more floaty and comical. But that makes the dynamite lobbing and destruction also more entertaining.\n\n This is one thing that Resident Evil 4 also understood - it's a game that it isn't afraid of being a \"video game\". Many modern games seem to fall into this trap that they try to bit too much go for some level of higher so-called \"realism\" but sometimes the old school games captured something special just because they seemed to have more justification of being a GAME. Goofy, unrealistic and fun.",
        "created_utc": 1675639326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Playing Cultic made me realise why I love Blood so much.",
        "author": "Kaidanovsky",
        "url": "/r/BuildEngine/comments/10uqqr1/playing_cultic_made_me_realise_why_i_love_blood/",
        "text": "",
        "created_utc": 1675639097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canonically in your mind, where do weapons go when they just “appear” and “disappear” in games like GTA 5?",
        "author": "1123-23",
        "url": "https://www.reddit.com/r/truegaming/comments/10upctb/canonically_in_your_mind_where_do_weapons_go_when/",
        "text": "[removed]",
        "created_utc": 1675635608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canonically in your mind, where do weapons go when they just “appear” and “disappear” in games like GTA 5",
        "author": "1123-23",
        "url": "https://www.reddit.com/r/truegaming/comments/10up5xm/canonically_in_your_mind_where_do_weapons_go_when/",
        "text": "[removed]",
        "created_utc": 1675635148,
        "upvote_ratio": 1.0
    },
    {
        "title": "In a world with Gamepass and PSplus Subscriptions, full priced releases seem antiquated.",
        "author": "expatato",
        "url": "https://www.reddit.com/r/truegaming/comments/10um7k4/in_a_world_with_gamepass_and_psplus_subscriptions/",
        "text": "Before picking up a Series X I was a PlayStation 4 gamer predominantly.\n\nAlthough I was part of the 3 free games a month model that PS+ used to be, I still found myself picking up games on release that stood out to me (some highlights being the Bioshock Trilogy and Ghosts of Tsushima). \n\nHowever, for some reason after experiencing gamepass and rocking through tons of the games on offer without buying a single standalone seperately; I now I find any hype for a game diminishing once I realise its not coming to one of the subscription models. This obviously means I miss out on most of the key gaming culture releases of the year. Elden Ring, Far Cry 6, Death Stranding Directors Cut, and the upcoming Atomic Heart are the ones that jump to mind. \n\nWhat I tend to do instead, is put time into games available on gamepass and get as much as I can out of them, always with the niggle in my brain that I may be enjoying one of the big triple A games more. \n\nI assume this is a common feeling and I have been wondering how the majority of you bring yourselves to drop the price equivalent of 6months of a gamepass on a single game, and if the enjoyment you have got from these games outweigh the financial sting?",
        "created_utc": 1675628103,
        "upvote_ratio": 1.0
    },
    {
        "title": "where's the fine line between a cozy/relaxing game and a boring game?",
        "author": "tressonkaru",
        "url": "https://www.reddit.com/r/truegaming/comments/10uiwol/wheres_the_fine_line_between_a_cozyrelaxing_game/",
        "text": "I've been playing the hottest game,  power wash simulator and i stared wondering that though I know this game is boring,  and let's not kid ourselves,  most simulator games are. But, yet, I'm actually enjoying this one as something to do when I'm not wanting to playing anything adventurous or stressful. But, why? I've played others like spirit farer. Which was enjoyable, but my adhd started kicking in and wanted to progress the story. I ended up watching someone else play it and enjoyed it. But power wash feels different somehow. Though I know it's boring, I'm willing to put in the effort to complete the tasks.  Why?",
        "created_utc": 1675620249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aim trainer idea.",
        "author": "CaspianSeaDragon",
        "url": "https://www.reddit.com/r/truegaming/comments/10ugsvp/aim_trainer_idea/",
        "text": "So I played BF2042 for a bit, and then went back to BF4 (lol) however I noticed a change in my aiming ability afterwards.\n\nIn BF2042, I used the SFAR with a 4x scope in single fire mode alot. It was basically a DMR that did less damage and wasn't as accurate. However, I eventually got semi decent at using it. When I returned to BF4, I used the SKS alot. Fast during DMR, low recoil, accurate, and kills much faster. Getting decent with the SFAR made me play much better with the SKS. And in some cases I would kill people faster then I expected without even thinking much. I still don't do brilliantly well, but I'm definitely much better than I was.\n\nAnd so I thought of an idea. What if you had an FPS game where the shooting mechanics are painfully difficult to handle. The sway is high, the recoil is really difficult to control, the TTK is long etc. If you got somewhat alright in that game, would that massively improve your performance in other games where you didn't have those difficulties? Somehow making a game like that fun too would make people keep playing and practice more. Effectively making long term practice fly by.\n\nIt's just a thought. I'm not sure how good of an idea it is.",
        "created_utc": 1675615166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some interesting drama related to the game \"Your only move is HUSTLE\" I'd like some opinions on",
        "author": "nightmare404x",
        "url": "https://www.reddit.com/r/truegaming/comments/10uesd9/some_interesting_drama_related_to_the_game_your/",
        "text": "The game came out recently on Steam and there's been some interesting discourse surrounding it. It's a 2D fighting game where both players control stick figures. The twist is that the entire game is turn based, so each player can input frame perfect movements, and it looks really cool, especially with the replay feature.\n\nThe reason I'm bringing the game up is the game is advertised as \"single player\" on the store page, but there's no traditional single player content as you could possibly expect from most fighting games. There's no AI coded into the game, nor is there a tutorial. What it calls \"single player\" is actually when you control both characters and make them fight to create cool replays, which upset some people. Some have criticized this as \"having no single player content\", but other people have said otherwise.\n\nI have mixed feelings on this issue because this game is a unique case. The developer says \"*bottom line is that there is a singleplayer mode: it is a replay creation sandbox. i will not be upset if you refund the game*\".\n\nI was wondering what other people's take on this issue is. Do people who bought the game have a right to be upset? Do you feel this is false advertising? Or do you think that they should have done their research before buying? Is the single player tag warranted in this case, as I could see someone arguing that the single player is similar to movie maker?\n\nIt's not really a huge issue, especially with the game only being $5 and with Steam refunds being a thing, but I think it has room for some interesting discussion as I've never seen this sort of discourse before.",
        "created_utc": 1675610057,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elden Ring combines Difficulty Scaling and an Open Map better than any other game I know",
        "author": "TooDriven",
        "url": "https://www.reddit.com/r/truegaming/comments/10u8j9g/elden_ring_combines_difficulty_scaling_and_an/",
        "text": "One of the biggest challenges when making an open world game is difficulty scaling. There are basically three options:\n\n1. Make the game (mostly) linear. But then it's not open world, obviously.\n\n2. Make it so the enemies scale with you, as in Skyrim. This is the easiest way, but it can be unsatisfying because you feel like you are not improving, which is sad in an RPG.\n\n3. Include different zones that feature different levels of enemies. I feel this is the best option, but it is difficult to balance because if taken too far, the game is no longer linear. Also, it can often feel off-putting to face the exact same enemies only with 80 % mire health because they are on a higher level. \n\nElden Ring hoes for option 3, but by utilizing specific mechanics to mostly avoid its pitfalls:\n\n- physical barriers and restrictions that create clear divides between zones, eg mountains, climbs, tunnels, lifts. This creates a separation between areas that makes it more believable that one area features stronger enemies. Rather than just walking 500 feet into one direction and everything looks the same. The world is still open, but you have to put in effort to get to another zone. \n- combined with this, there are clever \"level checks\": Bosses, special items required or hidden requirements. They mean that to get to the next area you either need to show you are strong enough to beat a boss or have explored enough to find an item, naturally ensuring you are strong enough for the challenge ahead \n- Enemy design. I know the lategame has some repeated enemies, but especially in early and midgame, tougher enemies often look stronger as well (see Caelid), so them being stronger feels natural.",
        "created_utc": 1675588883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last Words of God Of War (All God War)",
        "author": "hongomastergamers",
        "url": "https://www.reddit.com/r/truegaming/comments/10tyatk/last_words_of_god_of_war_all_god_war/",
        "text": "[**Last Words of All God Of War**](https://www.youtube.com/watch?v=m2bAU85S6IM)\n\n▷▷Last Words of God of War Ascension: Castor, Pollux Aletheia, Megaera, Tisiphone, Alecto, Orkos.  \n\n▷▷Last Words of God of War Chains of Olympus: Persian King, Charon, Persephone.\n\n▷▷Last Words of God of War (2005): Warning Soldier, Sailor, Captain, Ares.\n\n▷▷Last Words of God of War Ghost of Sparta: Callisto, Erinys, Dissenter, King Midas of Macedonia, Deimos, Thanatos.\n\n▷▷Last Words of God of War Betrayal: Ceryx.\n\n▷▷Last Words of God of War II: Prometheus, Theseus, Alrik, Euryale, Perseus, Icarus, Last Spartan, Lahkesis, Clotho, Athena  \n\n▷▷Last Words of God of War III:  Poseidon, Helios, Hades, Hermes, Hercules, Poseidon's Princess, Cronos, Hephaestus, Hera, Daedalus, Pandora, Gaia, Zeus, Lysandra, Calliope, Kratos.\n\n▷▷Last Words of God of War (2018): Modi, Baldur \n\n▷▷Last Words of God of War Ragnarök: Heimdall, Brok, Thor, Odin",
        "created_utc": 1675563354,
        "upvote_ratio": 1.0
    },
    {
        "title": "need guidance for making an rpg",
        "author": "rs11charlie",
        "url": "https://www.reddit.com/r/truegaming/comments/10tvu0p/need_guidance_for_making_an_rpg/",
        "text": "[removed]",
        "created_utc": 1675556423,
        "upvote_ratio": 1.0
    },
    {
        "title": "need guidance for making an rpg",
        "author": "rs11charlie",
        "url": "https://www.reddit.com/r/truegaming/comments/10tvt5k/need_guidance_for_making_an_rpg/",
        "text": "[removed]",
        "created_utc": 1675556357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Officially done with Valorant, and Riot Games in general.",
        "author": "Indolent_Alchemist",
        "url": "https://www.reddit.com/r/truegaming/comments/10tmuh3/officially_done_with_valorant_and_riot_games_in/",
        "text": "Thought I'd take this here before I said my goodbyes to the game. Its been a tremendous time, since the beta, made some absolutely fantastic friends, met some really great, and really strange people, but I have gained memories I'll forever cherish. However, the state of the game right now, as it is with most of their servers, makes it absolutely impossible for me, or anyone from South Africa, to play this game well. Their lack of attention towards the African continent, and our players, has led many of my peers to completely abandon their games, and unfortunately, much to the dissapointment of my younger self, I seem to be joining their ranks on this.\nOnce I said, \"No, never. I'll play the game, and do my best. Who cares that I've got 180 ping? I still manage.\" Unfortunately, I must disagree with myself now. Over the last couple of updates, the ping, connection to the server, and overall network has gotten worse and worse, and I'm not the only one of us who thinks so.\n\nSo, until the day Riot games decides to realise they have players down here worth noticing, I'll be taking my leave, and I recommend anyone else in the same position, to do the same.",
        "created_utc": 1675533850,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fifa 19",
        "author": "No-Camp4352",
        "url": "https://www.reddit.com/r/truegaming/comments/10tlm2o/fifa_19/",
        "text": "[removed]",
        "created_utc": 1675530925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Wakfu is Totally Different",
        "author": "marlevvll",
        "url": "https://www.reddit.com/r/truegaming/comments/10tkwdh/why_wakfu_is_totally_different/",
        "text": "Hey TrueGaming Community,\n\nfor the unfamiliar, Wakfu is a MMORPG from which the anime is based (and is the successor to Dofus, Ankama's other MMO, and its animated movie).\n\nSomething that has bugged me about modern MMO quest design is highlighting every player as *the* hero, *the* chosen one. This only works in single player titles, because it only could be you.\n\nInterestingly enough, Wakfu still follows the \"you're the chosen one of prophecy\" motif, yet handles the logic entirely differently. I thought this nuance would be of interest to those in this community.\n\nAs early as the opening cinematic, you see a group of adventurers who are slain by crying Ogrest, the so-called main antagonist. Immediately after the death of the adventurers, *your* toon appears. You've been *reincarnated* \\-- one of *them* was **your past life**.\n\nYou eventually find out that *all* adventurers in Wakfu are trying to restore balance by defeating this crying troll to put an end to the apocalyptic flooding, since it's his tears that flooded the world and split the landmass into 12 islands (the main playable areas from launch).\n\nThe problem is that the world was created *by the gods*. And, each class is a partial manifestation *of a god* (which is why the class names are not *archer* but *Cra*'s Range), so *your* agency is existentially tied to the whims of *your* patron deity. \n\nThus, since the world is constantly under Ogrest's threat, *of course* each adventurer has been chosen by the gods to defeat him, because he destroyed what they, the gods themselves, created! But it goes even deeper.\n\nJust like yin &amp; yang are not 'good and evil,' so the forces in the game's universe, Wakfu &amp; Stasis, aren't either. Each character is struggling to find their way between them; for example, Ogrest is crying as a result of being betrayed. Additionally, the first so-called villain you encounter is in fact not evil; he's been oversaturated with *stasis*, and the plot is not to defeat him yet to reintroduce him to balance. \n\nAdditionally, you later realize that the very first NPC to help you in the tutorial is ultimately responsible for the destruction caused by Ogrest's tears.\n\nLife's complicated, and Wakfu captures this complexity beautifully. Thus, the juxtaposition between the inevitability of confronting Ogrest with the ever present reminder that you are no ethical superior is a source of tension.\n\nI struggle to think of a modern MMO that captures this balance as saliently. What do you think? Have you played Wakfu yet disagree? To players of Dofus: does its plot play the same notes?\n\nThank you for the discussion! 💖",
        "created_utc": 1675529236,
        "upvote_ratio": 1.0
    },
    {
        "title": "most games haven't really progressed graphically and well gameplay imersion wise.",
        "author": "Fluffy_Flatworm_9567",
        "url": "https://www.reddit.com/r/truegaming/comments/10tdbr2/most_games_havent_really_progressed_graphically/",
        "text": "[removed]",
        "created_utc": 1675506719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it illegal to torrent/pirate a game thats not available to buy anymore",
        "author": "Large-Ad688",
        "url": "https://www.reddit.com/r/truegaming/comments/10td60a/is_it_illegal_to_torrentpirate_a_game_thats_not/",
        "text": "[removed]",
        "created_utc": 1675506297,
        "upvote_ratio": 1.0
    },
    {
        "title": "PlateUP: Meal Duplication Glitch/bug",
        "author": "fieryluigi",
        "url": "https://www.reddit.com/r/truegaming/comments/10t34p4/plateup_meal_duplication_glitchbug/",
        "text": "[removed]",
        "created_utc": 1675479253,
        "upvote_ratio": 1.0
    },
    {
        "title": "bored gamer looking for recommendations",
        "author": "suhaib_sh7",
        "url": "https://www.reddit.com/r/truegaming/comments/10szgzu/bored_gamer_looking_for_recommendations/",
        "text": "[removed]",
        "created_utc": 1675468788,
        "upvote_ratio": 1.0
    },
    {
        "title": "/r/truegaming casual talk",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/truegaming/comments/10swm8t/rtruegaming_casual_talk/",
        "text": "Hey, all!\n\nIn this thread, the rules are more relaxed. The idea is that this megathread will provide a space for otherwise rule-breaking content, as well as allowing for a slightly more conversational tone rather than every post and comment needing to be an essay.\n\nTop-level comments on this post should aim to follow the rules for submitting threads. However, the following rules are relaxed:\n\n* 3. Specificity, Clarity, and Detail\n* 4. No Advice\n* 5. No List Posts\n* 8. No topics that belong in other subreddits\n* 9. No \\[Retired Topics\\]([https://www.reddit.com/r/truegaming/wiki/retired/](https://www.reddit.com/r/truegaming/wiki/retired/))\n* 11. Reviews must follow \\[these guidelines\\]([https://www.reddit.com/r/truegaming/wiki/rules/#wiki\\_reviews](https://www.reddit.com/r/truegaming/wiki/rules/#wiki_reviews))\n\nSo feel free to talk about what you've been playing lately or ask for suggestions. Feel free to discuss gaming fatigue, FOMO, backlogs, etc, from the retired topics list. Feel free to take your half-baked idea for a post to the subreddit and discuss it here (you can still post it as its own thread later on if you want). Just keep things civil!\n\nAlso, as a reminder, we have a Discord server where you can have much more casual, free-form conversations! [https://discord.gg/truegaming](https://discord.gg/truegaming)",
        "created_utc": 1675461612,
        "upvote_ratio": 1.0
    },
    {
        "title": "MMORPG Account Suspension Notice",
        "author": "nickrz",
        "url": "https://www.reddit.com/r/truegaming/comments/10sqja8/mmorpg_account_suspension_notice/",
        "text": "\\*\\*\\*\\*\\* Team response on 01/19/2023 09:15 AM\n\nGreetings, This account is receiving a 72-hour suspension due to violating the Terms of Service and Code of Conduct for your UserID and Character name. We cannot allow names such as \\*\\*\\*\\*\\*, as it is in direct violation of the following sections of our Code of Conduct:\n\n2.1 You may not create an account name, persona or avatar that is in any way discriminatory, sexually graphic, hateful, harmful, or excretory in nature. A name, persona or avatar that promotes self-harm, glorifies suicides or belittles physical or mental disability will be considered as harmful. You will not reference, claim affiliation or otherwise express sympathy with any hate groups. Any other names, text or chat that \\*\\*\\*\\*\\* considers offensive is also in violation of the Agreement including the Code of Conduct.\n\n2.2 You may not create any name, text or chat that negatively references a 'Protected Category' under applicable law. These include any name, text or chat which references or includes age, race, disability, sexual orientation, national origin, pregnancy, religion or gender.\n\n2.3 You may not create an account name that is defamatory, impersonates, breaches the privacy or attempts to defame the reputation of another account holder, an employee of \\*\\*\\*\\*\\*, any natural or legal person or entity, property of \\*\\*\\*\\*\\*, or \\*\\*\\*\\*\\* and/or its affiliates.\n\n2.4 Derogatory, defamatory or offensive content used in conjunction with names of famous or important historical, political, religious figures or website URL's are not allowed. You will not create an account name that is in reference to or contains proprietary names, popular characters, or the names of modern era serial killers, individuals or groups who have committed crimes against humanity in the past. You will also refrain from participating in conspiracy theories, misinformation or fallacious comments. We expect all users to remain respectful and constructive at all times when using \\*\\*\\*\\*\\* Services.\n\n2.5 You will not attempt to, use misspellings, phonetic spellings, homonyms, word combinations, or alternative spellings to mask inappropriate material in any communication on \\*\\*\\*\\*\\* Services. This includes but is not limited to text, chat, voice, in-game messaging or any other medium of communication or interaction between users.\n\nYour UserID has been changed to: \\*\\*\\*\\*\\* If you wish to choose a new UserID, please respond with three appropriate suggestions for a new UserID. The next time you attempt to load the character(s), you will be prompted to change the character’s name.\n\nFurther violations of any part of our Terms of Service may result in a temporary suspension or even a permanent deactivation of this account. Please take a few moments to review the Terms of Service and Code of Conduct, which must be acknowledged to participate in \\*\\*\\*\\*\\* service. Terms of Service - Code of Conduct -\n\nIf you believe this decision was made in error, directions for appealing account suspensions can be found here.\n\nRegards, \\*\\*\\*\\*\\* Team\n\nCustomer response on 01/19/2023 06:25 PM\n\nGood evening. I just received this email informing me that my account has been suspended because my username violates the code of conduct. If this is the case then strong apologies, however, I believe this was done in error. My username \"\\*\\*\\*\\*\\*\" is a handle that represents my first name which is \\*\\*\\*\\*\\* or \\*\\*\\*\\*\\* and a nickname of mine \"\\*\\*\\*\\*\\*\" which is a play on the word \\*\\*\\*\\*\\*. That being said, if an individual or group of my peers in game could potentially be offended I am happy to change it BUT I am not happy to accept a 72 hour account suspension. I have put in too much time and money to allow this type of injustice. I will share this experience with the gaming community as well. Please correct this issue as soon as possible. Thank you.\n\n\\*\\*\\*\\*\\* Team response on 01/20/2023 09:26 AM\n\nHello again, After a thorough review of your account it has been determined that the account did in fact violate our Code of Conduct. We regret to inform you that your appeal for an account suspension reversal is denied due to the evidence within our system for the use of an inappropriate name. Due to the extent and scale of the violation, it has been decided that the suspension on this account will remain in place, and that all services related to this account shall remain deactivated until the 72 hour timeframe ends. This decision was not made lightly, and it is final. Regards, \\*\\*\\*\\*\\* Team\n\n\\*\\*\\*\\*\\* Team Customer response on 01/20/2023 10:37 AM\n\nUnacceptable. Any logical person would infer from the evidence that this was not a violation that was committed with malice. My username has remained the same since 2014 and only now am I being suspended. Why? What changed? I want to escalate this issue to the top supervisor or whoever claims to have made a final decision on this matter. I want actual customer service by someone who responds with their name. No more anonymous emails signed by the \\*\\*\\*\\*\\* team, please. I want to hear someone explain to me how this string of letters violates your code of conduct and exactly which line of the code of conduct describes the offense because it is not clear to me that my User ID and/or Character Name violates any of the previously quoted code. I expect a phone call: \\*\\*\\*\\*\\*. Thank you. -\\*\\*\\*\\*\\*\n\n\\*\\*\\*\\*\\* Team response on 02/03/2023 10:42 AM\n\nGreetings! Thank you for contacting \\*\\*\\*\\*\\* Team. After further review of your account and the logs present, I see that you are now successfully able to log into the game. That being said, if you still need any further assistance regarding this, please reply back to this e-mail and we will be happy to assist.\n\nKind Regards, \\*\\*\\*\\*\\* Team",
        "created_utc": 1675446786,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best option for cheap handheld gaming?",
        "author": "funkytownb0xcutter",
        "url": "https://www.reddit.com/r/truegaming/comments/10sq4sz/what_is_the_best_option_for_cheap_handheld_gaming/",
        "text": "[removed]",
        "created_utc": 1675445782,
        "upvote_ratio": 1.0
    },
    {
        "title": "MMORPG Account Suspension Notice",
        "author": "Simple-Swimming-7331",
        "url": "https://www.reddit.com/r/truegaming/comments/10sq47s/mmorpg_account_suspension_notice/",
        "text": "[removed]",
        "created_utc": 1675445742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Convenience can be a curse.",
        "author": "inFINN1te",
        "url": "https://www.reddit.com/r/truegaming/comments/10spuec/convenience_can_be_a_curse/",
        "text": "So over the last 2 years I have played an insane amount of Souls games. Started with DS3 and have made my way around playing endless hours of all 7 of them. These games are obviously known for very hands off approaches and encourage you to figure things out for yourself and experiment. I'm sure people are sick of people praising these games endlessly but the experience I have had with them really opened my eyes to the problem with convenience in games. \n\nGames now are made SO convenient for players. In depth maps that show everything and tons of difficulty settings, etc. We're just used to it and it can be welcome at times. But I also think it might be the biggest curse on gaming that leads to so many games just feeling like a chore more than an experience. \n\nI started playing Spyro Reignited Trilogy. I really needed a break from more serious games and wanted something chill and fun. And when booting it up I was greeted with a beautiful whimsical world to run and fly around in. After a bit I take my usual time to check all my settings and I see the option to turn on a minimap. Initially this sounds great, so I turn it on so I always know where I'm going. The fun was sucked right out. It made me immediately question, is this really how we want to experience games? So I turned it off. I'll tell you, nothing feels better than 100 percenting a level because you genuinely EXPLORED every inch on your own. Memorized the different locations and figured out exactly where you have and haven't checked. Letting yourself get stuck for a while and being more perceptive. \n\nConvenience is something we all want. But I think there's value in ripping it away from people. Had I never played Souls games, I'd never think to leave that map off, and I'd have a much worse experience because of it. And because most gamers aren't gonna be used to not having a map they'll leave it on. Probably unknowingly lessening the experience for themselves. It's great that it's an option, but having that option means people will likely not try it without it. There's truly value to giving *less* options because players are too intimidated by going with the less convenient option. That's all. I was just playing Spyro and this really hit me hard so wanted to share some thoughts and see what yall think!",
        "created_utc": 1675445071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are people more hostile to mods that change a games art/art style today or is it just them being louder?",
        "author": "pieking8001",
        "url": "https://www.reddit.com/r/truegaming/comments/10sne6d/are_people_more_hostile_to_mods_that_change_a/",
        "text": "Maybe its just because i enjoy trying the mods that change the artistic direction so i see more comments on it, but i dunno a lot of the fans responses just seem so much more hostile today than even just in 2012. \n\nLike the ray tracing mods for quake, halflife og doom, and of course quake 2 rtx. a metric fek ton of comments on threads about them are whining about how they ruin the artistic intent of the game. and how they are bad because it changes the art style. but i dunno that just seems for foreign to me. and yeah i know other modern mods that change art style(and especially mods that arent lore friendly in rpgs) get the same undeserved flac too but the RT mods are the buzzword mods atm so i see more comments about them atm.\n\neven as recently as skyrim the art style and lighting mods like tropical skyrim, ENB mods were praised for being something new and inventive. modders emulating doom 3's lighting style in quake and quake 2, like dark places quake engine and quake 2xp. those didnt get the backlash like the newer mods did. not everyone liked them(heck for quake 1 i still prefer the software renderer) but players werent so openly hostile to them and the makers ether. it was more a live and let live feeling. even the mods that made 3d polygonal versions of doom and duke 3d didnt get the kind of treatment mods that change art style etc do now.\n\nHave i just been blind all this time or are the newer generations of gamers more hostile to these mods?",
        "created_utc": 1675439079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone ever experienced an uneasy feeling when using \"no clip\" through a games console or accidentally going out of bounds?",
        "author": "giggle_shift",
        "url": "https://www.reddit.com/r/truegaming/comments/10s40f8/has_anyone_ever_experienced_an_uneasy_feeling/",
        "text": "This comes from a thought I had earlier when I was playing Chivalry 2 and accidentally ended up being able to walk way outside of the intended map area. Its always instilled a weird feeling with me. My earliest memory is using the no clip \"cheat\" on Duke Nukem 3D and being able to float around the entire map, sometimes in to infinite \"space\". Its a feeling of \"I shouldn't be here\", combined with a real life uneasy feeling!",
        "created_utc": 1675379377,
        "upvote_ratio": 1.0
    },
    {
        "title": "WZWEAR",
        "author": "WZWEAR",
        "url": "https://www.reddit.com/r/truegaming/comments/10s3p6p/wzwear/",
        "text": "[removed]",
        "created_utc": 1675378638,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you all want most in a hypothetical Unreal 3 (single player campaign) game?",
        "author": "Golfer345",
        "url": "https://www.reddit.com/r/truegaming/comments/10s21fp/what_would_you_all_want_most_in_a_hypothetical/",
        "text": "Do you all think an indie developer like that which made the Forest (Endnight Studios) or even Frictional Games would be the right people for the job? These developers are good with exploration and atmosphere and they would be making the game knowing that it would likely only have a modest sales potential, which they are accustomed to anyways being indie developers. I am a huge fan of these atmospheric first person survival horror games (involving extremely limited combat, if at all) and I think there is an enormous and largely unacknowledged themematic overlap between them and Unreal 1 and games like it. I'm pretty curious to know how many Unreal 1\nfans like games like the Forest, Outlast, Amnesia, and Soma.\n\nI don't think the graphics need to be of the photorealistic variety, but I certainly\nabsolutely do not want any bright cartoony graphics - this a definite no go for me. I'd say a graphical look similar to what Krullor (the guy who is singlehandedly working on his spare time to give Unreal 1 a graphical and gameplay facelift) is trying to do would fit perfectly. Basically modest indie graphics, but nothing AAA hyperrealistic or anything cartoony .\n\nIn terms of visual style I would also want to be able to look down at my own player character model. For example, such as having the ability to see my own chest, legs and feet if I am standing still or walking around. Likewise your own arm should be animated opening doors and vaulting over objects. All these little details will further immerse the player inside the character. \n\nPerhaps to emphasize the atmosphere and exploration elements, maybe for the first third of the game you should be largely defenseless with no weapons and instead you have to run and hide from Skaarj? Maybe to keep the game’s action going perhaps you should just mainly have to run away from the Skaarj and there won't be such a heavy handed emphasis on heavily scripted and predictable hiding mechanics like that which dominated Outlast.\n\nAnd then after you have survived the first third of the game maybe you'll get an Enforcer pistol and a Rambo knife\nor something like that. And then you'll slowly find all the other classic Unreal weapons. I don't think we need to bring back any of the weapons that were exclusive to Return to Na Pali , save for the rocket launcher. Maybe there could even be a survival mechanic in the game where a stomach health meter will be shown in the HUD and you have to eat certain things, maybe even dead Skaarj, to stay alive. The Forest had the stomach mechanic in it. \n\nThe dodge/lunge mechanic where you double tap one of the WASD keys which sends you hopping towards that direction should absolutely be brought back. This was highly original and is sorely missed in other action games I play.\n\nTo increase the immersion even further the story needs to be really loose and open like it was in the first installment so much so that one's own mind will start filling in the blanks like what happened in Unreal 1 for me. There should also be no in game cutscenes, dialogue based interactions with NPCs, or any times when your character speaks as all these elements ruin immersion and atmosphere. Instead, the story is told entirely through text though your Universal Translator just like in Unreal 1. Developers like Red Barrels and Frictional Games would be familiar on how to tell a story with just text.\n\nThe game should take place entirely on one planet with none of the planet/level hopping nonsense of Unreal 2 that was interspersed with spaceship cockpit interludes. I wouldn't mind having a \"crash landing\" plot device again. That whole thing never gets old for establishing a narrative. Maybe the narrative should pick up after the events of Return to Na Pali with Prisoner 849 crash landing on another planet again lol. Maybe the beginning game cutscene should be told using those old fashioned paitnings that games in the late 90's used to tell stories with. Remarkably  indie developers like Fricitonal Games used this type of thing in the beginning cutscene of Soma to great effect even though that game was released in 2015. \n\nThe game will have massive outdoor and indoor levels. Maybe the game could even be a non-linear open world. But one in which there’s somehow no backtracking. Somehow it could be an open world that you are always progressing through seeing different things. Think like the massive and detailed open world of GTA5. I can only begin to imagine how glorious it would be if the massive scale of Los Santos, where it could take a player sprinting across the landscape nearly 3 hours or more to traverse it completely, were applied to a Na Pali planet type environment for the player to endlessly interact with and explore. Perhaps the hypothetical developer of this dream game of mine could extensively study exoplanets and consult astronomers for advice on how the Unreal planet should look like. Maybe the hypothetical \"superhabitable planet” concept could be a good point of inspiration\n\nFor the longest time I've wanted to play a walking simulator type game where all you do is walk around exploring an exquisitely rendered exotic exoplanet surface. I think a hypothetical Unreal 3 would fit very nicely into this dream. \n\nAnd lastly with regards to the soundtrack, we need some more Alexander Brandon music!",
        "created_utc": 1675374734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I make a CoD stat tracker side project",
        "author": "V3CT0R28",
        "url": "https://www.reddit.com/r/truegaming/comments/10s1anq/should_i_make_a_cod_stat_tracker_side_project/",
        "text": "So I got this whole stat tracking infrastructure setup for a project at peakgaming.ca. It’s so players can be ranked in tournaments by their public matches\n\nI’m thinking I might just reuse that to build some sort of stat tracker website for CoD. Any ideas on design or things you wish other stat trackers had? Gonna open source it Ofc.",
        "created_utc": 1675372964,
        "upvote_ratio": 1.0
    },
    {
        "title": "100% Achievements are essentially a chore list.",
        "author": "NatlerSK",
        "url": "https://www.reddit.com/r/truegaming/comments/10rzmeh/100_achievements_are_essentially_a_chore_list/",
        "text": "So I am about to finish Enderal forgotten stories (amazing game btw you should check it out if you havent yet) and a thought came to my head:\n\n \\- I have seen a lot of 100% Achievements runs and reviews of games that i told my self \"i like this game a lot maybe i will go for 100% on it\".\n\nSo i went to achievement section on steam and i got instantly turned off.\n\nBecause there are achievements that for example require you to explore and find around 150+- symbols to collect over the entire map to give an example.\n\nAnd now this second thing came to me:\n\n\"Why put yourself through this?\" - I know you may like a lot to try to one go for 100% but why when the activity has nothing to do with the gameplay/story and so on but just to open a spreadsheet and start running for got how many hours to just finish this achievement for the sake of doing it.\n\nWhy not just start and new game or do something else instead of \"wasting\" your time to just have a unlockable on your steam profile?\n\nI get going for that one or two specific achievement that is Rare or Hard to get but why would you go for 100% and 30% percent of it is just monotone grind or some other bullshit? (dont get me started on online achievements in mostly single player games)\n\nI feel it also takes away the \"natural experience of discovering and exploration\" - Haha you did something silly and you got achieve for it.\n\nAlso for those guys who do 100% runs or mainly Reviews I dont understand - If you are trying to differ yourself from average game journalist why instead of just opening the achieve panel and saying i did this game on 100% not try to explore every part of the game naturally and blind (maybe even second playthrough/new game+) and then do a review about every aspect of the game that you have explored -what surprised you- what you didnt like and so on?\n\nI am not trying to hate I am just curious to what drives you to do the most mundane/monotone tasks to get an achievement even if you like the game very much.",
        "created_utc": 1675368954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exploring the Artistic Vision of David Brochard: A Behind-the-Scenes Look at a Concept Artist in the Gaming Industry",
        "author": "GavinSpecialMove",
        "url": "https://www.reddit.com/r/truegaming/comments/10ryygr/exploring_the_artistic_vision_of_david_brochard_a/",
        "text": "[removed]",
        "created_utc": 1675367360,
        "upvote_ratio": 1.0
    },
    {
        "title": "VR version of Among Us has sold over a million copies",
        "author": "GamesClub9",
        "url": "https://www.reddit.com/r/truegaming/comments/10rpgvu/vr_version_of_among_us_has_sold_over_a_million/",
        "text": "Innersloth has revealed that the VR version of Among Us has sold over a million copies. And it happened in less than ten weeks.\n\n&amp;#x200B;\n\n  The game has been played over four million times and averages 44,000 matches a day. Over 89 million minutes were devoted to missions, sabotage and betrayal.\n\n&amp;#x200B;\n\nAre you in this statistic? Have you played the VR version of Among Us?",
        "created_utc": 1675343430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fortnite Nostalgia",
        "author": "EliLovesNintendo",
        "url": "https://www.reddit.com/r/truegaming/comments/10rd09v/fortnite_nostalgia/",
        "text": "[removed]",
        "created_utc": 1675302047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imagining games in the future",
        "author": "Stock_Raspberry9531",
        "url": "https://www.reddit.com/r/truegaming/comments/10r8tw5/imagining_games_in_the_future/",
        "text": " \n\n**Intro**\n\nThere are a few factors that can contribute to the quality of a game. The list of them is as follows:\n\n1. Intellectual stimulation\n\nIf you have ever played starcraft Brood War you surely know this game is not a joke. There used to be a big Esports industry in Korea and people who participated in this competition practiced this game day and night. You can think of it as a different version of chess. If your race is terran, and your opponent is protoss, it is hard to play with just bionic units to win the game. This is an old game but the complex strategies that are required are quite insane.\n\n2. Story\n\nWhat game is the best in terms of the story? I can list a few games, Detroit become human, Witcher 3, Beyond Two Souls, and RDR 2. Their stories are complicated and dramatic (what's at stake?). Good stories usually have layers of episodes that affect each other in a very intricate way. I would dare to say that if you start to care about the characters and your emotions get affected by the progress of the story, it is safe to say that the game has a good story.\n\n3. Character building\n\nRDR2, Beyond Two Souls and FF15 is the top when it comes to character building. The characters in these games feel more real because of their display of authenticity meaning their interaction feels more real and alive.\n\n4. World Building\n\nWitcher 3 did a great job when it comes to world-building. I will take blood and wine as an example. Toussaint is beautiful and the world feels not shallow. It feels like there can be more in the world. It is an imaginary world but it still feels authentic somehow. Cyberpunk also feels similar. They really pulled it off in terms of creating an imaginary open world.\n\n5. Gameplay\n\nI think some people play pvp competitive games to just have fun and blow steams. These kinds of people just pursue short time brain stimulation and those pvp competitive games satisfy their hunger for the stimulation. League of Legends, Apex, and Overwatch are a few examples of those games.\n\n6. Music\n\nMusic plays an important part in adding deeper levels of immersion to the game. Blizzard games have good music as well as cdpr red.\n\n7. Visual\n\nGraphics are very important since it also adds immersion. PS5 games look way more realistic and even though many game companies don't necessarily improve their games when it comes to story or other factors, the recent games have been improving the quality of graphics over time.\n\n**Future of games**\n\nNow, think of a game that has most of these factors covered in the future on a way more advanced level. I do think RDR2 had raised a bar in the video game industry when it came out. The game has everything. Story, gameplay, music, visuals, world-building, and character development. If you compare this game to UFC fighter, he is Fedor Emelianenko in his prime. However, I do want to think that there will be objectively better games in the future (when I say objectively here, it means according to a majority of people). I would still like RDR2 more than most games because of nostalgia at that point but let's ignore the nostalgia.\n\nIf there are games that has substantially good AI, graphics, world-building, character development, music and visual, what would that look like? Here are a few things I thought about:\n\n1. The NPCs will behave in a very similar way that people in real life behave. Now there are of course limitations when it comes to how much control you have over the characters. but let's say just abstractly you have more control over the character in general. You would bump into a guy in a bar in a game and could apologize, ignore, or pick a fight with him. Or, if you go to a bar, you would be able to talk to a girl in a flirty way but the girl might just ignore you or flirt you back depending on the girl's personality put in by a programmer. Everything will interact with each other according to the massive information orchestrated by Artificial intelligence.\n2. Let's imagine what would be the better example of world-building that exists in any other current games. The world will interact with you. The character's clothes, their way of speaking, and their personalities will play a role in making the world more immersive. They shouldn't be separate. It will feel organic. Think of Toussaint and night city full of stories of each character and building.\n3. Character building. The characters will have more details. Just like movies or even more than that. Generally, books have better character buildings because they have more details. Everything the character says will matter. In terms of open world, you would have more freedom compared to movies. There should be more scenarios that can be played in the future than in current games. For example, the game should create as many paths of scenarios as it can create. Think of tripling the Detroit become human's paths of each episode or even more than that. Whatever you do, will lead to something meaningful and it will affect the story.\n4. Graphics. around 1995, there was windows 95. I think at the time, I remember people used to carry the square-shaped disk (2 MB) to transfer files that they want. Now, people carry terra-bytes-unit storage on their hands. Likewise, the graphics have improved as the data amount that games store increased. The average game data is now around 50 GB. In the future, it would be more than 500 TB for one game and trust me it will not stop there. You will be able to see veins of leaves close up. Each individual leaf on a tree will react differently to wind depending on its size and shape. if you expand your imagination here, each strike or blow with a sword will have a different impact depending on the angle at which other characters block. The edge of the sword will wear away partially depending on what part you use the most against your enemies. Think of adding more realism to Last of us part 2. Each bump on the road will affect a car very realistically. Think of Gran Turismo physics in open-world settings.\n\nThese are partially what I think will happen in the game industry.\n\nwhat are your thoughts? what will future games look like from your point of view?",
        "created_utc": 1675291710,
        "upvote_ratio": 1.0
    },
    {
        "title": "تعريب لعبة الرعب النفسي Observer نسخة Epic Games 🔥",
        "author": "AbdelazezMohammed",
        "url": "https://www.reddit.com/r/truegaming/comments/10r8ek5/تعريب_لعبة_الرعب_النفسي_observer_نسخة_epic_games/",
        "text": "[removed]",
        "created_utc": 1675290705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you watch all God of War games (1-3 + 2018, Ragnarok) and still have enjoyment, and fun just out of the cutscenes?",
        "author": "LordGodMaster69",
        "url": "https://www.reddit.com/r/truegaming/comments/10r871o/can_you_watch_all_god_of_war_games_13_2018/",
        "text": "I love the God of War games all 5 and it's spinoffs. But I have a friend I really want to show the main 5 too, but they do not enjoy playing games, and do not care for the Gameplay portion of it. They love greatly told stories, and all GoW games are very story driven. If I showed them all cutscenes from all 5 games, could they still get enjoyment out of the story like I did?",
        "created_utc": 1675290222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Epilogue, in awesome story games?",
        "author": "GameCowCZ",
        "url": "https://www.reddit.com/r/truegaming/comments/10r2aoe/epilogue_in_awesome_story_games/",
        "text": "Hey, I was just thinking abou what they did in RDR2 with the epilogue, it gave you something more to play and keep your mind off arthurs death even though you will never forget it. The epilogue just keeps away the post story depression I had with some great books, films and games now! I think that all story games should have them, just to explain what happened and not keeping you depressed for few days. What do you guys think? Wrrite it down",
        "created_utc": 1675276742,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I missing about fighting and racing game?",
        "author": "BlueManRagu",
        "url": "https://www.reddit.com/r/truegaming/comments/10r1y5v/what_am_i_missing_about_fighting_and_racing_game/",
        "text": "So I’ve been a pretty avid gamer since I was 5 or 6 and got a copy of Donkey Kong Country to mess about on. \n\nSince then I’ve found enjoyment in almost every single game genre. \n\nI’ve enjoyed sports games like fifa and madden. FPS’s from COD to bulletstorm. RPGs, JRPGs, Tactical Shooters, RTS, sandbox, fantasy, sci-fi, battle royal, hero shooters, indie, non-combat narrative experiences, survival horror…..you name it. \n\nThe list goes.\n\nNot only do I enjoy a huge range of games but I find myself getting quite obsessive around mechanics. I’ll often play on max difficulty since it usually means I have to learn the games mechanics to a certain level and I’m not just able to breeze through. \n\nNow for some reason I’ve never found a fighting or racing game I’ve truly enjoyed.  \n\nI don’t know if I’m missing something but I find no joy in pausing a game to look at a move set or learning the correct amount to brake on a corner. \n\nThe closest I ever got was the injustice games as I’m a big DC fan. Still I played on east and breezed through the camp just to see the story.\n\nThis post was mainly kicked off by the street fighter 6 stuff as it looks awesome but I have a feeling I just won’t enjoy playing it. \n\nI’ll also add I lived burnout paradise. But that’s it for racing games:) \n\nSomething about them has never clicked with me and I’m curious to hear what people love about these genres and how I can learn to enjoy them a bit more.\n\nAll the best \nBlueManRagu x",
        "created_utc": 1675275956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relationship between loot boxes and different gambling behaviour",
        "author": "theincrediblenormie",
        "url": "https://www.reddit.com/r/truegaming/comments/10qyu0x/relationship_between_loot_boxes_and_different/",
        "text": "Dear r/truegaming community,\n\nmy name is David and I am conducting a survey about the relationship between loot boxes in video games and different gambling behaviours as part of my bachelor thesis. It would be really helpful to me if you could take around 5 minutes to answer this survey. You are also welcome to answer this survey if you have never opened loot boxes before, the only requirement is experience with multiplayer video games in general and ideally previous experience with gambling of any kind.\n\nHere is the link to the survey: [https://survey.hdm-stuttgart.de/458491?newtest=Y&amp;lang=en](https://survey.hdm-stuttgart.de/458491?newtest=Y&amp;lang=en)\n\nThank you very much for your support.",
        "created_utc": 1675268657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Games where the player is inside of a large creature?",
        "author": "Dry-Tomato4236",
        "url": "https://www.reddit.com/r/truegaming/comments/10qv3t5/games_where_the_player_is_inside_of_a_large/",
        "text": "[removed]",
        "created_utc": 1675259194,
        "upvote_ratio": 1.0
    },
    {
        "title": "What WW games can I find with a Swastika?",
        "author": "iReallyLoveYouAll",
        "url": "https://www.reddit.com/r/truegaming/comments/10qp3uh/what_ww_games_can_i_find_with_a_swastika/",
        "text": "[removed]",
        "created_utc": 1675243089,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the most irritating immersion breaker to you?",
        "author": "Tr101748",
        "url": "https://www.reddit.com/r/truegaming/comments/10qmwu9/whats_the_most_irritating_immersion_breaker_to_you/",
        "text": "I’m playing The Last of Us remake and one thing that really breaks the immersion is that in some cutscenes your guns and weapons just vanish into thin air.",
        "created_utc": 1675234132,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a solo dev and I can finally say this: Bring Back the 80's Cop Vibe with Mega City Police, Wishlist Now on Steam to support me!",
        "author": "aaccensi",
        "url": "https://www.reddit.com/r/truegaming/comments/10qceto/im_a_solo_dev_and_i_can_finally_say_this_bring/",
        "text": "Hello!  \n\n\nI would like to send a very heartfelt thank you to the community for the massive amount of support during the Prelude version release of Mega City Police on [itch.io](https://itch.io). And now here's a Steam page! Although words cannot express how appreciative I'm of the support, and as you know It's really hard nowadays as a solo developer to get the attention of people to check your craft but I'm so lucky to have fellows and the moment to make this post on Reddit! I really hope the full version will meet your expectations ❤️\n\nWishlist here: [https://store.steampowered.com/app/2259210/Mega\\_City\\_Police](https://store.steampowered.com/app/2259210/Mega_City_Police)\n\n\"Thank you for your cooperation\" -  Robocop  © \n\nAnd here's the first trailer of MCP: [https://www.youtube.com/watch?v=o4KDvXYSCm0](https://www.youtube.com/watch?v=o4KDvXYSCm0)",
        "created_utc": 1675203789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Artificial Intelligence, voice acting and art. What is the future of game development?",
        "author": "Da_reason_Macron_won",
        "url": "https://www.reddit.com/r/truegaming/comments/10q1nbh/artificial_intelligence_voice_acting_and_art_what/",
        "text": "A couple of years ago I wrote a post here talking about the possibility AI voice acting becoming an important asset in game development. At the time my concerns were somewhat dismissed as people insisted that AI would not reach the level of a human actor for a long time. Today, we are here…\n\nhttps://vocaroo.com/1w69Z2yT5JiP\n\nOf course you probably are familiar as well with the kind of wizardry that AI can do with art. A few minutes in the r/dalle2 subreddit should be enough to convince anyone of the huge potential that AI art has to offer.\n\nAI 3D modeling and such is probably still some time away, but at the rate things are moving I don’t think the time will be that long.\n\nSo, in so far as we have to come to terms with the idea of AI being fully capable of substituting human creativity in many areas, what role can we expect of it in the years to come?\n\nAt its simplest I can imagine a massive wave fully voiced visual novels hitting steam. With the possibility of your average code monkey being able to let the robots take over in the acting and art department (and maybe even in the writing department as well), the possibilities of making relatively professional looking games at a fraction of the cost and time is unavoidable.\n\nBut I can imagine the same elements making its way into Triple A development. With how bloated game development has become, it may be quite tempting to simply leave a good chunk of it in the hands of the machine. Keep a couple of voice actors on the payroll for the big emotional scenes and leave everything else on the hands of the machine, spice your cut scenes with Persona-looking art. Use an afternoon with Midjourney to produce hundreds of pieces of concept art.\n\nWhether we like it or not, it seems like this is the future. But what do you guys think will be the full extent the AI’s role in the years to come?",
        "created_utc": 1675178302,
        "upvote_ratio": 1.0
    },
    {
        "title": "RX 6600 is Fine For Hogwarts Legacy at 1080p?",
        "author": "franchescomusch",
        "url": "https://www.reddit.com/r/truegaming/comments/10q0wm6/rx_6600_is_fine_for_hogwarts_legacy_at_1080p/",
        "text": " I'm currently running an RX 6600 and a Ryzen 5 3600. I'd like to run Hogwarts Legacy at 1080p in high settings. Do you think that I'll be able to achieve that? I appreciate your reply because I don't know much about GPUs and that stuff, and I’m quite concerned!  \nMy specs:  \nRyzen 5 3600, RX 6600, 16GB RAM",
        "created_utc": 1675176514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trip Down Gamer Memory Lane (2012)",
        "author": "Legal_Degen",
        "url": "https://www.reddit.com/r/truegaming/comments/10pxxfz/trip_down_gamer_memory_lane_2012/",
        "text": "[removed]",
        "created_utc": 1675168561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trip Down Gamer Memory Lane (2012)",
        "author": "ReKrov",
        "url": "https://www.reddit.com/r/truegaming/comments/10pxdri/trip_down_gamer_memory_lane_2012/",
        "text": "[removed]",
        "created_utc": 1675166885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trip Down Gamer Memory Lane (2012)",
        "author": "ReKrov",
        "url": "https://www.reddit.com/r/truegaming/comments/10pxdde/trip_down_gamer_memory_lane_2012/",
        "text": "[removed]",
        "created_utc": 1675166848,
        "upvote_ratio": 0.99
    },
    {
        "title": "Ninja Warrior Private Token Sale",
        "author": "Nftwatcher_",
        "url": "https://www.reddit.com/r/truegaming/comments/10pw0ts/ninja_warrior_private_token_sale/",
        "text": "[removed]",
        "created_utc": 1675162141,
        "upvote_ratio": 1.0
    },
    {
        "title": "DS4 controllers with SHORT (stubby/low) analog sticks + LOW tension??",
        "author": "OnePrettyFlyWhiteGuy",
        "url": "https://www.reddit.com/r/truegaming/comments/10pvgzi/ds4_controllers_with_short_stubbylow_analog/",
        "text": "Call me crazy, but I have no idea why the industry has trended towards those freakishly tall thumb-stick extenders, OR those ‘precision rings’. \n\nMaybe it’s cause i’ve got short thumbs or something, but I don’t like my thumb being forced to move so far to look around. I also hate the way tension works because tension is not linear on a lever that pivots in the way an analog stick does - and I hate having to modulate against the different zones of resistance in the different planes of the stick. \n\nSo, are there any controllers that cater towards my preferences??",
        "created_utc": 1675159978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any games that let you watch a full length movie in-world?",
        "author": "Medusa107",
        "url": "https://www.reddit.com/r/truegaming/comments/10pp4yp/any_games_that_let_you_watch_a_full_length_movie/",
        "text": "I recently replayed the first The Darkness game, and watched the full movie of To Kill A Mockingbird in Jenny's apartment. It was quite a vibe.   \n\n\nAre there any other examples like this of movies in games?\n\n[https://www.youtube.com/watch?v=4mfo39WtcOg](https://www.youtube.com/watch?v=4mfo39WtcOg)",
        "created_utc": 1675141026,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't understand how games can give you instant pleasure?",
        "author": "Standard-Metal3161",
        "url": "https://www.reddit.com/r/truegaming/comments/10pnq6b/i_dont_understand_how_games_can_give_you_instant/",
        "text": "I play videogames 1 or 2 hours a day. I play online competitive games like Apex Legends. If you know Apex, most of the times you lose and specially if you're a beginner you almost always will lose. It is frustating and the opposite of pleasure. How can this game give you instant pleasure?",
        "created_utc": 1675137588,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Cards of Ethernity $5,000 Tournament has finally arrived",
        "author": "TermoLumilagro",
        "url": "https://www.reddit.com/r/truegaming/comments/10pkn2i/the_cards_of_ethernity_5000_tournament_has/",
        "text": "[removed]",
        "created_utc": 1675129317,
        "upvote_ratio": 1.0
    },
    {
        "title": "As a PlayStation fan I'm worried about Xbox",
        "author": "mtanderson",
        "url": "https://www.reddit.com/r/truegaming/comments/10pk8m8/as_a_playstation_fan_im_worried_about_xbox/",
        "text": "*the following is my opinion and may not represent popular opinion or reality*\n\nI'm a Playstation guy but I like to keep up with Xbox to see the latest releases and news. I think competition makes both platforms better so I was rooting for Xbox to really step it up this gen. And now 2 years it's become very clear; the executives at Xbox are bordering on incompetent. So here are my biased and factually unconfirmed concerns on the state of Xbox, which I'm absolutely gonna get yelled at for:\n\nFirst off, games. It blows my mind that the Xbox released in 2001, but over 20 years later they still have not figured out how to produce system selling AAA games. Halo, Forza, Gears, and Flight Sim don't cut it for most people. The big game for Xbox could've been Halo but they fumbled the bag hard with that series. With all the studios they bought they could be releasing a ton of new games soon, but it's hard to give Microsoft the benefit of the doubt when they don't have the track record to back it up. Every game they announce ends up getting pushed back, sometimes multiple times. The delays don't even mean more polish; Halo Infinite was delayed by a year and it was considered an unfinished disappointment. I assume it was delayed to refine the monetization more than anything else, as evidenced by its lack of features. Either that or Microsoft's just not good at managing this kind of thing.  The only notable first party they've released in a long time is Hi-fi Beat, and the reaction to the game was something else. Hi-Fi Beat was praised so highly  as a mind-blowing, 10/10, GOTY nominee with no bugs or negatives. Hi-Fi is a good game, but the overblown reaction to this game showed how starved they've been for any exclusive content whatsoever. \n\nThat brings me to my hot take: Game Pass is ruining Xbox.  It drives me nuts that MS it has tricked its Xbox users into cheering on bad business practices they proclaim as pro-consumer. First \"great\" thing it introduced was the Day 1  policy. Game pass players love the idea of all the 1st party games releasing on Game Pass day 1 and it's often touted as the selling point of the whole service. Player expectations are that they'll release games day 1 that are comparable to Playstation's exclusives, but that's not possible with the Game Pass business model. Day 1 AAA releases means that people aren't spending $70 on it, but since MS loves money, they have to shift the cost to the game itself and monetize the fuck out of them with MTX. This right here is (part of) what'll keep Xbox exclusives from  reaching the levels of Playstation exclusives. Not only because excessive MTX makes the game feel cheap instead of premium, but because there won't be as much time spent developing the fun parts if they have to spend time monetizing it. It's just a recipe for delayed, unpolished, underwhelming games.\n\nI don't deny Game Pass is a good deal. But Microsoft could only pull that off cause they're a trillion dollar company, but for some reason people think Microsoft priced it so low because they are the most generous and pro-consumer company ever and just want to provide everyone with the gift of gaming for dirt cheap. No hun, it's money. They are likely spending more money than they're getting in revenue, but that's to saturate the market, crank up the prices, and make money. Very standard streaming business practice, think Netflix. Unlike Netflix though, Xbox hasn't released the steady stream of original content needed to get people hooked and willing to pay higher prices. In order to do that,  Microsoft absolutely needs high quality game that gets a ton of people on game pass.\n\nProblem is I just don't feel good about the upcoming games, and I've been rooting for Bethesda to be the savior of Xbox. But gameplay footage of Redfall and Starfield were both… underwhelming to say the least. I think people will play Redfall and enjoy it well enough,  but gameplay we've seen looks too generic to have staying power as a system/service seller. Redfall can get away with mediocre, but Starfield is where they absolutely can't fuck up. Starfield was the reason many people  signed up in the first place. So if Starfield, the first AAA exclusive and biggest first-party IP since the the Xbox 360, is not well received then it might be the breaking point for a lot of people. There's already some rumbling about Starfield likely being locked at 30fps, and I can't even imagine the outrage when Xbox players realize that all the AAA exclusives they've been waiting years for are MTX filled, unpolished, and potentially unremarkable games. Of course this is just my opinion based on the first gameplay footage, as well so I could be dead wrong and both Starfield and Redfall could turn out great. I do want these games to be great even as a PS player and especially as a Bethesda (Skyrim) Fan.   \n\n\nI can already hear people accusing me of being a salty PS player trying to dunk on Microsoft for no reason, but it's really if Xbox goes under, or worse turns into Game Pass only, it's bad for all of us. And I do realize Microsoft is a trillion dollar company so who am I to question them, but dear god it seems like these decisions they're making will be bad for Xbox players but the fans love them for it.",
        "created_utc": 1675128176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I buy it?",
        "author": "Fallen_winged_boy",
        "url": "https://www.reddit.com/r/truegaming/comments/10phosw/should_i_buy_it/",
        "text": "I have 3 questions:\n\n1.  I've seen many reviews and about ten minutes of hi-fi rush gameplay and it seems really nice and fun but, I don't know if in the end my purchase will give me satisfaction because I've read that the game is really short and I usually prefer games more lasting. What do you think about it? Is it still worth it even if it takes about 10 hours? \n2.  I found guilty gear strive discounted and I was inclined to buy it but I'm not sure because games of that genre have never been too much of my interest and, although it attracts me a lot, I'm afraid it would end up boring me. So what do you think? \n3.  I also found horizon zero dawn discounted and I was very convinced to buy it but I'm afraid I might not like it that much. How much gameplay matches the cutscenes and story? I really enjoy good stories and good cutscenes but I more enjoy games where the combat is fluid and not interrupted by pointless animations, unless they're special moves or something like that. So what I'm asking is: is this game more like zelda botw(action without much cutscene interruption and good open world with good story but more gameplay focused) or more like god of war ragnarok? \n\nSorry for bad english",
        "created_utc": 1675121444,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best way to Look For Group?",
        "author": "Chilly5",
        "url": "https://www.reddit.com/r/truegaming/comments/10pf3fw/whats_the_best_way_to_look_for_group/",
        "text": "Trying to find a consistent group of folks to play with for some of the games I'm into but I'm having a hard time. Is there a \"Looking for group\" app or something like it?",
        "created_utc": 1675115230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top 50 Video Games by Most Copies Sold",
        "author": "EliLovesNintendo",
        "url": "https://www.reddit.com/r/truegaming/comments/10pbl2x/top_50_video_games_by_most_copies_sold/",
        "text": "[removed]",
        "created_utc": 1675106985,
        "upvote_ratio": 1.0
    },
    {
        "title": "My take on the \"gaming addiction\" studies controversy:",
        "author": "Brilliant_Gift1917",
        "url": "https://www.reddit.com/r/truegaming/comments/10p7ewg/my_take_on_the_gaming_addiction_studies/",
        "text": "***This is a comment from a post someone made who thought they had a 'gaming addiction', it's gone now but this was my write up. Apologies if context is missing as a result:*** \n\nFor starters, what annoys me about a lot of studies is how disproportionately targeted they are at children, and when it comes to adults or older teens, they always use \"lowest common denominators\" - people with clear underlying social issues as well as physical &amp; mental health issues that result in them often living in their parents' homes and stay on video games all day.\n\nIn the case of children, children are just dumb and unreasonable. They act up when they don't get what they want. Deprive them of sugar and stuff they enjoy and they will get pissy about it. And I'm not saying this to 'insult' kids either - I had my tantrums too when I was a littlun. Most of us did. No shit kids like sugar and become a pain in the ass when they don't get stuff they like for too long - their brains are still not developed and trying to call it an \"addiction\" is pathetic. The same goes for video games. Obviously 12 year old me wanted to go home and play CoD, not solve 100 question pythagoras worksheets and write essays on fucking shakespeare. That's not addiction - at that age your brain is wired to gravitate towards things you enjoy and you do not fully understand the concept of priorities. Yet these things are constantly treated as \"addictions\" in \"scientific studies\". Give most of the kids studied here 20 years and they're completely normal, functional members of society, not spoiled brats or addicted to anything like these studies would like to have you think.\n\nIn the case of \"lowest common denominators\", a lot of \"studies\" target people who already have underlying issues that would result in them being 'addicted' to games. Of course people with autism are going to be more likely to struggle to find work or socialize, resulting in them more often living with their parents and not getting out much, and of course they will find solace in the escapism of gaming and therefore spend most of their time doing that. Of course people who were bullied relentlessly in school will gravitate to the company of XXTheSlayer72 who gave them full diamond gear on the server they just joined - they've never experienced that level of kindness in real life. Yet these \"studies\" that want to \"prove\" gaming addiction is a thing ignore all these factors.\n\nWhen neurodivergent people are denied stims, they can have meltdowns. Yet these sick \"gaming addiction\" documentaries will take footage of a clearly neurodivergent or mentally ill kid having a meltdown because their parents banned them from playing games and claim it's \"withdrawal symptoms\" from their \"addiction\". The reality is, someone who is neurotypical wouldn't be triggered the same way. But when they use drugs that mess with parts of your brain that shouldn't be messed with, those effects get kicked off, hence the similarity between a meltdown and withdrawal syndromes. Scientists know this, yet they cleverly use their indistinguishability to trick unsuspecting people who don't question their sources into thinking the 'gaming addiction' is real and that some kid's autistic meltdown is actually a 'withdrawal system' from the evil gaming addiction.\n\nThey almost never make sweeping studies across the general population, they look at people who are already in a disposition where they play more games than average and then dehumanize them into gaming-addicted degenerates and rejects. If they want actual studies on \"gaming addiction\", study the whole population, not control groups who've been cut out to give the results you want. That goes against basic high school science. When you look at the general statistics for how much time the average person spends gaming, it's usually around 1 hour and 15 minutes per week. But some studies which only focus on \"gamers\" will hyperfocus on the 'addicted' percentage who play for 8-12 hours a day, then release a study claiming that the 'average gamer' plays that long and is therefore 'addicted'.  \n\nThe other thing that pisses me off is the superficial way in which they brand these things as 'addictions'. Heroin and sugar both make your brain release happy chemicals? ADDICTION! Heroin addict can't be bothered finishing the dishes before doing another shot? Well guess what, Jimmy doesn't want to finish the dishes, he wants to play Minecraft! ADDICTION! Our sCiEnTiSTs (never sourcing the institution or peers who reviewed the study) did a CT scan of a crackhead and a Fortnite addict and found they both show frontal lobe activity when told to \"stop doing crack\" and \"get off of fortnite\" respectively, therefore Fortnite is just as addicting as crack!  \n\nThey fail to realize that 'addiction' to many illegal drugs have actually dangerous withdrawal effects like psychotic episodes, panic attacks, fainting and so on. 'Addiction' to sugar does not trigger those withdrawal effects, yet a child crying because they weren't given a chocolate is considered the same level of 'addiction' to these 'scientists' with agendas and quotas to meet. If you were trapped on a desert island without chocolate, the only \"withdrawal\" you would feel is if your blood sugar was too low from lack of glucose-rich foods after a few days or so if you couldn't find food. If a meth addict was stuck on a desert island, however, their brain would literally try to implode itself. And that's why to treat addicts they're slowly weaned off of drugs via microdosing and immediately isolating them from substances is often considered inhumane punishment because it often leads to even more issues. The fact we don't need to microdose people off of sugar or video games to stop 'addictions' should say enough.",
        "created_utc": 1675097022,
        "upvote_ratio": 1.0
    }
]