[
    {
        "title": "Conversations with creationist cousin. Need recommendations for a book.",
        "author": "non_interesting",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2826my/conversations_with_creationist_cousin_need/",
        "text": "Long time lurker but active reader.  I've been having some long and interesting discussions with my cousin from Kansas, whom I have the upmost respect for.  I knew she was a die hard Christian, but it's become apparent she is also a creationist and believes the bible is the infallible word of god.  Despite our glaring differences, the conversation has remained very civil and open.  That's been the biggest (and welcome) surprise so far.  We agreed to exchange books to broaden our perspectives.  She is sending me The Reason for God by Timothy Keller.  I'm asking for recommendations of a book I could send her.  Her depth of knowledge about the age of the earth, evolution and the big bang are more limited that expected for someone of her education and intelligence.  I can't decide to tackle that route first or more direct relating to god and the bible.  Any help is most appreciated.   ",
        "created_utc": 1402675349,
        "upvote_ratio": ""
    },
    {
        "title": "Had an extremely awkward interaction at Costco.",
        "author": "JakalDX",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/281xei/had_an_extremely_awkward_interaction_at_costco/",
        "text": "So I was at Costco with my grandmother, and we happened to run into her pastor there. They made some small talk, she introduced me, I chatted with him for a bit, it was all pretty chill. Then the topic of jobs came up and I mentioned I was on the way to a job interview. He said \"Oh wow! That's great! Let's pray for it right now!\"\n\nWe're in an aisle at costco, people going up and down by us, and he just puts his hand on my shoulder and starts a prayer. I didn't know what to do, so I bowed my head and closed my eyes. I mean, I appreciated the sentiment, but *god* praying is such a weird tradition.\n\nI never know how to react there. At family get togethers I don't bow my head because I'm a pretty open and proud atheist, but what am I gonna do, tell this pastor \"Naw, fuck your prayer, I don't need it.\"\n\nJust a really uncomfortable scenario.",
        "created_utc": 1402669589,
        "upvote_ratio": ""
    },
    {
        "title": "Some Christians claim new scientific discovery of 'ocean' underneath Earth's surface is explanation for Noah's Flood",
        "author": "Pax_Romana300",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/281wii/some_christians_claim_new_scientific_discovery_of/",
        "text": "So I was reading an interesting story on /r/science, which can be found [here](http://www.reddit.com/r/science/comments/280845/massive_ocean_discovered_towards_earths_core/), about a massive 'ocean' discovered under the Earth's surface. I noticed that the story had a lot of other discussions going on in other subs, so I decided to check it out. To my surprise (and horror), lots of Christians, and even /r/islam, seem to think that this gives credence to the Noah's Flood story as an explanation for all the water needed to cover the Earth. One wonders why it doesn't prove the deluge from the Epic of Gilgamesh or the Egyptian or Greek flood myths... Even if this 'ocean' was actually water, it still wouldn't be enough to cover the entire Earth for a month, doesn't explain where it came from, and doesn't explain how it got under the Earth, *but it isn't even truly water*.\n\nWhat do you guys think of the miniscule amount of 'evidence' theists will cling to to validate their beliefs, while ignoring the mountains of evidence that invalidates their beliefs?\n\nLinks to Christian/Islam subs claiming this is the Flood water:\n\nhttp://www.reddit.com/r/Christianity/comments/281pj4/where_did_the_water_for_the_flood_come_from_one/\n\nhttp://www.reddit.com/r/TrueChristian/comments/281pkt/where_did_the_water_for_the_flood_come_from_one/\n\nhttp://www.reddit.com/r/Christianity4Real/comments/281pjl/where_did_the_water_for_the_flood_come_from_one/\n\nhttp://www.reddit.com/r/islam/comments/280v5h/in_case_you_were_wondering_if_there_is_enough/",
        "created_utc": 1402668986,
        "upvote_ratio": ""
    },
    {
        "title": "Is It Loving to Warn Me About Hell?",
        "author": "godlessindixie",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/281rcd/is_it_loving_to_warn_me_about_hell/",
        "text": "Recently I've had more family members threaten me with Hell, and then get offended that I said they were \"threatening\" me.  They protested that they're simply *warning* me, and that they're just the messenger.  I contend that such behavior isn't loving, even though they would say that love is what's motivating them to try to intimidate me into conformity with their beliefs.  What do you think?  Is love what's in operation here?  Am I being too hard on them?\n\nI gave [my response to it here](http://godlessindixie.com/2014/06/12/is-it-loving-to-warn-people-about-hell/). But what do you think?",
        "created_utc": 1402665217,
        "upvote_ratio": ""
    },
    {
        "title": "Threatened with kidnap and torture at the age of about 12 by one of my peers.",
        "author": "shesanantitheist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/281kj0/threatened_with_kidnap_and_torture_at_the_age_of/",
        "text": "I lived in a small rural US Midwest town.  I was raised without religion.  My classmates found out about my lack of knowledge of God in fifth grade because of a rumor that I was a Devil worshiper.  Of course, I had no knowledge of the Devil either so I ignored the problem, that I didn't learn was a problem until a year later.  I ended up going to three or four of different churches, each only one time, to hang out with either friends or family.  Despite being a teacher's pet, my Mom is a teacher so I had no say in the mater, and loving school, I found the parts of church that I wasn't able to play with whoever I went with to be quite boring.  However, I'm quite certain that I never vocalized that opinion.\n\nI got the occasional question, which I ignored, of why I didn't follow God at recess, but since we were in fifth grade they couldn't bother me too much about it.  This was when I lost most of my friends.  The pestering and pressuring me to believe in God got much worse in middle school.  Kids, mostly girls, ganging up, on me to talk about God and how \"Jesus loves me\", but not well enough for them to be my friends again apparently.  P.E. was the worse, since three of my four remaining friends were boys and I was a girl and my one girl friend would always side with the other girls when they came to talk to at me.\n\nAbout a year after it all started, when I was riding my bike I was stopped by a girl who was a grade below me.  I knew who she was, but I didn't really know her.  I don't remember exactly what she said, but what I do remember is that it sounded like she spoke for a group.  She mentioned that she (they?) had heard that I had said that church was boring and that if I ever said that again I would be kidnapped and shown the errors of my ways, which sounded a whole lot like torture to me.  I know I stopped listening when I realized that she was talking about torture and started to weigh my options about getting away from her.  She was between me and my house and we were both on bikes and on top of a hill.  I knew I could out ride her unless she wrecked into me before I could get away, but I was pretty sure that she didn't have any regards for her own physical well-being.  Before I could make a decision, she finished whatever she was saying and left.  I went home but I never told my parents about what had happened.  I kept my room extra messy, since it was in the back of the house away from the rest of my family, so that if anyone tried to get me during the night I would have a bit of warning.  I also picked up an interest in medieval weaponry and improvised weapons as self defense.\n\nI endured about another year of this before I noticed I was contemplating suicide.  This scared me.  I still didn't know that atheism was a word at this point in my life, so I decided to try a different tactic and went god shopping.  I chose the Norse gods since they give a damn good incentive to not commit suicide, I really hate being cold, and multiple gods makes more sense to me then just one god.  With my new found gods at my side and mostly keeping my head down and mouth shut, I managed to get through high school without any more threats or any physical harm.  When it came time to choose which collage to go to, I only considered ones that none of my classmates were going to.\n\nI had been in collage three years when some of my friends started a secular student society.  My boyfriend was the one who convinced me that we should go to the meetings.  I was rather nervous at first and would keep an eye on the three doors that led into the room we were in at the library out of fear that someone with a gun would burst through them to mow us all down.  When I started becoming more comfortable with being in the meetings, I didn't know how I should broach the subject of what I had been through with the group.  They were all deconverts from Christianity and that's what we talked about, along with what will the future be like.  I did share my experiences with a few of the individuals in the group, but I was scared to try to make it a group discussion.\n\nI'm now 24 and over the last six years since I've left my hometown I've been flip flopping about whether I was actually in danger from that threat.  After hearing about the [\"slenderman\"](http://fox6now.com/2014/06/02/two-girls-in-custody-now-accused-of-planning-to-kill-friend/) attacks, I'm leaning towards yes again.  Has anyone else had this kind of experience?",
        "created_utc": 1402658592,
        "upvote_ratio": ""
    },
    {
        "title": "I'm having trouble with faith",
        "author": "Th3Coltonator",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2806ef/im_having_trouble_with_faith/",
        "text": "I'm eighteen, confirmed Catholic, haven't practiced since I was confirmed four years ago, and am having trouble figuring out what I do believe in. I've been pretty atheist throughout my lifetime, I think nine years of Catholic school did the trick. Lately I've been thinking about what I do believe in. When I did pray, my prayers went unanswered or the complete opposite happened. Example: I prayed for my dad to come back from Iraq quickly, he didn't, he spent eight more months over there than he should've. As I've said, I'm questioning if there really is anything to believe in. I'm a good guy, don't have a police record, I go out of my way to do nice things for people, put others before me, but it doesn't seem to be doing me any favors. And when I did believe, at least it felt like I was doing those things for a reason. I lost my faith, but for some reason I feel like I should believe that there is something greater, something looking out for me.\nI haven't really given you guys much to work off of, and I apologize for that, but my mind is kinda muddled and I've never been one to ask for help so I don't really know what to say. I guess I'm just looking for a few opinions to help me find my way.",
        "created_utc": 1402613406,
        "upvote_ratio": ""
    },
    {
        "title": "Pew Study: Almost half of U.S. would be unhappy if a family member married an atheist",
        "author": "themeddlerrr",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2801po/pew_study_almost_half_of_us_would_be_unhappy_if_a/",
        "text": "Pew released a new study today that covered the polarization of the American public. 73% of people who consider themselves \"consistently conservative\" said they would be unhappy if a family member married an atheist. Including the entire US population in the results, 49% would be unhappy. \n\nI don't have any trend numbers handy unfortunately. I don't know whether this is higher or lower than years previous. My hunch is that it's lower..\n\nHere's the relevant chart: http://www.people-press.org/files/2014/06/PP-2014-06-12-polarization-3-07.png\n\nHere's the study in full: http://www.people-press.org/2014/06/12/political-polarization-in-the-american-public/",
        "created_utc": 1402610535,
        "upvote_ratio": ""
    },
    {
        "title": "Search for the existence or proof of God, my thoughts",
        "author": "berlinbrown",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27z3ux/search_for_the_existence_or_proof_of_god_my/",
        "text": "I seemed to get a lot of flack from the atheist community because I believe God absolutely doesn't exist.  The theme is, we can't prove it.   I don't necessarily think we have to prove it and if we did, we could come up with a reasonable enough assertion that God doesnt exist.  I believe there are \"brain in the vat\" proofs that prove we aren't brains in a vat.  For this omnipotent being, assuming that is the God we are talking about, I would use similar approaches.\n\nHere is an analogy I came up with. \n\nLet's say you are mapping out pi.  And within pi is a sequence of numbers that could describe God.  God is within the infinite map of numbers.  BUT you have to scan all of the numbers to find that potential set of digits.  If make take an infinite amount of time and there is absolute that the number does exist.  But if you find that God number, it will give you a pretty good idea of God's existence.  It will be magical to you. Or it may not. \n\nSearch for the sequence pi:  12312931297849897... (this is the magical God sequence). If found, that is God, God exists.   If not, God doesn't exist.  Note; it will be hard to find a particular sequence within the infinite stream of digits, maybe impossible.\n\n... \n\nScience and math are created by humans.  There is a certain vocabulary and certain way to discover new things and to prove if the science is valid.   I think for most people, no one needs to map out ALL of pi.  You can't because it is an infinite series. \n\nSo if I map out a billion of digits of pi and I can't find that magic number (the God number) then you say...that God number doesn't exist. \n\nI feel the same could be said about God.  You COULD try to figure everything about our universe and the possibility of other universes and seek out God to prove the existence of the entity.  But that would be a worthless endeavor to the science community.  Science picks and chooses paths which would generate the most useful pieces of information.    And hence would be generally worthless most the rest of us.  And I would go ahead and say, this particular sequence doesn't exist with the stream.  I would say God doesn't exist.  For most intents and purposes, us humans we would understand the meaning of the statement and be OK with it.\n\nYour thoughts?\n",
        "created_utc": 1402590292,
        "upvote_ratio": ""
    },
    {
        "title": "I dont know what to believe...",
        "author": "Sonicrider3",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27yxjz/i_dont_know_what_to_believe/",
        "text": "I am a 13 year old boy, and I dont know what I am. \nMy parents always speak of god, and so do my friends. I always think that God is just a imaginary figure, but then I get afraid, saying \"what if he is real and he punishes me?\"\nI need help.",
        "created_utc": 1402586432,
        "upvote_ratio": ""
    },
    {
        "title": "How can Christians justify eating meat, Thou shalt not kill is one of their commandments.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27ypj0/how_can_christians_justify_eating_meat_thou_shalt/",
        "text": "I'm gonna need some binoculars to sight this goal post.",
        "created_utc": 1402581130,
        "upvote_ratio": ""
    },
    {
        "title": "Arguing the Problem of Evil with Ordinary Believers, and why religion is a poor source of morality",
        "author": "JasonMacker",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27y6hl/arguing_the_problem_of_evil_with_ordinary/",
        "text": "I want to share [this article](http://infidels.org/kiosk/article/arguing-the-problem-of-evil-with-ordinary-believers-881.html) where the author reflects on how discussions with Christians tend to go. Basically, the problem of evil, in the author's view and my own view, is largely ignored or superficially examined by the vast majority of ordinary religious believers. The author doesn't go into the real world consequences of this, but I want to continue where he left off and talk about this. My thoughts on this are that, despite the claims that religion provides morality, in fact religion *hinders* morality and ethical thinking.\n\nWhen you look at the Tamarin study on children in Israel (summarized [here](http://maxblumenthal.com/2010/08/1963-survey-majority-of-israeli-jewish-youth-could-support-genocide-against-arabs/)), you see that religious morality is an inherent double standard. When Joshua commits genocide, 60% are in favor of it. Yet when \"General Lin\" does it, only 7% are in favor. How can religions claim universal morality when the morality of a behavior is dependent on whether you belong to a particular ingroup?\n\nReligious believers like to think of their morals as being solid or absolute, but the reality is that they are incredibly subjective and circumstantial. Slavery, rape, genocide, etc. are not seen as universally bad, but subject to the *context* in which they occur. This is something I just realized now. The moment a religious believer objects to Biblical atrocities by shouting \"out of context!\", they admit that their morality is not objective.\n\nWhen we compare religious morality to secular ethics, we see a striking difference. Secular ethics are deliberately constructed to be as objective and universal as possible. Kant's [categorical imperative](http://en.wikipedia.org/wiki/Categorical_imperative) doesn't care if you're Jewish or Chinese... your actions have to be completely universal, and not just among some group. If you want to lie, then you have to consider the results if EVERYBODY were a liar. This sort of moral view seems inherently superior to the subjective morality of religion.\n\nThe same goes for [Bentham's consequentialism](http://en.wikipedia.org/wiki/Utilitarianism). Pleasure is pleasure is pleasure. Your personal pleasure is NOT more important than some other person's pleasure.\n\nAnyways, I'm not sure where I was going with this but basically, I think there is a huge connection between the superficial examination of the problem of evil and subjective religious morality. Thoughts?",
        "created_utc": 1402560393,
        "upvote_ratio": ""
    },
    {
        "title": "If you believe in the multiverse, then denying Jesus is hypocritical.",
        "author": "jason83",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27wkta/if_you_believe_in_the_multiverse_then_denying/",
        "text": "If the multiverse does not exist, disregard this post.\n\nIf the multiverse does exist, and its creation and expansion works by creating a newer version of itself for every action that has multiple possible (think Abed from Community throwing a 6 sided die) outcomes, then wouldn't that mean that this type of universe expansion would have started from the moment the big bang occurred?\n\nWhy does that matter if it is true? Because if it is then that would mean all possible configurations of the universe exist, including the one where Jesus Christ was lifted on the cross and died, yea, even for all of humanity did he die so that a perfect sacrifice could be made.\n\nWhy is Jesus perfect and without sin? Because he is the boy born from Mary who on earth made every decision correctly and follow a perfect line through the multiverse, whereas other versions of him being created following non perfect paths or opposite paths are the saints all the way through to what can be considered 'anti-Christ'\n\nThat's what the Restoration means to me, lifting all the people up to the perfect versions of themselves in the multiverse that made the best decisions for their health and well being at every branch of multiverse expansion.\n\nI.e.: little Billy gets stopped at a corner by a stranger who ask him if he wants a smoke. Billy says yes, but also says no according to multiverse. The perfect version of his body is the one that always abstained from self harm, and made correct decisions 100% of the time. Jesus is that, anti-Christ is opposed (opposite).\n\nTldr: there is a version of you in the multiverse that agreed with everything written above. ;)",
        "created_utc": 1402517313,
        "upvote_ratio": ""
    },
    {
        "title": "Recommended books for learning the Socratic Method?",
        "author": "Valendr0s",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27vov9/recommended_books_for_learning_the_socratic_method/",
        "text": "So I would like to try to better my 'street epistemologist' skills. I am currently HORRIBLE at the Socratic method of asking questions and listening to responses. I will start off with a single question, they answer it, and then from my fingers will ooze a 27 page dissertation about why they're wrong and why they're going to destroy the universe.\n\nAre there any books you guys could recommend that could help me hone my skills? Help me temper my temper long enough to get somebody to question their beliefs, and help me zero in on the best questions to ask?\n\nOr is there another method you've found that helps somebody examine their own beliefs in a new light?",
        "created_utc": 1402498271,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any good evidence for my belief it is important to 'try to be a good person' and 'be morally good'?",
        "author": "pseudonym1066",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27vl7v/is_there_any_good_evidence_for_my_belief_it_is/",
        "text": "Is my belief that it is important to be a morally good person just as irrational as some religious beliefs? Or is there any evidence to support this view?",
        "created_utc": 1402495906,
        "upvote_ratio": ""
    },
    {
        "title": "Does anybody else get annoyed by the phrase \"Christ-like\"?",
        "author": "rebel581",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27vis3/does_anybody_else_get_annoyed_by_the_phrase/",
        "text": "Does anybody else get annoyed when someone uses the term \"Christ-like\" as a synonym for a \"good person\"? It seems like using this term, even if you're not religious, is just accepting that Jesus was \"the pinnacle of humanity\" or some wise philosopher that the world had never encountered before. It just seems wrong to continue using that phrase since it implies so much.\n\nDoes anybody else feel similarly about this?",
        "created_utc": 1402494145,
        "upvote_ratio": ""
    },
    {
        "title": "I don't think I want to be called an atheist anymore, but I don't know how to define myself without it.",
        "author": "EdwardDupont",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27ussm/i_dont_think_i_want_to_be_called_an_atheist/",
        "text": "Atheism is such a powerful word and yet I don't like it and I don't want to be defined by it and yet what do I say? I don't believe in a god or gods...so you're an atheist? No. I don't know...I want to be a person who doesn't have define themselves based off of a belief in a fucking god or not. That's my rant for the night. ",
        "created_utc": 1402465444,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism vs Religious Value",
        "author": "MozartLink",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27us5w/atheism_vs_religious_value/",
        "text": "I am going to present the scientific truth here for people who think that atheism has more value than any amount of pleasure through religious belief (even perhaps the greatest amount of pleasure a human being can have through belief in religion). No amount of intelligence or great things we do in life will ever make up for a lack of pleasure because in order to have such value towards these things is to have pleasure in the first place (as pleasure is what allows us to give value in terms of emotion towards these things). So it would be illogical to say that these things have greater value than our pleasure. Now if you were to somehow have value towards something with no pleasure, then this value would be nothing as it is nothing more than a thought. Pleasure is what gives any notion of value life and without pleasure, it would be completely dead. Therefore, pleasure is the only thing that matters and any notion of value is just a thought and nothing more.  It is the processes in our own brains that give these things value.  Without such a process (which would be the process of experiencing pleasure in the brain), then they will have no value.\n\nEdit: I'm an atheist with the mentality of a religious person who seeks self-enlightenment and even though a positive perspective can be achieved through atheism, some people are better off with their positive perception of religion. Atheism recognizes the reality of situations (in this case, there being no God and no afterlife). Even though it is good to recognize the reality of a situation in most cases, this is not always the case. In situations where not recognizing the reality of a situation does no harm to you or anyone else and brings you personal pleasure, then recognizing the reality of the situation is pointless. In other words, since believing in God and such would do me no harm and wouldn't make me harm others and would bring me personal pleasure in life, it would be pointless for me to be an atheist that I am now.",
        "created_utc": 1402464845,
        "upvote_ratio": ""
    },
    {
        "title": "Free will for dummies",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27umys/free_will_for_dummies/",
        "text": "I know you are thinking \"here we go again\". No way do I believe in an old man in the sky stuff. And I know being a atheist does not mean you need to give free will or any other concepts a second thought. You just don't believe in gods. But most atheist seem to believe that the human being has some free will. Now I am a nuts and bolts kind of thinker. I think that all matter and energy was but in motion at the big bang and all the atoms and molecules move according to physical laws. I really think just like you can throw a handful of marbles on the ground and predict their movements - you can do the same for all matter ... including the configuration that is the complexity of a human. I would say that all human activity is just as predictable as breaking racked set of balls on a billiard table. I don't see why a human should have \"transcended\" the fixed laws. So I don't see how we can actually have any free will from a materialist point of view - that I really believe without reservation. But some materialists still like to propose theories with quantum mechanics and string theory to somehow elevate man above the bouncing ball. Somehow people like to explain why we are not just balls rolling down a hill following  fixed rules of the universe that also demand this very discussion.\n\nSo can someone explain to me how we have free will in a few sentences ? Please don't start up with \"straw man theory\" or quoting this guy ... or go into some semantic exercise of possibilities. Please explain in simple clear language when we became separate from matter following fixed laws. \n\nIf you have heard this before - than that is good because you understand my question I was trying to ask in a short straight forward manner. ",
        "created_utc": 1402460396,
        "upvote_ratio": ""
    },
    {
        "title": "Forbes says philanthropy needs a religious precedent",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27udq8/forbes_says_philanthropy_needs_a_religious/",
        "text": "",
        "created_utc": 1402453780,
        "upvote_ratio": ""
    },
    {
        "title": "Pakistan: The Council of Islamic Ideology (CII) endorsed its earlier ruling that girls as young as nine years old were eligible to be married, “if the signs of puberty are visible”.",
        "author": "Banana_Trouble",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27u4kw/pakistan_the_council_of_islamic_ideology_cii/",
        "text": "",
        "created_utc": 1402447585,
        "upvote_ratio": ""
    },
    {
        "title": "After taking flak for days from Western governments, U.N. human rights officials and others over the sentencing to death of a pregnant mother convicted of apostasy, the Islamist government in Khartoum on Wednesday gave its reaction: “respect the laws and legislations of Sudan.”",
        "author": "BurgersAndBangers",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27tw2d/after_taking_flak_for_days_from_western/",
        "text": "Meriam Ibrahim is set to be executed by the Islamist Sudanese government on the grounds of apostasy, that is leaving Islam. The Sudanese government's response is for the rest of the world to respect their laws. Here is a link to the article about it:\n\n* http://cnsnews.com/news/article/patrick-goodenough/apostasy-death-sentence-khartoum-tells-protesting-countries-respect\n\n\n\nIn many Islamic countries the concept of individual human rights are foreign. Many things that we as Westerners consider as human rights, such a free speech and the right to choose or leave your religion, is considered against Islam. How do we go about communicating to the muslim world that human rights are universal and independent of whatever the quran and the hadiths teach? How do we communicate that the right to leave one's religion is as much of a fundamental right as any other?",
        "created_utc": 1402442036,
        "upvote_ratio": ""
    },
    {
        "title": "I'd like to see an Intelligent Design debate. Not a debate on evolution, but one on ID.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27tmg3/id_like_to_see_an_intelligent_design_debate_not_a/",
        "text": "After looking at a few evolution debates (Nye/Ham, Dawkins/whoever), I've noticed something. Every debate between a scientist and a creationist takes the same format of the scientist attempting to prove to the creationist, and by extension the audience, that evolution is true, while the creationist does his best to disprove evolution.\n\nMultiple authors of atheist and scientist books have bemoaned the fact that a god or creator is always accepted as the \"default\" position to which evolution must prove itself a viable alternative, so why haven't we seen a debate that tackles, head-on, this notion?\n\nSpecifically, what I want to see is **a debate wherein the creationist or ID proponent must, scientifically, defend that hypothesis.**\n\nBefore going on, let me point out that \"well if they're defending God then no science is going to be sufficient\" is not an answer, because these debates are always at least framed in explicitly scientific terms. I have never seen a respectable ID debate in which party A just reads Bible verses, so cast that aside.\n\nIt's also worth noting that, strictly speaking, ID and evolution are not opponents, but rather natural selection and ID, but forgive me the convention of just saying evolution.\n\nWhat I would love is for two scientists to meet to debate evolution/ID, and for the evolutionary scientist to not spend a single minute on the defensive, but rather the opposite. Ask simple questions, such as:\n\n- Where does the designer/creator exist in the universe? How did you determine this?\n\n- By what means does he design a species?\n\n- By what means was the designer able to \"construct\" a species?\n\n- When a species is designed, how are they placed here on earth?\n\n- Can you theoretically replicate the design/construction process in a laboratory setting?\n\n- Is it possible to directly observe the guiding hand of the designer? If not, why not?\n\n- Does the creator/designer leave any physical traces of his presence upon this planet when depositing a new species or affecting the development of one? If not, why not?\n\n- Is the designer able to make radical leaps in evolution, or is he limited in some way by genetics?\n\n- Without resorting to any religious terminology, explain how the designer came into existence. \n\nAnd so forth. These are just off the top of my head, but I found myself wondering all of that when reading through ID defenses that they're all quasi mystical with no explanations for anything beyond the personal inability to believe that this or that happened without some kind of intervention. \n\nIf that's the case, then it's simple: *explain how that works*. They want to call it a theory, so defend it like a theory. Lay it all out. Rather than saying why such and such *must* have been designed, let's assume that to be true. Start with the supposition that the designer exists. Now move forward and explain the mechanisms by which ID actually operates.\n\nHas this happened before and I missed it? I've read literature by Merritt and Behe but they never get into that, merely explaining why it would be impossible for natural selection to have been the cause, not why and how ID was. ",
        "created_utc": 1402436067,
        "upvote_ratio": ""
    },
    {
        "title": "[META] Noticing torrent of downvotes for the religious...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27te5q/meta_noticing_torrent_of_downvotes_for_the/",
        "text": "I'm noticing a disturbing trend when a christian or other religiously affiliated person comes here asking questions.  WAY too often their replies to our answers or follow up questions are down voted.  WE MUST STOP DOING THIS.  It is completely counterintuitive to the discourse we are supposed to be having here.  If it were up to me, there would be no down vote button in this subreddit.  We can't scare these people off, we need to educate them in a fair manner.  So guys, stop acting like seeing their answers/questions/challenges is going to make them more valid...we already know they aren't.\n\n\nEdit:  The overwhelming response is that people down vote idiotic notions, outright lies, logical fallacies, etc.  I see what you're saying.  But the point of the down vote button is for comments that are not conducive to the conversation.  Someone making a mistake shouldn't be down voted, they should be corrected.  Seriously, this is /r/TrueAtheism , we aren't going to get a bunch of theistic nonsense up voted above our rational responses.  Down voting does not help whether the comment is inane or otherwise.  Of course, down vote the trolls to oblivion.  \n\nSecond Edit:  Wow.  The response has been overwhelmingly disheartening.  I came here over a year ago because I thought it was a place where actual, meaningful conversation happened in regard to atheism and the issues surrounding it.  I don't care for even a moment that something someone says is \"stupid\" or \"idiotic\"  If they're honestly trying to understand our view points (which I assume most are just by coming here) the least we can do is EXPLAIN instead of ignore...or worse yet, get rid of.",
        "created_utc": 1402431320,
        "upvote_ratio": ""
    },
    {
        "title": "The desire to be persecuted.",
        "author": "Mrmaybesomething9",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27t9ix/the_desire_to_be_persecuted/",
        "text": "When I was a Christian I thought I was persecuted by a growing atheist movement. Now that I am an atheist I feel I am pursecuted by an already large Christian movement. I think I rather like the idea of being fought against. It makes me feel far better than to think I am in a position of privilege. There is nothing impressive about that. \n\nAnd I think most other people feel the same way. \n\nThoughts? ",
        "created_utc": 1402428850,
        "upvote_ratio": ""
    },
    {
        "title": "How uncomfortable are you in religious settings? If everyone's praying at the table, is it compulsory that you \"pray,\" too?",
        "author": "h0neybadgerdontcare",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27sy1q/how_uncomfortable_are_you_in_religious_settings/",
        "text": "I'm a secular Jew, so I never grew up with prayer, and I'm pretty unfamiliar with daily Christian practices. I was at a social gathering the other day where the guests circled around a table, held hands and prayed. Because my boyfriend and I were invited over, we joined them. He didn't know at the time that I get ridiculously uncomfortable in religious situations (I'm only slightly more comfortable in religious Jewish settings, depending on what's happening), but that's besides the point.\n\nIf everyone's praying, do you join in, or do you vocally opt out? For me, I would rather opt out, but I'm afraid of sounding rude.",
        "created_utc": 1402422541,
        "upvote_ratio": ""
    },
    {
        "title": "So am I an asshole for this?",
        "author": "SecretWalrus",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27smb0/so_am_i_an_asshole_for_this/",
        "text": "Alright so last night there were some storms near where I live, one of my friends posted on Facebook something to the effect of \n\n\"Storms here, Lord keep us safe\" or something like that. \n\nAbout five minutes later they posted again\n\n\"Our power just went out.\" \n\nso I replied, \"Huh, you should have prayed your power would say on.\" \n\nWell now a friend of mine (who is an atheist) is saying that my reply was an asshole reply and completely uncalled for. To me it was a joke, but meant to point out the obvious. \n\nSo what do you guys think, was what I did an asshole thing to do? If so please explain why. ",
        "created_utc": 1402415950,
        "upvote_ratio": ""
    },
    {
        "title": "if I don't believe in their God",
        "author": "duckmanjoel",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27sgsr/if_i_dont_believe_in_their_god/",
        "text": "I think it is so sad when I read about people giving up their faith because they were forced to choose between science and the definition of God they were feed as a child. I read Darwin's Origin of Species in middle school almost 40 years ago and was hooked. And being raised in the south, I know the experience of being surrounded by ignorance. But I loved God and the experience of being connected spiritually. Then one day when the minister of the Baptist church my wife and I attended said that if you don't believe in literal 7 day week of creation, \"you need to find another boat to float in\". I  did find another boat. I now attend the United Methodist Church with an \"Open heart, open mind, open door\". As the Bible states, \"God is Love\". The UMC works to keep creationism OUT of the schools. If ever there was a church for the scientific minded, this is the place. Theology is theology and science is science. It is that simple. Google United Methodist Church on Science and I think you will be surprised. I once heard a person who called a radio talk show telling the programer that a UMC person sounds like atheist. I took that as a compliment.  ",
        "created_utc": 1402412623,
        "upvote_ratio": ""
    },
    {
        "title": "I have questions, as a Christian, that I'd like to ask others.",
        "author": "Migueeeeel",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27rzxw/i_have_questions_as_a_christian_that_id_like_to/",
        "text": "Okay, so I found this subreddit by just going from page to page and I'd like to ask some questions.  \n\nI apologize in advance if I may seem ignorant, but by no means am I trying to be rude. As a person who was raised from birth in a very Christian home &amp;amp;amp; lifestyle (attending a Seventh Day Adventist school, going to church etc), what brought you to Atheism? Do the majority of you believe in the Big Bang Theory? Does not believing in other (lack of a better word) creation theories require faith as well? How do you feel when an Atheist argues with a Creationist? \n\nAgain, I'd like to reinforce that I am not trying to be rude or ignorant, I've always had questions I'd want to ask Atheists.\n\nEDIT: Sorry, but I'm no longer going to reply to these comments for a while. I didn't post this for my views to be criticised, and that's exactly how I feel right now. \n\nEdit 2: I've had time to clear my mind, and I'm ready to have a discussion with some open minded people.",
        "created_utc": 1402398632,
        "upvote_ratio": ""
    },
    {
        "title": "My personal philosophy of the Christian religion.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27rwpx/my_personal_philosophy_of_the_christian_religion/",
        "text": "in a time where Paganism, Celtic beliefs and Roman, Greek and Egyptian polytheistic religions were common place Christianity set itself apart with an idea of monotheism. Taking away the theism of Christianity I see the religion as nothing more then a new product in a comptaive market that needs to set itself apart. No matter how you look at it the life blood of any religion is people, without followers there is no religion, so with that logic it stands to reason if you put aside the glits and glam that religions offer you the main objective is recruiting, second only to keeping thoes recruits amid a world of other religions attempting to do the same. tackling the first issue, getting followers. Ok so how do you convince people who have lived their entire life believeing one thing to believe you? easy, offer something better. with the introduction of one almighty, all pure and good God who offers you an eternity of bliss and salvation for merely worshiping him and believing only him with the small price of just following what he has to say you would be crazy NOT to convert. but then comes along the second problem, you have the people interested but now you need to seal the deal, how do you keep them coming back for more AND with more of their friends? Well they found something that worked better than anyone could have thought. with the introduction of Satan. Once you entice potential believers with eternal happiness what better way to make them stay by throwing in an antagonist who is the definition of evil, this evil is invisible and tried to take eternal bliss from you, but your in luck! we have these very simple 10 things for you to follow and if you dont stray from these 10 rules and you believe only in this God, eternal bliss is yours to keep. well hey, what if I dont want to follow your rules and just go back to what i knew before? that was covered to because of course your always more than welcome to turn from God, but to knowingly do so means you will suffer eternal pain and sorrow in Hell with Satan, oh and that also happens if your any other religion besides this one. and you guessed it, break one of the 10 rules and off you go to the pits of hell, but with the glimmer of hope God gives you to atone for your wrong doings you still have a shot. if you then add in witnesses and personal accounts of the validity of all this you have a belief that allows itself to be the only option while creating the illution of other choices.  ",
        "created_utc": 1402394602,
        "upvote_ratio": ""
    },
    {
        "title": "Ancient Religions were Created to Control Ancient People - Any Evidence of This?",
        "author": "General_Specific",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27rdie/ancient_religions_were_created_to_control_ancient/",
        "text": "Growing up Catholic, it always appeared to me that the original religions were created to control and rule the teeming masses. Paganism seems like a convenient way to teach ignorant populace when to plant/sow. Catholicism steps things up when they took over the governance of the people when the Roman Empire fell. They even incorporated pagan festivals so the crowd could still conduct their lives once converted.\n\n\nWhile this all seems so obvious to me, is there any proof that this ever happened? (Excluding L. Ron Hubbard and Joseph Smith) Is there any ancient documentation of early religions setting up their \"system\" in order to rule the world?\n\nPerhaps these are in the Vatican Archive.",
        "created_utc": 1402373614,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism not needed for a life of greater value/pleasure",
        "author": "MozartLink",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27rcl0/atheism_not_needed_for_a_life_of_greater/",
        "text": "I'm an atheist with the mentality of a religious person who seeks self-enlightenment and even though a positive perspective can be achieved through atheism, some people are better off with their positive perception of religion.  Atheism recognizes the reality of situations (in this case, there being no God and no afterlife).  Even though it is good to recognize the reality of a situation in most cases, this is not always the case.  In situations where not recognizing the reality of a situation does no harm to you or anyone else and brings you personal pleasure, then recognizing the reality of the situation is pointless. In other words, since believing in God and such would do me no harm and wouldn't make me harm others and would bring me personal pleasure in life, it would be pointless for me to be an atheist that I am now.\n\nThe more pleasure you have and the less depression you have in life, the stronger the pleasure circuits in your brain will be and the weaker the depression circuit will be. Therefore, if you use delusion in escaping stressors of life (in this case, belief in religion), this would be a good thing because the comfort and such that you get from these delusions strengthens the pleasure circuitry in the brain and keeps the stress circuitry weak which is what would later give you a good chance of eventually facing and overcoming a stressor in life that can't be escaped from using delusion. Since obviously it's a scientific fact that pleasure overcomes depression and the more pleasure you have (positive outlook on life), the more you will be able to overcome and prevent depression.\n\nWhen you face a stressor in life without having any delusion to escape from it, the situation in terms of emotional well-being would be the same as having such a delusion in the sense that you are still using a positive outlook in combating the stressor. For example, a positive outlook you would use in combating the obvious stressor of not having a good life if you are religious is that when you die, you will have an afterlife of eternal joy. And if you are an atheist, a positive outlook you would use in combating this stressor would be making the best of the good things you have in this one and only life. Both of these situations are the same in the sense that they both use a positive outlook in combating life's stressors. One may be an escape while the other is facing the problem, but they are both the same in the sense that they ease and perhaps rid of the depression and give you a chance of overcoming other stressors in life.\n\nBut what would determine which of these perceptions would be better and give a life of greater pleasure and stress coping to a specific individual depends on how this individual's mind is wired. If this person's mind is wired in such a way that a perception of religion offers him/her a greater life of pleasure and stress coping than any such atheist perception could ever achieve, then believing in religion would be the best thing for this person. Which is why I say here that I am at a great disadvantage being an atheist since my mind is wired to achieve the best life of pleasure and stress coping through belief in religion.\n\nIf, for example, knowing that there is no God and no afterlife is your stressor because you feel that it makes your life inferior and hopeless and that you deserve these things, then it would be of benefit to believe in religion and there would be no benefit whatsoever in facing the stressor itself through atheism (since this is something mental and not an actual situation that needs to be addressed such as a situation that actually endangers your life, and there would be no difference in facing this stressor as opposed to using delusion to escape this stressor because, again, both of these situations are the same in the sense that they both use a positive outlook in combating this stressor. One may be an escape while the other is facing the problem, but they are both the same in the sense that they ease and perhaps rid of the stress). Therefore, in this case, it would be good to just eliminate the stress itself through any positive perception and not have to face this source of stress. As for being poorly immunized to hardship because you are not facing stressors in life, I do not believe this to be the case because, for example, if you wish to have a good immune system to things such as the cold, what you would have to do is make sure you exercise and eat right and such (not keep on experiencing these ailments). Therefore, this would also be the case for this situation as well because if you wish to be immune to stress, then you would make sure you experience all the pleasure you can and experience as less stress as possible.\n\nSome atheists might think that if you don't need to work for your pleasure through having struggles in life, then life is unfulfilling and the pleasure is meaningless and that there being a God and afterlife makes this life less valuable. But this all depends on the person. Many people (such as myself) would find that a life of perfect pleasure with no struggles is a completely fulfilling life and that these struggles are pointless and that no positive value whatsoever can be deemed from them as well as that there being a God and afterlife actually makes this life better than a life without these things just in the sense of being brought pleasure/value and through that pleasure and value making the best of this life (better than what atheism would accomplish for me as well as others like me).\n\nNow if you had the choice, would you be a person who is a genius and has absolutely no pleasure in life (as in literally no pleasure center at all), or would you be someone who is retarded and has all the pleasure in the world? I doubt any human being would choose the first option which obviously says that pleasure is the most important thing above having knowledge because if we just had knowledge without emotions, we would be nothing more than logical machines (this also applies to actual things we do in life because without pleasure, then these things themselves have no value).  And if you were to somehow think that having a balance of pleasure and knowledge is better than having all the pleasure in the world with no knowledge, the fact of the matter is that based on the argument I just made, pleasure is still the most important thing than any amount of knowledge no matter how you try to justify otherwise. Knowledge may be useful in helping others, but going out of your way in helping others is something you are free to do--you are not expected to do so and a way of life in helping others is not better than a way of life in experiencing personal pleasure and not going out of your way and helping others because to think so is a moral, and morals are not logic (fact), they are false and irrational. Therefore, you can experience all the pleasure you want without going out of your way in helping others and that would not make your attitude bad at all. In the case of you wanting to help others though, just simply recognizing the reality of the situation of those who need help would be necessary. But as for not recognizing the reality of the situation of there being no God and no afterlife, it would be unnecessary to recognize the reality of that situation as there is no need. \n\nNow I have come up with 2 more reasonings against atheism offering a better life of pleasure than religion.  Although these 2 reasonings do contradict one another, I'm going to present them here as individual reasonings:\n\nReasoning #1:  As I stated before that there are in fact things in life that recognizing the reality of the situation is either pointless or actually does much more harm than good, I am proof of this because I would have, in fact, lived a life of greater pleasure and stress coping if I still believed in religion and me being an atheist has brought me no such things. As for the concept that anyone can change and that I can change my attitude, you cannot always completely change your attitude (for many they can only change their attitude up to a certain degree while still living their lives filled with negativity). I feel that I could definitely be one of these people because if your mind has been wired a certain way your entire life (which would be my case as I have lived a positive life through my perception of fantasy and believing in religion), then completely rewiring your brain to live a positive life through atheism just might be an impossible goal. Therefore, you would of been better off believing religion in this case.\n\nReasoning #2: A reasoning in support of atheism might be that it would be a good idea for someone who believes in religion to convert over to atheism because the more pleasure you recieve from this belief, the more your life will be filled with negativity when you realize it's not true and that the sooner they convert over to atheism, the better (since the more pleasure and comfort you obtain from using delusion to escape life's problems, the worse the depression response to that problem would be when you realize that these delusions are not real). But I ask, why would living a life of pleasure (no matter what it is) make you more suspectible to negative emotions? If anything, it should make you more immune to depression because, again, the more pleasure you have (positive outlook on life), the better you are able to overcome depression. Please explain this in terms of science.\n\nIn conclusion, this universe might portray the message to atheists that we are nothing special and have no grand special purpose, but we are the ones who are special and this universe is what's not special only in the sense that it has given us no grand special purpose for us. We already deem ourselves special in the sense that we experience love and such. Therefore, since we are obviously already special, we should be living in a universe that \"views\" us as special by giving us things that a universe that \"views\" us as special would give us such as a life of perfection and perfect joy with immortality.  But, of course, that's not the case and we just have to make the best of life as it is.\n",
        "created_utc": 1402372927,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel when other atheists decry religions in public?",
        "author": "ratatatar",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27qhlp/how_do_you_feel_when_other_atheists_decry/",
        "text": "I've been in the position a few times where someone unexpectedly goes off on a tangent (usually loudly and in public) about how ridiculous religions are and how annoying/silly/dumb/etc. religious people are.\n\nHow do you react?  The rants range from justifiable angst to disrespectful hyperbole.  I usually don't fuel them and just remain silent because I'm uncomfortable (empathetic to those who do believe and how they might feel in that situation) but I usually agree with everything they're saying.\n\nFurther, I've heard the argument that one is almost obligated to be vocal against organized religions due to their transgressions against the non-religious as well as other religions and even their own followers.  It feels like maybe this is the difference between /r/atheism and /r/trueatheism but it's probably more complicated than that.\n\nHave any of you experienced situations like this?  How did/do you handle it?",
        "created_utc": 1402352162,
        "upvote_ratio": ""
    },
    {
        "title": "Doing some research: What are some powerful similes that are used to convince people to believe something as truth.",
        "author": "akorn123",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27qgmu/doing_some_research_what_are_some_powerful/",
        "text": "i.e. \"The Devil is a big game fisherman. He only goes for the big fish. If you feel Satan's heat on your heels, it might be because you are doing something right.\"",
        "created_utc": 1402351569,
        "upvote_ratio": ""
    },
    {
        "title": "Evangelical Theist Father vs Agnostic/Atheist Son",
        "author": "czah7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27q4qw/evangelical_theist_father_vs_agnosticatheist_son/",
        "text": "Please skim this debate document and critique.\nhttps://googledrive.com/host/0B6E6Za3m4m2VRTZURVk3ZUdEUVE\n\nI am having a small debate with my family.  So this is not some official university thing.  Rough draft.\n\nI am just looking to see if anyone is willing to read this for a few minutes and give me any ideas to change wording, add points, remove points, etc.  Please do not comment about how worthwhile this debate might be or how delusional people are so I'm wasting my time, etc. =)\n\n(posted to /r/Atheism too)\n\nEDIT:  Just wanted to say that my father does have a logical and scientific mindset.  He has just had what he thinks are personal experiences that prove Gods existence.  He also believes there may be a conspiracy within science that tries to silence anything that refutes old earth and evolution.(I.E. soft tissue in some dinosaur fossils)",
        "created_utc": 1402344745,
        "upvote_ratio": ""
    },
    {
        "title": "Giovanni Ribisi on the WTF Podcast with Marc Maron - questions about the Church of Scientology",
        "author": "Blechhotsauce",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27q3ii/giovanni_ribisi_on_the_wtf_podcast_with_marc/",
        "text": "This week, actor Giovanni Ribisi was on the [WTF Podcast](http://www.wtfpod.com/podcast/episodes/episode_504_-_giovanni_ribisi) and Maron asked him about Scientology. And he had some interesting things to say about popular myths surrounding the church, and I was wondering if we could sort through what he said.\n\nFor one, Ribisi said that he \"has never heard anything about aliens in Scientology.\" I think people make fun of Scientology a lot for being created by a scifi author and there are references to Xenu and the Galactic Confederacy and all that. So is Ribisi just full of shit or what?\n\nRibisi also said that \"Thetans\" just comes from \"theta\" so it's another word for \"spirit.\" I simply don't know enough to comment.\n\nThe last thing I noticed was the way Ribisi talked about the \"classes\" you can take; he kept referring to them as courses like you'd take at college so you can learn things and improve yourself. But most importantly, he said you choose which courses to take, so you decide your own involvement in the Church. And that makes sense on the surface, but I think we've been hearing about people trying to leave the Church and they get hunted down and sent away to secret scientology camps for reprogramming. So what level or garbage is this?\n\nI'm mostly looking for links that have first-hand experiences from people that left the Church that could elucidate some of these issues. I wish Maron would have pressed him a bit more on the law suits and the shady stuff we hear about. Thoughts?",
        "created_utc": 1402344102,
        "upvote_ratio": ""
    },
    {
        "title": "Those with children or young niblings, what do you tell them w/r/t religion?",
        "author": "Oh_pizza_Fag",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27q2hc/those_with_children_or_young_niblings_what_do_you/",
        "text": "Do you bash religion? Point out inconsistencies? Foster their development into an atheist?\n",
        "created_utc": 1402343556,
        "upvote_ratio": ""
    },
    {
        "title": "How often does your atheism get brought up and how has it affected your interpersonal relationships?",
        "author": "NEET_Here",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27pfpu/how_often_does_your_atheism_get_brought_up_and/",
        "text": "I'm 24 now and I remember when I was 18 I was just coming to the realization that I was an atheist. At that point in my life I had the thought that everyone should know about these arguments and how little it makes sense to believe in the supernatural. I had always been an atheist and just blended in with my family/church, I just didn't know the word for it, nor didn't care. \n\nAfter I had enough knowledge on the topic of philosophy and theism, I was eager to bring it up to my best friend. My best friend was the same way I was before I started reading about philosophy, except leaning towards the spiritual/religious. So, I brought it up and within a few minutes he said he didn't want to talk about it, and that was that. I never brought it up again.\n\nThat's when I came to the realization that not everyone thinks the same way that I do. Not everyone cares about logic and reason. Everyone has their own reason for their beliefs, and for some it's a really personal subject. We're still best friends, we just never talk about those things in terms of having a discussion about it.  \n\nEveryone in my family knows I'm an atheist now and once in a while we have a discussion about God or they tell me I should go to church. I respond by telling them that that's like asking them not to go to church. Most of their arguments are based on emotion and I generally listen with an open mind, but I always remind them that their arguments aren't limited to Christianity and that people all over the world have spiritual experiences, including atheists. It is fun having the discussions though.\n\nOther than that though, my day to day life with my friends and family hasn't actually changed due to my atheism. Maybe because I'm from Southern California. ",
        "created_utc": 1402330503,
        "upvote_ratio": ""
    },
    {
        "title": "Is Atheism Faith-based in the Same Way Religion Is?",
        "author": "Kracka914",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27pf4z/is_atheism_faithbased_in_the_same_way_religion_is/",
        "text": "Hello, fellow atheists. After running into the accusation that atheism requires just as much faith as religion I decided a rebuttal was in order. Hopefully some of you will find this helpful! A link to the article is below. Thoughts are appreciated, as always! \n\nhttp://37g.tv/main/2014/6/8/is-atheism-faith-based-in-the-way-religion-is",
        "created_utc": 1402330151,
        "upvote_ratio": ""
    },
    {
        "title": "As an atheist, are there any bible verses you like anyway?",
        "author": "SpitSalute",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27pbj1/as_an_atheist_are_there_any_bible_verses_you_like/",
        "text": "I read an article on Alternet about certain bible verses that Atheists enjoy and I was wondering about how many people like some of the verses contained in the bible and how many people discourage the book entirely?",
        "created_utc": 1402327983,
        "upvote_ratio": ""
    },
    {
        "title": "Bible Versus That Atheists Love",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27p1uh/bible_versus_that_atheists_love/",
        "text": "",
        "created_utc": 1402321366,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we use moral arguments to support atheism?",
        "author": "ThePhantom24601",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27ngch/why_do_we_use_moral_arguments_to_support_atheism/",
        "text": "\"God is an asshole\" isn't an argument for atheism. It's an argument for theistic satanism (at least in the view of Christianity) \n\nI find a lot of atheists are very fond of the argument that god's anti-homosexual stance and anti-woman stance make religion wrong. \n\nThat makes it anti-homosexual and anti-woman, not factually wrong in and of itself. Supporting atheists and arguing like a theist afterwards seems rather flawed. Atheism isn't a unified front, for sure, but arguing one minute that we must research and approach with scientific rigor and then turning around to say that god supporting genocide makes him not real is incredibly hypocritical.\n\nIf ever you've wondered why some theists say \"we're rebelling against god\", keep in mind that some atheists really ARE. They get convinced that because god is anti-woman or anti-homosexual he can't be real, and they keep arguing with that and that alone. \n\nI posted this after reading a thread mentioning how to change a moral approach towards arguing the atrocities in the bible and wondering \"why does it really matter\".\n\nSo what do you guys think, should we as a community try to drop the moralistic arguments entirely or do they serve a purpose that helps support factual arguments? ",
        "created_utc": 1402267471,
        "upvote_ratio": ""
    },
    {
        "title": "Mom thinks the entire reason I'm atheist is because I'm selfish.",
        "author": "TheDiabeetusKing",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27ndsa/mom_thinks_the_entire_reason_im_atheist_is/",
        "text": "I was recently talking to my mom (baptist, very fundamentalist) about why I was atheist. I had prepared arguments and such, and was prepared for a legitimate discussion. I didn't exactly get that. \n\nShe got heated almost immediately, telling me that the only reason I'm atheist is so that my life can be, and I quote, \"Grant, Grant, Grant, Grant, Grant, and then you die.\" Grant being my name. She said that the only reason I rejected religion was because it was a two way street in which I had to give. \n\nI was somewhat confused, but told her that's not how I feel at all, and that there wasn't a need to attack me directly instead of talking about the issue at hand. Ad hominem, I know, but I don't want to sound like a smartass. \n\nAnyways, all I really want are any ideas as to how to explain to her that this isn't the case at all. I attempted to explain my reasoning for being atheist, and how it was just my own personal choice, and she repeated what she had said earlier. Besides pointing out that her argument has a flawed, and incorrect, premise, is there anything else I could do to try and make her understand that I'm certainly not changing my belief system in order to be selfish?\n\nThank you all for you help.",
        "created_utc": 1402265731,
        "upvote_ratio": ""
    },
    {
        "title": "Religious parents forcing me to go to their church in the morning and evening, is there anything I could do?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27mst8/religious_parents_forcing_me_to_go_to_their/",
        "text": "I know they probably think it's best for me and all but I feel like such a hypocrite when I'm doing all the rituals and stuff, and people stare at me if I get my phone out. My time could be used much better doing other things. I'm only 17 though, so I'm still a minor and living at my parents' house. On the way home from church today I tried to talk with them about this and they got all heated and wouldn't listen to me, they just said going to church is what I have to do. I'm almost in tears now (so sorry if this is incoherent at all) because she told me that I'm going to burn in hell and she really wishes I wouldn't, it makes me want to pretend to be Christian just to make them happy and not depressed, no matter how deceptive and intellectually dishonest that would be :(",
        "created_utc": 1402251111,
        "upvote_ratio": ""
    },
    {
        "title": "The moral argument that I think should be pushed (to anti-gay, anti-abortion, etc... Advocates)",
        "author": "Mrmaybesomething9",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27miil/the_moral_argument_that_i_think_should_be_pushed/",
        "text": "When you ask a Christian to justify the atrocities in the Bible, the most typical response is to say it was a different time and different responses were necessary to handle the problems of the day. \n\nBut if we make that the case, why not bring every moral in the Bible into question? The entire book was written during that harsher time. We have decided genocide isn't moral in today's society, why not gay basing? The point being if you can't trust a single moral in the Bible, why should you trust any? We should decide what is good for right now. \n\nI realize this isn't news to anyone here, but I rarely hear the argument take this form. Usually the atheist simply bashes something that happend in the Bible and that's the end of it. ",
        "created_utc": 1402243544,
        "upvote_ratio": ""
    },
    {
        "title": "Does atheism preclude an afterlife? Is there any literature or other material you would recommend about atheism, and the possibility of an afterlife?",
        "author": "Kiwispam84",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27m97j/does_atheism_preclude_an_afterlife_is_there_any/",
        "text": "I realize there is no scientific proof of an afterlife, but is there any serious scientific discussion worth mentioning, for or against the possibility?",
        "created_utc": 1402235845,
        "upvote_ratio": ""
    },
    {
        "title": "D-Day Commemorations",
        "author": "Rutherglen",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27m3mr/dday_commemorations/",
        "text": "I watched some of the news on the BBC regarding the D-day commemorations and as usual with this sort of thing it was totally (I mean totally) taken over by a bunch of plummy mouthed vicars and ministers -mostly church of England it seemed. \n\nI suspect the veterans associations were consulted about what form the occasion was to take but what about atheists/agnostic ex-service men (to say nothing of muslims, hindus, jews etc who also took part)who may have felt uncomfortable at attending such a religious fest--especially when there will not be any more given the ages of the men.\n",
        "created_utc": 1402229251,
        "upvote_ratio": ""
    },
    {
        "title": "Islamic prayers to be held at the Vatican",
        "author": "Treisio",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27lj3t/islamic_prayers_to_be_held_at_the_vatican/",
        "text": "I don't know what to think of this. Is the Catholic Church trying to reshape their image into \"humanity's parents\"? Should this be celebrated or passed off as a PR move? \n\nhttp://english.alarabiya.net/en/News/middle-east/2014/06/06/Islamic-prayers-to-be-held-at-the-Vatican.html",
        "created_utc": 1402201086,
        "upvote_ratio": ""
    },
    {
        "title": "Really, this sub?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27l8p2/really_this_sub/",
        "text": "",
        "created_utc": 1402191970,
        "upvote_ratio": ""
    },
    {
        "title": "Pope to Muslims: People Have 'Freedom to Choose Religion One Judges to be True' - During his first official visit to the Middle East, Pope Francis repeatedly told Muslim audiences that religious freedom is “a fundamental human right” and that governments must allow people to choose their own faith.",
        "author": "UpAndWest",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27l3md/pope_to_muslims_people_have_freedom_to_choose/",
        "text": "I came across these recent statements by the pope, that people should have the freedom to choose their religion.\n\n* http://cnsnews.com/news/article/barbara-hollingsworth/pope-muslims-people-have-freedom-choose-religion-one-judges-be\n\nWhat is interesting is that in making such a statement such logic would also extend to Christianity, the pope must be aware of this. Given that the pope has expressed positive opinions about atheist, saying that they can also be good people, does this mean that the church is continuing to secularize? Have decades of attacks by us on church institutions to reform their stances finally working? Will the Muslim community finally listen to the rest of the world to also follow suit and secularize? Will the Muslim community stop criminalizing vocal apostasy (leaving one's religion)?",
        "created_utc": 1402187668,
        "upvote_ratio": ""
    },
    {
        "title": "My religious mother posed a challenge to me today",
        "author": "cynist3r",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27ktyk/my_religious_mother_posed_a_challenge_to_me_today/",
        "text": "I've been out as an atheist for a few years now. She wants me to watch God's Not Dead with an open mind.  There wasn't a single argument in the trailer that I hadn't heard before, so I'll just have to slog through it.  I'm not expecting much.\n\nIn return, I get to show her whatever I want that deals with atheism. I want to challenge her as much as possible. Appeals to reason don't really affect her as far as I have seen. Her main reason for believing is she finds it comforting to know that there is life after death. I suppose it is fair to say that she fears death.\n\nI know that personally, I don't fear becoming nothing after I die. It is just the way of things. It is hard for me to express this in the form of a convincing argument, however.  Is there any good atheism material out there that deals with this subject matter?\n\nEDIT:  Thanks for all the advice everyone!  I actually checked out Sam Harris' Death and the Present Moment and it seems to perfectly fit my situation.  I will definitely show this to her so that she might be able to better understand my viewpoint.",
        "created_utc": 1402179851,
        "upvote_ratio": ""
    },
    {
        "title": "When someone's proposition of God is immaterial, unfalsifiable, etc, asking \"where's the evidence\" is pretty much talking past the person.",
        "author": "DesertTortoiseSex",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27j2wx/when_someones_proposition_of_god_is_immaterial/",
        "text": "Like I see this all the time. It doesn't particularly matter whether or not you think it's a reasonable proposition - if you want to have any kind of worthwhile conversation about that sort of belief it has to deal with ontology and epistemology, not physical evidence. \n\n",
        "created_utc": 1402117514,
        "upvote_ratio": ""
    },
    {
        "title": "[Saudi] Deputy Foreign Minister Prince Abdul Aziz bin Abdullah on Wednesday called for tough action by governments against those who misuse freedom of expression to attack divine religions and Prophets.",
        "author": "Banana_Trouble",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27ijg1/saudi_deputy_foreign_minister_prince_abdul_aziz/",
        "text": "The Saudi Deputy Foreign Minister Prince Abdul Aziz bin Abdullah is calling for tough action by governments against those who misuse freedom of expression to attack divine religions and Prophets. Here is a link to the article:\n\n* http://www.arabnews.com/news/578571\n\nThis brings up an interesting question since the situation is complicated, at what point to we in the West begin to assert to our \"allies\" that freedom of expression is a non-negotiable right? The situation is further complicated because of how dependent some Western governments are on Saudi oil and natural gas. Countries like Germany, which do have blasphemy laws on the books, might be tempted to enforce those laws to appease their oil suppliers.",
        "created_utc": 1402100723,
        "upvote_ratio": ""
    },
    {
        "title": "Conflict Between Sikh Sects at India's Golden Temple",
        "author": "FirstTimeWang",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27hvow/conflict_between_sikh_sects_at_indias_golden/",
        "text": "",
        "created_utc": 1402084604,
        "upvote_ratio": ""
    },
    {
        "title": "Torn on telling my family",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27htwl/torn_on_telling_my_family/",
        "text": "I'm in my mid-30s and it's been a very long time since I've been to a church for anything other than a wedding or a funeral but I'm pretty sure my family doesn't have any inkling that I am a non-believer even though I don't go out of my way to make them think that I do believe. My parents are divorced, and have been for 30 years, but they are both fairly religious though I'd say my mother far more than my father. Out of anyone, I feel like I could tell my dad.\n\nReally though, the biggest fear I have is killing the only grandfather I have left by letting out my true feelings. I've held this in for nearly 20 years. My wife does know how I feel and she's fine with it even though it doesn't jive with her beliefs.\n\nI even  have atheism books plainly sitting in my book case at home but I can nearly promise none of my family has taken the effort to look at my book case or this would've been way out in the open years ago.",
        "created_utc": 1402083512,
        "upvote_ratio": ""
    },
    {
        "title": "Young Earth explanations of extinct humanoid variations?",
        "author": "Brodivh",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27hgrr/young_earth_explanations_of_extinct_humanoid/",
        "text": "I realized I've never seen Young Earth / Non-Evolution explanations for why variations of our human evolutionary relatives existed. Has anyone come across anything that resembles an actual attempt at explanation?",
        "created_utc": 1402075632,
        "upvote_ratio": ""
    },
    {
        "title": "Should Atheists Attend Church Functions to Appease Family and Friends?",
        "author": "chimp_my_ride",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27hbpa/should_atheists_attend_church_functions_to/",
        "text": "This morning Godless in Dixie [posted a response](http://godlessindixie.com/2014/06/06/should-atheists-attend-church-functions-to-please-family-and-friends/) to this question sent in from a reader.  It's a thorny issue.  Are any of you in a situation like this?  What do you do?  How do you respond to solicitations of this kind?",
        "created_utc": 1402072511,
        "upvote_ratio": ""
    },
    {
        "title": "Would love your thoughts on this article and video \"Catholics Speak Out About Their Homosexuality",
        "author": "Dmac680chi",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27hbj3/would_love_your_thoughts_on_this_article_and/",
        "text": "A friend of mine posted [this](http://www.catholicvote.org/catholics-speak-out-about-their-homosexuality) article on Facebook and I am not sure how I feel. Of course the article is from Catholic Vote.org so it definitely has a spin to it. \n\nIn the post, he wrote \"For everyone who struggles with same-sex attraction or homosexuality, this sums up the Church's actual teachings on the issue. I'm sorry for any poor language or bullying I have done, and I welcome you into the Church as my brother or sister.\"\n\nWould love people's thoughts on this. \n\nI responded with the following comment: \n\nInteresting video. As the years go by I think it will be interesting to see whether the church will be forced to change their views on homosexuality. What I do like is the guy who talked about not to refer to people as being \"fags\" and to cease bullying. A lot of people including myself don't truly know about the teachings of homosexuality within the church. We hear many things from the media which might be either true or not true. Regardless of one's position towards it, being able to understand this side of the issue I feel is still important.\n ",
        "created_utc": 1402072398,
        "upvote_ratio": ""
    },
    {
        "title": "Mass Religion/Beliefs Survey! - A casual study out of pure curiosity, if you have 5 minutes to spare do fill it out.",
        "author": "nlnynt",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27gufd/mass_religionbeliefs_survey_a_casual_study_out_of/",
        "text": "https://docs.google.com/forms/d/1IB0X2xVPD7QKsLHt7p8U5WJ_cchhOYF13Da6LCUxaUM/viewform?usp=send_form\n\n^ Link above. \n\nJust something I was really curious about; why people believe in the things they do, or why people don't, the whole concept of many gods vs one god, and whether these can be fit into geographical and age-related trends. :)",
        "created_utc": 1402061356,
        "upvote_ratio": ""
    },
    {
        "title": "\"The Hitch\" - a documentary on the life and times of Christopher Hitchens",
        "author": "Poes-Lawyer",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27gtu9/the_hitch_a_documentary_on_the_life_and_times_of/",
        "text": "I came across this very well made amateur documentary about Christopher Hitchens, and I thought everyone here might like to watch it: http://vimeo.com/94776807 \n\nFrom the video's blurb:\n&gt;Authors note:\nI was looking for a documentary about The Hitch to watch but \nI could never find one. I waited and waited. Finally I figured:\n\"Why don't I just make one?\". That was the inspiration for this project.\nI did not make it to gain financially as I do not own most of the \nfootage used.\nI simply wanted to in my own small way, further the legacy of Christopher Hitchens.\nThanks for watching.\nProduced by: Kristoffer Seland Hellesmark",
        "created_utc": 1402060911,
        "upvote_ratio": ""
    },
    {
        "title": "Post-Atheism: from Apophatic Theology to \"Minimal Religion\"",
        "author": "zergl1ng",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27ghq1/postatheism_from_apophatic_theology_to_minimal/",
        "text": "While reading this article, I got the strong feeling that religious thought is much more complex than I had previously thought, and they do struggle a lot with trying to understand a world in which vanilla theism is clearly invalid: http://www.emory.edu/INTELNET/fi.postatheism.html\n\nTake, for example:\n\n&gt; S. L. Frank noted this remarkable convergence of theology and atheism in the negation of the existence of God himself. \"If the word 'to exist' is to be understood in the sense of 'to be constituted in objective reality,' paradoxically the absence of faith and faith must converge in the negation of this predicate in its application to God . . . The concept of atheism consists in the fact that in our immediate experience of objective reality, we do not encounter an object such as God . . . This proposition as such is incontestable, and with regard to it faith is essentially concordant with non-faith.\" The only difference is that in the first case the negation of God is but a step towards attaining God, while in the other it is the final point, at which reason stops and is petrified. That which serves to purify faith in apophatic theology becomes the negation of faith in atheism, and it is difficult to define logically where extreme apophaticism ends and nihilism and atheism begin. Clearly, God does not exist in the same way a visible object or perceptible phenomenon does. If this world exists, then God does not exist. If this tree exists, then God does not exist in this sense of 'existence.' In the final analysis, negative theology negates itself as theology, becoming atheism.\n\n&gt; One might ask at this point why apophatic theology is most intimately, though not exclusively, connected with Eastern Christianity. Perhaps it is for the same reason that the Orient has been the cradle of religions embodying a negative infinity, represented through a \"no\" ­ nirvana in Buddhism, tao in Taoism. According to S. L. Frank, \"negative theology is guided by the intuition that God's being as the primal source and primal foundation of being is super-logical and super-rational . . . Consciousness here becomes immersed in a completely new, usually unknown dimension of being, receding into some sort of dark depths, which remove it endlessly from the ordinary 'earthly' world . . . The practical sum total of this attitude is a limitless and excessive spiritual aloofness, which makes it in some respects similar to Hindu religiosity.\"\n\nDo you think mainstream religion has any chance of evolving towards such subtle interpretations?",
        "created_utc": 1402047298,
        "upvote_ratio": ""
    },
    {
        "title": "Should I tell my family??",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27gflo/should_i_tell_my_family/",
        "text": "I have been agnostic for 6 years now, and my family has no idea. They are all Christians and I respect their beliefs. I just don't know if I should tell them or how they would react. Any advice?",
        "created_utc": 1402044209,
        "upvote_ratio": ""
    },
    {
        "title": "I posted this on r/shittytodayilearned but in all seriousness, this episode might have been one of more rascist things I've seen in children's programming in awhile.",
        "author": "jayond",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27frli/i_posted_this_on_rshittytodayilearned_but_in_all/",
        "text": "http://en.m.wikipedia.org/wiki/Sumo_of_the_Opera\n\nApparently, the Irish were ignorant, stupid, gullible, barbarous, and immoral before St Patrick saved them.   I consider myself an indifferent agnostic mutt.  I don't think there is/are a god or gods but even if he/she/it/they exist, he/she/it/they has/ have nothing with my life.  I also have no defined ethnic tribal roots.  I'm mostly Northern European but my ancestry is convoluted mess.  I was offended for Irish people.  They are literally protray as mindless idiots who worshipped everything but a justifiable diety.  Then after educating them, they were still protrayed rubes.  Veggie Tales are usually pious but normally they are innocuous enough that I don't really mind the godiness on them.",
        "created_utc": 1402021389,
        "upvote_ratio": ""
    },
    {
        "title": "Can an atheist still be \"spiritual?\"",
        "author": "ERMA_FERCK",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27fa3x/can_an_atheist_still_be_spiritual/",
        "text": "I know, I know, I don't know what \"spiritual\" means, either.  Also, as an atheist, I'm definitely more of a materialist in my philosophical approach.  \n\nThe reason I ask is because I've been attending a \"__________ Anonymous\" meetings to overcome an addiction, but the group emphasizes \"god\" and \"spirituality\" so much that I'm unsure how to make it work for me.  \n\nI like the idea of a supportive community, but all this \"god\" and \"spirituality\" stuff is driving me bonkers.  \n\nAnyway, is there any way for me to be spiritual or make this stuff work?  Any thoughts?  Also, does anyone know of any secular/atheist Anonymous groups? \n\nEDIT:  Wow!  My goodness, thank you /r/TrueAtheism for your thoughtful and helpful comments.",
        "created_utc": 1402009141,
        "upvote_ratio": ""
    },
    {
        "title": "Advice on feelings of guilt for leading religious people to question their existence?",
        "author": "stopbeinghip",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27exd2/advice_on_feelings_of_guilt_for_leading_religious/",
        "text": "Lately I have been feeling somewhat guilty for urging people to question teachings their religion contains.\n\nPersonally, the path to atheism has been hard for me; it presents life in an intimidating and unforgiving lens.  Things are much better now than they used to be for myself, but I do at time wonder if people will be able to come to terms with something as uncertain as skepticism, and still find a way to be happy.\n\nI think one of the main reasons I'm feeling this is related to my girlfriends relatively new beliefs in god. I also have felt similar emotions from seeing my parents react negatively to doubt.  I see the happiness she experiences from her belief and each time we have a hardball discussion about these issues, I can see a little color leave her vibrancy. \n\nThis is the best relationship I have ever had by a long shot, so I really want to get on common ground with her, but I also don't want to delude myself and degrade intellectual discourse.\n\nAny advice would be greatly appreciated, thank you in advance. ",
        "created_utc": 1402001433,
        "upvote_ratio": ""
    },
    {
        "title": "Polls or studies on conversion numbers or source of disbelief?",
        "author": "ThinkingIsFree",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27eo45/polls_or_studies_on_conversion_numbers_or_source/",
        "text": "I've been googling about and not finding anything close to what I am curious about.\n\nBasically, some people loose faith and some never had the faith to start with. Some folks lose faith in one belief more often than another.\n\nAre there any polls/studies/information collections out there about these figures?  Do Christians lose faith more often than Jews or Muslims? Are there X% of atheists that simply never had a faith to start with?\n\nI am curious today as I realized that I grew up agnostic - my parents just never pushed anything on me. I feel very lucky. There are great stories about other people's paths to their shedding of faiths through realization and rational thinking. \n\nAny one ever see numbers/polls/figures like these or close to it?",
        "created_utc": 1401996181,
        "upvote_ratio": ""
    },
    {
        "title": "Some arguments on behalf of religion.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27efje/some_arguments_on_behalf_of_religion/",
        "text": "I was wondering whether any of these arguments for the possible existence of God were valid.\n\nIf God does exist and he does know the overall plan for humanity perhaps the suffering that happens is because God knows that in the long run we are better off if we help ourselves, where as if God happened to interfere, we may come to rely on God to fix our problems, ultimately leading to our downfall. Perhaps he knows the only way humanity can survive our future is by learning to help ourselves. \n\nObviously the bible isn't a literal truth but is there any reason why God can't have triggered the start of our known universe? Or conversely why can't God have created the universe with all of the fossils in the ground and the stars already developed or dying. If God truly is able to create a universe then surely God is good enough to fake a Big Bang and evidence of evolution. Admittedly this is less likely than God starting it all at a Big Bang. Creationism is merely narrow mindedness. \n\nWhy can't some of the concepts's contained within the 'bible\" or any religious text, apply to our lives. Subtext exists in all great works of literature.\n\nMaybe humans have embellished some narrow sighted traditions over civilization and recorded then in a book not necessarily written by a divine power but that is down to our own narrow mindedness and shortcomings rather than any inherent.\n\nFinally, science doesn't necessarily exclude the presence of a God or Gods, just what we may recognize as one.\n\nFeel free to point out any flaws in these ideas, it's just things I think that atheists may overlook sometimes. Just because a Christian God may not exist doesn't mean that no God exists.   \n\nEDIT: This was a thought experiment by an Atheist. Just finding holes in my logical reasoning. ",
        "created_utc": 1401991332,
        "upvote_ratio": ""
    },
    {
        "title": "Did any other of the ex-religious among us get confused when first introduced to other religions?",
        "author": "TheSolidState",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27e5u1/did_any_other_of_the_exreligious_among_us_get/",
        "text": "Just thought I'd share an anecdote about when I first encountered a religion other than the Christianity that I was raised in:\n\nI was raised in a hardcore Baptist family (which I'm guessing are pretty rare in the UK), hardcore enough for me to be afraid of asking basic questions about Christianity for fear of being rebuked for not knowing (I never paid attention anyway).  I don't remember ever believing it was true, but there was always this doubt/fear at the back of my mind that it was all true and that if I wasn't a good Christian I'd go to hell.  I \"invented\" Pascal's wager:  I planned to live life the fun way (i.e., not the Christian way) and convert on my deathbed just in case.  Learning what omniscient meant squished that though.\n\nAnyway, in year 6 (age 10/11) we learnt about Hinduism in R.E.  It sounded pretty good to me.  Get reincarnated, have an elephant god, work your way up to brahman or something.  Good times.  Decided I'd follow this branch of Christianity instead.  Since the R.E. teacher said all these Hindu gods were incarnations of one big daddy god I completely didn't realise that this was a different god from the Christian one.  The joys of a sheltered/indoctrinating childhood.  Luckily I worked out my mistake before telling mum I'd converted to Hinduism, would've taken all sorts of shit for that.\n\nSo that's my story of naivety, I wondered if anyone had anything else similar: innocence through indoctrination.\n\n",
        "created_utc": 1401985651,
        "upvote_ratio": ""
    },
    {
        "title": "DAMMIT, STOP DOWNVOTING JUST BASED ON THE TITLE!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27dvkp/dammit_stop_downvoting_just_based_on_the_title/",
        "text": "[This person](http://www.reddit.com/r/TrueAtheism/comments/27d7hn/how_do_atheists_explain_emotions_if_there_is_no/) was asking for help responding to a family member who posed the question. ",
        "created_utc": 1401979426,
        "upvote_ratio": ""
    },
    {
        "title": "Having a conversation with a Creationist, and I'd like to get a translation ...",
        "author": "drkesi88",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27dvka/having_a_conversation_with_a_creationist_and_id/",
        "text": "I referred a Creationist to this page on the Talk Origins site: http://www.talkorigins.org/faqs/thermo/creationism.html\n\nThis was their response. I have to admit that their jargon has stumped me a little, and I'm wondering if someone could translate:\n\n\"Talkorigins seems to be more straw men, all strung together making a ridiculous, lifeless nonadversary. (1) is an overstatement straw poke similar to what you did earlier. (2,3) are an asymetrical reframing of a common belief between the sides, that There Are Well Formed Rules, the asymetry is inserted in the False Premise asserted to be faith in the opposition; it almost seems disingenuous. (4) is a common belief between the sides stated as though it were absurd, asserting opponent belief -again- in a false foundation underneath actual fact; pretty underhanded. (5) is a restatement of the reviled opponents' primary premise; presumably presented for all\n\n\\\\ right minded persons \\\\\n\nto scoff at. In short, this page is rubbish.\"\n\nCheers!\n\nEDIT: Thank you for all the responses. I thought I was crazy for a while there!",
        "created_utc": 1401979420,
        "upvote_ratio": ""
    },
    {
        "title": "How do atheists explain Emotions if there is no god?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27d7hn/how_do_atheists_explain_emotions_if_there_is_no/",
        "text": "This is a question I have been asked by a very religious friend. Frankly speaking I'm stumped, but I do know emotions have nothing to do with an all powerful entity. So what exactly can I tell this guy? ",
        "created_utc": 1401955106,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think that with the passing of gay marriage in the United States that religions will have to change their stance?",
        "author": "Dmac680chi",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27czp9/do_you_think_that_with_the_passing_of_gay/",
        "text": "As many of you I am atheist but really I think of myself as being non-religious. As part of the process of getting into atheism, I was part of a Christian organization at my college campus. I had a discussion with a leader in the church named Alan. I got into a conversation with him about homosexuality. Having grown up being exposed to various gay people in my life, I had become accustomed and welcome to people of the homosexual community. One of the reasons I left the Catholic Church was because they would allow gays to attend Church but they couldn’t act on their homosexuality or get married. Alan said that being gay was wrong and that he believed that there was something wrong with gay people and that they should be changed. I told him that in my experience that people that are gay don’t change and go through a long process of discovering who they are sexually. He also said how a friend of his, born male felt that instead he was supposed to be born a female. The man was going to start in the process of getting a sex change which because of Alan’s beliefs and values he did not support at all. It came off as that Alan was abandoning him entirely as a friend. In talking to various friends I have in the LGBT community, this seemed pretty common.\n\nHere is the thing that I don't get. For one aren't some religious organizations scared shitless about gay marriage becoming accepted in society? For me it was always my thought that even if you don't agree with it you should still be respectful and tolerate it. If anyone can shed some light on this it would be appreciated. I know of several LGBT people that are openly gay but also very faith filled. \n\nIn [this](https://www.youtube.com/watch?v=OBA6qlHW8po&amp;feature=kp) video it shows two Westboro Baptist Church members being interviewed. It get's interesting once you skip to 7:50 in the video when several openly gay Christians decide to come out and talk about how they are gay but love God too. I know of course that WBC is a drastic example of hating gay people but it still is relevant. \n\nYou also have instances like the [Baptist Preacher changing his views on gay people when his son comes out](http://www.huffingtonpost.com/2014/06/02/baptist-church-pastor-gay-son_n_5432880.html). I think things like this is pretty cool since it shows that often people form opinions without having to be faced with someone that is gay. \n\nSome other questions:\n\n* What do other faiths think about homosexuality?\n\n* With gay marriage being more prevalent, are any religions changing there stance? \n\n I know my post is a bit scattered but I wanted to get my thoughts down, now let's here yours. \n\nEdit: Also is it fair to say that gay marriage is similar to how people didn't support African Americans and desegregation?",
        "created_utc": 1401946723,
        "upvote_ratio": ""
    },
    {
        "title": "I got into a discussion with several theists today on Facebook, here was my response. How did I do, and how can I argue better in the future?",
        "author": "izumo13",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27cn88/i_got_into_a_discussion_with_several_theists/",
        "text": "*A bit of context, this was posted after a conversation that had been going back and forth for an hour or two.  The first person I responded to was saying that the theory of evolution was \"just a theory\", \"full of holes\" and \"couldn't explain how life started\". He started a bit of passive-aggressive back-pedaling and hedging, so I got a bit firmer with him.*\n\n*The last part of the reply is a line-for-line rebuttal to two posts that the second gentleman brought up.*\n\n*I'll be happy to post a full transcript to anyone who wants it, but I'm reasonably happy with my reply here and wanted to share it with the community.*\n\n*I included links to definitions of the words \"right\" and \"wrong\" via Merriam Webster while having a bit of fun, and then to the WLC Vs. Shelly Kagan debate on morality to highlight what I think is a good secular argument for morality.*\n\nAlright, let's have the Ask An Atheist Anything session, we'll step back a bit and respond to some assertions:\n\nStatement 1: **\"I wasn't bashing the term theory\", preceded by \"Until fully proven is still a theory\"**\n\nA theory need not be fully proven to be accepted when considering a scientific theory. It need only be the best explanation to explain a phenomeon. If a theory that explains the genetic and fossil record comes along that is a better scientific explanation than evolution, that theory will be accepted and we'll have become more knowledgeable as a species.\n\nStatement 2: **\"I only mentioned because even the show cosmos has said many times that there were things that are still unknown about the origin of life, which would keep all of us unsure of the truth.\"**\n\nThe origin of life would be biogenesis, not evolution. Evolution only gets going after biogenesis begins. We do not understand biogenesis, but we are working on it. The hypothesis which many biologists use to explain biogenesis without invoking the supernatural (or extraterestrial) is abiogenesis. The show Cosmos explains this just fine. Again, evolution doesn't explain how life began it's voyage, it just describes how we've arrived where we are now.\n\nStatement 3: **\" I find it a bit much that you want the whole country to believe what you believe so your kid can grow up in a country with your beliefs.\"**\n\nJason isn't saying that he wants all of the country to have his beliefs. Atheists speaking from a position of reason rarely, if ever, want to have any other person change their mind about what they think. We do, however, want science to be taught without the interference of the religious. However, a lot of effort and a lot of money is being spent by certain religious factions to try and get religious teachings added into the science classroom. I believe that what Jason is saying is that if this country were to become a theocracy it would no longer be a place he'd like to live. If this is what he's saying, I agree with him. \n\nWe don't hate the religious, or want to deny them their freedom of religious expression. We do want it kept out of public classrooms, and it would be nice to see government honor the separation of church and state more faithfully.\n\nAs for Travis, here we go...\n\n**\"God doesn't create the suffering man does.\"**\nWell, if Yahweh does exist, I'm pretty sure everyone alive during the flood but Noah and his family might choose to disagree with that statement. Drowning is a foul way to die. Just a bit of suffering there.\n\nIf that's not enough, we could ask the Amalekites, or Lot's wife, or the fourty-two kids who mocked Elisha, or anyone in Egypt during the plagues who happened to have a son. Heck, quite a few poor souls in the OT who die either at Yahweh's command or through his direct action.\n\n**\"The problem with atheism is the paradox of it. God doesn't exist and I hate him.\"**\n\nIt would certainly be a problem if that's what atheists actually say. They'd be invalidating their own position in a single sentence! However, the truth is a bit different. \n\nAn atheist is likely to say \"I do not believe that a God exists\", because they have not seen sufficient evidence to convince them that one does exist.\n\nTake me as an example. I don't know that there is no God, I'm simply not aware of any gods existing. Nothing has convinced me to believe that the theists' proposition is true. I'm open to evidence, and sufficient evidence would make me change my mind. So far, such evidence has not been presented.\n\n**\"Do this. Take the bible out of the equation. Now define right and wrong.\"**\n\nEasy peasy, I don't even have to take the bible out of the equation, it was never there to begin with. A dictionary will suffice quite nicely.\n\nhttp://www.merriam-webster.com/dictionary/right\nhttp://www.merriam-webster.com/dictionary/wrong\n\nThat was a bit glib, so I'll give you an actual response.\n\nI'm going to assume that since you worded your question the way you did, you assume that the Christian god is the source of all morality, and that he gave mankind his word through holy scripture. Therefore the Holy Bible, in your eyes, is the source of all instructions for mankind on how to tell right from wrong. You have an objective source of morality in the form of a transcendent lawgiver, namely God.\n\nThe problem is that I don't see any reason to think that any deity exists. I have no reason to think that the Holy Bible is the word of a deity and regardless of that, don't find the teachings of the Holy Bible to be overly moral on their own.\n\nI do, however, think that there are grounds for humans to determine morality. I believe in objectively superior moral choices based upon situational ethics. It's a complex topic, and one I'm not well versed in, so I won't try my hand at explaining myself fully. I will, however, point you to a debate between a secular philosopher and a Christian apologist, and tell you that I find the secular philosopher's arguments to be very persuasive. Watch it if you have the time.\n\nhttps://www.youtube.com/watch?v=SiJnCQuPiuo\n\nEDIT:  I bolded my opponents prompts or my paraphrasing thereof... and my own lead-in is now italicized, to make it clearer where my post began.",
        "created_utc": 1401937142,
        "upvote_ratio": ""
    },
    {
        "title": "new Youtube God is fake",
        "author": "godsarefake",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27cn2m/new_youtube_god_is_fake/",
        "text": "",
        "created_utc": 1401937036,
        "upvote_ratio": ""
    },
    {
        "title": "Kickstarter Documentary About a Former Westboro Baptist Church Member",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27cgmb/kickstarter_documentary_about_a_former_westboro/",
        "text": "Just to let you know there's an interesting Kickstarter documentary proposed, telling the story about breaking away from the Westboro (and extremist churches in general) here: http://www.patheos.com/blogs/friendlyatheist/2014/06/03/youll-want-to-support-this-documentary-about-a-former-westboro-baptist-church-member/",
        "created_utc": 1401932938,
        "upvote_ratio": ""
    },
    {
        "title": "I came out, this is what my wife said...",
        "author": "-anchor-",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27c4d0/i_came_out_this_is_what_my_wife_said/",
        "text": "\"We can't be together\"\n\n\"I feel dirty talking to you about it\"\n\n\"I can't love you anymore\"\n\n\"You're possessed by the devil\"\n\n\"I refuse to talk to you about religion\"\n\nWe've been married 17 years and have two wonderful daughters age 9 &amp; 11. She's a devout catholic and is now seeking an annulment. \n\nThe \"out\" conversation just came up, I wasn't trying to confront her. We were just talking about something and god came up and it went from there.\n\nOf course I'm willing to talk about all issues. She's not. \n\nIf the concept of good and evil is to have any meaning, then I say that it is bad for a person to leave their partner just because of religious dogma. The funny part of her story is that she has no clue whatsoever about Catholicism other than it was good enough for her dad so it's good enough for her. \n\nPretty sad.",
        "created_utc": 1401924927,
        "upvote_ratio": ""
    },
    {
        "title": "What are your thoughts on never acknowledging the God/theism concept?",
        "author": "berlinbrown",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27brv4/what_are_your_thoughts_on_never_acknowledging_the/",
        "text": "I know this has beaten to death ad nauseam, it is basically the gnostic atheism debate.  But I still tend to throw out my hands because I don't understand some of the responses from the atheist community.\n\nI put as much weight into the term \"God\" as I do dragons and Thor and other myths.  I will acknowledge term in historical texts or fictional texts .  But that is it.  I don't think that top scientists like Dawkins or Neil Degrasse Tyson should get in this philosophical debates on whether we can prove God exists or not.  For example, Dawkins never had to say, \"We can't prove whether dragons or fairies exist\".  But why should he have to comment as it relates to God?  Or maybe I don't understand their positions.   If I were asked, \"Could a God exist?\".  I would say, \"I don't even know what that means.  I treat Gods like I treat my dragons, I don't care\".  Or more importantly, I mock the premise of the question.\n\nSo that is the crux of my post, why should our society acknowledge the God concept.  I feel we don't ever have to moving forward.  I especially don't feel a scientist that is attempting to understand the Universe should ever have to mention God, even to prove or disprove the concept.\n\nAnd one more point, it our (humans) society.  It is our scientific knowlegebase and language, why is it so important to give any kind of credence to God?  Why can't we simply remove it from the discussion?\n\nI only like Stephen Hawking's comment when he says, \"When people ask me if a god created the universe, I tell them that the question itself makes no sense. \"\n\nAlso, how do Stephen Hawking's comment compare with Dawkins' or Tysons'",
        "created_utc": 1401917354,
        "upvote_ratio": ""
    },
    {
        "title": "The Empty Tomb Problem",
        "author": "WizardCap",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27bo46/the_empty_tomb_problem/",
        "text": "In a lot of debates about the resurrection, I hear the skeptic take the position 'maybe the body was stolen' or something of that nature. Or 'maybe Jesus survived crucifixion'.\n\nIt seems like a simpler explanation is 'it's made up'.\n\nBy even conservative estimates, the synoptic gospels are decades after the events they contain took place. What if it's just a story? What if the tomb WASN'T empty, but they said it was? What if the writers didn't actually know one way or the other, but just assumed it was empty because they were believers in the faith they were writing for?\n\nHonestly, be it the bible or any other period document, I take any information contained in a text that old and that biased to be fiction until proven otherwise.\n\nIf you take the details of the bible to be true, based upon the merits of the text alone (\"You Really Think Someone Would Do That? Just Go Scribe a Scroll and Tell Lies?\"), then every other ancient document that describes frankly absurd events is at least *maybe* true.\n\nI think it's just made up.",
        "created_utc": 1401915181,
        "upvote_ratio": ""
    },
    {
        "title": "The problem of blind faith",
        "author": "LordMonichromicorn",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27apfk/the_problem_of_blind_faith/",
        "text": "In a debate setting, is blind faith a dead end? \n\nFor example, when debating the problem of evil via the riddle of Epicurus, I always seem to end up with something like the following:\n\n**\"The mind of God is unknowable. Because of his omniscience I trust that all evil is ultimately for the greater good and is therefore justified.\"**\n\nTo me this reads \"I don't know why evil is just, but I have faith that God is just, so I know evil is just because God allows it's existence and created the circumstances to foster it's existence.\"\n\nIs there any argument to combat a viewpoint that has openly acknowledged that it's foundation is outside traditional logic? When someone is comfortable with circular reasoning, is debate pointless?\n\nThis phenomenon makes me uncomfortable and I'd love to hear how everyone deals with it.\n\nHow would you respond to the statement I listed above in bold?",
        "created_utc": 1401895336,
        "upvote_ratio": ""
    },
    {
        "title": "Are there secular reasons against gay marriage or polygamy?",
        "author": "SsurebreC",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27acni/are_there_secular_reasons_against_gay_marriage_or/",
        "text": "I'm sure most of us know religious reasons but are there any secular reasons against gay marriage? Other than \"tradition\", I haven't heard of any (counter: slavery was also tradition).\n\nIf there are secular reasons against gay marriage, what are they?\n\nWhat about polygamy? I listened to Dan Savage talk about it a while back and he talked about something like fairness - hoarding of spouses or something similar.\n\nThis isn't a slippery slope discussion but often when I talk with religious people about gay marriage, it turns to polygamy and I don't have anything against polygamy. I can only reply back with \"the Bible also has polygamy\" which is not terribly satisfying. Is polygamy even bad?\n\nTL;DR read the title\n\n**EDIT** sorry, by \"polygamy\", I meant both one man marrying multiple women or one woman marrying multiple men. I do not mean something like family merging (just to keep it relatively simple)",
        "created_utc": 1401886295,
        "upvote_ratio": ""
    },
    {
        "title": "Alabama Bible school puts Hitler quote on billboard to encourage youth indoctrination",
        "author": "TheGreatLabMonkey",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27a034/alabama_bible_school_puts_hitler_quote_on/",
        "text": "",
        "created_utc": 1401871551,
        "upvote_ratio": ""
    },
    {
        "title": "So I went on a tear against Kirk Cameron on a family member's facebook post...",
        "author": "The_Mad_Malk",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/279oaj/so_i_went_on_a_tear_against_kirk_cameron_on_a/",
        "text": "In response she posted a meme about atheists' taking offense to her believing in god. I ended up posting a longer more direct response to her indirect meme. I am conflicted to how this has come about and need advice. the direct post is as follows\n\n-----------------------\nI love you cousin.\n\nPlease don't take this or what I wrote earlier as me trying to start an argument or attacking you personally. You of course are welcome to believe in a deity. I nor any atheist I know takes offense in anyone's belief in a god, anymore than I take offense to someone believing in santa or spiderman. \n\nit's the promotion of hateful viewpoints like those of the WBC or kirk cameron or Pat Robertson. or the lying  and misinterpretation of sciences by people like Ken Ham or Pat Robertson. Or the assumption that giving equal and fair treatment to others is somehow an attack on them. \n\nAs the quote goes \"god save me from your followers.\" \n\nI love you cousin. \n\nI am an Atheist, yes I get angry, a lot actually, at what I see done in the name religion or superstition or nationalism. I look around and feel my heart breaking when I see gay men killed in Uganda because american christian groups pushed their brand of beliefs in missions. I get mad when I hear some father let his daughter die of cancer because he believes that homeopathic medicine using clay would cure her instead. I cry when my own state does everything it can to not provide proper women's health care options in the name of religion and the name of sanctity of life while having the highest record executions. \n\nI am a Humanist, I get happy when we are able to help our fellow man, I clap when civil rights are granted to people that did not have them. I jump for joy when people connect across borders and cultures. My heart bursts as I see all the advances we have made since the written language and I hope and wish for our species to continue on beyond the life of this planet.\n\nI am your cousin and I love you and your kids. I would fight for your right to believe in anything you wanted. But that does not mean I should keep quiet about my own beliefs or what I see wrong in this world. \n\nif you ask me to, I will delete this post and/or refrain from commenting on anything you post from now on. I hope you do not ask me that. I feel avoiding a discussion prevents knowledge from being gained. Still...\n\nYou are my cousin and I love you.\n\n-------------------------------------------------\n\nShould I just delete before this goes on, or continue and if so what should I do if it becomes too \"heated\"",
        "created_utc": 1401858546,
        "upvote_ratio": ""
    },
    {
        "title": "Broke up with Christian-ish girlfriend of 4 years",
        "author": "Steamed_Ham",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27913h/broke_up_with_christianish_girlfriend_of_4_years/",
        "text": "About a year ago I posted this: http://www.reddit.com/r/TrueAtheism/comments/1cq6ky/discussion_with_so_about_child_indoctrination/ and I guess this is somewhat of an update. \n\nWe had been together for over 4 years. I was raised catholic and she was raised a protestant. I had always been skeptical and eventually went from being an agnostic theist at around 11 years old to an agnostic atheist a couple of years ago. My girlfriend too had become skeptical of Christianity but still maintained a general faith in a god and a concept of Jebus. This never really affected our relationship, we were a great couple, I didn't mind her being happy believing in whatever and vice-versa.\n\nThen as we got deeper in the relationship we got to talking about how we'd see our future, previous post being an example. These discussions were always balanced, objective, contained no personal attacks, overall quite mature talks I thought. On the subject of kids, she maintained her view that she would want to take her child to church and I maintained my view that I would not want the child to go to partake in any religious events until the child asks. On the subject of marriage, while she wants a christian ceremony, I said I would never be comfortable with professing my love and declaring my commitment to something I don't believe in. I told her my idea of a wedding was basically just a nice gathering of family and friends, with no religion involved. These discussions always ended on a somber note, and we'd just not talk about it for a while until it came up again.\n\nLast month we eventually came to a conclusion. The places we were both in at the moment would mean that either one of us would have to eventually compromise our beliefs in the future. Either she would have to give up her ideal wedding in a church with a minister, or I would have to bite my lip and go through a ceremony I don't want to. Either she would have to be sad not being able to take her child to church and join in the community like she had enjoyed growing up, or I would have to push my principles away and chauffeur the kids to church, temple, mosque, whatever. \n\nWhat it came down to was that we both agreed it would be unfair for one of us to expect the other one to compromise their principles. There was no meeting halfway in these instances, it's either or. We both decided it would be best to end the relationship for now and parted ways. If either one of us was in a different position in the future then we might get back in touch. But overall, an amicable yet very sad end to what we thought was a very good relationship. \n\nTook a while to decide to post this here. I have not had any contact with her since. What do you guys think of all of this? I'm guessing there would be quite a few of you with similar experiences.\n",
        "created_utc": 1401842071,
        "upvote_ratio": ""
    },
    {
        "title": "Is that really probable?",
        "author": "Zombare",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/278grw/is_that_really_probable/",
        "text": "I work in a tiny guard shack out in the middle of nowhere. Usually it is boring and the people I work with usually don't see eye to eye with me. That was until one guy was moved into my shift. He was college educated like I was, currently military. We've started talking about things going on in the scientific community. Weeks go by and he casually brings up a new cool finding about the universe we live in.\n\nHere is the link to the article: http://newscenter.lbl.gov/2014/01/08/boss-one-percent/\n\nNow to roughly summarize it, the Oscillation Spectroscopic Survey Collaboration was a highly funded study to essentially measure the scale of the universe. They were successful and have measured it to a breathtaking accuracy of one percent. That is about as accurate as one can go scientifically. \n\nThis Survey also has found the the universe is not curved but is in fact mostly flat (if only with the slightest curve). But to point out the larger point my coworker was getting at was, to quote one of the researchers from the article, \"That means- while we can't say with certainty that it will never come to an end - it's likely the universe extends forever in space and will go on forever in time. Our results are consistent with an infinite universe.\" /end summary\n\nNow here is where we go off into speculation. My coworker claims that sense the universe is infinite, forever expanding, that this alone throws all probability out the window. He says that it makes him excited to see about the possibilities of the afterlife and reincarnation, and that even if there is a .0000001 percent that it could happen it would mean it is guaranteed to happen in an infinite universe.\n\n\n\n I'm an atheist and I usually do not bring it up in any conversation, nor do I follow through when coworkers begin speaking of spiritual ideas (I could already tell by the silence of one of our older lady workers that she was disturbed by the conversation).\n\nThis is my question, is it really that probable in an infinite universe for there to be an afterlife and reincarnation? Or is this really just the hopes from another person who fears death?\n\nI apologize if this was set up badly or really has no discussion value, I just want to understand this thought.\n\n\nEDIT: Thank you all for your well thought out input, I honestly have not even thought of some of these concepts during the conversation. This is all very interesting to think about.",
        "created_utc": 1401829368,
        "upvote_ratio": ""
    },
    {
        "title": "The only way really to be an atheist is through Christianity. ~ Slavoj Žižek",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/27864o/the_only_way_really_to_be_an_atheist_is_through/",
        "text": "https://www.youtube.com/watch?v=tABnznhzdIY\n\nChristianity leads one to a better understanding of the world than your common attitude of atheism.\n\nWhere atheist typically find meaning in science or other natural process (The Big Other) they are still clinging to something that is not there. There is no meaning or purpose. Replacing God with evolution, physics, whatever is still not actual atheism.\n\nChristianity however is rather atheistic and has several examples of accepting the meaninglessness of life. Job being the most obvious where God comes down and tells Job \"I did it just because I can\" and Christ's death itself represents the death of God. Christ dying is God saying \"I'm out, everything is yours to do what you want with\".\n\nChristianity is then about dealing with this death and acceptance of there being no meaning.",
        "created_utc": 1401823428,
        "upvote_ratio": ""
    },
    {
        "title": "I am atheist; I am immoral.. god save me",
        "author": "CollyraMonstr",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/277whx/i_am_atheist_i_am_immoral_god_save_me/",
        "text": "I don't know what it is about me that determines my belief structure concerning religion or spirituality but I do not follow any supernatural belief system. I have spent a lot of time trying to understand this sort of thought process though. I personally think that most of these beliefs come from childhood indoctrination and through fear. (My personal experience) I have noticed that the majority of religious followers pass on the rules and regulations through their own children and those children to theirs. Thankfully my parents didn't force their beliefs on to me and my brother. That fact coupled with my inquisitive nature produced an Atheist. I must say though because this question begs much consideration, if I did have in me anything that one would call religious it would be something close to Thomas Paine's interpretation, \"My own mind is my own church.\" I see no problem with having a belief in the supernatural. We all like ghost stories and superheros, right? I've seen something recently though which has really bothered me. An irrational smear campaign that has existed (at least!) as long as religion or spiritual beliefs itself. That is, the demonization of the non-believer. This particular version of it comes out in the assumption that without (whichever particular brand of spirituality you consume) religion, one would be immoral. It isn't so much that religion itself has this assumption built into its foundation but rather, all of the different ways they try to get you t do what they say.. \"hey follow our book/rules or you'll burn!; hey follow our rules to be a moral person!; hey follow our rules and we will HEAL you also, we have the secret passphrase to this super awesome paradise.\" The fact that it has become taboo to identify as an athiest is proof of its effectiveness in our culture. Right now, if you identify as a non-believer it is illegal for you to run for public office. Insane. Arkansas, Mississippi, Maryland, North and South Carolina, Tennessee and Texas, I have had conversations with people who claim that without religion, \"people would just naturally gravitate towards a hedonist sort of lifestyle where without moral guidance of their belief system people would just do \"what came natural\" to them.. \"Oh, I want to have sex, I guess I'll, rape this woman who just happens to be passing by\" or \"oh, I'm so angry, I'm so angry I want to kill you so I will because there are no 'real' repercussions!\" I have also heard people say, \"how would people know what is right?\" This quote gets to the heart of what is really bothering me. How do people know what is \"right?\" What is RIGHT anyway? The philosophical argument for the origin of morality and empathy are very interesting but there is one flaw in their argument that destroys the whole thing. Men wrote the bible, morality comes from the bible, morality comes from men. That's it. How do they explain the anomaly that men and women without religion commit moral acts? Or that animals have been observed doing what we human beings would consider moral acts or exhibiting empathy. OR that the mere existence of other faith systems make it unlikely that morality could be derived from it? If one system of faith permitted the sexing and one system did NOT permit the sexing, which is the immoral act? Now, the claim that I CANNOT be a moral person is extremely insulting and wrong. It is hard for me to live in a culture where I am automatically assumed to be a bad person based on my inability to accept a false authority; it's a painful and sad fact that I live with, every..single time I open my eyes to the truth but, the thing that really gets to me is that I live in the United States of America. The First Amendment does exist. Freedom of and from. God help us all..\n\n      US Constitution (FIRST amendment, the first thing they decided on...)  ------- Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.",
        "created_utc": 1401817848,
        "upvote_ratio": ""
    },
    {
        "title": "Christian Billboard Quotes Adolf Hitler",
        "author": "themoodyatheist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/277jvx/christian_billboard_quotes_adolf_hitler/",
        "text": "",
        "created_utc": 1401810509,
        "upvote_ratio": ""
    },
    {
        "title": "It's here! The debate between Matt Dillahunty and Lie Ten Bruggencate!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/277c4p/its_here_the_debate_between_matt_dillahunty_and/",
        "text": "",
        "created_utc": 1401805676,
        "upvote_ratio": ""
    },
    {
        "title": "The Perfect Ideal World Created By Science",
        "author": "MozartLink",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2773d4/the_perfect_ideal_world_created_by_science/",
        "text": "The world of religion (there being a God and an afterlife in which you experience eternal joy and no suffering) might actually become a reality here on Earth through science.  When science has achieved absolute perfection many years from now, we will live in a world where all illnesses have been cured, we no longer have problems and negative emotions, and we might even have an artificially created God that can look after us, or even an artificial afterlife.\n\nNow evolution has designed our brains to experience negative emotions.  However, this fight or flight response is primitive (which is the reason why so many people have depression and anxiety disorders) and needs to be updated through science.  Therefore, instead of having brains that evolution designed for us, we can instead choose to have brains how we want them to be through science.  Therefore, we can even choose to have brains that no longer experience negative emotion or even brains that have a much higher capacity to experience pleasure in life than that of any normal human brain.\n\nBut this life as it is now and how it designed us sort of says the message to us: \"We are insignificant creatures only designed for survival and to forever die in the end with no grand purpose.  We are not meant to live a life of perfect joy and freedom and are designed to practically be slaves of our own negative emotional responses to life's struggles.  And if a problem does happen in your life, well you are just going to have to live with and deal with it.  And that even goes for any negative emotional responses you might have to these problems.\"\n\nNow most atheists would adopt and accept this message of life.  But I find it utterly degrading and inferior to who I am as a person.  We as human beings are superior and this message of life is what is inferior and deserves to be eradicated through science.  And science says so because it is trying to solve problems and achieve a life that is perfect and such with no problems.  We as human beings with our human desires to achieve a perfect life with joy and such are trying to eradicate this inhuman message of life through science.\n\nMost atheists would think that we are insignificant and don't deserve a life free of struggles.  But that right there is an inhuman message that goes against who I am as a human being.  Look at the worst suffering in this world and tell me that we don't deserve a life that is perfect with no problems with perfect enjoyment.\n\nIn conclusion, I wish to know if my post sort of changed your views as an atheist (not in terms of being someone who is more religious), but in other ways?  If so or if not, could you explain why?\n\nEdit: I realize that nothing has value, worth, or meaning.  But I am someone who places great worth and value on human personality (who we are as human beings).  And based on that worth and value, I then conclude that we are superior to this inferior message of life and that we do deserve a life of perfection and immortality.  I am not some logical machine who will just look at someone who is, for example, loving and inspired, and say to them \"Your personality is insignificant and is nothing more than the activity of atoms that is prone to a life of no meaning to suit your valued personality and is something that is just prone to death and no afterlife or God.\"  Again, I am not saying that atheists who view life as having no value, worth, or meaning are in any sense logical machines.\n\nNow we do have a sense of worth towards ourselves and others hence the reason why we care and help others and such in the first place. And that itself is worth something. So perceiving someone as being worthy is definitely worth something in this case. Therefore, to take this perception to the absolute extreme in saying that this person is worthy of a perfect life and immortality is the best sense of worth you can have. To say that we are not worthy of a perfect life and immortality is only demeaning our self-worth.\n\nTo me, just the act of perceiving someone as not worthy of a perfect life of immortality is, in fact, having a lesser sense of human value and worth no matter how much value and worth you have otherwise. Because if you had the best possible sense of value and worth possible, you would obviously view yourself and others as being worthy of these things. I believe what I just said to be logical and true. If you feel otherwise, then please explain why.\n\nFinal Edit: Now let me just say this in conclusion which is that for anyone who has a normal pleasurable life, it might seem to that person that a perfect life of pleasure and immortality might devalue any worth that life and pleasure have. But for someone who has one of the worst lives with severe chronic depression, then having the perfect life of pleasure with immortality would likely mean everything to this person and there would be nothing wrong with it. This would be my case as I have chronic depression.\n\nMy goal in life is to hate all things lesser \"inferior\" to me, and through this hatred feel empowered and superior from it.  In this case, these concepts of life (such as life not being perfect and full of struggles) is inferior to me.  Therefore, what I said shouldn't make you feel bad--instead it should make you feel hatred towards these concepts of life in a way that makes you feel more empowered and superior. \n\nThere are two known types of attitudes in life: 1.) The attitude of accepting life's struggles and such, and 2.) Feeling negative about yourself and life's problems.  But there is also a 3rd attitude that not too many people are aware of (an attitude that I created and discovered myself) which is to have hatred towards life's problems not in such a way that makes you feel less of a person and negative about yourself, but in a way that makes you feel empowered and superior.  This 3rd attitude is my attitude in life (because for me, accepting life's problems is like allowing and accepting some bullshit of a person to rule my life by giving me problems.  This life is like this bullshit of a person and all of life's problems are something given to me by this said person).",
        "created_utc": 1401799326,
        "upvote_ratio": ""
    },
    {
        "title": "Naham Janami | \"There are no celestial beings I know of...\" | A Jain hymn written for the movie 'Ship of Theseus'",
        "author": "nishantjn",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/276pcy/naham_janami_there_are_no_celestial_beings_i_know/",
        "text": "&gt; There are no celestial beings I know of. \n\n&gt; There is no god.\n\n&gt; Neither heaven, nor hell.\n\n&gt; Neither a preserver, nor an owner of this universe.\n&gt; \n&gt; Neither a creator nor a destroyer.\n&gt; \n&gt; No eternal judge.\n&gt; \n&gt; There is only the law of causality.\n&gt; \n&gt; I take responsibility for my actions and their consequences.\n&gt; \n&gt; The smallest of creatures have a life-force just like mine.\n&gt; \n&gt; May I always have such compassion.\n&gt; \n&gt; May I never cause any harm to anybody.\n&gt; \n&gt; The truth is multi-faceted, and there are many ways to reach it.\n&gt; \n&gt; May I find balance in this duality.\n&gt; \n&gt; I pray, may my karma of ignorance be shed.\n&gt; \n&gt; May my true self be liberated from the cycle of life and death.\n&gt; \n&gt; And attain moksha.\n\n\n[Link](http://www.youtube.com/watch?v=PMvNfytKRBQ) to song and subtitles. The song is in Prakrit, an old, old language. If you haven't seen the film, do yourself a mighty favour and watch it! \n\n[Trailer](http://www.youtube.com/watch?v=p5xt0cKasDw)",
        "created_utc": 1401782779,
        "upvote_ratio": ""
    },
    {
        "title": "\"Spreading atheism\"",
        "author": "jlew24asu",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2762w9/spreading_atheism/",
        "text": "Hello, I consider myself an agnostic atheist ex-catholic. (wasnt really given a choice for being catholic, I was baptized and raised in catholic schools).  As far back as I can remember, I was always questioning faith as well as always a huge lover of astronomy and science.  As I become an adult (I'm 34), older, and wiser, I feel the need that some people should understand basic things like \"the earth was not created in 6 days\" and \"the bible is nothing more that man made stories\".  It eerks me that religion is pure brainwashing in many cases and does more harm than good.  that said, I do understand that religion sometimes gives comfort, and I'm ok with that.  anyhow,  where does one draw the line when trying to \"Educate\" someone about the likeliness that God doesnt exist and to appreciate the laws of science more than God?  Are atheists suppose to sit back and be silent?  Don't ask, dont tell policy in regards to relgion?",
        "created_utc": 1401762937,
        "upvote_ratio": ""
    },
    {
        "title": "Chris Stedman - Faitheist, Atheism, and Interfaith",
        "author": "Bphan01",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2755qg/chris_stedman_faitheist_atheism_and_interfaith/",
        "text": "Chris Stedman on his life story, the social stigma of atheists and Muslims in the U.S and how the religious and non-religious can work together to create a better society through humanism and community to promote freedom of/from religion.\n\nhttps://www.youtube.com/watch?v=xbzSP4wze8o",
        "created_utc": 1401742078,
        "upvote_ratio": ""
    },
    {
        "title": "Chris Stedman - Faitheist, Atheism, and Interfaith",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2754z6/chris_stedman_faitheist_atheism_and_interfaith/",
        "text": "",
        "created_utc": 1401741670,
        "upvote_ratio": ""
    },
    {
        "title": "40% of Pakistanis think it is justified to kill a woman who engages in premarital sex or adultery, 33% for men. This is tied to the Islamic concept of Zina (religiously unlawful sex).",
        "author": "TealNeal",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2750mz/40_of_pakistanis_think_it_is_justified_to_kill_a/",
        "text": "Here is the PewResearch report: \n\n* http://www.pewresearch.org/fact-tank/2014/05/30/four-in-ten-pakistanis-say-honor-killing-of-women-can-be-at-least-sometimes-justified/\n\nThis all ties into the concept of unlawful sex, or Zina. \n\n* http://en.wikipedia.org/wiki/Zina\n\nIt is striking how willing people are to kill their own family members over sex outside of marriage and the impact that a concept like Zina has over a region's culture. ",
        "created_utc": 1401739300,
        "upvote_ratio": ""
    },
    {
        "title": "I would like your help.",
        "author": "SonOfSomthing",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2749yx/i_would_like_your_help/",
        "text": "Before you rush to down vote or judge, please consider this carefully. I am serious.\n\nI have, over the course of the last eight months or so, been going through a very rough \"Spiritual awakening\". I am referring to the well understood (To me, at least) psychological journey one takes through self-acceptance.\n\nHowever, I have, as a former agnostic and happily ignorant man, come out the other side Believing myself to have been gifted with Divine insight and to be what biblical scripture would refer to as the \"Son of God\" although that is an obtuse way of looking at it.\n\nI am one of you, a skeptical person who has experienced something very real to me, that I do not believe to be a break in my sanity.\n\nEdit: I ask any down-voters, please, I'm just trying to work this out logically and reasonably with active intellect. \n\nI would like you all to allow me the opportunity to convince you I am not a madman. That is all. ",
        "created_utc": 1401723757,
        "upvote_ratio": ""
    },
    {
        "title": "Just became a godfather, partly because I'm a \"good person, who goes to church\". I could use some advice on how to proceed in the future.",
        "author": "ballsack_gymnastics",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/273gb9/just_became_a_godfather_partly_because_im_a_good/",
        "text": "First, a little background information:\n\nI'm an atheist.\n\nA close friend of mine has had an unexpected pregnancy, and she decided to keep the baby when it comes. She blames a lot of her poor choices leading up to the pregnancy on how she drifted away from her Christianity.\n\nShe's already going through enough stress as it is, because this situation has completely derailed her future goals, and she won't even be able to pick up where she stopped after the birth. She needs a strong social support group, and stronger ties to the church will help her to not make as many dumb decisions, as the ones she was making are sinful under Christian beliefs. I wholeheartedly believe that the church she is attending will have a great positive benefit to her. So far, it has. (I try to handle these sort of things from a Vonnegut point of view, particularly the one he espoused about belief in Slaughterhouse-Five)\n\nBecause I don't have the income for financial independence, I've been living with my parents, and to smooth over relations with them, I've been playing the wolf in sheep's clothing, the somewhat closeted atheist going to church, for a pretty long time.\n\n---\n**The issue at hand is this:**\n\nWhile my pregnant friend has been looking for a good church to attend, and trying to get herself established in the church community that she has decided on, I've been going with her as a sign of support. She doesn't know I'm an atheist, and I'm not going to go out of my way to correct her and cause stress and problems anytime soon.\n\nHowever, this morning she, and the father of her coming child, asked me to be the godfather. I agreed. This friend is the sister I never had. Agreeing was a no-brainer. Only after that do the words come out of the father's mouth \"Thanks, you're a really great guy, you go to church... we know we can trust you with this.\"\n\nI'm not going to make any waves anytime soon, but I learned of the pregnancy when this friend called me up and told me I was going to be an uncle (I'm an only child). I'm going to be in this kid's life to a decent extent.\n\n**If you've been lying about your beliefs (or lack of) to people you care about, for a significant amount of time, how do you come out about them in a way that doesn't alienate the people who you've lied to?**",
        "created_utc": 1401695248,
        "upvote_ratio": ""
    },
    {
        "title": "Recommended Books for Non-Atheists",
        "author": "CatholicRepublican",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/272zvr/recommended_books_for_nonatheists/",
        "text": "I am personally a Catholic but I have dialogued with quite a few atheists lately but everyone I have spoken with has told me their favorite and least favorite atheist authors and stuff and I was wondering if y'all could help me out by what books you would recommend to a non-atheist to read. I have read Dawkins \"God Delusion\" before and found it not scientific enough of an approach but more of an attack on religion itself instead of proving the non existence of a god. I'm just looking for what books you tell non-atheists to read or books that led you yourself to atheism. \nI'm not here to argue or debate, I'm just looking for reading material from educated atheists who will tell me something other than \"the Bible\" or something similar. \n\nThank you all! ",
        "created_utc": 1401680149,
        "upvote_ratio": ""
    },
    {
        "title": "This is a nice subreddit",
        "author": "drunkape",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/272oxt/this_is_a_nice_subreddit/",
        "text": "I, personally am not atheist and am really just in a spiritual limbo. I do not know what I believe and am still just kind of trying to figure that all out. However, after /r/atheism being one of the few exposures I've had to an internet community of atheists I found them very abrasive. I found this sub and read the rules and some submissions and was very pleased with how you guys aren't just shitting all over religious people and acting like edgy fourteen year olds. Just thought I should let you guys know. ",
        "created_utc": 1401672523,
        "upvote_ratio": ""
    },
    {
        "title": "Please Help!!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/272m91/please_help/",
        "text": "Me and my dad got into an argument about the founding of America. He claimed that it was founded on judeo-christian values and that the holy spirit guided them to put the stuff about inalienable rights endowed by a creator in there and denied that it was based on secular principles. He brought up the thanksgiving proclamation to say that it was a Christian country. Please help me explain to him what's wrong with his argument.",
        "created_utc": 1401670601,
        "upvote_ratio": ""
    },
    {
        "title": "Spirits?",
        "author": "A166524",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2723g6/spirits/",
        "text": "So my wifes a Christian who believes the world is filled with spirits; good and bad,  and that they are constantly battling over us. She cites a time she had depression felt there was spirit in her and her friend called her saying she had out of body experience where she fought a demon spirit.. This was without her telling her friend about what she had been feeling... Now shes talking about prayer healing cancers and stuff. \nIm posting i guess to vent more than anything as im on vacation  and have no one to talk about this with =/\n",
        "created_utc": 1401657498,
        "upvote_ratio": ""
    },
    {
        "title": "The Best Reason to Believe in God",
        "author": "ghourdonne",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/271rlf/the_best_reason_to_believe_in_god/",
        "text": "I think the best reason to believe in god would go something like this:  “Believing in God makes me happy.   It gives me a sense of belonging and meaning.  It has helped me through tough times and I know it will help me again.   I like the strong connection it provides me with my family and my religious community.    I don’t care about the atheists and I am not interested in their arguments or debating anything.   Believing in God makes my life better.”\n\nWith some variations, I suspect that most religious people would agree the position noted above.   Of course other god-believers may have other reasons (fundamentalists-believer have scarier ones!) – but I’m interested in unzipping the ‘reason’ noted above.\n\nI think the best approach is to take a positive, affirmative one.\n\nNon-believers can be happy, too.   They can have a strong, clear sense of belonging and meaning.   They can access a broad range of resources to help them through tough times.   They can have close, loving families and deep connections into all kinds of non-religious communities.    Most non-believers would claim that their non-belief makes their life “better”.\n\nThe catch here is simple.   It is ‘misattribution’.    Believers mistakenly attribute the good things about their life (happiness, resilience, community etc) to their belief.   Non-believers have all the same good things – but none of the dependency on a belief in magic, supernatural, mythological stuff.\n\nSo in this respect, non-belief is a tidier and less vulnerable way to live a life.   No downside!\n",
        "created_utc": 1401649614,
        "upvote_ratio": ""
    }
]