[
    {
        "title": "I hated THE FLORIDA PROJECT. This is why.",
        "author": "CuspChaser111",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8w26cd/i_hated_the_florida_project_this_is_why/",
        "text": "Last night on a flight home I watched The (overrated) Florida Project. I was curious about this film, as I was raised right around that area, and know all-too-well about the realities of living under the shadows of Disney. Here are some of the issues I had with it: \n\n-Storyline. We did not see Mooney's character go through anything too trying and come out the other end. We just saw her being a poor kid living in a poor world. It felt more like a documentary. She had a white trash mom who is self-absorbed, zoned-out, and a child herself but we never saw what it was like for Mooney to get sick and not have a doctor or the realities of living in that situation. (The mom was far too attractive from what I have seen of Florida moms in that area. Her skin was too clear, she was too in shape. Florida moms in that area are skinny but they have those bumps on their stomach after having a kid and random bruises. She felt too pretty for me and way too attractive to be Mooney's mother. Mooney looked nothing like her. That threw me off.) \n\n-While I agree Brooklynn Prince did a good job, touting her performance as sublime is a bit much. I can see a bunch of people saying, \"Oh I loooooved her performance oh my gosh that little girl was sooo good! Awww little kids! YAY!\" Just because it's a kid doesn't mean they get an instant award. I feel the kids in Slumdog were much better actors to be honest. They were more grounded. Perhaps this is because Slumdog used actual kids from that area but let's calm down about the transformative performance of Mooney, I felt her friend 'Jancey' did a stronger job. She was more natural. \n\n-What a lost opportunity to show the 'rich people' visiting Disney, we saw the scene of them eating at the hotel buffet, but why wasn't there some shot of another more affluent family getting ready for a big day at the park for us to see how little Mooney has in life? Not once did Mooney ever ask for something she couldn't have. ALL little kids ask for things they cannot have. No child is that perfect. What a great moment to also have the mom reflect on how shitty she is of a mom compared to other parents that have their shit together. You can't live in la la land all the time and it seems like the mom did.\n\n-I did not buy the Mooney sitting in the bathtub bit at ALL where her mom was fucking a guy in another room. Something would've happened, she would've come out of the tub, she would've at least asked or brought it up later to her mom. She would've possibly mirrored the sexuality with other boys like her one guy friend. Kids notice EVERYTHING.\n\n-Ending. That was the ending? THAT? TERRIBLE? THING? Please. It was such an easy solve. You get to run away with a hidden camera and go to Disneyworld. I can understand if we had that as a daydream in the movie on Mooney's part, but not the ending. It felt like a band-aid like, \"Welp, the film's over folks! See a little kid can dream. See how dark the realities are of living by Disney? And...Scene!\" Really? I hated that ending. I was excited to see what would happen when the social workers came for Mooney. Would DaFoe do something? When Mooney was running was she going to be hit by a car? When she showed up at Jancey's door would there be a social worker's hand on her shoulder, ripping her away from Jancey as they screamed and cried? Would the mother of Jancey just shut the door on Mooney, like the way those with more privilege shut out those with less? \n\n-The only saving grace of this movie was Willem DaFoe. He did a great job. He's subtle and loving, fierce and vulnerable, it was a pleasure to watch him act. I never feel like I ever watch him acting. Too bad this movie was not all about him and a completely different film. \n\nI'm annoyed with the people that recommended this to me with such happy, glazed-over eyes. It could've been so much better.",
        "created_utc": 1530715705,
        "upvote_ratio": ""
    },
    {
        "title": "What ever happened with the Pride of Palomar?",
        "author": "mustaphamondo",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8w1xz5/what_ever_happened_with_the_pride_of_palomar/",
        "text": "I was looking through the top posts ever in this sub and came across the [effort](https://www.reddit.com/r/TrueFilm/comments/4pvf6b/major_announcement_this_sub_is_attempting_to/), two years ago, to \"rescue a forgotten film by a Master of Silent Cinema.\" It sounds like a super cool project, and according to [their kickstarter](https://www.kickstarter.com/projects/1370529624/release-a-forgotten-film-by-a-master-of-silent-cin) it got funded, but...then what? Neither the thread nor the kickstarter make any mention of it actually, you know, happening. And although somebody uploaded a[ 480p version](https://www.youtube.com/watch?v=FjMJC4I7-4Q) to youtube a year ago, I can't find any other mention of the purportedly restored version of this film streaming or on DVD. So what happened?",
        "created_utc": 1530713728,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (July 04, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8w1xlh/casual_discussion_thread_july_04_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1530713624,
        "upvote_ratio": ""
    },
    {
        "title": "Films where the protagonists are utterly depraved?",
        "author": "NoOneIsPerfectIGuess",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8w1h8l/films_where_the_protagonists_are_utterly_depraved/",
        "text": "As in rapists and such and yet are still the protagonists?\n\nFor instance, From Dusk Till Dawn where one of the two main protagonists 'Richie' Gecko is a murderer and rapist but still is one of the protagonists who fights (but does get killed by) vampires. Admittedly in this, Gecko's depravity is used to cast Seth Gecko in a better light as the 'good brother'.\n\nJust because rape is usually portrayed as being beyond the pale and so protagonists rarely are rapists (murderers yes but not rapists). Yet there seems to be a few films where rapists are protagonists.\n\nSo not films like the Woodsman where it is a sex offender trying to change but one's where the protagonist is willfully depraved. And not films like Henry Portrait of the Serial Killer where it is just documenting what an evil fuck they are but films where a depraved individual is doing nonetheless heroic things.",
        "created_utc": 1530709415,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best film studies course you have ever taken?",
        "author": "walkingpartydog",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8w0um0/what_is_the_best_film_studies_course_you_have/",
        "text": "[removed]",
        "created_utc": 1530702690,
        "upvote_ratio": ""
    },
    {
        "title": "Who here has seen Out 1?",
        "author": "TheLordofDankMemes",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8w0kye/who_here_has_seen_out_1/",
        "text": "My brother got this movie on Blu Ray a while ago but we've never dared touch it because we're both scared shitless by the runtime of 13 hours. \n\nHas anyone here seen it? What are your thoughts and does it warrant its runtime? \n\nI would also like to mention that Out 1 is the longest cinematic film ever made, the longest experimental film, named Logistics, runs at a staggering 51,420 minutes (35 days, 857 hours).",
        "created_utc": 1530699424,
        "upvote_ratio": ""
    },
    {
        "title": "Who here has seen Out 1? (The film with the second longest running time)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8w0jwo/who_here_has_seen_out_1_the_film_with_the_second/",
        "text": "[removed]",
        "created_utc": 1530699087,
        "upvote_ratio": ""
    },
    {
        "title": "Stand By Me: connection between train scene and car race?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8w03dr/stand_by_me_connection_between_train_scene_and/",
        "text": "[removed]",
        "created_utc": 1530693166,
        "upvote_ratio": ""
    },
    {
        "title": "i watched oslo, august 31st a couple of days ago and i can't seem to shake it off.",
        "author": "Haze667",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vy1gv/i_watched_oslo_august_31st_a_couple_of_days_ago/",
        "text": "first off, i just wanted to say that i have no proper, technical knowledge when it comes to movies. i come from a slightly different background (medicine), so i am definitely unable to discuss film theory and cinematography and editing and color schemes and all that with you. i'm a bit of a noob, i suppose, but i do love movies. i mostly play it by ear and just watch a lot of them. (apparently 184 so far this year.) i generally focus my attention on the characters and the way they're built, their personality, drives, motivation etc., the acting, the general aesthetic of the movie (is this movie visually... beautiful or unique or different in any way?) and, most importantly, on how that particular movie made me feel. i found this subreddit a few months ago while trying to see how others felt about *annihilation*. been lurking every now and then ever since.\n\n*****************\n\nanyway, yeah. *oslo, august 31st* hit me pretty damn hard. i think it's a brilliant movie. also quite devastating and it made a long-lasting impression on me that i haven't been able to shake off yet. this sort of thing doesn't happen to me a lot, i think the last time was *stations of the cross*, so i guess i was curious if it had a similar impact on other people as well.\n\nto me, anders is such a realistic and unforgettable protagonist and the way that he was portrayed was like a sucker punch to the gut. the acting was top notch, just mind-blowing. the constant eye contact that he's making with all the other characters, always quietly searching, observing, taking it all in. the kind, sad smiles. his blunt, unapologetic, introspective demeanor, like he's completely empty and out of his body, just staring at himself from somewhere far away. fantastic.\n\ni still don't know what anders was doing in oslo on the 30th of august, following that suicide attempt at the very beginning of the movie. was he out there trying to find meaning, something to help him talk himself out of it, or was he simply revisiting old people and places to say goodbye? because at times, it does look like his decision had already been made (with the way he sabotaged himself during the job interview, for instance), but, at the same time, also seemed to genuinely push himself (promised his friend thomas he wouldn't do anything stupid, tried to reconnect with iselin, ended up going to the birthday party). i tried to go back to find out when it all changed for him, but i can't seem to find any answers. was it when his sister didn't show up for lunch? i don't know. i think it's just a basic human flaw though, we all try to go back and pinpoint the exact moment in time when our lives took a turn for the better or the worse, trying to rationalize it and oversimplify it. maybe it's not that easy at all.\n\nwe know almost nothing about anders, but his depression is quite clear. he's very intelligent and highly functional and therefore good at hiding it, but it's there nonetheless. what we do know is the fact that he's a journalist who likes classical music and plays the piano, but nothing else besides that. was depression the root of his addiction or merely a consequence of it? he longs for a connection but he's unable to find one. his family is not there. iselin won't return his calls. he thinks he has nothing left in common with his former friends. the women he meets are too caught up in their own trivial lives. so he decides to return to his childhood home and commit suicide. why did he ask what date it was? was there some meaning behind it? august 31st, the last day of summer.\n\nstray observations: seemingly unrelated voice-overs of people talking about oslo. that last scene, all the places he's been to, shown in reverse, now all empty. an almost complete lack of a musical score. a lot of shots of him with his back to the camera, walking away.\n\n*******************************\n\nit's a very unique, raw, painful movie and i wanted to know what you guys thought of it. thanks for reading.",
        "created_utc": 1530671112,
        "upvote_ratio": ""
    },
    {
        "title": "How does the style of Howard Hawks differ from other directors of his time?",
        "author": "Ammaeli",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vxzmn/how_does_the_style_of_howard_hawks_differ_from/",
        "text": "I saw The Big Sleep the other night, and though I personally found it insufferable, I grant it to be a decent film on its own merits. Now, while reading into what makes it special, I learned that the director -Howard Hawks- is revered as a full-blown auteur. \n\n[I found this post](https://www.reddit.com/r/TrueFilm/comments/379474/why_is_howard_hawks_so_revered/crlcf70/?utm_content=permalink&amp;utm_medium=front&amp;utm_source=reddit&amp;utm_name=TrueFilm), which does a good summary on why he was adopted by French critics to champion the idea of film auterism. I concede all those points, but I remain somewhat unconvinced of him having a distinctive visual trademark. [This analysis does a good job at explaining it](https://www.reddit.com/r/TrueFilm/comments/379474/why_is_howard_hawks_so_revered/crktyb1/), but, although it is apt for what I saw, it just begs the question - *isn't this the standard way these scenes were be filmed in this period?*\n\nEssentially, I ask - how would his style differ from movies like Double Indemnity, White Heat, Casablanca, or The Shop Around the Corner? Are they not functional and uncomplicated, too?",
        "created_utc": 1530670607,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about Annihilation",
        "author": "scubnard",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vurbe/questions_about_annihilation/",
        "text": "Firstly I want to say that I love this movie. \n\nI just watched it a second time and I still have some unanswered questions. \n\nTL;DR at the bottom\n\nFirst: Anya (Gina Rodriguez) makes a couple references to herself being not physically strong. First when Lena (Natalie Portman) is examining the albino alligator and Anya is holding it's mouth open she says she isn't strong enough to hold it for long. Then when the group reaches the mess hall Anya picks up a large machine gun (an M240) and remarks that it's too heavy for her to carry. Why does she say these things? The only reasoning I can deduce is that her physical weakness is supposed to be indicative of her mental weakness. She cracks/her mind degrades sooner than the rest. \n\nSecond: The tattoo. Is the tattoo meaningful in some way? I read that it was a snake that represents the circle of life but does where and when it appears indicate something? Does is it mark those who are affected by the shimmer?\n\nThird: What's up with the sometimes invisible bear monster? When it abducts Shepard (Tuva Novotny) Lena and Ventress (Jennifer Jason Leigh ) are right next to her yet neither of them saw it approaching. Lena even comments on this fact. Also later on when Anya has Ventress, Lena, and Josie ( Tessa Thompson)  tied up Anya states that neither herself or Josie saw the bear at all. Why couldn't it be seen sometimes and plainly seen other times?\n\nFourth: how the past influences their fates. For almost all of the group I can see how their pasts influence what ends up happening to them. For example: Josie self harms and one could assume is or was suicidal, she ends up willingly dying. Shepard tells Lena that Ventress was alone in the outside worlds, without friends or family, and Ventress ends up going off by her lonesome and dying. Lastly Lena tells Lomax (Benedict Wong) that because she was the only one who truly wanted to return from the shimmer she is the only one who did. The problem with this way of looking at their fates is that I can hardly see how it works with Anya and Shepard. I'll start with Anya. What we know about her past is that she is a recovering alcoholic who worked as a paramedic. She also declares that there are only two possibilities that can happen in the shimmer. One being that once inside people go crazy and kill each other, the other being that something in the shimmer kills those who enter. Anya ends up going crazy and attempting to kill the others and eventually does get killed by a creature within the shimmer. So her past (her more immediate past than the others) does in a way influence her demise. Now on to Shepard I see hardly anyway how her past influences her death. Shepard's daughter dies of leukemia and she says that in a way part of her old self died along with her daughter. The only connection between her past and death that I can see comes from when Josie says that part of Shepard lived on in the bear after it killed her. Meaning only part of her died, similar to when her daughter died, part lived on.\n\nFifth: why was Lenas house inside the shimmer? Why were there less pictures on the wall before the stairs?\n\nSixth: what is the meaning of the bone garden thing outisde the light house? \n\nTL;DR: Why does anya reference her own physical weakness multiple times? What is the meaning of the snake tattoo that multiple characters bear? Why was the bear animal sometimes invisible to some characters? How does Shepard and Anyas past influence their respective deaths? Why is Lenas house in the shimmer? What is the bone garden thing outside the light house? \n\n",
        "created_utc": 1530643755,
        "upvote_ratio": ""
    },
    {
        "title": "Do the Right Thing (1989), race relations, and the consequence of dissent",
        "author": "mybestmonkey",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vubl4/do_the_right_thing_1989_race_relations_and_the/",
        "text": "Warning: Long post-erton\n\nI've always been deeply intrigued by the thematic moves Spike Lee makes in *Do the Right Thing,* and a few months ago I did a write up on what I felt were the most important elements. Certainly these are not the only facets I love about the movie, or even the most personal to me, but **we live in a society** where these things matter, so here we go.\n\n\\------------\n\nAs controversy and debate swirl around the plight of the Black Lives Matter movement, it becomes more imperative than ever to reflect on the path that has anticipated our current racial condition. Following the abolition of Jim Crow laws, as well as the passing of the Civil and Voting Rights laws in the 1960’s, black Americans were—presumably—close to entirely sealing the gap in privilege and power that separated them from whites. And to white eyes, this gap appeared to be tiny, seeing as the laws that govern the country were finally equitable for all races. But yet, there was still unrest in the black community. There were (and are) still riots and protests on behalf of people of color. Because these acts of protest are seemingly antithetical to the de jure resolutions in place, the motivations behind events such as the 1967 Newark Riots, or the 1992 Los Angeles Riots are often obscured or simplified into arguments about blacks being upset over isolated mishaps . And while it can be argued that these violent instances of protest by blacks may not be entirely justified, discerning their roots is crucial to understanding why organizations such as Black Lives Matter still demand to be heard.\n\nSpike Lee’s 1989 film, *Do the Right Thing*, seems to ask the viewer to understand these radical acts of protest in their whole form—as a series of interconnected acts of prejudice, catalyzed by sometimes mundane external factors (which in this case is a scorching hot day in Brooklyn). The film tells the story of the inhabitants of the Bedford-Stuy neighborhood in Brooklyn, New York City, as they try to deal with the hottest day of the year. Mookie, the film’s protagonist, is an easygoing black guy, who makes ends meet as a pizza delivery man for the Italian-American-run Sal’s Pizzeria. And though Mookie is the main character, much of the film is dominated by the interactions of the characters around him; Mookie seems to be the calm center of the storm, which brews throughout the course of the narrative. As our eyes into the film’s turmoil, Mookie allows the audience to judge the actions of the neighborhood. Thus, by presenting scenes in which black characters disrupt or attempt to disrupt the social order, Lee demonstrates how difficult it can be for people of color to “do the right thing” when they have little to no power.\n\nThe film first exemplifies this controversial, but futile bid for power in Mookie’s friend, Buggin’ Out’s, complaint regarding Sal’s “wall of fame.” Buggin’ Out—who is already comically disgruntled with the fact that he has to pay two dollars more for extra cheese on his pizza—looks up at the restaurant's wall and notices that exclusively-white celebrities hang on this “wall of fame.” Further annoyed by this, he angrily yells to Sal about the lack of “brothers on the wall,” to which Sal replies, “get your own place, you can do what you want to do… this is my pizzeria, American-Italians on the wall only.” Here Sal uses his social and economic power as a business-owner to defend his (presumably well-intentioned) decision to represent his own heritage on the walls of his restaurant. In ideological theory (see Althusser), these celebrities seem to represent the Subjects of Sal’s Italian-American ideologies. Powerful cultural figures such as Al Pacino and Frank Sinatra are idealized on Sal’s wall of fame, which, to a minority with generally less representation in American culture, can undermine their own feeling of power (and Buggin’ Out’s lack of power is only *compounded* by the fact that he is lower class). Thus, considering Buggin’ Out probably cannot, economically, just “get \\[his\\] own place,” Sal’s response comes off as insensitive to the imbalance in power that Buggin’ Out feels—even if Buggin’ Out is misdirecting, and somewhat rudely expressing his protests. Certainly it would be a very inclusive thing for Sal to put black celebrities on the wall of fame, but on an uncomfortably hot day, the reality of being both lower class and a minority brings to fruition a compounded sense of vindication for Buggin’ Out, which—understandably—makes the necessary diplomacy very difficult to achieve. Though there are certainly better opportunities for Buggin’ Out to gain the power he lacks as a poor black man, the tensions here are too high for him to “do the right thing,” and he can seemingly only cause more racial animosity between him and Sal. Lee seems to give us Buggin’ Out as an aspect of nuance in the movement for black equality; though it may seem like he’s just an appeasement to white viewers who are skeptical of the movement, he ultimately represents a realistic, and undeniable product of racial power inequality.\n\nAs an inverse to Buggin’ Out’s hostile disruption of the social order, the neighborhood decides to illegally use a fire hydrant as a fun way to cool off—and exercise power. The scene begins in montage form, depicting a group of Puerto Rican guys cheerfully cracking open beers, and a couple of younger black guys opening up a fire hydrant and using empty cans to direct the jet of water onto a small crowd of eager “swimmers.” Though using a fire hydrant this way is a fairly illegal act, it is important to note how positively this scene is portrayed to be: a catchy rasta tune plays, young people laugh and frolic, and the relief of the water on such a hot day is made abundantly obvious. This spectacle becomes especially relevant when considered through John Fiske’s lens of the “carnivalesque\" (see \"Offensive Bodies and Carnival Pleasures\") which is apparent in the disorderly fun of this lower class ritual. Here, people drink and break rules, which is antithetical to the lawful and social order, but it ultimately gives these lower class people a uniting power. When an annoyed, white, and evidently higher class man (he’s driving a Cadillac that he loudly asserts is an “antique, hotshot!”) tries to pass, the trickster-esque black guys manipulating the hydrant soak the Cadillac, in an assertion of the mischievous power they wield through their fun. Because the social order has been distinctly challenged in the destruction of an upper class status symbol such as a Cadillac, the police seem to appear out of thin air to regain control. The Cadillac driver’s reaction to this is immediately constructed on racial lines, as he hollers about “Mo and Joe Black” being the ones responsible. Though the film could have depicted his reaction as one purely out of anger for his car be damaged, Lee instead makes clear the presence of race in situations where power between upper and lower class are inverted. Thus, as a move to reassert his power over this community of lower class people, the Cadillac driver invokes race, knowing it is intertwined with the class order that has been broken. And, akin to Buggin’ Out’s outburst at Sal’s, no one seems to be entirely in the right—the Cadillac driver reacts in a racist way, and the neighborhood guys shouldn’t have ruined the man’s car. But Lee presents no surprises in the way each party reacts, for, by this point in the film, race is a seemingly inevitable factor in even minute struggles for power.\n\nThe climax of the film comes as racial tension reaches a boil, and—in a brawl between Sal and a Buggin’ Out/Radio Raheem duo—the consequences for people of color who don’t “do the right thing” become evident. Buggin’ Out, with help from Radio Raheem, an imposing black man who totes a boombox blasting Public Enemy’s “Fight the Power” everywhere he goes, confront Sal in his own restaurant. Radio’s boombox is set to eleven and Buggin’ Out screams at Sal to put black people on the wall of fame, to which Sal responds with just as much fury. As the screaming match escalates, the other people in the pizzeria take clear sides, even if they were fairly bipartisan before. Whites side with Sal, and blacks side with Buggin’ Out; in a fighting ritual such as this, the ideology of one’s own race comes before any compromise. In a fit of rage, Sal says he will, “tear \\[their\\] fucking nigger heads off,” which, in an **intentionally obvious way**, is the wrong thing to do. Sal then smashes Radio’s boombox to pieces with a bat, which, as a symbolic act of violence, silences their fight for power. In this back and forth struggle for power, the next step Radio Raheem takes—lunging at Sal and beginning their physical fight—is only logical in the world of the film. A shot of the wall of fame is intercut between the blows, and the camera’s focus is on a picture of an Italian-American boxer mid-fight with a black boxer; as a representation of the physical fight below, the picture allows the Subjects of both the white world and black world to be pitted against each other in a battle for the title of dominant ideology. While the power of ideology hangs in the air, the struggle has become more physical than ever, and for a few deluded moments, it seems that this is a power bid that anyone can win. But the film doesn’t allow the them to duke it out, someone be declared winner, and then walk away with a different relation in power; rather, Lee again demonstrates the inevitable yet terrifying reality—the police again snap into existence, and end up choking Radio Raheem to death in an act of police brutality. Today, even more so than when the film was released, the significance of a black man’s unlawful death by police is clear—racist, authoritative power has gotten away with murder. All ideological struggles present before the police arrived are over, and the powers of the State trump any chance for a shift in the racial condition. Sure, Lee presents a fight in which Radio Raheem initiates and becomes the more brutish of the opponents, but he makes clear the police’s action is unnecessary, and ultimately an act of oppression. For being a black man who cannot do the right thing, Radio Raheem is killed regardless of his deeper, more sensitive struggle to be seen as an ideological equal.\n\nThe struggle for black power seems to come full circle as class tension marries racial tension in the neighborhood’s reactionary destruction of Sal’s Pizzeria. The cops leave and Sal and his sons stand in front of the store—as if on trial—while the rest of the neighborhood looms around them. Radio Raheem’s death is on everybody’s tongue, and the threat of it begetting more violence is ever-present. In these tense moments before the film’s final instance of violence, it is already clear why the next event will happen: because the exertion of power on the black community was violent, the subsequent reaction is nearly forced to be violent. Mookie, who has thus far remained relatively impartial (even defending Sal to keep the peace and protect his job), now looks from Sal, to the crowd of his fellow people of color, and back again, before walking into the crowd, grabbing a trash can, and throwing it through the front window of Sal’s Pizzeria. As the story’s protagonist, Mookie is the perhaps the audience’s strongest point of empathy, and the closest we can get to the narrative; thus, for him to finally give up on doing the right thing is probably the biggest surprise we get. Even our hero, the most cool-headed and sober person in the film, understands his race’s further loss of power as a call for violence. But, as opposed to the film’s beginning, we are presumably much less likely to condemn Mookie for joining in. And in a very almost-Marxist way (lol), the reasoning behind destroying Sal’s becomes more concrete, as the primary economic power inequality between Sal and the rest of the neighborhood is his amassment of property (i.e. his business, which generates capital). This last attempt at exerting agency then, disrupts the social order at its very core—by challenging the capitalistic structure which seems to favor Sal. Property becomes the sign of racial oppression for the neighborhood, and degrading it seems to be the only way to achieve black empowerment. In the wake of Radio Raheem’s death, an event that leaves a black man feeling less powerful than ever before the law, the neighborhood’s economic misfortunes come to the forefront—and moneyed, white Sal is the inevitable recipient of these feelings. The capitalistic ventures of an Italian-American only seem to spit in the face of poor blacks who are constantly urged to do the right thing, especially when the systems of power they are told to respect cannot answer their pleas for help.\n\nBy destroying Sal’s place (which is finally torched by Smiley), the film seems to leave the viewer with the notion that disrupting the social order is an inescapable burden placed on people of color when challenged with the everyday inequalities present in America. These reactions are seen recently, notably in the Ferguson, Missouri riots following the police shooting death of Michael Brown. And at times, the violence of the protests seem to overshadow the more deeply rooted power struggle in their media coverage. White America often heavily criticizes these reactions, with the implied or stated question as to why these protesters couldn’t just do the right thing and remain peaceful. But as Spike Lee demonstrates, being peaceful is a luxury the oppressed often cannot afford, and even a hot day can make it that much less attainable. Before the film closes, a radio host remarks on how the day following Radio Raheem’s death is predicted to be just as hot or hotter—and in a racially charged America, our condition seems to be the same way. As we move towards more acts in protest of racial inequality, it is absolutely crucial to look not only to what could have been done right, but to why things are being done wrong.",
        "created_utc": 1530640591,
        "upvote_ratio": ""
    },
    {
        "title": "My Chris Nolan Kamikaze Fantasy",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vu6or/my_chris_nolan_kamikaze_fantasy/",
        "text": "[removed]",
        "created_utc": 1530639640,
        "upvote_ratio": ""
    },
    {
        "title": "Random Theory",
        "author": "ProfAnderson79",
        "url": "https://profanderson79.wordpress.com/2018/07/03/random-theory-28/",
        "text": "",
        "created_utc": 1530638900,
        "upvote_ratio": ""
    },
    {
        "title": "Films, Timelessness, and \"Gattaca\"",
        "author": "kiefer-reddit",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vt5hk/films_timelessness_and_gattaca/",
        "text": "I was recently watching *Gattaca*, which is surprisingly 20 years old this year. I grew up watching it frequently and always appreciated the aesthetic and (slightly too) elegantly simple yet optimistic storyline.\n\nThis time around, I was struck by the \"timelessness\" of the film. Other than a handful of minor plot points (lack of cell phones or the old CRT monitors, for example) it almost seems like it could have been made a few years ago. Some other films from the same time period I'd consider equally as \"timeless\" include *Minority Report* and *Collateral*.\n\nThat got me thinking: what makes a film timeless? By timeless, I don't mean \"classic\". Casablanca is a classic film, in the sense that it is still enjoyable to watch it today. But no one would ever think it was anything other than an old film. Of course, that is mostly because of the technology, but it's also because of the dialogue, setting, etc.\n\nFor Gattaca specifically, I came up with the following reasons as to why it is timeless:\n\n- A somewhat minimalist, retro-futuristic aesthetic with a yellowish, filmlike-hue. Digital films don't age well.\n- Classical, rather than pop, music. Violins and piano age well.\n- A storyline that is simple enough to be universally relatable yet specific enough to be realistic.\n- The core ethical issues of the film are still relevant today. In fact, they may be even more relevant.",
        "created_utc": 1530632125,
        "upvote_ratio": ""
    },
    {
        "title": "Hollywood list of 2017 Movies in Crime, Thriller,Mystery - which you might have missed watching either because the movies [viz Kidnap, Good Time etc] didn't get much hype or the ratings were comparatively low. Which movies from the list you have not watched.",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=43m1uYNIT_c",
        "text": "[deleted]",
        "created_utc": 1530629488,
        "upvote_ratio": ""
    },
    {
        "title": "Summer With Ingmar",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vsid8/summer_with_ingmar/",
        "text": "Hi guys I started my Ingmar Bergman marathon on Filmstruck to celebrate his  birthday. Here are my thoughts so far. I am watching two more today\n\n## Crisis 1946\n\nStarting my marathon with Bergman's first film *Kris,* which translates to *Crisis*. Not only was this his first film as director, but he also wrote the screenplay. I wasn't too hot on the film, but there were some scenes involving Jack (Stig Olin) that were all around great.\n\nI like how the film starts off as if we were watching a single episode that makes up a season of tales from this small village. The opening narrator describes the village and characters we are seeing, and then the film begins. The plot of the film is straightforward: a young girl raised by foster parents is taken away from her quiet town when her real mother from the city comes looking for her. Her real mother is accompanied by an eccentric figure named Jack.\n\n*Crisis* centers on the young girl named Nelly (Inga Landgré), but the most interesting stuff is actually the characters who impact her life. The two mother figures and their viewpoints on their daughter make for some heartfelt drama, but my favorite scenes are the ones involving Jack, who falls madly in love with Nelly. The final act of *Crisis* only strengthens the opening narration. After all, this is just a small tale in a small village within a large world.\n\n## ★★½\n\n## Port of Call 1948\n\n\\*Hamnstad—\\*translated to Port Town and also known as *Port of Call* for American audiences—is the second film on Filmstruck's Bergman collection and the first of his I actually consider well made. Bergman perfectly captures the scenery of the port and the visuals are outstanding.\n\nThe film is essentially about love in a port town between a sailor and a young woman with a complicated past. Bergman seems to be developing a trend of telling his story through the eyes of a young woman and how older adults affect them.\n\nBerit (Nine-Christine Jönsson) has a strained relationship with her mother (Berta Hall), and they argue back and forth. There is a great flashback in this film that greatly captures the family strife and main reason why Berit is the way she is now. Berit was sent to a reformatory and because of that, the town looks down on her. We later find out why she was sent and for how long. Berit meets a sailor, Gösta (Bengt Eklund), on the dock. He is tired of sailing and wants to settle down in the town. Of course, they fall madly in love with each other. He later finds out about her past and her bad track record with men. This, of course, puts a strain on their relationship. His reaction and feelings seem to capture the way a lot of lovers feel when they discover the romantic past of their partners. They know they have nothing to worry about because they are with them, but they can't help thinking about their partner's exes. This is what I like about the film: both lovers hope the other can bring them out of a pit of darkness, but in reality, they might sink together.\n\n*Port of Call* is, of course, a romance film, but the social commentary on society's view of women during this era is amazing. Berit makes a great character study on how a fractured home can damage a child. I am not a fan of how the resolution is handled, but I still recommend *Port of Call* strongly. If you liked this you would probably love *Lola* by Jacques Demy.\n\n## ★★★½\n\n## Thirst 1949\n\n\\*Torst—\\*known as *Thirst* for American audiences an*d Three Strange Lov*es in the UK—is a film about an unhappy couple. Through flashbacks and words, we discover their previous failed relationships and how those relationships molded them into the people we see before us. Unfortunately, I can't connect to these characters as I did in prior Bergman films, mostly because of the way Bergman constructs the narrative.\n\n*Thirst* is hampered by the way the story is told. The way events are thrown at the audience makes it hard to follow. You could honestly take the scenes already made and rearrange them for a more coherent story. The funny thing is Bergman's prior film, *Port of Call,* handles the flashbacks far better.\n\nThis might be the shortest film so far clocking in at sub 90 mins, but it felt like the longest because what was transpiring wasn't interesting. I appreciate Bergman for addressing things that were considered taboo—like abortions, alcoholism and cheating—but again his prior film did it so much better. Also, I noticed a dip in quality when it comes to the visuals aspects of the film, and I am not sure if this is a restoration issue or not.\n\n## ★★\n\n[https://thefilmera.com/2018/07/02/summer-with-ingmar/](https://thefilmera.com/2018/07/02/summer-with-ingmar/) this is a continous article that updates almost daily. Link has pictures.",
        "created_utc": 1530627149,
        "upvote_ratio": ""
    },
    {
        "title": "Baby Driver - Editing in Motion",
        "author": "Nibbywibbydingdong",
        "url": "https://www.youtube.com/watch?v=5DZi9hdhDbU",
        "text": "",
        "created_utc": 1530620371,
        "upvote_ratio": ""
    },
    {
        "title": "Stray Dog -- Kurosawa's Best Film",
        "author": "Hsingh69",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vragv/stray_dog_kurosawas_best_film/",
        "text": "Since the heat is absolutely unbearable right now, I decided to revisit a film that uses the unbearable heat to beautiful results in which is Akira Kurosawa's finest cinematic achievement.\n\nThe plot of *Stray Dog* when boiled to an elevator pitch is this, a young rookie cop loses his gun and sets off on a journey to find it. Maybe it's not an all-encompassing description of the film, but it's definitely what got me to buy my first criterion film. \n\nNow before finding *Stray Dog*, I was in the midst of a film-noir binge. *Sunset Blvd*, *Double Indemnity*, *The Third Man*, *Touch of Evil*, *Dead Men Don't Wear Plaid*. I was familiar with Kurosawa's work, having seen *The Hidden Fortress* and *Seven Samurai*, I was huge fan already. I found *Stray Dog* through an IMDb list of the best noirs. Finding out that Kurosawa's made a film-noir excited me to no end and I bought the criterion.\n\nWhen I first watched the film I was amazed at the level of pure entertainment it delivered. Amazing use of Tokyo's absolutely demoralizing weather. This film was the perfect example of keeping the viewer on the edge at all times. Robert Downey Sr. said that the best way to write a character is to always have them in a hurry, and that's what is provided in *Stray Dog*.\n\nThe second time around I was transported into the world of Murakami(Mifune's character). I felt that this guy had fucked up and wanted to do everything that he could to right his wrongs. Toshiro Mifune is absolutely mesmirizing as the rookie cop, who always seems to be on the verge of a nervous breakdown. \n\nTo end my diatribe, you should watch this film. Absolutely insane performances by a fresh-faced Toshiro Mifune and a true veteran actor, Takashi Shimura. An atmosphere that makes you crank your AC all the way, and for it's worth, Akira Kurosawa's best film.\n\nWhat's your favorite film that represents a director's cinematic peak?\n\n",
        "created_utc": 1530615592,
        "upvote_ratio": ""
    },
    {
        "title": "The Killing of a Sacred Deer and Groundhog Day",
        "author": "therealbeezer",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vqgke/the_killing_of_a_sacred_deer_and_groundhog_day/",
        "text": "I rewatched The Killing of a Sacred Deer last night and noticed something in the scene where Steven, Martin, and Martin's mother watch Groundhog Day. Bill Murray's characters says \"how do you know I'm not a God?\" It struck me that his circumstances are pretty similar to Martin's. A supernatural event is occuring, and both of them are the first ones to hear about it. Now, the supernatural events aren't self-imposed in Groundhog Day, and while we can't say the same for certain in Sacred Deer, one might say so since Martin doesn't display any supernatural tendencies. The closest he got to it is when he was on his bike outside the hospital, and Kim stood up to see him. Watching the Groundhog Day in my first viewing, I thought it was classic Yorgos making an out-of-nowhere movie reference, but now I could see it was a sneaky use of symbolism amid a sequence that was both entertaining and advanced the plot.",
        "created_utc": 1530605059,
        "upvote_ratio": ""
    },
    {
        "title": "Film request from 2010-2017: independent thriller/neo-noir set in midwest USA with opening scene having female whistleblower in back seat of car driven by a young male reporter attempting to obtain NSA-type government information from her.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vogk2/film_request_from_20102017_independent/",
        "text": "[removed]",
        "created_utc": 1530583729,
        "upvote_ratio": ""
    },
    {
        "title": "Going to Rome, looking for inspiration",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vnysz/going_to_rome_looking_for_inspiration/",
        "text": "[deleted]",
        "created_utc": 1530579557,
        "upvote_ratio": ""
    },
    {
        "title": "Technical and production criticisms of Annihilation (2018)",
        "author": "EquivalentFactor",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vnh7a/technical_and_production_criticisms_of/",
        "text": "I'm afraid I'm a bit late to the party with Annihilation, and most discussion has probably come and left, but I figured I would throw my thoughts into the void having just now watched it.\n\n*Annihilation* toyed with some neat visuals, but fell quite short of expectations. I enjoyed the austerity and mystery of the film, but felt it failed in a few crucial aspects that limited its ability to represent some of the concepts and themes it perhaps meant to, and some production choices ended up hindering the story and narrative structure. In no particular order:\n\n * Gina Rodriguez was either miscast or given poor direction. While every other actor in the film plays their parts with a very flat affect (perfectly in Portman and Isaac's case, way too much in Leigh's case), Rodriguez plays Anya very broad and stagey. This does not convey her characters instability so much as it makes it seem like shes constantly overacting. If that was the directors choice, Garland hung her out to dry by not having a wider spectrum of personalities in the film, and therefore drawing attention to it.\n\n * The production design is impressive, but is showcased very unevenly. Spectacular moments of visual design are offset by most scenes being dully shot with characters against bland backdrops (simple rooms, darkness, etc.). This is obviously a cost-saving measure to avoid having expensive effects in every shot, but uninteresting shots inter-spliced with much briefer amazing shots doesn't average out well in regards to spectacle.\n\n * Visual effects mostly didn't rise to the level of the production design. Impressive set and practical creature design (the bear, the pool-grave) is paired with lower quality post-production (The twin deer shot, the shot of Josie firing into the bear, the rendered humanoid alien, the sprouting vines from Josie's arm, exterior of the base, exterior of Lena's house). Not every film can have $300M budget for visual effects, but the incredible quality of the in-camera aspects (and one or two *really* good post-production shots: ie. the doppleganger's face, and the 'nexus') made these drops in quality really stand out.\n \n * The film's central theme, change, failed to be communicated at all through the structure of the film itself. In fact quite the opposite: This is a very static film. Scenes are single set-pieces from which characters do not meaningfully progress between, but rather simply appear at in sequence. While this makes for a far simpler and more cost-effective production (especially in terms of sets and filming), a film which focused largely (or even completely) on the liminal portions, the moving and change of the journey itself, would have been far more in agreement with its own content.\n\n * While the artistry of the production design was excellent, the application was odd. There is an uneven sense of greater warping of reality as the film progresses (and as the characters grow closer to the lighthouse). Since it is explicitly stated this phenomenon is occurring, it seems like an oversight. The isolated features do somewhat grow more pronounced, but mostly the world remains normal. Again, cost-saving, but noticeable. The pool-grave lies within an otherwise normal compound, the chimera flowers alongside a normal shore, the crystal trees (at the epicenter!) sit upon a mostly normal beach and surprisingly unchanged lighthouse.\n\n * Tell, don't show is apparently the production mantra here. How do we know they're losing their minds? Because they remind us out loud. How do we know their thoughts and emotions are blurred and intermixed between them? They say so, inexplicably to each other. Use the language of cinema to convey these feelings and ideas, Garland! Editing and composition can all communicate this information without simply telling the audience what's going on.\n\n * Actors rarely feel like they're looking at what the audience is seeing. Scenery is a big offender here, given how much is digital, but the centerpiece effects don't match up well in many cases to the filmed scenes. The flower-humans and stomach-worms are the glaring examples. In both cases the post-production visuals are much too striking to match the performances they are overlaid upon. The failing here is in the director either not properly communicating to the actor what the tennis ball they're acting to is supposed to be, or allowing the post-production design to run too wide of the original performances.\n\n * The on-set and on-location lighting was also mismatched with post-production in several cases. The hyper-vibrant, super-diffuse kaleidoscopic ambient and sunlight of the shimmer leaves the actor's skin and clothing unaffected which sometimes makes it feel like they're against a green-screen even when they obviously on location.\n\n * Shot composition is all over the place and the pacing is strange. Suggests too much loss in editing, or poor pre-production.\n\n * Color-grading was pretty consistent. Probably shouldn't have been given that the shimmer warps EM radiation. Rainbows, sun dogs and lens flares were meant to communicate this, but seems like a missed opportunity to, again, show rather than tell.\n\nUltimately I felt the film was a superficial emulation of Andrei Tarkovsky, and a drop-off from *Ex Machina.*",
        "created_utc": 1530575399,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a name for this kind of cut?",
        "author": "wackyg",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vm4nd/is_there_a_name_for_this_kind_of_cut/",
        "text": "Hello! There's one editing technique that always takes my breath away when I see it. It takes one shot and then loops it once or twice before continuing the shot/cutting to a new one. I associate it most with George Kuchar because it can be found in [Hold Me While I'm Naked](https://youtu.be/FCB6xSHHG50?t=8m15s) (my favorite example) and *Eclipse of the Sun Virgin*, but it's also in [Do The Right Thing](https://youtu.be/zeyaRxHhVu4?t=5s)*.* Can you think of any other example, or know if this has an official name? Thanks.",
        "created_utc": 1530564518,
        "upvote_ratio": ""
    },
    {
        "title": "What are the \"cracks and pops\" on old film called?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vlevd/what_are_the_cracks_and_pops_on_old_film_called/",
        "text": "[removed]",
        "created_utc": 1530559074,
        "upvote_ratio": ""
    },
    {
        "title": "Raging Bull — Scorsese's Redemption",
        "author": "DaKinginDaNorth1",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vkyh3/raging_bull_scorseses_redemption/",
        "text": "Video Essay: [https://youtu.be/eYLKKS2p5b4](https://youtu.be/eYLKKS2p5b4)\n\n**Raging Bull — Scorsese's Redemption**\n\n“I wouldn’t want to belong to a club that would have me as a member.” - Groucho Marx\n\nPeople have a strange fascination with stories about violent, tortured characters. Scorsese is a master at putting these stories onscreen, as many of his movies explore the lives of people that aren’t exactly role models. Jake LaMotta is one of those people and Raging Bull is one of those movies. While it may not be the most “rewatchable” work in Scorsese’s filmography, the black and white film about a man’s capacity to self-destruct acted as one of the filmmaker’s most important statements of what film could ultimately aspire to. Raging Bull is not a boxing movie; it’s a film about a man’s inability to cope with his jealousy and anger, completely blinded by his sexual insecurities. The ring is his confession room, the punches he receives his punishment. The best stories are intimate and Raging Bull is no exception. Today we’ll analyze the techniques used to make this classic film so effective and how a movie about self-destructive brutality saved Martin Scorsese’s career and maybe even his own life.\n\nThe story behind Raging Bull is almost as interesting as the film itself. Scorsese actually had no interest in directing the movie, having rejected Robert De Niro who presented the book to him several times in the late 70’s. The director said he had no idea what the story was about and he was never a fan of sports, which made it very hard to convince him to make the movie. But things were about to drastically change. At the turn of the decade, Scorsese was devastated by the poor commercial reception of his latest film *New York, New York*, which was only followed by a cocaine overdose that nearly killed the young filmmaker. De Niro visited Scorsese in the hospital and at that point in their lives, they were both in De Niro’s own words “like brothers”. He had been obsessing over this story for years and he knew Scorsese was the man for the job. The real question was whether Scorsese would make any new films at all, let alone one as emotionally taxing as Raging Bull. Finally, he realized this was the story about a man eaten alive by his own uncontrollable emotions, who lashed out at anyone who was trying to help him. Relating to his own life, Scorsese saw Jake LaMotta’s story as an avenue for redemption. Besides, this way he would be able to save his own life not to mention his career. Having related very personally to Raging Bull, he saw in it how the boxing ring can be “an allegory for whatever you do in life. You make movies, you’re in the ring each time.”\n\nDe Niro went through extensive training to prepare for the role and was trained by none other than the real Jake LaMotta. He found boxing came naturally to him and even entered three fights in Brooklyn, of which he won two. According to LaMotta, De Niro was one of the top 20 middleweight boxers of all time. Preparation for the film began with some shots of De Niro boxing in a ring. When the footage was reviewed they noted that the color of the gloves at the time had to be maroon, oxblood or even black. This contributed as one of the reasons to film the movie in black and white; but another reason would be to distinguish Raging Bull from other color films around at the time, especially Rocky. The black-and-white photography by Michael Chapman, as well as the clothes and environment successfully capture the spirit of the 1940s.\n\nThe opening credits of the film are so brilliant because they tell you everything you need to know about Jake LaMotta. His shadow boxing is the ultimate performance of masculinity, showing his strength and rage. The ring almost looks like a cage, making Jake look like a wild beast. There’s no one around. He’s fighting his toughest opponent: himself. This illustrates Jake’s need to constantly sabotage his own life due to his own neuroses, fighting back without the need to do so. The music elevates the scene to a dreamlike scenario, making Jake’s furious display look like a truly graceful performance. Because of his lack of interest in sports, Scorsese never wanted the film to be a realistic depiction of boxing. Instead, he created beautiful dreamlike sequences, where the brutality of boxing is shifted into opera. \n\nIt was mentioned before that this isn’t a boxing movie. At its core Raging Bull deals with a man’s failure to overcome his sexual insecurity and rage. A woman in Jake LaMotta’s mind can only be two things: A virgin or a whore. When Vickie shows up for the first time we see a teenager who seems much older than her age, we notice how she’s already cool with mobsters and has a supremely confident gaze. She knows the score and calculates her way to get it. When Jake sees her for the first time, in his mind she acts as an unattainable goddess, an inaccessible sexual fantasy. But then when he does get her, he becomes insecure and obsessed by his jealousy. Freud famously coined this term as the “madonna-whore complex”. This basically means that Jake desires a woman who he perceives as a virgin, a saint. Any woman who isn’t a virgin is a slut so when he gets together with Vickie his holy image of her fades away. Jake is so insecure about his own masculinity that he wants a woman to sleep with him, but if she does he cannot respect her. Because in his mind, she would probably rather sleep with anyone else. Once they marry, he becomes convinced that she has been unfaithful. Through point of view shots and slow motion, Scorsese is able to transmit his jealousy. In some of these scenes, Vickie seems to float towards other men. This illustrates LaMotta’s exaggeration of any event that involves his wife talking to men. This insecurity even gets to the point where Jake is so sure that Vickie has cheated on him with his brother Joey. \n\nThis is one of De Niro’s best performances, it’s one where the character he plays is never really introspective nor does he express his feelings in the form of a voice-over like in other Scorsese films or even through expository dialogue. But his expressions and how the people close to him react are all we need to know about his character. Desire, jealousy and anger comprise the main emotions he exhibits. The movie never concerns itself with focusing on boxing tactics or training. Instead, what happens inside the ring is guided by Jake’s emotions, his fears and insecurities are what drive his rage. Although they occupy minimal time on screen, the fight scenes are truly unforgettable. The camera seems to dance in the ring alongside Jake, as the soundtrack swoops in and out with crowd noise and animal sounds; as well as the sound of flashbulbs that were recreated by smashing glass. Every blow is accentuated by heavy impacts on the soundtrack and along the mesmerizing sound effects and photography, the fights are also extremely brutal. Gushes of blood and sweat repeatedly spurt out, which may be another reason why the film is shot in black and white.\n\nRaging Bull succeeds as the ultimate film about the conflicts of a man burdened by jealousy and rage. It’s a movie about the low self-esteem, anger and insecurity that leads some men to abuse women. Jake LaMotta’s lack of control over his paranoia led him to battle it out in the ring, at home and everywhere until everybody around him was gone. In the end, Jake blames himself for his failures as he talks to his own reflection in the mirror, realizing it’s his own fault that everyone around him is gone. But then again, the Marlon Brando monologue from On the Waterfront is an interesting choice to close the movie with. In the famous movie scene Brando, a washed-up boxer, blames his brother for how his life turned out: “It was you Charlie. It was you.” It may be that Scorsese wanted to emphasize that Jake will always be alone because he could never show accountability for his actions. While most of the movie we feel disgusted by Jake, in the end, it’s mostly pity that we feel. \n\nIt’s an uncomfortable movie to watch, and as hard as it may be to relate to Jake, we can see a part of ourselves taken to the extreme. The ring just becomes an analogy of whatever you do in life. And it’s how you feel about yourself that affects everything surrounding you. If you’re insecure and angry it will begin to tear you down. The real question is how far will you go until you self-destruct?\n\nVideo Essay: [https://youtu.be/eYLKKS2p5b4](https://youtu.be/eYLKKS2p5b4)",
        "created_utc": 1530555793,
        "upvote_ratio": ""
    },
    {
        "title": "Incredibles 2",
        "author": "ms300000",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vkb4w/incredibles_2/",
        "text": "Repost: It seems I didn't understand labels. I removed a lot, and tried to make it more clear. I'm trying to pick apart ideas that scenes are having on a meta level. With how much this movie shows televisions and talks about watching media I want to analyze it on this level. \n\n\n\nIncredibles 2 opens with this romantic idea of a villain fight. Everyone is doing the masculine action of fighting the villain. The family is in chaos, and the villain gets away. After this fight, the movie slaps you in the face. They can’t go back to their house. The organization that helps them is shut down.\n\nThey have a family fight over dinner. The dad represents romantic ideals of being yourself, while the mom is set on them just surviving. While they are talking about superpowers, they are also arguing the different ideologies of today, and of that time in the sixties. \n\n    Then a romantic comes to the rescue. He knows the theme songs. He idolizes supers. He wants to make a political change. He gives them the power to do this. He chooses the Mother to make this change. The Mom is reinvigorated with life and thrives, her cynical acceptance of their situation drops. His sister(the villain) is a cynic. She sees the world(and us) as sheep staring at screens, consuming products.\n\n    Jack jack is watching tv one night and sees a cop fighting a crook. He then spots a raccoon, and fights with it. This movie is arguing that the things we watch do have an impact on us. The majority of the film is showing empowered women, and the dad struggling in his mother role. This movie is trying to do for the world as what tv did for jack jack. Void is this inspired girl the movie wants to impress.  \n\n    Elastigirl and the villain have a conversation early in the movie about the nature of their campaign. The cynic in her says that their political campaign is just what its sold as, not what it is. This applies to the movie itself. That would make this just another superhero film. Are we sheep for liking this? Its structured the same as the first one, with many of the same scenes. The memory wipe scene. The dinner scene. Elastigirl struggles to fly a jet. One of the parents go off to do superheroing. They even argue over pushing a button at one point. Etc. \n\nExcept it works so well on its surface level. The cinematography and animation quality set a new standard. The soundtrack and visuals blare its noir setting. It even uses experimental abrasive visuals in the epilepsy room fight. It has so many creative ideas. The ship, the bike, jack jack’s powers, the house, the new supers, and screenslayers abilities. \n\nSo no, this movie isn’t just marketing, or spewing of politics. It wins its battle against this cynical villain. It has nuance. Elastigirl says before shooting Screenslayer, ”At least I have values”. Mr.Incredible uses his masculinity and determination to succeed in caring for the kids. We need to progress our societal ideas, without throwing the super-baby out with the bathwater. We need to help each other, as the know-it-all Edna helps Mr.Incredible. We will win in the end, with supers legalized. Just as it's not rejecting all american values, its not denying the superhero movie values of having a happy ending. \n\n",
        "created_utc": 1530551181,
        "upvote_ratio": ""
    },
    {
        "title": "\"The worst thing that could happen is that you'll learn something about yourself.\" Why Woody Allen is the most personal filmmaker",
        "author": "kidneybean34",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vk6wd/the_worst_thing_that_could_happen_is_that_youll/",
        "text": "Last night I watched Woody Allen's Manhattan for the first time, and as I was watching, I realized that Woody Allen just might be the most personal filmmaker ever. Now, keep in mind that I've only seen two of his films, Annie Hall and Manhattan so this is simply what I've gathered from them. I do plan to watch all of his films one day and I'm slowly working my way through his collection. This is mainly going to be a discussion about Manhattan but I'm going to throw in a few points about Annie Hall if I feel it's necessary.\n\nAnyways, as I was saying, I think Woody Allen is one of the most personal filmmakers ever. He writes, directs and acts (as the main character) in his films and there's no doubt that he puts a lot of himself into his films. But I think many people overlook just how much of himself he puts into his films. Woody Allen very clearly plays a very close version of himself in both Manhattan and Annie Hall. He places himself into his films and they are undoubtedly about him. Alvy and Isaac are extremely comparable characters, they are practically the same person. It seems to me that Woody Allen in Manhattan and Annie Hall has taken a different flaw of his and put it into each character for the respective film. \n\nLet me explain. In Manhattan one of the main issues it deals with is selfishness. Isaac is shown to be a selfish character, as many of the other characters point out. It's ultimately proved when he asks Tracy to stay back from London at the end of the film. He does this because he's selfish wants her for her companionship, not because he actually loves her or cares about her. At first, he tries to get rid of her because he doesn't want the burden of a young girl and he also is more interested in Mary. Then, it becomes the opposite. After Mary has left him, his only option is Tracy and he no longer cares about her age or her being a burden. He only cares about how it will benefit him. In his ex-wife's book, she talks about him being self-centred and egotistical and she is absolutely right. It's obvious that Isaac shares a lot in common with Woody Allen and I think that Woody Allen makes these characters so similar to himself so that he can identify his flaws and deal with them in the form of film. He seems to be a very self aware person. He recognizes that he talks a lot, he recognizes that he has a whiny voice and he recognizes one of his biggest flaws of being selfish. He gives these characters these flaws because he recognizes that they are his flaws too. \n\nA lot of people argue that Woody Allen paints himself as a much better, glorified version of himself in his movies. I've heard people say that he views himself as this wonderfully attractive, smart, funny man because a lot of his films are about his relationships with women. This might be true, but a lot of people gloss over the fact that he also puts a lot of his flaws into his characters. You can't deny that Isaac and Alvy are very flawed in many ways, and that they are very representative of Woody Allen. I think that he really puts a heightened version of himself into his films. He's very self aware. Hes aware of his flaws. Some directors choose to make movies that aren't about them at all, that aren't obviously personal, like Paul Thomas Anderson or Stanely Kubrick and others choose to make films that directly deal with their personal lives like Tarkovsky or Woody Allen. I think this part of Woody Allen's films is generally overlooked. A lot of people recognize that he plays himself in films like Manhattan or Annie Hall, but they don't really realize the extent that he does this. He's a really self aware person and in my personal experience, he makes some of the most personal films I've seen. \n\nAnyways, that's what I have to say. This entire post might be pointless because I could just be saying things that everyone already knows, but I don't know. Its just what I noticed and I thought it might do me some good to make a post unlike my normal posts. Also, I just want to clarify and say that I'm not saying that directors like Stanley Kubrick or PTA don't make personal films, because they do to some extent. I've heard Paul Thomas Anderson talk about how his films deal with the passing of his father and other themes. I just don't think they're personal to the same extent that other directors' movies are and they're not ad obviously personal, I guess. Just my opinion. Hopefully this post wasn't too pointless. \n\n",
        "created_utc": 1530550356,
        "upvote_ratio": ""
    },
    {
        "title": "Incredibles 2 is misunderstood",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vjs7v/incredibles_2_is_misunderstood/",
        "text": "[deleted]",
        "created_utc": 1530547468,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (July 02, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8viy2k/casual_discussion_thread_july_02_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/)\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1530540804,
        "upvote_ratio": ""
    },
    {
        "title": "Animated films like The Red Turtle and The Tale of the Princess Kayuga?",
        "author": "fickle_bickle",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vhuch/animated_films_like_the_red_turtle_and_the_tale/",
        "text": "[removed]",
        "created_utc": 1530530274,
        "upvote_ratio": ""
    },
    {
        "title": "For Japanese film fans - I wrote a paper about Yasujiro Ozu's influence on Hirokazu Kore-eda",
        "author": "thewx1997",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vgvca/for_japanese_film_fans_i_wrote_a_paper_about/",
        "text": "HI! Love this sub with all my heart\n\nFinished this paper for a university course called \"Japanese Literature and Film - The Art of Storytelling\". Really enjoyed my first ever class of in-depth studying cinematography and film. Thought maybe some people here would be interested. Here's the link to the [final paper](https://drive.google.com/open?id=12quCWCl8zbg6oIarEV9tBF1IqBzrxeaV) , it's quite loongg so here's the [final presentation](https://drive.google.com/open?id=1ar3s7cfjZZdu0c-Ns6u4xiWji6A7kd-I), a lot more visual and shorter!\n\nI also can't waiitttt to watch Kore-eda's The Shoplifters fuckkkk\n\nLet me know what you think haha",
        "created_utc": 1530517692,
        "upvote_ratio": ""
    },
    {
        "title": "Sicario: Day of the Soldado: A Reflection of Trump's World View (Even Beyond Immigration Policy)?",
        "author": "DoomGoober",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vfv6o/sicario_day_of_the_soldado_a_reflection_of_trumps/",
        "text": "This is one of those terrible sequels that retroactively negates what made the preceding movie so excellent. The original Sicario was a puzzle box of grim legal logic wrapped around a machisimo's wet dream fantasy: How do you legally send well trained and well armed American Special Forces to fight undeniably evil Mexican drug cartels? And how badass would that be?\n\nThe sequel completely dispenses with any premise of legality once the war on cartels becomes a war on terror. The only surprised response to this dramatic shift in foreign policy is from an arms dealer (who is happy to break the law once granted immunity) then... CIA contractors are flying armed drones and helicopters and driving Humvees with impunity all around Mexico and killing Mexican Federal Police. While this is not unbelievable, given how the war on terror violates almost all legal norms, the affect on the movie is to cut itself in half, remove the cerebral parts, leaving only the \"badass\" parts.\n\nEven worse this illegal war on terror is switched OFF as quickly as its switched ON, like a child playing with a light switch, and the movie crashes back to Earth before reaching orbit except for one more illegal mission back into Mexico which ends with nearly 2 dozen men fighting against some poorly armed Coyotes (who are drug cartel associated but really most of them are pretty innocent kids in the grand scheme of things.)\n\nThe original was great because it was concerned as much with HOW/WHY to get American Special Forces versus Drug Cartels as WHAT happens when the bullets start flying. The sequel basically says \"That HOW/WHY question doesn't matter. And it shouldn't have mattered in the first movie. Let's just focus on WHAT happens.\"\n\nIn a way, it's a perfect reflection of our modern politics: The ignoring of international norms and thoughtful legality for force, as if they were just some quaint optional convention or polite manners. But by simply discarding convention and legality and thought without a blink of an eye, we end up mocking the thoughtfulness and legality we previous clung to.\n\nNot to mention that two stone cold killers suddenly grow sentimental about a girl whom they barely even talk to (let's not forget what one of the stone cold killers did to two children in the first movie.) It's as if to say the only relationship that matters anymore is between individuals... and anything larger than that is meaningless, as though society has corrupted itself into insignificance. That's the true reflection of real life the film presents beyond the surface similarities to Trump's mostly imaginary drug gang, murderous rapist immigrants.",
        "created_utc": 1530505872,
        "upvote_ratio": ""
    },
    {
        "title": "Link to Masculin Feminin????",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vf0pn/link_to_masculin_feminin/",
        "text": "[removed]",
        "created_utc": 1530497170,
        "upvote_ratio": ""
    },
    {
        "title": "Baby Driver (2017) The character progression",
        "author": "Hatefiend",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vexa7/baby_driver_2017_the_character_progression/",
        "text": "I'm going to keep this short and sweet. Did anyone else find it odd how the characters behaved in Baby Driver (2017) towards the ending of the film?\n\nThe most egregious in my opinion is Debora. I know the director was going for the bonnie and clyde ending (they directly state it in the dialogue at one point) but there is no way Debora would suddenly follow baby after all that she's seen. I can only suspend my disbelief so far. She saw Baby with the three other crime members and she knew he was mixed up in bad news. Then she is threatened at gunpoint in the diner. Suddenly after that, she is willing to follow him to the ends of the earth, willingly become an accomplice, go on the run, etc. It's just not believable.\n\n\n\nDoc's willingness to help Baby is random and unlike his character. He sees Debora and changes his mind, giving Baby a huge sum of cash and providing them with instructions to leave the country. Then gets tied up in a gun/vehicle fight? He dies for nothing essentially and his son now no longer has a father.\n\n\nBuddy and Darling also become Rambo incarnates charging directly at overwhelming police numbers when the whole movie has shown otherwise. \n\n\n\nI don't know, the whole third heist in the film did a complete 180 on character direction. I felt like I was watching a fresh new crime movie with amazing character design and the next I was watching Rush Hour 2. \n\n\n\nWhat did you think about the last act in the film?",
        "created_utc": 1530496279,
        "upvote_ratio": ""
    },
    {
        "title": "Why is this scene from Django Unchained so awesome?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ve3m9/why_is_this_scene_from_django_unchained_so_awesome/",
        "text": "[removed]",
        "created_utc": 1530488384,
        "upvote_ratio": ""
    },
    {
        "title": "Kimi No Na Wa (Your Name)- The Beauty of Connection",
        "author": "anishmohanty",
        "url": "https://www.youtube.com/watch?v=gLMd4LtwumY",
        "text": "",
        "created_utc": 1530487853,
        "upvote_ratio": ""
    },
    {
        "title": "Movie Series You Rank In Release Order",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vdyl6/movie_series_you_rank_in_release_order/",
        "text": "[removed]",
        "created_utc": 1530487053,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on The Master (2012)",
        "author": "Nyg500",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vd9yl/thoughts_on_the_master_2012/",
        "text": "First of all I just want to point out just how well made of a film this is. I recently saw the blu-ray and the cinematography and colors really stood out as well as the fantastic music. The editing and pacing gives the film a dreamlike and hypnotizing vibe that is difficult to explain. Most of all, what makes the movie great are the performances of Joaquin Phoenix and Phillip Seymour-Hoffman. They both give rare once-in-a-lifetime performances in the same film. It's the kind of acting where you are hanging on to every word fascinated by what these people will do next, at least is was for me. Especially when they are portraying these incredibly rich characters. \n\nSPOILERS:::::;\n\nAnyway The Master is an absolutely fascinating film. The first time I saw it I really didn't know what to think and I believe that is a pretty common reaction to the movie. A lot of people didn't appreciate the film because they were looking for some kind of overarching meaning, theme, or resolution and The Master just doesn't have one. Some may think this means the film is pointless but I don't think that's true either. Actually, the film is about so many things; how soldiers adjusted to coming home from WW2, The roots and belief system of Scientology, the draw of religions as well as cults, etc. But to me the film is mostly about the bizarre connection between these two characters. PTA simply takes this two complex characters with unique back stories, puts them together and portrays their relationship realistically. He wants the viewer to draw their own conclusions about them.\n\nSo I think that Lancaster Dodd has cemented this whole belief system based on achieving human perfection using his methods. He believes that man is not an animal but spiritually and intellectually superior and his techniques are used to counter past traumas which cause human beings to miss out on their full potential. He meets Fredie Quell who is the absolute antithesis to what he sees as an elevated human being. Freddie IS an animal who has no control over his emotions or his reactions to them. I found him to be very similar to Jake Lamotta from Raging Bull. A character with intensely strong feelings that he just cannot suppress. Quell is sexually preoccupied, fights for no real reason, and is completely damaged by his past traumas (his parents, experiences in war, and especially the fact that he abandoned the love of his life Doris). He can't control his anger but also is unable to stop himself from crying as we hear about his reaction to receiving a letter from Doris while at sea. Dodd sees all of this in Freddie and decides that he would make the perfect guinea pig. If he could change Freddie then it would 100&amp;#37; prove that \"The Cause\" is the real deal. At the same time, Dodd is drawn to Freddie for reasons that become more clear as the film continues.\n\nSo Lancaster works to change Freddie into a more stable and elevated person. Many of his techniques are employed to regulate Freddie's reactive behaviors. He tells him that fighting is \"not the way\", forces him to walk back and forth across the room thousands of times, and makes him listen to verbal abuse without responding. At times Freddie does seem to be improving but in the end these methods don't really work. We can see at the end that Freddie is just as likely to beat someone up and fixate on sex as he was in the beginning. So Freddie really doesn't change but Dodd does. Freddie's lack of progress makes Lancaster Dodd doubt himself and his teachings. We see Dodd become nervous before speaking to a crowd and lose control of HIS emotions when questioned. So instead of Freddie becoming more like Dodd, Dodd becomes more like Freddie. He begins to reveal his \"Id\" and loses control of his emotions more and more. In addition, I think he comes to a realization that his teachings are false. Freddie is proof that \"The Cause\" is bullshit as Lancaster could not change him. Even Dodd's children support the fact that \"The Cause\" is worthless. His son outwardly disagrees with his father's methods but seems to stay because its convenient and easy and his daughter basically sexually abuses Freddie after getting married. Freddie doesn't just make Dodd doubt himself but also seems to change his values and beliefs.\n\nWhat's really fascinating is watching Dodd gain greater respect for Freddie and his way of life. He sees that Freddie is truly genuine, a free spirit, he does what he wants when he wants and answers to no one. Dodd is known as the \"Master\" but has to answer to higher authorities himself such as the legal system, his followers who now depend on him, and most of all his wife who manipulates and has control over him. I think he begins to question if Freddie is closer to the \"Perfect Human\" than his rhetoric reinforces, that maybe man is and should be an animal. In the end Dodd kind of sets Freddie free by telling him he never wants to see him again. He knows that despite everything Freddie is better without him. In fact I think Dodd is jealous of Freddie. Dodd is stuck living a lie in constructing this religion that he doesn't seem to believe in anymore, while Freddie is free to go wherever he chooses. Freddie kind of relives the trauma of losing his best friend (Dodd even sings to him just like Doris did before they separated) but he seems to reach something of an acceptance with the way he is and is able to move on.\n\nAnyway there is a lot more I could say about this amazing film but I'll leave it at this for now. What are your thoughts?",
        "created_utc": 1530480873,
        "upvote_ratio": ""
    },
    {
        "title": "Rohmer's 1962 Le Signe du lion (The Sign of Leo)",
        "author": "topographical",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vcf2v/rohmers_1962_le_signe_du_lion_the_sign_of_leo/",
        "text": "Just got hold of the Eric Rohmer filmography after falling in love with \"Love (Chloe) in the Afternoon\" and this was the second in my list.\n\nWhat starts as what seems like a fun farce quickly quickly shows its true colors. The story starts with our financially precarious protagonist inexplicably inheriting a large sum of money from his Aunt. He then celebrates rambunctiously with his financially secure friends and lets everyone know about his fortune.\n\nHowever, he soon learns that it was not to be, and that the fortune was to be left to his cousin.\n\nWhat is presented next is a unique and haunting look at financial, and as a result, physical and mental decline.\n\nThe toll homelessness and financial ruin takes on the protagonist is incredibly vivid and palpable.\n\nIt is at once incremental as well as strikingly sudden.\n\nRohmer shows him mulling around Paris aimlessly and hopelessly in the same suit. You can almost feel the discomfort as he is trapped in this stone prison (Paris). We see him surrounded by people yet without anyone to help or connect to. In one scene we see him spill sardines on his only pair of pants and are shown his desperation as he attempts to remove it. An ordinary moment for most, but ruinous for our protagonist in his turmoil.\n\nIn another scene he is caught stealing fruit and is beaten by the shop owner in front of an entire crowd, perhaps the most intense moment of his despair. We hear the witnesses bemoaning the show owner for his treatment of the protagonist, but the protagonist doesn't hear this singular moment of empathy and decency.\n\nWithout a strong welfare safety net, we are reminded about how precarious our situations are, regardless of our superficial sense of security.\n\nThe image of our protagonist in his once fine suit traversing the Parisian desert (as it is for him) will stay with me for a very long time.\n\nRohmer's presentation of the ordinary is exceptional, and in this, he makes us look at experiences and things again, and ask ourselves new questions about them.",
        "created_utc": 1530473620,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of July 01, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8vaxao/what_have_you_been_watching_week_of_july_01_2018/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1530461436,
        "upvote_ratio": ""
    },
    {
        "title": "How do I deal with friends being on their phones during a movie?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8v79zg/how_do_i_deal_with_friends_being_on_their_phones/",
        "text": "[deleted]",
        "created_utc": 1530416461,
        "upvote_ratio": ""
    },
    {
        "title": "Learning to Interpret in-Depth Film",
        "author": "the_violent_turd",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8v6wxc/learning_to_interpret_indepth_film/",
        "text": "I think its been about 6 months since I've really began delving thoroughly in to film and frequenting this subreddit, and while I have seen many great films since and improved my knowledge of film, I feel like I'm missing something. Perhaps it is due to the fact that I'm still young (18) and new to in depth film, but I think I'm severely lacking in my own ability to to interpret. Over the past months, I have thoroughly enjoyed the works of the Coens, Kubrick and PTA to name a few, but I cant for the life of me see these films in the same depth that a lot of users do here. Regardless of my enjoyment of these films, I always find myself digging on youtube or this subreddit for answers and interpretations, rather than feeling truly emotionally and cerebrally invoked myself.    \n\n\nSo I wonder, does anyone else here feel lost and incapable of drawing their own vast interpretations and meanings of films? Have you always looked at film with the same in depth you do now? Is it normal to be left confused and uncertain by some of the recommended content here?  \n\n\nI hope I've made my point somewhat clear,\n\nThanks Guys.",
        "created_utc": 1530412420,
        "upvote_ratio": ""
    },
    {
        "title": "Any good podcasts on film analysis?",
        "author": "defeldus",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8v5icr/any_good_podcasts_on_film_analysis/",
        "text": "[removed]",
        "created_utc": 1530397901,
        "upvote_ratio": ""
    },
    {
        "title": "If you were the mom in the movie Room (2015), how would you try to escape?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8v4xxa/if_you_were_the_mom_in_the_movie_room_2015_how/",
        "text": "[removed]",
        "created_utc": 1530392667,
        "upvote_ratio": ""
    },
    {
        "title": "The rise of the 2.00 aspect ratio",
        "author": "PalmerDixon",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8v407x/the_rise_of_the_200_aspect_ratio/",
        "text": "Obviously, 16:9 (**1.78**) is one of the most important aspect ratios today resulting as a compromise between the European widescreen standard (1.66) and the US widescreen standard (1.85) on the one hand, and the practical use of presenting 4:3 movies (1.33; 1.37 \"Academy\") as well as scope movies (2.35; 2.39 etc.).\n\nBut if you are watching modern TV or in particular VoD series, you will come across a new aspect ratio that is about to replace 16:9. It is the **2.00** aspect ratio.  \nAlthough I must note that 2.00 is *not* entirely new and it is already been used in the [*Univisium*](https://en.wikipedia.org/wiki/Univisium) format by DoP Vittorio Storaro.\n\nIn any case, there has been a rise of usage of the 2.00 ratio in modern blockbusters (e.g., *Jurassic World* (2015)) and especially highly praised VoD shows on **Netflix** (*House of Cards*, *The Crown*, *Stranger Things*) and **Hulu** (*The Handmaid's Tale*), to name a few.\n\n&gt; \"Even the new Samsung S8 and the LG G6 smartphones have embraced the 2:1 aspect ratio in the consumer device market.\"  \n[\\(VashiVisuals 2017\\)](http://vashivisuals.com/the-hot-new-filmmaking-aspect-ratio/)\n\nNetflix even goes so far by making it filmmakers and show creators more difficult to use wider aspect ratios:\n\n&gt; \"Aspect ratios greater than 2.00:1 must be evaluated and discussed with Netflix for approval.\"  \n[(partnerhelp.netflixstudios.com)](https://partnerhelp.netflixstudios.com/hc/en-us/articles/360000579527-Cameras-and-Image-Capture)\n\nThis procedure is apparantly meant to not overstrain viewers with letterbox bars because it appears there are [some people](https://i.imgur.com/ysrV8YQ.png \"Source: /u/jacobsever, https://www.reddit.com/r/TrueFilm/comments/37jepr/why_dont_streaming_services_hbogo_starz_play/crnsgyg/\") who have difficulties watching scope films.\n\nWhat I am now wondering and at the same asking you: *Do we need this new aspect ratio?*\n\nRegarding blockbusters, I do not care honestly, but I would say it does not make much of a difference if a movie has an aspect ratio of 2.39 or 2.00 – well, only if you watch it in the cinema and especially not concerning uncreative works like *Jurassic World* mentioned above. Also movie aspect ratios vary anyway. But regarding the home video reception (i.e., Netflix and Hulu), you will **always** have black letterbox bars; although I am used to them as I strictly reject [*pan-and-scan*](https://en.wikipedia.org/wiki/Pan_and_scan).\n\nAt this point I also recommend this [article](http://www.tlvexp.ca/2013/07/are-2-35-films-really-more-cinematic-today/) which asks the question if scope films are still cinematic. The writer made the observation of fewer cinemas with actual *wide* screens (i.e., 2.35–2.40), thus creating letterboxes *in* the cinema!\n\nBut let me get this clear: I like those mentioned shows, I absolutely loved the visual style of the first season of *The Handmaid's Tale* and it kind of made sense after viewing some episodes that they decided on using this aspect ratio – at least on *that* show, I am not so sure about *Fargo S03* or *Stranger Things*.\n\nI think what most of us on this subreddit will agree on is to watch movies and shows in the **original aspect ratio** ***(OAR)*** because you can in fact achieve different kinds of styles with different kinds of aspect ratios.  \nWhat I am afraid of is a manifestation of an automatism like *\"You want to make your show on Netflix? Then you* ***have to*** *do it in 2.00\"*. And if there is no decision process where you choose your aspect ratio and choose against all others, then you only chosed it *for the looks*, the superficial appearance.\n\nWhat is your opinion? Is it necessary to use letterboxes to force this \"cinematic look\" – which is in fact a result, let's face it; otherwise creators of music videos would have found another pretentious way to stylize their works. But I do not need them when I watch \"TV\" series because my TV is 16:9 (and not 21:9 like some models).\n\nLet me hear your arguments why there are also *good* reasons to shoot prestigious VoD shows in 2.00, although you receive them on your 16:9 TV.\n\n**TL;DR:** Netflix &amp; Co. are going from shooting shows in 16:9 to a new aspect ratio, i.e., 2.00. Since they are still for the TV reception, you will always see those shows with black bars (letterboxes). Does this achieve just a pretentious cinematic look or are there reasons for this unification?\n\n---\n\nI hope anyone could understand what I was babbling about. And I am also glad about feedback regarding my English skills as I am not a native English speaker.",
        "created_utc": 1530384466,
        "upvote_ratio": ""
    },
    {
        "title": "One of the worst film essays I've seen in awhile. New Yorker article on how Trump and David Lynch have more in common.",
        "author": "Bertrum",
        "url": "https://www.newyorker.com/culture/culture-desk/donald-trumps-america-and-the-visions-of-david-lynch",
        "text": "",
        "created_utc": 1530371889,
        "upvote_ratio": ""
    },
    {
        "title": "PSA: User u/ComeBackLucy1978 (alt: u/SunlessSeas) has been sneaking links to scam sites in his discussion posts. Beware.",
        "author": "PlatonsDeAlbondigas",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8v2g8k/psa_user_ucomebacklucy1978_alt_usunlessseas_has/",
        "text": "Over the last couple of days user u/ComeBackLucy1978 (/u/sunlessseas)  started the following threads:\n\n- https://www.reddit.com/r/TrueFilm/comments/8uwmmo/the_great_slovak_master_juraj_jakubiskos/ (Imgur: https://i.imgur.com/z8cSfWw.jpg)\n\n- https://www.reddit.com/r/TrueFilm/comments/8umea3/homespun_apocalypse_a_brilliant_retrospective/ (Imgur: https://i.imgur.com/1GOpZLr.jpg)\n\n- https://www.reddit.com/r/TrueFilm/comments/8uq2bq/the_great_konstantin_lopushanskys_towering/ (Imgur: https://i.imgur.com/egC2e5u.jpg)\n\nUnder both mentioned accounts he links to two websites that offer streaming and downloading of Eastern European and Russian movies, sometimes using both accounts in the same thread (https://i.imgur.com/DtfbxNy.jpg). \n\nOn occasion, he might forget that he switched accounts when promoting those websites (https://i.imgur.com/e5yw8y1.jpg).\n\nNow, the websites mentioned in his posts offer the option to pay for a monthly subscription that grants you access to a library of movies that they DO NOT hold the streaming and distribution rights to. Basically, it's a paid pirating site.\n\nWhile most of the films on his site are, in fact, available to LEGALLY stream and purchase on a number of websites, some are not. I have no intention of breaking this subreddit's rules by linking to illegal website, but suffice to say that if you're willing to go that route, there are options available that don't include paying on a shady website.",
        "created_utc": 1530371419,
        "upvote_ratio": ""
    },
    {
        "title": "Are there movies similar to \"Syriana\", \"The Wire(TV Series)\", \"The Big Short\", \"Steve Jobs\", \"In the Loop\", \"Tinker Tailor Soldier Spy\", \"The Social Network\", and to an extent \"Zodiac\", \"Spotlight\" , \"Moneyball\" and \"Foxcatcher\"?",
        "author": "Rajatbhat",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8v2c5u/are_there_movies_similar_to_syriana_the_wiretv/",
        "text": "[removed]",
        "created_utc": 1530370329,
        "upvote_ratio": ""
    },
    {
        "title": "Just My Luck (2006) is an anal stage parable!",
        "author": "Filmandthink",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8v0lyd/just_my_luck_2006_is_an_anal_stage_parable/",
        "text": "The movie has an obsession with feces-related puns (\"I'm shit out of luck\"), mise-en-scene (an art show with an actual mound of feces at the center, see picture) and related activities (Ashley cleans bathrooms after switching jobs with Jake).\n\nCentering on the development of Ashley as she gradually realizes the hard realities of trying to make it in the ultracompetitive New York ad-agency world, the movie follows her as she \"grows up\" by switching \"luck\" with a bathroom cleaner, Jake, who is often literally covered in shit (grabbing a dollar note used to pick up a dog poo, being hit by bird droppings).\n\n\"The anal stage is also associated with the desire for retention and possessive control (as in \"granting or withholding\" the feces).\" - (p. 1) http://www.aui.ma/personal/…/1204/dunkley/psychoanalysis.pdf\n\nWhat is happening is that Ashley is taking erotic delight in her own bodily functions, but without as yet being able to view her body as a complete object.\n\nNear the end of the movie Ashley proceeds through the mirror phase (of Lacan) by truly seeing her own reflection for the first time in a broken mirror (at her friends' house where she is sleeping in a couch) and realizing that her withholding what she learned from the feces from Jake is sadistic. During the end of the movie, Jake opens a bottle of champagne and sprays the bubbly liquid over an excited crowd symbolizing Ashley's entry into the phallic or symbolic order.\n\nIn the very last sequence Ashley realizes that her \"luck\" was really her lack of awareness (of her body as a complete independent object not an extension of her mother's breast and thus infantilized) and they \"grant\" the \"luck\" to Jake's young neighbor by kissing her on the cheeks thus symbolizing the perpetual cycle starting over.\n\n\"Thus, as a result of the transition from the imaginary to the symbolic order -- to the construction of the self-image and the acquisition of language -- the child is socialized into the family through acknowledgment and acceptance of difference (in gender) and absence (of the mother's body).\" - (p. 5) http://www.aui.ma/personal/…/1204/dunkley/psychoanalysis.pdf\n\nI thought this interpretation was equal parts hilarious and in some way meaningful in terms of the inane quality of the movie. What do you think?",
        "created_utc": 1530348759,
        "upvote_ratio": ""
    },
    {
        "title": "Cloud Atlas - The Hope of Immortality",
        "author": "renegadecutmedia",
        "url": "https://www.youtube.com/watch?v=UaIUltRyRjc",
        "text": "",
        "created_utc": 1530340748,
        "upvote_ratio": ""
    },
    {
        "title": "in Lord of War, why do the African children hold fake guns made of wire?",
        "author": "[deleted]",
        "url": "https://imgur.com/a/PIR3FnF",
        "text": "[deleted]",
        "created_utc": 1530335864,
        "upvote_ratio": ""
    },
    {
        "title": "VIDEO: Defending Rian Johnson &amp; THE LAST JEDI",
        "author": "mrsaltyspitoon",
        "url": "https://youtu.be/kXnhdxck0pQ",
        "text": "",
        "created_utc": 1530334543,
        "upvote_ratio": ""
    },
    {
        "title": "The Most 'Obscure' Film You've Ever Seen",
        "author": "meme_lobster",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uyhen/the_most_obscure_film_youve_ever_seen/",
        "text": "I thought it would be interesting to start a discussion about this; what film that you've seen is the farthest of all from the general consciousness of most people or cinephiles? How did you find out about it, what about it piqued your interest, how did you get access to it, and did it end up being good? \nIt's probably better to define 'obscure' as 'as far from your world as possible' because it's sort of a nebulous concept.\nI think this might be an interesting way to shed light on some films we may never find on our own, and perhaps see if other people have heard of ours (and test our hipster cinephile machismo by comparing the obscurity of films we've seen).",
        "created_utc": 1530322778,
        "upvote_ratio": ""
    },
    {
        "title": "My Thoughts on The Tree of Life",
        "author": "kidneybean34",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uy7po/my_thoughts_on_the_tree_of_life/",
        "text": "Okay so I finally watched the Tree of Life last night and to say the least....it was interesting. I don't even really know what this post is going to be. Its not going to be very articulate, of that I'm sure. In just going to write down my thoughts on this film and see what it ends up as. \n\nSo, my rating of The Tree of Life is 5/10. I chose this rating mostly because I didn't really know what else to rate it. This is the second steam of consciousness/dream sequence movie I've seen, the first being The Mirror (which I literally rated as ?/?). I'm very new to this type if narrative and I'm slowly learning what these movies mean. I really find the non linear, stream of consciousness narrative very interesting and I even have ideas for my own. Anyways, basically, I'm pretty unfamiliar with this type of movie, so I'm open to constructive criticism. I will say that I understand you have to go into movies like this with an open mind and you can't have any expectations. I also know that movies like these are very much about the experience rather than the actual story. I know that these types of movies are very personal and it can take multiple viewings before they really make sense. \n\nNow I rated The Tree of Life as 5/10 because, well for one I was stumped what I should rate it, but my main reason is because parts of it I really enjoyed while others I couldn't quite grasp. For example, I really enjoyed the actual story of the film. I liked the story of a young boy and his relationship with his father. I liked learning who these characters were and what role they played. Another thing I liked was the overall tone of the movie. I think it achieved a perfect tone and feeling throughout the movie and it really added to the experience. It was a very different tone than any other movie I've seen and it was very interesting. Also, to point out the obvious, the acting and music were very spot on. There were also specific scenes that I really enjoyed. Most of the \"bulk\" of the movie had really good scenes and I seemed to enjoy most of them. I really enjoyed the whole journey through life part of it near the beginning. The imagery was stunning and beautiful. The dinosaur part was one of my favourite parts, but I really enjoyed that whole sequence. It was very special to watch it and that I'm it's one was a great piece of filmmaking. \n\nNow for what I didn't like, or at least what I'm confused about. There were several scenes that, while enjoyable, I didn't really understand what they added to the whole of the film. Like the attic scenes, which were beautiful and intriguing but I didn't quite get what their purpose was. Or the clown in the dunk tank, the first scene with the little girl on the farm, some of the ending with the entire family, the seemingly random imagery near the end with the dead bodies ect.  Some of it was really nice to watch but I didn't get what they added to the film or what their meaning was. Also, during the beginning of the film, I'd say about the first 45 minutes (other than the journey through life bit), I wasn't feeling too great. I couldn't really focus on a lot of it and I felt bored or disinterested. \n\nSo yeah, that's that. I guess I enjoyed most of the movie but there was a good amount of parts that I didn't to lower my rating a little. Looking back on it now, I can't quite pinpoint what my feelings on it are. While watching I didn't experience anything surreal or amazing. I didn't have some life-changing experience while watching it as so many others seem to describe. I enjoyed it a lot but I felt something was missing. \n\nOne way to put it is that when I watched The Mirror, I didn't really understand any of it (yes I had subtitles on don't worry) but I could sense what the director was trying to achieve. I might have been confused throughout most of the film, but I felt the importance of each scene and I felt that Tarkovsky was trying to reach some sort of goal. That's why I'm excited to watch it again in the future, that hopefully one day I'll be able to fully understand what Tarkovsky was trying to do. Now with The Tree of Life, I understood most of the scenes, but I felt that there was no goal for them. I couldn't sense in the slightest, what Malick was trying to achieve with the movie and that's why I feel confused I think. Its hard for me to imagine that after multiple viewings of this, I'll have that experience that Malick intended because really, I feel that he didn't intend anything in particular. I don't even know if any of that made sense honestly. \n\nLastly, I have a few questions that hopefully someone can answer for me in the comments. First, in the scene where Jack screams, \"he only loves me,\" what was the importance there? That scene seemed to be very crucial but I didn't really understand what Jack meant by that. Also, why didn't his father get angry at him for screaming like that?\n\nSecondly, for a hot minute in the movie, I thought one of the boys died. When they're swimming, one of them is drowning and things seem very intense. Then in the next scene, the family seems like they're at a funeral and the third boy isn't shown. That is, until the dinner table scene where there's three sons again! What exactly happened there??\n\nThird, what's the importance of some scenes that I mentioned like the clown in the dunk tank or the attic scenes or some parts where the mother lifts off the ground or the chair moves on it's own. What I got from the attic scenes was that it was a representation of Jack's feelings of being stuck. The attic is a small, cramped place and that's how Jack feels. When the really big, tall, distorted man is shown, I'm assuming that's a representation of how Jack's father overpowers him and controls him. That's what I got. Maybe the other scenes are just representative of how childhood memories work. They work in random flashes that don't really have any context. Not sure. \n\nOne other thing I gathered is that when Jack is a young boy and controlled by his father, who represents nature, there are shots of the sky that include trees and birds and many things that have to do with nature, and when Jack is older, these contrasting scenes include skyscrapers instead and things which are the opposite of nature. Also, while Jack struggles a lot as a young boy controlled by \"nature,\" he seems to struggle even more when he's grown and not controlled by nature anymore. This could be some sort of statement on tough love or the importance of a father son relationship. I could totally be reaching though. Just some observations. \n\nPlease tell me what you think!!! \n\n",
        "created_utc": 1530320009,
        "upvote_ratio": ""
    },
    {
        "title": "Any other films like this one?",
        "author": "midnightmatinees",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uxxfx/any_other_films_like_this_one/",
        "text": "[removed]",
        "created_utc": 1530317281,
        "upvote_ratio": ""
    },
    {
        "title": "Backstabbing for Beginners (2018): Who was Pasha?",
        "author": "tiltedsun",
        "url": "https://www.reddit.com/r/movies/comments/8upqy4/backstabbing_for_beginners_2018_who_was_pasha/",
        "text": "",
        "created_utc": 1530307014,
        "upvote_ratio": ""
    },
    {
        "title": "The great Slovak master Juraj Jakubisko's 'Perinbaba' ('The Feather Fairy) (1985)",
        "author": "ComeBackLucy1978",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uwmmo/the_great_slovak_master_juraj_jakubiskos/",
        "text": "Juraj Jakubisko's 1985 magical, ethereal, bizarre fantasy, 'Perinbaba', or, 'The Feather Fairy', starring Federico Fellini's wife Giullieta Massina.\n\n'Perinbaba' is one of the most unique, exquisitely shot, visually sumptuous fantasy films ever produced.  The set pieces are truly lavish &amp; sparkle with an ethereal quality that is uniquely Slovak, and uniquely Jakubisko.  Giullieta Massina is captivating as Perinbaba, and the scenes shot in her \"lair\" are pure wondrous, unforgettable eye candy.  There is something truly lucid &amp; childlike about this film.  The cinematography shimmers with an enchanting splendour that is all it's own.\n\nEnjoy 'Perinbaba' &amp; be sure to further explore more of the legendary Juraj Jakubisko's epic &amp; classic output!\n\n\\-Sunless Seas\n\n[http://thecinemaofeasterneurope.blogspot.com/2013/11/visual-diary-feather-fairy-perinbaba.html](http://thecinemaofeasterneurope.blogspot.com/2013/11/visual-diary-feather-fairy-perinbaba.html)\n\nAvailable here, in excellent quality, with English subs:  [https://easterneuropeanmovies.com/fantasy/40-the-feather-fairy.html](https://easterneuropeanmovies.com/fantasy/40-the-feather-fairy.html)",
        "created_utc": 1530305964,
        "upvote_ratio": ""
    },
    {
        "title": "I am watching of all Ingmar Bergman's works for the first time",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uwjtt/i_am_watching_of_all_ingmar_bergmans_works_for/",
        "text": "[removed]",
        "created_utc": 1530305334,
        "upvote_ratio": ""
    },
    {
        "title": "The Hunt (2012) - It's been a while since i've seen such a harrowing film",
        "author": "bxstb11y",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uw6ma/the_hunt_2012_its_been_a_while_since_ive_seen/",
        "text": "Thought provoking and emotional. Thomas Vinterberg's *The Hunt* was such an intense film.\nAt times tender, and other times it feels like an open heart surgery.\n\nI've never felt this stressed out (in a good way of course!) in a film since Lars Von Trier's *Dancer in The Dark*.\n\nWhat's up with these *Dogme 95* directors and their emotionally searing films?\n\nThere were moments where I wanted to punch that little girl Klara but at the same time I also empathize with her as a kid and being forced into complex situations. I'm actually surprised that she confessed multiple times. I don't know about everyone but I was that kid who would lie all the way just because of being embarrassed to recant something serious I have said before.\n\nMads was also really badass in this film. While at some point he was treated as a doormat (and i still question the reasons why he chooses to remain in that town) he has always stood with dignity. I like that even though he knows he's been ostracized he still goes to that rude grocery, and after being beat up, he steps back inside to head butt the guy who punched him. Also, even after being bloody and broken, he chooses to dress up impeccably and go to church.\n\nThe church scene. There were just so many emotions in there and I don't even know where to go. It was a powerful moment. I don't even want to break it down.\n\nA thing I found kind of funny but also bothering is how he was there while the kids were singing. Did everyone really just sweep his presence under the rug and didn't any of the adults think that his presence could be triggering for the children? (assuming that he really was a sex predator).\n\n*The Hunt* delivers a strong and challenging message that I feel is important to hear now, especially during these times where public awareness about sexual abuse and harassment is being put on the table. I call it challenging because we are taught (and I believe so too) that we should always listen and take seriously anyone who claims to be a victim. This can obviously be really problematic though when someone chooses to lie, and it can definitely happen.\n\nI myself have been on the end of being accused and judged for something I didn't do. I was expelled in my high school for that. Even my own mom didn't listen to me and she even went to the principal to *apologize* for me (I find that really shameful). The principal's son approached me while I was sitting by myself (He works at the school too) and snobbishly tells me \"so you're _____ huh?\" and walks away. That was the only time in my life where a person looked at me so smugly and with such malice even though they didn't really know anything about me, or what was the truth even. Being on the cross-hair of a heavy accusation is a painful experience.\n\nOn the other hand, I have friends who have been victims of sexual assault and when they came out, they were dismissed and even accused of lying. Truth is always such a profound and complex thing.\n\nI found the ending strange, yet in some ways fitting. There is suddenly faux peace. Everything is swept under the rug, yet it will never be the same. It can be said that the guy who shot at him could be only in his mind, but I personally believe someone really tried to put a bullet in him. Lucas will always be under the town's spite and cross-hair. I still seriously question why he chooses to stay in that town? someone there killed his fucking dog.\n\nOne last question I have is what does 'the hunt' as a coming of age ceremony for boys have to do with the main theme? I understand the metaphors of being 'witch hunted' and being in the cross-hair; you could also associate the idea of sexual *predators* and their prey. I feel like i'm missing something since there seemed to be a pronounced emphasis on 'the hunt' as a coming of age ceremony.",
        "created_utc": 1530302497,
        "upvote_ratio": ""
    },
    {
        "title": "The Silence of the Lambs- An intense psychological character study",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uv6y7/the_silence_of_the_lambs_an_intense_psychological/",
        "text": "What better way to celebrate the Criterion Sale this month than by talking about one of its recent additions. Like always if you want pictures they are in the link. [https://thefilmera.com/2018/06/29/film-frame-friday-the-silence-of-the-lambs/](https://thefilmera.com/2018/06/29/film-frame-friday-the-silence-of-the-lambs/)\n\nhttps://i.redd.it/h9ztspdzaz611.jpg\n\nI will be breaking up their meetings within the film because they are core to the central constructs of both characters. Utilizing director Jonathan Demme and cinematographer Tak Fujimoto's brilliant masterwork, we'll take each scene as an exploration of relationships and the status therein.\n\n**Please note: If you haven't watched** ***The Silence of the Lambs***\\*\\*, spoilers ahead.\\*\\*\n\n## First and Second Meetings\n\nIt’s important to break down Lecter’s role in this film. He does not appear in a lot of it but his scenes provide most of the significant character work being done here. Because there are so few meetings, they are punched up with maximum emotional resonance.\n\n[Clarice’s introduction to Lecter is completely startling](https://www.youtube.com/watch?v=QU8jKn7sMwU). She moves toward his cell and there he is—standing upright as though he has been waiting for her. Like she’s a bit of prey and as the predator, he sensed this meeting all along. There are a lot of implications here: Lecter’s size is used to create the larger-than-life literary persona from the books. Clarice is initially somewhat reticent around him and is working to stay on an even playing field.\n\n\"Come closer,\" Lecter growls, and then he demands to see her credentials.\n\nMuch of their scenes are done through way of point-of-view shots. This allows each character unique positioning. Clarice to the left of the frames, Lecter usually on the right. Worth noting, this is usually done to show a rupture between individuals in a shot. Sometimes it is used to this effect but also to show how they present to one another.\n\nShe shrinks in stature as the meeting progresses, taking a seat while examining his mind and getting to know the psychological makeup of a vicious, cannibalistic killer. This is a power exchange between the characters. She is opening her space and allowing him to come in. What she finds in him is that he is not so different from herself; despite his actions that prove otherwise, they share a part in the same mental game.\n\n[The second meeting turns the tables](https://www.youtube.com/watch?v=6qWRAGPQ11M). Lecter is shrunk down into a corner of his cell. Yes, now he is vulnerable, and we get to learn something of his character. This is a perfect opportunity for Clarice to provide more probing questions. There’s an unsettling frustration and tension in their exchanges here. We’re given suggestions of great abuse in the past, the way history has maladjusted the psyche of his character. Not just a bad guy but a very bad guy who is also mentally intriguing. A psychologist put out of practice by his own macabre habits. A cannibal with some remorse but only in the world of intellect. And now he wants to dine and the meal is of the mind.\n\n## Third Meeting\n\n[This is where we get a great character shift](https://www.youtube.com/watch?v=6XdRBJZn7EM). The actors’ positioning shows they are true equals. Lecter opens up enough to allow for laughs and to show his humanity behind all of the depravity. The truth is we find him incredibly charming—not simply because Hopkins is charming—but because he connects to some deep-rooted part of our spirit that wants to understand him.\n\nThe characters' relaxed postures imply familiarity and comfort with one another. In a brilliant moment of framing, we see Lecter cannot face Clarice. He must turn away once her own darkness is revealed. Now she has turned the mirror in on himself, and he sees the monstrosity of human behavior. His posture is racked with guilt and fear.\n\nMeanwhile, while divulging her own darkness, Clarice has come to accept Lecter’s own humanity. She sees the good in Lecter that also exists within herself. This great duality is one of the finest examples of character building in films. They understand each other—hell, they are the other person living out a different life.\n\nLecter finally comes to a position where he’s facing Clarice. His steely gaze reflects through the window of his cell, while his perspective shows a close-up of young, brilliant Clarice. Intricate contrast work is done on the imaging here. Significantly, each encounter has its own unique framing; nothing is added without first providing new value. The film is a masterclass on presenting the great gulf of difference and similarity between its two driving characters and a fascinating psychological study on how we come to interact with pure evil.\n\n## Fourth Meeting\n\n[This scene takes place in a gigantic room](https://www.youtube.com/watch?v=2LrFsXAvzqc) in the Sailors &amp; Soldiers Memorial Hall in Pittsburgh. Art adorns the walls, providing natural framing and line of sight elements. A large zoo-like cage sits in the room’s middle—separating Lecter from the rest of the world. He’s facing away, lounging back in his chair, engrossed in an original Russian language version of Tolstoy. We know that even in his confinement, Lecter remains a man of culture and refinement. He can find more inside a cell than many will find on the outside.\n\nWe get a quick swivel of his chair, and he’s staring between bars, right into Clarice’s soul. Notable here is that he’s changed into clinical whites. This, to imply a position of greater authority. He is, after all, nothing if not an impassioned man of the mind.\n\nThe scene is relayed like a flirtation. There’s a certain rhythmic exchange and expression of the syllables – Lecter’s “tick, tock, tick, tock.” Yes, they are friendly now. Almost a father-daughter relationship, to fulfill what has been missing in Clarice’s life. But not quite—more significantly, a relationship of the mind.\n\nHere, Lecter begins piecing together his psychological profile of Clarice. The visits have become much like sitting on the couch at one of his appointments. Even caged in, he maintains complete control of his situation and environment. The less he works with, the more he is able to physically exert control over his space. He determines Clarice was always bound to go down this road, a born hero, or one formed very early in her childhood. Close-ups reveal the intense emotional conflicts in their discourse. These extreme emotional outpourings cased in close-up shots convey that the two are connected at some higher philosophical level.\n\nThey are no longer different. Clarice has formed her own cell, we see as she recounts an old story. She is as imprisoned by her past as Lecter is by his present. Here is the great crux of the movie: that the good and the bad are not so very different. They are, in fact, closely related and utilize the same psychological profile to meet different needs. These complexities of character development can only be exchanged with the most perfect acting, cinematography and direction. This is paramount to the reason *The Silence of the Lambs* is broadly considered one of the best films to this day.\n\nAs a fun side note, following this meeting, Clarice is escorted out of the room by none other than *Night of the Living Dead* director George Romero.\n\n## Phone Call\n\nT[he film ends with a phone call ](https://www.youtube.com/watch?v=oPgiV9Wciy8)between Clarice and Lecter. He has found a new lunch, a victim to cannibalize. This is a hell of a way to end a picture. It shows that despite all of their connection and simultaneous emotional growth, their mental game exists in a place where they have fixed positions. She is, uncommonly for a typical movie, the woman hero who saves women, and he is a great psychological threat that comes in many layers. We’re left with a hanging shot and credits but are filled with a disbelief that any of this is over. This is only the start of a great chess game of the minds.",
        "created_utc": 1530294943,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (June 29, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8utfzy/casual_discussion_thread_june_29_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1530281635,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about watching films on higher fps?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8utcxk/how_do_you_feel_about_watching_films_on_higher_fps/",
        "text": "[deleted]",
        "created_utc": 1530280947,
        "upvote_ratio": ""
    },
    {
        "title": "Papillon (1973) - A brutal and exhausting movie that makes you grateful you aren't in prison",
        "author": "CineRanter-YTchannel",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8utc7c/papillon_1973_a_brutal_and_exhausting_movie_that/",
        "text": "Video version of this review:\n\nhttps://www.youtube.com/watch?v=KfPKaq7dhDY\n\nSome prison movies, though they show the horrible nature of prison and that the prisoners are robbed of the freedom of daily life, they are subject to abuse and the politics of the prison system etc you can’t help but feel with some prison movies that it would be kinda cool to be a prisoner in the prison that the depict. Films like The Shawshank Redemption and Cool Hand Luke do well in showcasing what prisoners are deprived of but I can’t help but sometimes naively be envious of the sense of comrade amongst the prisoners that is display, and I know this sounds really stupid but the 'homely' atmosphere that sometimes becomes ingrained into a prison film.\n\nPapillion is no such movie. If I ever become endangered enough to believe it would be cool to be in prison, this picture beats it out of me. I was pretty taken aback at how depraved and vividly brutal the film is. We see things like public executions where the camera doesn’t shy away from the decapitation, prisoners being put to heavy manual labour and fainting and dying on the spot out of exhaustion and nobody doing anything about it, and characters being starved in lightless cells months on end. Human life has no value, or at least prisoner life doesn’t, and the suffering of prisoners is normalized and seen as inconsequential. When you see inmates eating the slimy looking liquid that resembles their lunch blissfully beside a dead body of a man who took his own life by shoving a branch down his throat, you know the film isn’t pulling any punches. And it makes you grateful that you aren’t in prison.\n\nOur protagonist is Papillion, who I believe is supposed to be French although Steve McQueen sounds and looks as American as he ever does, and it’s suggested that he is imprisoned for a crime he didn’t commit. It’s not really the point of the film though, and the fact that the inmate who he befriends, played by Dustin Hoffman, was jailed for a non-violent crime emphasises that we’re supposed to be on their side. And who wouldn’t be after witnessing the incredibly unforgiving taks the inmates have to endure. \n\nPapillion is fixated on escape, and his numerous attempts at getting off the island he is on result in capture and harsher punishments being dished out on him. His plans usually fail due to the double-crossing of those whom he involves, and it happens so much you end up really feeling for the guy – despite his intelligent plans he just can’t catch a break. Elongated solitary confinement is what he is subjected to as a result of his attempts, and it’s here where amongst his moments of ever-increasing madness he has a momentary moment of reflection and contemplation, dreaming a dream where he accepts that he has lived a wasted life. I found this really interesting, and I did think to myself before this scene, seeing these men who committed fraud or unpicked locks do decades that it was such a sad wasteful existence. \n\nThe acting all-round is pretty neat. It didn’t blow me away but I felt everyone did their jobs efficiently. McQueen plays McQueen for the first hour or so, and when he is given solitary and begins to lose his mind he gives us some of the best work of his career. Old Papillion was a little weird though – it was like he was trying to do a Clint Eastwood impression. Hoffman excels as the goofy Dega though I didn't felt much chemistry between the two leads. Perhaps this was because we were witnessing two different generations, two wildly different styles of acting, or maybe it was because of slight tensions between the duo on set.\n\nFilmed on location, Director Franklin Schaffner did a good job in getting us right up close and personal with the jail. You feel dirty watching it, like you’re itching with disease or sweating under the heavy sun. The storytelling was a little ruff and fatiguing. Many times you feel like you’ve just witnessed the climax, and then you get another story thread, and then another and another – the film doesn’t really work in the first act, second act, third act kind of way. I suppose that comes with faithfully adapting a true life novel, because real life doesn’t work like a movie. And anyway, being is a state where you’re tired and worn out is the perfect way to appreciate the film’s ending. \n\nThis movie is a grim undertaking, but one that is also rich in adventure and not without the odd jabs of comedy. It’s may be one of the more punishing prison movies but it’s also one of the finest. 8/10. \n",
        "created_utc": 1530280791,
        "upvote_ratio": ""
    },
    {
        "title": "Ouija Seance: The Final Game is Inept Horror At Its Most Incoherent",
        "author": "hedgeskenny870",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8urv08/ouija_seance_the_final_game_is_inept_horror_at/",
        "text": "[removed]",
        "created_utc": 1530265251,
        "upvote_ratio": ""
    },
    {
        "title": "I watched 'salo or 120 days of sodom'",
        "author": "m15hu",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uqz6j/i_watched_salo_or_120_days_of_sodom/",
        "text": "[removed]",
        "created_utc": 1530253910,
        "upvote_ratio": ""
    },
    {
        "title": "The great Konstantin Lopushansky's towering, hulking epic, 'Russkaya Simfoniya' ('Russian Symphony') (1994)",
        "author": "ComeBackLucy1978",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uq2bq/the_great_konstantin_lopushanskys_towering/",
        "text": "For my money, perhaps the greatest Russian filmmaker of all-time, or at least top 3.  His legendary Apocalypse Quartet is infamous in his native Russia, where each film was met with heavy criticism &amp; division, as well as a ton of praise.  The first two films of the Quartet, 'Dead Man's Letters' &amp; 'A Visitor To A Museum' are heralded as two of the greatest Russian features ever produced, and the fourth, 2006's 'The Ugly Swans' was a massive hit in Russia.  The lesser known third film of the series, however, 'Russian Symphony', receives much, much less attention internationally, despite being the most highly praised of the four films by Russian film critics.  \n\nIncredibly dense, stunningly panoramic, painstakingly edited &amp; choreographed, and devastatingly grim, this masterwork by the great Lopushansky is a must see for any cinephile.\n\n[http://forgottenoldfilms.blogspot.com/2013/04/russkaya-simfoniya-russian-symphony.html](http://forgottenoldfilms.blogspot.com/2013/04/russkaya-simfoniya-russian-symphony.html)\n\nAvailable here with English subs:  [https://sovietmoviesonline.com/drama/776-russkaya-simfoniya.html](https://sovietmoviesonline.com/drama/776-russkaya-simfoniya.html)",
        "created_utc": 1530244047,
        "upvote_ratio": ""
    },
    {
        "title": "Arena - John Cassavetes (1989) Tribute to actor and director who died in February 1989. Friends, associates and fellow directors remember the man and his work. • r/truedocumentaries",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truedocumentaries/comments/8d5t3u/arena_john_cassavetes_1989_tribute_to_actor_and/",
        "text": "[deleted]",
        "created_utc": 1530238686,
        "upvote_ratio": ""
    },
    {
        "title": "What version of Apocalypse Now do I watch??",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uokd9/what_version_of_apocalypse_now_do_i_watch/",
        "text": "[removed]",
        "created_utc": 1530229654,
        "upvote_ratio": ""
    },
    {
        "title": "The Magnificent Two: A Transnational Dialog Between Theo Angelopoulos and Akira Kurosawa",
        "author": "ILoveBurnedPotatoes",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uogb5/the_magnificent_two_a_transnational_dialog/",
        "text": "https://cultantics.wordpress.com/2016/06/12/the-magnificent-two/\n\nAn essay from 2010 that spots the similarities in the work of a Greek and a Japanese filmmaker while also mentioning stories from their real life encounters.\n\n**Some** interesting parts:\n\nIn the finale of Landscape in the Mist, Angelopoulos uses an archetypical Japanese image: after suffering a great deal of pain during their journey, two kids who run away from home to find their father end up walking alone in the wilderness to find a tree emerging from inside the mist. This metaphysical dimension of trees is used not only in Kurosawa’s work (e.g. Dreams), but in the wider Japanese mythology and philosophy (concept of tree of life, religion of Shinto etc.). Serbian filmmaker Dušan Makavejev spotted this connection:\n\n&gt; *Before I saw Angelopoulos’ film, I, who had been brought up without a father, would never have thought that I would discover him in the image of a tree. This last scene of Landscape in the Mist was a revelation for me. It is a unique, one could say ‘Japanese’, moment, which surprised me because I had always thought of the Greek tradition as exclusively one of stones, rocks and gods. I saw in that scene a challenge to every inhibition and authority. This is why I would use Bergman’s words to say that the goal of cinema is to bring the dream back into our life, and thus help us to confront life’s difficulties.*\n\n[...]\n\nApart from their cinematic connections, Angelopoulos and Kurosawa had a lot of respect and appreciation for each other’s work and they shared an actual friendship. However, they only met thrice in person. A recounting of these encounters can be found in the introductory chapter of the Greek edition of Akira Kurosawa’s Something like an Autobiography that was written by Theo Angelopoulos himself.\n\nTheir first meeting was in Rotterdam Film Festival in 1971, where Angelopoulos presented his directorial debut, Reconstruction. The occasion was a Kurosawa tribute, hosted by the festival. They had a conversation concerning the differences between Kabuki and No theater. Angelopoulos explains his first impression on Kurosawa vividly: “Tall, skinny, with a face so graven at that time. He was just coming out of a personal scrape, terribly painful. […] He was speaking slowly, wearily; one would say that he was suffering. He was marking the differences with attention and with knowledge. Even so, I would say that he was about to cry.”\n\nIt was a dark period in Kurosawa’s life and career. In 1970 he was signed to direct a Hollywood version of the WWII Japanese attach in Pearl Harbor, a film called Tora! Tora! Tora!, but he was replaced by the studio in the last minute. His next film Dodesukaden was a major flop. His commercial failure and financing problems led him to the deepest depression. In the freshly released book Akira Kurosawa: Master of Cinema, film historian Peter Cowie comments upon Kurosawa’s condition: \n\n&gt; Kurosawa was in his own lower depths, having slashed his neck and arms with a razor in his own bath on December 22, 1971… Kurosawa apparently made thirteen attempts to commit suicide, though his darkest moment came in that winter of 1971\n\n[...]\n\nIn the meantime, Angelopoulos was about to face the toughest adversity in his own career. Two months before the beginning of shooting for his film The Suspended Step of the Stork, when the set crew was still building the constructions in a small town of northern Greece, a copy of the film’s screenplay had mysteriously disappeared from the set designer’s hotel room. As soon as principal photography started, Angelopoulos and his cast confronted an unprecedented agitation: the local bishop declared a crusade against the film, renouncing it for its antinational, blasphemous and atheistic views. Cast and crew members were threatened by church fanatics. The bishop’s followers were ringing the bells of every church in town to interrupt the filming and at night they were out, destroying the sets. The incident took international dimensions and ended up at the European Council. Angelopoulos received numerous supportive letters from many directors, including telegraphs from Wim Wenders, Martin Scorsese, Ettore Scola and Nagisa Oshima. When Kurosawa heard about this inequity, he sent Angelopoulos the following note:\n\n&gt; I write to you in order to protect you from the imposition of censorship regarding to your new film. It is a dreadful feeling. Like watching the child you raised being killed in front of your eyes. Such things should never be allowed. I unite my cry along with all the cries of the people who love and honor Theodoros Angelopoulos’ films. Let us see this movie. It is our right.\n\n\n\n",
        "created_utc": 1530228654,
        "upvote_ratio": ""
    },
    {
        "title": "The Magnificent Two: A Transnational Dialog Between Theo Angelopoulos and Akira Kurosawa",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8unno8/the_magnificent_two_a_transnational_dialog/",
        "text": "[removed]",
        "created_utc": 1530222016,
        "upvote_ratio": ""
    },
    {
        "title": "The Magnificent Two: A Transnational Dialog Between Theo Angelopoulos and Akira Kurosawa",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8unj9t/the_magnificent_two_a_transnational_dialog/",
        "text": "[removed]",
        "created_utc": 1530221037,
        "upvote_ratio": ""
    },
    {
        "title": "Thought's on this introduction to old cinema lis?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8umg81/thoughts_on_this_introduction_to_old_cinema_lis/",
        "text": "[deleted]",
        "created_utc": 1530212995,
        "upvote_ratio": ""
    },
    {
        "title": "Homespun Apocalypse: A Brilliant Retrospective Piece On One Of The Greatest Filmmakers Of The 1980's, Piotr Szulkin",
        "author": "ComeBackLucy1978",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8umea3/homespun_apocalypse_a_brilliant_retrospective/",
        "text": "'Golem' (1980).  'The War Of The Worlds:  Next Century' (1981).  'O-Bi, O-Ba - The End Of Civilization' (1985).  'Ga, Ga - Chwala Bohaterom' (1986).  Four of the darkest, most unique Science Fiction films of the 1980's, Piotr Szulkin captivated 80's Eastern Europe with his unmistakable, signature brand of subterranean, brooding post-apocalyptica.\n\nEnter the stark, grimy universe of the great Polish master, and never look back.\n\n[https://www.rogerebert.com/far-flung-correspondents/piotr-szulkins-homespun-apocalypse](https://www.rogerebert.com/far-flung-correspondents/piotr-szulkins-homespun-apocalypse)",
        "created_utc": 1530212608,
        "upvote_ratio": ""
    },
    {
        "title": "The Problem With Sorkin's Dialogue",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ulxwf/the_problem_with_sorkins_dialogue/",
        "text": "[removed]",
        "created_utc": 1530209273,
        "upvote_ratio": ""
    },
    {
        "title": "The Problem with Sorkin's Dialogue",
        "author": "anonymous_sf",
        "url": "https://www.youtube.com/watch?v=XUeNU9iESe8&amp;lc=z23uwfej5zv0tllduacdp43bj4pouam5o5yyegzjg5xw03c010c",
        "text": "",
        "created_utc": 1530206425,
        "upvote_ratio": ""
    },
    {
        "title": "The Problem With Sorkin's Dialogue",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=XUeNU9iESe8",
        "text": "[deleted]",
        "created_utc": 1530201465,
        "upvote_ratio": ""
    },
    {
        "title": "summer film list in progress",
        "author": "HollowPrint",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uk64u/summer_film_list_in_progress/",
        "text": "[removed]",
        "created_utc": 1530197842,
        "upvote_ratio": ""
    },
    {
        "title": "What are the films on this subreddit's banner?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uk0au/what_are_the_films_on_this_subreddits_banner/",
        "text": "[deleted]",
        "created_utc": 1530196742,
        "upvote_ratio": ""
    },
    {
        "title": "What are the films on this subreddit's banner?",
        "author": "120percentNick",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ujf69/what_are_the_films_on_this_subreddits_banner/",
        "text": "[removed]",
        "created_utc": 1530192628,
        "upvote_ratio": ""
    },
    {
        "title": "Ten Things We Learned From Turn of the Century Action Films",
        "author": "hedgeskenny870",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uihlq/ten_things_we_learned_from_turn_of_the_century/",
        "text": "[removed]",
        "created_utc": 1530185560,
        "upvote_ratio": ""
    },
    {
        "title": "My 100 Favourite Films In Review – Number 48, Rebecca",
        "author": "dauntless91",
        "url": "https://betterwithbob.wordpress.com/2018/06/24/my-100-favourite-films-in-review-number-48-rebecca",
        "text": "",
        "created_utc": 1530179545,
        "upvote_ratio": ""
    },
    {
        "title": "What's an actor from a directors roster that you wish was featured in a film they weren't in?",
        "author": "themanintheyellow",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ufwjd/whats_an_actor_from_a_directors_roster_that_you/",
        "text": "[removed]",
        "created_utc": 1530155636,
        "upvote_ratio": ""
    },
    {
        "title": "I think one reason why the recent Jurassic Park films fall short compared to the original is the fact that there's too much dinosaur action",
        "author": "Videoboysayscube",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uft10/i_think_one_reason_why_the_recent_jurassic_park/",
        "text": "I think part of what made the first movie so great are the occasional moments of character interaction. As great as dinos wrecking things is, the movie still needs the foundation of strong human characters, which is what JP1 had. For instances, Grant's raptor speech to the kid, or Grant and Malcolm in the car discussing marriage. Or Ellie and Hammond at the restaurant. These brief little scenes make these characters feel like real people. Their discussions allow us to invest in their characters and make us care about them more. \n\nThe recent sequels basically do away with all of this. It's just a rollercoaster that never climbs back up a hill. For example, they introduce two new characters, Zia and the nerdy guy. We learn absolutely nothing about them except that one's a paleo-veterinarian and the other's job is more important than it looks. The movie doesn't wait to throw everyone onto the island and have them start running from things. And then there was that scene where Chris Pratt originally refuses to tag along....just to jump on board in the next scene. Would have been nice if the ethics of the situation were discussed through them instead of just a generic news outlet. \n\nBut anyway, this is just one reason I thought of. To me the new movies are just B-monster movies with a huge budget. All style, no substance. I really hope somehow they can step it up a notch for the final part of the trilogy. ",
        "created_utc": 1530154736,
        "upvote_ratio": ""
    },
    {
        "title": "https://www.youtube.com/watch?v=XUeNU9iESe8",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ufb6j/httpswwwyoutubecomwatchvxuenu9iese8/",
        "text": "[removed]",
        "created_utc": 1530150179,
        "upvote_ratio": ""
    },
    {
        "title": "Movies You Hated: Why certain movies evoke a strong negative response",
        "author": "tvgirl48",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8uf0j6/movies_you_hated_why_certain_movies_evoke_a/",
        "text": "As someone who watches a lot of movies, I realized that I very seldom come across a movie I absolutely hate. Sure, there are plenty of movies I don't care for or dislike, there are movies that bored me, but there are only a handful of movies I despised. I think it's important to put into words why you dislike a movie, because there are always great movies we hate and terrible movies we love. I'll mention a few examples that always stick out for me (I apologize in advance, I am no film scholar, just a huge fan): \n\n**\"Rent\" (2005) and Miscasting** - I hated watching thirty- and fortysomethings dancing on tables singing about La Vie Boheme and not wanting to pay rent and having to 'sell out' to survive. This behavior is sympathetic when they're naive yet optimistic and passionate teens/twentysomethings. But this film adaptation decided to cast many of the Broadway stars who were past the age range for these roles. It's more expected to look past this in theater, but it is wildly distracting in the movie. This bothers me more because these are not bad actors and too often Hollywood casts young when they should cast older, but this is a rare example where I think they needed to stick within the young age range for this to work. \n\n**\"Paranormal Activity\" (2007) and Cultural Influences** - I loathed this movie and resented that people like it so much. I almost felt personally offended that anyone thought it was scary. But what if I had seen this absent of any hype? What if I didn't experience it as a cultural phenomenon with videos of theaters full of college students freaking out? I try very hard to not let myself get snobbish and think I'm too good for the mainstream, because that mindset is a black hole of close-mindedness and elitism. But ultimately, I think this is a serviceable horror movie that just rubbed me in all the wrong ways. I hated \"seeing the strings\" that took me out of the story (Why don't they leave the house? Because the budget doesn't allow that. How can these young people afford such a mansion? Because they're probably Hollywood kids who borrowed a friend's house). \n\n**\"The Big Chill\" (1983) and Personal Experiences** - I don't think this is a bad movie at all, just a movie very much of its time. As someone who struggled a great deal during the recession, a self-indulgent movie about the petty problems of wealthy thirtysomethings is extremely hard for me to connect to. The killer soundtrack wasn't enough to win me over. I hated this movie, but I acknowledge that it's my own views coloring my opinion. \n\n**\"MASH\" (1970) and Misguided Expectations** - I'm a big Robert Altman fan, but I'm also a big fan of the MASH TV series, so this was purely personal in that I hated seeing such nasty, mean-spirited versions of characters I loved. Again, if I could watch the movie and judge it by itself with no external factors influencing me, I'd probably come around to it. It has so much to offer, I can see that. Although I would have to get past that awkward final act football game, so who knows. \n\n**\"Baby Driver\" (2017) and Great Expectations** - I am a huge fan of Edgar Wright's work, and was enormously disappointed in this. The never-ending yet underwhelming music choices, the inconsistent characterization, the poor writing, the nonsensical character motivations/actions, the dull lead, the nonentity female lead...oftentimes absurdly high expectations can ruin a good movie (2005's *King Kong*, anyone?), but I hated this movie *and* think it's a bad movie. I expect better from Edgar Wright and thought he fell in love with his premise and failed on the follow-through. \n\nName me a movie you didn't just dislike, but really hated. But most importantly, tell me *why*. ",
        "created_utc": 1530147489,
        "upvote_ratio": ""
    },
    {
        "title": "Please help me find this movie - Au Revoir la Haut / See You Up There (2017)",
        "author": "FalsettoChild",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ue8aq/please_help_me_find_this_movie_au_revoir_la_haut/",
        "text": "Looking for a US payable Bluray of it or at least a release date. \n\nEver since I read about this movie Au Revoir la Haut / See You Up There, a film released in 2017 according to IMDB, I've wanted to see it. I've been waiting to find a Bluray that can be played in the US. I'll not able to find even an American release date. Can someone help me find this? \n\nSee You Up There\nhttps://www.imdb.com/title/tt5258850/",
        "created_utc": 1530140473,
        "upvote_ratio": ""
    },
    {
        "title": "Hitchcock/Truffaut (2015)",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=Z8tAqMp2qGo",
        "text": "[deleted]",
        "created_utc": 1530135962,
        "upvote_ratio": ""
    },
    {
        "title": "Hitchcock/Truffaut (2015) - This documentary about François Truffaut's book on Alfred Hitchcock and its impact on cinema, is essential viewing for cinephiles. It offers an affectionate, and well-crafted, tribute to one of the greatest film directors of all",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=Z8tAqMp2qGo",
        "text": "[deleted]",
        "created_utc": 1530134168,
        "upvote_ratio": ""
    },
    {
        "title": "What is the story behind L'Avventura's reception at Cannes?",
        "author": "TheManLouWaitedFor",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ucukt/what_is_the_story_behind_lavventuras_reception_at/",
        "text": "I'm researching the angry and negative response L'Avventura received at Cannes in 1960 (apparently Antonioni fled the theater), but can't find any real info about it. So many articles mentioning the fame of the event, but not mentioning any actual details about it. I heard once that a petition of sorts was signed the next day by a group of people but I can't find the real story.",
        "created_utc": 1530129732,
        "upvote_ratio": ""
    },
    {
        "title": "A Brilliant Retrospective Piece On One Of The 1980's Greatest Filmmakers: Piotr Szulkin",
        "author": "ComeBackLucy1978",
        "url": "https://www.rogerebert.com/far-flung-correspondents/piotr-szulkins-homespun-apocalypse",
        "text": "",
        "created_utc": 1530127187,
        "upvote_ratio": ""
    },
    {
        "title": "The Spellbinding Cinema Of The Great Legend, The One &amp; Only Shuji Terayama ('Pastoral Hide &amp; Seek', 'Farewell To The Ark', 'The Grass Labyrinth')",
        "author": "ComeBackLucy1978",
        "url": "http://hcl.harvard.edu/hfa/films/2017sepnov/terayama.html",
        "text": "",
        "created_utc": 1530123850,
        "upvote_ratio": ""
    },
    {
        "title": "What is a feelgood film and what are some examples?",
        "author": "realJulianRhodes",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ub9w3/what_is_a_feelgood_film_and_what_are_some_examples/",
        "text": "What I've come up with so far:  \n\n\n\\-a feelgood film can't get too artsy/highbrow, either in its content or in its presentation. the audience comes to the film to feel, not to think; and we can't have any experimental directing techniques that might alienate them  \n\\-a feelgood film can't have subject matter that goes beyond what's PG-13, this would upset the audience. they didn't come to the film to watch dark/sad stuff, they came here to feel good, so the hero can go through some trials/struggles but the struggles can't ever get too dark/serious. Cancer/physical illness = acceptable; rape and mental illness = unacceptable. A villain that kills = acceptable, a villain that tortures = unacceptable.  \n\\-a feelgood film is more about the emotional journey than the physical journey. Most films are, but the difference here is that the audience and the filmmakers are more aware of it than usual, and there's a specific emotion that's trying to be cultivated. a feelgood film isn't just any film that makes you feel good, it's a film that wants you to feel a very specific type of empowerment to walk out of the theater and take control of your life.  \n\n\nExamples: \"It's a Wonderful Life\" is one example I can think of from classic cinema, but in recent years, \"The Secret Life of Walter Mitty\" is probably the best example, with its cutesy sentimentalism and its message of personal empowerment. These films obviously can be pretty bad and tiresome, but I've seen a few good films that work within these parameters, like \"Dances with Wolves\", \"Back to the Future\", \"Holes\", \"Hugo\" and \"Enchanted\". \n\nAny other examples of good and bad feelgood films would be welcome and if you'd like to challenge my list of rules or add further rules, please feel welcome.",
        "created_utc": 1530118628,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (June 27, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8u9y3p/casual_discussion_thread_june_27_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1530108855,
        "upvote_ratio": ""
    },
    {
        "title": "\"Just go out there and keep hitting singles\" - Mark Duplass (the League) to Sopranos' Del Negro",
        "author": "jfstreich13",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8u9wih/just_go_out_there_and_keep_hitting_singles_mark/",
        "text": "Cool interview with Sopranos actor about Film Making, learned a lot about Mark and the industry in general. I find it very interesting looking at Duplass' career and the trajectory he has had. It's clear that he was pretty deliberate in what he wanted to do -- there was no froth or overdramatizing what it meant to get into film. He started out in things that were manageable, and then just worked up as he learned and made contacts. It's an eerily realistic path; almost the antithesis of how film/media (ironically) portrays the film industry and breaking in.. Maybe I'm wrong. What do you guys think? Is it really more realistic to \"keep hitting singles\" like Duplass says. Feels almost like Pressfield's notion of \"going pro\"\n\n[iTunes](https://itunes.apple.com/us/podcast/ep-43-mark-duplass-just-shoot-it/id1260829558?i=1000411160418&amp;mt=2)\n\n[Episode Link](https://www.10000nos.com/episodes/ep-43mark-duplass-just-shoot-it)",
        "created_utc": 1530108533,
        "upvote_ratio": ""
    },
    {
        "title": "Mark Duplass on Filmmaking -- Sopranos' Del Negro Interview",
        "author": "jfstreich13",
        "url": "https://www.10000nos.com/episodes/ep-43mark-duplass-just-shoot-it",
        "text": "",
        "created_utc": 1530107538,
        "upvote_ratio": ""
    },
    {
        "title": "\"Just go out there and keep hitting singles\" - Mark Duplass (the League) to Sopranos' Del Negro",
        "author": "jfstreich13",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8u9pdw/just_go_out_there_and_keep_hitting_singles_mark/",
        "text": "[removed]",
        "created_utc": 1530106939,
        "upvote_ratio": ""
    },
    {
        "title": "Movies like Daughters of the Dust (1991) and Red Dirt (2000)?",
        "author": "mutespalax",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8u99wd/movies_like_daughters_of_the_dust_1991_and_red/",
        "text": "People who have seen either or both of these films can you recommend something similar or pinpoint exactly what distinguishing features they have or maybe a specific subgenre that they belong to?\n\nThe best way that I can describe what I found appealing about them is their surreal, dream-like atmosphere, enhanced by visually striking scenery, music, eccentric characters, non-linear narrative, which, nevertheless, always stays grounded in reality and mundanity.\n\nBoth films are firmly rooted in specific cultural contexts which are showcased very organically through speech patterns, idyosyncratic customs and habits, all of which create a strong cultural vibe without a try-hard deliberatness or preachiness.\n\nHere some apposite quotes I lifted from the reviews of Daughters of the Dust that I think capture what is special about it:\n\n*The movie’s images have a luminous fullness, a decentered dynamism, and a dance-like flow...*\n\n*The connection of each scene, of each moment, to the over-all story is slightly oblique and abstracted.*\n\n*Even in the film’s most unusual moments, it never feels avant-garde for the sake of it; even in its most surreal scenes, Daughters of the Dust feels like a slice of the lives of very real people.*\n\n*Detail-filled microhistorical sequences undo the deceptive clarity of fixed categories and encyclopedic formulas, such as “the Great Migration” itself, by rediscovering the richness of the phenomena that they encapsulate in the dense tangle of individuals’ experiences.*",
        "created_utc": 1530103217,
        "upvote_ratio": ""
    },
    {
        "title": "Novel Vs. Film: Nothing Lasts Forever Vs.Die Hard",
        "author": "hedgeskenny870",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8u9648/novel_vs_film_nothing_lasts_forever_vsdie_hard/",
        "text": "With the exception of the abysmal *A Good Day to Die Hard*, no film in the franchise didn't find its basis in some form of source material. *Die Hard 2: Die Harder* was based upon a novel by Walter Wager. *Die Hard With a Vengeance* was a spec-script originally titled \"Simon Says\" - reworked first for a Lethal Weapon sequel before being reworked once again to pair Bruce Willis' John MacClane with an African American buddy partner. And *Live Free or Die Hard* was inspired by an article from Wired theorizing the possibility of the film's \"fire sale\" premise.\n\nThis trend in the franchise began with the first film, from a 1979 novel written by Roderick Thorp entitled *Nothing Lasts Forever*. In the book, Bruce Willis' surrogate Joe Leland is the aging, world-weary cop making the trip from New York to Los Angeles before terrorists lay siege to the building on Christmas Eve. This was Leland's second outing in both mediums, as Frank Sinatra had starred in the first book's adaptation, both entitled *The Detective*. While it may be hard to imagine an 80s era Sinatra duking it out with 12 German terrorists and taking death-defying leaps into air ducts, this scenario nearly played out. Not that Sinatra was in the running to be cast as the iconic MacClane, but the novel plays out nearly note-for-note as the film, action set-pieces and glass-shredded feet included. What the film wisely deletes from the transition from page to screen is a whole lot of racism, sexism and plenty of woman-killing. Those are the major plot changes, but what turned *Die Hard* into late-80s action fodder – and transformed the genre for years to come – were the little things.\n\nAs *Nothing Lasts Forever* opens, Leland is catching a plane from Baltimore, during which his black driver posits about the nature of murder before getting into a scuffle with another driver. Leland, no longer a real cop but still allowed to carry a weapon aboard a plane using an anniversary badge, pulls a piece on the other driver before fleeing to the terminal and getting aboard.\n\nFrom there, the novel follows the film, almost line-by-line, minus the \"fists with your toes\" bit (though there is something that echoes it). He has a black limo driver, the second and last featured in the novel; both of which share similar professions, seem aging, overweight and tired.\n\nAfter warning guards about a strange truck outside the building, he goes to meet his daughter (not wife) at the Klaxxon (not Nakatomi) Building for the party. And we meet all our favourite characters. There's Ellis, the cokehead businessman who demands Leland's daughter brag about her watch, and the ill-fated Mr. Takahagi stand-in, who in the book is white and something of a worthless suit. At this point, watching the film and reading the book are almost identical.\n\nWhile plot points and key scenes are still there, including gruesome violence and one-liners, women get involved. Not Leland's daughter, Steffie, however. The novel never leaves Leland's perspective, so there are no cutaways to the hostages. Rather, some of the terrorists are female. The first he kills, he's not that thrilled about. Leland flew planes in World War II, so he doesn't know who he firebombed, but one-on-one is something of a different nature. By the third, he's found his groove. While more distraught about it than, say, when he throws a character he refers to as \"skeezits\" through a window, the book makes a point of mentioning how male-on-female killing gets easier.\n\nThe book, unlike the film is entirely about strategizing instead of improvising just to stay alive. From the moment Leland loses his temper in the Baltimore airport and draws his piece, his mind is constantly on how to mitigate any situation safely.\n\nThorp doesn't just pit Leland against terrorists, but the entire city of L.A. Throughout the drive to the Klaxxon building, Leland laments how spread out the city is, how ineffectual ground patrol would be; the constant battle of the coasts that still persists today. If Leland goes one floor up, they'll spot him. If he holes up in his bunker, too many will come to take him down. If Bruce Willis had such constant inner monologue, it would have been tedious. In the book, it's not thrilling, but it's not dull. But Willis is tasked with emoting the kind of pain and constant fear of death spelled out in almost every sentence. There's a reason Terry Gilliam handpicked Willis to star in *12 Monkeys* after learning he improvised the scene in which MacClane is pulling glass from his heels.\n\nOne of the best choices the author makes – something that would have rendered the debut of Alan Rickman's breakthrough performance meaningless – is having Leland recognize who Hans (Anton, in the novel) Gruber was instantly. He knew him from lectures he'd attended about terrorism given from the F.B.I. The book has long detours in which he recalls the lectures, which are often cynical about law enforcement's chances versus terrorism. Even 12 in a skyscaper seems overwhelming, and the uncertainty about Leland's fate, as well as those of his comrades outside, permeates every page. It's a long way from *Die Hard*'s \"yippie-kay-ay, motherfucker\" rah-rah-rah sensibility. At a lecture, it appears neither side has the right strategy, as evidenced by the lecturer's conclusion and crowd reaction:\n\n\"I want this clearly undersood. A prisoner is a snarling, sullen cocky little prick. A corpse is garbage. A person using a firearm in my jurisdiction is going to suffer the results of the most extreme measures. I mean death. If these people come to my community, they're going out on stretchers with the sheets off, so that everyone will see exactly what will the happen the next time. I mean every word I say – God is my judge: I take personal responsibility.\"\n\nHe sat down. One by one, police chiefs and their representatives got to their feet and applauded. Leland and the big guy on his right were among the last to stand.\n\n\"A lot of innocent people are going to die,\" the big guy said\n\nAn older man in the row in front turned around. \"Ten years from now, five years, those fuckers are going to get their hands on an atom bomb. Do you think they're going to hesitate to use it?'\n\nIt's even hinted that, in Leland's numerous moments of doubt, had he not been involed, no one would have been killed. The F.B.I. also has a much smaller role here. In the film, they're intended to be saviours when they rather turn out to be the villain's saving grace, inadvertently opening the final lock to the safe containging their bounty. Here, they're more of an obstruction for Leland.\n\nThe terrorist's objectives are less greed-driven, which has become a staple of the film genre. No matter how outlandish or complex their plots are, money is always the main motivation. In Forever, Gruber and his men desire to expose Klaxxon's illegal dealings with Chile's milatary junta and, rather than steal money, destroy it. This is a goal far more in line with the decade in which it was released. Forever was pre-Iran-Contra, when the U.S, when the U.S. was directly supplying guerilla troops using drugs and weaponry in South America. By 1987, the Iran-Contra scandal already in the press and America as staring down the barell of another recession.\n\nIf anything separates *Forever* and *Die Hard*, it's a relentless atmosphere of cynicism and sense of hopelessless. Even Leland's small victories are painstaking. One of those lengthy flashbacks to a police-terrorism conference occurs as he dangles helplessly from an air duct.\n\nBut nothing marks it bleak outlook than novel's final moments. As briefly mentioned, Leland is at the party to visit his estranged daughter – not wife - and grandchildren. By the book's end, the set up is the same – with Gruber holding his daughter hostage. Gruber is shot much like Rickman in the film, but Leland's daughter is pulled out the window with him, both falling to their death.\n\n*Forever* is much more cruel than the film, even killing off hardass Dwayne T. Robinson (Paul Gleason in the film – more of an inept comic relief than a real authority figure). Until the film's release, it was a more of an obscurity than curio. Since, it serves almost as an antithesis of what is considered a definitive action film and a tragic late 70s novel. Despite most of the material playing out scene for scene, one could never imagine *Nothing Lasts Forever* ending with Bing Crosby's \"White Christmas.\"\n\nSee/read both? Which did you prefer? Tell us in the comments below or follow us on facebook [here](https://www.facebook.com/filmquirk/)!\n\n[https://www.filmquirk.com/single-post/2018/06/27/Novel-Vs-Film-Nothing-Lasts-Forever-Vs-Die-Hard](https://www.filmquirk.com/single-post/2018/06/27/Novel-Vs-Film-Nothing-Lasts-Forever-Vs-Die-Hard)",
        "created_utc": 1530102226,
        "upvote_ratio": ""
    },
    {
        "title": "Is Haneke's \"71 Fragments of a Chronology of Chance\" actually consists of 71 sequences?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8u8o4q/is_hanekes_71_fragments_of_a_chronology_of_chance/",
        "text": "[deleted]",
        "created_utc": 1530097198,
        "upvote_ratio": ""
    }
]