[
    {
        "title": "How easy is it to knock people unconscious like in every action movie ever?",
        "author": "mangonebula",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rr6xw/how_easy_is_it_to_knock_people_unconscious_like/",
        "text": "[removed]",
        "created_utc": 1529243955,
        "upvote_ratio": ""
    },
    {
        "title": "Don't Look Now (1973)",
        "author": "slipshodblood",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rpcnf/dont_look_now_1973/",
        "text": "This film is haunting. I don't exactly know what cohesive thought I can slap onto it, as it is a very complicated film. I genuinely loved almost all of it, and the stuff I didn't was so minor that I don't even want to mention it. The performances from Donald Sutherland and Julie Christie were absolutely phenomenal. I loved how their story was told. It was edited extremely well. On a technical level it was very impressive and did not at all seem like a \\[normal or average\\] film from the 70s. I am very curious in Nicolas Roeg's other work. I have already seen The Witches which I really enjoyed but it doesn't at all reach the levels that this film did. I would highly recommend this film to anyone wanting a darker, moderately surreal film.\n\n(this is just my letterboxd review, to be found here: [https://letterboxd.com/eamon13/film/dont-look-now/](https://letterboxd.com/eamon13/film/dont-look-now/) )\n\nThoughts? Agree or disagree? I am interested if someone dislikes the film why they do so, I couldn't find anything inherently wrong with it so I would love to hear if you did.\n\n(In brackets was edited in)",
        "created_utc": 1529217407,
        "upvote_ratio": ""
    },
    {
        "title": "Remember Jericho?",
        "author": "wolfhoundjesse",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rnmc7/remember_jericho/",
        "text": "I started rewatching Jericho yesterday, and as much as I loved it the first time around, something just felt … off. The pace was all wrong. The characters weren’t developed as much as I remembered. \n\nI started thinking about what has changed, and I’m not sure whether it is my taste or film in general. For instance, I don’t watch TV anymore. At least, not my parents’ television. I don’t remember the last time I saw a pharmaceutical ad. Everything I watch is on Netflix, Hulu, Amazon, Showtime, or HBO. \n\nWhen it happened, I thought Jericho was canceled way too early, and the wrap up felt rushed. I can only imagine how that would feel now. \n\nIn contrast, I do love the limited series format on Netflix. Godless felt epic in just a few episodes, not like the old TV Miniseries. What an upgrade. I wish Netflix would produce The Stand.\n\nI’m curious about how the production climate might affect the difference between a show like Jericho and a Netflix series where you know you’re going to be producing at least a season at a time. What do you think?",
        "created_utc": 1529196778,
        "upvote_ratio": ""
    },
    {
        "title": "The DepAHted",
        "author": "CaanThief",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rmtsc/the_depahted/",
        "text": "[removed]",
        "created_utc": 1529188404,
        "upvote_ratio": ""
    },
    {
        "title": "Role of Adults in Ferris Bueller",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rmngw/role_of_adults_in_ferris_bueller/",
        "text": "[removed]",
        "created_utc": 1529186678,
        "upvote_ratio": ""
    },
    {
        "title": "Theaters showing Gaspar Noé’s Climax?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rmc4i/theaters_showing_gaspar_noés_climax/",
        "text": "[removed]",
        "created_utc": 1529183710,
        "upvote_ratio": ""
    },
    {
        "title": "Meteora, Mexican short film (12min)",
        "author": "Sonnysbs",
        "url": "https://vimeo.com/146828498",
        "text": "",
        "created_utc": 1529179616,
        "upvote_ratio": ""
    },
    {
        "title": "Western counterparts to filmmakers like Sion Sono?",
        "author": "SherlockVonEinstein",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rl7i7/western_counterparts_to_filmmakers_like_sion_sono/",
        "text": "I'm looking for suggestions. Lately I've been on a big Sion Sono kick. Along with that, I've done rewatches of Hideaki Anno's two live action features (Love &amp; Pop, Ritual). And to a lesser extent, I've been watching Takashi Miike's more reputable/acclaimed films.\n\nI'm curious if there are any filmmakers on the other side of the globe that are similar. What I'm specifically interested in are low budget filmmakers who take full advantage of the freedom shooting quickly on digital allows them. Filmmakers who may incorporate various experimental techniques, and who kind of go off the map as far as character arcs or plot structuring are concerned.\n\nOn the surface, Tarantino or von Trier appear to be counterparts, but they really aren't, as they still stick to rather traditional narratives and are a little more controlled in their experimentation, preferring to \"perfect\" existing techniques, as opposed to trying something off the wall that may or may not fail. Also, they are afforded much larger budgets and just have an overall gloss and prestige to their films. The movies I'm looking for should have a more \"punk rock\" DIY aesthetic or ethos present.",
        "created_utc": 1529173212,
        "upvote_ratio": ""
    },
    {
        "title": "I am a big film buff and I (obviously) love watching films. But unlike other film buffs, I cannot analyze films.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rhpv1/i_am_a_big_film_buff_and_i_obviously_love/",
        "text": "[removed]",
        "created_utc": 1529131829,
        "upvote_ratio": ""
    },
    {
        "title": "Palindromes DVD",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rgvxx/palindromes_dvd/",
        "text": "[removed]",
        "created_utc": 1529121288,
        "upvote_ratio": ""
    },
    {
        "title": "Asami Yamazaki is Frightening",
        "author": "LiftedDemon",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rgpvo/asami_yamazaki_is_frightening/",
        "text": " I'm planning to watch more of Takashi Miike's filmography in the next few months. He's a very peculiar director that kind of reminds me of Stephen King, as he likes to disturb the ones who consume his work and unleashes an unreal ammount of artwork every year.\n\n Naturally I thought I should start to watch him with one of his most acclaimed and talked about movies (not yet Ichi the Killer): Audition.\n\n I could try to analise it, as there are a lot of themes involved in the story's progression (sexism, machism, conservatism, unhealthy relationship dynamics, dealing with loss,etc), but I'll instead talk about one of the aspects that, in my opinion, made the film so memorable: the antagonist, Asami Yamazaki.\n\n For some reason, the actress that played the character was able to cause me bone chills at the first sight I glanced over her, so much so that I tried to figure out why. \n\n If you watched the movie, you know that her character changed drastically throughout the film, but even at first, when she seemed like a normal and traditional angel girl, I saw something scary on her. Maybe it was her short answers, overshy way to interact and constantly calm/respectfull tone; all of those would not be such factors if it wasn't a Miike film. The way she always dressed in white...also unnerving for some reason.\n\n The scene that changed the film's pace, you know, that one with her waiting for the phone call, is one of the scariest of the movie to me. Her slendery body sitting in an odd position, showing off her bones below her skin, her long hair covering most of her face and that goddamn bag in the background...before the phone rings. I don't know if it was the loud ring, her slow smile appearing or the abrupt movement of the bag that made this scene so difficult to watch.\n\n All that follows is nearly a huge hallucination untill the torture scene. It seems to me that what came before the final scene was not just a shown of the insanity she caused on Aoyama due to his loneliness, but also a build up to the persona of hers the final act shown us, as more of her past is supposely shown and her figure starts to become more and more intimidating. If at the beggining of the movie we could barely look at her eyes, now we're scared to do so whenever she appears.\n\n Then we got the torture scene. Some of the most agonazing minutes you'll ever watch on a screen. And what's even worse is that, apart from some changes like the leather on her outfit, Asami is exactly the same, even after the drastic personality change. She acts just like before, speaking calmly and slowly, with delicate gestures as she put nails over Aoyama's body and no rushing precision as she cuts his left foot. Even after Aoyama's son saves him and pushes her downstairs, she gives him (and consequently us) one last scary sign as she speaks about her life one last time as she dies. Asami Yamazaki...is stuff from nightmares.",
        "created_utc": 1529119439,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good documentary films?",
        "author": "lucak_arts",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rfzfj/what_are_some_good_documentary_films/",
        "text": "[removed]",
        "created_utc": 1529111712,
        "upvote_ratio": ""
    },
    {
        "title": "Which filmmakers are most capable of moving gracefully between genres?",
        "author": "Radu47",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rfewf/which_filmmakers_are_most_capable_of_moving/",
        "text": "Tarkovsky is one of the great filmmakers but all of his films generally fall under the blanket of \"intensely visual character driven drama\" and even Solaris trends heavily towards this as his most unique film in terms of genre. So he's out. For this post.\n\nKubrick is an interesting suggestion. The Shining is a top notch horror film and 2001 is definitely a science fiction film. He made many war films and even dabbled in romance to some extent with Lolita. Quite alot of variety. Very impressive given the quality as well.\n\nUltimately it seems really rare for filmmakers to move between genres. Ingmar Bergman's 1962 Rom-Com *Linnea och Matthias gå till affären för att köpa blommor* (Linnea and Matthias go the shop to buy flowers) came as a breath of fresh air to many for this very reason. My joke there is to try and underscore how rare it is for most filmmakers to deviate from their most comfortable style.",
        "created_utc": 1529105991,
        "upvote_ratio": ""
    },
    {
        "title": "Ari Aster on the Films that influenced HEREDITARY",
        "author": "datsalpatel",
        "url": "https://youtu.be/SHVehwhUCCM",
        "text": "",
        "created_utc": 1529102693,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any directors with a 100% record?",
        "author": "ImageMirage",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rehr9/are_there_any_directors_with_a_100_record/",
        "text": "[removed]",
        "created_utc": 1529097733,
        "upvote_ratio": ""
    },
    {
        "title": "Southland Tales Discussion",
        "author": "AkarinSwag",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8re1gw/southland_tales_discussion/",
        "text": "Southland Tales was always a film I felt was judged harshly. Even if it was incoherent in its ideas, it had a few things going for it. Firstly, it had a nice aesthetic with the set designs that ranged from minimalist to overblown when the mood suited. Secondly, it had a definite momentum and energy to it. Thirdly, the wild pace and chaotic nature of the story allowed for many interpretations to be taken from it. I also respect that, much like the director's cut of Donnie Darko, the prequel comics merely give you the information needed to form a coherent explanation and you are left to connect the dots yourself. \n\nThe reason I started this thread was simply to demonstrate an idea I had while first watching it. In the movie, reality TV star Krysta Now releases a CD containing the track \"Teen Horniness is not a Crime\". The CD is sent to the Republican party's office. This annoys the Republican candidate who says that he never said it was. This reminded me of this Aldous Huxley quote: \"As political and economic freedom diminishes, sexual freedom tends correspondingly to increase. And the dictator will do well to encourage that freedom...it will help to reconcile his subjects to the servitude which is their fate.\"\nKrysta's vapid celebration of sexuality serves as a distraction from the true issues plaguing the Southland although her attempts at tackling \"real issues\" also fall miserably short as one can see in her talk show. It is sent to the Republican party leader who in this universe has implemented an oppressive extension of the patriot act that allows the internet to be monitored and put under government control while also increasing border restrictions and tightening overall security at the expense of freedom. The party leader is more offended at the implication that he would be offended than the actual content of the video, showing how he is reluctantly in support of Krysta's sexual politics despite being so repressive in other areas.\n\nI may be talking out of my ass here. If there was any movie death of the author was made for, it would be Inland Empire. But Southland Tales comes in at a close second.\n",
        "created_utc": 1529093999,
        "upvote_ratio": ""
    },
    {
        "title": "How did Wong Kar Wai improve so much in 2 years after 'As Tears Go By'?",
        "author": "RonBurgundyNot",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rc62f/how_did_wong_kar_wai_improve_so_much_in_2_years/",
        "text": "[removed]",
        "created_utc": 1529079215,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (June 15, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rb91h/casual_discussion_thread_june_15_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1529072026,
        "upvote_ratio": ""
    },
    {
        "title": "Watch This: F/X",
        "author": "hedgeskenny870",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8rajdi/watch_this_fx/",
        "text": "There's something to be said for B-grade action films working with a larger budget. Used wisely, such a budget allows for on-location shooting, a cast often overqualified for the material and a wider release. Robert Mandel's *F/X* (1986) serves as a perfect example of a film that, despite a fairly hokey premise, exceeds expectations. Originally submitted as a TV movie, Orion pictures picked up the spec script and saw potential for a theatrical release.\n\nIt's also firmly planted in a stretch of the 1980s that embraced low-budget schlock without succumbing to it. It's loaded with fight scenes and shootouts that play out like a screenwriting 101 class, never missing an opportunity to throw in an action beat every 15 pages or so, but it's also so focused on its characters and motivations even the sillier moments seem to fit.\n\nProduced by the late Dodi Fayed, F/X casts Bryan Brown (the only Australian 1980s Americans had heard of that wasn't Paul Hogan) as a master special effects wizard for Z-grade schlock. Some of the character's named previous works are fake, others, like *I Dismember Mama*, Lucio Fulci's *Zombie*and a poster for the mutant baby from *It's Alive* pay the aforementioned tribute to Corman-esque exploitation.\n\nAfter being approached by a DOJ officer (Cliff DeYoung) to stage the public assassination of a mob informant (Jerry Orbach), Brown reluctantly agrees. However, after the staged shooting turns out to be far too real and DOJ agents attempt to tie up loose ends – including Brown – he finds himself on the run.\n\nThe cast is a who's who of 80s character actors. In addition to Brown, a pre-Law and Order Orbach and DeYoung, a silent Tom Noonan (*Manhunter*, *The Monster Squad*) stalks Central Park as an assassin and Mason Adams (*Lou Grant*, *Toy Soldiers*) plays the head villain. Even Angela Bassett makes her film debut as a news reporter.\n\nBut the headliner only shows up at the film's mid-point. Brian Dennehy plays the detective trying to make sense of what appears to be a string of unconnected corpses. Like a lot of B-movies who manage to afford a single major name, Dennehy shows up only intermittently. Until the film's final moments, he's largely on the outskirts of the plot. Without Dennehy selling the role, it could have easily failed. We're often told the character has a testy reputation, but we don't see much evidence of it (save for a single confrontation with another officer). But his swagger, charm and broad-shoulders suggest a sly veteran who's seen everything and doesn't have time for bureaucracy. Often, perhaps due to budgetary reasons, he stays in the office, delegating his partners to carry out the car chases and warrant searches.  \n\nBut the film delivers what its title promises, as Brown soon finds himself forced to use his F/X skills to foil the villains' plot. And his abilities translate from make-believe to out-and-out murder. Though the effects themselves are sly, there's nothing particularly mind-blowing about them. Like a low-rent*Mission: Impossible*, they're more practical than ingenious – little more than latex masks, electricity and bullet squibs (*Ghost Protocol* even lifts a more high-tech version of a mirror trick straight out of the film).\n\nThere are some minor issues – most significantly, one of the villains is simply left alive in the trunk of a car, never mentioned again. Mandel also brings the same campy-yet-serious tone he brought to 1996's *The Substitute*, both of which could have benefited from more of the former. Both films also tend to overstay their welcome. At the time, Mandel was known for his off-Broadway work, so he screened famous action sequences from *The French Connection* and *Bullitt* to learn his way around the genre. The precise moments he's aping are evident, especially during a car chase where much of it is shot from the perspective of the car's front bumper a la Gene Hackman driving after an el-train in the Friedkin film.\n\nAll of this is redeemed by an incredibly unconventional ending – one in which both leads make a morally and ethically questionable decision, particularly since one of them being an officer of the law. Nevertheless, it wraps up in the strangest of ways: a picture credits sequence without any actual credit labels – like a curtain call for off-Broadway players.\n\n*F/X* was followed by a sequel in 1991 (with its two leads returning and a new director, Richard Franklin) and a short-lived TV series. Unlike the original, *F/X 2: The Deadly Art of Illusion* gives Dennehy and Brown more screentime together, playing out like a buddy picture. For an 80s action film produced by Princess Diana's boyfriend, it never plays past its own ambitions. In the age of incoherent, 2 1/2 hour Michael Bay opuses, one longs for such efficiency.\n\n[https://www.filmquirk.com/single-post/2018/06/15/Watch-This-FX](https://www.filmquirk.com/single-post/2018/06/15/Watch-This-FX)",
        "created_utc": 1529065487,
        "upvote_ratio": ""
    },
    {
        "title": "Your Name (2016)- True Film is due for an animated film discussion.",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8raavb/your_name_2016_true_film_is_due_for_an_animated/",
        "text": "[https://thefilmera.com/2018/06/15/film-frame-friday-kimi-no-na-wa-your-name/](https://thefilmera.com/2018/06/15/film-frame-friday-kimi-no-na-wa-your-name/) link has all the pictures making for an easier read\n\nA decidedly less depressing melodrama feature from Shinkai, the famed director of *Byōsoku Go Senchimētoru* (*5 Centimeters per Second*, 2007) and *Koto no ha no Niwa* (*The Garden of Words*, 2013), *Kimi no Na Wa.* (*Your Name.*, 2016) looks at the collective experience of disasters at the individual level, highlighting the painful interaction of trauma with very medium-specific devices at his disposal. About a young boy (Taki) from the city and a young girl (Mitsuha) from the country inexplicably inhabiting each other’s body after a night’s sleep, this rom-com setup quickly turns into a traumatic experience when Taki discovers that Mitsuha is from the past and already dead, a victim of an asteroid crash on her hometown. Shinkai’s signature use of beautiful colors gives the sensational visual pleasure his films are often known for, but they also play a role in juxtaposing beauty with trauma: in this case, the asteroid disaster. Such a paradox forms the thematic backbone in the film’s visual and narrative foundation and guides the audience through the story of (fantastic) reclamation.\n\nWhat interests me the most is the how that paradox is visually represented. The stark contrast between beauty (and the wondrous experiences associated with it) and trauma (and the painful experiences associated with it) are often side-by-side, as Shinkai highlights their differences as well as their connections. There is a binary, like any film with some sort of a rupture, but *Kimi no Na Wa.*’s binary is not necessarily irrevocable, but rather merely separated. Shinkai achieves this in a very animation-specific concept of \"line.\" The line in animation is the foundation of everything. We often refer to traditional 2D animation as 2D because it is made up of two-dimensional shapes, consisting of lines and colors. A line separates the inside from the outside, a character from the environment, clarity from obscurity. The line is the ultimate divider.\n\nBut that’s not always the case in the film. Just as the line divides, the line connects—another characteristic of a line. Horizontally, it separates but it also marks the edge where two objects meet, and vertically, it becomes a thread that ties two distanced objects together. The line also leads one from a place to another, as we often use the term to denote subway lines (in Japanese, subway lines are called *Rosen*, literally meaning “road line”). Metaphorically, a line becomes a line of clues that leads, in this case, Taki to Mitsuha’s past. These multiple meanings of line, often in terms of borders in live-action films, have been the thematic topic of many films, yet Shinkai’s work in this film is notable precisely because it is an animation. He is almost obsessively using the line in his visual direction. Here, the line separates, connects and ultimately leads the characters, trauma, memory and the story.\n\nThe most obvious way the director uses this is, of course, the concept of the red thread (*akaiito*), often connoting a fateful, romantic bond between a couple in East Asian culture, and a very overused cliché in Japanese anime. Here, the red ribbon connects Taki and Mitsuha, the past and the present, the couple, and becomes a leader to help Taki to avert the disaster. But it is not the only line featured in the film—in fact, a lot of lines in the film are often visual and metaphoric. The shot composition Shinkai frequently employs in the film is one that divides the screen with a line: like the reunion of Taki and Mitsuha on top of the mountain, a narrative point where the two finally meet face-to-face despite the temporal rupture that exists between them. It appropriately happens during twilight, the time marked by its in-betweenness, a line and a line-blurred. In this shot, Shinkai is fully aware of both the divisive and connective function of a line, using the paradox fully to his (and the characters’) advantage, reaffirming the separation between them while revealing the separation can be overcome. The line signifies where they are physically separate and where they meet spiritually.\n\nOften, films (especially diaspora cinema) have used the concept of a border as the visual representation of social, cultural and political boundary. In anime, the most famous use of border comes in *Neon Genesis Evangelion*’s (Anno Hideaki, 1995-6) AT-fields, where border/boundary is conceptualized as the distinction between the self and the other. The crossing of that border was established by Tomino Yoshiyuki’s *Mobile Suit Gundam* (1979-80) and its concept of Newtypes, which proposes a utopian look at the abolishing physical boundaries.\n\nWhere *Kimi no Na Wa.* differentiates with both its live-action and animated predecessors is that it sees division as part of life, a fatalistic concept. Mitsuha’s grandmother, a Shinto priestess, teaches her granddaughters that the small stream on top of the mountain is the line between the world of the living and the world of death. The film does not necessarily see the dividing line (nor its necessity) as negative—instead, they are where two things are met and separated. Perhaps conceptually similar to *Coco*’s (Lee Unkrich, 2017) use of its own border, *Kimi no Na Wa.* realizes that lines form the basis of human interaction with each other, nature, and their own selves.\n\nTake another example of a frequently used line in the film: the tail of the comet, which eventually crashes too (initially) unsuspecting Mitsuha’s small town, visually symbolizes the ultimate divide between Taki and Mitsuha. But it is also through the comet that numerous binaries are met: since the comet is the one that begins the story of the two, it connects Taki and Mitsuha, the living and the dead, the past and the present, the reality and the dream, the beauty and the trauma.\n\nOf course, the comet itself is more of a “dot” than a “line.” The “dot” in the film represents the single largest catalyst between Taki and Mitsuha. But there is another “dot” in the film, or more specifically, in its title. The period ends a sentence, just as it ends a line. The film uses the “lines” to overcome the “dot” throughout, and while the “dot” arrives regardless, the humans persevere. Shinkai once said in an interview that this film is his own attempt to represent and cope with the trauma of the Tohoku Earthquake, and if understood in that perspective, it is not surprising the film’s fatalist look at nature is contained in a wholly humanist perspective. This is especially clear (with a hint of irony) in the shots of Mitsuha’s eye that hold the comet falling down.\n\nComing back to the point of individual experiences of trauma as a frequent reminder to the audience, it is unsurprising then the concept of border is often unstable in the film. In a classic Ozu tradition, Shinkai repeatedly uses a shot of sliding doors (Mitsuha’s house to subway doors). Unlike Ozu however, who used sliding doors in deep-space compositions to reflect the flattening of 3D objects, Shinkai places the doors in the middle. This does not open the screen space to offscreen space and instead abolishes the divide within screen space. A typical hinged door prompts the subject to open the door to outside (pushing away) or the inside (pulling), which establishes individualistic subjects. Yet, the sliding doors, especially in the composition Shinkai gives us which places the doors as a line as opposed to a screen in Ozu’s frontal composition, do not have a single subject, and instead, operate to connect and divide the characters—a frequent visual significance that “lines” serve in the film.\n\nThe sliding doors either open/close intentionally (when Mitsuha opens her doors) or unintentionally (subway doors). The line that connects and divides us may or may not be up to our control, yet they are inherently permeable. The line separates yet connects--and this is why, coming back to the shot at the mountain where the two leads finally meet, all the dividers are at the same time connections. The film recognizes the destiny that arrives (comet, dot) yet it refuses to set the binary in stone, looking for ways to reconnect them. It is a human-centric drama that frequently searches for its own ending, it’s own “dot,”  in the face of a seemingly inescapable traumatic destiny.\n\n&gt;Maybe that is why when the title is said in the film, the dot, the period, isn’t there—it just hangs, for the audience. The line is there. It’s up to you to cross it.",
        "created_utc": 1529063130,
        "upvote_ratio": ""
    },
    {
        "title": "Mommy &amp; Aspect Ratio's",
        "author": "MadSox231",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r8w55/mommy_aspect_ratios/",
        "text": "I just saw mommy and it was fantastic. Every element of the film was executed to perfection. This movie has some of the best actings I have ever seen. What I was intrigued by immediately was the aspect ratio. The film has a 1:1 aspect ratio. I won't spoil anything but the aspect ratio adds a lot to the theme of the movie. The director, Xavier Dolan made another film in 2013 called, \"Tom at the farm\" where he smoothly changed aspect ratios in intense scenes subjecting the audience to a form of Pavlovian conditioning. Where just the black bars creeping in would create an intense feeling in the audience. Why don't more directors play around with the aspect ratio? Wes Anderson did it in The Grand Budapest Hotel, but I haven't seen this in many other movies. \n\nDo you think the aspect ratio is something to experiment with it or do you find it annoying? I believe used correctly it can create an original experience for the audience. \n\n",
        "created_utc": 1529044862,
        "upvote_ratio": ""
    },
    {
        "title": "In \"Repo Man\" and \"killer klowns From Outer Space\" the labels are all white and say exactly what they are, beer, chips, etc. Do any other movies continue this trend?",
        "author": "mrdrofficer",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r7mpa/in_repo_man_and_killer_klowns_from_outer_space/",
        "text": "[removed]",
        "created_utc": 1529030576,
        "upvote_ratio": ""
    },
    {
        "title": "The Symbolism of Blood in Guillermo Del Toro's Movies",
        "author": "viO_fromdownstairs",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r7jnc/the_symbolism_of_blood_in_guillermo_del_toros/",
        "text": "Hey guys,\n\nI've finally watched \"*The Shape of Water*\" and as a Del Toro's universe enthusiast, something's caught my attention.  It may be just a detail but I've always found the symbolism of blood interesting in his movies. A scene in the movie actually reminded me of another scene in \"*Pan's Labyrinth*\" which is: a wounded cheek.  \nThere is something quite disturbing about having a hole in your cheek (it must hurt, really) but noticing that in two of his movies, it is clearly shown so that you feel the pain made me wonder whether there was a story behind it or not.  \nOpinions ?   \n",
        "created_utc": 1529029727,
        "upvote_ratio": ""
    },
    {
        "title": "My review of Incredibles 2 and its incomplete narrative [SPOILERS]",
        "author": "CodenameAwesome",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r77tn/my_review_of_incredibles_2_and_its_incomplete/",
        "text": "Uh, fool me once?\n\nThe visuals in Incredibles 2 are awesome and deliver on the promise of a more up to date Incredibles movie. New supers! Super car! Super family teamwork! Jack Jack gets a whole scene just to fight a raccoon with new power after new power! But the story is a little disappointing.\n\nElastigirl unskeptically taking a job from some random entrepreneur (after Syndrome?) is like people going ahead and building a second Jurassic Park because dinosaurs are cool. Like, cmon guys, at least be cautious.\n\nLogical nitpicking aside, the movie is lacking in any statement regarding its villain. The Screenslaver is stopped but they're not really proven wrong. Even if her methods were wrong and her motive was confused, her argument that just because someone has powers and wears spandex doesn't mean they are perfect gods everyone should trust is... true.\n\nLooking back at the last villain that was right but motivated by the wrong things and used unethical methods, Killmonger, we can see what this movie is missing. Killmonger was right in some ways and wrong in some big ways and is necessarily stopped. But Black Panther addresses his position and the hero eventually decides to point at his predecessors and say \"You were wrong.\"\n\n\"Saving me doesn't make you right.\" \"But it does make you alive\". What? Those are both true things. Helen is a good person for not killing Screenslaver. Like she's always been. What's the point being made here? Screenslaver says \"we can't all just trust you because you're super\" and Helen replies \"But *I'm* trustworthy\"? Gotcha! #BlueLivesMatter.\n\nAnd despite putting Helen in the more active role in the story, Incredibles 2 mostly spends its effort developing Bob's character arc where he learns that sometimes you have to help others do the job you want so that everyone can be better off for it. But Helen's arc is reduced to... being worried about leaving her kids but then they're ok so whatever?\n\nPhil Lord has asserted that good stories are always about a relationship. Assuming he's right, what relationship is Incredibles 2 about?\n\nElastigirl and Screenslaver never fully address the conflicting ideals in their relationship. At one point Elastigirl even says \"At least I have core ideals\" as if Screenslaver hasn't been clearly monologuing about her ideals the whole movie.\n\nBob's internal conflict is really the only thing that actually delivers a clear message to the audience and it's, once again, about his ego.\n\nOh, well. Giacchino killed it with the score though, as expected.",
        "created_utc": 1529026486,
        "upvote_ratio": ""
    },
    {
        "title": "Unusual Question: What are some films that sound like this song?",
        "author": "kingcon2k11",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r6q34/unusual_question_what_are_some_films_that_sound/",
        "text": "I listen to [this song](https://youtu.be/NV_ihMAJN3k) and picture elegant 1950's/60's films about lonely women shot in a way similar to Vertigo that have a reminiscence of Blue Velvet but I haven't explored many films from the era and wouldn't know where to begin to find what I'm looking for. \n\nIt's hard to properly convey what I mean but I hope my message comes through from what little description I can provide but the song and thumbnail of the video should hopefully help you understand what I mean. Thank you.",
        "created_utc": 1529021684,
        "upvote_ratio": ""
    },
    {
        "title": "Films about/containing unrequited love of an inanimate object?",
        "author": "hydnhyl",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r6ix2/films_aboutcontaining_unrequited_love_of_an/",
        "text": "Hey friends, I'm currently writing something and I'd love to find a few films that broach the subject of unrequited romantic love of an inanimate object. It's a tall order but it would be tremendously helpful to see how other writers or directors have approached this topic.\n\nThese films don't necessarily need to focus on this one subject. They don't have to be concretely about this sort of love (I.e could be metaphorical or dream-like, or an object or symbol of desire that steps outside of our traditional relationship with romantic love of things that are not people themselves)\n\nAny help would be greatly appreciated, and as always I look forward to expanding my knowledge of films from this sub! \n\n",
        "created_utc": 1529019825,
        "upvote_ratio": ""
    },
    {
        "title": "Eraserhead, wow",
        "author": "clx94",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r5xni/eraserhead_wow/",
        "text": "Seriously. What was that lol just finished my first watch and decided to come here \"fresh\" to discuss this obviously very figurative film a little\n\nBefore any further analysis I would say it's about despise for an undesired family lifestyle ? His wife becomes increasingly disgusting and evasive during the film, her family is just unnerving, and the baby is made and shown in a way that is impossible to feel empathy for it, just plain unhuman and annoying.\n\nThe dream sequences I'm still trying to fit in all of this, specially the one that gives the film its name. Lady with the big cheeks looks innocent but doesn't really seems to represent that, also the sequence that opens the movie and then appears again at the end I just couldn't quite grasp what it was supposed to be\n\nFor technical aspects I would definitely highlight sounds, omg they just add to the scenes so much, they define the whole atmosphere of them. Use of light and shadow was one of my favorites too.\n\nAny comments before I start the post-watching research process ? hahaha",
        "created_utc": 1529014620,
        "upvote_ratio": ""
    },
    {
        "title": "Films about/containing unrequited love of an inanimate object?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r5g3y/films_aboutcontaining_unrequited_love_of_an/",
        "text": "[removed]",
        "created_utc": 1529010700,
        "upvote_ratio": ""
    },
    {
        "title": "Introduction to African cinema?",
        "author": "nickedebuss",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r597c/introduction_to_african_cinema/",
        "text": "What would the people of this sub recommend as an introduction to African Cinema? I came to think about the other day that i know hundreds of directors from Europe, Asia and America, but can’t name one single director from the Continent of Africa. Has there been some noteworthy wave of films from the continent comparable to Italian neorealism or the french new wave or the new Hollywood wave? Or has there only been single directors that have made noteworthy films?\n I would love to hear what you recommend. That can be both directors and films but also waves if there is any!",
        "created_utc": 1529009240,
        "upvote_ratio": ""
    },
    {
        "title": "The Criterion Website is Fantastic! Fun to go through.",
        "author": "MiLittleThrowAway420",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r4n1b/the_criterion_website_is_fantastic_fun_to_go/",
        "text": "[removed]",
        "created_utc": 1529004637,
        "upvote_ratio": ""
    },
    {
        "title": "Hereditary (2018) - Five things it does right (and one thing it doesn't)",
        "author": "BurnTheGlitch",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r3xya/hereditary_2018_five_things_it_does_right_and_one/",
        "text": "Hereditary is my favorite movie of the year (so far) and, in all honesty, probably one of my favorite horror movies of the past decade.\n\n****MAJOR SPOILERS****\n\nOn my drive home from the movie theater last night, I tried to organize my thoughts into some cohesive narrative, but ended up with a list of things that the movie does better than just about all of its peers (and one thing it could have done slightly better):\n\n1) The director, Ari Aster, does a masterful job of maintaining multiple layers of tension throughout - to an almost symphonic extent. The entire film is suffused with a sense of dread, a feeling that forces unknown and unseen (to the characters and audience) are directing the course of events. Furthermore, individual scenes build up their own scares. Critically, and in contrast to most commercial horror films, Aster doesn't always release the tension at the end of a scene, preferring to led to persist and become part of the background - until, unexpectedly, a sound or image will shred the audience (*kluck*). \n\nAster also plays interesting games with the camera. He constantly returns to a favored shot - a character, usually Annie, looking at something offscreen in disbelief or confusion - but the camera, once it slowly pans towards the object of attention, doesn't necessarily reveal much (except, in a few instances, when it does).\n\n2) The acting is terrific. Toni Collette, as Annie, deserves every plaudit she receives. Her character is a particularly tricky one, combining motherly love and grief for her children, anger and frustration towards her mother, confusion and fear about the seemingly-supernatural events surrounding her family, and the more mundane concerns of life (her job, her marriage). Critically, Collette sells every one of these facets of Annie's personality, but also gives the audience glimpses of something else (mental illness, or some supernatural factor?) coursing just beneath the surface. Alex Wolff also holds his own in a less complex but critical role. He clearly portrays Peter's teenage frustrations, grief, fear, and resentment for his mother, and serves as a convincing conduit for the audience's own confusion and terror by the end. Molly Shapiro and Ann down are perfect in supporting roles, and Gabriel Byrne is the cast's unsung hero - the straight man serving as an essential rational counterpoint to Annie's increasingly frenetic character.\n\n3) Hereditary has a reasonably clear supernatural reading. The grandmother was the head of a demonic cult seeking to revive Paimon, an evil spirit. Prior to the events of the movie, Paimon was placed in the body of Charlie, Annie's daughter and second child. However, to regain his full power, Paimon must possess a male body whose soul is sufficiently vulnerable. Thus, the cult set in motion a series of events (some depicted in the movie, some not) to render Peter, Annie's first child, vulnerable enough for possession. By the end of the movie, Peter is fully taken over by Paimon, and presides over his demonic congregation.\n\nThe film, however, is also amenable to an alternate reading that is similarly fascinating. The title of the movie refers, at least obliquely, to hereditary mental illnesses. Indeed, Annie recounts to a support group that practically all members of her family on her mother's side struggled with severe problems. Therefore, it is plausible to infer that her own biological children would be similar afflicted. The film supports this hypothesis: Annie, Peter, and Charlie see visions, while Annie's husband, being outside the hereditary line of the grandmother, does not. Could the movie, then, be interpreted as multiple mental breakdowns brought on by repeated emotional and psychological traumas? Charlie, a troubled child to begin with, sees visions after her grandmother (and favorite family member) passes away, and fears being left alone. Annie sees visions of her mother after the latter's death... strange, but not necessarily supernatural. Peter is also troubled - both as a teenager and from trauma associated with his mother's sleepwalking attempt to kill him - and his role in his sister's death shatters his already-fragile psyche. It's interesting to note that Peter is involved or present for almost all the violence that occurs in the movie: his sister's death, his mother's \"attack\" as he sleeps, his possession during class, his mother's death in the attic. I haven't worked out all the story threads yet, but feel that the second half of the film could be interpreted as Peter's progressive mental degeneration, up to and including potentially harming his family. Food for thought.\n\n4) The production design, set decoration, music, and sound editing/mixing are terrific. The house is a character in the film, its age echoing the theme of heredity, and its hallways and doors serving as a visual counterpoint to confused states of mind. Each room is replete with small details, allowing the audience's eyes to wander, looking for clues. The aural soundscape is similarly complex, with eerie melodies punctuated by unexplained ambient noises.\n\n5) Finally, the film leaves enough elements (plot points, themes, incidental details) unexplained to allow discussion and further interpretation. None of the interpretations - supernatural, psychological, or other - fits perfectly. Critical story points (the cult, the grandmother, the manner in which the cult orchestrated Charlie's death) are purposely not depicted. Key dialogue remains ambiguous (\"You didn't kill her.\" says Joanie to Annie. \"Something went wrong when we brought Charlie back.\" Annie tells Steve.). The film seems to drift in one direction, then suddenly shifts (for example, I suspected, for a while, that Joanie was the same character as Annie, and that the building in which Joanie lived was the same as the model at the bottom of the staircase). The final shot is a great example of this ambiguity. Just before, the camera shows a close-up of Peter's head (the house of his mind) as an off-screen voice explains the plot. However, the final shot depicts the scene as a miniature - an artificial, false replica of reality, suggesting that what we're seeing may not be the truth.\n\nThere is only one area in which the film errs: the final monologue by the unseen cult member (Joanie), which outlines a little too clearly the plan of the cult. The film had provided enough glimpses earlier, during Annie's frantic search through her mother's things, to allow the audience to piece things together, and did not require on-the-nose narration. The saving grace, however, is that the narrator remains off-screen, allowing the scene to remain alluringly ambiguous.\n\nThoughts? Disagreements?",
        "created_utc": 1528998845,
        "upvote_ratio": ""
    },
    {
        "title": "Escape Plan 2: Hades reminds me so much of the reboot of Prison Beak.",
        "author": "fargoSmalls",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r3qtz/escape_plan_2_hades_reminds_me_so_much_of_the/",
        "text": "[removed]",
        "created_utc": 1528997468,
        "upvote_ratio": ""
    },
    {
        "title": "How did your career as a movie buff begin?",
        "author": "f3ldman2",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r2we2/how_did_your_career_as_a_movie_buff_begin/",
        "text": "I’m interested to find out how other cinephiles developed their passion for film. I’ll start with my simple little story.\n\nWhile I didn’t get into film as an art form til a couple years ago, my love of film started in earnest when I was thirteen years old. It was summertime, and my Xbox 360 had just red ringed and was sent away for replacement, leaving me with little to do. For whatever reason I got it in my head that I wanted to see movies with great twists, maybe spurred by my viewing of The Usual Suspects with a friend about a year previous. \n\nThis led me to an online list of movies with “crazy” twists. On there were some classic movies, Les Diaboliques, Soylent Green, I think Citizen Kane was on there too. One movie, a relatively modern one, caught my eye. It started Brad Pitt, an actor I knew and liked, and it had a really cool title. That movie was, of course, Fight Club. \n\nNow, at my slightly seasoned age and having acquired a general jadedness towards the sort of nihilistic themes contained within Fight Club, I’m not such a particular fan of the movie. But when I saw it at the age of thirteen it was the best movie I’d ever seen. The surrealist edge, dreamlike atmosphere, brutal violence, and the cynical central figure of Tyler Durden absolutely enraptured me. I didn’t really even care about the twist at the end, the entire piece was just so compelling. I watched it multiple times, showing it to all my friends.\n\nThen I went back to my list of twist endings to see if there were any other hidden gems. Not so. I needed desperately to find more films like my beloved Fight Club, so I ventured into the internet movie database and clicked on the name David Fincher, being totally unfamiliar not only with the man, but with the role of a director in a film project. This led me to discover his other features, namely Seven, which I absolutely loved as well.\n\nIt occurred to me that the director is probably the key figure in the making of a film, and knowing that you’ve enjoyed the director’s previous work was the biggest clue that you’d enjoy their upcoming project. \n\nThe rest is unnecessary to explain. I found other directors I loved like the Coens, Tarantino, Scorsese... you know, the kinds of contemporary filmmakers you’d imagine a teenage redditor type to enjoy. I actually had a pretty solid foundation in 70s and 80s era action films, thanks mainly to my dad who loved showing me that shit when I was way too young for it, but it wasn’t until Fight Club that I discovered a passion for film that would eventually become a serious intellectual pursuit in the last couple years.\n\nSo how about you guys? \n\nEdit: yes I’m young, 23 years, said story occurred in 2008.\n\nEdit 2: other major steps in my movie buff career: \n\nWatching the redlettermedia reviews of the prequels and learning how to critically evaluate films. Started reading a lot of Roger Ebert\n\nStarted listening to the Flop House Podcast, a bad movie podcast that stands out because of the hosts’ sincere love for movies, both classic and dumb. It was them that got me to check out Stagecoach and through John Ford’s work I learned to appreciate and love movies from that classic Hollywood era.",
        "created_utc": 1528991341,
        "upvote_ratio": ""
    },
    {
        "title": "I saw 2001: A Space Odyssey in theaters and gained a whole new appreciation for the film &amp; the cinematic experience itself.",
        "author": "rhythmreview",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r2kby/i_saw_2001_a_space_odyssey_in_theaters_and_gained/",
        "text": "When I saw that the 50th anniversary 70mm film print of 2001 was going to be in my city I knew I had to see it.  I had seen 2001 once before on Netflix &amp; I watched it on my laptop.  It was one of those films where my initial thoughts were 'I get what this is trying to do, super impressive visuals for the time with a thematic driven story about the evolution of man and our relationship to the tools we use.'  I had always felt I had seen the film in the wrong medium, which is why I was so eager to see this in theaters.  When I came out of the theater I was floored by how impressive this film truly was.  Watching the long, drawling shots of spacecraft, set to a beautiful orchestral soundtrack of classical pieces, was awe-inspiring .  When the plot was advancing and the soundtrack was nil, the tense sound effects crawled through my skin.  Especially the scene where Bowman is disconnecting HAL, in a room filled with vibrant red colors; as HAL pleads with Bowman for his 'life',  Bowman's heavy breathing counters HAL's requests, it gave me chills. \n\nI'm sure most readers of this subreddit have seen 2001 before &amp; have already formed an opinion on this film.  I thought this re-release was significant, especially in an age where cinemas are 'dying' &amp; Hollywood is shoveling as much cheap, pandering schlock as possible to fill seats.  It showed me how significant a cinematic experience can be when the film is envisioned for the big screen.  Every frame has intention &amp; meaning, &amp; I was completely engrossed by the future Kubrick was showing us.  I left the theater completely satisfied, my brain buzzing thinking of this film alone.  I had only felt like this once before when leaving a theater, after seeing The Dark Knight for the first time.  I was 15, it was two weeks after the release and the theater was still sold out.  Two completely different films, but both left the same effect on me after seeing them in the theater, and both films have been stapled in my mind since.  \n\nIf you haven't seen 2001: A Space Odyssey in a theater before, check and see if its still showing nearby.  I saw its returning to NY in July and I fully intend on seeing it again.  In my opinion, this film is a must see in theaters.  \n\n  ",
        "created_utc": 1528988753,
        "upvote_ratio": ""
    },
    {
        "title": "Let’s talk Friday the 13th",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r2flw/lets_talk_friday_the_13th/",
        "text": "[deleted]",
        "created_utc": 1528987752,
        "upvote_ratio": ""
    },
    {
        "title": "La La Land and the novelty of the setting",
        "author": "HairyDavid",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r0y1x/la_la_land_and_the_novelty_of_the_setting/",
        "text": "This is years late since La La Land came out in 2016, but I've been thinking about this.  I think a large part of La La Land's success came from the novelty of having a classic, unironic musical set in the present day.\n\nI thought about how many classic musicals that people love were set in what was then the present, but now is seen as a quaint time capsule.  Singing In The Rain, West Side Story, Grease (although made in the '70s it was set in the '50s), etc.  Musicals were either set in the then-present, or in the past.  Off the top of my head, I can't think of too many musicals that are made in recent years, and set in recent years.  At least filmwise, I know on stage you can have things like The Book of Mormon, Avenue Q and In The Heights.\n\nIt really was just a dynamite idea to produce.  \"Hey, let's do a *contemporary* musical.\"  I'd like to see a lot more of them, a balance of sincere romantic musicals and comedic musicals.  \n\nAre there any genres that don't explore the present, or any time period, like they should?  I think it'd be cool to see more contemporary Westerns like The Way of the Gun or No Country For Old Men.  ",
        "created_utc": 1528974149,
        "upvote_ratio": ""
    },
    {
        "title": "My alternate reading of the plot of \"Hereditary\" (2018)",
        "author": "MightyQuinn2021",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r0nyz/my_alternate_reading_of_the_plot_of_hereditary/",
        "text": "The whole movie we see the point of view of the mother, except when we follow her son during school, and when he takes his little sister out to a party; eventually leading to her death. The script and directing infer that what is happening on screen is literal, and all the time the family really is being haunted/cursed by a friend of Toni Colette's deceased mother, leading to the bizarre ritual finale.\n\nANOTHER idea about the story, which my wife had, was that the film could be seen from the point of view of the son, and the trauma he feels after the car accident with his sister. His mother sleep walks, but she says in a story she tells a stranger that she threatened to kill her son and herself when in this state. Sleep walkers don't usually act homocidal. Anyway, the film could be read as the son's paranoia from drugs, and a growing mental breakdown from his sister's death, as having an affect on his psyche. He has a dream/hallucinaton about being strangled in his bed. The crazy ending to do with witches could be related to the stories he might have heard at a young age about his grandma from his mentally sick mother, who had a troubled relationship with her as well, growing up.\n\nAt the end of the film, when he runs into the attic, he locks out his mother, who chases after him. She then appears to him again, cutting her head off and hanging from the ceiling (in a story the mother tells, her uncle hung himself; also her father starved himself).\n\nOne other observation: the smiling man by the casket at the grandmother's funeral in the beginning makes an appearance again later on near the end of the film.\n\n---\n\nDoes anyone else have different readings of the film? Were the misdirections in plot intentional, or was the dreamlike change in the narrative and foreshadowing meant to lead the audience to their own interpretation?\n\nWhich other films would be the most similar in feeling to this horror film to other movies you've seen? Mine would be \"Son of Saul\" and \"Twin Peaks: Fire Walk With Me\", for the unnerving subdued imagery of the first, and the beautiful/apocalyptic finale of the second.",
        "created_utc": 1528970873,
        "upvote_ratio": ""
    },
    {
        "title": "Hereditary: Analysis [Spoilers]",
        "author": "ArcadeNational",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8r0abr/hereditary_analysis_spoilers/",
        "text": "I really enjoyed \"Hereditary\" but I did not love it. This is all just my opinion. I have heard this movie described from a few places as a smash of \"Rosemary's Baby\" and \"The Exorcist\". I personally think both of those films are much better than this and I'll explain why which will lead me to the problems with Hereditary.\n\nRosemary's Baby: Roman Polanski's fantastic horror movie. These films are very similar and I think what works with \"Hereditary\" is the family drama that is slowly bubbling and has it's most shining moment in its table scene between the mother and the son. It's also what is so great about \"Rosemary's Baby\", the relationship between the husband and wife and the neighbors. The slow build to what is ultimately everybody being against the main lead. \"Hereditary\" is a slow burn movie for most of it and then in the last 30 minutes it goes right into exposition heavy explaining of what's been going on. What \"Rosemary's Baby\" did so well was showing more than telling. The wife enters the back room and sees everybody chanting and staring at her. Eventually, the man says what's going on but he doesn't say much because he doesn't need to. The scene of her walking around the cult of people is enough to let us get a good idea of what's going on and convey her dread and worry of what's happening to her child. The man's few words just brings it all home. \"Hereditary\" was happy with being a slow burn and I think it lost some of its well written nature when it decided instead of showing us, it chose to tell us what's going on.\n\nThe Exorcist: William Freidkin's masterpiece. \"Hereditary\" didn't need its possession scenes. It's too much. The story was about the soul of the Deamon needing to be put into a more fitting male body than the body of the daughter which is the premise of \"Rosemary's Baby\". I understand the boy looking into the mirror but the scenes with Anne Dowd and Toni weren't needed. You could've had Anne Dowd, do anything else to mimic \"Rosemary's Baby\"'s neighbors. Having Toni become this believer in possession added an entertaining element but wholely unneeded to service the main premise. It seems like it wasn't entirely thought through because they had to add an ADR vocal to fix a script error with \"house\" and \"room\". Admittedly, that's a flimsy critique. It didn't need its possession plot line. The young daughter could have died and we had the Deamon do more to push the son into killing himself much like it made itself visible to the daughter. I have not mentioned much about \"The Exorcist\" because I feel like the seance stuff was placed into this movie incorrectly. It's a side plot. It adds a nice layer but doesn't make it intrugal to the main premise of the film. It's more about the mother trying to reach her child which detracts from the premise of the Deamon trying to get into the correct body which is the plot of the film. Each scene should service the plot in some way shape or form. The possession scenes add an unneeded element that ultimately detract from the focus. It's almost as if Ari thought that he wanted to use the drawing book in some way and had to figure out a way to kill the father off at the same time. It adds to the creepy factor but detracts from the main premise.\n\nI feel like this film is essentially \"Rosemary's Baby\" with some slight variations of using the son instead of an infant and having the entire mother's side be part of this cult. It needed to differentiate itself from \"Rosemary's Baby\" so it added a sceance side plot. Because it spent it's time adding the seance scenes, the end is plagued with the task of explaining all of this craziness and it does so with exposition instead of story based visuals to wrap the story up. I really enjoyed this movie but the ending left me underwhelmed from the overly ambitious prior 3/4th. It could have added another 10 minutes of scenes to ease you into everything and eliminate some of the exposition used by the photo album and Anne Dowd at the end.  It would also coincidentally, be the exact length that \"Rosemary's Baby\" was.\n\nI enjoyed this movie, it had great dialogue writing for the first half of the film and I wasn't bothered by the subject matter as some people were. The direction and blocking was great. Personally, I think some scenes with Toni were a bit over the top in a bad way but only slightly and only a few scenes. For the most part, she hit it out of the park! If you create a long slow burn and use it to introduce a bevy of elements, you better give it enough time to naturally come to it's conclusion. Contrary to what they ask in grade school, in film it's better to show and not tell. This film did too much ham fisting of its plot to you in the end and would've benefited by adding more scenes that would naturally explain those portions and keep to its slow burn style that it did so well with in the beginning half.\n\nIn conclusion, regardless of my analytical complaints, it's still a MUCH better horror movie than what we are used to most of the time and that's a real awesome thing, especially, for a debut film from a new writer/director talent. Bravo!\n\n7.6/10",
        "created_utc": 1528965953,
        "upvote_ratio": ""
    },
    {
        "title": "After recent posts re: Hollywood Pedophilia - Here’s a documentary how writer Vladimir Nabokov imbedded critiques of pedophilia in early Hollywood cinema especially in his seminal work Lolita. Based on the book by Literary scholar Dr. Joanna Morgan - Solving Nabokov’s Lolita Riddle. (1 of 6 on yt).",
        "author": "Wehochick",
        "url": "https://youtu.be/spTUa41pzoY",
        "text": "",
        "created_utc": 1528962713,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best method to watch classic films online?",
        "author": "ahigs257",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qzkmh/what_is_the_best_method_to_watch_classic_films/",
        "text": "Hi. I don't post on this subreddit, but I read it pretty religiously. \n\nI haven't seen many classic films that get discussed in this group, especially older films from the 40s/50s/60s.\n\nNetflix doesn't have them in my country (AUS), and the only cable TV provider in the country doesn't really show anything dated pre-1970. I checked their schedule, and the only older film they are showing in the next week is The Seven Year Itch. \n\nMy local theatre shows a decently diverse selection of current films  only, the library doesn't have what I'm after either. \n\nAny suggestions for an online service to watch films from that era? There's a limited selection of them from a store here (no non-US films, pretty much only Rita Hayworth and Humphrey Bogart films), but they come in at about $12 each and it means I'd have to watch them very slowly because I can't just go and buy a lot at once. Besides I am interested in watching films from more than just the US too!\n\nThanks in advance!",
        "created_utc": 1528956947,
        "upvote_ratio": ""
    },
    {
        "title": "Sculpting Time - Introduction to Tarkovsky's Solaris by Will Self",
        "author": "miraoister",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qxouf/sculpting_time_introduction_to_tarkovskys_solaris/",
        "text": "[removed]",
        "created_utc": 1528937859,
        "upvote_ratio": ""
    },
    {
        "title": "Sculpting Time - Introduction to Tarkovsky's Solaris by Will Self",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=zhSQySxcePI",
        "text": "[deleted]",
        "created_utc": 1528937770,
        "upvote_ratio": ""
    },
    {
        "title": "[Casino 1995] What are the implications of these bruises all over Ginger's body in the scene of her and Nicky in the hotel room?",
        "author": "Eric_Style",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qwzpq/casino_1995_what_are_the_implications_of_these/",
        "text": "https://i.imgur.com/2jiMLO9.jpg\n\nIt symbolizes, to me, that she never really became the woman Ace thought she could be. Like, here she is without all her fancy clothes and underneath she's still junk after everything she gained.\n\nBut, what are the physical implications of it in the story? I was never under the impression she was assaulted by Ace or Nicky in any way rougher then when she needed to be manhandled around in public.",
        "created_utc": 1528931520,
        "upvote_ratio": ""
    },
    {
        "title": "Being underwhelmed with classic 1960s films",
        "author": "murmur1983",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qwxci/being_underwhelmed_with_classic_1960s_films/",
        "text": "Hello, everyone. I've always been interested in the 1960s from a musical standpoint, and I've wanted to get into sixties films for a long time. To me, it seems like the 1960s were truly a decade for innovation in films; after all, that decade had groundbreaking classics such as \"2001: A Space Odyssey\", \"The Good, The Bad and the Ugly\", \"The Graduate\", \"Bonnie and Clyde\", \"Midnight Cowboy\", etc. that literally changed the way that films were made. From the way that the writing was done to cinematography, stories and camera angles, those films that I mentioned (and more) brought movies to a completely different level, and they pushed the boundaries of what movies could do. The sixties also had lesser-known efforts such as \"Skammen\", \"Woman in the Dunes\", \"Le samourai\", \"Hour of the Wolf\", etc. that were interesting in their own right.\n\nHowever, I expected the 1960s to be a decade that blew me away in terms of quality and innovation, and I was expecting to watch some high-quality films that intrigued me. I watched \"Onibaba\", \"In Cold Blood\", and \"Last Year at Marienbad\", though, and they left me cold. I appreciated their innovations and cinematography, but they didn't knock me out. They weren't as dark or as interesting as I wanted them to be, and I didn't love them as much as I wanted to. Even films such as \"Blowup\", \"The Silence\", \"The Birds\", Butch Cassidy and the Sundance Kid\", \"Faces\", etc. didn't blow me away. \n\nIn general, I'm wondering if my mindset for watching movies has to change, and if the culture that I grew up in has an effect on this. I will admit, I enjoy movies such as \"Avengers: Infinity War\", \"Iron Man\", \"Scary Movie 4\", \"Indiana Jones and the Kingdom of the Crystal Skull\", and I've noticed that films like those ones tend to be rather exciting (if not obvious and lacking depth in some ways), whereas films such as \"In Cold Blood\" &amp; \"Onibaba\" are a bit more subtle in their approach. Is there something that I'm missing about films such as \"Blowup\" &amp; \"Faces\", and do I need to watch more films and/or change my mindset, to appreciate them more?",
        "created_utc": 1528930967,
        "upvote_ratio": ""
    },
    {
        "title": "Quentin Tarantino's JACKIE BROWN",
        "author": "mitchmaverick00",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qw830/quentin_tarantinos_jackie_brown/",
        "text": "I'm just curious why the film JACKIE BROWN is never brought up when discussing Tarantino?  I wouldn't consider myself an enormous QT fan (I have seen every film of his in theaters since PULP FICTION and I own all of his films on bluray) but I do find him thoroughly entertaining even if he isn't the best or most original filmmaker.  I just find it a little shocking I guess that nobody ever talks about JACKIE BROWN.  Its a funny, entertaining, and well written film.  I like it better than PULP FICTION honestly.  Is it because its an adaptation rather than an original screenplay?  Just wondering why it isn't talked about or brought more. ",
        "created_utc": 1528925242,
        "upvote_ratio": ""
    },
    {
        "title": "When deciding on whether you think a film or any type of art for that matter is good, how much do you factor in the artist's intention if you do at all?",
        "author": "MikusJS",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qvxim/when_deciding_on_whether_you_think_a_film_or_any/",
        "text": "I've been struggling with this concept in my head for quite some time. I'll often criticise movies, but when it comes to stuff like music I'll go to criticize it and wonder if my criticisms are really valid. I feel as though if I had more context for the song then my appreciation for it would increase which is where my question comes in. How much do you guys factor in the artist's intentions when making a decision on whether you enjoyed something? ",
        "created_utc": 1528923033,
        "upvote_ratio": ""
    },
    {
        "title": "American History X: What did you make of it? What scene touched you the most?",
        "author": "Jumpingonacloud",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8quaab/american_history_x_what_did_you_make_of_it_what/",
        "text": "Just finished a few minutes ago and I liked that movie. From the start to end. Every goddamn phase. Anyway, back to the question, what did you make of it? Also what happened to Derek and Danny's killer after the ending scene? What was written in the script? Also, I loved Edward Norton's performance. One of my favorite actors after watching Primal Fear, this movie, and Birdman. \n",
        "created_utc": 1528910920,
        "upvote_ratio": ""
    },
    {
        "title": "American History X: What did you make of it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qu7bk/american_history_x_what_did_you_make_of_it/",
        "text": "[removed]",
        "created_utc": 1528910312,
        "upvote_ratio": ""
    },
    {
        "title": "Why did so many audience goers hate Hereditary?",
        "author": "pandaexplosion1",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qu5lj/why_did_so_many_audience_goers_hate_hereditary/",
        "text": "I saw Hereditary opening night and thought it was bonkers. It was legitimately one of the best movies I've seen in theaters. That being said, I was the only one in my theater to think so. I heard audible groans, laughing, and just a general sense of boredom from the crowd. I asked my friends who had also seen it and they had similar theater experiences. I then went online and saw that it has a 67% from Google users and apparently a 59% audience score from Rotten Tomatoes. Why? I was enthralled the entire movie, and it was so fucking tense the whole time. What was it about Hereditary that people hated? ",
        "created_utc": 1528909965,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone else seen Godard's the Image Book and would like to discuss?",
        "author": "comix_corp",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qt529/has_anyone_else_seen_godards_the_image_book_and/",
        "text": "I just watched it and found it pretty great. First things first, I really love that Godard hasn't 'sold out' in any way, shape or form. He is still a committed political revolutionary and cinephile, though he recognises that age is definitely creeping in on him - one of the scenes that stood out to me was the part where one of his stereo monologues about politics is interrupted by his hacking and coughing.\n\nIt's hard to say anything definite about this film as it is done in a very fragmented manner (self-consciously - he quotes Walter Benjamin on how only fragments can be authentic or something to that affect). Any straightforward interpretation I could give would not satisfy me or anyone else. This movie isn't concretely about one specific thing, rather, it's Godard thinking out loud in a cinematic language on a cluster of different themes - politics, his relationship with Miéville, the relationship between image and reality and representation, etc. All things that pop up in his late works with regularity but covered in a new manner with a renewed focus on the Arab world specifically.\n\nThe strict *aesthetics* of the film were fantastic, taken in isolation from everything else. All the burnt out VCR clips, ultra-contrast processed B&amp;W, technicolour and digital camera footage is very well co-ordinated with the music and dialogue. I found the burnt out tape stuff particularly interesting and I loved seeing how it morphed the images.\n\nBasically, this is a very essay-like film, much more like Historie(s) du Cinéma than, I dunno, Hail Mary. It's built primarily out of second hand sources. But it's still completely new and refreshing and beautiful and personal. I really enjoyed watching it and am eager to hear what you all think.\n\nMy favourite scene: the ending. After his hacking monologue, after he quotes his partner, he puts in a clip that is funny and sad and sweet all at the same time when recontextualised in this manner.\n\n(I don't actually know how widely this film has been released so I could be shouting in an empty room right now...)",
        "created_utc": 1528902434,
        "upvote_ratio": ""
    },
    {
        "title": "What is Production Design and Why It Matters (New StudioBinder episode)",
        "author": "[deleted]",
        "url": "https://www.studiobinder.com/visual-storytelling-production-design-tips",
        "text": "[deleted]",
        "created_utc": 1528900458,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (June 13, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qsqqj/casual_discussion_thread_june_13_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1528899220,
        "upvote_ratio": ""
    },
    {
        "title": "Igbaradi - Yoruba Movies 2018 New Release|Latest Yoruba Movies 2018",
        "author": "Yorubamovies18",
        "url": "https://www.youtube.com/attribution_link?a=MuxeP8gfNpM&amp;u=%2Fwatch%3Fv%3D3Qjm2IHbZ10%26feature%3Dshare",
        "text": "",
        "created_utc": 1528881859,
        "upvote_ratio": ""
    },
    {
        "title": "Get Out of Being John Malkovich",
        "author": "HairyDavid",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qqj2r/get_out_of_being_john_malkovich/",
        "text": "Inspired by someone's \"Being John Malkovich\" post, I went on Wikipedia and found an interesting section on the connection between \"Get Out\" and Spike Jonze's film, found [here](https://en.wikipedia.org/wiki/Being_John_Malkovich#Connection_to_Get_Out).\n\nIt's a little bizarre, as \"Being\" was a surreal dark comedy, and \"Get Out\" for me was almost straight horror (I know some considered it a horror comedy, but for me the laughs were few and far between, mainly focusing on Lil Rel's character).  \n\nThe theory kind of holds up in movie logic, however, it kind of twists Lotte and Maxine from the Jonze film into straight villains.  Lotte seemed to be kind of a milquetoast eccentric, and Maxine was at worst, a sociopath, but to continue the continuity it would seem that both turn into amoral monsters, who either became or were always racist.  ",
        "created_utc": 1528874825,
        "upvote_ratio": ""
    },
    {
        "title": "When you like cinema, but hate the Hollywood non-inclusive club",
        "author": "GastonAsston",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qq7t0/when_you_like_cinema_but_hate_the_hollywood/",
        "text": "[removed]",
        "created_utc": 1528871104,
        "upvote_ratio": ""
    },
    {
        "title": "Where is the line drawn between a movie-fan and a Cinephile?",
        "author": "theone899",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qosea/where_is_the_line_drawn_between_a_moviefan_and_a/",
        "text": "[removed]",
        "created_utc": 1528856043,
        "upvote_ratio": ""
    },
    {
        "title": "Who did you root for in Being John Malkovich? (Spoilers!)",
        "author": "kidneybean34",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qoiqm/who_did_you_root_for_in_being_john_malkovich/",
        "text": "This is something that I find very interesting because everyone seems to have a different answer and reasoning. In Being John Malkovich, Craig is first presented as the one we should root for. Although he clearly has flaws, he's first shown as the good guy and we want him to succeed. Then, as the story progresses, we start to feel empathy for Lotte instead. We start to root for her more because Craig spirals into a character that we don't really like. As the story progresses even further, we start to really root for both Lotte and Maxine. Craig really becomes the character we dislike for a while. But, near the end, we start to empathise with Craig once again and feel resentment towards Lotte and Maxine (mostly Maxine). The movie seems to end with no clear good guy or bad guy. Each character has their terrible moments and their great moments. So who should we root for? \n\nI've seen a lot of discussion about this topic. Being John Malkovich has so much to offer and so many different great things about it, but this aspect of it remains one of my favourites. There's just never one clear winner on who the good guy is. Some people say Maxine and Lotte are the good guys, while Craig is just the worst and others say the opposite. I find it hard go with one or the other. Craig does awful things but he has redeeming qualities. Maxine and Lotte end up being downright awful to him, for their own benefit and Maxine is pretty selfish throughout the entire movie. That's not to say Craig isn't selfish either because he is and seems more focused on himself as well. Lotte is the one who's really confusing because she doesn't really do anything particularly nasty or great. She just is stuck between the two. \n\nI feel like a lot of people would use the fact that there's no good guy or bad guy as a bad thing and as bad filmmaking or writing, but I personally think it's very interesting and well done. Movies always put you right in between the hero and the villain and give you a clear answer of who has good morals and who doesn't. I think Being John Malkovich really gets you thinking by placing you in the middle of these three more realistic characters. They are very true to a lot of people in life. They're selfish and make mistakes but can also have their good, honest moments. People in real life don't have all good qualities or all bad qualities, but rather a mix of the two and this is how Craig, Maxine and Lotte are portrayed, too. They are realistic and give you a good vision of what actual humans are like. It also showcases the selfishness of humans really well, but that's another story. Anyways, these are my thoughts on this one aspect of Being John Malkovich.  Tell me who you think we're supposed to root for in this film. ",
        "created_utc": 1528853536,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Jezebel in 'Marmaduke' such a dunce?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qoeda/why_is_jezebel_in_marmaduke_such_a_dunce/",
        "text": "[removed]",
        "created_utc": 1528852397,
        "upvote_ratio": ""
    },
    {
        "title": "Watching movies under the influence of drugs/alcohol",
        "author": "dogmanstars",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qn8ag/watching_movies_under_the_influence_of/",
        "text": "I always find in conflict when people tell me that they watch movies high or drunk. my first time (and only time) i watch a movie under the influence  was Fury Road on cinemas, and it was an OK experience, but when i saw it second time in my home and i enjoy it more, even i was amazed of how little i remember the movie.  \n\n\nI dont want to sound pretentious but there a beautiful experience in some movies that people recommend to watch on drugs (mainly 2001) and it have great value to my memory.  i know that there pleasure or curiosity of experience something intoxicate but as the materialistic person i am, i dont find appealing of watching movies intoxicate. i'm curious on knowing your opinions over this subject. thanks!  \n ",
        "created_utc": 1528842062,
        "upvote_ratio": ""
    },
    {
        "title": "'Breathless': Help me Get It",
        "author": "lookmafireworks",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qmc0t/breathless_help_me_get_it/",
        "text": "I just caught up with Godard's 'Breathless' and I'm stuck like I get with a lot of older films. I feel like I missed the boat but it was really hard to get through. I've read some articles that give me a better look and thought of it but it felt to me less like a movie that's a story and more a statement from Godard against the frivolity of American cinema. What's your take?",
        "created_utc": 1528835249,
        "upvote_ratio": ""
    },
    {
        "title": "A Recut Trailer for Ken Russel's THE DEVILS (1971)",
        "author": "BressonianAxeMurder",
        "url": "https://vimeo.com/274741727",
        "text": "",
        "created_utc": 1528835087,
        "upvote_ratio": ""
    },
    {
        "title": "Heat - Action Masterclass | Just stumbled upon this and absolutely had to share it with you guys! :)",
        "author": "Roy_McDunno",
        "url": "https://www.youtube.com/watch?v=TKBeUP-wZ04",
        "text": "",
        "created_utc": 1528818165,
        "upvote_ratio": ""
    },
    {
        "title": "What do women think when watching guys' movies all the fucking time?",
        "author": "eroticnungu",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qip6z/what_do_women_think_when_watching_guys_movies_all/",
        "text": "On one hand it doesn't seem like an issue at all about the position of women in films, and trust me I am not making this post because of all the recent buzz of women in feminism in movies and related areas. But sometimes when I notice this thing happening and think about it a on a deeper level, I can and anybody else can see how fucked up the situation is.\n\nThere aren't many movies featuring girls as central or hell, even as REAL characters, that's a  fact. Out of all the movies produced since Cinema's inception, 10&amp;#37; or less movies are made about women. Persona (other Bergman ffilms), Thelma and Louise, Mulholland Dr. are some great exceptions. But these movies come every 10\\-20 years.\n\nThe biggest reason that I feel there aren't many movies featuring women characters/protagonists? Obviously, THERE AREN\"T MANY FILM DIRECTORS THAT ARE WOMEN. Honestly, if you gave me a budget right now to make a film, 9/10 I would write a script and film it with a guy's POV featuring a predonminantly male cast. Its not my fault really unless I WANT to add women to the equation which I will probably do to \\*some\\* degree. On the other hand, if a lady is given that budget to make a movie, the chances that she'll produce a feature film about women is much, much more. Look at Tiny Furniture by Lena Dunham. \n\nSo I want to ask you girls, cause I never got to ask any women, how they REALLY feel when they watch movies with guys ALWAYS as heroes or about men in a movie with every genre, style, period or any particular story? Did it ever occur to it was unfair that the only chick in the movie was a wife or a mother or a girlfriend only to serve as a less than the position of a supporting character. Or it never really bothered you as a real issue as you were attracted to guys anyway (sorry if I offend you with this but I didn't know how to put this in any other way). \n\nEven movies about same sex relationships and their difficulties are mostly with men as gay characters. There are not many lesbian films, not certainly as ICONIC as Brokeback Mountain or My Own Private Idaho to boot.\n\nI would be really glad to know what you truly feel about this thing as I think about it now and then when watching GREAT movies.",
        "created_utc": 1528808107,
        "upvote_ratio": ""
    },
    {
        "title": "Who is the best male actor of all time?",
        "author": "korbinkreme",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qio70/who_is_the_best_male_actor_of_all_time/",
        "text": "After seeing this post,\n\nhttps://www.reddit.com/r/TrueFilm/comments/8qgstd/who_is_the_greatest_female_actor_of_alltime/\n\nI decided to see if anyone here had made a discussion on who the best *male* actor of all time was. Surprisingly, I couldn't find one, so I decided to make this post myself.\n\nMy pick for the best male actor is Lon Chaney, Sr. Most people probably write him off as a gimmicky, old-timey, over-acting horror actor that put on makeup for his roles. But he is so much more than a guy who put on makeup. He was able to display genuine, raw emotion from his face and hands in a way that no other actor really touched (except Falconetti). He is a very charismatic actor, too, with a great smile and screen presence. He almost glows off of the screen compared to his counterparts. He was the first character actor, showing great range as an enraged crime lord; a sad, old clown; a circus freak, and more. Also, he was probably one of the first method actors out there, going extreme lengths for his roles in ways that can't be replicated due to ethical concerns. For example, in *London After Midnight* he put painful metal wires in his *eye sockets* to make them appear more sunken.\n\nWho is the best male actor of all time?",
        "created_utc": 1528807851,
        "upvote_ratio": ""
    },
    {
        "title": "Gnostic/Solar symbolism in Vanishing Point (1971)",
        "author": "occultic_reader",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qifxb/gnosticsolar_symbolism_in_vanishing_point_1971/",
        "text": "I’m sure many viewers felt and noticed that Vanishing Point’s atmosphere was ethereal in a way that goes beyond the over theme of 60’s idealism racing towards its End in Time. Rewatching this amazing film for the first time in years*, I picked up on a rich layer of Christian Gnostic/Solar symbolism that permeates through the scenes. \n\nThe film goes into it right after the foreboding opening scene – Kowalski’s Alpine White Challenger R/T dissolves on the screen after passing by the jet black vehicle that was aimed at the barricade down the road. The choice of editing techniques here sets that very subtle otherworldly tone of the film perfectly. While Kowalski outmaneuvers the law with his intense driving, we learn from his memory flashes and memory dreams that he is a man constantly transcending his nature. The Gnostic motives suggest themselves strongly, when being a uniformed policeman (agent of the oppressive materialist state, much like the tax collector for the Romans, Mathew Levi the Apostle), Kowalski rejects the oppression and rescues an innocent spirit from defilement, parallel with myth of Sophia. All women seen in his dreams continue resembling this archetype while being strongly tied to feminine Nature – the Sea and the Desert. \n\nThe symbolism ramps up as Kowalski moves into the (Biblical) desert of Death Valley. Lost for direction, he draws the Sign of The Cross in the sand, and steps out of his car to observe it in a beautiful deliberate long shot – the cross(roads) elongated towards the disk of the Sun. Right after casting this sigil, he meets the Prospector spirit (the Holy Ghost**) in a very interesting scene. The first life or death moment comes for Kowalski when he meets the Snake in the desert – before that he effortlessly evaded harm in racing with policemen. Prospector subdues the Snake, and takes Kowalski to a Christian (?) revival in the middle of nowhere. The revival song is playing continuously in this scene. The Priest helps Kowalksi by providing gas, but rejects the Snake, saying “they have music now” – this scene is again deliberately highlighted in the use of editing and slow motion photography. \n\nKowalski continues to meet some angels and good Samaritans on the way, to the tune of many a Christian themed gospel and soul songs (\"Dear Jesus God\" by Bob Segarini, \n\"You Got to Believe\" by Bonnie &amp; Friends, \"Sing Out for Jesus\" by Big Mama Thornton) until he meets his death in the mirror Sophia archetype of Charlotte Rampling. Smokey–voiced and dressed in dark clothing, she informs the Solar hero that she has been awaiting him for a long time. It is the only extensive dialogue scene filmed during the night, and the dream–like, ethereal subtext is driven home by Rampling disappearing mysteriously as if being a projection of Kowalski’s death and peace he finds in dark Eternity of physical death. \n\nKowalski fulfills his destiny of the Solar Hero by rushing towards the sun shining through the bulddozer’s knives. On the surface, he is blinded by the sun, and believes the opening to be sufficient to drive through. But that won’t do – he shows no signs of disorientation or concern and looks straight at it, his eyes and face illuminated and smiling. The Sun shining through the opening symbolized the Straight and Narrow path, in which the final ascension is completed through shedding the material which Kowalski accomplishes with no beat skipped, to the shock of the audience. Barry Newman’s own interpretation proclaimed it be the ultimate expression of Free Will: “It symbolized that no matter how far they push or chase you, no one can truly take away your freedom and there is always an escape.\" \n\n**after recently coming off C. J. Jung’s “Man and His Symbols”, which may influence this analysis*\n\n***: In more ways than one. If you subscribe to the notion that the entire thing is Kowalski’s OBE flashback after already charging the bulldozers –  Prospector’s car is remarked to have been there since “the Great Depression”, and the gas he supposedly needed the gives entirely to Kowalski, showing no indication of the need to leave the desert*\n",
        "created_utc": 1528805611,
        "upvote_ratio": ""
    },
    {
        "title": "Airi (Unseen) - Yoruba Movies 2018 New Release|Latest Yoruba Movies 2018",
        "author": "Yorubamovies18",
        "url": "https://www.youtube.com/attribution_link?a=uOlOimCCHqo&amp;u=%2Fwatch%3Fv%3DbMKeqnQfCew%26feature%3Dshare",
        "text": "",
        "created_utc": 1528798942,
        "upvote_ratio": ""
    },
    {
        "title": "Who is the greatest female actor of all-time?",
        "author": "tvqueen",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qgstd/who_is_the_greatest_female_actor_of_alltime/",
        "text": "I know for casual moviegoers the answer might be Meryl Streep and while she's good, I'm actually not certain how she \"ranks\" with \"serious\" film fans. For me, no one really comes close to Isabelle Huppert. I used to say Emma Thompson and while she's my favorite actress and she's amazing, after watching more and more Huppert movies lately, I honestly don't know if she has any competition. Thoughts?\n",
        "created_utc": 1528785545,
        "upvote_ratio": ""
    },
    {
        "title": "Who is the greatest female actor of all-time?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qgqll/who_is_the_greatest_female_actor_of_alltime/",
        "text": "[removed]",
        "created_utc": 1528784803,
        "upvote_ratio": ""
    },
    {
        "title": "Appreciating the cinematic visuals of Blade Runner",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qekai/appreciating_the_cinematic_visuals_of_blade_runner/",
        "text": "[https://thefilmera.com/2018/06/08/film\\-frame\\-friday\\-blade\\-runner/](https://thefilmera.com/2018/06/08/film-frame-friday-blade-runner/) \\-for full writeup  with pics, videos, and image comparisons.\n\nThis month marks the 36th anniversary of Ridley Scott's *Blade Runner,* one of the most iconic sci\\-fi films of all time, up there with *2001: A Space Odyssey* and* Alie*n. It's also a special month because* Blade Runner 204*9 is now airing on HBO.\n\n&gt;What makes *Blade Runner* an interesting discussion for visuals is how well the film holds up after 36 years. There are even some people who prefer the visuals to its sequel, but that is an argument for part two of this series.\n\nI will never forget what made me want to watch *Blade Runner*. It was the images and gifs of Rutger Hauer standing in the rain. There was such a beauty to it that I immediately bought a copy of the film. During this time I didn't know much about noir, let alone the sheer brilliance of the visuals displayed. What I knew was that the film was amazing to look at it. A few years later, I can now actually talk about the difference between neo\\-noir and noir and how they influenced this classic.\n\nThe film is pleasing to look at, and the visuals are not just there to wow you but to wrap you in their setting and the story. Despite other films utilizing neo\\-noir techniques, *Blade Runner* is the ultimate embodiment of its usage, infusing everything we know about neo\\-noir into a futuristic setting. The beauty transcends that of other films, and in* Blade Runner*, the world has a polluted, cluttered and downright grim look. What I described doesn't sound appealing, but when everything is in motion you can't help but fall in love.\n\nMy thoughts are not uncommon about this film and most of what I talk about has been said, but that is what makes this film such a marvel. We are in the year 2018, yet this 1982 film is still hard to outdo. The noir influences, amazing production design and effects that somehow managed to stand the test of time are key factors in what makes this film work.",
        "created_utc": 1528763688,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts On City of God",
        "author": "TokyoNxte",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qdus0/thoughts_on_city_of_god/",
        "text": "[removed]",
        "created_utc": 1528757463,
        "upvote_ratio": ""
    },
    {
        "title": "How was your experience filming in NYC?",
        "author": "drezi11a",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qczli/how_was_your_experience_filming_in_nyc/",
        "text": "[removed]",
        "created_utc": 1528750696,
        "upvote_ratio": ""
    },
    {
        "title": "Ingmar Bergman Centennial in DC",
        "author": "stater354",
        "url": "https://www.reddit.com/r/criterion/comments/8qb1ci/ingmar_bergman_centennial_in_dc/",
        "text": "",
        "created_utc": 1528746118,
        "upvote_ratio": ""
    },
    {
        "title": "Hereditary and Possession(1981): A Brief Comparison **SPOILERS**",
        "author": "hydnhyl",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qc5fk/hereditary_and_possession1981_a_brief_comparison/",
        "text": "This weekend I stepped away from Ari Aster’s directorial debut, “Hereditary” with several thoughts coursing through my mind. I thought the film was a brilliant marriage of psychological horror and supernatural scares, but the most interesting takeaway was the lingering similarity to Andrzej Zulawski’s “Possession”. What I find most intriguing about both films is their portrayal of the psychological breakdown of a family unit in a way that feels hopeless and despairing and as a strong undertone that compliments the supernatural freight that frames both films on their surface.\n\nWhile Possession finds it’s original destruction through the distancing of a once happy marriage suddenly interrupted by seemingly naturalistic reasons (potential infidelity and growing paranoia), the explanation revealed is a heavy-handed monster movie ending where the viewer confronts a macabre, glistening and convulsing alien-like monstrosity that has possessed the female protagonist. The film has several other layers and to pass it off as a kitschy monster movie would do it a disservice, but what strikes me the most about this movie is it’s vivid depiction of the husband Marc’s inability to understand what has come over his wife as she falls further into a state of madness that feels metaphysical in its severity, despite having no other clues that there truly are supernatural forces at play. \n\nHereditary, as its name suggests, clearly wraps it’s ontological terrors up in a neat bow, explaining them away as the transgressions of the family matriarch who passed shortly before the film begins. It wears its symbolism on its sleeve but the execution presented makes these moments feel genuine. The demonic possession that leads to the literal destruction of the family unit, as three of the four members are eventually decapitated and/or immolated, is interesting and plays off in a well-paced narrative that finds most of it’s “horror” from a nuanced atmosphere that strings together the “jumpier” scare moments. Where Possession grounds it’s supernatural elements in a hotbed of paranoia and infidelity, Hereditary packs on the unbearable weight of grief in what seems like act after act of senseless loss and conflict that drives the characters to their absolute breaking point. A particular scene towards the 3rd act finds mother father and son around the kitchen table performing a seance to try and communicate with the recently deceased daughter of the family. Aware of mother’s familiarity with the supernatural ongoings, the audience is confronted with father and son’s sudden introduction to the forces at play. Peter, the son, begs his mother to stop what is happening in a scene that becomes incredibly disturbing as we witness the family’s total loss of control, succumbing to the supernatural. Amongst the chaos of the moment I was left wondering if this was reality or merely an affectation of the mother’s continual mental unraveling. This scene, in particular, has the same effect as the iconic “metro scene” in Possession where the female protagonist has a nervous breakdown that ends in miscarriage where she bleeds and oozes out of all of her orifices after violently throwing herself down a hallway in a fit of hysteria. In these moments, both films blend reality with the surreal, leaving the viewer to wonder if what is happening is not just a supernatural turning inward of both character’s inner world. \n\nI’d love to hear your thoughts on both of these films and I highly recommend both of them.\n\n*Edit - I got cut off somewhere along the line and have included the rest of my post.",
        "created_utc": 1528744702,
        "upvote_ratio": ""
    },
    {
        "title": "Ennio Morricone — The Melody of Discovery",
        "author": "DaKinginDaNorth1",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qb4kb/ennio_morricone_the_melody_of_discovery/",
        "text": "Video Form: https://youtu.be/lIwpN5CS6zk\n\nEnnio Morricone: The Melody of Discovery\n\nTurning back the pages of film music history, there are few instances where you can listen to an entire score and smile with the knowledge that you’ve just experienced a true masterpiece.  This is very difficult to achieve, of course. The score has to carry the story to the point where the two seem inseparable. It’s hard to imagine 1986’s The Mission without Ennio Morricone’s score. In the film Jeremy Irons plays a Spanish Jesuit who goes into the South American rainforest to convert the Indians of the region. Robert De Niro plays a slave trader who is converted and joins Irons in the mission. Eventually Spain sells the colony to Portugal and they have to fight against the Portuguese to defend all they have built. The locations are spectacular and the actors are pretty good, but it’s a flawed movie. The Mission has many individual moments that don’t really add up to a consistent narrative. It has some pacing issues and lacks a definitive structure that would make us get to know the characters better and why we should care about them. But Ennio Morricone’s score is filled with so much beauty and mastery, that it’s able to affect the viewer in many emotional ways. It’s an instance where it’s really the music that carries the movie beyond its own technical and storytelling capabilities. The score for the Mission is, without a doubt, a masterpiece on every conceivable level.\n\nThere are three main recurring themes entwined in the score. The first theme worth mentioning is “On Earth as it is in Heaven”, since it’s the one that covers all the elements that we need to understand the film. Naturally this is the theme that plays during the end titles, but it’s the first piece of music that appears in the soundtrack. The rhythmic theme scales up the strings of the old world, introducing us to a heavenly Latin choir; as well as using a layer of ethnic percussion that increases the rhythm and leads us into the new world.  The famous melody of the film “Gabriel’s Oboe” delightfully rests on the choral chanting and addresses the cultural conflict at the heart of the story between western civilization and the church vs. the Guarani. A perfect introduction to the essence of Morricone’s score.\n\nThe second theme is “Falls”, a beautiful melody that starts with a very subtle harp and picks up a pan flute, which gradually magnifies into a hair-raising full orchestra. This theme relates specifically to Jeremy Irons’ character climbing the breathtaking Iguazu Falls.\n\nThe most famous theme “Gabriel’s Oboe” is initially performed on-screen by Jeremy Irons’ character when he meets the Guarani for the first time. It’s an evocative piece of music that represents the concept of dealing with the unknown and the sense of adventure and discovery that permeates the entire score. The gentle orchestration for oboe and strings is truly awe-inspiring and captures the moment of the Guarani deciding to trust Father Gabriel and his beautiful music. But it’s also played during the massacre in the final moments of the film, while Robert De Niro’s character lies on the ground after being shot. He looks at Father Gabriel walking toward him dressed in religious robes. It seems like he’s hoping that perhaps by some kind of divine intervention, he’ll be saved. As Gabriel gets shot, De Niro gives up and the theme fades away.\n\nThese three themes are the basis for the entire score and Morricone develops and applies variations to these themes throughout the film. This is already a huge achievement for the italian composer, but he also managed to write “Ave Maria Guarani”, a beautiful piece of choral music. The layered vocals of the South American natives who performed it are moving and deeply spiritual. It’s amazing how Morricone was able to create such an authentic sound that sounds so ancient, while the movie was made in the 80’s. The song is played three times in different arrangements during the film. The first two being while trying to show that the Guarani are not savages, but rather people with different values and customs. It’s also used when the Portuguese attack the mission. These moments represent the evolution of the conflict between the church and the Guaranis, which culminates in the genocide of the natives because of a political decision disguised as holy intent.\n\nPart of what makes movie scores different from regular compositions is that they paint a picture of the movie’s themes along the story. Here, Morricone paints with his music a beautiful Amazon wilderness and a clash between two cultures colliding with one another. The old meeting the new. He’s able to give us music that hits us on a pure, emotional level, something that is truly rare to experience.\n\nThe Mission’s score is one of the best examples of what makes Ennio Morricone a brilliant composer. His music thematically heightens his movies, as well as affecting us emotionally, providing drama that is very difficult to express. There are so many landmark scores in his name, but The Mission may be the height of his career as a composer.\n\nVideo Form: https://youtu.be/lIwpN5CS6zk",
        "created_utc": 1528737298,
        "upvote_ratio": ""
    },
    {
        "title": "The Rules of the Game: A Deep-Dive",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8qas61/the_rules_of_the_game_a_deepdive/",
        "text": "[deleted]",
        "created_utc": 1528733567,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (June 11, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8q9u98/casual_discussion_thread_june_11_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/)\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1528726433,
        "upvote_ratio": ""
    },
    {
        "title": "The ending of Nymphomaniac vol.2",
        "author": "yrnhr",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8q9q5t/the_ending_of_nymphomaniac_vol2/",
        "text": "Overall I think the second part was far worse than the first one and it was a mediocre film as a whole. Anyway the end was really shocking and unexpected and it made me think a lot.\n\nFirst of all it was true that Joe subconsciously didn't want to kill Jerome and P. Joe was s a very selfish character, almost incapable of feeling true love. The only exception in her life was Jerome though. But she wasn't a cold hearted bitch at all. Joe wanted to repel her sins multiple times \\- tried with therapy and some form of sadomasochism inflicted on her by K. The reaction of Jerome after the gun didn't fire was expected and totally normal in some way. The whole situation with their kid and her sleeping with multiple men, because of her addiction, were things he was not able to forget or forgive.\n\nThe reaction of P though was very unexpected and strange. After Jerome beat Joe very bad she invited him to have sex with her.  At one side that was jealousy, because P understood that Joe loved Jerome far more than her. From another perspective P probably knew of Joe's nymphomaniac past  and wanted to show her that she can be as bad as her and why not fuck everyone she wanted. P also pissed on Joe after the sex as a total humiliation act. I don't have a good explanation of that though. Just seemed like a  revenge for her trying to kill them.\n\nSo we go to the end scene with Joe and Seligman. They part themselves as close friends and go to sleep. Then at one point Seligman who proclaimed himself to be virgin and asexual goes to bed and tries to fuck her, but with a limp dick in his hand. Joe says no and he answers \"But you have fucked thousands of men\". Joe then shoots him and run away. Joe did that, because she really believed the good intentions of Seligman and liked him a lot. Throughout the whole film she was never sexually assaulted by men, all the sex she did was because she wanted it. This was her first sexual assault and it was done by a person, who she trusted a lot. That's why she kills him.\n\nAlso with the assault done by Seligman, von Trier clearly states that he does not believe in asexuality. Obviously he believes all men are potential sexual predators and want to have sex, although some can't like Seligman because of impotency or like the pedophile who suppressed his urges, showed earlier in the film.\n\nWhat are your thoughts ?",
        "created_utc": 1528725498,
        "upvote_ratio": ""
    },
    {
        "title": "Where to start with fassbinder?",
        "author": "Sw4gmon",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8q8uxz/where_to_start_with_fassbinder/",
        "text": "[removed]",
        "created_utc": 1528717260,
        "upvote_ratio": ""
    },
    {
        "title": "I made a list of 250 notable films directed by women throughout the ages. Please have a look and come with your own suggestions.",
        "author": "Coffeeey",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8q5mwj/i_made_a_list_of_250_notable_films_directed_by/",
        "text": "Link to the list: https://www.icheckmovies.com/lists/female+directors/havardfandrem/\n\nPlease have a look! Extensive research have been done, and I've tried to find interesting feature films in all genres (only fiction), from 1926 to 2018. I mostly did it for myself, as I realized that I've seen far too few films directed by women, but figured I could share it as well. There are some really interesting movies out there, like Évolution (2011) by Lucile Hadzihalilovic, which seems to be a trippy sci/fi-horror flick. The Hitch-Hiker (1953) by Ida Lupino, which is supposedly the first film noir by a woman. Voskhozhdenie (1977) by Larisa Shepitko, which is a Russian war movie, and Emporte-moi (1999) by Léa Pool, which seems to combine social realism, sexuality and the love for cinema. \n\nOn the list are also some of my favourites, like Jeanne Dielman (1975), Kak Menya Zovut (2014) (which is impossible to find, it seems), Toni Erdmann (2016), Mustang (2015), Fish Tank (2009), Lords of Dogtown (2005) and of course American Psycho (2000).\n\nPS: This might be against the rules, but I hope not! \n\nEDIT: Thank you so much for all the suggestions. I've included a lot of them.",
        "created_utc": 1528680748,
        "upvote_ratio": ""
    },
    {
        "title": "Her",
        "author": "crystalglitch",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8q4n9v/her/",
        "text": "Been thinking about this movie a lot lately. It makes me question what love really is and it makes me think a lot about loneliness and depression. I thought it was also interesting that there was a brown/gray “overcast” over the entire movie, making it seem almost like a dream. I think this movie does a great job of showing how raw people are and the simple wonder of life itself. Just want to see how everyone else felt about it.",
        "created_utc": 1528671335,
        "upvote_ratio": ""
    },
    {
        "title": "Hereditary: Inheritance and Control (Spoilers)",
        "author": "RidiculousSideburns",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8q3be3/hereditary_inheritance_and_control_spoilers/",
        "text": "The central conflict that I noticed in this film was the necessary opposition between inheritance and control, and I'll give a brief argument for this position, which will involve completely spoiling the film. \n\nSo, the film begins with Ellen's death and Annie's eulogy for her mother. The central point of this speech is the secrecy that her mother cultivated, since Annie doesn't recognize most of the folks in attendance. This is something of a \"hidden inheritance,\" and Annie is clearly uncomfortable and resentful of her mother's mysterious legacy.  \n\nAnnie, in a loss support group meeting, details the numerous cases of mental illness that run in her family. She struggles with the inherited nature of her own mental fitness, which she can't control. This lack of control manifests in her creative expression, which involves the recreation of events and scenes in her own life in the form of miniatures. Often, the miniatures in the film are exact replicas of events, but, since they are done by Annie's hand, this gives her a sense of place and control. Annie struggles with meeting the deadlines imposed by an art gallery, which also reveals a lack of control over even this work, since she is beset by deadlines and the wishes of others. \n\nObviously, Charlie's death is the main event that best points to the central conflict--Annie later recreates the scene of her daughter's decapitation. However, as noticed by Peter, Annie is a key part of the causal chain of events that lead to Charlie's passing. Peter says something like \"Why did you make her come to the party?\" or something of that sort (note: I was very drunk while watching this film). Annie's lack of a proper response is telling, and invites the question: Is Annie more involved than we initially thought? \n\nAnnie's lack of control is, at least during the two thirds, ambiguously either due to possession or mental illness. The past paint thinner event and the scene where Annie pulls on Peter's head while under his bed can be read either way imo. \n\nWhen Annie is given a route that seems to allow her more control--the seance--this control is subverted when we learn that Annie's supposed confidant Joane is actually a part of the broader mystical plot concocted by her late mother. Annie and her children have been born into an entire scheme to give a demon--Paimon--a host body. \n\nSo, given this perspective, the last third of the movie is potentially troubling. The film, which had been focusing more on developing Annie rather than Peter, suddenly takes Peter's perspective when Annie is possessed. It also seems to answer the previously interesting and ambiguous question I raised above, coming down on the side of possession rather than mental illness. In the *New York Times*'s review of the film, they call this a \"reverse Babadook.\" In that film, what were supposedly supernatural events were actually due to mental illness rather than the existence of a mystical force. In this film, supernatural forces are at the wheel. What made *The Babadook* interesting was the reversal, and what makes a film like *Rosemary's Baby* interesting is the fear and hopelessness that comes from not being believed. *The Vvitch* is interesting because we know early on that the witch does in fact exist, and the story comes from the growing paranoia and doubt among the human characters. \nThese other three films are based on whether or not the perceived supernatural experience is real or not. However, because Hereditary answers its previously ambiguous question definitively, it destroys what made it interesting, and the last third plays out more like a fun haunted house that we've seen before. \n\nSome other points: The theme of inheritance and control can continue at a more meta level. The subversion of the \"cursed child\" trope, by which I mean the killing off of Charlie fairly early, is kind of a jab at the inherited tropes and norms that a horror filmmaker has to work around. (The film's trailer makes it seem like a \"cursed child\" movie like *The Omen*.) The same can be said of the overall tone of the film, which plays around with deadpan humor and scenes that are both funny and tense/frightening. I guess if you buy this meta reading, we get something like Kaufman's *Adaptation*, where the director says \"fuck it\" and ends the third act with a big climactic, trope-filled finish, because hey, it works! Ultimately, the inherited tropes win out over the director, just as possession by a forebear defeats Annie, the film's artist. \n\nAlso, I guess you can push back on my claim that the answer is definitive. The only real evidence for this is the final shot of a miniature of the last scene. Maybe this is showing that Annie created the ending as a way of gaining control of her life and her inheritance? After all, if Annie's dead, where did this miniature come from? I am unsure if this reading works, since most--maybe all, I was drunk ok--of the miniatures Annie makes are of actual events. ",
        "created_utc": 1528660014,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of June 10, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8q1soj/what_have_you_been_watching_week_of_june_10_2018/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1528647024,
        "upvote_ratio": ""
    },
    {
        "title": "Jameela Jamil hits out at Quentin Tarantino for casting 'attacker' Emile Hirsch",
        "author": "[deleted]",
        "url": "https://faroutmagazine.co.uk/jameela-jamil-hits-out-at-quentin-tarantino-for-casting-attacker-emile-hirsch/",
        "text": "[deleted]",
        "created_utc": 1528628186,
        "upvote_ratio": ""
    },
    {
        "title": "Is this an inconsistency to Don Vito's character in the Godfather Part II?",
        "author": "Efren_John",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8py0ez/is_this_an_inconsistency_to_don_vitos_character/",
        "text": "In The Godfather Part I, it was prominent that Don Vito Corleone's first son Sonny was killed by the other mafias.\n\nAnd in the mafia meeting, He claims that he won't have any vengeance on the family who did it because \"it won't bring his boy back\"\n\nBut then in The Godfather Part II, he killed the Mob boss who killed his mom MANY YEARS LATER, and being old and unable to even remember them.\n\nAnd it wasn't business unlike his other killings, this was really an act of revenge.\n\nDon't get me wrong I love both of these movies, I just thought of this.",
        "created_utc": 1528598986,
        "upvote_ratio": ""
    },
    {
        "title": "[Spoiler] Just saw No Country for Old Men and need clarification on the Tom Bell-Chigurh scene.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pxviv/spoiler_just_saw_no_country_for_old_men_and_need/",
        "text": "[deleted]",
        "created_utc": 1528597528,
        "upvote_ratio": ""
    },
    {
        "title": "Donald Sutherland in Animal House",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pwxon/donald_sutherland_in_animal_house/",
        "text": "[deleted]",
        "created_utc": 1528588110,
        "upvote_ratio": ""
    },
    {
        "title": "I really enjoyed \"Oslo, August 31st\" by Joachim Trier and wanted to know if you knew any other movies with similarities ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pwl74/i_really_enjoyed_oslo_august_31st_by_joachim/",
        "text": "[removed]",
        "created_utc": 1528584774,
        "upvote_ratio": ""
    },
    {
        "title": "Fargo wasn't about a crime in the mid west. It was about the people of the mid west.",
        "author": "piperson",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pu2j5/fargo_wasnt_about_a_crime_in_the_mid_west_it_was/",
        "text": "Recently I met someone from Minnesota and I immediately thought about Fargo. On the special features of the film the actors talked about how important the accent was to the Coens, making it appear that they wanted to portray as accurate as possible depiction of a certain kind of people that live there (and the place where the Coens grew up). \n\nThinking about this I began to recall certain scenes in the film. I remembered Marge, immaculately played by Frances McDormand. Her friendly but simple facade that she showed everyone, even the person she was closest to, her husband. What an odd character she is. Most of the film has her interacting with dumb witted people. \n\n&gt; I'm not sure I agree with you a hunnert percent on your policework, there, Lou. I think that vehicle there probly had dealer plates. DLR?\n\nHere is this woman who appears a simple-minded Minnesotan, but is really hiding her intelligence, not only from her co-workers but also from her husband. \n\nIn the last scene, after she witnessed a person being put through a wood chipper, rather than loosing it and needing a break from life as one would expect, she goes home and consoles her husband about having only had his art put on the 2 cent stamp. She appears completely fine and unfazed, no signs of stress, enough so to entertain such trivialities in her husband. You know that she understood what happened because she already demonstrated her intelligence. But is she holding it back, creating a pressure cooker that will soon blow up? It doesn't seem so. She just seems like a really strong person, a super woman, playing the life of a simple Minnesotan. Does she find the life challenging enough for her? It seems so. So I am still left with the question of 'what is a highly intelligent, hardened individual doing playing wifey in Minnesota?' Maybe it's Norm and the innocent Minnesotan people like him that she is defending. Maybe Norm is not only her little, jewel who's innocence that she is protecting, but that he may be her safe haven in a insane and brutal world. The thing that helps her keep her faith that there still is good in the world.\n\nIt's wonderful the way the Coens break from the Hollywood norm and cast a woman to play a traditionally male role. And they did it believably, without turning her into a female Schwarzenegger or even an Ellen Ripley. She doesn't have to show the outward puffing up of the chest in order to show what a bad ass she is. But then again, the Coens style is to thumb their noses at Hollywood convention, always pushing boundaries of the classic movies, turning ex-hippies into hard boiled detectives and featuring a Three Stooges-esque team break out from a chain gang in the deep south. They excel at make loving satires to old Hollywood and it's films. \n\nThis is what I remember about the film, now, after having watched it a couple dozen times. But that's the thing about a Coen Bros. film, they reward you with multiple viewings. The first thing a person would probably take away from Fargo is the horrific aspects of the crime, but you may have a gnawing feeling that there wasn't something quite right with the people. Then after a couple of viewings you understand that to the Coens, this whole story is tongue in cheek. They are chuckling at all the absurd things that their characters do. You understand that the crime aspects is only an excuse to showcase their love/fascination for these simple people. The crime aspects are just to get our attention but it's the characters that really shine with the attention to detail lavished on them. \n\nAnother aspect that you will come away with is the breathtaking shots that Roger Deakins has created. Shots of the vast frozen Minnesotan landscapes and dramatic overhead shots of a snow covered parking lot, each filmed in an awesome, breathtakingly framed shot. \n\nBut after having enjoyed these aspects, I'm still coming away with things like my recent understandings (or rather questionings) about Marge. But, as I said in the beginning, Fargo isn't primarily a crime film, but rather a character study  and loving tribute to the simple, sweetly innocent/ complex, brutal people of Minnesota. ",
        "created_utc": 1528562905,
        "upvote_ratio": ""
    },
    {
        "title": "Hereditary: Annie's Arc, Setup for the twist and Deus Ex Machina [SPOILERS]",
        "author": "pmmeperkytits",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ptji8/hereditary_annies_arc_setup_for_the_twist_and/",
        "text": "[removed]",
        "created_utc": 1528558278,
        "upvote_ratio": ""
    },
    {
        "title": "Films centered on adolescent relationships (developmentally positive or negative)",
        "author": "powderdd",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pt7nr/films_centered_on_adolescent_relationships/",
        "text": "Hi everyone--In my developmental psychology class, we're writing a short paper about whether adolescent relationships are generally developmentally positive or negative. Much of the writing will be based on empirical articles we read, but the professor also recommended that we discuss how a film of our choosing either confirms or denies three popular myths about adolescent relationships:\n\n1) Adolescent relationships are transitory and have negative developmental outcomes\n\n2) These relationships lack unique characteristics--they only immitate models from their environments (parents, peers, etc.)\n\n3) These relationships only have negative developmental outcomes.\n\nWe're to comment on a film that either confirms or denies some of these myths. The professor recommended Boyhood, but I don't want to watch that again. Any film recommendations that seem relevant to the topic?\n\nThank you all for your recommendations! I'll keep reading them as they come in and choose a film tomorrow. You all are awesome!",
        "created_utc": 1528555283,
        "upvote_ratio": ""
    },
    {
        "title": "The sub-textual violence in Scorsese's New York, New York.",
        "author": "desicinephiles",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pros4/the_subtextual_violence_in_scorseses_new_york_new/",
        "text": "New York, New York (1977), was Scorsese’s tribute to musicals that came out in Hollywood’s classical era, something that he grew up on. As he calls it, it was his “valentine to Hollywood”. At first New York New York, may not seem like a quintessential Martin Scorsese picture, but on close examination it unravels into a profoundly complex film, which could be considered Scorsese’s most personal film. The film could be seen as a tale that chronicles the life of two musicians, who fall in love but their roller coaster of a love affair is ultimately doomed. For Scorsese it was the story of any “two creative people” working in the same business, like a director and a writer and the strain it puts on the relationship. Quite like other musicals, while the romance plot is central to the film, it is the gradual deterioration and the eventual collapse of the same that drives the plot. In New York, New York, the music, even though not used as a replacement for dialogue as exposition about the character’s emotions, is used as a tool to setup a basic ideological conflict between the two characters and at certain points even becomes a weapon for one character to berate the other. [Read More](https://www.desicinephiles.com/editors-pick/the-subtextual-violence-in-scorsese-s-new-york-new-york)\n\n",
        "created_utc": 1528536311,
        "upvote_ratio": ""
    },
    {
        "title": "What does this line from Pauline Kael's review of Godard's Bande à part imply ?",
        "author": "mother_toast",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pr86q/what_does_this_line_from_pauline_kaels_review_of/",
        "text": "Sorry for my inconvenience but as English is my second language, I didn't quite grasp what Kael tried to convey by the **bold**, *italic* line below.  It's from Quentin Tarantino interview: Reservoir Dogs (10\\-Year Anniversary DVD extras).\n\n&gt;While I say I’ve outgrown \\[French New Wave filmmaker Jean\\-Luc\\] Godard, I haven’t outgrown Pauline Kael’s reviews of Godard. The most influential piece of film criticism which applied to my aesthetic, which applied to me–I was very young–I remember reading it at Philippe’s, that French sandwich place … I’m reading her review of Band of Outsiders, also known as Bande à part, which I named my own company after–she’s reviewing Godard’s movie and she says, 'It’s as if a couple of movie\\-crazy young Frenchmen were in a coffee house and they’ve taken a banal American crime novel and they’re making a movie out of it based not on the novel ***but on the poetry that they read between the lines***.’ And when I read that I said, 'That’s my aesthetic! That’s what I want to do! That’s what I want to achieve!’\n\nI've got trouble getting the meaning across of the highlighted line.\n\nAgain, sorry for bad English.",
        "created_utc": 1528529397,
        "upvote_ratio": ""
    },
    {
        "title": "Merry Christmas, Mr. Lawrence- Love in the Time of War",
        "author": "the_tree_partay",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pqzjp/merry_christmas_mr_lawrence_love_in_the_time_of/",
        "text": "As a farcical court martial involving a disorderly British soldier is about to cease, a young Japanese captain makes a request to persist with the interrogation. He starts off by quoting Shakespeare’s Danish play. Thus begins a rapid back and forth between the close-ups of an androgynous British rockstar, fresh off the release of his divisive album Let’s Dance, and a stalwart of Japanese electronic music whose [alleviating synth soundtrack kicks off the opening moments](https://www.youtube.com/watch?v=LF9_9MZyQGo) of Nagisa Oshima’s 1983 classic *Merry Christmas, Mr. Lawrence*.\n\nAfter their verbal sparring, Ryuichi Sakamoto’s Captain Yonoi demands to see Jack Celliers’ (David Bowie) scars during his stint as PoW in Java. Celliers complies, revealing marks on his back. At first, Yonoi’s disgust is easy to brush off as a conventional aversion. But this scene marks the beginning of Yonoi’s unusual fixation on Celliers, culminating in tragedy for both of them.\n\nOshima doesn’t draw out any homoerotic connection between the unlikely friendship that links the titular Lawrence (Tom Conti), a British soldier who has lived in Japan long enough to learn the language and Sergeant Hara (Takeshi Kitano), a man with equal doses of sadism and humanity in him. Choosing to focus on Yonoi and Celliers instead, Oshima strikes at the heart of what honour means from both sides of the pond.\n\nEmbellishing on honour and the role it plays, one can’t help but bring Yukio Mishima into the picture. After being misdiagnosed with tuberculosis and declared unfit for service, Mishima worked his whole life to see Japan return to its imperialistic roots. The Japanese writer and revolutionary [wrote a story](http://www.mutantfrog.com/patriotism-by-yukio-mishima/) and later [directed a movie](https://www.youtube.com/watch?v=bkOw-NH8mo4) titled Patriotism, which dwells upon the [February 26th Incident](https://en.wikipedia.org/wiki/February_26_Incident), a coup d’état organized by a group of young, idealistic officers in an attempt to seize control of the Imperial Palace. The attempt went awry and multiple members of the Righteous Army were executed. In the film, Captain Yonoi laments at the fact that he could not partake in the Righteous Army’s patriotic sacrifice, having been posted at Manchuria at the time. *Seppuku* lurks around the corner of the entire movie, as at the beginning, Sergeant Hara supervises the *hara-kiri* of a solider who was found engaging in lewd acts with a Dutch prisoner. Furthermore, Yukio Mishima is famously [remembered for committing *hara-kiri*](https://www.thewritersdrawer.net/mishima.html) after his failed coup in 1970 with the objective of restoring the power of the Emperor.\n\nPreservation of a quintessential Japanese spirit and discontent with the manner in which the transition from old Japan to modern Japan was taking place are not the only things that bind Mishima and Captain Yonoi. In his 1949 book Confessions of a Mask, [the former wrote about homosexual and sadomasochistic desires](https://www.japantimes.co.jp/culture/2017/01/14/books/mishima-maze-sexuality-modern-japan/#.WxqR6Ypx3IU), including a description of the narrator’s ejaculation, which occurs while he is transfixed by the arrow-pierced body of St. Sebastian, as depicted in the [Guido Reni painting.](https://www.wikiart.org/en/guido-reni/st-sebastian) Mishima would further explore these themes in his novel *Forbidden Colors* (whose Japanese title is an euphemism for homosexuality), a novel which shares its title with [one of the tracks on the soundtrack album for Merry Christmas, Mr Lawrence.](https://www.youtube.com/watch?v=lNazfECMKcA)\n\nBut it is a rather gross oversimplification to assume that Mishima was simply substituting himself as the protagonists of these novels. The sexual inclination that Mishima speaks of differs from homosexuality in the modern Western sense. *Nanshoku* (the Japanese tradition of male-love), had two different parts: monastic and military. In case of the latter, the bonds between senior and junior soldiers, while erotic in nature, primarily served as institutions that served to maintain order by [disseminating several social hierarchies](https://alexbenkhart.wordpress.com/2011/10/12/history-nanshoku/), rather than serving as an act that was associated with perversion and deviancy. The decline of *nanshoku* occurred during the Meiji restoration, as a result of Western cultural influence and the breakdown of feudal structures. The Keikan Code criminalized sodomy and as a result, [*nanshoku* moved to the fringes of society.](https://www.tofugu.com/japan/gay-samurai/)\n\nThe arrival of Jack Celliers ignites an internal struggle inside Captain Yonoi, as he begins to spy on Celliers at night, constantly inquires about him, and wishes to promote him to the post of the PoW commander. After being disappointed with the behaviour of the British soldiers during a ritual suicide, Yonoi subjects the camp to observe a period of *gyo* (Japanese fasting technique to cure laziness). Celliers rebels by supplying the prisoners with rations. He survives an attack from Yonoi’s personal servant who suspects that Celliers has put a spell on Yonoi, and is later sentenced to solitary confinement for the possession of a radio, along with Lt. Col Lawrence.\n\nWhile Yonoi is the man who wishes to preserve the honour that he feels he lost during the Feburary 26th incident, Celliers wishes to do away with any notion of honour. An extended flashback shows us Celliers standing up against bullies to protect his younger brother during his childhood. A few years later in high school, Celliers goes out of his way to avoid standing up for his feeble sibling, as he is tormented by older kids. Haunted by the incident for life, Celliers becomes overwhelmed with the guilt which originated from his absurd perception that nothing which belonged to his blood could have been so weak. The war provides Celliers with an inexplicable sense of relief and even better, a chance for him to rebuild his conviction of alleviating the needy. Celliers is christened as a ‘soldier’s soldier’, seeking redemption for his past failures by raging against Yonoi and the Japanese.\n\nAfter learning that Sergeant Hara released Celliers and Lawrence since they were wrongfully imprisoned for the radio theft, Yonoi’s behaviour becomes more erratic. Obsessed with finding a weapons expert in the British camp and agitated with the Commander’s failure at not producing him with one, Yonoi summons a parade of all the soldiers. Even the sick ones, who are dragged out of their beds in their crutches. As Yonoi is about to execute the Commander for his non-cooperation, Celliers provides us with the most resplendent moment of the entire film. He walks upto Yonoi in defiance and kisses him on the cheek. Yonoi, wrestling with the offense afflicted upon his bushido honour code as well as his homoerotic fixation on Celliers, is unable to attack Celliers and falls to the ground.\n\nCelliers’ final act of insubordination results him in getting buried with sand upto his neck, as Yonoi’s successor claims that he won’t be as sentimental as him. Late at night, Captain Yonoi goes to Celliers’ burial ground when there is no one around and cuts a lock of hair. Yonoi entrusts Major Lawrence with the task of dedicating Celliers’ lock of hair to a shrine in his village.\n\nCelliers’ interlude in the symphony of Yonoi’s guilt-ridden military career also functions as a metaphor for the intrusion of modern Western culture in Japan during the first half of the twentieth century, the reluctance to accept it and the supposed delinquency of falling prey to these ideas, believing that they would erode true Japanese values. Similarly, Yukio Mishima was a man whose life was split between [the past and the present](http://www.inquiriesjournal.com/articles/797/overcoming-modernity-in-yukio-mishima). He constantly urged his countrymen to return to the samurai tradition, which he believed conveyed the spirit of a united Japan better than a modern army. However in his personal life, Mishima would embrace -the West by donning Western clothes, living in a house with lush Victorian architecture and by writing about a subject that had become outlawed in Meiji period Japan.\n\nNagisa Oshima’s simple central thesis is ultimately about how a cataclysmic event like the War crumbles innate notions of honour and society. But Oshima doesn’t ostracize this erosion as something evil. Rather he turns this into a grave plea for tolerance in the time of war. Merry Christmas Mr. Lawrence is about how the unlikeliest of situations can lead a man to discover that a thousand year old honour code proves futile when you’re encountered with David Bowie and his blonde locks. Emotional repression is central to every tenet of the masculine gender and to question this, Oshima brings out the ugliest and the most pernicious thirst of mankind- war.\n\nYonoi and Celliers are consumed by the consequences of this thirst, but the freeze frame on Kitano’s Sergeant Hara, perhaps the most sanguine closing shot of any war film ever, gives us the optimism to believe that the corrosion of a deep-rooted internal idea isn’t necessarily decadent or twisted, but rather is a mirror into the dispositions that we let society take away from us, under the garb of normality.\n\n(From my Medium article- https://medium.com/@rat_tweak/merry-christmas-mr-lawrence-1983-love-in-the-time-of-war-417e45206177)",
        "created_utc": 1528526005,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Film Theory Essays",
        "author": "MrRakso",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pqqdt/looking_for_film_theory_essays/",
        "text": "[removed]",
        "created_utc": 1528522475,
        "upvote_ratio": ""
    },
    {
        "title": "The best part of the KIDDING (Showtime) trailer",
        "author": "[deleted]",
        "url": "https://i.redd.it/1urpgffwdw211.gif",
        "text": "[deleted]",
        "created_utc": 1528516225,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with Hollywood covering up pedophiles?",
        "author": "hwbush",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ppvle/how_do_you_deal_with_hollywood_covering_up/",
        "text": "Just watched *The Professional* and it gave off strong pedophilia vibes to me. Turns out, the director [Luc Besson](https://medium.com/@nerdypoc/should-director-luc-bessons-pedophilia-really-be-forgotten-5471a2c7c9d5) was dating a 15 year old at the time and impregnated a 16 year old. According to the article linked, they had to edit the original *Professional* cut to be less pedo\\-forgiving. I find this interesting because when Roman Polanski was outed as a pedophile a decent amount of actors/actresses petitioned around trying to get the US to drop related charges. Natalie Portman, who starred in The *Professional*, signed the petition, although she later said she regretted it. The Profession*al has an 8.6 on imdb despite these allegations, scoring higher tha*n The Presti*ge (8.5)*, Once Upon a Time in the We*st (8.5) an*d The Shining\\* (8.4).\n\nI am in a sort of a personal\\-crisis, here. I love to watch movies/watch TV, so much so I consider it one of my main hobbies. But am I supporting an industry that covers up sexual predators?\n\n\\**The Shining* is one of my favorite films ever\\- but it is notably directed by Kubrick, who also directed the controversial\\* Lolit\\*a.",
        "created_utc": 1528512756,
        "upvote_ratio": ""
    },
    {
        "title": "The double life of Veronique (1991) - A poem that I do not quite understand",
        "author": "Lucianv2",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pon4e/the_double_life_of_veronique_1991_a_poem_that_i/",
        "text": "I got the change to see this movie in the theatre a couple months ago, and was generally a bit lukewarm to it partly due to uncomfortable seating and whatnot, but also because I found myself almost completely lost in the picture, and not necessarily in a good way… Although I need to point out that I definitely liked it and didn’t necessarily dislike any part of it, was just a bad experience for the most part. Anyhow I saw that it was on Mubi and decided to watch give it another ago. \n\nAt its simplest, “The double life of Veronique” is a beauty to behold and magnificent to listen to, it is quite simply one of the best in terms of setting a mood or evoking emotion through the cinematography and soundtrack and for that alone it deserves a whole lot of praise. But there is obviously much more to it than that… It is a movie that is very hard to describe in words, everything that it tries to evoke is through subtle acting, the camera and or the soundtrack, rarely through words. To quote Ebert: “It is important to resist the temptation to figure out every last detail of The Double Life Veronique” because it won’t get you anywhere. The movie plays more like a poem than anything else, a spiritual one at that. It deals with grief and identity and has an obvious juxtaposition of two identical women, but small differences that lead to completely different lives, where the heavy implication is that one of them somehow learns from the mistakes of the other. I would be lying if I said that I had a much better understanding of the movie this time around, a better understanding, sure, but I still feel lost at words when trying to describe or come up with exactly what the movie is about. It feels like a movie that I might have to watch 10 times before I get a good grasp of what *exactly* the movies is about, and you know what? That idea makes me more excited than it has me frustrated, and I really can’t wait to revisit it again. \n\nTrying to read about it, it seems to be that the context in which Kieslowski’s movies where made where very political, and that his movies were made with that in mind and maybe the main point even. Anyone know any good source to read up on this?",
        "created_utc": 1528500618,
        "upvote_ratio": ""
    },
    {
        "title": "What's the deal with the light on the table in Tarantino's movies ?",
        "author": "_ozunu",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8po4k1/whats_the_deal_with_the_light_on_the_table_in/",
        "text": "I don't know if you've noticed that but Tarantino usually put this single lightbulb during conversation's scene around a table. I've seen it in Kill Bill, Django Unchained, Inglorious Basterds, Hateful Eight)\n\nUsually when two or more character are having a conversation at a table there is a unique a really bright light (the whites are even burned on screen).\n\nIs this an old movie lightning technique ? Is this a reference to some particular genre of movies ? What's the meaning behind this ? Make the character more frightening ? The scene more intense ? \n\nExamples :\n\n[https://www.youtube.com/watch?v=QfSjs\\_6MZOQ](https://www.youtube.com/watch?v=QfSjs_6MZOQ) \\- Landa and the Farmer  \n[https://www.youtube.com/watch?v=ui7DPpL7cq8](https://www.youtube.com/watch?v=ui7DPpL7cq8) \\- Land again !  \n[https://www.youtube.com/watch?v=T2YJtk2\\-9do](https://www.youtube.com/watch?v=T2YJtk2-9do) \\- Kill Bill Hattori Hanzo  \n[https://www.youtube.com/watch?v=HXu5jRKP7Mg](https://www.youtube.com/watch?v=HXu5jRKP7Mg) \\- Inglorious Basterds (1:14)\n\nThank you for your insight guys ! ",
        "created_utc": 1528496249,
        "upvote_ratio": ""
    },
    {
        "title": "The Cinematic Nature of Anthony Bourdain's TV Shows",
        "author": "suburban_ghost",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pnobn/the_cinematic_nature_of_anthony_bourdains_tv_shows/",
        "text": "I know this is \"true film\", but as the definition of what constitutes cinema or what can be considered \"cinematic\" has been stretched and changed over time, especially with the rise of streaming technology, let me talk a little bit about the late and unequivocal Bourdain: \n\nThe first time I ever saw an episode of one of his shows was the first ever episode of *No Reservation*s*.* It took place in France, and thinking back, it was as morbid a foreshadowing of Bourdain's own trajectory as one could ever think up, to the point where I shudder remembering the details of it as I write it here. Belying the jovial title of the episode, \"Why The French Don't Suck\", the episode is dark. It was meant to be dark. It was an introduction into exactly what kind of chef and yes, *storyteller* Bourdain was. He succumbs to several hallucinations after having drips of pure absinthe and bites of pitch black blood sausage in a barely lit dim basement bar, and sleeps being haunted by demons in the same hotel room in which Oscar Wilde committed suicide. The camera shifts side to side, the lights flicker, and Bourdain wonders himself, trapped in the bed, in an echoey voiceover, whether he too will live his last waking moments here in this room. \n\nThe episode was a remarkably artistic and weighty beginning to a show dedicated to food and culture. Every episode then on became a narrative, with Bourdain as the central character charting his way through countries and meeting people who had their own stories to tell. The camerawork and editing on the show was as important as the food and conversations. Unlike many food shows where I mainly just wait to see, you know, *the food,* Bourdain's shows were captivating in their ability to distract me with everything else as well. I wanted to know the people, I wanted to watch him in a canoe sailing down the Amazon. In an episode on Iceland, a tourism commercial for Iceland plays, with a narrator speaking in romantic terms about the beautiful sunsets and lush golf\\-courses and and incredible docks and seaside restaurants. As soon as the commercial finishes it cuts to Bourdain inside an ice cave in the middle of a blizzard freezing his ass off and teeth chattering. The entertainment factor for Bourdain was as much about the cinematic narrative he wanted to weave regarding a country, with endearment or with mockery but always with respect, as it was about the food. \n\nIf you haven't seen any of his work, *Parts Unknown* is all on Netflix (all 8 seasons) and *No Reservations* has several episodes available for free on YouTube (if not all of them). RIP",
        "created_utc": 1528492684,
        "upvote_ratio": ""
    },
    {
        "title": "Chimes at Midnight",
        "author": "GamerMan15",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8pn5qy/chimes_at_midnight/",
        "text": "I honestly think this is the most well crafted movie of all time. It has this atmosphere of scrappiness, like they were given 100 bucks to film what they could that day, then when they got done filming, everyone went to go work at a coffee shop and out their checks together to finance the filming tomorrow. Kinda long analogy but i dont think it's too far off\n\nThe fact that Orson Welles was able to make his best movie when he was at his most radioactive is astounding to me. Everything from the story, the characters, the staging, the camera work, the sets, it was a massive treat. What do you guys think?",
        "created_utc": 1528488770,
        "upvote_ratio": ""
    }
]