[
    {
        "title": "The TrueFilm Weekly Plug. Post your blog, site, channel, podcast or profile right here. Week of (February 22, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7zf3ld/the_truefilm_weekly_plug_post_your_blog_site/",
        "text": "This is the one and only place on the TrueFilm frontpage where you are allowed, and even encouraged, to promote yourself. If you have a blog, a YouTube channel, a Twitter account, a podcast, or film that you'd like us to see, plug it here, and only here.",
        "created_utc": 1519308363,
        "upvote_ratio": ""
    },
    {
        "title": "Hierarchies in The Shape of Water",
        "author": "angry_searcher",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7zdusn/hierarchies_in_the_shape_of_water/",
        "text": "The film is full of people being screwed over by the hierarchy they’re a part of, at every rung of the system. At the top, you have Richard (Michael Shannon’s character) who explicitly tells the general he’s an exemplary government agent, but is treated with cold indifference. He’s given his life to this hierarchy but is only seen as an expendable tool. Similarly, Richard’s simpering assistant is obviously doing everything he can to please his higher-ups (like calling the general right away) but also gets cold indifference, he gets shafted by Richard who just sees him as a tool and steals his car. Richard’s wife has obviously bought into the hierarchy, fulfilling the role of a submissive housewife, but is literally screwed over. Richard treats her offering of sex matter-of-factly and has no objections to shutting her up with a bloody gangrenous hand during it. He’s obviously thinking about the mute Elisa during that scene, and he also sees her as a tool or object, something beneath him that he can use, in that case as a sexual object.\n\nDmitri (Michael Stuhlbarg) is involved in two heirarchies and is abused by both. When obeying his Soviet superior's command to show up for extraction, they try to kill him, then he's finished off by his American superior. Neither government cared about his research or his respect for the creature. Giles (Richard Spencer) has been fired from an old job but is still trying to gain favour with his old boss, putting his effort into painting advertisements, but his efforts are met with disinterest by the uncaring system. Even at the bottom of society the hierarchy exists, Zelda’s husband clearly buys into it, he’s the man of the house and expects his wife to do everything. He also acts submissively to Richard, someone above him in the hierarchy, despite Richard being racist and not giving a damn about a poor black couple unless he can use them as a tool, in this case to get information. Zelda’s husband is submitting to the racist, patriarchal hierarchy but gets screwed over by it.\n\nElisa and the creature have a loving, mutual relationship which isn't hierarchical at all. That's why, thematically, they have to leave the world of the hierarchy and enter the sea as another world of intimacy as equals, hence The Shape of Water.\n\nThere's a lot of other things to discuss, like misunderstood archetypical stories (Samson and Delilah is about betrayal, torture, and violence, not true love), and Elisa's name being a contraction of Elisabeth (from the Hebrew \"My God is my oath\" showing her connection to the god-like creature). But I'll leave it there.",
        "created_utc": 1519293883,
        "upvote_ratio": ""
    },
    {
        "title": "Wendy Torrance from The Shining deserves a spot among strong female characters like Ellen Ripley and Sarah Connor",
        "author": "Ascarea",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7zdtdh/wendy_torrance_from_the_shining_deserves_a_spot/",
        "text": "Wendy Torrance is usually thought of as timid, submissive, and perhaps a little daft. She's certainly portrayed that way by Shelley Duvall in many of her scenes, and viewed that way by her husband Jack. But in the impossible, terrifying situation she finds herself in, she actually does everything right and she comes across as capable and brave despite facing sheer terror.\n\nI think it's notable that she's actually the one doing all the care taking around the hotel, including things that would be considered a \"man's job\" like checking the circuit breakers and operating the radio (in any case, it's Jack's job and not hers, and I doubt she'd see much from Jack's salary at the end of winter had he not gone crazy). She's not only useful and capable, but she's dealing with the predicament of staying all winter at a remote hotel with a child and a mean husband quite well.\n\nWhen Jack goes crazy, she turns into a screaming mess (and c'mon, who wouldn't?), but she remains capable and she protects her son. She does everything right. She subdues and imprisons her attacker, she finds shelter, she wards of her attacker when he returns, she helps Danny escape, and she's even able to drive the snow tractor to get away. She may not have a pulse rifle or a shotgun, but she's up against the same kind of violent terror like a xenomorph or a T-1000, and she survives, with her child rescued, and manages to get to safety.\n\nSo maybe it's time to look at Wendy in a different light. She was actually a badass.",
        "created_utc": 1519293380,
        "upvote_ratio": ""
    },
    {
        "title": "Are my buddy and I crazy for thinking the Black Panther is a disappointment?",
        "author": "MidnightReverie",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7zdb85/are_my_buddy_and_i_crazy_for_thinking_the_black/",
        "text": "**Full of Spoilers ahead, You have been warned**\n\nMy buddy and I were very excited for Black Panther as it is rare for an ethnic non-white minority to be the main star of a major blockbuster superhero movie. And I really wanted to like this movie, and to its credit it does many things right: the strong cast, memorable supporting characters, un-obnoxious soundtrack that doesn't rely too much on rap and hip-hop, some of the themes, BP's costume design, etc.\n\nBut my buddy and I walked out of the theater discussing about the movie and we essentially agree on what we consider many of the film's huge shortcomings that ultimately brought down the movie. \n\nFor me the biggest criticism of the film is that for a superhero action film, its action scenes were very lackluster. The fight choreograph involving BP in Captain America Civil War blew me away, the moves and action sequences they designed for BP, Cap, Winter Soldier, and Black Widow were innovative, spectacular and yet grounded in reality as their power levels aren't as high as some other Marvel characters such as the Hulk, Thor or Iron Man. I thought BP would have the same quality of fight choreograph in his own standalone movie, alas that is not so. \n\nThe jungle fight scene was dark, blurry with too many unnecessary cuts to even see the action, the South Korean car chase was just 100% CGI, and not very good one at that, and the final climatic fight scene to dispatch Killmonger was extremely lackluster and probably the worst fight sequence in the whole film. For a major superhero action movie in 2018, having weakly choreographed and unimaginative fight scenes are just unacceptable to me.\n\nBP is another Marvel movie that suffers from the weak-villain-syndrome. I do give them credit for making Killmonger more sympathetic and relatable, but they could have done so much more. They wrote Killmonger to be sympathetic with his motive and backstory, and yet his character was written as this annoying gangsta-wannabe with a cliche \"ghettospeak\" that simply doesn't fit his character. Is this really how someone who graduated from MIT, deployed as a decorated Navy Seal with impressive records and compassion for the plight of his people talks?\n\nBy the end of the film we see BP goes through a character development and decided to reverse the millennium old policy of Wakandan isolationism and finally reach out to the world and bestow upon them the wonders of Wakandan technologies, but the film never really show the catalyst of this change. What made BP decide to open up Wakanda? Because his dad abandoned Killmonger behind in the US instead of taking him in back to Wakanda? This is just extremely weak as a catalyst for me. I would argue that if the script wrote BP to be forced to interfere with civil wars and genocides in Africa that are slowly spreading to Wakanda's borders, allowing BP to witness first hand the rampant problems in Africa, the suffering of some of the most impoverished people on the planet, it would had been a much more powerful, persuasive catalyst to BP's character development, as well as a much more relevant social issue. \n\nKlaw as a side villain character was completely unnecessary. So Killmonger employed him as a member of his crew to rob Vibranium all over the world for years, pulled a daring rescue to retake him from BP, and then kill him just to get into Wakanda? This plot makes absolutely no sense to me.\n\nWakanda's technologies were simply too fantastical to the point of magic and wizardry, and a lot of them simply makes no sense. At the beginning jungle scene we see BP throw a bunch of small electrical devices that somehow all magically landed on the front hood of the jeeps and stopped their engines. But why? BP is nigh indestructible and nothing the Boko-Haram styled baddies wielded in their arsenal had any way of taking down BP. Why not just jump straight onto the first car, quickly dispatch it by slashing its tires with the Vibranium claws and then jump to the next car? It would surely make for a much more spectacular action scene. \n\nI wouldn't have so much gripe with Wakanda's far-fetched technologies if they at least use a little screen time to explain how they work, perhaps briefly show some of the technological wonders that normal Wakandan civilians use on a daily basis. \n\nFor a country that is so absurdly technologically advanced, and yet to be ruled by an absolute monarchy for the past 2000 years and steeped in so much superstition and superannuated customs were a huge leap of disbelief for me. I simply don't believe that for a country that has the technology to cure cancer (cannon in comics) would retain the ridiculous traditional custom of rule by combat. It might had made sense in the 1000 BCE against hostile tribes and wild animals for the king to be the strongest warrior, but even a 16 year old should have the common sense and logic to realized that in 2018 picking simply the best MMA fighter to be absolute ruler of the most technologically advanced country in the world is a mentally challenged idea in the highest regard.\n\nAnd yet, the movie never bring up the paradox of how Wakanda's technology might and its advancement in sciences are a stark contrast to its exploitative elite ruling system and ridiculous customs and rituals. \n\n\nI really wish I liked BP more, but with all the above glaring flaws of the film, I can only say it is an okay film, it did good on some things but it never fulfilled its true potential. I really don't understand the raving reviews it's been getting from critics and people. \n",
        "created_utc": 1519287098,
        "upvote_ratio": ""
    },
    {
        "title": "The Killing of a Sacred Deer",
        "author": "Myxamatosis92",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7zbqyo/the_killing_of_a_sacred_deer/",
        "text": "One of the oddest films I have ever seen. The only other film I've seen by this director is dogtooth which I enjoyed. I definitely think this film is alot better though.The performances by everyone was exceptional but Darrell and kidman were incredible. \n\nI think the \"sacred deer\", was Bob. He was the only truly innocent person in the film. I think the director likes to make films about what we are without morality. It explains the robotic dialogue and general apathy all the characters have. We see Steven crying but it seems more for himself and his guilt over killing Martins dad when he'd been drinking than his children dying.\n\nSteven tried to take choice out if the equation by putting a hood over his head and run round in circles but I still believe he meant to kill bob. He was the obvious sacrifice to Martin. \n\nEven though the film takes place in a mostly immoral universe, justice still exists. What Steven did was manslaughter with zero consequences.No jail time or even fired from his profession. He only pays Martin so much attention because of his own guilt and gets him an expensive watch somehow as a replacement for his father. \n\nI've never felt so on edge throughout the entire film like that since The Shining. I watched it two days ago and I can't stop thinking about it.\n\n",
        "created_utc": 1519269913,
        "upvote_ratio": ""
    },
    {
        "title": "Who are the interesting up and coming filmmakers?",
        "author": "KorovaMilk113",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z9g17/who_are_the_interesting_up_and_coming_filmmakers/",
        "text": "Hey guys, like the title says I'm trying to find who the up and coming really interesting filmmakers of tomorrow are, who are the people who have a few short films, or maybe a feature or two that seems like they are really going somewhere.\n\nThere are a couple filmmakers who are sort of on the edge like Alex Ross Perry and Joel Potrykus but both of them already have several features under their belt and seem well on their way (especially Perry who has already worked with people like Elisabeth Moss and Jason Schwartzman)\n\nBasically I'm looking for the people that are just kind of starting their careers off, maybe they are amateurs uploading little shorts to Vimeo, maybe they have a feature doing the festival rounds- just looking for what's coming next! ",
        "created_utc": 1519250003,
        "upvote_ratio": ""
    },
    {
        "title": "Can we dissect and delve into the use of light and brightness in Bladerunner 2049?",
        "author": "unclefishbits",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z8il4/can_we_dissect_and_delve_into_the_use_of_light/",
        "text": "[also posted in movies, but not sure they discuss like you guys do over here]-- So, I am a big fan of the \"every frame is a painting\" concept of how Deakins and Villeneuve shot the film, and *color*, specifically, was used brilliantly. I've watched some featurettes on Deakins lighting style, etc, and I've researched a bit of the conversation on \"light\" and \"brightness\" vs the original film, and there doesn't seem to be a deep discussion of it.\n\nThe critical commentary would be that the new BR2049, 30 years into the future, is far too bright, and far too light, vs the grimey and \"used\" film noir look of the original movie.  The new film didn't feel as entrenched into a dystopic future as the original, and although that can be a negative criticism, I can't help but think I am missing something about the decision to use brightness and lightness in the film compared to that darker tone of the original release.\n\nIn this film, there's the comment \"It's too dark in here\", which seems to counterpoint Deckard's comment in the original, \"It's too bright in here\", which sets the tone for the look of the film, as well as the need to speak to a replicant in a darker room. The \"It's too dark\" comment was prior to speaking to a human, I believe, which would suggest a counterpoint between replicants and humans.\n\nAlso, I just can't imagine Deakins and Villenueve consciously opting out of the tone and noir look of the original without a firm, and precise, reasoning. \n\nSo in a lack of conversation about how bright, and \"clean\" the new film looked overall, is there any worthwhile discussion to be had about the tone of the new film's take on \"noir\" or setting the world up to be less grimey and dark than the original?\n\nI know we never see direct sunlight save but a scene or two, and the glow and lighting (namely color) gets across a lot of the global warming elements, ie 30 years on from the prior film.... and voila, SNOW!  \n\nBut just curious..... What is the subtext or artistic vision for having the universe a more stale and clean vibe than the original, or is it that they missed the mark on replicating that universe, and it's just the way digital format vs film works, etc? What are your thoughts?",
        "created_utc": 1519243056,
        "upvote_ratio": ""
    },
    {
        "title": "Some Questions about 'City of God'",
        "author": "myenocin",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z8hf5/some_questions_about_city_of_god/",
        "text": "I absolutely loved this movie mainly for the characterization of all the boys and just being able to relate to Rocket as the straight arrow kid of the bunch, but I was confused by a few things. First off, why does Rocket almost completely disappear from the narrative in the last act to become a Knockout Ned movie? I liked the transition from good guy Ned to gangster Ned, but by far my favorite parts in the movie were the Tender Trio's story and Rocket on the beach. And Lil Ze being totally evil, but there wasn't really a shortage of him being a bad guy through it. The summaries for this movie also suggest that a point in the movie is Rocket's photographing the gangsters which leads to a rise in fame etc, which is basically nonexistent until the very last parts of it, and you don't really get to see what happens as a result of him putting them in the paper aside from him getting an internship. Second- why does Angelica also completely disappear from the movie? Her last appearance is crying over her dead lover before being told to leave. Does she leave the hood? Third- is it just that the actor for adult Lil Ze was too good to pass up? Because Lil Ze/Dice and Rocket are supposed to be the same age or so and they look like they're 6-7 years apart. Are they the same age? ",
        "created_utc": 1519242821,
        "upvote_ratio": ""
    },
    {
        "title": "The Handmaiden: An Anti-Erotica Erotic Film (Spoilers)",
        "author": "margaerytyrellscleav",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z8448/the_handmaiden_an_antierotica_erotic_film_spoilers/",
        "text": "Yesterday I watched The Handmaiden and thought it was a brilliant piece of work, even better though is that it approaches a subject in a pretty definitive manner. There may be no film that has approached the subject of erotica better.\n\nI'll of course admit I've wondered before about the damaging societal effects of the ubiquity of very hardcore pornography since the inception of the internet, however, ideas like 'rape culture' have seemed a little overreaching or extreme to me. That said, the Fifty Shades franchise is something that does - even as a straight white British guy - make me stop and think 'yeah, fuck our relationship with sex is fucked', especially for women who have these ideas pressed upon them.\n\nThe Handmaiden did for me something that few films ever do for people, and I think it genuinely made me alter my position at least a little, or understand something in a new light. When I say The Handmaiden is an anti-erotica erotic film, I mean against a certain kind of damaging erotica, not erotica in totality. The film is against the kind of damaging erotica that subjugates women among other problems. The scene in the library where the two main female characters destroy the Uncle's collection I think was the film's pivotal scene. \n\nHideko's entire existence is to service the fantasies of men, she has not been allowed to develop a natural sexuality of her own up to this point. In this scene all of that is destroyed, I thought the image of the snake having its head stricken off was particularly interesting. One the one hand, we can see the snake as phallic, and so the cutting off of its head could be read simply as a revolutionary act; the subjugated women striking out at a male hegemony. However, I think it is also interesting that the Uncle mentions in an earlier scene how the snake guards knowledge - a nod to the bible story of Adam and Eve. Read in this way, we are reminded of the fact women are seen to have committed the original sin, that humanity is basically constantly paying the price for women's shortcomings. The women are saying 'fuck that we've not done anything'.\n\nHow the film deals with addressing this problem to men is also interesting. This may be a stretch, but this is how I read the scene of the Count's death: the Uncle stops short of cutting the Count's dick off, I took this to be the film saying 'look guys, we don't want to cut your dicks off, this film isn't sheer misandry although we know the more reactionary types will label it as that, can we please at least investigate whether the projection of men's fantasies into society in a way that exploits women might be a bad thing?'.\n\nLastly, the irony facing the film is that it is itself a piece of erotica. How the film deals with this is by existing as the kind of erotica which it doesn't think is exploitative. In reading about the reaction to this film, I found that a lot of people seem to think the sex scenes are the film's weakest aspect, however, I think they are completely necessary. The film shows sex to be fun, the camera angles are often quite odd and humorous - think Sook-hee going down on Hideko - and, perhaps more importantly, they are allowed to be intimate. In the scene where the Uncle tortures the Count, the final question the Uncle has is the most telling: 'did she resist?'. For him, sex is built atop a foundation of oppressing the other. In the scene where the Count wishes to have sex with Hideko it is in the context of something definitely approaching a rape, he even admits to her that he believes 'even in rape women still enjoy it'. The Handmaiden exists as a piece of erotica where this narrative underpinning is not necessary for sex. Hideko and Sook-hee have what I'm sure the film thinks of as healthy sex, and so can create healthy erotica.\n\nNot to be too soppy but I do feel a little liberated by this film, as I mentioned even as a guy. Seeing these two women attain a degree of autonomy from a damaging sexuality being pressed upon them, and finding a sincere, playful, unexploitative love for one another was a great journey.  It's a film that is very sweet yet very serious, its scope is enormous but it addresses everything it wishes to very seriously, and I really think it's one of the best I've seen in a long time.\n\nAlso, just to mention there has been a thread on here regarding this topic before: https://www.reddit.com/r/TrueFilm/comments/5ajifh/the_handmaiden_and_parks_commentary_on_fetishism/\n\nHowever, since I have alluded to a few new things, and that original thread died a bit of a death it is worth bringing it up again here. \n\n**Edit**: Since I think it's a good point to make I'll add this to the OP. I don't particularly agree with a more negative reading of the ending but I would say it at least is ambiguous enough to force you to reach your own conclusions. At the very least if it is too late for Hideko and Sook-hee it might not be too late for us:\n\nOn the one hand we can see them playing with the balls as them taking ownership of the ridiculous exploitative fetishisation of sex they had been molded in, or, rather more darkly, we could read this as evidence that they have escaped physically but not mentally - their sexuality is still predefined due to its creation within these parameters, and for them there will never be such a thing as a 'good', non-exploitative sexual act in which they have true agency. Perhaps their experiences have ruined them, or at least defined them in a way that cannot be altered.",
        "created_utc": 1519240136,
        "upvote_ratio": ""
    },
    {
        "title": "What’s the best movie to watch with psychedelics?",
        "author": "CodeNameZed",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z7c37/whats_the_best_movie_to_watch_with_psychedelics/",
        "text": "[removed]",
        "created_utc": 1519234341,
        "upvote_ratio": ""
    },
    {
        "title": "It's Your Fun &amp; Fancy Free Discussion! (February 21, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z5rcj/its_your_fun_fancy_free_discussion_february_21/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nFun and Fancy Free threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; you can even discuss tv here! Lurkers, this and our Slack team are *the* places to introduce yourself.\n\n##Sign up for the TrueFilm Slack team [here](https://whispering-temple-35722.herokuapp.com/). Our team page is [here](https://truefilmreddit.slack.com/).\n\n###Follow us on:\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) ([fellow TrueFilm users](https://www.reddit.com/r/TrueFilm/comments/3th7st/anyone_here_use_letterboxd/))\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n- [Criticker](https://www.criticker.com/profile/rTrueFilm/)\n\n- [Facebook](https://facebook.com/TrueFilmReddit/)\n\n####The sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1519221974,
        "upvote_ratio": ""
    },
    {
        "title": "Red Race Car at Jack Rabbit Slim's in Pulp Fiction",
        "author": "buuckleyy",
        "url": "https://v.redd.it/c6s7j8tqmkh01",
        "text": "",
        "created_utc": 1519221862,
        "upvote_ratio": ""
    },
    {
        "title": "Red race car in Pulp Fiction",
        "author": "[deleted]",
        "url": "https://v.redd.it/8q35hxu2jkh01",
        "text": "[deleted]",
        "created_utc": 1519221072,
        "upvote_ratio": ""
    },
    {
        "title": "What are your thoughts on the ethics of re-recording an old film's sound effects track as was done with Vertigo in 1996?",
        "author": "RunDNA",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z5ma4/what_are_your_thoughts_on_the_ethics_of/",
        "text": "In 1996 Hitchcock's *Vertigo* was re-released to cinemas in a new restoration by Robert A. Harris and James C. Katz. \n\nTo create a new stereo surround mix of the audio (the original film was released in mono) they completely remade all the foley effects in the film  - the footsteps, gun shots, bird cries, fog horns, and other sounds added by Hitchcock in post-production.\n\nWhile they tried to adhere closely  to sound of the original audio - only adding a few occasional sound  effects not present in the original mix to cover up hisses and pops in the original soundtrack - the fact that the sounds you hear in the 1996 restoration are not the sounds from the original soundtrack proved to be controversial.\n\nWhat are your thoughts?",
        "created_utc": 1519220682,
        "upvote_ratio": ""
    },
    {
        "title": "My thoughts on 2001: A Space Odyssey",
        "author": "KenuR",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z5jii/my_thoughts_on_2001_a_space_odyssey/",
        "text": "I'm conflicted about this movie. Watched it for the first time yesterday and my first impression was that it's so incredibly slow for no good reason at all. The first half hour is basically autistic screeching, and the last half hour is one of those Windows XP screensavers with painfully uncomfortable music playing in the background.  \n\nThe part about Hal was the only thing that resembled a movie and was pretty interesting, but wasn't really explored that much. Looking at the props they put together from the current era perspective impressed me insofar that it probably was revolutionary for its time. I got to say though that it was kinda funny seeing all this \"modern tech\", but the actors still looked and talked like characters from the 50s. I did enjoy the various shots where they had to walk upside down and run around the inner edge of the spaceship, those were pretty good.  \n\nI only fully understood the plot after reading about it online. And having that in mind I feel that reading about the concept and the idea of the movie is more interesting than actually seeing the movie. The huge black monoliths influencing humankind's evolution and sending them on a journey through space and time! I imagine this in my head and it's edgy and deep, but when I watch the movie I feel like taking a nap or skipping ahead.  \n\nWould you say that 2001: A Space Odyssey is more of an experience than a movie? Because when I think about it that way I instantly connect it with modern art and paintings like the \"Black Square\" where the history behind it and the culture surrounding it are more important to appreciating its true meaning than actually observing it.  \n\nAnyway, just thought I'd share my thoughts.  \n\nAre there any other movies that are similar to this? What did you think of the movie?",
        "created_utc": 1519219930,
        "upvote_ratio": ""
    },
    {
        "title": "An in-depth look at a scene involving one of cinemas most unique and terrifying serial killers - \"Peeping Tom\" (1960)",
        "author": "[deleted]",
        "url": "https://film-logs.com/2018/02/21/a-shot-by-shot-breakdown-of-the-most-famous-scene-in-director-michael-powells-peeping-tom/",
        "text": "[deleted]",
        "created_utc": 1519208619,
        "upvote_ratio": ""
    },
    {
        "title": "An in-depth look at a truly horrific, intense scene; British director, Michael Powell, was ostracized following the film's release in 1960 (same year as Psycho). It's now considered a masterpiece, though his career was permanently ruined.",
        "author": "[deleted]",
        "url": "https://vimeo.com/256185466",
        "text": "[deleted]",
        "created_utc": 1519207264,
        "upvote_ratio": ""
    },
    {
        "title": "rock latest release......trailer 2018",
        "author": "catchdasun",
        "url": "https://www.youtube.com/attribution_link?a=qb4uTixnlrI&amp;u=%2Fwatch%3Fv%3DJ-nSsf3NMH0%26feature%3Dshare",
        "text": "",
        "created_utc": 1519199070,
        "upvote_ratio": ""
    },
    {
        "title": "Black Panther Is Currently The Best Movie of All Time According to Rotten Tomatoes",
        "author": "Xerciss",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z3a3k/black_panther_is_currently_the_best_movie_of_all/",
        "text": "I thought Black Panther was painfully average, even for a Marvel film, with inexcusably bad CGI. It had some redeeming qualities, but for a site that is so highly referenced by the general public, claiming its better than Citizen Kane or Casablanca or even Get Out and The Wizard of Oz is an insane stretch.\n\nPersonally, I think the movie is weak even for a generic super hero film. The protagonist is uninteresting, give a mediocre performance, and the plot doesn't deviate enough from the MCU formula to have any real impact.\n\nMicheal B. Jordan was great, solving Marvel's villain problem, but he won't exactly go down as one of the best villains of all time or anything. Every aspect of the movie was either appallingly average or below average.\n\nI think the most damning thing is the movie's god awful CGI despite its 200 million dollar budget. I don't know where all the money went when the movie looks like a game on the Playstation 2. You can usually expect a Marvel movie to at least be a spectacle, but this movie even fails on that level.\n\n Coogler had made great movies in the past, I adore Fruitvale Station and loved Creed, but this movie is subpar at best is getting very over-hyped.\n\nMy point is, this movie doesn't deserve the \"Best Film of All Time Spot\" even if the title is meaningless to actual film lovers.",
        "created_utc": 1519192058,
        "upvote_ratio": ""
    },
    {
        "title": "Black Panther Is Currently The Best Movie of All Time According to Rotten Tomatoes",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z3827/black_panther_is_currently_the_best_movie_of_all/",
        "text": "[removed]",
        "created_utc": 1519191461,
        "upvote_ratio": ""
    },
    {
        "title": "One-Star Votes on IMDB and the MCU",
        "author": "PapaJacky",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z1yyh/onestar_votes_on_imdb_and_the_mcu/",
        "text": "I know there have been some vote trolling going on about Black Panther on IMDB and I was curious about it and did some fact-checking. Spoiler alert, it's true. If you don't know, you can check the distribution of user votes on IMDB, so I went ahead and checked the entirety of the MCU, and this was what I got: \n\n**Phase 3**\n---\n\n---\n* \"Black Panther\" - 6708 One-Star votes, 6.7% of Total\n* \"Thor 3\" - 3431 One-Star votes, 1.4% of Total\n* \"Spiderman\" - 4514 One-Star votes, 1.6% of Total\n* \"GOTG 2\" - 2866 One-Star votes, 0.8% of Total\n* \"Dr Strange\" - 3048 One-Star votes, 0.8% of Total\n* \"Civil War\" - 8246 One-Star votes, 1.7% of Total\n\n---\n**Phase 2**\n---\n* \"Ant-Man\" - 3480 One-Star votes, 0.8% of Total\n* \"Ultron\" - 8561 One-Star votes, 1.5% of Total\n* \"GOTG\" - 7969 One-Star votes, 1.0% of Total\n* \"Winter Soldier\" - 5508 One-Star votes, 1.0% of Total\n* \"Thor 2\" - 4934 One-Star votes, 1.0% of Total\n* \"Iron Man 3\" - 8938 One-Star votes, 1.4% of Total \n\n---\n**Phase 1**\n---\n* \"Avengers\" - 16008 One-Star votes, 1.5% of Total\n* \"First Avenger\" - 7885 One-Star votes, 1.4% of Total\n* \"Thor 1\" - 6258 One-Star votes, 1.0% of Total\n* \"Iron Man 2\" - 5623 One-Star votes, 1.0% of Total\n* \"Hulk\" - 3583 One-Star Votes, 1.0% of Total\n* \"Iron Man 1\" - 6188 One-Star Votes, 0.8% of Total\n\n---\n\nFor comparison, here is the DCEU: \n\n* \"Justice League\" - 5437 One-Star votes, 2.8% of Total\n* \"Wonder Woman\" - 7686 One-Star votes, 2.0% of Total \n* \"Suicide Squad\" - 17710 One-Star Votes, 3.8% of Total\n* \"BvS\" - 19509 One-Star Votes, 3.7% of Total\n* \"Man of Steel\" - 11442 One-Star Votes, 1.9% of Total\n\n---\nAnd just for some objectivity, I \"randomly\" picked five movies from my watched list, skipping over movies that were controversial in terms of audience reactions.\n\n* \"Oldboy\" - 6489 One-Star votes, 1.6% of Total\n* \"Lars and the Real Girl\" - 1182 One-Star votes, 0.9% of Total\n* \"The Grey\" - 3829 One-Star votes, 1.8% of Total \n* \"Brazil\" - 2680 One-Star votes, 1.6% of Total \n* \"Detachment\" - 411 One Star Votes, 0.6% of Total\n\n---\n\nSo based off of those figures, we can figure out that the median percentage of one-star votes for a MCU film is 1.0%, with the average being 1.47% (1.16% if you remove Black Panther's entry). The five random movies I picked also share a similar median and mean (1.6% and 1.3% respectively). The DCEU is generally considered worse than the MCU and so their average share of one-star votes is higher on all counts (roughly 2.8% mean and median). \n\nSo to sum it up, Black Panther is getting hit harder, proportionally speaking, by one-star ratings on IMDB than any other films I compared it with, including the entirety of the MCU. Some caveats to this post is that, lets be honest, fanboys do sway and overreact to these movies, like any fans would, and so naturally there are high proportions of ten-star votes on every superhero film I looked at. These are also from IMDB so the numbers will continue to change as more and more people continue to vote. \n\nA lot of \"controversial\" media get hit by either one-star or ten-star votes before they even are released, so I waited a few days before doing this. That said, Black Panther only has about 100,000 total votes right now, which is significant but not its peak by any means, so its numbers will shift the most significantly as time goes on. Regardless, its discrepancy along with other films is pretty telling in how unreliable IMDB (or any online voting system subject to coordinated hysteria) is nowadays.",
        "created_utc": 1519179996,
        "upvote_ratio": ""
    },
    {
        "title": "Brazilian Feature Vazante Is A Sublime Masterpiece",
        "author": "[deleted]",
        "url": "https://71republic.com/2018/02/20/vazante-sublime-masterpiece/",
        "text": "[deleted]",
        "created_utc": 1519179773,
        "upvote_ratio": ""
    },
    {
        "title": "The voting habits on blockbuster films on this sub [meta]",
        "author": "CQME",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z1w3y/the_voting_habits_on_blockbuster_films_on_this/",
        "text": "I've noticed a clear trend on this sub to downvote en masse any discussion on a film with mass appeal that is not critically acclaimed or seen as a thoughtpiece.  I think this kind of bandwagonning is not healthy for this sub, which encourages in depth discussion on film...not esoteric films that are low-budget aimed at smaller audiences, but film, as in anything that would show in a cinema.  \n\nThere are many films without critical acclaim that are not designed as a philosophical treatise or derivatives of historical works of fiction that can deserve a healthy, thought-provoking discussion.  For example, a discussion of the connections between the film Wonder Woman and the #Metoo movement could be very interesting, even if Wonder Woman itself is not  some tome reciting Kant or Foucault.  \n\nRecently the Black Panther film from a critical perspective has been seen less as a film and, much like Get Out, more as a political lightning rod for race relations in America.  I think discussion of this element could be very constructive and would be perfect for a sub like this, but nearly every post about that movie on this sub has a zero rating - in fact the only post with a positive score vehemently trashes the movie, all the while criticizing 'disingenuous outrage', which seems doubly ironic.  I think this kind of behavior runs opposite to the aims of this sub, and that excluding big-budget blockbuster films from in-depth discussion does a sub like this a huge disservice.  It's nice to express your opinion sure, but I would think discussion and analysis would be far more important and should be the prominent focus, rather than just 'I liked this movie' or 'I hated this movie' just because it is aimed at general audiences.\n",
        "created_utc": 1519179281,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Paul Thomas Anderson's “Phantom Thread” (contains spoilers)",
        "author": "last_sky",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z1vki/thoughts_on_paul_thomas_andersons_phantom_thread/",
        "text": "The first time I saw the movie, I was struck by how stylistically straightforward it is. It is as though PTA had reached a level of confidence in which he didn't need to showcase any visual flair or elaborate set-pieces anymore. I thought that the story is simple, but I was a little wary of the twist at the end. I found myself thinking more and more about the movie, and upon subsequent viewings I realized how layered it was.\n\nReynolds Woodcock is a successful fashion designer in 1950s London. Handsome and spiffy, he is the head of a renowned fashion house that caters to high-profile clients. His sister, Cyril, is a very stern woman who manages it for him.\n\nUp to this point, if we had to guess what type of woman Reynolds would be attracted to, Alma would not be it. She is neither statuesque nor eloquent. In fact, when he meets Alma for the first time, it is her clumsiness that makes her so attractive to him.\n\nThe primary driving force behind most of Alma's actions is her intuition and aversion to monotony. She is a creature of spontaneity, not calculation. After the first time they go out to dinner, she tells him that she thinks he is \"only acting strong\" but he denies it. Little do we know that she is actually right. He is not strong--he is weak and afraid of intimacy, but he doesn't like to show it outwardly. His pretense, which is an effective defense mechanism that has served him well thus far, is built around his reputation for being a perfectionist, as well as having strict rules and rituals that he adheres to in his daily life. To an artist powered by routine, Alma arrives as a disruptive force who does not take well to orders. She challenges his rules, and even mocks them at one point, calling them a game. That is the reason Cyril takes a liking to Alma--she recognizes that Alma sees through her brother's facade. In fact, it is Cyril who is the strong one in the family. Alma correctly supposes that Reynolds needs to shake things up a bit, and that he needs to be told what to do sometimes. We see glimpses of this in his relationship with Cyril, like when she tells him to go out to the country when he tells her he is feeling unsettled, or when she basically orders him to design the dress for the client he dislikes.\n\nWhen Alma poisons him the first time, she is effectively giving him the excuse to give in to his weakness, but he resists it. He refuses to be treated and proceeds to insult the doctor. This is less about him, and more about his need to protect his image of strength.\n\nWhen she poisons him the second time, it is different because he now knows that Alma is in on his secret. That is why he asks Alma to \"telephone the boy doctor, just in case.\" He can finally admit his frailty to the one person who could see through his game. She has him pegged, and he is no longer afraid of being judged by her because she wants to love him and take care of him because he is weak, not in spite of it.",
        "created_utc": 1519179162,
        "upvote_ratio": ""
    },
    {
        "title": "Max von Sydow on working with Ingmar Bergman | BFI podcast",
        "author": "Jewish_jesus",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z1m8l/max_von_sydow_on_working_with_ingmar_bergman_bfi/",
        "text": "*Archive audio from 1988 of actor Max von Sydow talking to film historian Peter Cowie about his work with Ingmar Bergman. Narration written and presented by Taryn Joffe.*\n\nIn which, Max von Sydow discusses his work on The Seventh Seal. Including a role change from one of the actors to the role that would introduce him to the world. In addition to a discussion on his work in The Magician, Sydow talks about Bergman's infamous conflicts with religion. While the Narration discusses The Seventh Seal's impact on art house cinema, and Bergman's impact on cinema as a whole.\n\n\n\n\n\nyou can listen to the audio [here](https://www.youtube.com/watch?v=NYMHwEBFYVs)",
        "created_utc": 1519176976,
        "upvote_ratio": ""
    },
    {
        "title": "Max von Sydow on working with Ingmar Bergman | BFI podcast",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=NYMHwEBFYVs",
        "text": "[deleted]",
        "created_utc": 1519175638,
        "upvote_ratio": ""
    },
    {
        "title": "[spoilers] Black Panther and the Message for American Youth",
        "author": "CQME",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7z0nd5/spoilers_black_panther_and_the_message_for/",
        "text": "Just saw this movie.  Social commentary aside for a moment, I thought the movie was an excellent popcorn film, easily one of the better MCU movies they've made.  The setting was interesting, the characters were fairly fleshed out, even if in many cases they were simply caricatures (this is after all a comic book movie aimed at children).  There are obvious Lion King references here, someone falling into the depths to their death, speaking to your dead elders, the One True King line, etc.  Easily a 7.5/10 movie if not higher.  I had high expectations for this movie due to all the hype and I'm happy to say they were met.\n\nMy impetus for starting this discussion was not to look at the cinematography of the movie, but rather the message behind it, if any.  For example, in Iron Man Tony Stark undergoes a humbling effect that gets him to 'focus on what matters' and to act more responsibly.  In Captain America we get the 'tried and true' message of self-sacrifice being the real quality of 'what makes a man'.  What about Black Panther?  What message is it trying to send?\n\nWe have an American youth to focus on, the Michael Jordan character and what he went through.  &lt;I'm saying \"American youth\" instead of \"Black American Youth\" because I'm not black nor do I want to suppose I fully understand such a background.  This movie is mainstream and aimed not just at black audiences, so I think I'm on safe ground here.&gt;  Anyway, what did this youth go through?  He has pride in his heritage, and is more than willing to use the 'tools of his enemies' to get what he wants, which is a better life for those like him.  The Chadwick Boseman character on the other hand has almost no roots whatsoever in American culture and is most certainly not American himself.  The Boseman character wins, and the American youth, now fully grown, decides to let himself die, that for him to die like those on slave boats who jumped off ships - essentially accepting death over bondage - were the real heroes.  \n\nThis is about as close to a 'message' I was able to get out of the film for American audiences...the Boseman character and his background were simply too, well, unAmerican, to relate to as an American.  Is there more to it than just this?  Are we supposed to get out of this that whatever is going through the minds of American youths is poison and that what they're really supposed to get out of this is the 'kingly' view of the Black Panther, to share and share alike?  Is that a positive message, if that is indeed the message? \n\n",
        "created_utc": 1519169103,
        "upvote_ratio": ""
    },
    {
        "title": "Can film be subversive?",
        "author": "logopolys_",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yyvrt/can_film_be_subversive/",
        "text": "I was reading [a blog](http://www.eruditorumpress.com/blog/this-post-has-no-title/) about Marxism and media (I know, I know...) and stumbled upon this little quote:\n\n&gt; Movies are not, and cannot be, subversive.  Not even when they are.  A subversive movie is not subversive, because it is a movie.  In the subversion/Hollywood dichotomy, the Hollywood is always the dominant gene.  Indeed, it is a terminator gene.  It is engineered to be so.  It is a mistaken precept of many leftist accounts of structural ideological production that they forget that, which the ideology may not be consciously produced, the products carrying the ideology definitely are.  The ideology is produced consciously even when it is produced unconsciously, because the vehicle in which it rides is consciously produced.  One may not consciously be aiming to create a circular puddle, but if one creates a circular hole in the ground just before it rains… well, you know what will result, even if you take pains not to think about it.  It is one of the great defects of leftist thought that it has permitted its general (and generally justifiable) distaste for Freud to guts its ability and willingness to investigate the borderlands between the conscious and the unconscious.  As a result, leftist accounts of ideological production have tended to err on the side of conspiracism and vulgarity or of over-nuance and over-subtlety.\n\nI was struck by this concept.  There's a followup later in the essay:\n\n&gt; Capitalism’s desire to control the banquet, to control the guests via their seats at the table, is probably at the root of the recent trend in capitalist media culture towards greater diversity and inclusivity.  However, we have to guard against the tendency to downplay this as an achievement, just as much as the tendency to overstate it.  To put it all down to capitalism’s desire to ideologically manage is to give capitalism too much credit, and to give the gadflies too little.  Remember Doublethink.  It’s our way out of that cul-de-sac where we are either elitist conspiracists who secretly admire capitalism for its all-conquering guile, its mastery of three-dimensional chess, or excuse it by attenuating its guile into non-existence in the name of nuance.  Remember, to make texts under capitalism is - structurally, whatever their content - to make capitalist texts.  To create diverse and inclusive messages, implications, etc, in such texts is - by definition, structurally - to put inclusivity and diversity and progress at the service of capitalism.  This is no conspiracy, but arises from the political economy of cultural production, all the way down to the basic observation that the system of private property and wage labour determines that creative people will have to work for capitalists in order to be creative. \n\nI studied some Marxism in literary theory in grad school, where we dealt with a similar concept with Louis Althusser and ideology: basically, even the denial of ideology is itself a form of ideology.  Despite seeing this in the context of literature, I've never applied it to consumable art like film before.\n\nIs all art distributed by those with a financial interest compromised?  Or, to put it in the language of this blog, is a subversive movie impossible?",
        "created_utc": 1519156291,
        "upvote_ratio": ""
    },
    {
        "title": "Observe and Report - A vicious satire for the Trump Era",
        "author": "minteastwood",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yyhep/observe_and_report_a_vicious_satire_for_the_trump/",
        "text": "Observe and Report (2009)\nR | 1h 26min | Comedy, Crime, Drama\n\nDirector: Jody Hill\nWriter: Jody Hill\nStars: Seth Rogen, Anna Faris, Ray Liotta \n\n\"Bi-polar mall security guard Ronnie Barnhardt is called into action to stop a flasher from turning shopper's paradise into his personal peep show.\"\n\n-------\n\nOk I had no interest in the Seth Rogan comedy \"Observe and Report\" initially. It looked like an edgy Paul Blart. However after hearing it brought up in a discussion of under-appreciated films, I decided to give it a shot.\n\nIt was INCREDIBLE. I actually feel insane because it seems like everybody disliked this movie when it came out, and even the friends I watched it with didn't enjoy it. The tone of the film is very strange, and I found it very powerful.\n\nI am hoping to make a video essay dissecting the film, but for now I'll just leave a few things that really stood out to me.\n\nThe film completely subverts the traditional 2000's slob comedy. All of the beats are there but each one is presented in a way where the characters sickening psychology is revealed. Comedys at this time were fine with having blatant homophobia, racism, and sexism presented as goofy fun. In this film those same moments occur but they are stripped of any charm. Ronny is too dissociated to be subtle, so the audience is forced to recognize the destructiveness of his actions, instead of being swept up in his character.\n \nI think the film is intensely angry. Every scene seems to be an takedown of a certain kind of person, or institution. The mall is a mini capitalist system with matching systems of power. The same flaws shown in the mall also exist on a much broader scale in the real world. The abuse of power on every level, the polite acceptance of oppression, the exploitation of the lowest class for the highest, the forced conflict, and the general dissatisfaction of everyone involved. \n\nWhat the film seems most angry at are people who abuse their power in society. This is mainly directed at people of authority (police/security, government/mall management, and corporate/store managers) but is also directed towards the casual abuse and bigotry of every day social interactions. It's shown how Ronnys bias causes him to be extremely aggressive to minorities in his personal life, and how this attitude becomes institutionalized through his authority. If a minority is subservient to him he can accept them (think his two asian officers) but they always remain untrustworthy, and ultimately expendable (he suspects the asian officers of committing crimes, and tells them they are expendable because there are two of them) He also abuses women either by coercing them, stalking them, or raping them, all while convincing himself he is the good guy. Both of these instincts collide when he sees a woman with a POC man (Anna Faris and the mexicans, Aziz Anzari flirting with his customers). Ultimately all of Ronnys interactions are framed by these social bias. Even the coffee girl he flirts with becomes unnattractive to him once she reveals that she is not a virgin (which touches the Madonna/Whore complex caused by his mentally unstable and sexually confused mother). All of these complexes prevent him from ever forming a truly healthy relationship. \n\nWhat's interesting is that the film makes it clear these attitudes are not class-based. While Ray Liotas character is initially presented as being the noble officer of the law, as soon as he gets angry the veil is lifted and he starts screaming, calling ronny a \"faggot\" and a \"retard\". The bias Ronny has is not due to any mental problems, It is ingrained in the culture from the bottom to the top.\n\nI really feel like this film captured and properly skewered a toxic personality type that is still very common, while also making it clear how our society allows this kind of person to exist and gain power. It brutally takes down not just outright authoritarians, but also the subtle abuses of power we endure in our day to day life.\n\nThis is why I think the film is really suited for today. Now that we are living in the Trump Era, the political motivations of the film become much more obvious. Ronny feels like so many guys I used to see on 4chan years ago. The amount of delusion he can sink into to convince himself he is still the \"nice guy\" is TERRIFYING and so instantly recognizable. Scenes like him implying he will kidnap Anna Farris if she doesn't say yes to a date, claiming he isn't racist after calling Aziz \"Osama\", and \"joking\" that a gay employee wants to be sexually assaulted show just how much abuse a person can dole out while being convinced they are good. This is something that terrifies me in my day-to-day life and I loved seeing the implications of this kind of attitude play out on screen.\n\nI could go on and on (which I probably will someday soon) but for now I would just love to hear what other people have to say. Did this film do anything for you, or was it simply too uncomfortable to be enjoyed.",
        "created_utc": 1519153562,
        "upvote_ratio": ""
    },
    {
        "title": "Black Panther is worth the watch",
        "author": "Carlislegendary",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yx7c6/black_panther_is_worth_the_watch/",
        "text": "Black Panther 2018 Non Spoiler Review \n\n \n\nBlack Panther might be the greatest celebration of African and overall black culture to ever grace a cinema screen. Unapologetically black and not afraid to step on toes, Black Panther awakens your imagination, and tests everything you know about colonialism. The film might be based in the Marvel cinematic universe, but you quickly realize Black Panther is on a different plane from previous installments in this series.\n\n \n\nBeing a black man, comic book geek, and cinephile allowed me to appreciate Black Panther on multiple levels. I had my doubts about this film, but director Ryan Coogler made sure to address each and every one of those doubts. I have so much to say about this film that I decided to break up my thoughts to make this review easier to read.\n\n \n\nThe World of Wakanda\n\n\n \n\nWakanda is without question the most fleshed out fictional setting to ever grace a comic book film. Wakanda isn’t just a backdrop for the characters but a magical place based on the beauty of Africa, and technological advances human minds have yet to create. The best way to describe Wakanda to people who have yet to see this film is to tell them to picture the beginning of The Lion King but with real live people. To the harsh but gorgeous Jabari Mountains, the mighty rivers, or to the very majestic plains, Wakanda is the dream every person wishes they could experience. I wanted to see more, but luckily I don’t have to wait long before Wakanda is featured again in a Marvel film.\n\n \n\nThe Characters of Wakanda\n\n\n \n\nI have to give praise to the cast of Black Panther; everyone did a fantastic job to the point I would feel conflicted if I failed to mention more than just Chadwick Boseman and Michael B. Jordan. Yet, if I wrote about everyone this would be the longest review ever. Furthermore,  feminism and black beauty take center stage with a cast of powerful black women. There are no damsels in distress here, and often times it is the women doing the saving and fighting. This reminded of when Simba needs an army to face off against Scar and the hyenas, it is Nala and the lionesses who play that savior role. Every character serves a role and provides insight, instead of just moving the plot along.\n\n \n\n\nThe Sound and Costume Design of Black Panther\n\n\n \n\nI am so glad we have moved past the African flute music cues featured in Captain America: Civil War that set black people back 300 years. Black Panther features an original score, accompanied by songs from the Black Panther album produced by Kendrick Lamar. The music is amazing and is used in a way that only enhances the experience of the film. Erik Killmonger’s theme and the African music used for key moments are the standouts. Another great thing about the film is the high level of costume design that embraces African culture, while still being modern. I will be shocked if this film is not nominated for costume &amp; design.\n\n \n\nThe Flaws\n\n\n \n\nDespite how awed I was, the film does feature flaws. The CGI throughout the film progressively worsens till the end. You often wonder if the CGI was stepped down to Marvel producing so many films throughout the year, or that they didn’t have faith in this film. The last few fights are a let down, and honestly the best of the action comes before the climax.\n\n \n\nThe Dilemma of the Greatest Nation\n\n\n \n\nWakanda is the most advanced nation in the world; they can create what most would consider the impossible. To maintain its way of life, it was shielded from the world, but with that comes moral problems. I love how Coogler addresses the problems that black people outside of Wakanda face, and how by Wakanda sealing themselves from the world they contribute to the injustices their black sisters and brothers face.\n\n \n\nThe King Of Wakanda vs The Usurper\n\n\n \n\nThe main plot of the film, and what makes the film so great, is T’challa King of Wakanda played by Boseman and Erik Killmonger the extremist played by Jordan. These two characters have so much character development and nuance that whenever they talk, you listen. Their viewpoints and ideologies remind me of the Great Martin Luther King Jr. and Malcolm X. Jordan’s character is the villain, but you can’t help but relate to him; often times if he wasn’t so brutal you would root for him as the hero. I can’t think of a greater comic book  performance than that of Heath Ledger. Jordan’s natural charisma chews up any scene he is in, but Boseman reminds you why he is the star. Boseman might get flack for his accent, but that is easy to get over because his character portrayal is so great. The most powerful scenes have to be when T’challa broke his calm demeanor and let his feelings really show. We've seen this before, in Winter Soldier, where he really unleashed his emotion. It's good to see the consistency of it follow through in Black Panther.The contrast between the calm and calculated king vs the radical and energetic newcomer is unmatched.\n\n \n\nThe Lasting Effect\n\n\n \n\nAs mentioned earlier, this is a film that would make any black person proud. No more slaves, drug dealers, or white saviors. Black Panther gives young and old people something to believe in and help inspire a change. Black Panther is the eighteenth film in the Marvel cinematic universe, but it is the first with a lasting message, and the first with layers of social commentary. I feel sorry for people who refuse to watch this film due to their viewpoint of superhero films or racism. Black Panther is not only a cultural phenomenon but also the first great film of 2018.\n\n \nthe review with the pics and colors are on Film-era.com\n ",
        "created_utc": 1519144263,
        "upvote_ratio": ""
    },
    {
        "title": "i don’t think i’ve ever been as moved by a film as i have for mr nobody.",
        "author": "bluecargoshorts",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ywpgu/i_dont_think_ive_ever_been_as_moved_by_a_film_as/",
        "text": "[removed]",
        "created_utc": 1519140534,
        "upvote_ratio": ""
    },
    {
        "title": "Is dialogue Form or Style?",
        "author": "the_grandmaster901",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yv8jo/is_dialogue_form_or_style/",
        "text": "I came across a situation where I have to divide between Form and Style. I think overall it is pretty clear, but in some situations when you go for specifics it is often hard to categorize whether something falls under Form or Style.\n\nIt popped to mind whether dialogue is Form or Style and I have a friendly discussion about it with a colleague.\n\nMy colleague thinks that dialogue is Style because it is so close to choosing what words are used to bring narrative information to a user and create stylistic patterns that -- while dialogue is way more important -- it is like choosing what color you use in a frame to communicate something visually.\n\nI think that dialogue is Form because it seems to suit Bordwell's definition of \"the overall set of relationships among a film's parts\"; creating patterns through dialogue and the decision to distribute narrative information at certain points in our narrative.\n\nIs there an easy answer to this? What do you guys think?",
        "created_utc": 1519126495,
        "upvote_ratio": ""
    },
    {
        "title": "After watching Wild Strawberries, Persona, and The Seventh Seal, I am amazed at Bergman's ability to communicate deeply philosophical concepts through brief character interactions. Do any of you have favorite examples of this, too?",
        "author": "dustinius0728",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ytxdf/after_watching_wild_strawberries_persona_and_the/",
        "text": "The example I would like to share is when Antonius Block is speaking to the lady who others believe is in cahoots with Satan.  She is in a cage, and Antonius walks up to her:\n\n\"They say you've been in league with the devil.\"\n\n\"Why do you ask?\"\n\n\"For very personal reasons... I, too, want to meet him.\"\n\n\"Why?\"\n\n\"I must ask him about God.\"\n\nInterpretations are subjective, but, to me, this brief exchange could sum up one of the film's most prominent themes.  Antonius seems to believe more in the existence of Satan than God at this point, as Satan's will is evident.  The plague has brought immense suffering, and most lives lack purpose.  Meanwhile, God is silent.  Does God exist, or does the existence of such suffering count as an argument against a benevolent deity?  How can God possibly justify his silence?  Is Satan simply winning a battle in a long and nasty war?  Are these the questions on Antonius's mind?\n\nBergman does this repeatedly in his films.  Succinct dialogue within a powerful context.  Here, he articulates a foundation for doubt, and, in the background audio, we hear others hammering away to build the stake to burn who they perceive is aligned with Satan.  Such contrast!\n\nIf any of you have thoughts on Bergman's dialogue or ability to communicate philosophical concepts, I'd love to hear! ",
        "created_utc": 1519109043,
        "upvote_ratio": ""
    },
    {
        "title": "Is Suburbicon really that bad?",
        "author": "trarevol",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yts9o/is_suburbicon_really_that_bad/",
        "text": "I recently watched a film I wanted to see but didn't get a chance to see... Suburbicon. Rented it on Redbox, watched it all the way through, liked it and then was surprised to see the critical reception be so negative.\n\nSo I ask this question, is Suburbicon really that bad?\n\n**Filmwork**\n\nThe best part of the film has to be the filmwork. The film makes great usage of wide shots and closeups to contrast the environment of Suburbicon with the slowly deteriorating situation that the characters go through. The world of Suburbicon is sparse, mechanical and similar which matches with the pace of the film; bright sunny environments often play parts to super dramatic scenes that are tense as well as nerve racking thanks to the close up shots which show every detail of the actors expressions.\n\nThe hectic scenes at the end represent the peaking point of the downfall, the pivotal moment where everybody you've grown used to dies a horrible death and literally fire and destruction is everywhere. It's a rewarding buildup considering a lot of the scenes before it were bright and used saturated colors to get its point across and the reward is dark brooding lighting combined with minimal saturation.\n\n**Plot**\n\nI liked the plot, it feels like it's trying to be too much but there's a sense of cohesiveness that binds it all together. It's all a downfall that never gets any better until the very end, a simple insurance scam that gets more and more complex and convoluted till it gets to a point where nobody is able to resolve the situation in any possible form. This is a film with no happy endings.\n\nThe film's characters are initially given likable personality traits that are stripped away one by one until nothing is left. The films focus on lost innocence is unintentional but something that makes the film stand out; by having a kid in the film experience everything in the film, not only does it enhance the darkness of the film, it also gives it a slight psychological edge nobody would expect.\n\nIncluding racial elements in a film is also something that Hollywood needs to do more of. More films need to show what racism was like in the 50s so people can understand.\n\n**Characters**\n\nThe fun thing about this movie is the characters. These are simplistic characters that grow more complex as the film goes on. They start off as 50s caricatures but as the film goes on, they become so flawed and human that you'll be unable to see them as anything else but that. The characters act out the script without a hitch, meaning they manage to give the movie feeling but it's not up to par with a Quentin Tarantino movie; much of the stuff involving deceit and complicity could of been given more polish.\n\nBut still, the actors give their best and because George Clooney is behind the director's chair, it gives the actors a bit more incentive to work their butts off. You can really feel the bumps throughout as they use the sternest voices and the most fearful looks in order to provide a two-edged sword of vulnerability and strength. The actor playing the kid in the family is good, he shows fear well which in a script like this is essential but his character could of been given more to do.\n\n**Conclusion**\n\nI feel like the film did not deserve the praise it had gotten since most critics now give praise to generic Hollywood blockbusters like Star Wars, Jumanji and Marvel movies. Most critics might see it as a mess due to their wants and desires from the film but I feel like the critics (and maybe even the studio) didn't give it a fair chance... There's a lot to like about this movie and if it had been promoted better or given less expectations to succeed then maybe, maybe it might of had a chance at the box office.\n\nIf you want my recommendation, I'd go out and see it.",
        "created_utc": 1519107367,
        "upvote_ratio": ""
    },
    {
        "title": "What are this sub's favorite YouTube channels surrounded around films?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ytlmb/what_are_this_subs_favorite_youtube_channels/",
        "text": "[removed]",
        "created_utc": 1519105255,
        "upvote_ratio": ""
    },
    {
        "title": "Mindscape (1976) and the Power of Short Films",
        "author": "Nabataean_AD106",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ys9ok/mindscape_1976_and_the_power_of_short_films/",
        "text": "This evening I saw a film called [Mindscape](https://vimeo.com/29434166) which stunned me. The Animation and images displayed in the short astonished me. It's like the portrayal of an artist living in a fantasy world unlike no other. That made me think about something I've thought about for a long time; short films succeed when they pack the same amount of impact as a feature film in the shortest amount of time. Mindscape does just that.\n\nBut other short films are like this that I would like to mention, out of love for them. [Meshes of the Afternoon](https://vimeo.com/88602538) is another great example. A surrealist masterpiece about a woman who falls asleep, and is invaded by nightmares that may or may not be happening in real life. It might not be for everyone, but it is my 2nd favorite film of all-time, and Maya Deren's work has really influenced my outlook on film.\n\n[La Jetee](https://www.youtube.com/watch?v=aLfXCkFQtXw) is another great example. The film that inspired 12 Monkeys, at the dawn of World War III, a POW is sent back into the past before the war to save civilization from impending doom. Shot consisting only of still images (well besides the one infamous shot), this film has one of my favorite endings of any film. I urge you to check this film out.\n\nAn obscure but good film is [Tale of Tales](https://www.youtube.com/watch?v=R5C7MiZ7If0). Directed by Yuri Norstein, a Russia's stop-motion animator, this film reflects upon the memories of man, similar to Tarkovsky's The Mirror (1975). Might not be for everyone, but this is an experience. Can't wait til he finishes the Overcoat.\n\nAnd Finally, let me World of Tomorrow (which is on Netflix in the US). Don Hertzfeldt is an existential master. He knows how to add the same impact of feature films into shorts. World of Tomorrow is my favorite film from him, and if you have watched it by now I highly recommend. \n\nAnyway, if you've seen any of the films that I mentioned, tell me what you think of them; if not, I would love hear films that I didn't mentioned discussed. The art of the Short Film is so underappreciated, let's spend a minute to talk about it.",
        "created_utc": 1519091885,
        "upvote_ratio": ""
    },
    {
        "title": "You Know It's Stanley Kubrick IF...",
        "author": "RobotNixon83",
        "url": "https://www.youtube.com/watch?v=lEV2OGm4vFA",
        "text": "",
        "created_utc": 1519084239,
        "upvote_ratio": ""
    },
    {
        "title": "Your favourite Robin Williams movie?",
        "author": "Mortalily",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yr9gl/your_favourite_robin_williams_movie/",
        "text": "I've always found those so touching, yet so deep, unexpected and somehow, realistic. Robin is still is my favourite actor of all time and his death hits me to this day when I rewatch his movies. They don't have villains, they just have people with different views then ours. They don't have emotion, they have heart. They are so special, it almost can be its own genre. Except for the bad comedies, of course. So, which one is your favourite? Mine has to be either Good Will Hunting or Awakenings. Will Hunting never gets me bored, with doing a great job of mixing so many characters and subplots together. And Awakenings is such a simple, but beautiful story, which serves as both a worthy real life story adaptation and a great metaphor for life. Which one is yours?",
        "created_utc": 1519083045,
        "upvote_ratio": ""
    },
    {
        "title": "Chaos According to the Coen Brothers: A Tale of Noir, Wittgenstein and Serendipity",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yq83g/chaos_according_to_the_coen_brothers_a_tale_of/",
        "text": "[deleted]",
        "created_utc": 1519074841,
        "upvote_ratio": ""
    },
    {
        "title": "I Love Terry Gilliam's use of Irony in Brazil (1985)",
        "author": "Stwmode",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ypzi5/i_love_terry_gilliams_use_of_irony_in_brazil_1985/",
        "text": "But I have a little trouble breaking down his line of thinking in the film. What is Gilliam saying exactly about an individual's power of imagination vs the monstrous bureaucratic power of the state? Is Gilliam trying to say that one's reality is easily malleable? I got a very hopeless feeling from the film but I've yet to rewatch it. I'm a generally optimistic person so maybe I'm just personally rejecting that ending.\n\nA scene like this (https://www.youtube.com/watch?v=dht_3NziwSw) is just so bonkers and funny to me that I felt compelled to make a post about my new film obsession. It also seems to me that de Niro's acting and writing is a stroke of comedic genius.",
        "created_utc": 1519073179,
        "upvote_ratio": ""
    },
    {
        "title": "Phantom Menace and Afro-Futurism?",
        "author": "pgibso",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yppze/phantom_menace_and_afrofuturism/",
        "text": "While watching Black Panther this weekend, several visuals and themes started jumping out at me in familiar ways that I couldn't immediately pinpoint. Three quarters of the way through it I realized what it was: The Phantom Menace.\n\nAncient Shields upgraded to become plasma barriers, closed border tribal loyalties, and numerous other themes seem to be shared in the Phantom Menace.\n\nI remember hearing that the Droid troops were based on ancient african sculptures amongst other concept art.\n\nWhat does this mean for this film, does it feel like this is a legimate use of the style/genre? Coming from a white director does this feel like appropriation? I know George has gotten flack for race representation.\n\nPlease discuss.\n\n",
        "created_utc": 1519071270,
        "upvote_ratio": ""
    },
    {
        "title": "Crimson Peak: A warning from out of time - A short essay on the film and its characters.",
        "author": "skateordie002",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yop0y/crimson_peak_a_warning_from_out_of_time_a_short/",
        "text": "What is Crimson Peak about? At its core, I believe, it is a coming of age tale, another piece of the tapestry of innocence lost in the world of Guillermo Del Toro. A coming of age not only for the character of Edith bit also Thomas. \n\nThomas and Edith are kept infantilized by their respective overseers (Lucille and Carter) and, in each other, find independence, maturity, and freedom. The freedom that Lucille, in her desire to control, can never attain. A freedom that she, the collector of death, cannot even understand, much less experience. She cannot fathom the concept of this beauty she seeks to possess, to keep all to herself, frozen in time, insects in amber. She, of course, cannot accept that life must move forward, nor remain in stagnation. This is something that occurs throughout Del Toro's filmography. The drive to destroy that which one cannot attain nor understand. \n\nIn this, Lucille initially \"owns\" Thomas. There is nothing mutual in their relationship. She cannot know what it is to express mutual desire. She is his prison, Edith his key, his angel, salvation. She extends mercy to him that he has never experienced. It is in his workshop, a space of creation, that he and Edith begin to explore their relationship. In fact, it's worth noting how Edith is a creator herself, a writer, in direct opposition to Lucille's murderous and destructive ways. \n\nWhat starts as a battle over Edith ends as a fight for Thomas's soul, an angel and a demon fighting to determine his fate. As with most Del Toro characters, the guilty must be punished, sometimes in spite of their redemptive actions. Thomas does find his strength, his ability to love and have mercy, but far too late. The punishment is most befitting; forever separated from the angel who freed him from the past. \n\nEdith, the unassuming innocence, becomes their judgement. Thomas is free but now left to mourn the loss of his love. Lucille? The collector becomes the collected, the final addition to her pinned butterfly collection. She is left without her brother, he who she believed to possess, abandoned by him for eternity. \n\nAnd here is Edith, alone at the cost of Thomas's salvation. In the end, however, this fate is not one of total failure and despair. In the beginning, she speaks of a love she knows little about. By the end, she tells a story of loss, her loss, that is every but as achingly honest and human as she initially intended. She tells her tale, a warning of possession and control, the all consuming and destroying vices, and an espousal or the virtues and of redemption and creation. \n\n\"Ghosts are real,\" Edith tells us. The past is real. And it will pursue us. However, we can escape it, let it sink into the ground, we can look to the Future, for that is where we find salvation. Or we can lose ourselves in the past, lost forever in our own Allerdale Hall. Edith's warning? To beware of Crimson Peak.",
        "created_utc": 1519064050,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone here seen “The Draughtsman’s Contract” (1982)?",
        "author": "Brenkin",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yog9t/has_anyone_here_seen_the_draughtsmans_contract/",
        "text": "I watched this movie a couple of months ago and for some reason it has really stuck with me. The flowery and comedic dialogue, the beautiful cinematography, and the somewhat Byronic protagonist are all highlights of what I believe is a really great film. \n\nI just wanted to hear anyone’s thoughts on the film, because I think it has a lot to do with the perceived differences between painting and photography, although the film takes place before the invention of the latter. Neville’s insistence on “painting what he sees” is akin to modern photography, and the perceived reduction of artistic intention in the medium. I think the statue also plays in to this argument as well, though I’ve struggled to think about how. \n\nThoughts? \n\n",
        "created_utc": 1519062284,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on The Sheik and I (2012)",
        "author": "sunkum",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yntn7/thoughts_on_the_sheik_and_i_2012/",
        "text": "It's obnoxiously self-aware in a way that can almost be grating. I hate those kind of movies. But this movie worked for me because it felt honest in its awareness and its self-referentiality mainly because of Caveh Zahedi. It's also organically funny with childish animation sections, and has something to say about creativity and imperialism albeit in an admittedly ignorant way. It's almost an anti-documentary in the way it progresses and ends.\n\nIt's currently available on Mubi for 12 more days, if you're interested in watching. ",
        "created_utc": 1519057601,
        "upvote_ratio": ""
    },
    {
        "title": "The Shape of Water- Voiceless, breathless and beautiful. [Video Review/Analysis in post]",
        "author": "rkeaney",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ynlzd/the_shape_of_water_voiceless_breathless_and/",
        "text": "[Video Review/Analysis](https://www.youtube.com/watch?v=ds9GGcssqZ0&amp;feature=youtu.be)\n\nThe Shape of Water is the latest film by celebrated mexican auteur, Guillermo Del Toro. The film tells the story of Elisa (played by Sally Hawkins), a mute woman who lives above a cinema with her kindly artist neighbour, Giles (played by Richard Jenkins). Elisa works nights as a cleaner for a top secret government facility and upon working there with her friend, Zelda ( played by Octavia Spencer) comes into contact with a mysterious company asset who she develops a close bond with. The security spearheaded by a stern Strickland (played by Michael Shannon) view the asset as a dangerous monster where Elisa sees a kindred spirit. \n\nShape of Water is a stunning return to form for Del Toro, it sees the director returning to where he left off with Pan’s Labyrinth or El Laberinto Del Fauno, that being, making dark, twisted adult fantasy with real heart. The film is exquisitely rendered, it’s the absolute definition of effective visual storytelling. Del Toro has crafted this romantic allegory with utmost care, not a beat is wasted in selling thematic devices or overall tone. In this fashion, the art direction and cinematography are incredibly utilised. The theme of water is so evocatively conjured up whether it is physically present or not. This is largely due to the beautiful colour palette saturation of greens and aquamarines that are both attractive to look at while selling an at times suffocating atmosphere for the voiceless protagonist. Indeed, water and its connotative objects are constantly physically alluded to, be they the morning baths taken by Elisa, the way she prepares her egg lunches, the mop so integral to her work, Strickland’s unusual hand washing habits or even the violent fish-hooking he inflicts upon a character at the film’s climax. All of these of course contribute to the parallel between Elisa and the subject of her desires, the amphibian man or asset (played by Doug Jones, the frequent Del Toro collaborator responsible for The Faun and Pale Man in Pan’s Labyrinth as well as Abe Sapien in Hellboy).\n\nThe narrative could certainly be described as a modern re-telling of the beauty and the beast tale but I feel that dismissing it on this basis would be unfairly reductive to the masterful filmmaking on display by Del Toro and his crew. As aforementioned, the detail on display is truly awe inspiring and not just on the visual side of things. The script, written by Del Toro and Vanessa Taylor takes great care in fleshing out and exploring their fascinating characters. The humanistic empathy afforded to the people who either could have become narrative serving stereotypes such as Jenkins’ closeted homosexual and Michael Stuhlbarg’s russian spy or a typical, two dimensional antagonist in the form of Michael Shannon’s Strickland is what truly makes the film shine. Every character takes unexpected turns revealing unexpected depth and pathos to their performances. Octavia Spencer is perfect in her role as Elisa’s supportive and often hilarious workmate, Zelda, her warmth shining through as one of the few allies Elisa has in the facility. Zelda’s no nonsense nature conflicts fascinatingly with her initial fear of acting out and serves as a satisfying character arc.  So too, Michael Stuhlbarg’s Dmitry shows concern and care for living creatures such as the asset which lends him an empathetic and satisfyingly unpredictable air. Michael Shannon’s Strickland is an uptight and violent individual who the narrative allows us to also see as a man desperately in search of the american dream, from his teal cadillac to the picture perfect family scene at home reminiscent of Giles’ jelly advertisement. This careful cultivation, though ultimately proving an unsuccessful facade to his figuratively and literally rotten presence, shows a man with hopes and a certain amount of vulnerability that Shannon plays with scene stealing flair. The catalyst of the all the film’s conflict, the asset, is magically brought to life by an affecting and deeply committed performance by Doug Jones. However, Richard Jenkins is perhaps the most impressive component of an already extremely strong supporting cast. His whimsical yet vulnerable Giles is a hugely likeable character who manages to evoke humour and true heartwarming sincerity from scene to scene. His loneliness is an affecting character trait that is beautifully counteracted by his loyalty and friendship for Elisa. The connection between characters is evoked gorgeously and becomes a flame of hope in their otherwise difficult lives. All of which brings us to Sally Hawkins, who is the undeniable standout of the film. Her mute performance manages the seemingly impossible task of being able to speak volumes. From her playful demeanour in her interactions with her friends Giles and Zelda and in her defiance towards the imposing Strickland to the deeply affecting emotional overtures in her love for The Asset, Hawkins is a captivating lead. Her performance perfectly sells the film’s overwhelming charm and romance through her humane and charismatic approach. A highlight of her performance being when she desperately tries to recruit the help of Giles in saving the asset from the facility, a heartbreaking struggle to be heard without the command of voice. \n\nThe disenfranchised, underdog characters sell water’s concurrent thematic pairing exquisitely, that being voicelessness. Much like the way that water is physically portrayed in the habitat of the asset and the preferences of Elisa’s routines, voicelessness is clearly apparent in the presence of Elisa’s mute protagonist. It is also evident in Giles’ nervous inability to confront his true self, Zelda’s silent tolerance of racist behaviour, her inattentive husband, and of course in the non-verbal Asset whose otherwise strongly human appearance is counteracted by his incapabilities of defending himself with language. With the aforementioned aquatic imagery: Elisa’s blissfully submerged dreams and her preference to turn her hat into a sea-shell of sorts, creating sea noises when on her nightly commute, the romance between her and the asset is foreshadowed and complemented in evocatively visual ways. We our immediately sold on their connection through their overwhelmingly similar characteristics.  As well as them both being voiceless, they are also frequently paralleled with the theme of breathlessness or suffocation. This inability to breathe easily can be seen clearly with The Asset’s need for saltwater and his initial struggle at being a literal ‘fish out of water’, it also feeds into Elisa’s suffocating inability to speak for herself and be heard, the raspy breaths replacing her damaged vocal chords. Tying nicely into the title of the film, water allows both characters to breathe easily, be it in the scene where Elisa floods her bathroom or the ending where her disability becomes a new lease of life, her scars becoming the gills that allow her to breathe. \n\nDel Toro has worked wonders with The Shape Of Water, making a beautifully profound allegory for the inhumane way we as a society often marginalise those who are different. Beyond his masterful direction and the visual sumptuousness he conjures in every frame is Dan Laustsen’s beautiful camerawork that brings it to life. My favourite shot and moment being the water droplet dance initiated by Elisa touching the rain streaked bus window, an absolutely stunning and artful metaphor for the entire narrative. Furthermore, the art direction by Nigel Churcher and production design by Paul D Austerberry are simply superb. The film is also exquisitely edited by Sidney Wollinsky, who maintains a beautiful rhythm to The Shape of Water as fluid as its namesake.  Alexandre Desplat’s score is heartwarmingly nostalgic and gorgeous in which he creates instantly iconic themes with a nautical soundscape.\n\nI loved The Shape of Water and a second viewing only made it a stronger film in my eyes. Though the narrative is familiar, it is still utterly unique in its approach. The perfect visual storytelling, fantastic performances and soundtrack create a wondrous cinematic experience that is heartwarming, dark and utterly beautiful. \n\n\n\n[Video Review/Analysis](https://www.youtube.com/watch?v=ds9GGcssqZ0&amp;feature=youtu.be)\n\n\n\n\n",
        "created_utc": 1519056015,
        "upvote_ratio": ""
    },
    {
        "title": "It's Your Fun &amp; Fancy Free Discussion! (February 19, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ymulp/its_your_fun_fancy_free_discussion_february_19/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nFun and Fancy Free threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; you can even discuss tv here! Lurkers, this and our Slack team are *the* places to introduce yourself.\n\n##Sign up for the TrueFilm Slack team [here](https://whispering-temple-35722.herokuapp.com/). Our team page is [here](https://truefilmreddit.slack.com/).\n\n###Follow us on:\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) ([fellow TrueFilm users](https://www.reddit.com/r/TrueFilm/comments/3th7st/anyone_here_use_letterboxd/))\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n- [Criticker](https://www.criticker.com/profile/rTrueFilm/)\n\n- [Facebook](https://facebook.com/TrueFilmReddit/)\n\n####The sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1519049154,
        "upvote_ratio": ""
    },
    {
        "title": "What's your favourite Danish film?",
        "author": "lastmoviestanding",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ykh7w/whats_your_favourite_danish_film/",
        "text": "I had great success in this subreddit recently accruing recommendations of **Dutch** films I should watch (thanks again to all who responded to that post I've watched some of the films and appreciate the tips). I thought I'd try the same for the cinema of **Denmark**\n\nOff the top of my head I'll briefly mention what noteworthy films I've already seen and my take on them.\n\nSeveral **Vinterberg** films including **Festen** and **The Hunt**, both of which I thought were excellent.\n\n**In a Better World** which I loved.\n\n**The Idiots** which I didn't particularly like though I love almost everything **Von Trier** has released since this film. I have not seen any of his work prior to **The Idiots**.\n\n**A Highjacking** which I liked.\n\nI have not seen any of **Winding Refn's** Danish films but have seen all of his subsequent films and thoroughly enjoyed about half of them.\n\nDo you have any hot tips on great **Danish** films, particularly ones not by the handful of directors who have become internationally famous like **Bier** and **Lindholm** as I'm hoping to uncover some gems that are totally off my radar.\n\nThanks on advance for your suggestions! ",
        "created_utc": 1519018542,
        "upvote_ratio": ""
    },
    {
        "title": "Black Panther, as a phenomenon.",
        "author": "Y3808",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yhl10/black_panther_as_a_phenomenon/",
        "text": "The NY Times proclaims that this film is \"a Defining Moment for Black America\" in its headline.  In a week, the film has as many reviews (going by RT) as a comparable politically-charged movie that has been in theaters for two months (*Darkest Hour*).\n\nDisclaimer: I have seen neither of these films.\n\nAs of this writing, RT's catalogue of reviews for the film have a grand total of three negatives, none of which are critical of the politicization, they all have technical/plot concerns.\n\nI wonder if anyone ever considered writing a review of reviews, questioning whether an entire race of people might *not want* their existence defined by a Disney comic book film. Surely the \"top 48\" critical reviews on RT didn't, because their reviews singing the praises of how a comic book movie fixed racial issues in one day, from people who *aren't* white, are a total of two.  And one of them is Asian, so the total number of people who belong to the race of people that Disney has miraculously rescued with choreographed CGI fight scenes, is in fact half of that two. And that one isn't a film critic, he's a political writer for *Slate*.\n\n\nSo congratulations, black America (I guess?). You too can now begin to live a life that ends in a confused, middle-aged, Disney themed existence.  They'll have everything you need to live... twin bed sized Black Panther sheets, Black Panther video games to shut your kids up, Black Panther toys for them to play with when you pry them away from the apps on their phones, and braless Black Panther costumes for your wife. \n\nYou in turn have everything that Disney needs: a credit card.\n\n[The Medium is the Message](http://web.mit.edu/allanmc/www/mcluhan.mediummessage.pdf) for those who have not read it before.\n\n&gt; Electric speed mingles the cultures of prehistory with the dregs of industrial marketeers, the nonliterate with semiliterate and the postliterate. Mental breakdown of varying degrees is the very common result of uprooting and inundation with new information and endless new patterns of information. Wyndham Lewis made this a theme of his group of novels called *The Human Age.* The first of these, *The Childermass,* is concerned precisely with accelerated media change as a kind of massacre of the innocents. In our own world as we become more aware of the effects of technology on psychic formation and manifestation, we are losing all confidence in our right to assign guilt.\n\nYou see, there aren't really any people.  There is only Disney, and an endless stream of comic book characters.",
        "created_utc": 1518989980,
        "upvote_ratio": ""
    },
    {
        "title": "Recommend me your favorite Japanese films that aren't jidaigeki or shomingeki",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yg137/recommend_me_your_favorite_japanese_films_that/",
        "text": "[removed]",
        "created_utc": 1518977590,
        "upvote_ratio": ""
    },
    {
        "title": "Best/Worst Film Soundtracks?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yfr8p/bestworst_film_soundtracks/",
        "text": "[deleted]",
        "created_utc": 1518975340,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about pirating films over 50 years old?",
        "author": "Ender_Skywalker",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yewc3/how_do_you_feel_about_pirating_films_over_50/",
        "text": "[removed]",
        "created_utc": 1518967769,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of February 18, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yeesk/what_have_you_been_watching_week_of_february_18/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1518962750,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone seen 'Let the Corpses Tan?'",
        "author": "Count__X",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ye7mo/has_anyone_seen_let_the_corpses_tan/",
        "text": "I just caught a showing of Let the Corpses Tan ( or 'Laissez Bronzer les Cadavres') and was curious if anyone else has seen it. \n\nI really enjoy the Giallo genre (or what films I've seen so far therein) and heard it was a mix of Giallo and spaghetti western styles. I saw the directors' other film 'The Strange Color of Your Body's Tears' last year and, while it wasn't my favorite, I really enjoyed the style and brave creative choices they made with it. \n\nWith 'Corpses', I feel they made a slightly more accessible film in that it ditches much of a narrative for a straight up OK Corral shootout with surreal undertones. Like Fistful of Dollars meets Jodorowsky-lite. It was a fun film and the Ennio Morricone tracks in it really elevated some of the scenes. \n\nAnyone else have any thoughts?",
        "created_utc": 1518960365,
        "upvote_ratio": ""
    },
    {
        "title": "The Shape of Water and Love, Love, Love (Spoilers!)",
        "author": "Soyyyn",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ye6xw/the_shape_of_water_and_love_love_love_spoilers/",
        "text": "I finally got to see The Shape of Water yesterday and my mind has been buzzing with thoughts and impressions. The film underwhelmed me at first - after all the Oscar nominations and the high praise dished out almost everywhere I expected something grand and moving, and you never get something of the sorts when you expect it, only when you don't. So when I got home, my expectations fading while I formed an actual opinion on the piece, I slowly realized I loved it, was infatuated with the world it had created.\n\nAnd I'd like to talk to all of you about Love with a capital L, and how The Shape of Water deals with this most tender of emotions in a beautiful, fairytale-like way. And in a realistic, crushing way as well.\n\nAll the main characters in the film have a relationship with romantic love, and they all represent different types and tropes most moviegoers will be quite familiar with. Mr. Strickland is in a marriage with a loving wife and kids but is unsatisfied because he seeks validation from his job. Zelda is in an unhappy marriage she seems too used to to get out of, in addition to the times the film is set in being less than kind to divorced women. Giles is unhappy, his romantic past with Bernie perhaps hinted at in a few looks, the restaurant worker's rejection of his advance a burning reminder of how lonely and isolated gay men and women felt before there even was a public discourse on LGBT rights. Even Dr. Hofstedler lives a solitary life, his position in the U.S. not allowing him to form any meaningful relationships that might compromise his mission.\n\nAnd then there's Elisa and the Creature.\n\nTheir relationship stands on the opposite side of the loving spectrum. They dance around each other like teenagers, have sex that's (most likely) satisfying to both of them, spend as much time together as they possibly can and we even see Elisa daydreaming about her Gill Man, rain and any form of water reminding her of him. We never see them kiss throughout the film, but they share long, tender embraces, glances, touches. Throughout the film, we never see any people as happy as Elisa during that long moment when Giles opens the door to the bathroom-turned-aquarium and finds her hugging the Creature, lost in his arms. It's Love at first sight, beyond infatuation, deep and true, that only exists in poems and books and movies until you experience it for yourself.\n\nThe ending, which was the part that irked me the most about the film in the beginning, works perfectly in this regard. The unhappy marriage, at least the man in it, ends up trying to sabotage True Love, as often happens when unhappy partners see newlyweds or flirting young couples. Some of them don't believe in this kind of Love anymore, which the film points out with the little speech Elisa gives to her husband Brewster: You couldn't understand this even if you tried, if you took all your life to understand it. Mr. Strickland, as an ambassador of the life and the Love that are \"good enough\", is entirely destroyed, and Giles, unhappy and unable to find love in a world that shuns him, helps the couple along the most. If he can't be happy, he'll at least try to help somebody else find happiness.\n\nThe last shot, with the couple mirroring the famous poster image, floating into the blue darkness of the sea, treats Love with an optimism I've rarely seen in movies, and not seen regularly since the Hollywood Golden Age. There is a happily ever after. No mortgages, no divorce, no arguments about frying pans in a film that's filled with people being in very realistically drawn relationships - there's just a bit of slow-motion, music, a poem being read, and then the title. Movies that have treated Love this way have been said to be selling lies to unsuspecting romantics, but they're not quite lies, are they? They're dreams, and you can choose whether you want to believe in them or not. With this unlikely romance between two beings who are more alike than they might seem at first sight, The Shape of Water dares us to imagine Love with a capital L again, dares us to feel more deeply. Dares us to dream, even, the way we dreamed when we were less cynical and more open to the beauty of the world and of Love, especially. And that's all I could ever ask of a film.\n\nNow, what are your thoughts on Love in the film? And in other films this year? I think The Shape of Water and Call Me By Your Name might almost be the companion pieces of this year, both showing interesting, deeply felt and even sensual relationships that couldn't be more different.",
        "created_utc": 1518960135,
        "upvote_ratio": ""
    },
    {
        "title": "The Shape of Water and Love, Love, Love (Spoilers!) NSFW",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ye4rz/the_shape_of_water_and_love_love_love_spoilers/",
        "text": "[deleted]",
        "created_utc": 1518959353,
        "upvote_ratio": ""
    },
    {
        "title": "Are Star Wars' references to Fascism and warfare a political act- or does it somehow become apolitical due to its populist nature? A podcast discussion",
        "author": "[deleted]",
        "url": "https://soundcloud.com/s-mac-782389762/sbtff-special-star-wars-through-the-political-lens",
        "text": "[deleted]",
        "created_utc": 1518943284,
        "upvote_ratio": ""
    },
    {
        "title": "Edward hopper and Phantom thread",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ycn3v/edward_hopper_and_phantom_thread/",
        "text": "[deleted]",
        "created_utc": 1518935166,
        "upvote_ratio": ""
    },
    {
        "title": "[Analysis] Black Panther is self-aware; it knows what it wants to say and is unswerving on pointing out its subject matter.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7ycbg4/analysis_black_panther_is_selfaware_it_knows_what/",
        "text": "[deleted]",
        "created_utc": 1518930937,
        "upvote_ratio": ""
    },
    {
        "title": "[Analysis] Black Panther is self-aware; it knows what it wants to say and is unswerving on pointing out its subject matter.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yc9n0/analysis_black_panther_is_selfaware_it_knows_what/",
        "text": "[deleted]",
        "created_utc": 1518930339,
        "upvote_ratio": ""
    },
    {
        "title": "Movies that have a reveal but it doesn’t cheapen the rewatch ability for further viewings?",
        "author": "jesushenchman",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yc3yb/movies_that_have_a_reveal_but_it_doesnt_cheapen/",
        "text": "[removed]",
        "created_utc": 1518928474,
        "upvote_ratio": ""
    },
    {
        "title": "Happy Birthday to Alejandro Jodorowsky, still going strong after 89 years!",
        "author": "[deleted]",
        "url": "https://en.m.wikipedia.org/wiki/Alejandro_Jodorowsky",
        "text": "[deleted]",
        "created_utc": 1518920820,
        "upvote_ratio": ""
    },
    {
        "title": "The Emoji movie wasn't all that bad",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7yabvx/the_emoji_movie_wasnt_all_that_bad/",
        "text": "[removed]",
        "created_utc": 1518909778,
        "upvote_ratio": ""
    },
    {
        "title": "DISCUSSION: Let The Right One In (2008)",
        "author": "Hi_M0m_",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y9h1k/discussion_let_the_right_one_in_2008/",
        "text": "Okay so I just watched Let the Right One In last night.  My initial reaction to it wasn’t as great as it seems like everyone else’s reaction has been.  I’ve been thinking about it since I watched it, and I’m a bit confused about a few details.  For example, why was the super valuable egg thing included? \n\nI’m curious to hear what you guys thought of the movie!",
        "created_utc": 1518901767,
        "upvote_ratio": ""
    },
    {
        "title": "Ending of Blade Runner 2049",
        "author": "IDrinkUrMilkShake94",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y8amw/ending_of_blade_runner_2049/",
        "text": "Maybe I’m reaching, but I love the inclusion of snow in the final scene. \n\nMuch is made about water, specifically rain. Both Joi and K have different moments of feeling it on their hands, and each time it’s a very introspective moment for them.\n\nHowever, they are unsure of themselves and their identity. Is what they are feeling real? Genuine?\n\nI think the rain takes on a symbol of their identity, fluid, without form. But, as the film closes, the rain has turned to snow, a solid form, mirroring K’s own identity as he comes to terms with what he is, what it means to be alive, and his own purpose.\n\nWhat do you guys think? A reach? Another opinion? ",
        "created_utc": 1518891404,
        "upvote_ratio": ""
    },
    {
        "title": "Best short films?",
        "author": "spence20t",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y8844/best_short_films/",
        "text": "Sometimes I don’t have the time/energy to sit down and watch a full feature, but I still want to enjoy some film. Any recommendations on shorts?\n\nA few of my favorites are:\n\nThe Fall of the House of Usher (Watson/Webber, 1928)\nÀ propos de Nice (Vigo, 1930)\nAntoine and Colette (Truffaut, 1962)\nThe Cowboy and the Frenchman (Lynch, 1988)\nDelphi Falls (Clark, 2017)\n",
        "created_utc": 1518890767,
        "upvote_ratio": ""
    },
    {
        "title": "[\"The Thing\" - 1982] Film can be viewed as a microcosm of our society and grappling with our animalistic human nature, brings us to question what it is to be human, demonstrates the struggle between civilization &amp; barbarism, and shows how history repeats itself.",
        "author": "ohwhatta_gooseiam",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y83tx/the_thing_1982_film_can_be_viewed_as_a_microcosm/",
        "text": "TL; DR: The Thing’s presence demonstrates how we confront issues related to our primal nature including symptoms such as: power, racism, violence, sexism, imitation, survival, and emotion. In the end, who “the Thing” is doesn’t matter because trust, infrastructure, spirits, and hope were all eradicated by the actions of both “pure” and “assimilated” humans alike. As Rage Against The Machine put it - know your enemy.\n\nI hope y'all enjoy this idea! I've also posted this in /r/c_s_t and /r/fantheories but with lackluster feedback. Hoping to spark some interest here with you fine folk! cheers!\n\nTL; DR2: The 1982 film “The Thing” by John Carpenter centers around the relationship between civilization &amp; barbarism, and what it means to be human. The alien is used as a representation of the ugly parts of our own human nature, which is often referred to as being separate from modern concept of humanity, instead being the result of “demons” or “the devil”. I think that the constantly morphing alien/human form (lacking a proper name, place of origin, physical ability) was created as a device to confront these ideas without the audience being able to attach an identity to it, avoiding a distraction from the lesson. Interestingly, the fear/shock response to the grotesque representation of this concept is enough to throw the characters and audience both “off the scent”, leading to making the same mistakes and therefore the same demise as the Norwegian camp.\n\nThe story demonstrates how we, as a group, attempt to single out those exhibiting undesirable parts of our nature to remove them, but ultimately fail. In the process, what actually occurs is a gradual loss of freedom, happiness, safety, trust, as well as all of the luxuries that civilized society provides. Taking place in an isolated camp built on a barren continent provides a stark contrast between nature and what we’ve constructed, and acts as a “proving ground” for what we hold most dear about our identity.\n\nThe primary points of focus to support this theory are:\n\nThe thing has been around as long as we have (~100,000 years) The dog thing co-existed with the group, and only attacked when provoked. Focus on “finding out who’s who” and “who’s still human”. When the thing looks &amp; acts human…what is it to be human? How do we know if we are? Mac’s monologue: \"I know I'm human. And if you were all these Things, then you'd just attack me right now. So some of you are still human. This thing doesn't want to show itself. It wants to hide inside an imitation. It'll fight if it has to. But it's vulnerable out in the open. If it takes us over, then it has no more enemies; nobody left to kill it. And then it's won.” Tagline from teaser trailer: “Some say the world will end by fire. Others say it will end by ice. Now, somewhere in the Antarctic, the question is being settled forever.” The answer according to my theory/analysis, is “by us”.\n\nForeword: A friend introduced me to this film a few weeks ago, and it’s given me a good bit to chew on! I feel that the core message of this story is relevant to many contemporary issues we’re facing as a nation (USA) and as a species (human), as such I made a few connections scattered throughout. I hope that, even if you don’t agree with the relations I made, that you submit a comment! I’d love to expand on this theory/interpretation.\n\n\"The Thing\" - Terror Takes Shape\n\nThis story serves as portrayal of how we, as a group, confront and grapple with our own animalistic roots and behaviors. I think that this is the film's intended meaning, which is why John Carpenter describes it as a movie about “paranoia”, while dismissing theories about whether Childs or Macready were the \"Thing\" at the end. I think that by asking that question, Carpenter's commentary on our behavior rings true. We’re so pre-occupied and obsessed with identifying and squandering the threat, that we don’t realize the damage we’re doing to ourselves, each other, and our environment. We should strive for going down a different path than the characters did, which is once they realized what the thing was, to acknowledge it for what it is, work together to understand it, and minimize its influence.\n\nIf only the people of Outpost 31 could have seen what happened in the Norwegian camp, learned from their mistakes, and prevent what happens in the rest of the film. Just like in our reality, we have great difficulty learning from and avoiding the mistakes in preserved history. In this example, even a small group of well educated, objectively thinking, scientific minds succumb to fear of what they don’t understand. “Terror takes shape” is exactly right, by representing this fear we all have in a tangible external form, it aids in isolating the concept and making it concrete to talk about it, whereas our animalistic nature is abstract, multi-faceted, and difficult to separate from the time period and the person (host body). I think this is what has made it a cult classic, the idea of “the thing” and how it’s confronted in the movie hits home. The thing isn’t “alien” at all. It’s been here as long as we have, it’s terrifying because it’s very real, and a fundamental part of what makes us human.\n\nBecause I feel that this movie so completely communicates this idea, I’ll essentially summarize the film, and then expand on points and lines I feel are relevant (which are most of them). So BUCKLE UP.\n\n-- roll it! --\n\nThe film begins with a saucer style spaceship (similar to one found later under the tool shed) heading towards earth. The next shot is of a Norwegian helicopter flying through the mountains, and we begin to see that it’s chasing a dog. There’s a guy shooting at it, who can't even manage to hit it in an open field, it’s a tough shot - a moving object, trying to hit another moving object, but still!\n\nIt then introduces R.J. Macready, drinking scotch, playing a game of computer chess in his shack:\n\nMac: \"Startin to lose it aren’t ya? ... ya cheatin bitch.\"\n\nThe chess computer game is interesting, and has been dissected by many. It doesn’t make sense, the board’s layout changes drastically, with the film neglecting to show several moves that must have occurred in between shots. This is likely due to the difficulty/impossibility of keeping continuity from take-to-take. From what we do see though, is that the black pieces (computer) had the upper hand. I've seen some fan theories postulating that the movie is a chess match. I think the chess game relates to how people in power strategize and execute their moves: calculating actions, protecting vulnerable assets, assessing acceptable losses, utilizing intelligence, leading to ultimately dominating their opponent. The chess computer “glitches”, and defeats Mac illegitimately, but it is effectively out of his control. This also relates to “breaking the law” and defying a sense of “law &amp; order”. We construct rules for people to follow, but they are often broken by common folk and authority figures alike. We like to think that these systems are dependable because they use predictable programming. However, without patching the bugs, the world as we know it - all we’ve built - falls into entropy &amp; chaos little by little. This sets the stage for viewing the following events from Mac's perspective: as if he's playing a game of chess, but with pieces that don't consistently use the same moves, break rules, and defy expectations. If we want to get simultaneously “punny” and abstract, the game can be a metaphor for the movie’s message: The plot of “The Thing” is what results when we don’t keep destructive parts of our nature “in check”.\n\nThe helicopter chases the husky, which eventually reaches the outpost. The crew thinks the Norwegians are attacking the camp. One team member is shot in the process, then gets handed the bottle of whiskey while asking \"what's going on there?\" This demonstrates quelling of the masses injured by collateral damage, accepting a non-answer and relative comfort.\n\nThe conversation around the ping-pong table is like the UN trying to decide whether to react and send their representatives or forces to countries either currently or previously experiencing troubles with destructive animalistic traits (the dog).\n\nMac continually mislabels the Norwegians as \"Swedes\" or the people \"from Sweden\", he doesn't understand or know them. This makes me think about the ignorance some have in matters of the Middle Eastern conflicts, which leads to separation, us &amp; them mentality, dehumanization, and apathy.\n\nObservation: Stevie Wonder's \"Superstitious\" is playing on the boom box: \"...When you believe in things, that ya don't understand, then you suffer...Superstition ain’t the way…\"\n\nThey then arrive at the completely decimated Norwegian camp, with extensive fire damage, scattered paper, and an axe in the door (foreshadows the axe Childs used to break through the door to get to Mac)\n\nWe are then taken back to the outpost, where there is a period of peace, the dog isn't causing trouble. It could co-exist to the point of us barely acknowledging its presence. The first time it causes harm is reactionary on its part. I don’t think that it was strategizing while it was wandering the camp, or waiting for the recon team to return on the helicopter from the other camp. It is only when it defends itself from the other dogs that the humans view it as a threat. It could also be argued that the dog thing knows it doesn’t stand much of a chance of survival in a open battle with a group of humans, so it goes after them individually.\n\nBlair autopsies the thing’s remains to study it with human science biology/physiology, using only the knowledge we have access to understanding, and using the scientific method to hypothesize how it operates. This is very much comparable how we try to understand what makes us tick by observing animal behavioral models (primates, rodents, etc.).\n\nThe next major piece is when it's revealed they've lost all radio contact 2 weeks prior. A critical lack of communication and understanding with the Norwegian on the helicopter, and an inability to reach anyone using technology, leaves the crew only guessing as to the cause. They chalk it up to \"cabin fever\" but they know that is unlikely/untrue, as it has only been 2 weeks into winter by this time.\n\nWaking Windows abruptly: Garry: \"Did you reach anybody yet?\" Windows: \"Reach anybody? We're a thousand miles from nowhere man, and it's gonna get a helluva lot worse before it gets any better.\" Garry: \"Well, stick to it Windows, stick to it.\"\n\nThis, to me, reads like the older generation talking to next one who's realizing the gravity of our social situation and the issues we face (including poor communication). Then proceeds to receive a monologue, he is talked at with a message to do/be better than they have been able to. The dread and frustration of Windows, trained in how to use the advanced communication devices, is unable to use them and confront the problems the group is facing.\n\n--Turning point of dog thing’s behavior (~26 min mark)-- Dog interacts with Gibbons under the card table\n\nThis scene leaves open the possibilities of what happened to disturb Bennings. Did the dog brush up against his newly sutured leg wound, or lick it in a nurturing way? Or, did the dog thing nip at his legs?\n\nBennings: \"Clark, will you put this mutt with the others where he belongs?\"\n\nPutting the dog into the pen is effectively confinement with others who operate the same. The thing dog walks in, and immediately the dogs are cautious. The thing shows its terrifying form to intimidate them, and of course, the dogs freak out and react. Two manage to flee the cage out the door, while one tried to tear hole in fence. I think this represents the animalistic nature of the thing, as dogs are largely instinctive and tribe/pack minded. They don’t recognize this pup as one of their own, and reject it.\n\n----(~30 min mark) chapter 11----\n\nChilds looks at its eye, frozen in place, hesitating to pull the trigger on the flamethrower until it approaches him. Mac &amp; Childs demonstrate two different approaches to being on the frontline against what they fear will escape into the camp and into the world (civilization). I think that Clark represents someone who is in touch (and at peace) with his animal nature, and is therefore sympathetic to both the thing and the dogs tied up in the crossfire.\n\nOne could look at the autopsy as dismissal of certain life forms as something other than human, even though they’re indistinguishable biologically. This relates to how racist logic operates, where they might look like you and me, but they’re not what we regard as human:\n\nBlair: “ya see, what we're talking about here is an organism that imitates other life-forms, and it imitates ‘em perfectly. When this Thing attacked our dogs, it tried to digest ‘em. Absorb them. In the process, it shaped its own cells to imitate them. This for instance, that’s not dog. Its imitation. We got to it before it had time to finish.” X: “Finish what?” Blair: “Imitating these dogs.” (…) Blair: \"Clark? Did ya notice anything strange about the dog? Anything at all? \" Clark: \"Strange? No.\" Blair: \"What was the dog doing in the rec room?\" (note: what was tribalism doing in the recreation - playroom? Primal behavior isn’t welcome there, it’s a safe space) Clark: \"I dunno, just wanderin’ around camp all day.\" Blair: \"Are ya sayin to me that the dog wasn't put in the kennel until last night? How long were you alone with that dog?\" Clark: \"I dunno, an hour, hour and a half maybe? ...What the hell you looking at me like that for?\" Blair: \"I don't know...it's probably nothin’. Nothin at all.\"\n\nThis marks the first time someone is doubted and suspected, and also speaks to the realization that something was out of the group’s scope. That this thing was unregulated, unlegislated, and free for a time, shocked that it didn’t cause any noticeable harm. How did we ever get along before?\n\nOther questions arising at this point, such as, why are they there? Are they a group of scientists or U.S. soldiers, or both? What are they studying? Even larger than that, for the purposes of this film, it doesn’t matter why they’re there, it only matters that they are. Yay extistentialism!\n\n---(~39 min mark)---\n\nX:\"Jesus, how long ya figure this has been in the ice?\" Copper: \"Well, the backscatter effect's been bringin' things up...from way down around here for a long time, I say -- I’d say the ice it's buried in is 100,000 years old, at least.\" Mac: \"And those Norwegians blew it up?\"\n\n100,000 years happens to coincide with our real life timeline, where humans transitioned from homo-erectus to Neanderthal. This is where the \"missing link\" is speculated to be.\n\nAlso notably, Mac finally gets it right, instead of calling the Norwegians “Swedes”. Perhaps it’s due to time and being corrected, but maybe it’s because he saw their camp himself, much like how a citizen might be ignorant to a foreign country’s people and their ways, but a soldier sent to the location would have interacted with them.\n\nMac: “I dunno, thousands of years ago, it crashes... Childs: \"I just cannot believe any of this voodoo bullshit.\" Palmer: \"Happens all the time man, droppin’ ‘outta the skies like flies, the government knows about it, right Mac?\" Childs: \"Do you believe in any of this voodoo bullshit, Blair? (the scientist/doctor/sociologist) Palmer: \"Childs! Childs! …Chariots of the gods man. They practically own South America. I mean, they taught the Incas everything they know\" Garry: \"The Norwegians get a hold of this, and they dig it up out of the ice..\" Mac: \"Yes, Garry, they dig it up. they cart it back. it gets thawed out, wakes up, not in the best of moods. I don't know. I wasn't there.\n\nEveryone gets interrupted by Nauls on roller-skates asking about the dirty “drawers” he found (y’all disrespectful men...keep this kitchen germ free). Then conversation continues:\n\nChilds: \"Now how does this motherfucker wake up after thousands of years in the ice?\" \"and how could it look like a dog?\" Mac: \"’Cuz it's different than us, see? ‘Cause it's from outer space. What do you want from me? Ask him (gestures to Blair).\" Childs: \"Do you buy any of this Blair?\"\n\nThis conversation is the beginning of their internal communication troubles, as they (common folk) are looking to Mac (authority) and Blair (scientific community) for answers to their questions. Frustrated, the masses begin to think the scientific community knows and won't tell them (but they simply lack sufficient evidence). This breeds discontent and distrust. In addition, Childs is the most bewildered by the situation, calling it “voodoo bullshit”. He doesn’t understand it, and compares it to what he thinks is nonsense and non-scientific. This could be the reason behind “Superstition” playing on the radio, it’s another system which tries to make meaning out of the chaos, where breaking a mirror is believed to bring bad luck, when in reality, shit just happens.\n\nText on screen (Blair reading) PROBABILITY THAT ONE OR MORE TEAM MEMBERS MAY BE INFECTED BY INTRUDER ORGANISM: -75%-\n\nPROJECTION: IF INTRUDER ORGANISM REACHES CIVILIZED AREAS...\n\nENTIRE WORLD POPULATION INFECTED 27,000 HOURS FROM FIRST CONTACT\n\nNOTE: Where is this coming from? Why doesn't he share this info with the group? What an odd format for a computer to generate conclusions from data. It reads more like a communication with another human. Was satellite internet possible in 1982?\n\nWindows: \"We ought to just burn these things\" Bennings: \"Can't burn the find of the century, that's gonna win somebody the Nobel prize\"\n\nSurprise! It's still alive. Could this be like times when it could be eradicated, but is kept alive because it's utilized for leveraging power and manipulating the masses? Alternatively, it could be as simple as the fact it can never fully die, as it’s just a part of our nature. Nobel prizes reward those who either try to understand the natural world (sciences), create their own worlds (literature), or attempt to improve life in our shared world (peace), often swimming against the current of social forces. All pursuits that the crew strive for in their own ways.\n\nThey burn Bennings outside:\n\nMac: \"If it had more time it would have looked and sounded and acted like Bennings.\" Garry: \"I don't know what you're saying\" Mac: \"That was one of those things out there trying to imitate him, Garry. Come on.” Garry: \"Macready, I know Bennings, I've known him for ten years. He's my friend\"\n\nThis is like with allied countries (macro scale) or personal friends/family (micro), when one starts behaving based on tribal urges, disbelief plays a huge role in enabling that behavior. Our familiarity and categorization of something as a non-threat can influence sound judgement in the moment.\n\nAs he's destroying equipment in a rampage, Blair: \"You guys think I'm crazy. Well, that's fine. Most of you don't know what's goin’ on around here. Well I'm damn well sure some of you do.\" X: \"Christ\" X: “He got most of the chopper and the tractor, and he's killed the rest of the dogs. Clark runs off to tend to the dogs (…) Blair: \"Do you think that thing wanted to be an animal? No dogs make it a thousand miles through the cold. Nah, you don't understand! That thing wanted to be us! If the cell gets out, it could imitate everything on the face of the earth! And it's not gonna stop!\n\nHe's right, but went about it all wrong. In the process of informing them, he turned the populous against him, even though he spoke the truth. As a result, they locked him in the tool shed \"for his own protection\" and sedated him via morphine injection. This, to me, represents the rejection of scientific evidence and the pursuit of knowledge &amp; understanding. Facts can be scary, and can cause a foundational questioning of everything we believe, and damaging to beliefs held on to via the ego.\n\nX: \"What about your shack?” Mac: “I don't want him in my shack\"\n\nThis relates to the “brain drain” effect, and the “not in my backyard” mentality. It’s happened many times before, most notably during the third Reich in Germany, and present day with the new tax plan in the US, which eliminates the tax break for graduate students. It’s symptomatic of our collective lack of desire/value for the pursuit of knowledge, which also shows itself in the rejection of climate science. * Mac:* \"How ya doin' old boy?\" Blair: \"I don't know who to trust\" Mac: \"I know what you mean, Blair, trust is a tough thing to come by these days. Tell ya what. Why don't ya just trust in the Lord?” Blair: \"Watch Clark. Watch him close.\"\n\nThey later look through Blair’s notebooks instead of including him in the effort, because he's \"too far gone\", even though we see him later speaking lucidly with Mac. He never showed signs of being a “thing”, only had a normal human violent tantrum. This relates to the jailing of protesters who act violently in the name of progress. They may be speaking the truth, but lose their cool and end up looking like part of the problem instead. The comment about “trusting in the Lord”, I believe, relates to the general rejection of science in the face of overwhelming information and fear. In this mindset, a belief system based in a single book (very few revisions) sounds pretty good. In this case it’s offered as a reaction to present stress, and a crumbling of the foundation of trust in his fellow men and himself. Putting that responsibility and burden with God is a great comfort.\n\nChilds: \"So how do we know who's human? (...) How would you know if it was really me?\"\n\nWindows, in debate over who vandalized the blood storage, runs away to gun arsenal reaction-arily, when approached by Garry at gunpoint, says: * Windows:* \"You guys gonna listen to Garry? You gonna let him give the orders? He could be one of those things.\"\n\nThis proverbial “spilling of blood” is another point of comparison. Those who have been given the responsibility of watching over the “blood” of the group, are not owning up to it when it’s been spilt.\n\n--- (1 hour mark) chapter 23---\n\nGarry proclaims he never went near that blood (meaning he’s a good natured human) then says: Garry : \"...but I guess you'll all feel a little easier if somebody else was in charge\" (lays down revolver)\n\nThis felt out of place in the movie, but fits with my theory. This is representing the handing down of control to a new generation to deal with new social issues and struggles. Who has been \"in charge?\" of the camp at this point? If anyone, Mac seemed like he is. He had people reporting things to him for operational strategy, coordinated people verbally…Garry not so much.\n\nGarry: \"Norris, I can't see anybody objecting to you\"\n\nThis is the first time this character has spoken in the movie, with very little screen time, and he says, realistically: Norris: \"I'm sorry fellas, but I’m not up to it\" Childs, with little hesitation, steps forward to take the gun/charge. Clark holds a knife to him. Mac:”It should be somebody more even-tempered”\n\nNorris turning down the authority role reminds me of the old adage: “those who desire that sort of power are the last people you’d want for the job”. How decent pacifistic people, like Norris, even when given the opportunity, would not take a position of power to lead a group. (..) Mac: \"I know I'm human. And if you were all these Things, then you'd just attack me right now. So some of you are still human. This thing doesn't want to show itself. It wants to hide inside an imitation. It'll fight if it has to. But it's vulnerable out in the open. If it takes us over, then it has no more enemies; nobody left to kill it. And then it's won (one?). There's a storm hitting us in six hours. We're gonna find out who's who.\"\n\nThis monologue by Mac is one of the most concentrated pieces of dialogue in the film that lend credence to my theory. The manifestations of our primal nature are often veiled, and often hide in plain sight by taking recognized forms. Animalistic acts typically hide under people’s civilized surface/façade, such as racism, sexual aggression, and violence. In recent history, one could relate this to the #metoo movement around sexual harassment, and the xenophobia associated with the foreign &amp; domestic policy changes under the current administration. The Republican Party has been steering its base with a dog-whistle for decades, now they’re using a bullhorn. It will fight if it has to, but it is vulnerable out in the open.\n\nMac separates everyone into groups, explicitly punishing a few, holding a flamethrower, not menacingly yet, but enjoying its power as he addresses his congregation around the burning alien corpse &amp; bloodied material in a pit ceremoniously.\n\nCopper: \"You don't wanna drug me. Mac, I'm not a prisoner!\"\n\nThis highlights the group’s various labels for each other, making the differentiation between “human” and “prisoner” which is a slightly dehumanized term, but not quite a “thing”. Mac, in response to Copper, gestures toward them with the flamethrower, as if any one of them could be “the thing” (or poses as much of a risk to him as the thing).\n\n---(1 hr 3 min)--\n\nNorris, under Child's armed watch, injects Doc with morphine: Copper: \"Let-let me do it. You're gonna break the needle in my arm\" Childs: \"No, Doc, he's doing a real fine job\"\n\nNot sure how this relates, but it seemed significant enough to jot this line down. Perhaps something to do with the disregard for someone’s expertise on a matter based on ideology, bias, or past actions. Or maybe commentary on our specialized job economy. No\n\nDictating in his audio journal, Mac: “it's been 48 hours, and no closer to the resolution of the problem. I'm gonna hide this tape when I'm finished. If none of us make it, at least there will be some kind of record. Storm's been hitting us hard now for 48 hours. We still have nothing to go on. One other thing, I think it rips through your clothes when it takes you over. Windows found some shredded long johns, but the nametag was missing. They could be anybody's. Nobody-- nobody trusts anybody now. And we're all very tired.\"\n\nInterestingly, he got one detail/fact wrong, Windows didn't find the shredded underwear, the guy on the roller-skates (Nauls) did. What does this say about the way history is written/recorded, and the cause of why people don't trust each other or what they've been taught from a book or recording? He then rewinds, listens to himself say \"nobody trusts anybody now\", rewinds same length again, and records over it with \"there's nothing else I can do. just wait.\" then recites his sign-off, R.J. Macready Outpost 31 etc. stops recording Is this to inspire hope in future generations?\n\n(…)\n\nMac: \"You come up with anything yet?\" Fuchs: \"…One or two ideas. But Macready, I've been thinking. If a small particle of this thing is enough to take over an entire organism, then everyone should prepare their own meals. And I suggest we only eat out of cans.\" Mac: “all right”\n\nJust because there's the possibility of corruption by this thing due to its possible presence, extreme measures are proposed, which drastically impact quality of life for “uninfected” citizens. This represents the reactionary drastic pendulum swing measures taken in response to a threat: isolationism (eating out of cans) and hoarding of resources/wealth (non-communal food).\n\nThis is where Fuchs ventures outside, and finds the scrap of Mac’s clothing, which is later stashed away in Mac’s shack. I wonder what Fuchs’ venture symbolizes?\n\nThe arguing over how the teams were set up represents not just the distrust in each other, but how authority figures are driven to seek more power and control, and how they justify it. Without their heavy-fisted attitude, the masses can run amok. However, as we see by the end, it doesn’t make a difference. Mac even kills un-infected humans in the grasping order and control, showing he’s no further above the very primal nature they’re combating.\n\n---@1 hr 8 mins---\n\nMac and Blair talk, he insists Fuchs isn't infected. Says he wants to come back inside. He have any influence unless called upon through a peephole in the door. Kept at bay &amp; isolated but still used to guide the group’s decision making.\n\nBlair: \"I'm not gonna harm anybody. There's nothing wrong with me. And if there was, I'm all better now. I'd like to come back inside.\" \"\n\nMac and Nauls go to his shack (what does it represent?) and are out there for 40+ minutes. The people inside are getting skittish. Childs takes charge in place of Mac, orders them to reinforce doors. Wall themselves off (but also in) due to what they perceive as a threatening outside influence. This relates to the fear of immigration/outsiders, and the proposed American “great” wall.\n\nX: \"That's what it wants! To pit us against each other!\"\n\nThrough the reinforced doors, they let Nauls in, who tells them he thinks Macready is \"one of ‘em\" because he found a ripped piece of clothing with Mac’s name on it. Fuchs had found that piece of cloth earlier and didn’t tell anyone about it. If the past is any indication, he probably wanted to show it to Mac, but he can no longer trust him as he thinks he may be a thing now.\n\nDebating whether to go after Macready, who would be stranded outside without a guideline.\n\nX:\"You think he's changed into one of those things?\" X: \"He's had time\" X: \"Nothing human could’ve made it back here in this weather without a guide line.\" X: \"Let's open it now.\" X: \"Why are you so anxious to let him in here?\" X: \"Because it's so close. May be our best chance to blow it away.\" Childs: \"Let him freeze to death outside\" Windows: \"Childs, what if we're wrong about him?\" Childs: \"Well Then we're wrong!\" Window breaks in the store-room Norris: \"We've got no choice now!\"\n\nChilds uses an axe to break down the door to get to Macready\n\n---(@1 hr 12 mins)---\n\nMacready holds dynamite and flares to intimidate, get them to back off.\n\nMacready: \"You asshole\" Childs: \"Youd’ve done the same thing\"\n\nMac then orders freeing of prisoners. (Why were those three chosen as prisoners? What do they represent individually? See open question at the bottom). Perhaps he figures they’re desperate, and can use all the help they can get at this point and worth the risk of being wrong about them. Similar to how oppressed groups are utilized during times of war (92nd infantry in WW2, etc.)\n\nNorris was incapacitated, and found to be a thing when it bites from the stomach during the revival attempt. This is often cited as an outlier in the Thing’s behavior, not sure what the symbolism is. Maybe it’s a subdued version of the thing because Norris was presented as a good-hearted pacifist, but he’s not immune to having some negative human traits.\n\nWhen it rears its ugly head, they stop infighting and unite. The flamethrower is turned from the dynamite in a threatening fashion, towards the monster. Did Mac see the head still alive before it sprouted into the spider?\n\nThen goes right back to restraining suspected characters, kills Clark (later found to be human). The rest of the group sees this happen, criticize Mac for it later, but ultimately don't hold him accountable, much like our current political and authority (police/politicians) situation when collateral damage occurs.\n\n---(~1 hr 18 mins) chapter 29---\n\nMac: \"We're gonna draw a little bit of everybody's blood….’Cause we’re gonna find out who's the thing. Watchin' Norris in there gave me an idea that maybe every part of him was a whole. Every little piece was an individual animal with a built-in desire to protect its own life. You see, when a man bleeds, it's just tissue. The blood from one of you things won't obey when it's attacked. It'll try and survive. Crawl away from a hot needle the same.\"\n\nTo me, this relates to a development of understanding in how humans are constructed. We are made from billions of cells, and are outnumbered approximately 10:1 (other cells to human cells) on average. Also, metaphorically, manipulation is often carried out intellectually to over-ride instinct and “the gut”. By saying the civilized human blood will obey, while the thing will try to survive, is pointing to the instinctual will to survive. Challenging this relationship of the brain is often sought after in the form of action sports, like jumping off of a cliff into water : defying the survival instinct by stepping off that ledge.\n\nHe gets Windows (new generation) to cut everyone's thumbs for blood who gives blood last, cuts himself. Gets tested first, is clean, and then is ordered to watch the others. Then Mac tests his own saying, Mac: \"Now I'll show you what I already know\" Childs: \"Crock of shit\"\n\nWhen they're still tied up, Palmer’s touch of the thing surfaces when its blood reacts to the hot needle, who in turn kills one more. Only Mac is free to destroy the thing. The others, who he put there and disarmed both physically and intellectually, are tied up and defenseless against it…. sound familiar?\n\nGo to test Blair's blood, Mac instructs Childs that if he sees Blair, to burn him. They discover the tunnel underneath the tool shed, with a spaceship and makeshift lab.\n\nMaking spaceship (they suspect) from helicopter parts, they don't understand the tech or how it was made, because they isolated and ‘alien’-ated the scientific community via anti-intellectualism, going as far as blowing up the invention and the tool shed. It is now clear that nobody is leaving there alive.\n\nThe group thinks they see Childs outside, power’s out, indoor heating is off, and it’s assumed that the generator has been broken purposefully. Mac proposes burning the camp to the ground, and preventing the thing from refreezing and preserving itself to be found by the rescue team.\n\nX: \"what can we do?\" Mac: \"we're not gettin’ outta here alive, but neither is that thing.\"\n\n---(~1hr :30 min) chapter 33---\n\nThere’s still no sign of Blair. Blowing up place with molotovs no longer with regard to personal safety, destroying their home. Various levels of confidence in the plan among the 3-man team are displayed, but they ultimately execute the plan, following their leader.\n\nX: \"Generator's gone\" Mac: \"Can we fix it?\" X:\"It's gone, Macready\"\n\nThis is the tipping point where hope is lost that this group is going to be able to overcome the Thing. The modern infrastructure (such as heat) is destroyed, and life can no longer go back to what it was. If the conflict ended here, they could potentially use pieces of material and make basic shelters to sustain themselves until spring, but they continue down the path. If they had stopped, would they be able to continue on, accepting they may be living among “the thing”? Trust has completely degraded, studies have been terminated, and transgressions have been perpetrated, breeding resentment and paranoia. Could their micro-society have recovered from this point?\n\nBlair quietly and intelligently merges with Garry hand over mouth (turns out he was a thing!) However, we have no way of knowing if he was infected while in the shed, or if it happened when someone broke him out, who was a thing. We're not sure who, and again, that doesn't matter.\n\nAttack from the floor/basement, rigged with TNT. The whole camp is decimated, reminiscent of the Norwegian camp. (Mushroom cloud) (....) Mac: \"Where were you Childs?\" Childs: \"I thought I saw Blair, I went out after him and got lost in the storm. Fire's got the temperature up all over the camp. Won't last long though.\" Mac: \"Neither will we?\" Childs: \"How will we make it?\" Mac: \"Maybe we shouldn't\" Childs:\"If you're worried about me...\" Mac: \"If we've got any surprises for each other, I don't think we're in much shape to do anything about it. Childs: \"Well... what do we do?\" Mac: \"Why don't we just...wait here for a little while? See what happens?\" (Childs drinks from bottle)\n\nIn the end, he is still in the same hopeless situation. At this point even his survival instinct is being overridden, asking if maybe they shouldn’t “make it”.\n\nThere was nothing he could do about it. They both have exhibited extreme primal behavior in their own ways. He's exhausted, but Childs isn't harming him or anyone anymore. They’re peacefully co-existing just like they did when it was just the dog. He's accepted it as something that will always exist, regardless of skin color, what they look like, or if their breath is visible. The challenge is in determining when to let it affect you and the group, leading to the destruction of all that you value.\n\nOpen Questions:\n\nWhen the Norwegian helicopter is chasing the dog, the guy can't hit it in an open field. Is he a terrible shot? I suppose they would just be scientists, and the gun would just be for polar bears or other large predatory game in the case of emergency. This would explain it, as they’re likely not practiced in shooting, but damn dude.\n\n\"God\" “Christ” \"Jesus\" and \"Hell\" are used quite often in dialogue. Being an “R” rated film, it has the freedom to be curse-word ridden. Instead, the writer opted for these words as expletives. What does this mean? It could be attributed to the writer’s style, or to make it theater friendly. However, it could be referencing the role religion (Christianity) plays in separating humans from animals, and attributing animalistic urges to \"sin\" or \"demons\" or \"Satan\"? Also, religion is often a way of explaining how we came to be, and the source of all beings in our world. This alien defies all conventional means of identifying a creature, and doesn’t fit into the constructed narrative or scientific systems… As the saying goes, the devil is in the details! Guess I’m a Satanist.\n\nWhat does each character represent? If this theory is accurate, I believe each character is representational. This includes the name/nickname choice.\n\nDistances and Time (one in the same) are referenced a fair amount, which could be dismissed. I wonder, if the time-scale is proportionate. There's quite a few references to time and distance, which are correlated in time and space travel.\n\nHowever, I think there might be intent/hidden meaning behind them: Thing arrived 100,000 years ago Global infection time: 27,000 hours Storm coming in 6 hours Out of radio contact for 2 weeks etc.\n\nDictating in his audio journal, Mac: “it's been 48 hours, and no closer to the resolution of the problem.” If the thing has been around for 100,000 years (how many hours? how many miles was the site from their research station?), and they're experiencing it for 48 hours, other camps around them have gone through the same thing, likely for similar amounts of time. Maybe it could be equated to era's, and each person could be related to a country and their collective actions in conflict, war, and trading of ideas and goods and art. How does this relate? This is a whole ‘nother rabbit hole to jump down.\n\nRobert Burnham noticed that, quite by coincidence, the number of astronomical units in one light-year and the number of inches in one mile are virtually the same.\n\nFor general reference, there are 63,000 astronomical units in one light-year, and 63,000 inches (160,000 cm) in one mile (1.6 km).\n\nThis wonderful coincidence enables us to bring the light-year down to Earth. If we scale the astronomical unit – the Earth-sun distance – at one inch, then the light-year on this scale represents one mile (1.6 km).\n\nScaling the Astronomical Unit at one inch (2.5 cm), here are distances to various bright stars, star clusters and galaxies: + Center of Milky Way galaxy: 27,000 miles (43,500 km) from earth + Also, Vasco Da Gama’s 27,000 mile voyage + 27,000 hours is approximately 3 years\n",
        "created_utc": 1518889694,
        "upvote_ratio": ""
    },
    {
        "title": "Minority pep talk.",
        "author": "dr34mseriesfinale",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y7thl/minority_pep_talk/",
        "text": "\nI live literally next to a movie theatre, it's pretty commmon in my spendthrift lifespan to go at least 1-2 a week to the movies. It's a comercial theatre and i wish there were more independent or foreign movie, but that's not the case. Anyhow, i watch all disney or similar level of production movies there and i've come to realise some strange kind of inclusion of a certain kind of people in every big production. \nThe issue is that there is a kind of \"checklist\" in every recent movie that is really troubling me, it seems that every single one of these movies have quota of minorities and subjects that have to be put there so to not be shitfest on internet about the lack of awareness that a big budget movie has, and i get it, but there is something weird about that, i can't really put my finger on the actual problem, there is something cringy and somewhat artificial to the way they \"support\" social issues, feels like someone handing some candy to the audience so to not be disturbed, and people love it, they cheer and reiterate how important it is for the purpose of some cause. \nIt reminds me of the conflict of Get out, \"i am not racist, i voted for obama\"-ish kind of aura to every single one of these movies. How does it feel for you guys? The acknowledge of the social issue is more important than the artificial portrayal?",
        "created_utc": 1518887011,
        "upvote_ratio": ""
    },
    {
        "title": "This Week in Film: New Releases Discussion Thread (Week of February 17, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y6srh/this_week_in_film_new_releases_discussion_thread/",
        "text": "Please use this thread to discuss this week's latest releases. We're not harsh on the rules here; if it's new to your neighborhood, this thread considers the movie new.\n- [What IMDb](http://www.imdb.com/movies-in-theaters/?ref_=nv_mv_inth_1) considers \"new.\"\n- We also consider new releases to home video \"new.\" So if all fifty hours of *Greed* is discovered and finally released on laserdisc, then yes, definitely let us know what you think about it.\n- This is a discussion about new movies. If you are worried about spoilers, watch the movie first, and only then should you come back here. Spoilers ahead. This thread is filled with spoilers. Spoiler alert.\n- If you want to create a thread about a new movie, talk about it here first. If it does well, consider making a frontpage thread out of it. Please do not jump the gun and make a thread about a new blockbuster without seeing how it fares here. We have a rule; 1 thread per movie per frontpage. Many times, the first thread for a new movie is not the best, and the best get removed. This should help fix that.\nSo tell us; what did you think about the latest fare at the theater?\nSincerely,\nDavid",
        "created_utc": 1518876349,
        "upvote_ratio": ""
    },
    {
        "title": "In your opinion, who is the best block-buster director of this generation, and why is that person your choice ?",
        "author": "DaigoZMGF",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y6oz1/in_your_opinion_who_is_the_best_blockbuster/",
        "text": "[removed]",
        "created_utc": 1518875026,
        "upvote_ratio": ""
    },
    {
        "title": "The definition of Masterpiece",
        "author": "zach18awesom",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y2ugv/the_definition_of_masterpiece/",
        "text": "[removed]",
        "created_utc": 1518823501,
        "upvote_ratio": ""
    },
    {
        "title": "This film got robbed for best picture 😡😡😡",
        "author": "jacksonhar7",
        "url": "https://i.redd.it/61wfbx01lng01.jpg",
        "text": "",
        "created_utc": 1518820973,
        "upvote_ratio": ""
    },
    {
        "title": "2 Or 3 Things I Know About Her: A Discussion",
        "author": "PM_ME_UR_UR",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y2bj6/2_or_3_things_i_know_about_her_a_discussion/",
        "text": "**Hey Y'all. I just watched *2 Or 3 Things* by Godard and felt compelled to write this response. I was deeply conflicted about the film, as you'll see, and wanted to break down what I liked and what I didn't. I think I'll grow to love this film, but I wanted to see how y'all felt about this bold piece of cinema.**\n\n\n“They don’t really talk in the movies. I wanted to talk to you. Because you’re a stranger.”\n\nThere is a scene, from timestamps 23:42 to 31:13, where 2 Or 3 Things reaches the ambition Godard is attempting. The coffee shop scene. Godard begins to rant about objects in his quiet whisper. The image of coffee spiraling, mirroring the universe, as he discusses society, revolutions, and the abolishing of limits. As he ends his rant, an incredible orchestral score begins. The image hangs on the coffee droplets before cutting to Juliette walking down the street. As she speaks, the scenes repeat. The music slowly builds. It’s a cinematic moment that grabs you and screams, this is what cinema is about, this is what sight and sound perfectly in unison can provide, an emotional tug that is almost a language unto itself, proof of the power that cinema can have on the audience. Then it ends. So quickly. It just stops. Not at the crux of the moment, not at the height of the song, as if it were attempting to be a dramatic transition. This stunning moment just ends. And then the film returns to Paris under construction.\n\n2 Or 3 Things is a film of duality. The documentary versus fiction, improvisation versus scripted, essay versus narrative. This not only affects the content, but the presentation. Scenes, like the coffee shop, ooze a dreamy, melancholic atmosphere. It relieves the viewer from the barrage of whispered essay, not only elevating the words through image, but also creating a moment of genuine intrigue. Other moments, like the construction work, are much less cinematic. They focus on the important themes of movement in image, movement through time, and the way both inform culture.\n\nAt the core of these conflicting executions is both the brilliance and challenge of the film. The juxtaposition allows the essay to be expressed in a way prose alone could never achieve. In other instances, the film is boring: the never ending rant of a man who can’t quite seem to connect language to image in a way that produces coherent expression. The film begs for more drama. The coffee scene is proof of its effectiveness.\n\nBy the same token, these moments are what Godard seeks to criticize the viewer for desiring, only then to extrapolate the criticism to other proclivities of Parisian culture. Instead of crafting a film in which the themes and events of the story inspire the viewer to understand the problems Godard has, he created a film that is altogether willing to tell the audience exactly the things he wishes to say, a film that can express these thoughts through story, and a film that refuses to really give the audience anything of substance. When these three ideas come together, it produces cinematic magic. When they don’t, it is a challenge to watch. One must wonder if the parts that don’t work must exist in order to emphasize those that do, as without them it would be like a pie that was simply too sweet to eat more than one bite. Those bites are so incredible, perhaps the viewer could do with just a taste more.\n\nSo what is language? Why do viewers crave drama? Why are some objects symbolic, while others mean nothing to the viewer? Godard poses these questions of cinema, turns them on the culture, and injects it with political commentary. Yet there are no answers. It is less of an essay, and rather a film transformed into the day to day quandaries of Godard. Perhaps these questions are the limits Godard seeks to abolish, or maybe they are as existential of questions as the swirling galaxy of coffee implies. Despite lacking it throughout, it is a film about feeling. It is precisely in the moment, for better or worse, that simply seeks just to exist. As Juliette puts it, the film is “Not dead, yet.” And if you don’t agree, read something else.\n\n[Here is a portion of the clip I am discussing. It cuts off the beautiful ending unfortunately, and I couldn't find anything better. If you like what I wrote or what you see, please check out this film. At the very least, it is one of Godard's boldest film, and one of the first \"essay\" style films he made.](https://www.youtube.com/watch?v=i0i8XR9Cztc)",
        "created_utc": 1518818671,
        "upvote_ratio": ""
    },
    {
        "title": "What was the first film that made you see film as an art form?",
        "author": "shaux50",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y22xb/what_was_the_first_film_that_made_you_see_film_as/",
        "text": "I was thinking about my film watching journey lately and I realized it all changed with me seeing *shawshank redemption*. Up to this point I had been a casual cinema viewer really only enjoying the  the big blockbuster films.I think what sparked the change for me was the ending, which I wont spoil but left me with so much emotion which was something I hadn't previously experienced with any other movie.\n\nNow a couple years later with a much better appreciation for the art form I still look back fondly at *Shawshank Redemption*. I don't believe critically it is the greatest film ever made but I still have a sort nostalgic love for the film.\n\nSo that leads to my question what was the first film that made you   see film as an art and how did it change your feelings? Curious to see your answers.   ",
        "created_utc": 1518816539,
        "upvote_ratio": ""
    },
    {
        "title": "Wind River Analysis: Why We Watch Realistic Drama",
        "author": "DaKinginDaNorth1",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7y10xc/wind_river_analysis_why_we_watch_realistic_drama/",
        "text": "Video Form: https://youtu.be/8prYm-rJZs0\n\nWhat happens when dirt goes into our nose? Our reaction is to immediately sneeze and often in a violent way. This reflex of the human body forces the material out in the quickest way possible. But what happens when something external enters the mind? Something like strong emotions, particularly negative ones. Let’s say, for example, the pain of losing your daughter. Often there are no automatic reflexes to cleanse the mind of these feelings because we tend to suppress them if our mind feels that they are socially inappropriate to express. These thoughts don’t lie dormant in the mind forever. They often try to come out.\n\nTaylor Sheridan’s directorial debut Wind River does an excellent job at showing us the unfolding of these emotions. Before we move on, we have to make a quick separation between two types of films. 20th-century british philosopher R.G. Collingwood drew a distinction between what he called Amusement Art and Magic Art. Amusement Art is what you see in movies like Star Wars or The Lord of the Rings, it helps the audience escape from reality and dive into a fictional world after a stressful day. Magic Art, on the other hand is the type of art in movies like No Country for Old Men or Wind River, which represent a view of this world’s reality. \n\nThe basic difference between these two genres is the “tragic pleasure of pity and fear” the audience feels while watching Magic Art. For the protagonist to evoke these feelings in the audience, there must be a balance. He cannot be either all good or all evil, but he must be someone the audience can identify with. And if he’s skilled in some way or another, the tragic pleasure can be intensified. This is Jeremy Renner’s character, who is a Wildlife Service Tracker and helping an FBI investigation. But at the same time just wants to find the person responsible for the murder of Natalie to kill him.\n\nMagic Art raises some philosophical questions concerning art itself, in this case film being the medium through which art is expressed. Questions like: What does art tell us about ourselves and what purpose does it serve in our lives? One of the first people to ever consider these questions was Aristotle. He argued that our bodies need to experience a full range of emotions in order to stay in balance. Meaning that if we haven’t been sad or scared in a while, we can start to crave those feelings. When we lack this balance in life, art can step in and help us. When we finally experience these sensations we experience an emotional release called catharsis.\n\nIt’s the mind’s process of releasing, and thereby providing relief from, strong or repressed emotions; just like the body expels dirt from the nose by sneezing. Good drama can be incredibly effective in helping the viewer identify with sorrowful experiences of the characters in a story. This can move people and they can leave the movie-experience clean, refreshed and purified in emotional experience. \n\nCatharsis tells us why we choose to watch certain films for more than pure escapism: Movies that don’t necessarily directly evoke positive emotions in the viewer can lead to emotional health. How can we know what happiness is if we’ve never been sad, angry or frustrated? In the movies, we choose to experience horrible situations like a woman being raped or her boyfriend being beaten to death for defending her, for a reason. Of course, such events would horrify us in real life and while they also do so in film, they evoke a special kind of after pleasure as well, a sort of minty aftertaste after the initial sting. It’s one of the main reasons, besides technical mastery, why people continue to rewatch movies like Se7en, Titanic or Schindler’s List.\n\nIn many ways, catharsis is more about what we, as an audience, experience upon the unfolding of events in the story. Tragedies in film remind us that terrible things can happen to decent people, ourselves included. This is a type of cleansing, where you get rid of negative emotions. As Aristotle saw it, the meaning of art and perhaps including all of film is to make profound truths about life stick in our minds.\n",
        "created_utc": 1518807625,
        "upvote_ratio": ""
    },
    {
        "title": "An Unreasonably Short Summary: Isaac Ezban’s The Incident (2014)",
        "author": "ProfAnderson79",
        "url": "https://profanderson79.wordpress.com/2018/02/16/an-unreasonably-short-summary-isaac-ezbans-the-incident-2014/",
        "text": "",
        "created_utc": 1518797475,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best biography of Orson Welles?",
        "author": "cellphonepilgrim",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xzom4/what_is_the_best_biography_of_orson_welles/",
        "text": "[removed]",
        "created_utc": 1518796985,
        "upvote_ratio": ""
    },
    {
        "title": "It's Your Fun &amp; Fancy Free Discussion! (February 16, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xyxao/its_your_fun_fancy_free_discussion_february_16/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nFun and Fancy Free threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; you can even discuss tv here! Lurkers, this and our Slack team are *the* places to introduce yourself.\n\n##Sign up for the TrueFilm Slack team [here](https://whispering-temple-35722.herokuapp.com/). Our team page is [here](https://truefilmreddit.slack.com/).\n\n###Follow us on:\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) ([fellow TrueFilm users](https://www.reddit.com/r/TrueFilm/comments/3th7st/anyone_here_use_letterboxd/))\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n- [Criticker](https://www.criticker.com/profile/rTrueFilm/)\n\n- [Facebook](https://facebook.com/TrueFilmReddit/)\n\n####The sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1518789963,
        "upvote_ratio": ""
    },
    {
        "title": "The live-action anime conundrum: Two box office bombs weren’t enough.",
        "author": "Atimo3",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xyq3i/the_liveaction_anime_conundrum_two_box_office/",
        "text": "*«Adapting anime was a mistake. It's nothing but trash. Those who identify as filmmakers, they sicken me deeply.»*\n\n-**Yasujirō Ozu**, “*The great book of fake quotes*”. 1953.\n\n^^^.\n\nLive action adaptations of anime have a very bad reputation, probably deservedly so. But it’s worth asking why, as the usual explanations from the fans often let me unsatisfied. So let’s see the culprits.\n\n^^^.\n\n**Part 1: “The Hollywood yankeefication” or “The worst thing the US did to Japan since Fat Man &amp; Little Boy”**\n\nKilometric, buzzfeed-y, pumpkin spice latte smelling manifestos have being written about Hollywood being racist and turning Asian characters into white people. I didn’t came to talk about it because I honestly have nothing interesting to say about the subject. Instead I am going to talk about a more subtle form of cultural distortion that have more direct result in how effective a story is.\n\nThe Hollywood anime adaptation seems to follow some simple steps: 1. Take anime property (a niche market in the west) 2. Throw millions of dollars at it 3. Get scared that the original audience may be too niche to turn a profit 4. Yankeefy the entire thing for casual audiences.\n\nThis is not just limited to filling the cast with white people but it also involves rewriting the entire story around common western archetypes regardless of it working or not.\n\n- *[Turn the genius with a god complex into a Columbine shooter, that’s what Murica wants](http://nerdreactor.com/wp-content/uploads/2015/09/nat-wolff-paper-towns-light-yagami-death-note.jpg)*\n\nA glaring example of this is *Dragon Ball Evolution*, where the upbeat Sun Wukong-like Goku gets turned into Peter Parker. Moments like those are obvious but there are more subtle manifestation of this. Let’s take a look at 2017 Ghost in the Shell and how it diverges on its ending from the source material. The anime ended with the protagonist merging her mind with an AI, in the live action adaptation she explicitly refuses to do so because of “individuality” or whatever. Here the process of yankeefication has diched a fascinating science-fiction concept in favor of a more insipid “be yourself, you are your own unique snowflake” moment for no other discernable reason than the US traditional cult-like obsession with individuality. The story has become less interesting because the filmmakers are unwilling to expose a western audience to a new concept.\n\nChanges like this alienate the original fanbase while failing to capture new audiences because its ultimately still perceived as a weird Japanese thingy. But the understandable negative fan reaction to change has led to something that it’s probably just as damaging, a call for “loyal” adaptations.\n\n^^^.\n\n***Part 2: “Japanese live action over-faithfulness” or “Your waifu is trash even in live action”***\n\n*«Some people spend their lives interested only in themselves. Almost all Japanese animation is produced with hardly any basis taken from observing real people, you know. It’s produced by humans who can’t stand looking at other humans. And that’s why the industry is full of otaku!»*\n\n-**Hayao Miyazaki**, *this is a real quote*, 2014.\n\nIn the opposite end of the spectrum you have Japanese live action adaptation, often made with low budget and lack of talent because your main actor is some pop start rather than an actual actor. But beyond those glaring handicaps there is another problem with these adaptations, an obsession with faithfulness, or more precisely, an obsession with what the otaku understand as faithfulness.\n\nThere is an aesthetic approach to adapting anime into live action, and that is to just replicate the cartoons with real people made of flesh and bone. This is often disastrous because when dealing with different mediums a translation between those is necessary. I believe that the reason why studios do things like this is because they want to please the dorks and dorks are afraid of change. Anime audiences are not exactly full of folks with high standards on artistic quality but they still will have an obsessive approach to the source material, regardless of how trashy it is.\n\nLet’s illustrate how this approach fails with an example. This is videogame and anime character Phoenix Wright:\n\n- [*Naruhodō Ryūichi if you are a weaboo*](http://sm.ign.com/ign_latam/news/p/phoenix-wr/phoenix-wright-ace-attorney-6-release-date-announced_dj3g.jpg)\n\nAs cartoons go there is nothing odd about him, he is a conventionally drawn guy in a suit, and that makes sense because as a cartoon the only goal of his design is to convey that he is a lawyer. When you look at him you see a perfectly ordinary young professional in a nice suit.\n\nThis is live action Phoenix Wright:\n\n- [*Objection!*](https://i0.wp.com/www.deculture.es/wp-content/uploads/2011/10/phoenix-wright-ace-attorney-live-action.jpg)\n\nI ask you. What does that design convey? What does it tell you about the character? That he is some kind of clown? That his barber hates him? He and the rest of the cast looking this ridiculous serves no other purpose besides pleasing the otakus that demand absolute “faithfulness”, even though the result is not faithful at all. What originally was a story about a normal looking guy becomes a tale about a ridiculous looking character.\n\nI don’t know if there is an industry that can produce a proper anime live-action adaptations reliably. The two more promising industries keep falling in similar traps every time and they do so in order to please audiences that are unlikely to change. Maybe someday a French studio will try to adapt Cowboy Bebop or something.\n\nAt the end of the day Black Swan is a least a decent homage of Perfect Blue.",
        "created_utc": 1518787852,
        "upvote_ratio": ""
    },
    {
        "title": "Starting an Irish film collective",
        "author": "Joelman78",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xycxj/starting_an_irish_film_collective/",
        "text": "I've always wanted to make films since I was 12 years old but I could never find the recources,time or people to help me form my vision,so I wanted to reach out to other people to see if any was interested in joining my collective so we could learn and grow in the film industry together.The only requirements are that you need to live in Ireland(so we can work together and you need to be between 15-21(since I'm 15).",
        "created_utc": 1518783536,
        "upvote_ratio": ""
    },
    {
        "title": "*2 Or 3 Things I Know About Her*: The Beauty Of Coffee",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xxbod/2_or_3_things_i_know_about_her_the_beauty_of/",
        "text": "[deleted]",
        "created_utc": 1518768248,
        "upvote_ratio": ""
    },
    {
        "title": "\"With \"The Killing of a Sacred Deer\" Lanthimos and Fillipou became victims of their own cinematic uniqueness\" - A critical, long and indepth review of The Killing of a Sacred Deer.(Translated)",
        "author": "ILoveBurnedPotatoes",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xwmzn/with_the_killing_of_a_sacred_deer_lanthimos_and/",
        "text": "A read a very interesting [Greek review](http://www.elculture.gr/blog/article/%CE%B7-%CE%BC%CE%B1%CF%84%CE%B9%CE%AC-%CF%83%CF%84%CE%B7%CE%BD-%CE%BA%CE%B1%CF%81%CE%B4%CE%B9%CE%AC/) on The Killing of A Sacred Deer and i wanted to see what you guys think because i more or less agree with the author. Sorry for any mistakes.\n\n-------------------------------------------------\n\nThe Killing of A Sacred Deer starts as intensely as it could: A beating human heart. An open heart surgery. The camera is slowly wandering away from the heart, observing from an increasing distance. Already, from the first scene of the movie you can begin to wonder if Lanthimos and Fillipou mean Black-White, black alone, mean black and white together, all the shades in between, in general, what exactly they mean. Already, you start wondering if they testify what they want to be as a cinematic duo or if they are commenting on the way others perceive them: is or isn't their signature their surgical approach on the human heart, the incision on the depths of the heart with a clinical way, the counterpoint between extreme sentimental moments and their undermining way of escape?\n\nThe way in which the heart is beating has something magnificent, something violent, something even sexual. Our ears listen to classical music, we listen to \"Jesus Christus\" and if there is some job that can be described as divine on this planet it isn't that of the director or any artist, but that of a surgeon who on his table has the jurisdiction of life and death, the surgeon's who if he does everything well you ll live, but if he makes a mistake your life ends now, with your last moment of consciousness being before your anesthesia. \n\nThe surgury ends, the surgeon walks with the anesthesiologist and they start comparing watches, discussing about the depth they can stand on the bottom of the sea, like this scene has come out of the previous films of this duo(especially from the movie \"Chevalier\" of Fillipou). Collin Farrel, who is the surgeon, talks the way he used to at \"The Lobster\". On the other hand, the rest of the cast speaks normaly. And here we can witness a change compared to the previous version of the Lanthimical universe. A development positive for me, not because i had a problem, but because Lanthimos seems to be sure that his world is finally recognizable and can work without this particular idiom.\n\nOne second change, which happens gradualy during his filmography, has to do with the music. When \"Dogtooth\" came out, we used to say: \"this is why the movie is naked when it comes to music, because in cinema music is a comment. It tells you to be emotional, tells you how to feel. Even when the music is used as a counterpoint, it again is an -out of the film- interposition to your feelings\". In this movie, music is used more intensely than ever and i don't have a problem with it either. On the other hand, i have a problem with the intense on the way it's used. We will talk about it later.\n\nCollin Farrel, is a top notch cardiosurgeon, lives at a beautiful house, has a beautiful wife and two beautiful children, one girl that just had her first period and a younger little boy. His wife(nicole kiddman) is a succesful opthalmologist and her status is slighly lower than her husband's. When they have sex, the wife is taking the stance of generic anesthesia. Here comes again, the favorite persistance of Lanthimos with depictions and their role. The man, a surgeon who has the right of death and life on the body that is under anesthesia, is transformed to a lover of a body that depicts the absolute surrender to his hands, to a lover that is obviously delighted from the idea of his omnipotence, his domination, his authority, his distinction. Likewise, the same things arouse his wife.\n\nOn the first half of the movie we also have something new in the Lanthimical universe: instead of getting since the start on a realistic or non realistic(like in the Lobster) special condition and start watching what happens and the interaction between the heroes, outside everything happens in an environment much more familiar, much more normal. There is, however, something unfamiliar in the heart of this familiarity and is the mysterious relationship between the surgeon and a 16yo boy. Something happens that we cannot pinpoint yet. When the movie finally reveales their relationship and we get into fucked up situations, we understand that ok this movie will have a central idea to play with. \n\nLong time ago, when gods were 12, a very powerful man killed a sacred deer of a Goddess. She didn't like that, was annoyed by it and decided to punish him. If he wanted to go back to his normal life as king, he should first sacrifice his child. Another god, one this time, without vengeance and pettyness, the one that is always right, great etc, asked Avraam to sacrifice his son, because he was unsure if Avraam loves and respects him. Normal stuff. In both cases, Agamnenon and Avraam had to only choose between agreeing or disagreeing. In \"Sophie's Choice\", Meryl Streep is an a more tragic fate, because he has to choose to do the unspeakable. To choose between her two children, which one will live and which one will die inside the camps of Nazi Germany.\n\nIf these things were happening in ancient tragedies, your biggest dilemma that \"The Killing of a sacred deer\" puts you in, would be if you choose to keep watching that movie that way or the other(or both ways). Or maybe it's not about a choice, cinema itself puts you or doesn't put you in the situation and a way of reaction because of what you see. And my main problem with this movie, is that in the end, it doesn't make you horrified or amused with what happens to the heroes, the main problem is that it makes you pay no mind.\n\nIn \"The Killing of a sacred deer\", we have in a subjective way, the most dramatic thing that anyone can imagine, we have events that should beat you and we have a narration so absurb that makes you get a short. But a short, not in a good way, except if this was their goal. It is like they say to you \"look what i ve build, now look at me destroying it\".\n\nDo you want to watch the heart beating? Let's watch it. Let's kick the sentimentalism inside the bin? Let's kick it. The \"think-feel\" is not a dipole. It's not the one or the other. They are both notional, together. And this \"notional\" was achieved in \"Dodtooth\" and \"The Lobster\". Here, not only the \"i feel\" is cut willingly or unwillingly so much that it kicks you out, but even when it comes to \"i think\", the main idea i am not exactly sure what it tries to say. With \"Dogtooth\" we could talk about opression, with \"The Lobster\" we could talk about how society pressures you how to find a partner, but with this movie i am not sure what we can talk about. For divine justice? For punishment? For catharsis? For the choice of what you could sacrifice? \n\nAll these end up in something much more fundemental: Should we believe everything that happen in front of our eyes? Is the surgeon real? Is the boy real? Is the family real? If the creators of the movie don't want to exist in reality, if they want to exist or not exist, if their goal is to exist or not exist, then fine but whatever i say this particular movie didn't win me over. But the heroes of \"Dogtooth\" and \"The Lobster\" exist, breath and live. All the things that happen in our lives, are happening while -and because- they are alive and real in their own universe. And if we can talk about the music, it tries to contribute to the ambiguity of the shocking scenes, but ends up surrendering to them and make them grotesque. If this is a metaphor, AND ONLY, if you are not really bitting yourself Barry Kegan(whose performance is excellent), why should we really care?\n\nI am afraid, that with this movie, Lanthimos and Fillipou became victims of their own cinematic uniqueness. They have built their own cinematic universe and they are constantly trying to develop it further. Because they are extremely important artists, they first talk with the vision they have about the cinematical language and cinematical contract and with noone else. The cinema that they have built, even in its failures it remains innovative and genius. Total respect to a movie that in the end kicked me out. ",
        "created_utc": 1518758897,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone on Letterboxd?",
        "author": "Hi_M0m_",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xvlak/anyone_on_letterboxd/",
        "text": "Hey guys! I just recently joined this community and I've really loved being able to read the analysis and discussions that are taking place here.  \n\nI'm wondering if any of you guys have Letterboxd accounts that you remain active on.  I like to be able to see what everyone is watching so I am exposed to movies I might not otherwise hear about or decide to watch.  I'm fairly active on mine, so you can feel free to follow me as well if you'd like.  My username is JakeAdams.  I don't write many reviews, as I understand that nobody really cares too much what I have to say about a movie.  The ones I do write are more for myself as I look back and think more about the films.",
        "created_utc": 1518747333,
        "upvote_ratio": ""
    },
    {
        "title": "Is it Ever Good when Movie's Appear like 1 Genre and are Really Another?",
        "author": "LalkGhirken",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xv6xq/is_it_ever_good_when_movies_appear_like_1_genre/",
        "text": "This is my first post here, I hopefully am doing it right.\n\nI was wondering if there are any movies that appear like a comedy or romantic comedy, basically seem like they will be light hearted watching and then actually are something else, and turn more deep as it goes on?\nLike basically surprising the audience as it goes on?  I was thinking it might be kind of neat to make a script that seems like a romantic comedy but then turn more serious as it goes on?  Intentionally tricking the audience.\n\nAlso another related question, I know M. Shyamalan had poor reception in The Village because everyone was expecting a horror but it was something else, and that just caused disappointment I think.  \nBut have any movies done this where it seemed like one genre but then turned out it was something different, like in The Village, except the surprise has gone over well with the audience?  And not merely come off as annoying. \n\nThanks for any help, this reddit is a great resource as so many very informed on movies here.      ",
        "created_utc": 1518743352,
        "upvote_ratio": ""
    },
    {
        "title": "A Ghost Story: How it rejects nihilism and why I think it’s the best film in recent years",
        "author": "robotfunkychicken",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xugkx/a_ghost_story_how_it_rejects_nihilism_and_why_i/",
        "text": "A Ghost Story is my favourite ﬁlm of the past few years and maybe ever. It is the most simply beautiful little movie. It is heartbreakingly sad and profoundly touching. It is a ﬁlm of quiet, sombre reﬂection punctuated by moments of loud, yearning connection between people. There are endless ways to talk about the ﬁlm.\n\nI’ll talk ﬁrst about its wonderful formal aspects. Its cinematography is sparse and clean. Despite a boxed-in aspect ratio (1.33:1) each space we’re in feels open. It feels lived, and never claustrophobic. Shots are deep, frames-within-frames are commonly used, to enhance the feeling of being stuck in a place. Sometimes the shots are straight out of the horror genre. Slow tracks forward, as if something will be revealed or a fright is coming. But it seldom is. Often, it’s simply illustrating the notion of being watched. Pulling us into the slow steady pace of watching and observing life at its simplest.\n\nWhat’s interesting too, is the idea of in-between places, often called interstices. The feeling of dislocation or not belonging because the space you are in - an elevator, a hotel, a new city, an airport - is in between the normal spaces people inhabit. The Ghost inhabits a singular, lived-in, space. One that doesn’t shift or change position. However, it is the temporal aspect of this he is in-between. Instead of being dislocated by space, it is time that separates him from the things he ﬁnds connection with. Upon ﬁrst passing away, his partner stands with his body in the mortuary for a short time. She pulls the sheet back over him and leaves. We wait, for maybe 3 full minutes until the ghost rises up, taking the sheet with him. We can’t help but wonder what would have happened if he’d risen while she was there. \n\nThe problem continues and time becomes an elusive force that The Ghost can’t seem to get a handle on. At points, it almost stops still. Often this is at the simplest of moments. In a daringly edited scene, Rooney Mara’s character eats an entire chocolate pie in a single take. She is grieving, she sits down and in her numbness tries to ﬁll some sort of void. But I’m going to stop trying to explain grief with words, I don’t believe it can be done. The scene stretches from absurd to profound. It is mundanity given meaning. Grief given explanation, in a way dialogue and language simply can’t. It lasts an entire 10% of the ﬁlm’s runtime. It is polarising too, either for you or not. Either is ok. These moments of stopped time are often the simplest ones. They are normal life, nothing special but all are about connection or the loss of it. In the most intensely emotional scene of the ﬁlm, Rooney Mara listens to her partner’s song. Intercut with her past listen to it, she ends up feeling closer to him after his death than when she was listening to it during his life. It’s heartbreaking but also beautiful. It’s something I’ll repeat later in this article, but to drive it home; these moments are made beautiful and impactful and important because they are temporary. That is why we must treasure them when they exist.\n\nWith these pauses in time, in which we ﬁnd meaning, we are also cast adrift as time loses its rigidity and predictability. This often happens when the ghost becomes concerned with place instead of people. Taken by some detail of the house, the people inhabiting it slip past as he loses his connection with them. Time speeds up to incomprehensible speed, but in the most eﬀectively understated way, either without cut or with a continuity edit that makes it seem inevitable, and entirely natural for the ghost. It’s intensely sad to watch. \n\nI think cinema is the greatest medium for communicating this, too. Andrei Tarkovsky described the art of ﬁlmmaking as ‘sculpting in time,’ and all the best ﬁlms do this. A Ghost Story has mastered this, using time to create the emotional journey and make it all the more poignant. Time is the in-between space, the purgatory The Ghost inhabits, his conﬂict zone and his protective circle all at once. Somewhere he shouldn’t be if he wants peace, but somewhere he wants to be to stay connected. As he loses that connection, he realises the ﬁlm’s overarching lesson, it’s statement, it’s philosophy. That everything must and will end, but as the moments pass we must experience them and let them go, to preserve their beauty.\n\nTo me, this is a ﬁlm about our connection to people and to places. About our legacy and what we leave behind when we’re gone. It’s about the ripple eﬀects of memory and thought that stretch backwards and forwards across time. I believe, in my own way, that it is a ﬁlm that aﬃrms life and rejects wholeheartedly any nihilistic philosophy - the idea that our existence here is meaningless.\n\nSo let’s talk about that for a second. As time progresses and the ﬁlm starts ﬂickering forwards, we halt suddenly during a party where a man, the Prognosticator, waxes lyrically about the pointlessness of life. It’s an on-the-nose, pretentious rant, and compared to the rest of the ﬁlm, much too clear and pointed to ﬁt properly. He talks about humans attempts to leave some memory of themselves, to leave a legacy in an attempt to live on in some way. He continues on, to talk about how our art and our creations and our bodies and everything eventually fades, as the heat death of the universe occurs. It’s a depressing thought. Lowery himself has stated that it’s a concept he was struggling with at the time. If taken at it’s base level, literally and representative of the philosophy of the ﬁlm, then it’s a childish scene that spells everything out for us, insulting in its obviousness and preachy context.\n\nBut I don’t think of it at that level, for a couple of reasons. At the narrative level, The Ghost reacts in anger to the speech, causing the lightbulb to ﬂicker with his rage - he’s shown to aﬀect the material world when feeling strong emotions - as he obviously disagrees vehemently with this. His existence alone (at this point in the ﬁlm) is in direct opposition to that sort of nihilism. For another reason too, do I think of the ﬁlm as disagreeing with the point of the speech. And that’s because of the existence of the ﬁlm itself. The very fact Lowery wrote, directed, edited this piece is enough to tell us that he doesn’t really believe it’s pointless to create, or at the least that he can’t believe it. The ﬁlm spends most of its time showing us the various attempts to live on, to leave part of ourselves in the places we inhabit. In one scene, a Pioneer’s daughter leaves a small note under a rock, humming the same melody the man uses in his song (I Get Overwhelmed - Dark Rooms). In the next shot she is dead, and in the following ones she rots and becomes part of the earth. So, does her attempt to leave part of herself at that place work? Is there a point? Does it matter? Yes. Yes, it does. It matters because someone witnessed it. Because it brought her comfort and because that tune, that humming melody continues for hundreds of years into her future, circling back to that place again as the man writes his song. \n\nThe Prognosticator seemed to think that because we can’t leave behind anything forever, with ‘forever’ being the operative word, that it doesn’t mean anything. But he’s wrong. Nothing lasts forever, but our connection with others and communication between each other does have meaning, I think directly because of its transiency. The Ghost eventually discovers his purpose, comes to some sort of understanding of why he is there and upon reaching that at the end of the ﬁlm, his story comes to an end, giving closure. But just because his story ends, and will fade with time doesn’t render it meaningless. Audiences will continue to watch the ﬁlm. Until one day when it is never watched again. Until it is never remembered. But it had an eﬀect, on us. Here. Now. That’s the meaning and point that we can take from it. We can alter the experiences of those around us. Alter them for the better. So, why not?\n\nThe film absolutely rejects nihilism, I think. \n\n\n\nThis being from a recent article of mine, I’d be remiss not to plug our website [Filmosophy](www.filmosophy.co.uk) here, if you want more discussion like this on cinema.",
        "created_utc": 1518736520,
        "upvote_ratio": ""
    },
    {
        "title": "Embrace of the Serpent (El Abrazo De La Serpiente) 2015",
        "author": "Akushapeshifter",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xu9kt/embrace_of_the_serpent_el_abrazo_de_la_serpiente/",
        "text": "I’m surprised I couldn’t find a discussion thread for this film. It’s just great. \n\nShot in black and white, *Embrace of the Serpent*, is a reverent adventure movie that details many lost cultures along the Amazon. It is based on a travel book by German scientist, Theodor von Martius. More importantly, it contains the only written evidence of these lost cultures. I must say the film takes it content seriously. The tone and setting in the Amazon are heavy. The exchanges between a dying German scientist witnessing the effects of the rubber industry on an ancient land are unrelentingly sacred and somber. Despite the devestation, the oppressors or the “whites” are never shown. Dead bodies, mutilations, and madness are on full display but from the perspective of its victims and inhabitants. Which is just perfect  because *Embrace of the Serpent* tells its audience that it was a travesty we decimated this civilization. We could have learned so much.\n\t\n\nOur guide, Karamakate, takes us through the Amazon in two timelines. He is one of the last members of a declined amazonian tribe. In his youth he was forced into a Catholic Mission but escaped largely surviving on his own. The catholic desire to banish heathen culture and unlearn pagan tongues is still fresh Karamakte’s mind.  As a man he guides von Martius and his travel companion, Manduca (a rubber plantation slave freed by Theodor) to a plant (Yankruna) that can cure him of his fatal sickness if the scientist helps him truly find the tribe he was separated from. \n\t\n\nBut the journey of the past is fraught with hatred of white men and the perverse ways indigenous peoples are severed from their ancestry of all which culminates in Karamakate destroying the plant of his people and condemning the German scientist to death despite being told in visions to protect him. However, years after this travel book is published another German scientist comes searching for the rare plant. Again, this journey is guided by Karamakte who seems to be drifting without purpose in his old age. Despite, the scientist’s ulterior motives the two work together and Karamakte realizes it his job to teach the scientist the ways of his people. As it is the only way to preserve his people.\n\t\n\nLastly, I can’t speak to the technical difficulties of filming on the water but it was handled gracefully as most of the movie takes place, ostensibly, along the Amazon river. The Amazon so frequently depicted as a serpent weaving through an unforgiving green inferno becomes something like the gospel in black and white. The natural current of the water guides these characters on a spiritual path. A path where belief is rewarded with truth. And tangible evidences are rewarded with struggle. It entreats them to surrender their baggage to follow a lost way. A way that can only be found by those who want to listen.  ",
        "created_utc": 1518734760,
        "upvote_ratio": ""
    },
    {
        "title": "Paris, Texas and Modern Life",
        "author": "[deleted]",
        "url": "https://theboronheist.wordpress.com/2017/10/01/paris-texas/",
        "text": "[deleted]",
        "created_utc": 1518730264,
        "upvote_ratio": ""
    },
    {
        "title": "How Paulo Sorrentino's Picaresque storytelling and small details conveys memory",
        "author": "Gobblignash",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xtqaj/how_paulo_sorrentinos_picaresque_storytelling_and/",
        "text": "I wondered for a while about describing it as \"picaresque-esque\", but that would've pleased me too much and one should be restrained in those sorts of things.\n\nAnyways, if you've watched one of Sorrentino's more modern films, especially *The Great Beauty* or *Youth*, one thing which won't stick out of your mind until you rewatch them is his insistance of devoting minutes of screentime to simple background characters or irrelevant side characters, giving them a minute or two to shine and then discarding them for the rest of the film. This isn't one of those things where you can name one or two examples, The Great Beauty is *full* of this, as in it's pretty much the entire film.\n\nThese \"little details\" can range from a character being a pivotal point in several scenes to then go immediately, to a random [singer](https://www.youtube.com/watch?v=plG2KDit-Kc) with a plastered leg appearing only a few seconds, seemingly unnecessarily. There are hundreds of uses of what I can only call as reverse-proxy character (a proxy character being a random sidecharacter displaying what emotion you should be feeling. He's impressed = what he just saw is impressive, he's scared = what you just saw scared him and people like him), where their reaction shows more about them and the mindset those people are in, rather than anything about what you're actually watching.\n\nI put \"conveys memory\" in the title because aside from creating and incredibly charming, creative and cohesive world, this has the effect of displaying the film as a sort of reel of ones memory when looking back at life (which fits perfectly thematically with the aging main characters of *The Great Beauty* and *Youth*). You might not remember everything all that coherently, and sometimes very slight completly irrelevant details just get stuck in your head. You remember the Singer with the plastered leg, you remember the Monk who everyone thought could levitate, the strange girl who, screaming, threw paint at a canvas, the neighbour who turned out to be a dangerous sought after criminal and your attempt to make smalltalk with him in an elevator. Even the most distressing moments of your life, you might not remember your significant other dying, but you might remember a random sad walk through a cafe the day after and how everything passed by in slow motion.\n\nThis, above anything else, is the appeal of Sorrentino's films and *The Great Beauty* above all, it genuinely manages to capture memory in such a visual acuity it becomes profound all its own, and is amazingly humbling.",
        "created_utc": 1518730225,
        "upvote_ratio": ""
    },
    {
        "title": "Modern Cinema and suspension of disbelief.",
        "author": "Lucianv2",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xt1v6/modern_cinema_and_suspension_of_disbelief/",
        "text": "I just got to see Bergman's \"The Seventh Seal\" for the first time(also my first Bergman film) and I thought it was pretty great. However, the discussion isn't about that. When I was reading Roger Ebert's analysis/review of the movie, I came upon this quote that I found fascinating. \n\n&gt; A knight returning from the Crusades finds a rude church still open in the midst of the Black Death, and goes to confession there. Speaking to a hooded figure half-seen through an iron grill, he pours out his heart: \"My indifference has shut me out. I live in a world of ghosts, a prisoner of dreams. I want God to put out his hand, show his face, speak to me. I cry out to him in the dark but there is no one there.” The hooded figure turns, and is revealed as Death, who has been following the knight on his homeward journey.\n\n&gt; Images like that have no place in the modern cinema, which is committed to facile psychology and realistic behavior.\n\nIt got me thinking, if there is indeed less and less of that kind of imagery or \"mood\" compared to early cinema.\n\nSome might say that there is indeed a decline of that kind of imagery where for example Death has a physical presence, or like in David Lynch's Eraserhead where the baby is not human, or hell, I can't imagine something like E.T being released today and doing as good(yes I know this argument is very flawed but still).\n\nBut this isn't stricly about \"imagery\" either, it can be about subtle things, like the \"mood\" of a film. Last week I got to see \"The doublelife of Veronique\", and while I wasn't necessarily the biggest fan, I appriecieted it for what it was, and I really enjoyed the atmosphire that it created. Some other examples can also be such as Fellini's 8 1/2, where the film weaves between reality and fantasy. \n\n Perhaps the general public's suspension of disbelief is indeed growing less and less, but I'm still not sure this isn't just a case of having the *hignsight* of decades when judging \"classics\". I mean, just last year we got a film where the ghost of a dead person, in a sheet got to observe how life moves on without his presence after his death in **\"A Ghost Story\"**, and that was my second favourite movie of last year.\n\nWhat is your personal opinion on the matter?",
        "created_utc": 1518724686,
        "upvote_ratio": ""
    },
    {
        "title": "Must see movies by certain directors/genres? I want to watch 5-7 movies per week to expand my catalog and knowledge.",
        "author": "GryffinDART",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xsmy7/must_see_movies_by_certain_directorsgenres_i_want/",
        "text": "[removed]",
        "created_utc": 1518721314,
        "upvote_ratio": ""
    },
    {
        "title": "The TrueFilm Weekly Plug. Post your blog, site, channel, podcast or profile right here. Week of (February 15, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xqjs7/the_truefilm_weekly_plug_post_your_blog_site/",
        "text": "This is the one and only place on the TrueFilm frontpage where you are allowed, and even encouraged, to promote yourself. If you have a blog, a YouTube channel, a Twitter account, a podcast, or film that you'd like us to see, plug it here, and only here.",
        "created_utc": 1518703556,
        "upvote_ratio": ""
    },
    {
        "title": "I never laughed at horror before The Cremator",
        "author": "visionagainstboredom",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xqhqq/i_never_laughed_at_horror_before_the_cremator/",
        "text": "This movie caught me completely off guard. At the beginning I was almost completely uninterested by the pseudo philosophical speeches that the main character made, it felt even too boring to be insane. The cinematography kept me going though, there is this bizarre editing, with flashes, fast cuts, and sometimes the transitions are confusing. But brilliant nonetheless. At one moment you listen to the main character saying some speech about the transcendence of soul and how by cremating the body the soul goes into the ehter and in the next moment he continues his speech in a totally new place and circumstances. I found these transitions to successfully convey his fragmented stream of consciousness. He truly believes that by cremating a body, you free the soul.\n\nThe score is astounding, it adds so much more to the movie, the contrast between the b&amp;w, the editing and the eerie score make the movie pretty uncomfortable and macabre but, I also found very amusing. This entertained me so much more than a sole labeled comedy.\n\nThe movie reaches uttermost originality and creativity, but it also goes deep under your skin and fills you with horror, paranoia and insanity. It's foreshadowed by the invasion of the germans in WW2 and the whole subplot gives you hints of what might happen.\n\nBut nothing will prepare you for the ending, which found me laughing in awe and horror. Amazing.\n\nI'd love to hear your thoughts of it. It's my favorite movie from last year.",
        "created_utc": 1518702990,
        "upvote_ratio": ""
    },
    {
        "title": "Marrying as the four wife of a nobleman in a household full of tension and jealousy - presenting Yimou Zhang's Raise the Red Lantern",
        "author": "The_Social_Introvert",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xqf05/marrying_as_the_four_wife_of_a_nobleman_in_a/",
        "text": "To see a video version of my thoughts of this film, see here:\n\nhttps://www.youtube.com/watch?v=oD6O1PD41No\n\nFor a short write up (no spoilers):\n\nRaise the Red Lantern is an early offering from director Yimou Zhang, who would later go onto make pictures like Hero and House of Flying Daggers. It concerns a 19 year old university student in early 20th century China who’s forced to drop out from her studies after her father’s death causes her family to be subject to poverty. She makes the choice to marry into a wealthy family to a nobleman of some sort, as his fourth wife. We never really get a good look at her husband, known around the household as ‘the master’. Embodying the lack of closeness our protagonist Songlian has with him, he’s either seen with his back towards the camera or from afar. All we know about him is he’s loaded, with the abundance of furniture, lights, massages etc in the wives’ homes symbolising the safety these woman have with being with a man with such a lofty status, and the barren courtyard a clear reminder of what their status would be like out there in the world, but also a reflection of the emptiness of their own lives. The husband’s detachment matters not, because the film isn’t about him and is more concerned with the four wives, and their schemes and psychological plots to discredit each other and win the master’s favour. Tension and jealousy is rampant throughout the household, and sometimes coming from places you’d least expect. \n\nThe title refers to the red lanterns which are raised every night outside one of the wives individual homes, after the master chooses which house he wants to stay at for the night. \n\nWe never step foot outside of the family’s manor from the moment the film begins. This house, a prison for Songlian – she’s trapped by the strict family traditions and social boundaries that despite her education amount her to just another concubine for the master. It’s terrible for her, but not so bad for us as the viewer because staying inside the housing complex is a visual feast. The vibrant colour of the red lanterns against the backdrop of the dim night sky, or the gorgeous building architecture waking up with the early morning sun – it’s such a good looking movie. And it’s captured so elegantly by the camera, whose placements and movements are precise and deliberate. The shots linger, too, allowing the beauty to sink in and impress. For sure the first thing you’ll notice about the film is how good looking it is. Aside from one instance of a hand held camera scene (necessary for a particular tense part of the movie) the way this film is shot gives the film a graceful aura, an atmosphere of sophistication and class. \n\nClass is not a word you’d use to describe the characters however. The first wife, or the “first sister” is old and aging. She pretty much keeps herself to herself, occasionally pitching in to mention traditional family customs to those otherwise uneducated, but she more or less is out of the game. She is well aware her time as an attractive source of happiness for the master is long gone and plays no part in the back stabbings and plotting that goes on around the manor. The second sister is immediately open and warm to Songlian upon her arrival, swapping clothes and stories with her. She’s like everybody’s favourite aunt, approachable, always smiling and seeing the best of a situation. The third sister, a former opera sister, is an open enemy for our protagonist. She’s sneering, spoilt and calculating, doing everything she can to divert the master’s attention away from his new wife. The maid that Songlian is assigned, Yan’er, is also worth mentioning, fiercely jealous and resentful that Songlian was chosen as the fourth wife and not her. And it may seem stupid to you and me that Yan’er even thought she had a chance, being a maid, but I guess that really is the essence of her character – that she dares to hope, dares to dream. \n\nThat’s all not to say Songlian is an angel, far from it. The fourth sister is in contention to be considered the bitchiest character in the movie, doing her fair share of scheming and plotting of her own. In her defence, she only attacks when provoked, but she does make a fair few blunders along the way that get all the wrong people into severe trouble. \n\nSome have said that Raise the Red Lantern in an allegory for the Chinese communist regime. Whether it is or not I can’t say as I don’t have expertise on the matter. All I know is the film was an entertaining two hours spent. The conflicts, the betrayals spiral to a tragic conclusion that hits you hard when it finally comes, after a slow, delicate, deliberately-paced and Shakespere-esque examination of a woman bound, unable to escape except though madness…or death. 8/10. \n",
        "created_utc": 1518702181,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't Paul Thomas Anderson's films typically break even at the box office, while the Coen Brothers' films generally shoot well past breaking even?",
        "author": "AmadeusCrumb",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xoydp/why_dont_paul_thomas_andersons_films_typically/",
        "text": "Can't just be the star power can it?  Or the appeal of the Coen Brothers?  I'd say people who tend to want to see Coen movies probably are buying tickets for PTA's films.  It just seems that PTA's only real successes, financially, were Boogie Nights and There Will Be Blood (and maybe Magnolia, if you go by some numbers over others).  The Coen brothers virtually always make a profit.  Your thoughts?  THanks!",
        "created_utc": 1518680901,
        "upvote_ratio": ""
    },
    {
        "title": "Standards too high? Taste too peculiar? A post on why I am falling out of love with film.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xo5q6/standards_too_high_taste_too_peculiar_a_post_on/",
        "text": "[deleted]",
        "created_utc": 1518670138,
        "upvote_ratio": ""
    },
    {
        "title": "\"Like Me\" (2018) and the relationship between audience and film",
        "author": "T-Humpy",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xlowk/like_me_2018_and_the_relationship_between/",
        "text": "I had the opportunity to watch Like Me recently, and I must say that I enjoyed it. The schizophrenic editing of the trailer peaked my interest,  and I was not disappointed. Many sequences were playfully edited, free from convention and reveling in the power of visuals without concern for much of a plot.\n\nRegardless, what caused the film to stick with me was how it explored the relationship between the audience and the film. Early in the second act, there is a scene in which Kiya, the protagonist, opens her car trunk containing Marshal, the motel manager whom she has abducted. She looks into the camera which is positioned from Marshal's perspective in the trunk and invites him into the car, saying something like \"If you're coming with me, we might as well get to know each other.\"\n\nAt this point, it seemed pretty clear to me that the fourth wall had been broken. We are to understand Kiya as the film (or modern media itself, abstracted even further) and we are to identify with her victims, especially Marshal. There are four victims, total, that I remember. Here are my thoughts on each.\n\nFreddie, convenience store employee:\nFreddie is her first victim. At first he is wielded out, then completely disinterested, trying to ignore her. Eventually, he succumbs, making a fool out of himself. (At least in the eyes of the world) Perhaps this is exploring how impossible it is to remain sane with the amount of observation we experience through media today. I remember, as a child, realizing how I was incapable of behaving normally when I knew I was being filmed or audio recorded. Today, our lives are constantly being recorded in some way through media. The mere anxiety this causes makes it difficult to live normally. Eventually we break down, giving the media what it wants, a spectacle.\n\nThe old vagrant with the shopping cart:\nHe is also uncomfortable with being filmed. However, he is eventually able to escape. Because he is an outlier to society, it is much more difficult for media to entrap him.\n\nMarshal, the motel manager:\nI identified with him the most. His involvement with Kiya was completely voluntary. He made a devious choice the meet with her for underage sex. This makes him the perfect victim because he is complicit. Similarly, we as the audience are complicit in choosing to attend a film such is this one. At first, he is repulsed as she force feeds him, eventually vomiting. As a viewer, I realize that the things I'm viewing on screen are repulsive, but I am also entertained by them. I could stand up and walk out of the theater, but I won't. When Kiya breaks the fourth wall, the film invites the viewer to get comfortable. You are complicit, you are along for the ride, now let's get to know each other. As the Stockholm syndrome began for Marshal, I really started to enjoy the film and revel in its perversion. The fact that Kiya was a reprehensible character with virtually no redeeming qualities didn't bother me. I was just glad to be along with her for the crazy ride.\n\nBurt, internet critic:\nFinally, we have Burt who seems to represent the audience member who might display a kind of self-righteous condemnation of the film. However, Burt is getting off on Kiya's work in his own way. Eventually, she wins, killing him. This seems to imply that, no matter how much you protest, the perversions of modern media will both seduce you and outlive you.\n\nThere was a lot more food for thought in this film, but I was curious what others think about the relationship between the audience and the film/modern media.",
        "created_utc": 1518645439,
        "upvote_ratio": ""
    },
    {
        "title": "Help remembering a film.",
        "author": "fatbobcat8",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xlnjd/help_remembering_a_film/",
        "text": "[removed]",
        "created_utc": 1518645120,
        "upvote_ratio": ""
    },
    {
        "title": "How does one digest art films? What context should I work in?",
        "author": "DepressToImpress",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xiljj/how_does_one_digest_art_films_what_context_should/",
        "text": "So I was recently introduced to this visual artist Takashi Ito and I was thoroughly amazed by his body of work (particularly Spacy). It got me thinking though, as I was watching one his short films, how exactly am I suppose to interlock with it? Like I wouldn't consider myself a complete stranger to art films. I've watched a good amount like the classic Salò, or the 120 Days of Sodom, to Black Moon, some silent films like Age of Gold, etc. But the problem I'm having is that art films usually come in two categories: 1) The more narrative driven, \"classic\" (note the quotations on classic) way of movie making with a definitive train of thought (e.g. Haneke, Tarkovsky) and then the more abstract pieces which are difficult to decode or understand in any meaningful way without some degree of knowledge about the context of the film itself or someone explaining it to you piece by piece. Example of the latter is, say, the film Vase de noces which is incredibly difficult to ascertain, and ends up being very random-like. In this movie there's a scene of a man engaging in sex with a pig...the symbolism escapes me (lol). Unlike something like The Holy Mountain wherein I can comprehend what's being said (more or less) even without prior context. But Vase de noces I have ZERO clue what the point of it is. And here I return to Takashi Ito. I enjoy his films in a stylistic manner, and even on a technical level, but in terms of the \"spirit\" of the film I fail to engage with it in any real way. This is mostly due to the very abstract nature of his work. My issue is I have no context to work with.\n\nIs it simply I am suppose to project my own thoughts and ideas into a piece? Or does watching these kinds of art films require some kind of stock knowledge I'm unaware of? Because I would like to experience these types of films in a non superficial level.",
        "created_utc": 1518620689,
        "upvote_ratio": ""
    },
    {
        "title": "Yi Yi by Edward Yang",
        "author": "kurt9633",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xic9q/yi_yi_by_edward_yang/",
        "text": "[removed]",
        "created_utc": 1518618372,
        "upvote_ratio": ""
    },
    {
        "title": "Starting a Irish film collective",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xiazl/starting_a_irish_film_collective/",
        "text": "[removed]",
        "created_utc": 1518618056,
        "upvote_ratio": ""
    },
    {
        "title": "It's Your Fun &amp; Fancy Free Discussion! (February 14, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/7xi7ki/its_your_fun_fancy_free_discussion_february_14/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nFun and Fancy Free threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; you can even discuss tv here! Lurkers, this and our Slack team are *the* places to introduce yourself.\n\n##Sign up for the TrueFilm Slack team [here](https://whispering-temple-35722.herokuapp.com/). Our team page is [here](https://truefilmreddit.slack.com/).\n\n###Follow us on:\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) ([fellow TrueFilm users](https://www.reddit.com/r/TrueFilm/comments/3th7st/anyone_here_use_letterboxd/))\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n- [Criticker](https://www.criticker.com/profile/rTrueFilm/)\n\n- [Facebook](https://facebook.com/TrueFilmReddit/)\n\n####The sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1518617180,
        "upvote_ratio": ""
    }
]