[
    {
        "title": "Teach Strategy Ruin A Life?",
        "author": "AsTrueGamer",
        "url": "https://www.reddit.com/r/truegaming/comments/7m8vsv/teach_strategy_ruin_a_life/",
        "text": "So gaming is notoriously anti-intellectual and toxic with the endless childish power fantasies but every rare once in a while you might find - on these forums at least - someone asking how to improve compared to their peers.\n\nWhat if not using strategy or thinking critically - about anything - is the one thing keeping them happy.\n\nAnti-intellectualism is by definition a choice and how else can you possibly explain someone dying to the same boss in the exact same way 2X or 100X as they do all too often on the scene.\n\nIt's sobering to think that you might ruin someone's life and steal their ignorant bliss through gaming, or any conversation really. Critical thinking is a constant for some. Is it really so wrong? Maybe it's like the Radiohead: Just video.",
        "created_utc": 1514308012,
        "upvote_ratio": ""
    },
    {
        "title": "Why buy surround headphones when there's free apps to do the same?",
        "author": "Tinna007",
        "url": "https://www.reddit.com/r/truegaming/comments/7m8qy4/why_buy_surround_headphones_when_theres_free_apps/",
        "text": "[removed]",
        "created_utc": 1514306669,
        "upvote_ratio": ""
    },
    {
        "title": "TOP 10 Best MMORPGs Games You Must Play with no Excuse",
        "author": "ntselvan1989",
        "url": "https://www.reddit.com/r/truegaming/comments/7m8ili/top_10_best_mmorpgs_games_you_must_play_with_no/",
        "text": "[removed]",
        "created_utc": 1514304222,
        "upvote_ratio": ""
    },
    {
        "title": "Any good wild west / old west games?",
        "author": "UneBaguette2616",
        "url": "https://www.reddit.com/r/truegaming/comments/7m8fd5/any_good_wild_west_old_west_games/",
        "text": "[removed]",
        "created_utc": 1514303264,
        "upvote_ratio": ""
    },
    {
        "title": "Why LoL is very hard game nowadays than Dota 2?",
        "author": "MarvyL",
        "url": "https://www.reddit.com/r/truegaming/comments/7m844p/why_lol_is_very_hard_game_nowadays_than_dota_2/",
        "text": "I've been played LoL since 2010 until now but from 2015 - 2017, the game went too hard and some players complaining about the OP champions and buff. And then here comes Dota 2, the game is very hard since 2012 - 2014 but then Dota 2 is quite easy today.\nHow come this both game being reverse?",
        "created_utc": 1514299679,
        "upvote_ratio": ""
    },
    {
        "title": "Hello, redditors. I am JC. I recently upload a gaming content in my newly channel. If you would like to check it out, I provide a link. Feel free to comment too :)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7m7zza/hello_redditors_i_am_jc_i_recently_upload_a/",
        "text": "[removed]",
        "created_utc": 1514298221,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a self-taught developer working on my 1st game, an innovative and challenging Renewable Energy Tycoon, care to give you me your feedback?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7m7gp6/im_a_selftaught_developer_working_on_my_1st_game/",
        "text": "[deleted]",
        "created_utc": 1514290362,
        "upvote_ratio": ""
    },
    {
        "title": "I can't stop getting mad at Call of Duty! Please Help!",
        "author": "Cproductions",
        "url": "https://www.reddit.com/r/truegaming/comments/7m76h1/i_cant_stop_getting_mad_at_call_of_duty_please/",
        "text": "Hi, so recently I got back into call of duty because World War 2 came out, long story short I find myself getting so mad I punch myself, smash my desk with my fist and swear (like a lot). Before I took a break from gaming I was always top of the leader boards and found all of the Call of Duty Series fun and was also top of the leader board.\n\nNow that I'm playing again most people question why I'm getting mad (I'm usually top 3) long I'm going 45/20 kdr or like 30/12 kdr... I hold a 1.50 kdr for my account but it seems like as soon as I get over 10 deaths I'm really mad, it makes the game feel like work and never fun.\n\nI want to have fun again and go back to getting 65+ kill games on average... Please help",
        "created_utc": 1514285643,
        "upvote_ratio": ""
    },
    {
        "title": "Display vs GPU scaling and aspect ratio vs fullscreen vs no scaling",
        "author": "nobelharvards",
        "url": "https://www.reddit.com/r/truegaming/comments/7m69s6/display_vs_gpu_scaling_and_aspect_ratio_vs/",
        "text": "In the nVIDIA control panel under \"Adjust desktop size and position\", you can set the image scaling to be done on the GPU or the display, as well as 3 different scaling modes: aspect ratio, fullscreen and no scaling.\n\nhttps://d1rktuf34l9h2g.cloudfront.net/5/57/5747632d_FPVgc5K.png\n\nI've found most posts on the internet claiming display lag from these options generally devolve into a huge flame war with people listing their CS, Osu or fighting game experience with many claiming placebo and unable to tell the difference.\n\nSimply from swapping between the 6 different combinations, I can tell something has changed. Moving the mouse cursor around on the desktop is enough for me to feel it. It seems like display scaling with no scaling makes the cursor feel more \"raw\" than the other 5 options.\n\nI have not conducted any blind or double blind tests. I expected someone with a high speed camera like Battle(non)sense to have explored this already, but it does not seem like he has.\n\nCould anyone enlighten me on this topic? I feel like it would be best answered by someone with experience in Osu or fighting games with timing sensitive moves. A lot of CSGO players seem to use the \"fullscreen\" scaling mode to stretch their 4:3 resolution, without knowing the extra processing may increase input lag and mitigate any advantage from having larger stretched heads to shoot.\n\nAlso, should I tick the override setting or not? Do most games have a superior scaling option that is better than display with no scaling?\n\nThanks for reading. Any help is appreciated.",
        "created_utc": 1514269876,
        "upvote_ratio": ""
    },
    {
        "title": "Try this discord server!!!",
        "author": "_gnarsauce_",
        "url": "https://www.reddit.com/r/truegaming/comments/7m5q3c/try_this_discord_server/",
        "text": "[removed]",
        "created_utc": 1514262869,
        "upvote_ratio": ""
    },
    {
        "title": "r/gaming's bsession with GTA:V - I just don't get it.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7m5iy8/rgamings_bsession_with_gtav_i_just_dont_get_it/",
        "text": "[deleted]",
        "created_utc": 1514260200,
        "upvote_ratio": ""
    },
    {
        "title": "Why do games still have water levels?",
        "author": "Pengu_333",
        "url": "https://www.reddit.com/r/truegaming/comments/7m5fdn/why_do_games_still_have_water_levels/",
        "text": "I think it's widely agreed that water levels are the least favourite parts of anyone's gaming experience. Why do games (I'm looking at you Nintendo) continue to do this?",
        "created_utc": 1514258908,
        "upvote_ratio": ""
    },
    {
        "title": "What's the most frustratingly illogical thing you've seen in a game?",
        "author": "SquashFruit",
        "url": "https://www.reddit.com/r/truegaming/comments/7m2bx8/whats_the_most_frustratingly_illogical_thing/",
        "text": "By illogical, I don't necessarily mean any of the countless unrealistic things in games, but just *that thing* that doesn't make sense at all, which gets frustrating.",
        "created_utc": 1514221469,
        "upvote_ratio": ""
    },
    {
        "title": "Star wars battlefront 2",
        "author": "deadlycheech",
        "url": "https://www.reddit.com/r/truegaming/comments/7m1lil/star_wars_battlefront_2/",
        "text": "[removed]",
        "created_utc": 1514212234,
        "upvote_ratio": ""
    },
    {
        "title": "Open-world VS Sandbox. What’s the difference?",
        "author": "Tekhartha_Zenyatta01",
        "url": "https://www.reddit.com/r/truegaming/comments/7m1exe/openworld_vs_sandbox_whats_the_difference/",
        "text": "I’m writing a piece about “open-world” games and I wanted to get people’s opinions on what the differences between the two terms are. Is there are difference? Open-world generally refers to free roaming and less restrictive environments whereas a sandbox is claimed to be “make your own fun”\n\nWhat is the general consensus here and what are some true examples of each, if any?",
        "created_utc": 1514209494,
        "upvote_ratio": ""
    },
    {
        "title": "Unpopular opinion: I bought Battlefront II and think it’s a really good game",
        "author": "Tobar26th",
        "url": "https://www.reddit.com/r/truegaming/comments/7m0lr8/unpopular_opinion_i_bought_battlefront_ii_and/",
        "text": "So I know the general consensus on Reddit is that EA=Evil and I get that. Their attempt to monetise games is extreme at best. \n\nThat said if we can switch off and ignore the loot box controversy for a minute I think Battlefront II is a really solid action game. The first person shooter element allows play in either 3rd or 1st person. Has options for death match style play or large team objectives so everyone can be effective and rewards team play by doubling your battle points when you stick with your squad. \n\nAdditionally the star fighter element gives strong 3D space combat, is fun and follows similar logic to the ground combat as in you can play 1st or 3rd person. \n\nWith the changes to the credit system I don’t honestly feel the hero characters are unobtainable. After two days casual play I’ve unlocked Luke Skywalker already which is one of the much slated unlocks. \n\nUltimately I’m having a riot with the game and glad I bought it in spite of the outrage. \n\nWhat’s your unpopular gaming opinion?\n\n\nEdit: come on guys don’t downvote just because I said I like Battlefront. Let’s have an actual discussion about it. ",
        "created_utc": 1514193979,
        "upvote_ratio": ""
    },
    {
        "title": "Masculinity, Video Game Characters, and the Ethics of Mario",
        "author": "ThatPersonGu",
        "url": "https://www.reddit.com/r/MensLib/comments/7m0avw/masculinity_video_game_characters_and_the_ethics/",
        "text": "",
        "created_utc": 1514188111,
        "upvote_ratio": ""
    },
    {
        "title": "Best games with diplomacy / less - violent options?",
        "author": "TrippEvans",
        "url": "https://www.reddit.com/r/truegaming/comments/7lyu5r/best_games_with_diplomacy_less_violent_options/",
        "text": "There are so many great games about killing, hurting, sneaking and stealing, but right now I'm looking for diplomatic options. \n\nGames like Fallout (the best for diplomacy imo are 2 and New Vegas) and Vampires: the masquarade bloodlines\n\nIm especially looking for dialogue heavy games, that reward paying close attention. I don't mind if I have to kill, or steal, or hurt someone once in a while, but it's definitely shouldn't be the \"point\" of the game.\n\n\n(To be clear, I love violence from Doom to Thief to Smash Bros)\n\n\n\n**Edit**\nWow lots of replies, even if I don't reply immediately, just wanted to say I'm reading everyone's messages",
        "created_utc": 1514166202,
        "upvote_ratio": ""
    },
    {
        "title": "What game would you want an art book for that doesn't already have one?",
        "author": "lamp_boy",
        "url": "https://www.reddit.com/r/truegaming/comments/7lxo52/what_game_would_you_want_an_art_book_for_that/",
        "text": "I would really like an art book from Supergiant Games. Bastion was one of the most beautiful games and actually got me started playing more video games. Transistor also had amazing art that kept me captivated, although the gameplay was a little off. Haven't played Pyre yet but that also looks like another well done game. \n\nI think a compilation art book from them would be really awesome and they could even include fan art as I've seen quite a few nice pieces from the community.\n\nWhat game do you think deserves an art book?",
        "created_utc": 1514151601,
        "upvote_ratio": ""
    },
    {
        "title": "IS Bioshock Infinite actually an immersive sim?",
        "author": "gameoftheories",
        "url": "https://www.reddit.com/r/truegaming/comments/7lxbk1/is_bioshock_infinite_actually_an_immersive_sim/",
        "text": "Title says it all. \n\nIt seems to me to have a lot more common with the Half-life school than the Looking Glass one, despite the pedigree of Levine. Infinite is a very linear game, with minimal systemic collisions, and less of an emphasis on making each level problem for the player to solve. \n\nI don't think this is a bad thing at all, I just think that this game is a very poor example of an immersive sim, and a much better example of a scripted linear shooter.\n\nAgree or Disagree?\n\nIf you're curious what I mean by immersive sim, Mark Brown has a great video on YouTube, and I am talking about design philosophy rather than genre. ",
        "created_utc": 1514147687,
        "upvote_ratio": ""
    },
    {
        "title": "What gives a game replayability?",
        "author": "littlecaleb547",
        "url": "https://www.reddit.com/r/truegaming/comments/7lu88u/what_gives_a_game_replayability/",
        "text": "Most games I play once and only once but with others, such as Half Life 2 and Just Cause 2, there is a certain replayability, despite their straight stories. What is it that gives some games such replayability.",
        "created_utc": 1514105072,
        "upvote_ratio": ""
    },
    {
        "title": "Are MOBAs, or even competitive multiplayer games in general, destined to eventually have salty matchmaking communities?",
        "author": "Packrat1010",
        "url": "https://www.reddit.com/r/truegaming/comments/7lu6x2/are_mobas_or_even_competitive_multiplayer_games/",
        "text": "I have a friend who has introduced me to multiple competitive games with the promise of \"the community is really laid back.  Everyone says GG at the end, they don't get mad if you mess up, people are in a good mood in nearly every game!\"\n\nEach one of those games; Smite, Heroes of the Storm, Rocket League, Overwatch, either me or him have been told to kill ourselves for messing up.  It's easy to say, \"well, there will always be some bad apples, but it doesn't mean the entire community is bad,\" but this isn't isolated events.  As I play more and more of a competitive game, I notice it being more and more common for there to be some grade A salt in every other game, so I've been mulling over the idea of whether or not it's bad apples migrating in, or the games themselves that turn people salty.\n\nI have a running theory that it's a few factors that basically break down into a 3 step process.\n\n1)  From the start of the release of the game, people are slowly figuring out what to do.  Loses are still relatively fun, there are less clear answers to clear mess ups, the community is relatively small.  I think these factors, along with people bragging about how *this* MOBA doesn't have the salt of League or DotA contributes to a group think of \"yeah, behave!  This game is good, don't ruin it!\"  There's tons of heroes to try, tons of tactics to employ, the nature of MOBAs especially give a great feeling of everything being new and interesting.\n\n2)  The feelings from 1 start to wear off.  Loses start to hurt, wins aren't as satisfying unless they're big, you know EXACTLY why x player messed up and costed a tower or a boss.  Basically, people start taking the game more seriously, and why wouldn't you expect some to?  It's 20-60 minutes of your life you're pissing away on a game that just isn't working for you.  You play for wins or 50/50 games, why are you drudging through a feeding team or a hyper carry that you can't shut down?  You want to cut your loses and try for another good game, but it's not working out because Wukong keeps making mistakes or that Azmodan doesn't know how to lane.  You now know what you're doing, the community now knows what they're doing, games have to go a lot better for a satisfying end.\n\n3) The community TURNS bad.  Have you played a HotS game where someone mentions \"Oh, this game wasn't that bad until all the League salt came in.\"  I disagree with this notion.  Sure, there's probably some bad apples migrating, but I think the competitive nature of MOBAs turn people awful.  It's team based, so it's fair to say virtually nothing is your fault, your wins are at the expense of an equal and opposite loss, you're hyper sensitive to mistakes.  That, along with the community slowly turning saltier and saltier outside of the individual gives the effect of \"well, if I'm being told to kill myself, why should I always have to be positive 24/7?\"\n\nAnd yes, in theory you could just come up with a report system accurate enough to ween out the salty players, but it doesn't really address that root cause that these competitive games breed salt by nature.\n\nTL;DR, MOBAs start out fun and interesting, but people naturally become jaded due to the competitive nature of playing against other people.  Eventually the positive players slowly start becoming negative, until the game is just another competitive community, hyper-sensitive to mistakes and sick of losing due to teammates.",
        "created_utc": 1514104425,
        "upvote_ratio": ""
    },
    {
        "title": "Revisiting INSIDE -- the ending, the secret ending, and what it all means.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7lu0nj/revisiting_inside_the_ending_the_secret_ending/",
        "text": "The entire game is very obviously a metaphor for class struggle.  The working class is clearly represented by the individuals wearing hard hats, overalls, etc.  Their oppression is clear.  And it is clear that they are being used like a commodity, a resource; they are being exploited for the gain of the ruling class.\n\nThe two most important parts of the game are the drowning of the boy and the secret ending.\n\nThe drowning of the boy represents overcoming the strongest controlling agent of all -- **a fear of death.** It is no coincidence that the creature who imbues you with the ability to overcome greater obstacles further in the game is also the most unsettling and off putting.  However, once you confront death, once you are no longer afraid to give yourself over to the cause, you are able to conquer obstacles that may have seemed impossible before (in the case of INSIDE, this is represented by water, which ceases to become an obstacle but instead becomes a tool for success).\n\nThe secret ending is I feel the most widely misinterpreted part of the game.  Everyone seems to believe that because the boy unplugs and slumps over, he must have been controlled by something, and they assume it was the blob.  The secret ending actually represents that we must **give up the agent of control** that we seize after the working class rebels against the ruling class.  Seizing the mechanisms of control (aka the means of production) were key to freeing the working class from the ruling class, but they must be given up lest we fall into the same temptations of those that came to rule us in the first place.  This is the most important part of revolution, as if we do not give up that control, we will continue to perpetuate the very system we were fighting against.\n\nThe boy is not controlled by anyone.  He represents that even in the face of overwhelming oppression, it takes but one insignificant action to put into place the mechanisms of revolution.  Many people would look at the boy, then the apparatus he is fighting to free his people from, and consider it a laughably futile cause.  But it is important to stay true to our morals and never give up, even in the face of hopelessness, because we are infinitely stronger than any oppressive structure once we all unite and rise up together.",
        "created_utc": 1514101474,
        "upvote_ratio": ""
    },
    {
        "title": "Name one video game you closely associate with Christmas, the year-end holidays, etc.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7ltwbp/name_one_video_game_you_closely_associate_with/",
        "text": "[deleted]",
        "created_utc": 1514099333,
        "upvote_ratio": ""
    },
    {
        "title": "Why You Shouldn't Buy Escape From Tarkov: A Lesson In Sketchy Business Practices",
        "author": "VoroSR",
        "url": "https://www.reddit.com/r/truegaming/comments/7ltfa8/why_you_shouldnt_buy_escape_from_tarkov_a_lesson/",
        "text": "[removed]",
        "created_utc": 1514091998,
        "upvote_ratio": ""
    },
    {
        "title": "What games carries over data to the next addition in the series like the Witcher/TellTale Games?",
        "author": "SnortWhoresFuckCoke",
        "url": "https://www.reddit.com/r/truegaming/comments/7lt9w9/what_games_carries_over_data_to_the_next_addition/",
        "text": "So I know of the Witcher series, all of the TellTale series with multiple seasons, and of course there's pokemon where you can send them to the next game. There's also MLB: The Show that carries over your franchise and career data to the next year's version. \n\nI'm interested more in the ones where your choices carry over like the Witcher 2-3 and the TT games. I bought Witcher 3, but now I'm buying Witcher 2 just because of this and I'll pick up Witcher 3 again after. I'd love to know of some more. ",
        "created_utc": 1514090100,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any other successful, multiplayer real-time strategy/tactics games other than Starcraft?",
        "author": "Flyboy142",
        "url": "https://www.reddit.com/r/truegaming/comments/7lsli1/are_there_any_other_successful_multiplayer/",
        "text": "Because it seems like that's the only game that's played a lot in this genre and I hate it.\n\nI miss games like World In Conflict, Tom Clancy's Endwar, and Star Wars: Empire at War. Games that emphasize control of the battlefield and proper care of your units. The problem with Starcraft is that it's less a strategy gamea and more like \"Diablo but with armies\" since there's so much emphasis on micromanagement and blob control than things like vision, timings, mind games and communication.\n\nAre there any games like that still played a lot today?",
        "created_utc": 1514081097,
        "upvote_ratio": ""
    },
    {
        "title": "Hands of the god- new online card game",
        "author": "GearGaming",
        "url": "https://www.reddit.com/r/truegaming/comments/7lr0wf/hands_of_the_god_new_online_card_game/",
        "text": "[removed]",
        "created_utc": 1514062963,
        "upvote_ratio": ""
    },
    {
        "title": "The Stamina system makes Dark Souls 3 is very different from other hack and slashers",
        "author": "NBASwissCheeseD",
        "url": "https://www.reddit.com/r/truegaming/comments/7lqx59/the_stamina_system_makes_dark_souls_3_is_very/",
        "text": "The Stamina system prevents Dark Souls 3 from being just another button masher. Check out this video on how the stamina system works.\n\nhttps://www.youtube.com/watch?v=i0Mj7TJUoTg",
        "created_utc": 1514061825,
        "upvote_ratio": ""
    },
    {
        "title": "Do you kill every enemy in a shooter, or only the ones that are actually in your way? Lately I've switched over to the latter approach and it's kind of refreshing.",
        "author": "magnanimous_xkcd",
        "url": "https://www.reddit.com/r/truegaming/comments/7louh7/do_you_kill_every_enemy_in_a_shooter_or_only_the/",
        "text": "When I was younger I always killed everything in a level. It just made sense that an area was \"complete\" when the enemies were dead. Same with item pickups, to a lesser extent.\n\nRecently I've been replaying a lot of childhood games (Deux Ex, various Star Wars shooters, Half-Life, 007: Nightfire), and my attitude towards combat has definitely changed. The goal is to get to a specific place, or blow up a thing, or press a switch... Who cares if some guards are still alive afterwards? They're gone after the next loading screen anyway. I won't hesitate to leave someone alive if I've already fought my way past them to the objective.\n\nI think there's a few reasons for this change: \n\n1) I have less free time now as a working adult. Video games are fun, but I want to get to the good parts and not waste time. Backtracking to kill one guy isn't very interesting.\n\n2) I've watched a lot of speed runs and I'm  interested in that community. Skipping non-vital enemies is the standard for many speed runs... For a long time I didn't think of ignoring enemies as an option!\n\n3) For the most part, these games don't directly reward you for killing enemies. No experience points, no money, no crafting items, it's just ammo and guns at most. I'm not really leaving anything behind.\n\n4) After playing open-world games, where missing a few enemies is inevitable, I was more comfortable with that mindset.\n\n5) It's more immersive in some ways. Realistically, if I was on a mission to rescue a hostage I would get to the objective ASAP... not take out every guard and check every corner for items.\n\n6) Some enemy types aren't much of a threat, even on harder difficulties. Unless you're passing right next to an enemy, you can sprint through a section and maybe get hit once or twice. (This definitely depends on the game, though.)\n\nDoes anyone else find themselves ignoring non-critical enemies in games? Why or why not?",
        "created_utc": 1514038958,
        "upvote_ratio": ""
    },
    {
        "title": "Tips &amp; tricks for game writing?",
        "author": "shisyastawuman",
        "url": "https://www.reddit.com/r/truegaming/comments/7loq7v/tips_tricks_for_game_writing/",
        "text": "Hi! I want to preface this by saying I've been a lurker of this sub for a time now and I really think is one of the top quality subreddits out there.\n\nI'm a writer of sorts -I'm working on my first novel- and I really like to pitch game stories. Fairly often an idea comes to my mind and I write it down so I can develop it later. But I find it really difficult to do so since it's not the same than writing fiction. Suddenly I have an urge to build a world from scratch and a lot of elements come to me in disarray: plot twists, snippets of gameplay, backstory, characters, game design choices, little details. I try to write them all down and the result is a jumble of writing pieces that don't resemble a cohesive story.\n\nSo, my question is, can you share your strategy for writing game stories? Maybe you use a predefined outline or set of questions that one should answer in order to build a good plot, or maybe you have an all together different method. In any case, I'd love to hear about it.\n\nCheers!\n\nPS: English is not my first language so I apologize for any spelling mistakes.",
        "created_utc": 1514037373,
        "upvote_ratio": ""
    },
    {
        "title": "Should gaming use the label 'second person perspective' to describe certain games?",
        "author": "FaerieStories",
        "url": "https://www.reddit.com/r/truegaming/comments/7lofs2/should_gaming_use_the_label_second_person/",
        "text": "Gaming has adopted the descriptors of perspective that we use when discussing literary narratives, but as far as I'm aware, we only define games as being in the 'first person' to denote that the player experiences the protagonist's point of view, or in the 'third person' if the game camera 'follows' the protagonist.\n\nBut what about the 'second person', the idea of the main character being \"you\" (as in: the reader/audience/player)? There are plenty of games that pretend the player's in-game avatar is a surrogate for the player themselves rather than an independent character. By this token, lots of games we've labelled as being 'first person' should really be called 'second person'. And with the popularity of VR gaming this seems even more relevant, since VR games - moreso than most flat-screen first person games - try to sell you the illusion that *you* are within the game's diegesis.\n\nThoughts?",
        "created_utc": 1514032863,
        "upvote_ratio": ""
    },
    {
        "title": "So there's been a lot of fear-mongering around AI",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7lo8ib/so_theres_been_a_lot_of_fearmongering_around_ai/",
        "text": "[deleted]",
        "created_utc": 1514029371,
        "upvote_ratio": ""
    },
    {
        "title": "How often are games bought at full price on steam, if ever",
        "author": "littlecaleb547",
        "url": "https://www.reddit.com/r/truegaming/comments/7lnyhv/how_often_are_games_bought_at_full_price_on_steam/",
        "text": "I was looking through my steam library during the current sale and what I really noticed that only 2 games (Euro truck simulator 2 &amp; Factorio), were bought at full price, the other 141 being purchased in steam sales, humble bundles, or being given away. I was wondering how often full price steam games are bought.",
        "created_utc": 1514024259,
        "upvote_ratio": ""
    },
    {
        "title": "How to introduce my in-law to gaming?",
        "author": "TheElectricMeh",
        "url": "https://www.reddit.com/r/truegaming/comments/7lncwa/how_to_introduce_my_inlaw_to_gaming/",
        "text": "He has never played video games before. I bought him a ps4 with GTA for Christmas, now I’m writing a little booklet along side it with some basic info about gaming as a whole. I’ve touched topics such as persistence, and taking your own time to learn how to maneuver. What are some things you would say to someone who has no experience in video games?",
        "created_utc": 1514013558,
        "upvote_ratio": ""
    },
    {
        "title": "Fortnite Battle Royal Road To Victory! #1",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7ln53o/fortnite_battle_royal_road_to_victory_1/",
        "text": "[removed]",
        "created_utc": 1514010188,
        "upvote_ratio": ""
    },
    {
        "title": "They Are Billions + Darkest Dungeon = STRESS",
        "author": "ctarbet",
        "url": "https://www.reddit.com/r/truegaming/comments/7lmogg/they_are_billions_darkest_dungeon_stress/",
        "text": "Saved games have spoiled me.  My [happy little hamlet](https://steamcommunity.com/app/644930) was infected AGAIN.\n\nAlso, this [crazy hag lady](https://darkestdungeon.gamepedia.com/Hag) just wasted me.\n\nI feel like these games have a 70-80% fail rate which makes success all the more delicious, but I feel like a 50% fail rate would be more appealing.  Life is too short to spend so much time grinding and waiting for a good seed.\n\nCompetitive matchmaking gets it right - you should be losing about half your games if you are playing at skill level.",
        "created_utc": 1514003811,
        "upvote_ratio": ""
    },
    {
        "title": "Could secret expansions work in games?",
        "author": "HikuMatsune",
        "url": "https://www.reddit.com/r/truegaming/comments/7lmhj5/could_secret_expansions_work_in_games/",
        "text": "It's kinda weird for me to think about this, I thought about it ever since I watched SAO, bad start, to this right?\n\nEssentially, the part I was interested in was where they basically said, \"we fed a bunch of history and religion into this game, and it automatically makes content for the game\"\n\nThat got me thinking, could something like that work?  I'd imagine it would have to be the gimmick of the game.\n\nJust as an example, say I've got this mmorpg, pretty standard.  I decide I'm gonna put a new expansion in the game, but I say nothing about it, and release it.  Don't try to build hype or anything, just one day...a dragon attacks the main city and new content starts to slay that dragon.\n\nAnother example:  Things are getting stale a bit, I create a quest line for a legendary weapon, dont tell anyone like usual, the only way they'd figure it out is from some rare thing npcs have a chance to say.  Maybe under patch notes it simply says \"New content added\"\n\nWould it have to be the gimmick of the game?  Announced at front that there would be no announcements for anything.  Or could games do that now!?",
        "created_utc": 1514001242,
        "upvote_ratio": ""
    },
    {
        "title": "Want To make a Free YouTube INTRO!!!!!",
        "author": "Toxicninjatv",
        "url": "https://www.reddit.com/r/truegaming/comments/7lmg52/want_to_make_a_free_youtube_intro/",
        "text": "[removed]",
        "created_utc": 1514000749,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people say the Scotsmans Skullcutter is OP?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7lm9qg/why_do_people_say_the_scotsmans_skullcutter_is_op/",
        "text": "[deleted]",
        "created_utc": 1513998574,
        "upvote_ratio": ""
    },
    {
        "title": "First person games and cosmetic options always feels like a bit of a waste.",
        "author": "hyperknees91",
        "url": "https://www.reddit.com/r/truegaming/comments/7llk6k/first_person_games_and_cosmetic_options_always/",
        "text": "Other people might be able to appreciate it if your playing a multiplayer game, but its kinda hard for you yourself to enjoy it as much as a third person perspective game. Essentially your just getting a new pair of gloves (which isn't awful but...). \n\nIt just makes me find it strange that people care about them so much in these kinds of games. Jim Sterlings new video brought up Overwatch and Elder Scrolls that people are passionate about their cosmetics in these games. And to me, it's just hard to understand even though he's right. \n\nI do completely understand weapon changes (because well you can actually see it). Sometimes I feel like it might just be better to customize a bunch of different weapons instead. Though I'm probably missing something here. ",
        "created_utc": 1513990166,
        "upvote_ratio": ""
    },
    {
        "title": "Evolving Multiplayer?",
        "author": "WhineFramevsNinja",
        "url": "https://www.reddit.com/r/truegaming/comments/7llhyy/evolving_multiplayer/",
        "text": "[removed]",
        "created_utc": 1513989488,
        "upvote_ratio": ""
    },
    {
        "title": "Games where you can see other Levels",
        "author": "TheLaughingCat2",
        "url": "https://www.reddit.com/r/truegaming/comments/7ll6ze/games_where_you_can_see_other_levels/",
        "text": "Since we’re diving headfirst into huge open worlds with a “go-anywhere” mentality, I’d like to start a discussion on older games limited by hardware.  Before gigantic open worlds, some games would decorate their skyboxes or horizons with simplified and distant sketches of other areas the player can go to.  This created an awesome sense of connectivity and was good for building a believable world.\n\nThe best example that comes to mind is Super Mario Sunshine.  Being able to see the Pinna Ferris Wheel off in the distance could remind you of your accomplishments there, or overlooking most of the island from the top of Pianta Village would draw your scope way out.  I loved the island vacation setting.\n\n- What examples of this can you think of?\n\n- Have large open worlds replaced this esthetic design philosophy with more of a content-focused one?\n\n- Could linear games still incorporate this?",
        "created_utc": 1513986167,
        "upvote_ratio": ""
    },
    {
        "title": "Multiplayer Civilization Games",
        "author": "SpagootLord",
        "url": "https://www.reddit.com/r/truegaming/comments/7ll6it/multiplayer_civilization_games/",
        "text": "Is there any multiplayer sandbox game that has a realistic civilization simulation? Like a user based economy, selling goods and services, governmental systems; a game where a group of people will thrive while a single person will fail? Too many games claim to have an 'economy' but allow one person to perform all the needed actions, but I want to find one where you can only be successful in only one or two areas, such as hunting, fishing, and farming, or mining and basic crafting. Would this be too hard to implement? Is there any game out there that fits this bill? (doesn't have to be like rust level sandbox, mainly just the economy and multiplayer part).",
        "created_utc": 1513986039,
        "upvote_ratio": ""
    },
    {
        "title": "Strategy games with units possessing (semi-)randomly-varying stats?",
        "author": "Solmundr",
        "url": "https://www.reddit.com/r/truegaming/comments/7ll0yb/strategy_games_with_units_possessing/",
        "text": "I could have sworn I played a game where a class of notable units had statlines which varied semi-randomly -- e.g., one might have a little more armor, another more attack, a third be weaker altogether, etc. This made it worthwhile to spend these units wisely, and might get one rather attached to a few especially good ones... but I can't remember if this is even a real memory, heh. This mechanic is present in a lot of \"X-COM-likes\", but I can't actually think of any strategy games with a similar concept. \n\nAnyone know of any? Is this even a good mechanic for the genre, anyway? ",
        "created_utc": 1513984369,
        "upvote_ratio": ""
    },
    {
        "title": "Working on a Metroidvania Game Concept; input is appreciated ;)",
        "author": "mean_emcee",
        "url": "https://www.reddit.com/r/truegaming/comments/7lkoti/working_on_a_metroidvania_game_concept_input_is/",
        "text": "Hey, All. So as a creative project I’m working on a rough game concept with mechanics similar to Paper Mario and Child of Light, but with a narrative heavily inspired by Nier and Drakengard (...and Demon’s Souls ...)\n\nIdeally I’d be going for a open world 2D side scroller (or top down) with a mixture of RTS and TBS elements in combat. But what I’m thinking about is How I want the payer to explore the world: either alone or with companions. So here’s some of the systems that I’m thinking of: \n\n-Single player with no companions, exploring the vast and crushing world with only a few friendly faces along the way, but all on your own. This would eliminate the turn base and open it up to more of an RTS platformig system. \n\n-Single player with AI companions that can be ordered to attack certain enemies, but don’t get damaged by your attacks. Also able to keep with the RTS elements while still having company that can be used as an exploration and combat mechanic for interacting with the game world. \n\nLastly this is the option I’ve been putting the most thought in to, which does use some TBS elements in combat , but with a real time turn system:\n\nIn the tutorial level of the game, there would be an option of either going through the game single player or multiplayer. For this version, any Party members you choose (if you want any) are permanent and remain with you throughout the game. You’d have the option to choose from nine, but can only take up to three with you. \n\nAdditionally, You have three potential keys to free party members, but those keys can also be used to unlock rooms in the tutorial that will grant you up to three items for extra power to level you significantly in the early parts of the game. However, if you do decide you’d like some company but would also want extra power for yourself, you’re not limited to an either or; you could take on a party member or two and still acquire one or two of the power boosts. \n\nAnyway, from a development standpoint, which do you guys think would be the most interesting to see or experience? Any input you’d have on the matter would be greatly appreciated. Thanks. ",
        "created_utc": 1513980917,
        "upvote_ratio": ""
    },
    {
        "title": "How good (or bad?) was 2017 for gaming?",
        "author": "GTR_Helix",
        "url": "https://www.reddit.com/r/truegaming/comments/7ljhwk/how_good_or_bad_was_2017_for_gaming/",
        "text": "In my opinion, I haven't seen a year this good since 2013 (maybe even 2011). I think 2011 was one of the better years for gaming ever. So many great games came out that year. And man, this year was fantastic. Yes, like every year, there were rough edges (definitely not talking about microtransactions). But, other than some of the nonsense that happened, we had a great year. This was Nintendo's year and I used to not like Nintendo for a little while but man, they won me back over with the Switch. I'm getting one this Christmas and I can't wait to play on it. \n\nWhat are your thoughts? Is 2017 one of the best years in gaming? One of the worst? Just okay?",
        "created_utc": 1513969403,
        "upvote_ratio": ""
    },
    {
        "title": "Should I Own Both Xbox One And PS4?",
        "author": "godlivesunderwaterr",
        "url": "https://www.reddit.com/r/truegaming/comments/7lfpzx/should_i_own_both_xbox_one_and_ps4/",
        "text": "[removed]",
        "created_utc": 1513924674,
        "upvote_ratio": ""
    },
    {
        "title": "Intelligence as a Stat Downplayed?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7lf8cj/intelligence_as_a_stat_downplayed/",
        "text": "[deleted]",
        "created_utc": 1513918541,
        "upvote_ratio": ""
    },
    {
        "title": "Who should buy Konami?",
        "author": "Phatman516",
        "url": "https://www.reddit.com/r/truegaming/comments/7ldjk1/who_should_buy_konami/",
        "text": "This is a question I have asked myself several times since Konami announced they were stepping back from AAA game development (sure they still have Metal Gear Survive) and focusing more on their gambling machines.  So in all hypothetical scenarios who would you like to see buy the ownership of Konami's gaming IPs (I know Konami itself will continue to exist but in this scenario another company buys their video game IPs from them).  From Castlevania, Silent Hill, to Metal Gear, Contra, PES, Suikoden and more, who should add these games to their portfolios and handle them with care?",
        "created_utc": 1513900482,
        "upvote_ratio": ""
    },
    {
        "title": "Is video gaming too complicated now?",
        "author": "treedrak",
        "url": "https://www.reddit.com/r/truegaming/comments/7lcj32/is_video_gaming_too_complicated_now/",
        "text": "Something I wondered for ages and agree with this https://dpadjoy.com/2017/12/21/complification-video-gaming/ I still don't think modern gaming has the magic of the days of old, it's all just extra this, extra that, too much of everything. Then again, I'm really old and jaded now... What do you guys think, are you finding it hard to keep up with the game industry?",
        "created_utc": 1513891074,
        "upvote_ratio": ""
    },
    {
        "title": "Do you care for bathrooms/washrooms in video games? If they are present in the level, functional or not, etc.?",
        "author": "Lizzardboy2010",
        "url": "https://www.reddit.com/r/truegaming/comments/7lbvin/do_you_care_for_bathroomswashrooms_in_video_games/",
        "text": "Bathroom/washroom is essential part of living environment, and when designing a level for a video game, it only makes sense to include one. Right?\nIt would be weird, if you have exploitable apartment, building, hotel, but not a single bathroom in there.\n\nAlmost every game have a bathroom, but SOME game designers actually add options like turn the water on, flush the toilet, reflections in the mirrors, etc.\n\nDo you care for that, or it is a waist of time that no one will even notice?\n\nGood examples are here: https://www.youtube.com/watch?v=Jp33L6JOPBg",
        "created_utc": 1513885413,
        "upvote_ratio": ""
    },
    {
        "title": "It makes me sad for PC market",
        "author": "piyushr21",
        "url": "https://www.reddit.com/r/truegaming/comments/7laixx/it_makes_me_sad_for_pc_market/",
        "text": "I use to brag about PC gaming is better but in recent events it has opened my eyes that PC market is actually worse.\n\nPC market is on such a different wave that I cannot comprehend, where people brag that PC has the best hardware to buy and best games to play.\n\nBut games like PUBG and ARK survival even Call Of Duty WWII get away with less optimised but hugely popular and sold more than great optimised games like DOOM and RESIDENT EVIL 7, even Witcher 3 was sold more on console than PC.\n\nWhy is PC market so afraid to play Single Player games compared to Multiplayer. And latest news just shocked me that most of the PC revenue of this year are from in-App purchases compared to console.\n\nOnly thing that keep floating PC today is great indie games but I think Nintendo switch is gonna steal that.\n\nMy main point is that, why PC market brags about graphics when they can’t support good optimised games.\n\nThe only game that PC market really supported or loved was Divinity Original Sin 2. I am happy for that but it was different game.\n\nBut whereas this year Console took it to whole new level, like Nintendo with the legend of Zelda breath of the wild, Sony with Uncharted 4 and Hroizon Zero Dawn. This games where pinnacle in terms of art and graphics and also sold so well with each respective Hardware.\n\nWhere is PC level crysis game in upcoming years?\n\n",
        "created_utc": 1513873747,
        "upvote_ratio": ""
    },
    {
        "title": "Forking is freedom, in games",
        "author": "mcampbell42",
        "url": "https://www.reddit.com/r/truegaming/comments/7l9ucf/forking_is_freedom_in_games/",
        "text": "I recently wrote a post https://medium.com/loom-network/forking-is-freedom-1c3730be2fe4 describing the merits of player driven forks in games like MMORPGs have been great for the community. Was wondering /r/truegaming's opinion on the matter. After watch great games like Ultima Online regularly change its rules, or games just shut down like Asherons Call. I think we need to call MMORPG makers to start making it possible for end users to be able to fork their game if the game shuts down.",
        "created_utc": 1513867256,
        "upvote_ratio": ""
    },
    {
        "title": "How hard should be the highest difficulty of a game, how many different difficulties should a game have?",
        "author": "dantemp",
        "url": "https://www.reddit.com/r/truegaming/comments/7l83zk/how_hard_should_be_the_highest_difficulty_of_a/",
        "text": "If we disregard the obvious \"only one setting\" solution, I've seen two different schools of thought. \n\n1st is the \"casual\" approach. It consists of having very few difficulty settings and the highest one is pretty manageable. The games that I've played recently that had this approach were DOS2 and Rise of the Tomb Raider. And while the second actually has like 5 different difficulties, I've steamrolled through the highest one with little trouble. In both these games you could make the game challenging, but you need to self impose some rules, like completely disregarding the existence of some mechanics, like Lara's survival instincts and the ability to save often and reload upon stupid mistakes in DOS.\n\nThen you have your \"hardcore\" approach, where the highest difficulty actually requires you to know the game pretty good, plan ahead and be very careful. My favorite example of this is Civ5, where even with save-scumming and playing with the most OP civs you can easily be overwhelmed. \n\nThe reason  I bring this up and have the example of these 3 games is because I believe that all 3 of these games have amazing core mechanics that allow for some real creativity and mastery, but due to lack of challenge in the first 2 games, I never feel like truly exploring my possibilities, since the straightforward approach is enough to deal with the game. On the other hand, each time I figure out a way to maximise my strategy in Civ I feel genuinely happy because it will help me actually deal with a challenge I might not have been able to beat. \n\nIt's also funny because DOS2 reportedly had a better AI in its early access stage, but people complained that it's too hard so the devs actually scaled it down. Why do you think they did that, for what reason should a company make their game deliberately easier on its highest difficulty? Do you agree with that? ",
        "created_utc": 1513843778,
        "upvote_ratio": ""
    },
    {
        "title": "As of now, 4 years after release, what are the advantages and disadvantages of the Xbox One and the PlayStation 4?",
        "author": "481516",
        "url": "https://www.reddit.com/r/truegaming/comments/7l61st/as_of_now_4_years_after_release_what_are_the/",
        "text": "I wanted to know how the consoles compare to each other 4 years after release and a lot of changes have been done. \n\nI know that usually the answer to \"which one should I buy\" is \"depends on your personal preference and what exclusives you want or which consoles most of your friends have\", but I wanted to know more about the benefits of each console and I wanted to see if it could be possible to open up a discussion about them, about factors like reliability, prices,\nqualitu of the online services, quality of the exclusive titles, and in general how the consoles have behaved in their 4 years of lifespan. \n\nSorry if this is a boring or recurring topic, if so I would appreciate some counseling as to where to read this information or where to search. ",
        "created_utc": 1513819248,
        "upvote_ratio": ""
    },
    {
        "title": "Should the Mafia IP be moved to Rockstar?",
        "author": "americandream1159",
        "url": "https://www.reddit.com/r/truegaming/comments/7l5lri/should_the_mafia_ip_be_moved_to_rockstar/",
        "text": "Mafia III was my entry point into the series, completely bcuz of the protagonist and setting. I’m not gonna lie, playing as a black guy in the 60s was way more interesting to me than playing as a white guy in the 20s. I’m half-black, and representation matters. \n\nYou know who nails diversity in characters in every title? Rockstar. Not simply racial diversity, but each character is different. Hangar 13 crafted an amazing story, but it was buried in repetitive missions and questionable design (seriously, the plantation house should have been our main menu and we should have been able to rebuild Sammy’s.) Rockstar could have the gritty crime stories you guys have been wishing for, maybe exploring different locales in the GTA Universe. A Mafia IV in 1980s Vice City, 1970s Las Fortunas or 1960s San Fierro would be awesome. This could work if Mafia retconned their lore a tiny bit. Empire Bay being Brooklyn to Liberty City’s Manhattan easily makes this an easy canon. \n\nMafia could represent smaller games on a cycle with Rockstar’s bigger games. Maybe 2018 and beyond for Rockstar looks like Red Dead Redemption 2, Mafia IV, Agent, Mafia V, Grand Theft Auto: Los Santos Stories, Mafia VI. \n\nThoughts?",
        "created_utc": 1513814836,
        "upvote_ratio": ""
    },
    {
        "title": "DREADNAUGHT!!!! 30 MINUTES GAMEPLAY!!!!! FREE PSN GAME",
        "author": "GamesAnimeLyfe",
        "url": "https://www.reddit.com/r/truegaming/comments/7l52om/dreadnaught_30_minutes_gameplay_free_psn_game/",
        "text": "[removed]",
        "created_utc": 1513809815,
        "upvote_ratio": ""
    },
    {
        "title": "Gaming periods are often referred to primarily by technical standards (8bit, 64bit, HD…) which is neither wholly accurate nor reflective of gameplay developments. Can you divide gaming into periods like other art forms, or is the medium too young for that?",
        "author": "Pressing_Forward",
        "url": "https://www.reddit.com/r/truegaming/comments/7l3wz4/gaming_periods_are_often_referred_to_primarily_by/",
        "text": "Elizabethan, Victorian, Renaissance, Modernism, Postmodernism… There are various ways to name or define periods in other mediums, such as literature, art or cinema. We don't really see that for gaming. Yes, you have things like \"fifth generation of consoles\", but that excludes both PC gaming, handhelds, arcades and all other forms of gaming (think Snake on the Nokia). You could \"The 64bit era,\" which usually is connected to the N64 and the PSX (i.e. fifth generation consoles), and at least reflects better what happens on the PC and arcades, but still does not include in its terminology graphically less advanced devices like the GameBoy. This type of terminology, in other words, refers primarily to technology and \"aesthetics\" of the medium. And especially now that 8-bit games and Ultra HD games share the same space in stores and Best-of-the-year lists, this categorisation by graphics seems counterproductive and ineffective. \n\nNow, literary periods for example refer to more than just a time period, it is connoted to certain forms of writing. You'll immediately be able to know what differentiates a novel from the Victorian period and of Post-Modernism even if the aesthetics of the medium have been brought to the same standards. But what differentiates an 8-bit game from a 4k HD game apart from the aesthetics? And can you (artistically) compare games like Pony Island and Star Raiders just because they are similar in their graphical quality?\n\nGaming is a very young medium, so just because the it developed alongside  Postmodernism doesn't mean that it is comparable to the works of John Barthes, David Foster Wallace, Quentin Tarantino or Sarah Kane. Quite the contrary, gaming clearly developed in different ways, with very different things to consider. Visuals, Gameplay, Narrative… they can all be subversive or safe in their own ways. Spec Ops plays it safe from a visual and gameplay standpoint, only to subvert exactly that through its very postmodern meta-narrative. Okami is visually daring but gameplay and narrative are very familiar. Just look at VR, which is a sort of small-scale replication of gaming history in general: It tests out some very familiar ideas in a very unfamiliar context.\n\nYet, with all that being said, I specifically see some incredibly postmodern trends in gaming lately, starting with either Braid or Bioshock. Especially the indie scene is lately very concerned with the possibilities and limitations of the medium, and many games tend to play around with the fact that gaming is the only medium where you as consumer are (at the bare minimum) both the performer and the actor. And this kind of reflexivity simply wasn't there 30 or 20 years ago, meaning there is definitely a develepment to be observed like you could in the ca. 60s with the transition from Modernism to Postmodernism.\n\nLong story short: What do you think? Can you subdivide the development of the medium into different artistic periods, or is gaming simply in the process of \"catching up\" to postmodernity? Or is the medium simply to young for such considerations?",
        "created_utc": 1513799742,
        "upvote_ratio": ""
    },
    {
        "title": "Gift ideas for those of the true gaming persuasion?",
        "author": "MultiColoredHood",
        "url": "https://www.reddit.com/r/truegaming/comments/7l3s1e/gift_ideas_for_those_of_the_true_gaming_persuasion/",
        "text": "[removed]",
        "created_utc": 1513798553,
        "upvote_ratio": ""
    },
    {
        "title": "Gatekeeping by Gamers: What's acceptable? What's shunned? What's next?",
        "author": "Renegade_Meister",
        "url": "https://www.reddit.com/r/truegaming/comments/7l2lvv/gatekeeping_by_gamers_whats_acceptable_whats/",
        "text": "From /r/gatekeeping I'll define it as \"when someone takes it upon themselves to decide who does or does not have access or rights to a community or identity\".  In the context of this discussion of **gamer gatekeeping**, \"community\" could be an in-game community, online community, or even an entire in-game area or mode.\n\nSee some relevant game related [examples in /r/gatekeeping](https://www.reddit.com/r/gatekeeping/search?q=game&amp;restrict_sr=on&amp;sort=relevance&amp;t=all).\n\nDiscussion questions:\n\n* **What are some of the most widely accepted forms of gatekeeping that gamers engage in?**  Possible examples: Hardcore vs casual?  PC vs console vs mobile?  Players of F2P vs non-F2P games?\n\n* **What forms of gatekeeping are the most shunned by other gamers?** Possible example: Gaming communities that aren't noob friendly?\n\n* **What are the next forms of gatekeeping that you think gamers will do or are starting to do next?**  Possible example: VR vs non VR-players?\n\n* Bonus question: **Should critiquing games be considered gatekeeping?**\n\nThe last question was raised when [a new VR title was posted on a gaming sub](https://np.reddit.com/r/pcgaming/comments/7ksn2m/rage_room_a_vr_title_guaranteed_to_save_you_a_lot/) and it was being criticized for resembling a tech demo, which some perceived to be gatekeeping by VR enthusiasts.  However, critiquing games isn't a clear fit for the definition of gatekeeping given earlier.  This is actually what inspired me to make this post, but I wanted to have a broader discussion about gamer gatekeeping.",
        "created_utc": 1513788633,
        "upvote_ratio": ""
    },
    {
        "title": "Just a question, how is PUBG so popular? What’s the appeal of it?",
        "author": "ChikiTowai",
        "url": "https://www.reddit.com/r/truegaming/comments/7l2j16/just_a_question_how_is_pubg_so_popular_whats_the/",
        "text": "I own the game, it’s pretty fun. The genre is pseudo uniqu. However I can’t understand how people play it for hours on end. the game just feels really slow paced to me. Takes ages to find another player and when you do, most of the time, they have way better weapons than you. I’m pretty new so obviously I’m gonna sound like a total noob at the game but I just don’t get how something so slow paced has such a massive appeal.",
        "created_utc": 1513787916,
        "upvote_ratio": ""
    },
    {
        "title": "Have you quit gaming but still check gaming news?",
        "author": "rabbitz89",
        "url": "https://www.reddit.com/r/truegaming/comments/7l1hq7/have_you_quit_gaming_but_still_check_gaming_news/",
        "text": "Just curious if there are more people like that, i kinda went cold turkey and just quit it... but still read about gaming news and controversies, watch angry joe reviews and seldom watch some bits of twitch tournament streams of runescape and counter strike... ",
        "created_utc": 1513777834,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about hard gating in games?",
        "author": "Vyneras",
        "url": "https://www.reddit.com/r/truegaming/comments/7kzhgy/how_do_you_feel_about_hard_gating_in_games/",
        "text": "So hard gating comes in many forms but it essentially boils down to preventing the player from making progress of some kind due to requiring something (story progression/item/ability/etc.). Opposite to this would be soft gating where the gate can be gotten around but it is usually very hard to do so.\n\nThis has been floating in my head recently ever since i beat Breath of the Wild and was left extremely disappointed and I think a major factor was the fact that the only hard gate that limits my progress that really exists in the game is getting off the starting area. I have never been a big fan of games that take the go anywhere, do anything approach but I have seen plenty of people recently who view any part of a game preventing them from doing something or going somewhere as a bad trait.\n\nI know the ways in which a developer limits progression/exploring/advancement of the story should be determined by the type of game they are trying to make but I just wanted to hear how other people feel about gating a players progress. Do you enjoy hard gating more, soft gating more, or do you like a mix of the two in your game?",
        "created_utc": 1513749583,
        "upvote_ratio": ""
    },
    {
        "title": "Thank you to you all. After 6 years, I'm leaving as mod.",
        "author": "AMV",
        "url": "https://www.reddit.com/r/truegaming/comments/7kyhhh/thank_you_to_you_all_after_6_years_im_leaving_as/",
        "text": "[removed]",
        "created_utc": 1513738366,
        "upvote_ratio": ""
    },
    {
        "title": "In an open world game how much travel is too much when it comes to main story missions?",
        "author": "internet_observer",
        "url": "https://www.reddit.com/r/truegaming/comments/7kxxpw/in_an_open_world_game_how_much_travel_is_too_much/",
        "text": "I was just playing Shadow of Morder (the original) and I just did a mission that started me on one side of the map and had me walk to the exact opposite side, with 3 stops to pick herbs. 90% of the mission was just walking following an NPC. I feel like this mechanic is becoming increasingly common in openworld games, where a good portion of mission time is just empty travel time. I noticed it in Shadow of Morder, I noticed it in Farcry 4, I feel like it is an increasingly common mechanic.\n\n**I'm wondering if anyone enjoys missions that contain large amounts of and if not where does the line come between travel time that is fine and travel time that is annoying.?**",
        "created_utc": 1513733030,
        "upvote_ratio": ""
    },
    {
        "title": "Winter themed levels/games",
        "author": "JazzyWaffles",
        "url": "https://www.reddit.com/r/truegaming/comments/7kxvc0/winter_themed_levelsgames/",
        "text": "Big ones that come to my mind are the obligatory Ice Levels in most Mario games, and Ice Cap Zone from Sonic 3. I know DKC3 had actual Snowmen in the background of some of it's winter levels too.\n\nWhat are some of your favorites?",
        "created_utc": 1513732375,
        "upvote_ratio": ""
    },
    {
        "title": "Is PUBG dead in the water as soon as a more polished AAA competitor appears?",
        "author": "arenob",
        "url": "https://www.reddit.com/r/truegaming/comments/7kxcpr/is_pubg_dead_in_the_water_as_soon_as_a_more/",
        "text": "Before PUBG there was H1Z1 and everybody jumped ship because it worked better. But PUBG itself has no real identity, it's an extremely generic looking realistic shooter with basically no personality, and it's ugly as hell too on a technical level. Its genre is the only notable thing about it. \n\nWhat is there to keep anybody playing PUBG when the inevitable AAA competitor appears? Because you just know a bunch of studios are working like mad to cash in on this at this very moment.\n\nFortnite is the only real competitor currently but it's different enough that a lot of people are put off with the aesthetic - but will we see a mass exodus when another realistic looking game like PUBG comes out but more polished?",
        "created_utc": 1513727475,
        "upvote_ratio": ""
    },
    {
        "title": "Who gonna pay for online game playing?",
        "author": "EKCTPEMICT",
        "url": "https://www.reddit.com/r/truegaming/comments/7kwvl6/who_gonna_pay_for_online_game_playing/",
        "text": "[removed]",
        "created_utc": 1513723022,
        "upvote_ratio": ""
    },
    {
        "title": "Thinking of remaking Bushido blades. Discussion.",
        "author": "IronBoundManzer",
        "url": "https://www.reddit.com/r/truegaming/comments/7ktr8t/thinking_of_remaking_bushido_blades_discussion/",
        "text": "Hey there /r/truegaming\n\nI'm an indie dev on UE4.\nI have a decent knowledge and budget to make a full game that can be completed in about a year.\n\nApart from already watching countless youtube videos and have played that game for endless hours with my friends I have a quite detailed information of its mechanics.\n\nYet i'm unsure of pursuing this journey as remaking is kind of stealing in my mind and I'm not very comfortable with that idea.(or even paying homage, its kind of re-imitating the mechanics)\n\n\n1. Are you interested in a playing a game like bushido blade in 2018 ?\n\n2. What points or features do you think should be added to enhance the experience ?\n\n",
        "created_utc": 1513695614,
        "upvote_ratio": ""
    },
    {
        "title": "Why there was no successful Minecraft clone ?",
        "author": "Lobotomist",
        "url": "https://www.reddit.com/r/truegaming/comments/7kt9pk/why_there_was_no_successful_minecraft_clone/",
        "text": "Like it or not, success of Minecraft is unquestionable. Over the years many game companies tried to replicate the formula of simple lego-like building, fully interactive world, survival, and perhaps improve it by adding MMO like servers, more RPG elements and many other improvements. \n\nGames like Cube World, Sky Saga, Boundless, Stellar, Cubed, TUG, ... among many others.\n\nYet almost all of those games either ended mid development, or launched to EA and nearly abandoned afterwards. \n\nExcept mysteriously discontinued Cube World that gained lot of popularity. And Skysaga that was almost ready to launch but closed due publisher dispute. None of these games managed to get anywhere.\n\nWhy do you think these games performed so poorly ? Why despite large interest and attractive theme, no developer managed to publish anything remotely good ?\n",
        "created_utc": 1513690455,
        "upvote_ratio": ""
    },
    {
        "title": "Having an unprepared/unqualified developers to create big games - Should this be done or not?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/truegaming/comments/7ksn5t/having_an_unpreparedunqualified_developers_to/",
        "text": "I am writing this becuase I am somehow noticing a trend that some of the most anticipated games like the Division and Mass Effect: Andromeda had very controversial launches becuase of the poor quality and the amount pf bugs and glitches that players encountered.\n\nI know that I am not familiar with gameplay development but I somehow to not see giving untrained developers to make big games as a big no-no.\n\nOne example of this is the developers of the first Witcher game. They admitted that they had very little experience game development but despite their lack of experience, the first Witcher game had decent quality and was actually playable. This actually gave CDProjekt the proper feedback that was needed to create a much better game which the second Witcher game was known to have better mechanics, more deeply integrated gameplay and better quality overall ... which later gave them even more feedback on how to make an even better game later on.\n\nTo me, giving untrained developers to creativity to create as much as a good game as they can is not necessarily a bad thing. Maybe it, maybe it does not. At least developers will learn from their mistakes and move on onto the next project. \n\nHowever, having a developer that is very unfamiliar with the type of game of that they are told to do *(Massive Entertainment was mostly familiar with RTS games)* and **EXPECT** to instantly pull it off and be able to create the next big thing as The Division was marketed to be, that to me is a thing that I would have stayed away from if I was a Ubisoft businessman.\n\nDepsite that I am actually playing the Division now becuase the Gold Edition convinced me that the game was good and less of  broken mess than it was before, I avoided buying the Division becuase of its negative media coverage and when players mentioned how unfair the DarkZone mechnics are. \n\nI would not be very surprised that people still think that the game is broken or does not deserve media coverage even though it is technically in a better state now becuase something about video games as of late is that first impressions count a lot when you are actually selling a product, especially a product that was hyped.\n\nI do not really blame the developers for its mediocrity becuase just becuase that developer is not familiar with that kind of game, does not that the game will suck.\n\n But I blame however the ethics behind this choice becuase if Ubisoft really really wanted to create the next big thing then it would have been better to have more experienced developers do the hard work while the less experienced will at least know the basics or do the less complicated features to at least be familiar with the game in case Ubisoft asks to create another MMO-like game in the future\n\nTo me, having an inexperienced developer and tell them to create the next biggest thing in gaming history was too much of an expectation to accomplish. It would have been better if were involved in minor roles and allowed the more experienced to do the heavy work so that in future MMO-like titles or perhaps in the DLC or sequels of the franchise, these inexperienced developers will eventually get the experience needed for that particular game development",
        "created_utc": 1513682073,
        "upvote_ratio": ""
    },
    {
        "title": "How to earn free game codes by watching vids and streams (legit)",
        "author": "UrbanShutout",
        "url": "https://www.reddit.com/r/truegaming/comments/7krub9/how_to_earn_free_game_codes_by_watching_vids_and/",
        "text": "[removed]",
        "created_utc": 1513669725,
        "upvote_ratio": ""
    },
    {
        "title": "Gaming mysteries that require game updates to solve are cheap and unfulfilling",
        "author": "FurryPhilosifer",
        "url": "https://www.reddit.com/r/truegaming/comments/7kr13f/gaming_mysteries_that_require_game_updates_to/",
        "text": "The two examples I'm most aware of, are Elite Dangerous and Grand Theft Auto V. \n\nIn Elite Dangerous, the developers slowly started adding hints to an alien race through game updates. It started with things like strange broadcasts, odd monoliths or ruins, even an unexplained encounter or two. These things alone are all very cool, but each part of the mystery was just added through updates each time. You as a player could not encounter something strange, investigate, and come to a conclusion. Even the community could not reach a conclusion. It all just led to speculation, before eventually the game was updated with more events each time. There was no mystery to solve, or solution hiding. All the community could ultimately do is speculate and wait. \n\nI think GTAV did it even worse. The hints have been even absurdly vague and cryptic, and there might not even be a \"solution\". None the less, we had unexplained points on maps, the infamous mural, and countless other details that barely connect, yet have been added to and expanded upon with each update. \n\nWhat is the appeal of a mystery that cannot be solved until the game developers give you the answer? No matter how hard you look, no matter how hard a community tries, there just isn't an answer available. \n\nOf course, if the answer to the mystery is in the game as is, then it can be datamined and the mystery \"ruined\" for a community. But I do think teasing a mystery that has solution at all is a bad answer to this problem. \n\nAnd this is without getting into mysteries that require scouring game files for hints, looking at images of soundwaves, etc etc, all without an available solution. \n\nIt could be said that this isn't all that different from only having the first entry of a series, with plot threads and unanswered questions left for sequels. But with those, you KNOW that the answers probably aren't all available yet. It's obvious that you don't have access to all the information. As opposed to searching in a game for information that just hasn't been added yet. \n\nHow does everyone else feel about them?",
        "created_utc": 1513659209,
        "upvote_ratio": ""
    },
    {
        "title": "Weekly Update #3 *Video Game GIVEAWAY* 🏆",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7kqu6f/weekly_update_3_video_game_giveaway/",
        "text": "[removed]",
        "created_utc": 1513657012,
        "upvote_ratio": ""
    },
    {
        "title": "Recruiting for a Switch Podcast",
        "author": "JustJojoYt",
        "url": "https://www.reddit.com/r/truegaming/comments/7kqhgd/recruiting_for_a_switch_podcast/",
        "text": "[removed]",
        "created_utc": 1513653197,
        "upvote_ratio": ""
    },
    {
        "title": "Has there been a game series that you haven't played in such a long time and you're just now or recently returning to it?",
        "author": "GTR_Helix",
        "url": "https://www.reddit.com/r/truegaming/comments/7kp71d/has_there_been_a_game_series_that_you_havent/",
        "text": "I used to play The Legend of Zelda games back when I had a Gameboy and a Gamecube. I played Wind Waker and the Minish Cap (on Gameboy). Those games, when I recall, were awesome. \n\nI'm getting a Switch this Christmas and I'm going to get Breath of the Wild with it. And having not played a Zelda game in over 10 years, I'm really excited. I can't wait to get back into a series that I, for some reason, forgot in my childhood.\n\nAre there any game series like that for you? ",
        "created_utc": 1513640260,
        "upvote_ratio": ""
    },
    {
        "title": "Which three video games did you found the most engaging?",
        "author": "MEFboy",
        "url": "https://www.reddit.com/r/truegaming/comments/7koqiw/which_three_video_games_did_you_found_the_most/",
        "text": "I'm collecting data for my bachelor thesis in Game Design at the Södertörn College in Stockholm, Sweden. The main question for my thesis is \"what makes a video game engaging?\". The study is not about which games are the most addictive or which games you have spent most time playing, rather the goal is to find the games that held your attention the strongest.\n\nFor example I have played many many hours of Sid Meiers's Pirates! but the game never completely held my attention the same way as Super Mario Odyssey held my attention from start to finish. In retrospect I would say that I'd rather return to Pirates! before Odyssey but I can't deny how engaging the latter was during my playthrough.\n\nSo which three video games did you find the most engaging? And what made them engaging?\n\nI remember when me and three other friends played the entirety of Castle Crashers in one game session and it was amazing, but I would never had played that game so intensely if it was'nt for the company and the lack of duties the next day.\n\nFeel free to answer this survey for my thesis where you write down your three most engaging game titles (it is anonymous): https://goo.gl/forms/ltMpmX9SnWb2CcFB3\n\nI don't really know if this subreddit is the appropriate place to post this survey in but I'm new to Reddit posting so I'm taking a leap of faith. I hope I'm not breaking any rules here. Thanks in advance.",
        "created_utc": 1513636073,
        "upvote_ratio": ""
    },
    {
        "title": "I've heard the Division has improved greatly since its initial release. What are the major gameplay changes? How different is it from initial release?",
        "author": "b-aaron",
        "url": "https://www.reddit.com/r/truegaming/comments/7koegx/ive_heard_the_division_has_improved_greatly_since/",
        "text": "[removed]",
        "created_utc": 1513633096,
        "upvote_ratio": ""
    },
    {
        "title": "\"No microtransactions\" advertised as a selling point: is this temporary relief, or here to stay?",
        "author": "CashingOutInShinjuku",
        "url": "https://www.reddit.com/r/truegaming/comments/7ko83v/no_microtransactions_advertised_as_a_selling/",
        "text": "Unsurprisingly, developers have begun advertising their games as being microtransaction free. I'm sure that is something everyone who visits this sub expected. My question is: how long will this last? It would be amazing if Battlefront II's disastrous reception was a watershed moment that curbed micro transactions in AAA games forever, but I doubt it. It would just be too easy to slip them back in. \n\nThat said, maybe developers will never be this brazen about microtransactions again?  What if this temporary climate change has some permanence to it? Gamers are so much more vocal and discerning than the average consumer. We're much saltier too. Perhaps this kind of backlash will become a new norm; a way to keep the publishers in check. This already happens with paid mods. The community has a loud and clear \"fuck you, absolutely not!\" stance it makes clear whenever someone like Bethesda tries something dastardly. \n\nAll that said, we now have a generation of gamers that has grown up with games built around microtransactions, and massive publishers with greedy shareholders. Furthermore, there will always be that cash cow demographic of kids with their parents' credit cards plugged into their systems too. After all, that's who the people who design the microtransactions are after. Kids are passionate gamers because their worlds are so small - that is often their entire life outside of school - and they aren't spending their own money. So of course, that $5 weapon skin is totally worth it. There will always be a sizeable \"core market\" for microtransactions that also includes wealthier gamers and hardcore fans of certain games that will spend cash on them. \n\nMy prediction is a combination of the aforementioned concepts. I think that much like the political climate in the USA swung back and forth reliably all throughout the 20th century, the inclusion of microtransactions in games will be like a pendulum too. With Battlefront II, the community finally swatted that pendulum hard enough to set it in motion. Publishers will lay low for a bit, then go right back to their old ways. After that the envelope will be pushed again and again until uproar ensues once more. Then the cycle repeats. \n\nI guess my only hope is that the pendulum swings slowly so the AAA game industry will de-emphasize microtransactions for a couple seasons or even a couple years. Anyone who is working on an unreleased game right now will be thinking about playing it safe if they weren't already. The only question is, how long will that last? \n\n",
        "created_utc": 1513631525,
        "upvote_ratio": ""
    },
    {
        "title": "Does Eastern European game design have a distinctive identity(s)?",
        "author": "teffflon",
        "url": "https://www.reddit.com/r/truegaming/comments/7knu8t/does_eastern_european_game_design_have_a/",
        "text": "I've noticed more and more games on my radar coming from Eastern European countries.  (I mostly follow indies/small devs and have not played e.g. the Polish-made Witcher games.)\n\nIn contrast to Japanese games, with their strong tendency to uphold distinctive play-styles, art design, etc., I so far associate these devs with flexibility and broad-minded participation in 'mainstream' genres centered on the US marketplace and trends.  But I'm not paying very close attention to this issue---so I'm raising the question of whether there is an Eastern Europe style or styles of gaming, possibly linked to trends in literature or visual arts.  \n\n(I realize it is somewhat arbitrary to lump many countries together in this way, and finer distinctions are welcome---as are thoughts about other regional 'schools' of game design.)",
        "created_utc": 1513628173,
        "upvote_ratio": ""
    },
    {
        "title": "Why is there such a small amount of open world super hero themed video games?",
        "author": "OrickJagstone",
        "url": "https://www.reddit.com/r/truegaming/comments/7kn0z3/why_is_there_such_a_small_amount_of_open_world/",
        "text": "I don't know this seems like a no brainer to me. With the rocketing success of the Batman Arkham series and games like Spider-Man 2 back in the PS2 days you would think publishing companies would be killing themselves for rights. Add in the success of resent movies, I mean I know that movie companies can sometimes be a real pain in the ass to work with so I get the lack of tie-ins. \n\nGo to the source then, Marvel seems more then willing to take a gamble on there lesser super hero's. How awesome would a open world Punisher or Daredevil game be? If done right it could contend with big name titles. Am I missing something here is some aspect of development in this area being held up? Comic books and video games should go together like peanut butter and jelly.",
        "created_utc": 1513621157,
        "upvote_ratio": ""
    },
    {
        "title": "For those of you who feel addicted to gaming, how does it translate in you daily life?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7kmx98/for_those_of_you_who_feel_addicted_to_gaming_how/",
        "text": "[removed]",
        "created_utc": 1513620266,
        "upvote_ratio": ""
    },
    {
        "title": "I have been playing CS:GO for a few months now and I was never even interested to open any chest keys. Why is this even a thing in CS:GO?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/truegaming/comments/7km16p/i_have_been_playing_csgo_for_a_few_months_now_and/",
        "text": "[removed]",
        "created_utc": 1513612438,
        "upvote_ratio": ""
    },
    {
        "title": "I have been playing CS:GO for a few months now and I was never even interested to use the chest keys that I received",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7km0ug/i_have_been_playing_csgo_for_a_few_months_now_and/",
        "text": "[deleted]",
        "created_utc": 1513612351,
        "upvote_ratio": ""
    },
    {
        "title": "What are your favorite “other guy” games?",
        "author": "m0nkeybl1tz",
        "url": "https://www.reddit.com/r/truegaming/comments/7kli8w/what_are_your_favorite_other_guy_games/",
        "text": "Often multiple games will come out around the same time that are fairly similar, but for whatever reason one game will take off and the others won’t. Sometimes it’s a game trying to capitalize on the success of a major franchise, other times two similar games just happen to come out at the same time.\n\nObviously the “winners” are talked about frequently, but I’m curious what your favorite “losers” are. What did you like about them? Was there anything they actually did better than their more successful counterpart?",
        "created_utc": 1513607144,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone been in a all around losing streak in all different games?",
        "author": "Jacen77MC2",
        "url": "https://www.reddit.com/r/truegaming/comments/7kl0uh/has_anyone_been_in_a_all_around_losing_streak_in/",
        "text": "[removed]",
        "created_utc": 1513601556,
        "upvote_ratio": ""
    },
    {
        "title": "With Skyrim VR coming next year does that mean there is no TES VI on the horizon?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/7kkivd/with_skyrim_vr_coming_next_year_does_that_mean/",
        "text": "[deleted]",
        "created_utc": 1513594636,
        "upvote_ratio": ""
    },
    {
        "title": "Interest check: Video series on Graphic Design in video games",
        "author": "Ronnzor",
        "url": "https://www.reddit.com/r/truegaming/comments/7kj14q/interest_check_video_series_on_graphic_design_in/",
        "text": "Heya TrueGaming,  \n\nI've been a lurker here for quite some time, and I love reading about the insights people have about the games they love (or loathe). While I frequent a few of what I would call \"deep-dive\" subreddits, I don't contribute my thoughts often, and I would like that to change going forward.\n\nIn an interest to tap into my two greatest passions, video games and graphic design, I'm looking to start up a video series and potentially a short run of interview style podcasts down the line. In these, I would take a critical look at games I feel have a unique sense of visual design beyond the conversation of graphics or style. In breaking down the history behind where these designs come from, and the artist that have influenced the games we play, I hope to bring a greater understanding of the impact truly great design can have on the industry.\n   \n\nI suppose this is a bit of a check with a community who I feel may be a good audience for that kind of work. I've noticed that this is a type of content basically completely overlooked in the present offering. Do you feel that people have overlooked this aspect of game design, integrated it into a larger 'visuals' conversation, or am I missing something?\n\nThanks for reading, let me know what you think.\n\nEdit: Hey, seems like there's a decent amount of interest in this, I'm going to do some work around the logistics side of things, but I'll keep this sub updated as things get rolling.",
        "created_utc": 1513572484,
        "upvote_ratio": ""
    },
    {
        "title": "Is exclusives the only thing that make a console to you?",
        "author": "GTR_Helix",
        "url": "https://www.reddit.com/r/truegaming/comments/7kipmw/is_exclusives_the_only_thing_that_make_a_console/",
        "text": "If not, what are good selling points of a console beside exclusives? A lot of people diss on the Xbox because it lacks exclusives. If tomorrow, Microsoft suddenly announced like 10 new exclusive IPs for the Xbox platform, would that suddenly make you want an Xbox?",
        "created_utc": 1513568722,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of action games where you start overpowered and lose your power minutes later in the introduction?",
        "author": "Deltaasfuck",
        "url": "https://www.reddit.com/r/truegaming/comments/7kil83/what_do_you_think_of_action_games_where_you_start/",
        "text": "Probably started in Castlevania Symphony of the Night. Hack and Slash games are notorious for this. Do you find it annoying? Do you think it's good to give an idea of how the game might play on the latter half? Are there examples of when it's done good or badly?",
        "created_utc": 1513567371,
        "upvote_ratio": ""
    },
    {
        "title": "Backlogs and their effect on enjoyment.",
        "author": "musicguyscoey",
        "url": "https://www.reddit.com/r/truegaming/comments/7khox4/backlogs_and_their_effect_on_enjoyment/",
        "text": "Like others here I'm sure, I have a massive backlog of games, between Steam and stacks of hoarded games for every console from nes-ps4. If I had to make a fairly conservative estimate, I'd say I have about 500 games that I actually chose to buy due to being interested in them (ie, not 500 shit steam games from humble bundles like many people mention when talking about \"backlogs\") sitting unplayed/unfinished in my collection. Most of those are arcadey games, so I'd say there are about 100 story type games.\n\n \n\nI want to play them and recently after years of just jumping aimlessly from game to game and completing nothing, playing arcade games etc, I've been choosing one story/linear type game and playing through it before I go on to the next game and also trying to exercise some willpower not to buy cheap old classics etc, which is tough as I live in Osaka.\n\n \n\nThing is I'm finding it hard to actually enjoy the moment to moment gameplay without thinking \"when I get this one finished I only have 99 left\" and pretty much just constantly looking forward to finishing the game so I can tick it off the list, as opposed to actually genuinely enjoying the experience of playing it.\n\n \n\nI am aware that this is idiotic, but I'm wondering if this is just a natural consequence of having too many games on the \"to play\" pile.\n\n \n\nHas anyone overcome this?\n\nWhat's the solution? Sell all my games? Put them out of sight in a wardrobe? \n\nZen meditation?\n\n \n\nTL:DR: ever tried to work through a massive backlog? how did it go?",
        "created_utc": 1513557718,
        "upvote_ratio": ""
    },
    {
        "title": "Help me recall the name of a game with a most unique premise - PC FPS title that creates new gameplay content straight from contemporary headlines.",
        "author": "GasFlagPolice",
        "url": "https://www.reddit.com/r/truegaming/comments/7kglk2/help_me_recall_the_name_of_a_game_with_a_most/",
        "text": "[removed]",
        "created_utc": 1513546751,
        "upvote_ratio": ""
    },
    {
        "title": "Possible ideas for the next installment of \"The Division\". How to make the next \"Division\" game better",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/truegaming/comments/7kg7t9/possible_ideas_for_the_next_installment_of_the/",
        "text": "I know that this may be pointless considering Ubisoft has a reputation of barely changing any features in sequels or other releases of their franchises but I am going to post this anyway in case it may give them new ideas for the next instalment of the “The Division” franchise *(if that ever happens but this is Ubisoft, they will probably make a sequel anyway)*. I am posting this because even I was hyped for The Division but it ultimately turned into a dumb shooter. A fun one but more of a meh shooter so I am posting this in hopes that Ubisoft and its developers will listen to their fans' feedback and hopefully make an even better Division game\n\n\nHere is a list to name a few:\n\n-\t**Provide more back-story for the main antagonists** - Gordon Amherst, the big bad man himself, has little back-story and not even an understandable motive to create the Green Poison virus. \n - The mean reason Ubisoft did to explain why Amherst did what he did was for “natural selection” *(which occurring to Amherst’ understanding of evolution is not exactly correct)* which did not make much sense. Make Amherst more human. Add some back-story, perhaps an early trauma that happened before the outbreak. Make him a person who we REALLY should hate or we really should empathise with instead of being just another \"villian\" that we have to chase. \n - Same goes to Aaron Keener as well. Adding some more back-story before the outbreak and perhaps during the outbreak as well which led him to be an important antagonist will help us understand more his motives and personality\n-\t**More interactive atmosphere** - I know that New York is in a state of despair and it is meant to give you this apocalyptic feel. But despite the amount of detail that is added in the streets of NYC *(like seriously, there is a ton of detail if you take your time and pay attention)*, the city is incredibly dead and you pay no attention to your environment and all you do is run to next mission. And the next one, and the next one and so on. \n - An idea on how to make a semi-dead NYC more interactive is making the next installment of the game set during the time when NYC is recovering from the outbreak. Have people outside communicating and doing “normal things” like partying, going to the bar, or even shipments from the outside world help will bring life to NYC while keeping the feel that it has not fully recovered from the outbreak *(like dead bodies everywhere, streets full of garbage and so on, areas that are still full of crime and chaos and so on. Make the environments distinct like a more lively neighbourhood vs an area which is full of Rikers)*\n-\t**More meaningful loot, gear and RPG elements** - the game has RPG elements but could have been done a bit better. For starters, the outfit system is practically meaningless. I paid very little attention on the clothes that I obtained after missions or dropped after a shootout. \n - Something that I liked that saved the clothing system has adding a warmth feature like they did in the Survival Mode. That was very clever considering you are playing during winter time so it may be useful in case of missions that are done during a snowstorm. Or maybe add the chance of being infected by the virus itself only this time, the humanity already managed to develop a vaccine to suppress the effects of the virus for a short time. Or maybe add a feature that a virus has already mutated into different versions so you have to take a different medicine for it. Or maybe just keep the sick feature in general like to risk of getting a cold or a flu which will further affect your character's actions if you cannot find medicine such as unable to focus or run slower. \n - Perhaps another element can be done like make the game go throughout different times of the day or even of the year. For example, if it is raining, a warmth feature can be used as well or a new feature that minimises your likelihood of becoming sick, or perhaps another feature that reduces sound when moving if a player wants to take a more stealthy approach *(maybe useful if they added a rain feature because poodles make noise will alert the enemy or using thunder to cover your noise, or adding slippery roads to be more careful when it rains so you should not run all the time. Other RPG elements can be used as well like hunger, thirst and risk of getting sick or the need for sleep can be used as well like they did on the Survival mode. Maybe perhaps add some more like risk of getting frostbite in a cold day or dehydration in case of a hot day *(maybe even adding a dehydration risk feature too in the case of hot areas like in hot buildings that are burned by the Cleaners so you have to use more light clothing to avoid further dehydration)*. Maybe this will be good to add in the Dark Zone too as another reason why an agent can kill another agent for the sake of his/her own survival – which brings to my next point\n-\t**Make the Dark Zone more balanced, fair and most importantly, more meaningful** - The concept of the Dark Zone sounds great on paper. However, based on my experience on the Dark Zone, I hated it a lot and there was very little emphasis on even go there *(as in, there were very little missions that took place in the Dark Zone)*. I avoided it as much as possible because I hated going there. Almost every time I went there, I ended up being completely annihilated by a group of incredibly strong groups of Rikers or Cleaners, making my chances of surviving minimal, or getting killed by an incredibly overpowered rogue agent *(I remember the first time I was killed,  I was DZ lvl 4 and I was killed by someone who was DZ lvl. 15)* and took the gear that I found. Plus, the emphasis on going to the DZ to get better gear is pointless after reaching lvl. 30 because you are more likely to get better gear after purchasing the more advanced gear using your Phoenix credits or replaying the main missions in higher  difficulties. Make going to the Dark Zone with a purpose and make going Rogue more of a risk rather than an option that players can take like for example, if someone goes Rogue then that Rogue agent is known by everyone *(like a Dead or Alive Western-style hunt)*. Catching the Rogue agent also has its own risks too. Either you kill them or take them alive or risk being rogue too if you do not follow orders\n-\t**Add the option of interacting with the characters and enemies** - I am not asking Ubisoft to make the game more like Deus Ex or The Witcher but adding those extra features add extra layers of depth and complications in the gameplay. Making the game more interaction between players and NPCs sort of like recent massively multiplayer games of late like  PlayerUnknown's Battlegrounds would make the game way more in depth and increases longevity\n - All of the enemies you fight that a motivation that you can understand and sympathise with and since you are an agent whose goal is to mention order in NY, I found it contradictory that in order to maintain order, I have to shoot my way every single time, regardless of whether the enemies I am facing are actual bad guys like the fanatic Cleaners or people who are fighting for survival like the Rioters or the LMB. Adding this feature of interaction will give players to decide who really deserves punishment and does not. Use the NPCs interactions to give you clues of where the enemies may be hiding like for example from their dialogue *(do not give it like an option but more like a secret objective that you have to be aware to notice)*. Use the environment and the NPCs interaction of the environment to know what to do or not to do like a graffiti saying \"Rikers ahead\" or \"Do not go here. LMB armed\"\n-\t**More depth and emphasis on strategy** - As someone who played a lot of Tom Clancy games and someone who identifies himself as a Tom Clancy fan, I saw the “Tom Clancy” game added as a marketing stunt. Despite the Tom Clancy name on the name, this is not a Tom Clancy game in its entirety. Yes, there are features that are found among Tom Clancy titles like emphasis on strategy and clever thinking *(like using cover tactics)* and having the story inspired by real life events that actually happened. However, The Division is more like a Gears of War game with your enemies being bullet sponges despite whether or not they are wearing tactical armour or simple plain clothing. \n - What made Tom Clancy games stand out was the extra emphasis on strategy and clever thinking and a lot of patience and environmental awareness, plus an extra layer of difficulty if you really wanted a challenge *(which there is thankfully in The Division)*. That extra layer of depth in gameplay would give it a greater level of replayability, especially if played in co-op and new opportunities for different strategies. In comparison to other Tom Clancy games, I saw The Division easier sometimes, as if it wanted to hold my hand. For example, I did not like after scanning map in the safe houses, I immediately know where to go *(oh, that reminds me. The side-missions are WAAYYY too repetitive and they become boring very fast. The only reason I had to do them was because of the extra point I got to level up my three skill trees after completing them)*. \n - A more tactical approach would be better. Interacting with the NPCs to gain more information about the whereabouts of your enemies. Add a non-lethal option so that you can interrogate that enemy for more intel. Heck, might as well interact with the environment while you are at it like look for a map that gains more intel of where your hostages are or what type of armour your target has so that you know how to take him out. That layer is Intel can be very helpful in case you are playing on higher difficulties or you do not know who you are gonna face. \n - Make the enemies more distinct than just their health or different classes. I know the sniper is always going to be far away so you need to use a rifle or sniper rifle to take him out which will be easy because of the low health, like I know that a Riker runner is going to attack me head on which makes me have to get out of the way and target him first. But making the factions more distinct will the player having to change tactics often like the Rikers are not professionally trained and are reckless like not using cover, poor aim and maybe poor choice of guns. But make them come in large groups and make their brash approach more intimidating like for example their unprofessional tactics makes them unpredicatable so you may not now what they might do next. Some goes to the other factions like for example the Cleaners are often equipped with flamethrowers and will come at you with tons of flame. Make this an advantage so that you have to take them out first or else their flames will increase risk of burning you or making you have to change cover because the cover is heating up and the player cannot focus. Or make the LMB the toughest. Professionally trained, tough to kill because they know how to communicate and shoot the player and so on. This will be more tactical and even memorable if you are fighting multiple factions together. This will help giving each faction a distinct personality and not just a different image.\n - Also, make the gear you use more interesting too. There are some skills that are barely used like the mobile cover and there are gear that you almost never use the explosive ammunition or the sodas and the energy bars *(actually, I completely forgot about them)*. Make the gear that you use as actual armor instead of for example a bag with extra ammo or +2 agility. Make the gear look like real military-grade stuff that only Directive 51 has.\n - I would like to add grenades as well. Make every grenade more meaningful and purposeful *(something that makes Tom Clancy games also stand out because they have equipment has a purpose)*. I mostly added up relying on explosive grenades and incendiary  grenades because I found them more helpful and the other grenades were deemed pointless *(I only ever used them when I ran out of the other grenades that I just mentioned)*. Perhaps a flash bang grenade can be used like when a machine gunner is suppressing you and you cannot move or shoot so that you can move to another location and take him out. Or perhaps use the EMP grenade to take out a bunch of incredibly powerful turrets or drones that you cannot take out with your ammunition alone because of their tough armor and high rate of fire.\n-\t**Remove the bullet sponges** - I saved the last one for last because we all know that this was coming. That bullet sponge mechanic is very annoying and tedious. I know that The Division is meant to be like an RPG but I found it hard to remove that sense of disbelief that I am fighting against people who almost never used cover yet they can absorb a ton of ammunition and then take me up in just a couple of hits. Perhaps more it more authentic like when you manage to find actual gear with actual armour, make your enemies able to find just as much armour too like for example from fallen Division agents. Maybe make the feature that after you die, the factions will get to know what kind of armour or gear the player uses so they will use it as their own *(sort of like a Nemisis system)*. Or perhaps, make the enemies learn more about the player as the game goes on. Like the player likes to take the stealthy approach then the enemies will add more light at night or use more radar to spot the player. If the player likes to use snipers and take headshots, then the enemy will find armour to protects their heads. As the player learns more about the game's mechanics and his enemies as the game goes on, make the enemies learn about the player too\n - Maybe adding different types of enemies will be much better and more interesting *(also because the fights end up being too repetitive as well despite that you face different types of enemies as well like a Bruiser who uses melee weapons or the Sniper)*. \n - Because of these spongy enemies, they make some weapons practically useless like the DMRs, shotguns, handguns, burst rifles. Because of that, I ended up neglecting most of those types of weapons and relied more on assault rifles, SMGs, and LMGs.\n\nI think that is all for now\n",
        "created_utc": 1513543116,
        "upvote_ratio": ""
    },
    {
        "title": "A videogames writer: dead end?",
        "author": "ElvenNeko",
        "url": "https://www.reddit.com/r/truegaming/comments/7kfegt/a_videogames_writer_dead_end/",
        "text": "Writing has always been my main passion. Well, one of a two - but since i can't travel and enjoy the nature because my disability won't allow me to survive in the wild without supplies, only writing remains. I always dreamed about writing strories for the video games, because they allow much more freedom and possible ways to tell the story than any other form of art. In my entire life i wrote around 10 complete, finished stories with all the little details like setting, characters, locations, dialogues, cutscenes, even most important game design features, and there is also some amount of less finished ones, as well as few concepts for online games but those are very niche and not much original. Completing or at least trying huge part of the existing video games allowed me to improve my ideas, make them close to perfection, but i still had no way to make them a reality. I had some fun with different level editors, tried to learn programming and 3d modelling, but understood that it's just not my thing - i will never do that well enough, and neither will i enjoy doing it. So i tried several things: \n\n- Joining modding groups as a writer. They worked for some time, but they always felt apart without finishing the project. \n\n- Sending countless messages for different game dev studios, offering them my stories for free. In 10+ years not a single one was interesed enough to ask me sent one for them to read. \n\n- Trying to make game by myself. That was the last resort, because for a writer who does not know programming, modelling and can't even draw it's an almost impossible task. But it's also the only thing that i managed to complete because i found an awesome artist who helped me with all technical stuff and created all the custom graphical assets needed for the game. Still we worked with one of the game creation kits (rpg maker), that set a lot of limitations to the team without programmers, so we had to give up on a lot of planned features and some parts of the story, and also since it was only 2 of us - instead of creating full story we managed to make only prologue to the main story, that will take around 3-5 hours to complete. \n\nBut despite all that we worked on the game for 5 years and did a good job, mainly thanks to the artist because without his drawings game would look really generic, and without his custom scripts a lot of gameplay mechanics would not be possible. We released game for free in Steam, but, as expected - without any promotion not many people found out about it's existence. But the thing that made me really happy is the fact that almost all negative rewiews were mostly about engine limitations, such as being unable to switch volume levels, change resolution, etc, while most of the people enjoyed my story (and said that they want to see the rest of it), setting and universe, as well as they liked the custom graphical assets and all the funny mechanics that was created by my partner. Few people even found all the secrets and most of the refferences  &gt;_&lt; If someone likes old school rpg's and interested to see how it looks like - you can check \"Project Fire\" on Steam. \n\nI had a hope that after releasing my first game and showing what i am capable at there will be someone who would be interested if not in giving me opportunity to present all of my stories, then at least offering a chance to complete Project Fire, since it was obvious that people liked the beginning of the story and wanted to see the rest of it. \n\nBut nothing like that even happened - deep inside me i knew that it will be the only game i will ever make, but i just didn't wanted to give up on the last thing that meant something in my life. So i kept writing to the different studios, without any result, as always. I am a realist and i completly understand that working with someone like me could look like a huge pain, but there is also a bright moments: \n\n- Yes, my english is terrible, and even if i can somehow communicate with it - i certainly can't write anything good in it, and years of trying showed me that i simply cannot master it at the level needed for professional writing (i even needed to find a translator for my own game, or i won't be able to release it to the english-speaking audience).\n\nBut if i write on russian i automaticly create a free russian translation with quality above any \"official localisation\", and i believe that finding a good enligh translator should not be a serious problem. \n\n- Yes, many people for some reasons dislike remote workers.\n\nBut instead they could pay me just a little or i could work for free, i don't mind. \n\n- I am not a social person, that's why gathering my own team is not an option for me. However, if i work with already existing collective - i see no problems in explaining every possible detail of what needs to be done to each individual member (if i design the game) or in adapting story to the game designer's vision if they already have one. \n\n- I also realize that many commercial developers are not interested in complicated or disturbing stories - they want to sell their game to the widest possible audience, and that means keeping story simple, so anyone would understand that, and with lowest possible age rating. Probably only Sony still care really much about quality of the stories because even if game sales won't be great those games with impressive stories can be a reason to buy their console, so they give their studios some creative freedom, but as far as i know japanese people are even less interested in working with foreginers than any other game developers, so trying to contact them was pointless too. \nAnd indie developers alredy have the ideas - their studios usually appear because someone who has a good story starts gathering the team, but i already said above why i cannot do the same thing.  \n\n- And, of course, the last, but not least - i understand that i may not fit to work on one of the existing universes with long history (with one exception probably - i would certainly like to create a Resident Evil game). I know that fans of such universes may not be happy about different approach or vision, and instead of dissapointing them i would rather chose to work on the ogirinal universe to be more certain in the result. But many of my stories are flexible, and if we take, for example, the war game story - it could fit into almost any shooter game, including giants like Call of Duty. \n\nAs you can see, there is as much cons as there is pros in working with me, but still i see no more possibilities for someone like me to ever find my place in game development. Maybe things would be different if i was born in another country, or had better mental capabilities to learn high levels of english - then language would be no longer a problem and i would have a better chances in communicating with foregin teams (yes, there is not many dev teams in post-soviet countries where people speak russian, and most of them are making mobile games, so they are not an option too), but we have what we have. There is no more meaning in my life - unlike many people i have no other goals like making family, friends or career, stories is the only really interesting thing for me in this life. At night i rewiew them over and over again, replaying the scenes in my mind, trying to make them perfect and knowing that nobody will ever see them. And during the day i play games made by other people. Some time ago they used to be a pure joy - but now i often feel sad when i see how other people's dreams becoming a reality (especially if they are somewhat alike my own), and knowing that my own will never have that chance. I must live the rest of my life somehow, but i don't know what to do with that need to create, it's a huge pain to \"play\" the life in observer mode, telling stories is my way of trully communicating with the outside world. I would pledge my body to some pawnshop so i would be able to hire a team to help me develop the game, but, sadly, human life worth nothing at all. I am out of options. Is this a dead end? \n\nMaybe there is a people around here who wrote the stories for games before? How do you get to do that? ",
        "created_utc": 1513535288,
        "upvote_ratio": ""
    },
    {
        "title": "Will Madden be fun for someone who hasn't played it in 15 years?",
        "author": "garbageeater",
        "url": "https://www.reddit.com/r/truegaming/comments/7kf0ad/will_madden_be_fun_for_someone_who_hasnt_played/",
        "text": "[removed]",
        "created_utc": 1513531460,
        "upvote_ratio": ""
    },
    {
        "title": "Top 250 Steam games of all time",
        "author": "ScriptFUSION",
        "url": "https://www.reddit.com/r/truegaming/comments/7ketfz/top_250_steam_games_of_all_time/",
        "text": "[removed]",
        "created_utc": 1513529632,
        "upvote_ratio": ""
    },
    {
        "title": "What genres need a revive?",
        "author": "CaloctoraOrganism",
        "url": "https://www.reddit.com/r/truegaming/comments/7kdvw3/what_genres_need_a_revive/",
        "text": "[removed]",
        "created_utc": 1513519017,
        "upvote_ratio": ""
    },
    {
        "title": "Is it better for a game to release as it is or to include future DLC to add to the plot?",
        "author": "ExodiusRex",
        "url": "https://www.reddit.com/r/truegaming/comments/7kcxn3/is_it_better_for_a_game_to_release_as_it_is_or_to/",
        "text": "Final Fantasy XV got me thinking about this. The main game is both enjoyable and underwhelming at the same time because sections of the game feel rushed and cut out. \n\nThe devs have been patching in more story for more than a year now which is great and all but it still feels like they released an incomplete game that's being retouched and held together by bandages. ",
        "created_utc": 1513502051,
        "upvote_ratio": ""
    },
    {
        "title": "Videogames vs Obesity: A consideration of scholars attempts to use serious video games",
        "author": "Tinarkii",
        "url": "https://www.reddit.com/r/truegaming/comments/7kcvta/videogames_vs_obesity_a_consideration_of_scholars/",
        "text": "Hey all, so I recently did this research paper and [video] (https://www.youtube.com/watch?v=Yv1pBwPVoGc) of the field of serious video games (looking specifically at its potential in fighting obesity), and I thought there was some pretty cool stuff to go over. For those that don't want to watch the (6 1/2 min) video... I'll do a TL:DW, but the video does a pretty good job of it.\n\nTL:DW\nSerious games (defined as games made for a serious purpose) have been researched for at least the last 10 years.\nA good portion of this research has been directed at dealing with the obesity epidemic.\nHowever, there isn't any solid proof from this research that serious video games can actually prove useful in fighting obesity, so is there a better option?\nI suggest that because games have never been shown to actually be able to directly affect behavior, serious games don't have a chance in this regard either. I also suggest that for this kind of \"therapy\" a method of gamification is a better idea.\n\nSo, let me know what you guys think... like I said, you'll get a better idea if you watch the video, but I'm curious as to your thoughts on serious games, both in regards to health games but in other areas as well. Do you think they do have a chance of being effective somehow? or do you think gamification is a better idea? Perhaps you have your own theory?",
        "created_utc": 1513501037,
        "upvote_ratio": ""
    }
]