[
    {
        "title": "Being a Atheist at College, should I come out?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2giauw/being_a_atheist_at_college_should_i_come_out/",
        "text": "",
        "created_utc": 1410823660,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on theology, mythology, and storytelling?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ghq0j/thoughts_on_theology_mythology_and_storytelling/",
        "text": "I've been thinking a lot lately about ancient religious literature and how they compare and contrast. One of the biggest reasons I've never been able to view religion and god as more than just a fairy tale (aside from the lack in evidence) is that these stories all come from ancient times where\n\n1. People couldn't explain anything because science for all intents and purposes didn't exist, and\n\n2. Storytelling was just as entertaining back then as it is today.\n\nHow do you personally interpret the varying theological and mythological stories that share similar themes? Such as all the creation stories, or flood stories? Do you think these all stemmed from one set of stories, and as the years went on different people changed them whether (intentionally or not)?\n\nWhat are your thoughts on so many people look at the Bible as fact, but regard other mythologies as fiction?\n\nWhat are you thoughts on people who can look at sections of the Bible (or other religious literature) and say \"Okay, well that's probably just a story that didn't really happen, but the rest of these stories are true!\"\n\nThe Bible was written over a period of 1400 to 1800 years by more than 40 different authors. What are your thoughts and theories on this fact and how it affects the validity of the Bible overall?\n\nThese are meant to be open-ended questions. I'm looking for discussion and opinions, not answers. I'm normally starved of this kind of conversation.",
        "created_utc": 1410812252,
        "upvote_ratio": ""
    },
    {
        "title": "Just tried to start a discussion in /r/atheism - that will be my first and last post there ever. Hoping for better results here.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ghoud/just_tried_to_start_a_discussion_in_ratheism_that/",
        "text": "I just attempted to post this in /r/atheism. It was my first post and will be my last. Someone suggested posting it here instead.\n\n--------\n\nI've been thinking a lot lately about ancient religious literature and how they compare and contrast. One of the biggest reasons I've never been able to view religion and god as more than just a fairy tale (aside from the lack in evidence) is that these stories all come from ancient times where\n\n1. People couldn't explain anything because science for all intents and purposes didn't exist, and\n\n2. Storytelling was just as entertaining back then as it is today.\n\nHow do you personally interpret the varying theological and mythological stories that share similar themes? Such as all the creation stories, or flood stories? Do you think these all stemmed from one set of stories, and as the years went on different people changed them whether (intentionally or not)?\n\nWhat are your thoughts on so many people look at the Bible as fact, but regard other mythologies as fiction?\n\nWhat are you thoughts on people who can look at sections of the Bible (or other religious literature) and say \"Okay, well that's probably just a story that didn't really happen, but the rest of these stories are true!\"\n\nThe Bible was written over a period of 1400 to 1800 years by more than 40 different authors. What are your thoughts and theories on this fact and how it affects the validity of the Bible overall? Looking at the beginning of this post, do think that the Bible should have more or less validity than Greek mythology *because* it predates it? If more, than what are your thoughts on New Testament and other religious text that postdates Greek mythology?\n\nThese are meant to be open-ended questions. I'm looking for discussion and opinions, not answers. I'm normally starved of this kind of conversation.",
        "created_utc": 1410811647,
        "upvote_ratio": ""
    },
    {
        "title": "If god is all knowing and all powerful, then why would he have needed/wanted to create humanity?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gh3u6/if_god_is_all_knowing_and_all_powerful_then_why/",
        "text": "",
        "created_utc": 1410800951,
        "upvote_ratio": ""
    },
    {
        "title": "Should I continually berate Christianity on social media.",
        "author": "Ihearrhapsody",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gh1a5/should_i_continually_berate_christianity_on/",
        "text": "I have a friend who recently became born again and went off the deep end with it. He posts three or four times a day on his Facebook regarding the end times, why Christianity is good and Islam is evil, Obama is the Antichrist (we're English!?!?) etc. His posts are attempts at fear mongering and are often upsetting or offensive. Trying to have sensible chats with him in private led nowhere. Neither has publicly pointing out where these videos and texts he is posting fall at the first hurdle. I can't help but feel like the only way to get my point across is just to straight up ridicule them. Is this a terrible idea? ",
        "created_utc": 1410799628,
        "upvote_ratio": ""
    },
    {
        "title": "Any suggestions to help my parents to deal with my atheism?",
        "author": "barebearbeard",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ggu2e/any_suggestions_to_help_my_parents_to_deal_with/",
        "text": "So I have recently come out to my parents about my unbelief.  For background - I am a 27 year old male, coming from a protestant upbringing.  I felt it was time, since it was causing an increasing rift from my side.  Unfortunately honesty can cause a lot of hurt and ironically create a canyon anyway. My parents aren't angry, but rather deeply sad, disappointed and angry with themselves for not seeing the \"warning signs\" earlier.  They have always believed that non-believers are evil and spiteful, but I have now thrown their worlds upside-down by showing them that it is simply not the case.  They are highly confused and it is tearing them apart on the inside.  They are also very intelligent, but just never decided to be critical about their beliefs.  We all still love each other very much, but I do not see any way for them to ever accept it, mainly due to the fact that they are fearing for my soul to be damned and that they can not believe I would want to choose a lonely path without a loving god watching over me.(I realize the contradiction, but they do not see it that way)  It is as if they see my life as worthless now, because why do anything if it will just end at death anyway - and it is that which saddens them most.  \n\nSo I'd like to know if anyone can help me with this?  I can see how deeply hurt they are and I hate to be the cause of that.  They are also trying to accept it, but they need some sort of lifeline.  I know I can probably not give them anything worthwhile, but I'm trying anyway.  \n\n**edit:**  Thank you everyone for your help and replies.  I understand now that they will need time to deal with it themselves, but you also gave me great ways of dealing with it too.  Keep being awesome!",
        "created_utc": 1410795760,
        "upvote_ratio": ""
    },
    {
        "title": "I just don't feel the love from these people.",
        "author": "shartshooter",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ggkvp/i_just_dont_feel_the_love_from_these_people/",
        "text": "",
        "created_utc": 1410790402,
        "upvote_ratio": ""
    },
    {
        "title": "Religions where god didn't create humans/the universe?",
        "author": "Mrmaybesomething9",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ggg21/religions_where_god_didnt_create_humansthe/",
        "text": "",
        "created_utc": 1410787171,
        "upvote_ratio": ""
    },
    {
        "title": "Remember these quotations the next time someone spouts bullshit about the American founding fathers and Christianity.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gftm8/remember_these_quotations_the_next_time_someone/",
        "text": "",
        "created_utc": 1410764388,
        "upvote_ratio": ""
    },
    {
        "title": "Mother and I at an Impasse. How to proceed? Ditch her or Mend?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gfpyq/mother_and_i_at_an_impasse_how_to_proceed_ditch/",
        "text": "",
        "created_utc": 1410760938,
        "upvote_ratio": ""
    },
    {
        "title": "My journey into atheism, and things that prevent me from going back.",
        "author": "KEGEL_POWER",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gf3g4/my_journey_into_atheism_and_things_that_prevent/",
        "text": "Sorry if this seems self-centered in any way, I just feel like expressing my thoughts a little bit. *All criticism is welcome.*\n\n**1. My Journey**\n\nFor the past 18 years, i've known nothing except Christianity. All my family members are devout Christians, I went to a Christian school my entire life (preK-12), and I probably have never known anyone personally who wasn't a Christian. I've always had a small skeptical side to me, but it wasn't until I was about 16 when I experienced a deep desire to know the truth for myself without any doubt.  \n\nAs I spent more time on Reddit, I also spent more time reading /r/Atheism and /r/Trueatheism. I became pretty good (or at least, what **I** thought was pretty good) at defending Christianity and coming up with my own responses to Atheistic arguments. I was taught evolution very well in my Christian high school by a teacher who had no problem with it, so I had no problem with it either---and this, I felt, allowed me to be confident that Christianity was up to stuff. Silly Atheists!\n\n**2. Things**\n\nAll of this started to change, however, when I was exposed to christianitydisproved.com. I had always been taught that my own personal spiritual experience of God was my \"end all\" reason for believing that God was really there. Any other religious adherents that claimed divine experience were either lying or hallucinating--**my** experience (and all other Christians') was real. That website showed me that personal religious experience is indistinguishable from the natural processes of the brain. This forced me to realize that any arguments from personal experience are completely unreliable. \n\nWell, I still have the Bible, right? Wrong. Bart Ehrman completely shattered my perception of the New Testament. I read through \"Jesus, Interrupted\" and \"Forged\" all in the span of a few days, and I was completely disillusioned at my religion. The New Testament is historically unreliable in the utmost way. I then read through \"The Bible Unearthed\" by Israel Finkelstein. This book annihilated my perception of the Old Testament. Even though I already believed that the Old Testament was mostly figurative, this book showed me that much of the Old Testament is likely nothing more than a 7th-century BCE work of Hebrew political propaganda. *So very little of it* is based in historical truth. If the Jewish religion is based on lies and falsehoods, this utterly uproots Christianity and rips the foundation of it right out from underneath its feet. \n\nI have also come to realize that the God of the Old Testament is a completely different personality than the gentle, peace-loving depiction of Jesus. The atrocities and moral obscenities mandated by God in the Old Testament are incomprehensible and irreconcilable with the teachings of the New Testament. \n\nThere are many other smaller reasons that I have for staying away from Christianity, these are just the big ones. If you took the time to read this far, [I love you.](http://i.giphy.com/ymkLJAxVz2la.gif)\n\n**TLDR**: The Bible is fictitious, God is a murderous psychopath, yaddy yaddy yadda.",
        "created_utc": 1410744785,
        "upvote_ratio": ""
    },
    {
        "title": "A friendly debate: Intuitive, Logical, and/or Philosophical arguments for Atheism over Deism [x-post /r/Deism]",
        "author": "DemosthenesLocke2012",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2genb3/a_friendly_debate_intuitive_logical_andor/",
        "text": "**Hello Atheists!**\n\nI'm a long-time lurker of this subreddit (with a couple posts), and I have noticed that a plurality (if not a majority) of the posts seem to be about atheism in relation to Christianity, if not some other religious doctrine. Therefore, I wanted to have a discussion about atheism in relation to theism in general, and deism in particular, which has to established doctrine and makes generally non-falsifiable claims.\n\n*My Background:* I'm an agnostic with a secular Jewish background myself. I just wanted to have this discussion for my own curiosity!\n\n*Debate Question:* What are intuitive, logical, evident, and/or philosophical arguments that suggest atheism to be more likely in this universe than deism?\n\n*Rules:*\n\n* **Don't shift the burden of proof!** As far as I know, neither side really has evidence to 100% prove their case. Let's try to keep all the arguments substantive.\n\n* **Avoid stawman!** For example, there are many variants of Deism, some of which support a god \"tinkering\" with the already-created universe, which could lead to a demand for physical evidence. The point of this debate is to avoid arguments that would require physical evidence.\n\n* **Just be civil!** Nobody should be proselytizing here (I don't think Deists or Atheists proselytize anyway...).\n\nYou can post here or in the [corresponding thread on /r/Deism](http://www.reddit.com/r/deism/comments/2geo9m/a_friendly_debate_intuitive_logical_andor/).\n\nThanks! :)",
        "created_utc": 1410734288,
        "upvote_ratio": ""
    },
    {
        "title": "How would you refute the Abundance of Fulfilled Prophecies Argument?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gem81/how_would_you_refute_the_abundance_of_fulfilled/",
        "text": "",
        "created_utc": 1410733592,
        "upvote_ratio": ""
    },
    {
        "title": "Petition to omit \"so help me god\" for military service members.",
        "author": "dnb_4eva",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ge665/petition_to_omit_so_help_me_god_for_military/",
        "text": "",
        "created_utc": 1410723941,
        "upvote_ratio": ""
    },
    {
        "title": "Went to church with my mom today",
        "author": "electric_eclectic",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ge17n/went_to_church_with_my_mom_today/",
        "text": "I went to mass today because my mom asked. Normally I refuse, but I agreed this time. She's trying a new church and feels good about it. Maybe it's because she can take communion again since noone know's she's twice divorced and never annuled. \n\nAnyway, the theme of the priest's homily was taking up the cross. Mostly it was about accepting your suffering as a gift from god. He quoted mother Teresa and said when you suffer Jesus is kissing you. \n\nHe also criticized people for rejecting the Jesus' historocity. He said the gospels are the most historical books with sources like Tacitus and Josephus confirming the events of Christ's life. I'm not sure those two are contemporary sources, but I'm also not a historian.  \n\nWhat really struck me was the part about martyrdom. How there have been Catholic matyrs in every century.  He said there were more martyrs in the 20th century than any other combined. I wanted to see a citation on that! \n\nHe described a \"quiet persecution\" that can eventually lead to matyrdom, such as being called a bigot for being pro-life and speaking out against \"the gay lifestyle\". I rolled my eyes on that one. \n\nSo is going to church worth it? I think I would've rather slept in. ",
        "created_utc": 1410720997,
        "upvote_ratio": ""
    },
    {
        "title": "New study in Germany Apperantly proves there is an afterlife. What are you're thoughts here?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gdsbf/new_study_in_germany_apperantly_proves_there_is/",
        "text": "http://worldnewsdailyreport.com/german-scientists-prove-there-is-life-after-death/",
        "created_utc": 1410715627,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people lose their faith in god/religion when they understand evolution?",
        "author": "getjill",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gd1gu/why_do_people_lose_their_faith_in_godreligion/",
        "text": "Often people who come around to learning about evolution doubt the existance of god. Can't there be a god/creator who created by evolution? Then can't Genesis be a metaphor and not literal? \n\nCatholics accept evolution. My atheist friend says Catholics accept everything like Pagan holidays, evolution etc. so they keep growing and expanding. ",
        "created_utc": 1410694248,
        "upvote_ratio": ""
    },
    {
        "title": "Recently started an email discussion with a conservative Christian.",
        "author": "racist_homopobe",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gcu8q/recently_started_an_email_discussion_with_a/",
        "text": "It's with the parent of a close friend from the church I used to be very active in. This is the first time I've really had an on-going discourse with someone of an opposing viewpoint, and I think it's going to be very good for both of us. I'm sure this person's goal is to bring me back to God, and I understand that. My only goal right now is to dissolve some assumptions they may have toward atheism. I just wanted to share and to ask if any of you have someone that you can have a friendly on-going discussion with? Did it turn out well, or did things go sour? I hope the former but fear the latter.",
        "created_utc": 1410684757,
        "upvote_ratio": ""
    },
    {
        "title": "I need a good biography of the prophet Mohammed.",
        "author": "JacktheStripper5",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gbote/i_need_a_good_biography_of_the_prophet_mohammed/",
        "text": "",
        "created_utc": 1410647823,
        "upvote_ratio": ""
    },
    {
        "title": "Phil Plait: Don't Be A Dick",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gasw1/phil_plait_dont_be_a_dick/",
        "text": "",
        "created_utc": 1410627394,
        "upvote_ratio": ""
    },
    {
        "title": "TrueAtheism: How do you feel about the recent posts from PZ Meyers about Sam Harris and Richard Dawkins about feminism in the skepticism community?",
        "author": "Roku2021",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gacty/trueatheism_how_do_you_feel_about_the_recent/",
        "text": "",
        "created_utc": 1410615608,
        "upvote_ratio": ""
    },
    {
        "title": "What's happening here?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2gab5q/whats_happening_here/",
        "text": "This was in my hotel room drawer, and not the usual bible. http://imgur.com/vG5xyeQ\n\nAre they taking over? Are they joining the crusading christians to up their numbers in order to have world dominance? Or is this their single-handed effort to oust everyone else?",
        "created_utc": 1410614039,
        "upvote_ratio": ""
    },
    {
        "title": "What religious figure was: born on the 25th December? without a human father? had a sacred day of Sunday? ascended to heaven? considered a great traveling teacher and master? performed miracles?",
        "author": "pseudonym1066",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ga33w/what_religious_figure_was_born_on_the_25th/",
        "text": "",
        "created_utc": 1410604661,
        "upvote_ratio": ""
    },
    {
        "title": "The Old Testament vs the New Testament. Not what you think",
        "author": "AnAssyrianAtheist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g9ip4/the_old_testament_vs_the_new_testament_not_what/",
        "text": "It's a question, really. Why do so many people feel the need to only bring up the Old Testament when discussing Christianity and the sects below that? How is it, for people to claim to be so well educated in the religion, seem to only bring up violence, rape and murder in the Old Testament?\n\nYes, I understand that a lot of it was in those nearly 50 books, however that was before Christ \"existed.\" So, if people are going to talk about all those terrible things, wouldn't it be best to give examples from the *New* Testament instead? \n\nThe Old Testament has nearly 50 books, around 46, I believe, 5 of which are part of the Torah, the first 5. When people discuss the raping, pillaging, murder and other horrific things, they're talking about the Torah. \n\nDeuteronomy—also known as the Pentateuch is a perfect example of that. I have seen so many people bring this up. It has nothing to do with Christianity, yet people bring it up in arguments about how terrible the Christian religion once was.\n\nIf the Torah and the books thereafter were written, truly, before \"Christ,\" then these books have NOTHING to do with Christianity. If they were to give examples of these violent acts from the New Testament, I'd have more respect for their arguments.\n\nCan anyone explain to me why people do this? Are they just searching for things to argue about?",
        "created_utc": 1410581432,
        "upvote_ratio": ""
    },
    {
        "title": "How do you respond to something like this?",
        "author": "YourBurrito",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g9ia0/how_do_you_respond_to_something_like_this/",
        "text": "",
        "created_utc": 1410581089,
        "upvote_ratio": ""
    },
    {
        "title": "Rage control tips",
        "author": "Nick_FTN",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g9dnx/rage_control_tips/",
        "text": "",
        "created_utc": 1410577512,
        "upvote_ratio": ""
    },
    {
        "title": "How can I accept my extremely religious friends?",
        "author": "mousecoloured",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g99v0/how_can_i_accept_my_extremely_religious_friends/",
        "text": "My best friend is christian, and I can live with that. She isn't interested in arguing beliefs or trying to change me. But her husband, who I also see as a friend, is set in his ways and he loves to argue. Although at this point I wouldn't even call it arguing. We can be arguing for hours, but at the end of it he says \"You're wrong, I'm right, and that's that.\" He gets mad with the response \"agree to disagree\", as he thinks its a cop-out. He thinks as a follower of christ he needs to argue with people, deliver the \"truth\" even if that means arguing for a lifetime.\n\nDon't get me wrong, he doesn't go and insert his faith into peoples lives. Our argument started on equality, he thinks it can never exist. That eventually twisted itself into religion, which at that point I wasn't arguing. I can't convince a christian the belief in a god is silly. I don't even try. But today I feel so defeated, because I've just been drowned in religion and didn't even try to discredit him. \n\nObviously I can just avoid sport arguments in the future, but that I have a new insight into their beliefs, it's really hard for me to accept them as friends I want to be around for the rest of my life. \n\nHow can I find peace with this? ",
        "created_utc": 1410574648,
        "upvote_ratio": ""
    },
    {
        "title": "Did Jesus really exist?",
        "author": "zodiac859",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g8z5d/did_jesus_really_exist/",
        "text": "What do you guys think?  Here's a recent interview talking about it: http://anamericanatheist.org/2014/09/05/the-historicity-of-jesus-with-david-fitzgerald/  \n\nI personally don't think he did exist and even if there is some person named Jesus it's so distorted and distant from who he was that it's pointless to even ask the question if he existed or not.",
        "created_utc": 1410566726,
        "upvote_ratio": ""
    },
    {
        "title": "The Unbelievers with Lawrence Krauss and Richard Dawkins is now on Netflix.",
        "author": "villanovablues",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g8t0h/the_unbelievers_with_lawrence_krauss_and_richard/",
        "text": "",
        "created_utc": 1410562661,
        "upvote_ratio": ""
    },
    {
        "title": "Is it OK for an atheist to worship nature?",
        "author": "thorsblade888",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g81bx/is_it_ok_for_an_atheist_to_worship_nature/",
        "text": "I was at a small lake surrounded by mountains a couple days ago &amp; couldn't help myself.  I miss \"worshipping\" as I did as an Evangelical Christian for many years, but now know that there's probably nothing supernatural out there.  Within the process of evolution, there's only the cosmos.  We are only tiny specks within it.  But I'm so grateful to be here for this brief time, to be alive.  And nature, when it hasn't  been wrecked, is so wonderful!",
        "created_utc": 1410546774,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist Communities",
        "author": "BatshitFernandez",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g7uec/atheist_communities/",
        "text": "I am a proud atheist and have been from a young age, but as I get older I feel as if I would be happier if there was a community of atheist people near me that could meet and regularly discuss thoughts on morality, epistemology and the like and not just a \"Christianity is dumb\" club.        \n\nWould anyone happen to know of any similarly minded groups or efforts?",
        "created_utc": 1410542952,
        "upvote_ratio": ""
    },
    {
        "title": "What do you guys think of this new morality study...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g7kid/what_do_you_guys_think_of_this_new_morality_study/",
        "text": "http://www.sciencemag.org/content/345/6202/1340\n\nThey used a sample of 1200 people, religious and nonreligious, to study moral decisions outside the lab. One of the findings was that there was no difference in moral capacity. They also did this in non-lab conditions. That's a direct link to the actual study above.\n\nThoughts? Perhaps this might be a good resource to use in the future, alongside the prayer effectiveness studies.",
        "created_utc": 1410537494,
        "upvote_ratio": ""
    },
    {
        "title": "Counter-apologetics: The design argument of personal incredulity.",
        "author": "Cryo84",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g7a6z/counterapologetics_the_design_argument_of/",
        "text": "\"Complexity complexity complexity complexity complexity!\" says the theist when railing against naturalism, but what IS complexity, exactly? To my mind, something is complex because it is not simple, and something is simple because it is not complex. These are both seemingly subjective, and inter-dependant assessments. \n\nIs there some unit of measurement by which we can objectively quantify 'complexity?' If there is no such unit of measure, can we then say that the argument from design is a mutation of the argument from personal incredulity? \n\nIf I am wrong, or missing something, please correct me before I continue to think wrongly. ",
        "created_utc": 1410531346,
        "upvote_ratio": ""
    },
    {
        "title": "DAE feel completely at peace with death?",
        "author": "MrRykler",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g6yoh/dae_feel_completely_at_peace_with_death/",
        "text": "I was raised in a fundamentalist Christian home, where heaven and hell were preached regularly. After I left my faith behind, my fear of hell went with it. \n\nI think the reason I don't fear death is because I have no control of it. It may come at any moment, and it most likely won't be my fault. I see posts on here all the time about fearing death and I just don't get it. It is what it is, it'll happen. I mean, I don't *want* to die; I've struggled with depression before and even tried to off myself once, but since then I just have this overwhelming peace about life and death and existence.\n\nIf transhumanism becomes a thing that would be cool, and I'm all for extending life, but I'm not scared of not living forever. I just don't get the fear that I see on here at all.\n\nEdit: I'm really trying to understand you guy's point of view, but it's just incomprehensible to me. I really don't understand the fear.",
        "created_utc": 1410522659,
        "upvote_ratio": ""
    },
    {
        "title": "Since it's obvious that God doesn't exist, then doesn't that mean human life is just as worthless as any other life on the planet?",
        "author": "Okmanl",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g6npr/since_its_obvious_that_god_doesnt_exist_then/",
        "text": "Humans are just more intelligent. They are no more \"special\" than any other life that exists on the planet. \n\n\nIf you believe that human life is more special than any other life that exists on the planet, then how are you not as delusional as people who believe in God?\n\nAnts can build extremely organized colonies despite having tiny brains. But that doesn't mean that they're a divine creation.\n\n\n\nTherefore what is the point of me being more appalled about who ISIS beheads or how many people are starving in North Korea, than ants committing genocide or enslaving another ant colony?\n\n\nWhy should I be more appalled of someone getting murdered on the news than somebody hunting deer just for the sport of it?\n\n\nJust because they're human? Except the reality is that human life is just as worthless as ant life or deer life.  In fact human life is probably more worthless since they're the only ones who are destroying the planet.",
        "created_utc": 1410510491,
        "upvote_ratio": ""
    },
    {
        "title": "What if it's an *atheist* in the Air Force who changed the rules in order to trigger precisely the showdown we are seeing? [x-post /r/atheism]",
        "author": "Ohthere530",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g6n8e/what_if_its_an_atheist_in_the_air_force_who/",
        "text": "",
        "created_utc": 1410509954,
        "upvote_ratio": ""
    },
    {
        "title": "How to approach a fundamentalist parent?",
        "author": "linoleum79",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g5lpd/how_to_approach_a_fundamentalist_parent/",
        "text": "Where do I begin. I was raised in a extremely fundamentalist, biblical literalist, sort of house hold. Most of our learning of 'Christianity' was from my father at home.  Throughout my childhood we must have bounced around between 20+ churches.  Every new church we would attend, was always short lived, and always for the same reason. My dad's version of Christianity would conflict with another's version of Christianity. Debates, arguments, and conflict would ensue. Which would always end with us leaving the church. This same mentality,  and the same circumstances followed us everywhere.  Both in and out of church.  Friends. Family, loved ones.... my dad would disagree,  and we would be forced to leave.  This continued most of my childhood and adolescent years until my dad finally gave up on attending any church. As, they all had Christianity wrong, and my father had it right.\n\n My dad always had a temper, and a short fuse. I would label his behavior as mildly abusive... I know people will probably say no such thing exists, it's abusive or it's not. But. ... I don't know. He would hit, throw things, Swing belts wildly, i took a large phone book to the face once. .. would get angry, yell,  would regularly tell my mom to shut up, insist that women be submissive etc etc.. Because of this, I also had a short fuse throughout my childhood. I was told around the age of 20 or 21, that I had to move out. I have been on my own since then. Put myself through school, have a pretty decent job, am now married with a child and 1 on the way. Things are really exceptionally well for me and my family. I've never been happier. \n\nI remember once when I was probably 14 or 15ish, my little brother did something trivial to piss me off. I got upset and hit him (on the butt...wonder where I learned that). What followed was one of,  if not the most defining moments of my life.  My dad lost his cool, started yelling, and hit me... I lost my cool back for the first time.  I got in my dad's face, and told him that he would under no circumstances ever hit me again. My dad didn't back down, in fact, He balled up both his hands into fists... we were staring each other down... I had so many thoughts running through my head. I was certain this would end in a fist fight.  I was ready for it, I was ready to stand up for myself. I was willing to do that if necessary. A moment passed, I didn't get punched. .. I walked away.  What followed was one of the most profound realizations of my life.  The worst thing I could do in my life, is to be like my father. This nightmare has followed me to this day.  Every day, I have the fear,  will I be like my father today? Will I treat my son how my father treated me? I'd rather die. That day, after the Mexican stand off.... it was like a switch went off inside me. I was more friendly, calm, cool, collected,  could count the times I lost my cool in the 20 years since on 1 hand. I did, and still do everything in my power to be calm  understanding,  accepting, kind and loving. People always comment, whether friends, coworkers etc that I \"never lose my cool\". . . \n\n Throughout Most of my 20s I struggled with Christianity. But I diligently read my bible daily, prayed daily, asked for faith,  asked for understanding, I wanted to be a good Christian.  It took almost 10 years to realize,  that I didn't need Christianity.  That it was a lie. The usual deconvesion story, stopped justifying the things that I couldn't make sense of, and started becoming more informed. Read Harris, Dawkins, Ehrman, all the great authors in the world of atheism. Must have watched 1000 videos on YouTube. I was hungry, I wanted it all.  Which brings me to now. \n\n I know that my father is incapable of hearing any sort of rational discussion.  I've never told him in any way that he should not believe in God,  that he should not be a Christian,  or anything of the sort. And I have never approached him to talk about religion, faith, the Bible etc. I know it's counter productive. But on a few occasions, usually brought on by comments he makes, I have questioned some of the things he taught us, and experiences we had jumping from church to church. \n\nOne quick example is, our entire childhood, neither of my parents drank alcohol. Not once. It was a sin. Like all sins, Punishable by eternal torment in the pits of hell. My dad regularly taught us that. And when other christians would discuss the subject with him, and express that they thought drinking alcohol in moderation was ok. .. he would quickly disagree. . . And those disagreement often ended with us removing that person from our life (see Titus 3:10).  Well, my dad now drinks alcohol.  Beer, wine, liquor... you name it. Which i am a ok with. But it brings up the question..... Was your previous line of thought wrong,  or is your current line of thought wrong... it can only be one or the other after all. I asked him.  He denied that he taught us that alcohol was a sin. That he was never opposed to it. I cited specific situations with specific people in specific locations where he said otherwise. He simply denies it. He went on to say that the ONLY REASON he ever drank was for \"medicinal\" purposes. Yup, those 20 beers on the beach. .. medicinal. I can't make this nonsense up. Anyways, this is one of 1000s of examples, and one of only a half dozen or so i have asked him about.  All of which end with his refusal to admit any sort of wrong doing,  often lying and talking in circles. (Including his physical aggressiveness throughout my childhood). He has, and I mean this,  literally. Never one time that I've ever heard or witnessed, admitted that he was wrong. Ever. To this day.  \n\nMy sister once said that, \"I think dad has Asperger syndrome, it's the only thing I could ever think of that explains his bizarre behavior\" (primarily in his inability to socialize normally,  carry on healthy interpersonal relationships etc). I was blown away.  That made so much sense... I started reading everything i could about Asperger syndrome, and it seemed like a perfect explanation. \n\n Now I'm trying to assess,  is a healthy relationship with this person even possible? I mean, he has never ever been a \"father figure\" as far as a person you can talk to about life, or problems. He seldom expressed emotion other than anger.  We've never had a single, valuable, meaningful \"father son talk\". So, being totally realistic. I know we will never have any sort of meaningful emotionally available relationship.  But I'm finding more and more,  that just tolerating him or having even a empty meaningless small talk, is increasingly difficult.  It's difficult.  I mean I  think everyone wants to have that sort of relationship with their parents. ... luckily my father in law is awesome. He is the father figure in my life. We have great discussions about life,  love. Relationships,  advice, you name it.  He's calm, collected,  friendly,  accepting of others (he's a religious man). I have had more father son discussions with him than i have with my dad (which is 0 Lol).\n\n Anyways. I know this was long. I'm just venting. It's been a rough day. Wondering if it's worth it to even try. I sure there are some of you who have been through similar. Figured you'd have some advice. Thanks!!!",
        "created_utc": 1410481165,
        "upvote_ratio": ""
    },
    {
        "title": "Officiating a secular wedding. Need some advice.",
        "author": "goGlenCoco",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g58tr/officiating_a_secular_wedding_need_some_advice/",
        "text": "Hey, guys. I posted this question in /r/wedding but I thought I would also seek advice here. I'm officiating a secular wedding in April. I've never done this before. I'm going to be working with the couple directly but I was curious if there is a general outline or script that officiants tend to follow? Does anyone in this sub have any experience with officiating a secular wedding or any couples have any tips? Thanks!",
        "created_utc": 1410473250,
        "upvote_ratio": ""
    },
    {
        "title": "Difficulty accepting death: This life isn't good enough",
        "author": "The_Deep_Sea_Dragon",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g55hs/difficulty_accepting_death_this_life_isnt_good/",
        "text": "Warning: Rant/Rambling\n\nI've been having a very bad month and it's giving me time to think. I've felt alone and it's pretty bad. This isn't much to do with religion, you understand, but I've been mulling over life and death lately as a result.\n\nI haven't talked about religion much recently because I've been exhausted of dealing with the same tired and easily debunked arguments from theists. So usually my quick way of dealing with the matter is to tell off god, Jesus, and them. But in saying I don't care if god exists, I'm lying.\n\nI'm lying because I don't want to die and I don't have any feasible options around it. I remember the *exact* moment as a little kid when I realized I was going to die. I don't know what brought it about, but I remember I was sitting at dinner holding some kind of transformer or something. My dad was the only one there with me at the time. I remember my exact words were, \"Daddy, I don't wanna die\". \n\nMy dad told me not to worry about death, that it wouldn't come for a very long time. He also reassured me that when that time came I would be with Jesus in heaven where I would live forever. \n\nThat calmed me for awhile and it gave me the resolve to shake off the time a few years after when I was almost killed by a roof. Luckily I was very fast on my feet. But then I became a teenager and realized it was all a lie, there was no Jesus and no heaven. I realized that I was going to die and there was nothing I could do to stop it.\n\nIt didn't help having that on my mind as an angsty teen. And it lead to the year I almost killed myself. Obviously I didn't. Someone helped me get through it. But that didn't change the fact that one day I *would* die and that would be the end of it. \n\nThe truth is that I wanted there to be a god. I still do, pointless though that is. Because I want what was promised to me.",
        "created_utc": 1410471404,
        "upvote_ratio": ""
    },
    {
        "title": "What do I do for a wedding?",
        "author": "ecook123",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g4url/what_do_i_do_for_a_wedding/",
        "text": "I'm a former Christian, my fiance was Jewish, now we are atheist. Where do we get married and who should marry us!?! We actually just don't know what would be considered acceptable, not cost a huge amount, and would still be nice.",
        "created_utc": 1410465774,
        "upvote_ratio": ""
    },
    {
        "title": "What is the single biggest question that would need an answer for you to reconsider Christianity?",
        "author": "McPolypusher",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g4q8c/what_is_the_single_biggest_question_that_would/",
        "text": "A question that my brother (still Christian) sprung on me (former Christian)… \n\nI’m intrigued by the way he phrased it. \nIt is of course tempting to just waive a bible and say “Why the hell should I believe any of this shit?” or something smart-ass like “Did Jesus know about penicillin?“, but that is not conducive to civil discourse.\n\n\nSo there is the setup: You get one question which, if adequately answered, would lead you reconsider Christianity. I think there is also an ulterior motive in composing a question which, if he attempted to adequately answer, would lead *him* to reconsider Christianity. \n",
        "created_utc": 1410463407,
        "upvote_ratio": ""
    },
    {
        "title": "A question for former theists regarding the \"feeling\" of a divine presence in their former experience.",
        "author": "izumo13",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g2n2d/a_question_for_former_theists_regarding_the/",
        "text": "For those who are formerly believers, how would you describe the feeling that theists of varying types attribute to having a spiritual experience?\n\nI grew up a family where religion was never thrust upon me as a child.  It was an option for me and my sister to explore, if we so chose, but I never chose to go down that path.  \n\nI've never really felt that I was missing much there.  I am, however, left in the position of not being able to say with any certainty that I can identify with the emotions that a religious person feels through their faith.\n\nI've certainly had a broad range of emotions:\n\nI've felt awe when viewing the night sky or a beautiful landscape.  \nI've felt a chilling, tingling rush that comes over me when I hear just the right piece of music at the right time.  \nI've felt inspired by powerful speeches.  \nI've felt wonder at experiencing phenomena that I could not, at the time, explain.\nI've felt a feeling of serenity and accomplishment when experiencing success in an endeavor I was passionate about.\n\nI do believe that it is difficult to compare experiences between one person and another.  Sometimes it's even hard for me to compare one of my experiences to any other of my experiences.  Descriptive language seems likely to fail when explaining to another person how something feels to yourself.  Therefore, I think that my understanding of a 'religious experience' is inadequate, because I've never felt it myself.\n\nSo, to you former believers out there, how did what you felt during your religious experiences compare to the emotions you've felt in other parts of your life?\n\nDo you find that the same kinds of feelings come over you in different situations, or did your experiences within the religious context stand apart from everything else?\n\nFor the purposes of this question, I'm more than happy to assume that anyone who answers is being sincere about their past beliefs.  The whole \"if you're not now, you never were\" routine that some apologists throw out there is weak tea in my book.",
        "created_utc": 1410407441,
        "upvote_ratio": ""
    },
    {
        "title": "I Found A New Secular Think Tank . .",
        "author": "Ongbun001",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g21t3/i_found_a_new_secular_think_tank/",
        "text": "",
        "created_utc": 1410394278,
        "upvote_ratio": ""
    },
    {
        "title": "What's your thoughts on the Askreddit thread about atheist converting to theism?",
        "author": "Qwisatz",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g1pl2/whats_your_thoughts_on_the_askreddit_thread_about/",
        "text": "To be honnest at first I was surprised and curious to see how exactly someone who left religion can come back, for me it's really hard to believe again (just like if I try to believe in santa again) after all the conclusion I came through in religion\nAfter I read the thread for most the commenters weren't atheist or to be more precise skeptical. Either they never thought about religion and for them they were atheist by default or they left it for emotional reason, thus they also came back for the same reason\n",
        "created_utc": 1410387052,
        "upvote_ratio": ""
    },
    {
        "title": "Brainwashing 101",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g17hw/brainwashing_101/",
        "text": "",
        "created_utc": 1410377299,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist must swear to God -- or leave US Air Force",
        "author": "don_nerdleone",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g11t4/atheist_must_swear_to_god_or_leave_us_air_force/",
        "text": "According to the [article](http://news.yahoo.com/atheist-must-swear-god-leave-us-air-force-232153866.html), the unnamed serviceman is filing suit against the federal government. His argument is that the holy requirement is unconstitutional.\nThe Air Force is the only US military branch that requires an oath to god, and has been criticized in the past for evangelical ties. \n\nI went to a USAF (JROTC) military school as a teenager, and church was mandatory every Monday morning. Christianity certainly wasn't 'shoved down our throats' or anything - in fact, one of my favorite instructors was openly agnostic. Regardless, the details of this story are wholly offensive to a nonbeliever such as myself, especially as I am preparing to enlist in the USAF. This requirement, which is mandated *by the government*, seems to be unequivocally unconstitutional in my view. What do you all think?\n\nhttp://news.yahoo.com/atheist-must-swear-god-leave-us-air-force-232153866.html",
        "created_utc": 1410374254,
        "upvote_ratio": ""
    },
    {
        "title": "/r/Christianity cookbook invitation!",
        "author": "StandardToaster895",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g0k6t/rchristianity_cookbook_invitation/",
        "text": "",
        "created_utc": 1410364959,
        "upvote_ratio": ""
    },
    {
        "title": "The problem with that Mark Twain quote and why it doesn't comfort me on death",
        "author": "GenericsAtWork",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g09jn/the_problem_with_that_mark_twain_quote_and_why_it/",
        "text": "“I do not fear death. I had been dead for billions and billions of years before I was born, and had not suffered the slightest inconvenience from it.”\n\nEveryone keeps citing this quote making it sound as if death is chilled since we've been in that state before.\n\nThe big problem with this is that unlike non-existence previously, you actually ended up EXISTING after that when you were born. Once you die, and return to non-existence, as far as we know that's pretty much it.\n\nI've never found that quote very comforting for that reason. Anyone else feel the same?",
        "created_utc": 1410358890,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of the ruling by the courts on allowing Muslims beards and turbans in the US military?",
        "author": "SecretWalrus",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2g08lq/what_do_you_think_of_the_ruling_by_the_courts_on/",
        "text": "[Here is one article](http://www.washingtonpost.com/local/pentagon-clarifies-rules-on-beards-turbansfor-muslim-and-sikh-service-members/2014/01/22/13b1fc22-83a9-11e3-9dd4-e7278db80d86_story.html) from the Washington Post on the ruling. \n\nNow I'm going to say straight up front that I have never been in the military, I have a few friends that have and if I'm not mistaken beards are not allowed, if I'm wrong please tell me. I can ask some of my friends when I get off work, but I swear I remember a friend of mine telling me that once. \n\nIf it's true then to me they are being allowed special privileges as the Washington Post report that Muslims are allowed to wear beards, turbans, scarfs, etc \"as long as the practices do not interfere with military discipline, order or readiness.\"\n\nI don't mind Muslims displaying their faith so much, but if it is a military rule that you're not supposed to wear a beard, Muslims shouldn't be allowed simple because of their religion. ",
        "created_utc": 1410358303,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think its possible for an Atheist to \"conver back\"?",
        "author": "Sutacsugnol",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fzm3y/do_you_think_its_possible_for_an_atheist_to/",
        "text": "So, after being foolish enough to go through the replies at that thread about this topic in /r/AskReddit I feel like I have to get this out.\n\nDo you guys think its possible? I personally don't think so, but at the same time realize my rationalization is pretty close to \"No true Scotsman\".\n\nI know theres some people that claim they converted back from atheism, but when you read their stories most were mad at god, their life and genuinely rebelling(which most of us were probably accused of too). I just don't think its possible to choose to believe after you arrived at the conclusion that theres no god. \n\nI do think it is possible to \"convert back\" when you became an atheist for emotional reasons, but, are those people really atheists to begin with?\n\nI feel like this is a really touchy topic, because of some experiences I'm sure some of us have had with religious family and friends going the whole \"you'll convert eventually when life teaches you a lesson\" route.\n\nTo me, nothing short of a god presenting itself to me would make me change my mind, and even then I wouldn't really go the worshiping route, since most are assholes and/or tyrants. Hell, I could just think I went insane too.",
        "created_utc": 1410337438,
        "upvote_ratio": ""
    },
    {
        "title": "Would life be better without religion?",
        "author": "James4353",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fzdk7/would_life_be_better_without_religion/",
        "text": "So, I'm wondering how many other atheists have doubts on the idea that the negative effects of religion outweigh the benefits. Through most of my adult life, I've thought of religion as overwhelmingly negative. Causing religious killings, hate towards sinners, and in America they create some laws based on what is almost certainly a fantasy. But I've been wondering recently if religion wasn't around, would humanity just twist other beliefs into harmful ideas about the world. You could easily take a belief in evolution; that we are the product of millions of years of the strongest species surviving to bread while the weak die. So why are we keeping our weakest alive? The disabled, the useless individuals who take and give nothing back. Let's just kill them. That's what evolution demands. This is obviously a deluded way of thinking, but people have thought this way in the past and some people still do. So I'm curious if other atheists have thought about whether there would really be a significant improvement in life for the average person if religion ceased existing. Since study into our psychology has already proven that we are self deluding, is it possible we will just find other reasons to kill, to hate, and to feel superior? Looking forward to reading your responses ",
        "created_utc": 1410328429,
        "upvote_ratio": ""
    },
    {
        "title": "All atheist-experience.com archive video links are gone. What's going on?",
        "author": "king_of_the_universe",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fz27n/all_atheistexperiencecom_archive_video_links_are/",
        "text": "",
        "created_utc": 1410319709,
        "upvote_ratio": ""
    },
    {
        "title": "An atheist goes to church...and lands a job!",
        "author": "GrayMattersBlog",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fyxs6/an_atheist_goes_to_churchand_lands_a_job/",
        "text": "",
        "created_utc": 1410316890,
        "upvote_ratio": ""
    },
    {
        "title": "Really fun logic test",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fyvuk/really_fun_logic_test/",
        "text": "",
        "created_utc": 1410315674,
        "upvote_ratio": ""
    },
    {
        "title": "I recently heard about Mark Driscoll's comments and found more videos of his obscene character.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fyhf3/i_recently_heard_about_mark_driscolls_comments/",
        "text": "",
        "created_utc": 1410307099,
        "upvote_ratio": ""
    },
    {
        "title": "Does the \"compass of belief\" really only show 4 possibilities?",
        "author": "Histidine",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fyeqq/does_the_compass_of_belief_really_only_show_4/",
        "text": "A common view in the atheist community is there are basically 4 types of belief, represented by the [graph seen here](http://actok.org/faqs/whats-the-difference-between-an-atheist-and-an-agnostic/).  Those 4 beliefs are:\n\n1. Gnostic Theist (+,+)\n\n2. Gnostic Atheist (+,-)\n\n3. Agnostic Theist (-,+)\n\n4. Agnostic Atheist (-,-)\n\nThis view has always bothered me because I don't feel like any of these 4 options accurately convey what I or many \"pure agnostics\" believe.  I've wondered if the graph was wrong in some way, but it struck me recently that maybe we just haven't labeled all the possibilities shown.  These graphs take the form of Cartesian coordinates, showing how two variables interact in both the positive and negative range.  The standard 4 labels assume that the value of either gnoticism or theism will be either positive or negative, but what if that value was zero instead?\n\nSomeone who identifies as purely agnostic would be someone who was in the range of (0,+) to (0,-).  In both cases the person would answer \"I don't know\" to the question \"Does God exist\" with the former (0,+) believing that it is impossible to know if God exists while the later (0,-) would not claim to know this position to be true.  I've also met people that had a definitive belief or non-belief in God, but lacked any justification for this belief representing cases where Gnosticism = 0.  The last belief would be the midpoint of the graph (0,0) representing someone who simply doesn't know and doesn't care about the question of God.\n\nSo what do people think, are there 4 positions on this graph or 9 as I suggest here?  Are there more variables to consider?",
        "created_utc": 1410305471,
        "upvote_ratio": ""
    },
    {
        "title": "Is Religion the Problem, or is it Human Brains? [x-post from r/atheism]",
        "author": "Ohthere530",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fxk1x/is_religion_the_problem_or_is_it_human_brains/",
        "text": "I am an atheist who is deeply frustrated with the bad behavior that can be associated with religions. It's tempting to think that religion is the problem and that eliminating religion would eliminate the problem.\n\nI have a hunch this isn't true.\n\nI see similar behavior whenever people divide into groups. My sports team is better than yours. My political party, my race, my nation is better than yours. In all of these cases, insults and sometimes violence ensue. Religion is one potent form of group identity, but nationalism and racism aren't far behind.\n\nThe point being, eliminating religion won't solve the problem. We will still need to teach people to be tolerant of other groups. And if that's the case, maybe teaching people tolerance will turn out to be even more important than converting them to atheism.\n\n(That said, I am a proponent of people coming out as atheists and promoting atheism. Atheists are one group of people in need of more tolerance from others.)",
        "created_utc": 1410288956,
        "upvote_ratio": ""
    },
    {
        "title": "Would the Apostles die for a (known) lie? Plausibly.",
        "author": "Eratyx",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fxfqv/would_the_apostles_die_for_a_known_lie_plausibly/",
        "text": "The standard Christian argument goes something like this: The Apostles were martyred for refusing to recant their belief in the risen Christ. Nobody would refuse to recant what they knew to be a lie. Therefore their being martyred is strong evidence that Christ was resurrected.\n\nI had a heated discussion with another atheist in my house over this proposition. Fortunately we agree that the conclusion does not follow, but he seems to think that the second part is nearly always true, that nobody would sacrifice their life defending a known lie.\n\nObjection 1: People often go to their death protecting their loved ones. If becoming a martyr achieves this end, this is sufficient motivation.\n\n* Rebuttal 1: This is no longer dying \"for a lie,\" this is dying \"for the protection of their loved ones.\" If you were told that your death would not achieve that goal, making that the new \"lie,\" then you would not go through with it.\n\nObjection 2: Your public beliefs that you are martyred for need not line up with your private reasons for being martyred. One who is martyred for a sincere belief, and one who is martyred for instrumental reasons, look exactly the same on the surface.\n\n* Rebuttal 2: People do what they must to survive, and if recanting would get them off of Caesar's radar, they would recant. What they actually did was run away, preserving their belief.\n\nObjection 3: There are plenty of examples where people would rather die than lose face, who would rather be remembered as a glorious martyr than a man without principles.\n\n* Rebuttal 3: There is no glory in becoming the martyr of a tiny new religion that closely resembles the other hundreds of new prophetic religions popping up constantly.\n\nObjection 4: The Apostles may have enjoyed their position as spiritual leaders, not content to be mere Jews.\n\n* Rebuttal 4: If they wanted to continue leading this tiny group of Christ followers, why did they run away?\n\nObjection 5: The Apostles may have lost their faith upon seeing Jesus fail to rise, but still believe that maintaining the faith of their people is a good thing, that makes them good and virtuous people. Judaism is ripe with this sentiment.\n\n* Rebuttal 5: Without the risen Christ, the Jews the Apostles were looking after would have happily been reabsorbed into the larger Jewish community. They would not have maintained belief in Jesus when there were no benefits to themselves, especially under threat of persecution.\n\nObjection 6: Consider \"true believers.\" They would have outcast or killed the Apostles if they recanted, much like a drug addict who snitched their dealer would be killed soon after getting back on the street.\n\n* Rebuttal 6: There would be no gain to doing this. Again, they would have happily rejoined the larger Jewish community, if it would keep them away from persecution.\n\nObjection 7: You think way too highly of other people's reasoning capabilities and selfishness.\n\n* Rebuttal 7: And you think that people would not take the obvious best option for themselves.",
        "created_utc": 1410286656,
        "upvote_ratio": ""
    },
    {
        "title": "Good blog post from an ex-muslim",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fx82q/good_blog_post_from_an_exmuslim/",
        "text": "",
        "created_utc": 1410282530,
        "upvote_ratio": ""
    },
    {
        "title": "Do we have a responsibility to help people who are 'taken in' by churches?",
        "author": "MaxSupernova",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fx7zd/do_we_have_a_responsibility_to_help_people_who/",
        "text": "I was reading the recent [Megachurch to close](http://www.reddit.com/r/news/comments/2fwlcs/megachurch_to_close_after_pastor_called_women/) thread in /r/news, and I got onto a bit of a rabbit trail following links upon links from the story.\n\nI found this in a comment from an ex-pastor at a Mars Hill franchise:\n\n&gt;There is much to be learn for ^[sic] the Mars Hill phenomena. Don’t dismiss the hunger and openness to be influenced represented in those ages 18 through 30. Invent content that is useful and distribute it freely on the web. Always incorporate creatively some explanation of the gospel at the end of every teaching session with an invitation to do business with Jesus.\n\nIt shows the callous marketing that happens.  These people are *hungry and open to being influenced*.  The idea of *doing business with Jesus*.  Inventing content and creatively tucking Jesus into things to set the hook.\n\nThe psychology of manipulation, and the using of people's base needs against them is unconscionable in this type of situation.  It's no different than P.T. Barnum (\"This way to the Egress!\").\n\nI was involved in a worship team at a reasonably large church and one of the things that led me to the process of leaving the church was the blatant manipulation that the leaders planned.  Set lists were designed by guys with secular bands, in the same way.  Start big, slow down, build to a climax, the same way that Britney brings crowds to screaming messes.\n\nOnce you step behind the curtain even a little bit, the cynicism and salesmanship is unbelievable.\n\nI look back on my days in the church and I just want to shake people and yell \"Can't you see you're being sold a product?  You are wasting so much money!  You are being manipulated and treated as a market!\".\n\nSo, in discussion:  How can the secular community combat this?  Is it just education about how the churches are doing it, or is there a responsibility to offer something else that meets those needs in a healthier way?  I know \"atheist communities\" are a controversial topic, but what else can we do to prevent the churches from sinking their hooks into impressionable people?  Should we?\n\nBah.  I need to stop reading these articles.  It just gets me all upset.",
        "created_utc": 1410282483,
        "upvote_ratio": ""
    },
    {
        "title": "\"You Didn't Seem Like An Atheist To Me\"",
        "author": "GingeousC",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fx08t/you_didnt_seem_like_an_atheist_to_me/",
        "text": "In a class in high school, an acquaintance of mine started talking on the subject of religion. I believe he said he was Catholic, and he asked if I was Catholic as well. When I answered \"no\", he basically went down the line of other Christian denominations - \"Lutheran?\" \"Baptist?\" etc. - until he finally asked \"are you an atheist?\", to which I replied \"yes.\"\n\nHis response was something along the lines of \"Huh, you didn't seem like an atheist,\" and something about how we were in the same English class, and that I always made such well-thought-out arguments.\n\nI thought nothing of it at the time until I later thought: \"if you didn't have me pegged as an atheist, then what does an atheist look like?\"\nIf I was overly angry and poorly-spoken, would *that* have made you think I was an atheist? Do atheists have to be aggressive debaters that don't think things through properly? Do they have to be mean people?\n\nThis was undeniably a form of prejudice, but not an over-the-top negative one. Still, the fact that he explained his prejudice so straight-forwardly bothered me in retrospect, since he seemed genuinely surprised at my atheism. \n\nHas anyone else had a similar experience of meeting this kind of prejudice, and what did you think of it?\n\n\n\n\n\n(On the off chance you read this, high school acquaintance of mine, I don't take offense now, and I don't think you meant anything by it.)",
        "created_utc": 1410278314,
        "upvote_ratio": ""
    },
    {
        "title": "[Discussion] The pre-existence of Dinosaurs contradicts what the Bible says.",
        "author": "tjakoen",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fwxp8/discussion_the_preexistence_of_dinosaurs/",
        "text": "",
        "created_utc": 1410276850,
        "upvote_ratio": ""
    },
    {
        "title": "How are Theists so good at getting donations / living off their religion?",
        "author": "atheist1012",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fw990/how_are_theists_so_good_at_getting_donations/",
        "text": "I have plenty of religious people I know who's main occupation seems to be 'religion'. These people do basic pastoring, run religious websites, spread the word of god etc and yet they seem to live fairly luxurious lives, with homes, new cars etc. But the thing is they never seem to be doing any work. I am absolutely perplexed at how these people with jobs seem to make a living by singing at church events and running sunday schools. ",
        "created_utc": 1410259056,
        "upvote_ratio": ""
    },
    {
        "title": "What are your views on...",
        "author": "flipguy_",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fvvup/what_are_your_views_on/",
        "text": "",
        "created_utc": 1410244347,
        "upvote_ratio": ""
    },
    {
        "title": "Is everybody a Humanist these days?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2futzi/is_everybody_a_humanist_these_days/",
        "text": "I have just started [this book](http://www.amazon.com/gp/product/1476754314/) and it got me thinking, it feels like everyone in the community here and in most current books i've read by popular atheists are Humanists.\n\nIs there anyone here not willing to call themselves a humanist? Any Naturalists? Is everybody pretty optimistic about life or are there any pessimists? I'm pretty sure there are not too many Nihilist's these days, but if you are please share. Is Humanism pretty much considered the \"right way\" to go about life these days?\n",
        "created_utc": 1410219372,
        "upvote_ratio": ""
    },
    {
        "title": "People are suspiciously nice when they hear I'm an Atheist.",
        "author": "madmonty98",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fumdj/people_are_suspiciously_nice_when_they_hear_im_an/",
        "text": "My experience as an atheist thus far seems to go against the majority of experiences, that or not many other people seem to talk about it when they have the same experience as me. But everyone who I've told or who's found out that I am an atheist has been strangely cool with it. My parents were the most shocked but that's because to them it came out of no where, but they're very respectful of it. Strange, given that their christian faith is very important to them. I live in East Texas currently, in a town where people sporting anti abortions signs or signs that simply say \"Jesus\" on road sides is not uncommon. Yet anyone I've told here has either been respectful, or merely curious. Or they turn out to be atheists themselves on occasion. Not one person has gotten hellfire and brimstone on me. Perhaps it is because I am somewhat careful about who I tell, but there are plenty of people who I expected more opposition from who surprised me with open-mindedness.\n\nThis experience seems to contradict so much of what I hear from christians about atheism in general as well as the many personal experiences posted here about strife it creates between friends and family. Anyone else have a weirdly easy time with honest about their lack of faith?\n\nEDIT: The popular, albeit humorous opinion seems to be that that they're all afraid that, without their moral code, I might possibly offer them as a sacrifice to satan and [devour their children](https://www.youtube.com/watch?v=fbjHJezEM5w).",
        "created_utc": 1410215010,
        "upvote_ratio": ""
    },
    {
        "title": "Dr. Peter Kreeft: The Common Consent Argument for God: Everyone admits that religious belief is widespread throughout human history. But the question arises: Does this undisputed fact amount to evidence in favor of the truth of religious claims?",
        "author": "shackra",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fue5f/dr_peter_kreeft_the_common_consent_argument_for/",
        "text": "I found this interesting article on the site Strange Notios. I was talking with a YouTube atheist several weeks ago trying to make him see the point that is shown in this article written by the philosopher Dr. Peter Kreeft. However, my attempts failed miserably because the guy started to yield \"ad popolum fallacy!! ad popolum fallacy!!\" everywhere in the thread. I hope he was just trolling, otherwise I would be very worried about this folk, and his logic.\n\nIn the article, The Philosopher writes, [somewhere](http://www.strangenotions.com/the-common-consent-argument-from-god/):\n\n&gt; **Question 2:** But isn't there a very plausible psychological account of religious belief? Many nonbelievers hold that belief in God is the result of childhood fears; that God is in fact a projection of our human fathers: someone \"up there\" who can protect us from natural forces we consider hostile.\n&gt;\n&gt; **Reply A:** This is not really a naturalistic explanation of religious belief. It is no more than a statement, dressed in psychological jargon, that religious belief is false. You begin from the assumption that God does not exist. Then you figure that since the closest earthly symbol for the Creator is a father, God must be a cosmic projection of our human fathers. But apart from the assumption of atheism, there is no compelling evidence at all that God is a mere projection.\n&gt;\n&gt; In fact, the argument begs the question. We seek psychological explanation only for ideas we already know (or presume) to be false, not those we think to be true. We ask, \"Why do you think black dogs are out to kill you? Were you frightened by one when you were small?\" But we never ask, \"Why do you think black dogs aren't out to kill you? Did you have a nice black puppy once?\"\n&gt;\n&gt; **Reply B:** Though there must be something of God that is reflected in human fathers (otherwise our symbolism for him would be inexplicable), Christians realize that the symbolism is ultimately inadequate. And if the Ultimate Being is mysterious in a way that transcends all symbolism, how can he be a mere projection of what the symbol represents? The truth seems to be—and if God exists, the truth is—the other way around: our earthly fathers are pale projections of the Heavenly Father. It should be noted that several writers (e.g., [Paul Vitz](http://www.amazon.com/Faith-Fatherless-Psychology-Paul-Vitz/dp/1586176870/?tag=ththve-20)) have analyzed atheism as itself a psychic pathology: an alienation from the human father that results in rejection of God.\n\nAfter reading the entire article from the Philosopher, What do you think, folks?",
        "created_utc": 1410210500,
        "upvote_ratio": ""
    },
    {
        "title": "Big History. Thought this might be interesting to help educate people.",
        "author": "pseudonym1066",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fu6e1/big_history_thought_this_might_be_interesting_to/",
        "text": "",
        "created_utc": 1410206390,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist coming out day",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fu58e/atheist_coming_out_day/",
        "text": "Just wondering if there is such a thing as coming out day for atheists.  I was wondering if it would make it easier for some people to come out of the closet and just remind us all that there's a lot more of us than we think.  Maybe more curious to see who else that I know is also an atheist.  I googled it and saw that Richard Dawkins had The Out Campaign, but it didn't say which day of the year that is",
        "created_utc": 1410205766,
        "upvote_ratio": ""
    },
    {
        "title": "getting dragged into a theology teacher room later this week.",
        "author": "MKROBINSON",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ftwkh/getting_dragged_into_a_theology_teacher_room/",
        "text": "some kid told a theology teacher at my catholic school that i was an atheist and she freaked... now i have to go talk to her \"im not in trouble\" but i have a feeling they are going to hardcore try and convert me. i just dont know what to do any advice? sorry for the lack of direct questions but i have a feeling this is gonna be a one sided debate and ugh haha \nEdit: thanks yall it just whooo I just dknt know what to expect and there isnt really anyone at my school I can tell this too without being further segregated(?) Ill tell yall how it goes thanks for the pointers I have a feeling shes just gonna try and convert me so I dunno it will be interesting....",
        "created_utc": 1410201247,
        "upvote_ratio": ""
    },
    {
        "title": "So, Bible:Torah, Bible: A New Testament, Quran: Word of God, or Joseph Smith's Jesus in America?",
        "author": "AHairOnCarlossHead",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ft0c7/so_bibletorah_bible_a_new_testament_quran_word_of/",
        "text": "",
        "created_utc": 1410182848,
        "upvote_ratio": ""
    },
    {
        "title": "Disappointed in my mother",
        "author": "MrRykler",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fsu65/disappointed_in_my_mother/",
        "text": "After pointing out that plants could not have survived if they were created before the sun, and that the earth itself must be younger than the sun, my mother said \"the earth was here first, that's what the bible says\".\n\nThis surprised me, because although my parents are really against evolution, they are old earth creationists, that is, they believe in the big bang and accept the age of the universe. There is some major cognitive dissonance going on here and it really makes me sad.",
        "created_utc": 1410177834,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think U.S. non-evangelical Christians are learning anything from the ISIS situation?",
        "author": "unamenottaken",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fr72q/do_you_think_us_nonevangelical_christians_are/",
        "text": "More specifically, the dangers of non-secular government. Are they beginning to understand how important the ability to \"appeal to reason\" is? And that it is lost with a theocracy, of any type?",
        "created_utc": 1410128467,
        "upvote_ratio": ""
    },
    {
        "title": "What happens when you die?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fpcfi/what_happens_when_you_die/",
        "text": "If anyone tells you that they're an athiest and you then ask them \"what happens when you die\" and they don't know the answer...they're not an athiest. Period. Athiest don't 'believe' or 'think' or 'feel'....we know. Cut and dry. Black and white. I don't 'think' there is no god...I don't 'believe' that there is no higher power or being....I know it. No questions asked. Zero doubt. Its just simple fact. There's nothing to debate. \"I don't know\" or \"no one knows\" or \"we'll never know\" or anything like that...those are not the ideas of an athiest. ",
        "created_utc": 1410075090,
        "upvote_ratio": ""
    },
    {
        "title": "Why do American Christians feel this over arching \"end times\" dread?",
        "author": "rrcecil",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fofyg/why_do_american_christians_feel_this_over_arching/",
        "text": "I hear my parents discussing how evil everything in the world, how everything is falling apart and blah blah blah. Times aren't perfect right now, but they are much better than anytime before. I hate this dread they perpetuate, is it a part of the persecution complex?",
        "created_utc": 1410048253,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about the statement \"if you're not now, you never were\"?",
        "author": "poprockcide",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fo2zq/how_do_you_feel_about_the_statement_if_youre_not/",
        "text": "In the context that if you're not Christian or straightedge or whatever now, you never were.  Insert any way of life that is meant to be a life long commitment.  What arguments do you have again this?  Is there a logical fallacy associated with it?",
        "created_utc": 1410039362,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for feedback on my new blog, about my life as a recent exmuslim. The blog consists of updates in my life and things that interest me.",
        "author": "onthecrystalship",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fmyz9/looking_for_feedback_on_my_new_blog_about_my_life/",
        "text": "",
        "created_utc": 1410012348,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to understand Atheism and need some help!",
        "author": "wiiforvendetta",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fmii3/trying_to_understand_atheism_and_need_some_help/",
        "text": "",
        "created_utc": 1409993444,
        "upvote_ratio": ""
    },
    {
        "title": "Conclusions about the /r/TrueAtheism subscribers' religious background thread",
        "author": "Clackpot",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2flb7m/conclusions_about_the_rtrueatheism_subscribers/",
        "text": "So, on a whim I posted [this thread](http://www.reddit.com/r/TrueAtheism/comments/2ffw3c/quick_question_how_many_rtrueatheism_subscribers/) enquiring about the religious experience of readers of this sub.\n\nI raised the question because I was surprised by  /u/CVL080779's claim that [\"Most, if not all, of you guys were former christians here\"](http://www.reddit.com/r/TrueAtheism/comments/2fe1e9/question_regarding_the_bible/).  In my British head I found it difficult to believe this claim, but it turns out that s/he was pretty much correct.\n\nI have collated the huge number of responses (that I never expected) and performed a quick'n'dirty analysis of the data, organising the many and detailed responses into a handful of arbitrary categories. This is by no means scientific - partly because it's a highly self-selected group of respondents - but since you were all so kind as to volunteer so many different stories I felt it was the least I could do.\n\nI would also like to thank /u/Knodiferous for providing the [results of a poll](http://www.reddit.com/r/TrueAtheism/comments/2ffw3c/quick_question_how_many_rtrueatheism_subscribers/ck9d2eg) on this sub conducted about a year ago (of which I was unaware), and /u/pseudonym1066 for providing other [substantive data](http://www.reddit.com/r/TrueAtheism/comments/2ffw3c/quick_question_how_many_rtrueatheism_subscribers/ck92wqo) about the reddit demographic in general.\n\n**The results.**\n\nOf 68 respondents, I have categorised them as follows :-\n\n* Always atheist - 11.\n* Weak Christians - 21.\n* Strong Christians - 31.\n* Other religious theists - 3.\n* Everyone else - 2.\n\n**Always atheists** are people like me, essentially lifelong atheists who may or may not have entertained spiritual/theistic/deistic/religious ideas but who have generally dismissed them sooner rather than later. This includes people who have indulged in religion, often for extended periods, but who have never professed any belief.\n\n**Weak Christians** may have have had the strictest of upbringingings, even into middle age, but who have always had substantial doubts which have solidified over time. This group includes those whose doubts started during childhood but who persisted with the religious way of life for a significant period. I'm a little surprised by how many of you there are.\n\n**Strong Christians** who have pretty much bought the whole deal, then at some point in their lives come to repudiate it.\n\n**Other religious theists** who have indulged in religious practices, ostensibly because they profess some theism or other. Mostly Judaists.\n\n**Everyone else** is just a garbage pail for anyone who doesn't clearly fit into the above ;-)\n\nNB These results are highly subjective, and I didn't spend any more time than was absolutely necessary lobbing each of you into one category or another. No, I don't have a table of results, I just did it on the fly, so I can't even tell you which respondent got put in which group. But I note that the curve is broadly similar to the one that /u/Knodiferous reported.\n\nConclusion? Fuck me, America, you have a lot of screwed up ex-theists, don't you?!? In my head I think I assumed that a sub called /r/TrueAtheism, that calved from the /r/atheism circlejerk, would comprise mostly lifelong atheists and sceptics. That has been roundly disproved. I'm astonished by how many of you are living your lives another way, after having first tried a religious path.\n\nThank you all for your time and your stories, it's been a really interesting and eye-opening journey for me.",
        "created_utc": 1409957111,
        "upvote_ratio": ""
    },
    {
        "title": "Change 10 U.S.C. § 502 so it does not require service members to swear \"So help me God\".",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fkv47/change_10_usc_502_so_it_does_not_require_service/",
        "text": "",
        "created_utc": 1409947563,
        "upvote_ratio": ""
    },
    {
        "title": "How many times can you hear that you must understand the culture or in the original language it has different meaning?",
        "author": "Aunt_Penny",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fki08/how_many_times_can_you_hear_that_you_must/",
        "text": "I have heard so many times that you don't understand ancient hebrew culture therefore the bible won't make sense. I have heard many times well the koine greek has more meaning than what is written or Aramaic, Hebrew, or Chaldean. \n\nI'm amazed by how much english speaking people believe this. \n\nMat. 5:18 For verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled.\n\nHow can you use this passage if your grammar does not include these punctuation or letter? \n\nIf you follow this philosophy you must disregard any translations that are not the original languages. Also you must do an incredible research in pre-Hebrew culture, ancient Hebrew culture, anciant Hebrew culture in babylonian, assyrian, egyptian captivity. ",
        "created_utc": 1409940078,
        "upvote_ratio": ""
    },
    {
        "title": "Comments on this timeline of major world religions",
        "author": "pseudonym1066",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fk7xu/comments_on_this_timeline_of_major_world_religions/",
        "text": "I am trying to understand the history of major world religions and I produced **[this timeline](http://snag.gy/wR7R8.jpg).** It's a bit difficult as different sources give different starttimes, but I have a source for each of the times stated. The arrows represent \"influenced by\", and that can be a little or a lot. Christianity for example (which proclaims the Messiah, and uses the old testament) could not exist without Judaism (which details the messiah and has the first five books of the OT), so clearly is influenced a lot. Protestantism was influenced only slightly by Norse paganism.\n\nAnyway, thoughts, comments, etc? Please don't just say \"it's crap\". I'm just trying to make a one page easily understood chart detailing relationships between different religions. Other timelines don';t make the link between different Abrahamic faiths.",
        "created_utc": 1409934351,
        "upvote_ratio": ""
    },
    {
        "title": "Arguing that Jesus probably existed is a great way to tick off the atheist community.",
        "author": "godlessindixie",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fk66n/arguing_that_jesus_probably_existed_is_a_great/",
        "text": "So I wrote a post yesterday [(link here)](http://www.patheos.com/blogs/godlessindixie/2014/09/04/an-atheists-defense-of-the-historicity-of-jesus/) which argued that Jesus was likely an historical person upon whom many layers of legend and religious embellishment were laid.  This is evidently a VERY unpopular opinion among atheists, and I'm a bit surprised at how vehemently many of us will argue that it's more reasonable to believe he was made up entirely rather than started as a real person and grew to become something larger than life after he died.\n\nDo you think he was a real guy?  And why or why not?\n\nAnd more importantly to me personally, after reading [the article](http://www.patheos.com/blogs/godlessindixie/2014/09/04/an-atheists-defense-of-the-historicity-of-jesus/), do you feel I was irresponsible in how I handled the topic, brief though I had to be?",
        "created_utc": 1409933338,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think about this movie trailer about how religion faces new challenges?",
        "author": "CapraRose",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fj83l/what_do_you_think_about_this_movie_trailer_about/",
        "text": "[One Generation Away](https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0CCEQ3ywwAA&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dr1o-S-GnFS8&amp;ei=r2wJVPbALunNigL9w4CICg&amp;usg=AFQjCNEi-H5PyfxzOUma4X90WJ7pdQMgDg&amp;sig2=-UnYsE9Cn1WlWXThAhMq9Q&amp;bvm=bv.74649129,d.cGE)\n\nSeems like they see our issue with their religious symbols and ideals all wrong. I feel like they are confusing the difference between discriminating and being discriminated against. ",
        "created_utc": 1409904186,
        "upvote_ratio": ""
    },
    {
        "title": "First Major Debate With a Religious Person (In Need of Constructive Criticism and Comments) [Part 1 of 2]",
        "author": "rebellionfilms",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fi8wu/first_major_debate_with_a_religious_person_in/",
        "text": "This is my first major debate I've had against a religious person and I'd like to hear what the community has to say on the matter.  What do you think I did right, where did I go wrong, what did the religious person say that made sense and what did she say that didn't?  \n\n\nHere's what happened, I recently posted a picture on instagram with the caption: \"By not introducing your child to religion you are not letting them down.  Letting your child down is taking away their freedom of choice and ability to rationalize the validity of superstitious/religious doctrines because of a deeply rooted fear of burning in hell.  Sorry but I had to get this out.\"  Mind you the picture was of the poster for the documentary \"Jesus Camp.\"  Posting this, I expected some flak and opened myself up to debate but I didn't expect the debate to last as long as it did.\n\n\nNow we can go on to the actual debate, we'll refer to my friend as \"K.\"   Please note that the following text is taken directly from the debate and has not been altered except for brackets to explain context.\n\n\nK: Being a Christian is not about being afraid of burning in hell.  I just watched some of it [Jesus Camp] and like I have said before there are extremists on each side of the argument and I feel you keep looking at people like me who yes, believe in the same thing but will not condemn people for doing something wrong since that would be hypocritical of me in saying so.\n\n  \nHow many Christians or even religious people have you or I met...Not on the internet or TV that have actually been offensive in person about disagreeing with them.  When was the last time I went to your house and started convulsing on your floor?  \n\n\nTo say that having a God to \"fill in the gaps\" that we can't understand ourselves does not get us no where because if it did how did we get this far already?  I'm not trying to start a fight here lol don't take offense but you should realize that you are coming across as a radical atheist and that comes across no different then a radical Christian.\n\n\nMe: Being a Christian is about following the teachings of Jesus Christ, which is cool. Jesus, whether he was real or not, was a cool guy. What I don't understand is how people can believe in a God who in one book loves us unconditionally and in another is a god of war who justifies buying/selling slaves, infanticide, rape, misogyny, homophobia, and a litany of other things. \n\n\nThe reason that religious beliefs upset me is because I feel that the person was raised to believe like that because of what their parents taught them and questioning of these beliefs is strongly discouraged. Personally, I've never met a religious person in the flesh who has been offensive because they were wrong but I know that they exist and a lot of people in the atheist community have dealt with them, many of those people being their parents and friends. \n\n\nThe god of the gaps argument slows down progress because it is basically saying this: \"we currently can't explain this so it must be *insert chosen deity here. That is as cynical view on what mankind can achieve through science and will only make us comfortable believing in something with no evidence. That is not progress. Who's to say that that if religion never existed we wouldn't be centuries ahead of where we are today? That is something we simply cannot know currently but I won't be looking skyward for an answer. \n\n\nA radical atheist would be out burning churches. Me posting about my disapproval of organized religion is no different than a common Christian posting about how much they love Jesus. This is a double standard that needs to go away.\n\n\nK: That one book where all of those things happened can't be explained but it was in the first testament that happened thousands and thousands of years ago were it was very different from the time Jesus was born. There is no commandment however that tells us to do those things but it also says God does things that we could never think to understand that only makes sense to him. Christians in Christ's time do follow in his teachings instead of how we used to live before he was born ... Which was in a barbaric way. That's why we have changed or tried to in our best efforts. That's why there is no such talk of rape, murder or any other such things. \n\n\nThere is no problem where a parent teaches a child what they believe in ... Aren't you going to do the same when your older? It is up to the child when it's older to decide if he/she is to stay on that path or not and if not of course the parent is not going to be happy with them! That goes for anything! \n\n\nAnd for the progress ... Is it such a bad thing to be comforted with what we believe is the answer? I don't think that all scientists are atheist now or before and they most likely helped progress. Scientists constantly need an answer when sometimes there is none and at lease we can rest in peace in not knowing something. \n\n\nA radical atheist does not need to burn down anything to be considered radical... If a common Christian posts that they love Jesus they are not saying what's right and wrong or how much it annoys them that other people don't. But anyway instead of arguing about it or even worrying about posting anything... Let's be honest ..Whatever your going to say or post isn't going to change the thoughts of a religious person and the same goes for me talking to an atheist...\n\n\nK: Not to barge inTo the conversation but how do you know that it's a comfortable lie? [This statement is in response to a smaller debate I was having with somebody else where the \"god of the gaps\" argument was a common theme in which I said: \"However, I think humans could be way more productive if they lived life by the cold hard truth instead of a comfortable lie?\"] If you can't prove or disprove what is happening how can you discredit something? What if the hard cold truth was something you can't understand and will never understand? Scientists will be searching for an answer and waisting their time and life for something that can't be solved without Gods help. Yes there were things in the last that were proven by science like the disease caused by being bad type of thing. But not everything can be explained. Believe it or not there is more proof then not when you go looking for it instead of demanding there be an answer to everything. \n\n\nPut it like this ... When we were younger we did not know half of what we do now .. We were ignorant.. We then asked our parents for help or answers and they simply said \"not now, maybe when your older\" or \"you won't understand it's too much for you\" we might have gotten irritated/frustrated but we never fought back to our parents. And if we went looking for an answer we would never find it because we didn't understand what we were looking for or understand the things around us fully. \n\n\nThe Same goes with what we believe God is doing with us. We are his children and whatever he says... No matter if we think it's right or wrong we want to obey and make him happy.\n\n\nMe: Both the old an new testament were said to have been written by God through the hands of man. An omnipotent god would have gotten it right the first time or even just written it himself. \"God works in mysterious ways\" is the cop out answer used when somebody brings up the injustices that your god sits back and watches happen. \n\n\nWhen I have kids I won't bring up religion in the house or talk about my disbelief. I will let them choose and change their mind and question, all of the stuff that is rare in a religious household. In regards to the parents being happy that their child is an atheist, this is simply not the case. Only my mom knows that I'm an atheist and she wasn't too happy when she found out. If my dad found out he would blow a gasket and refuse to take my conclusions seriously [My dad actually found out about my disbelief today and took it extremely well.  However, that doesn't dilute the point I'm trying to make; the shunning of closet atheists is still a major problem]. This is a common problem for closet atheists. \n\n\nObviously not all scientists are atheist but those who are leave their religion at the door and work on explaining our surroundings through the scientific method. On the topic of radicalism I'll admit that I have made a mistake in that radicalism is not the same thing as extremism (in some cases.) In that case, call me a radical because I refuse to stay silent about my views and I would like to see a change in the world. Religion is fine behind closed doors and practiced at your own discretion but I'm against organized religion when it tries to invade our education system, government (the first amendment prohibits us from adopting an official religion), and into the minds of our youth. Martin Luther King was a radical.  Imagine the world we would be living in if he just sat on his ass and took the discrimination. \n\n\nI'm responding to you because I regard an argument and a debate as two different things. If I was arguing with you I would hate your guts. However we are having an intellectual debate. Surely I'm not changing your mind but I have every right to offer a rebuttal to what you say. \n\n\nI regard the belief in a God or an afterlife as a lie because there is no valid evidence to support it. If, in fact, evidence does come up proving one of the 2870 recorded deities then I will believe but until then I will remain godless.\n\n\nK: To me he is an omnipotent God and he did get it right the first time... If you remember the first time was Adam and Eve and we were the ones to screw it up. He has just been cleaning our mess this whole time. Instead of blaming Our God for injustice maybe we should look at ourselves and realize we are the only problem in the picture. \n\n\nThat is perfectly fine if that's how you want to raise your children. But everyone should have a choice in how they raise their kids. I understand the problem with you coming out and saying what you believe in your family but you can't really Blame the family for getting upset when that's what they believe strongly in. It's kind of like breaking a rule. \n\n\nAs for religion in this country .... Wasn't this country founded on religion when the pilgrims came ? There is no official religion but there is going to be a majority who believes in something and in this country it's Christianity. I don't see how it's invading schools when teachers aren't even allowed to share their opinion and neither are the students for that matter. The only thing that is heard is in the pledge \"under God\". We creates slaves and made man unequal to one another. \n\n\nGod isn't going to swoop in on a flying horse every time a person is mistreated and save them. And also the bible can't be taken literally there are many situations where it says one thing but could mean something different a slave could mean a student listening to his or her teacher since the teacher has authority over them or a worker and his boss ... A child and a parent. \n\n\nSharing your beliefs is not a radical it's just when you put down someone else's is where it crosses the line a bit. I never said Martin Luther king was wrong for doing that. I know we aren't in an argument i didn't mean to put it that way lol I would hope you don't hate my guts cuz I don't hate yours\n\n\nMe: When I say \"getting it right\" I'm referring to the bible verses that modern day Christians don't follow. Ex. We shouldn't eat shrimp (Leviticus 11:10), get tattoos (Leviticus 19:28), are not allowed in church if we have no testicles (Deuteronomy 23:1), or chop off our wife's hand if we're fighting with our neighbor and she helps out by hitting him in the crotch (Deuteronomy 25:11-12). How could God let those slide in the Holy book that would be a pivotal aspect in the lives of his billions of believers. \n\n\n\"But those are all metaphorical\" Tell me exactly which bible verses we should take seriously because I seem to notice that a lot of bible - thumpers protesting against homosexuals or evolution seem to over look the verses I mentioned. This is cherry picking. If not every part of the bible means what it says how is it even close to being a valid document? \n\n\nMankind is responsible for a lot of injustices, the major one being war (especially because war produces a lot of other injustices as \"byproducts. \") a majority of wars throughout history, however were caused by religion. Mental handicaps and rare birth defects are not a result of mankind, they're part of an unfair world, but they are injustices that could easily be fixed by an omnipotent god. \n\n\nRoughly half of the pilgrims came to the United States looking for religious freedom. The actual documents that declare the United States as a nation are all secular and make no mention of God. Mention of God in the pledge and on our currency was added later.\n\n\nWe created the act of slavery but the bible justified it (again with the \"not so sure If we should take this stuff literally or not.\") Creationists still try to get their theory taught in school even though it has no sound evidence to support it. \n\n\nBy your definition, a Christian putting down Islamic beliefs because it is a violent religion is a radical, while simultaneously forgetting that Christianity is responsible for the Crusades, various holy wars, and the persecution of non-believers throughout history.\n\n\n[Part 2](http://www.reddit.com/r/TrueAtheism/comments/2gzqxi/first_major_debate_with_a_religious_person_in/)",
        "created_utc": 1409876781,
        "upvote_ratio": ""
    },
    {
        "title": "Good literature for High School finals presentation",
        "author": "SafroAmurai",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fhtyg/good_literature_for_high_school_finals/",
        "text": "So I'm in my last year of high school now, and the way finals exams work in Germany is that among a bunch of Exams and Oral tasks you also have to hold a presentation where you combine 2 Subjects (1 for the main part of the topic, the second as a reference) to form a question/title. After picking my subjects for the Written and Oral exams, the two subjects I have to choose from are Physics and German. I consulted the teachers and figured I'd be better off picking German and decided that I'd choose Atheism/Criticism of Religion as my topic. \n\nI still have to formulate the exact title, but for now I want to collect some information and recommendations. It's very likely that I'll have to read a book, and that's where you guys come in. I'm gonna need a really good read, preferably a piece of atheist fiction. I'm sure most good books will come with German translations, so I think anything is fine. If however you know any books that were written by a German author, I'd be very happy to have a look at these too, it might even be a better idea if the teacher can relate to the authors background.\n\nThanks for any help I can get, I'll be off to sleep now and will start reading comments in the morning.\n\n\ntl;dr looking for a good piece of atheist fiction for High school finals presentation",
        "created_utc": 1409867790,
        "upvote_ratio": ""
    },
    {
        "title": "What is your opinion on Ayn Rand's Objectivism?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fhr8k/what_is_your_opinion_on_ayn_rands_objectivism/",
        "text": "In Rand’s philosophy, reality exists as an objective absolute, impervious to our wishes or desires. But our capacity for thought gives us the ability to understand reality and the choice to use this knowledge to create the new and the life-sustaining. “The power to rearrange the combinations of natural elements is the only creative power man possesses,” Rand writes. “It is an enormous and glorious power — and it is the only meaning of the concept ‘creative.’”  \n(taken from [aynrand.org](http://www.aynrand.org/ideas/philosophy#inrand%27swords-1))\n\n[Video link to Ayn Rand interview.](https://www.youtube.com/watch?v=viGkAZR-x8s)  \nI recommend watching this for the ethical side of her philosophy.\n\nI've just recently discovered her philosophy (outside of a few misrepresentations of it).  I also know it is heavily criticized and not accepted by many.  What is your opinion on her philosophy?  What are some of your criticisms?",
        "created_utc": 1409866261,
        "upvote_ratio": ""
    },
    {
        "title": "My sister is new to atheism and she's looking for one of those \"positive thinking\" inspirational books that doesn't have God in it.",
        "author": "Zulban",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fh9nc/my_sister_is_new_to_atheism_and_shes_looking_for/",
        "text": "She just sent me this email:\n\n**I bought this book \"the power of positive thinking\" by norman vincent peale. I've heard good things and it was only 6.99 It's also an international Best seller. I am bummed. It's full of God bible bull shit and it's hard to read considering I am not drinking the cool aid. Know of any atheist friendly similar books? Trying to read more but wouldn't mind reading something motivational / inspiring wtev.**\n\nI have zero suggestions because those \"get your life together now!\" and \"think positive, act proactively retroactively\" buzzword books are really not my style. But they do serve a great purpose to some people. I dunno, maybe Sam Harris has written something? Any suggestions?\n\nCheers.\n\n**Edit:** Eek! It looks like just about everyone here is misunderstanding my request. I am looking for a book that is **not** about spirituality, religion, scepticism, science, cosmology, etc. Books about why religions are wrong are still about religion. Books about why scepticism is necessary are still about scepticism. I am extremely well versed with those sorts of books! I'm looking for a pretty straight forward inspirational book about taking control of your life and organizing it, etc. One that has nothing to do with religion or scepticism. I need suggestions because I honestly don't care for that genre that much.",
        "created_utc": 1409857134,
        "upvote_ratio": ""
    },
    {
        "title": "Sinners in the Hands of an Angry God",
        "author": "Averagejoeqpublic",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fh7y0/sinners_in_the_hands_of_an_angry_god/",
        "text": "So a friend of mine sends his daughter to Catholic prep school in California.  No real shame in that, in my opinion.  I went to a Jesuit school myself and while we did have to take four years of religious studies (including a year studying world religions), the focus of the school was on college prep.  My mathematics, literature, history, economics, and especially hard science courses were rigorous.  And we learned evolution, in-depth and without any wink-nudge (except for the JVs who were exempt).  \n\nThat said, this guy's daughter gets an assignment from her English course where she is supposed to read Jonathan Edward's sermon [Sinners in the Hands of an Angry God](http://en.wikisource.org/wiki/Sinners_in_the_Hands_of_an_Angry_God) and write a paper showing how Edwards used all of [Aristotle's modes of persuasion: ethos, pathos, and logos](http://en.wikipedia.org/wiki/Modes_of_persuasion) to convince his audience.  \n\nI read the sermon again when I heard about this and to be frank, it's appalling.  Brimming quite literally with fire and brimstone, it is an intentionally terrifying scree designed to appeal only to emotion in the sole incarnation of fear.  Which made the pathos portion of my friend's daughter's essay easy to write.  The ethos portion was more difficult, but not too hard if you just assume that the authority is god (no sense in her getting a bad grade).  But here's the thing:  How the hell do you write about logos, the appeal to logic, in this situation?  Neither my friend nor I, both of whom are skilled wordsmiths, could find a way to apply any logic to this drivel.  \n\nI urged him to write the school.  This assignment seems a patent attempt to scare high school kids into believe while subtly \"proving\" the case by having the students \"analyze\" the sermon's persuasive effects.  It also forces the students to have an incorrect understanding of logos, unless the teacher's intention was to show that logic has no place in religion, possibility but unlikely.  If it were me, I'd be livid.  Hell, I am.  ",
        "created_utc": 1409856249,
        "upvote_ratio": ""
    },
    {
        "title": "My Official Anti-Theist Manifesto",
        "author": "showersr4PLEBS",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fh3jj/my_official_antitheist_manifesto/",
        "text": "",
        "created_utc": 1409853889,
        "upvote_ratio": ""
    },
    {
        "title": "Quick question - how many /r/TrueAtheism subscribers were formerly religious and/or theistic?",
        "author": "Clackpot",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ffw3c/quick_question_how_many_rtrueatheism_subscribers/",
        "text": "In [this thread](http://www.reddit.com/r/TrueAtheism/comments/2fe1e9/question_regarding_the_bible/) /u/CVL080779 claims :-\n\n&gt; Most, if not all, of you guys were former christians here\n\nI have no axe to grind over the claim but I wondered is this true? Are lots of you former Christians, or other believers? As a Brit I am used to the idea of lifelong atheism, and while I am aware that things are very different across the pond, is it really the case that most people here have become atheistic after a period of religiousness?\n\nApologies if this has been asked before (I expect it has) but I didn't really know how to search for it.\n\n***\n\nEDIT 1 : I was hoping for someone to come along and simply say \"Yes, most subscribers were formerly religious\" or vice versa. I didn't really intend to invite personal stories but I'm very grateful to those of you who have taken the time to tell yours, thank you.\n\nOn the sketchy basis of the small sample of replies so far it seems that many of us might well have some religious practice under our belts. I'm still interested in what other people think, whether it's a simple yes/no or a more involved story.\n\n***\n\nEDIT 2 : This is interesting! I find myself wondering how easy or difficult it was for so many of you to make that transition. It must've been a bit of head-job for some of you, even if family and social strains are disregarded.\n\nOnce the thread slows down a bit I'll have a stab at collating the responses.",
        "created_utc": 1409824077,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling alone while dealing with the death of a loved one. Hard to relate to those with spiritual/religious beliefs.",
        "author": "oceanside_blue",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ff4xi/feeling_alone_while_dealing_with_the_death_of_a/",
        "text": "Hello,\n\nAbout a month ago I [posted this](http://www.reddit.com/r/offmychest/comments/2b9iqg/my_best_friend_threw_me_a_surprise_30th_birthday/) in r/offmychest, but lately I've been struggling with not only my own grief process, but also those close to me and present for the incident. I understand that everyone processes grief and loss in their own ways, but it seems everyone within my family and close friend circle has such a divergent strategy that I'm finding it incredibly difficult to relate, and therefore communicate to them my own feelings. I feel very alone.\n\nMy boyfriend's parents (neither of us are religious) are Catholic. While they're totally aware of our non-religiousness, they still tend to frame their words with religious intonation. \"Think about your happy memories, that's what she's doing in Heaven\", or \"If she knew how sad / how much guilt you were feeling she'd come straight down from Heaven and kick your ass!\" I love them very much, so it's hard to do more than just nod and change the subject.\n\nMy friend, M, has been my rock. While she is also not religious, she is quite spiritual (believes in a connecting universal 'energy', souls, fate, etc.) I am emphatically NOT - I have never had the slightest inclination toward believing in supernatural beliefs or superstitions. I've told her many times that I just don't buy it, it's a neat coincidence when weird things happen but that's about it. But since losing our friend, she has expressed multiple times how certain things are attributed to something supernatural.\n\nFor instance, shortly after the funeral we were having a rather sad reminiscent moment, when a man walking his dog came walking by. This dog was so rambunctious and energetic, jumping up onto our bench and drooling happiness everywhere. It was a welcome break and we all laughed about it. Once the man had left however, the first thing M says is \"Rachel totally just sent that dog to cheer us up.\" Uh.. yea...\n\nI guess my question is... in a world where people look for connections and meaningful coincidences, how do you best reconcile the need for closure while accepting that these bright joys of humanity are simply gone? Even a month later I still feel in shock, that this is surreal. I fully understand now the security blanket that religion offers, even if I wholeheartedly reject it. It doesn't, however, make this any easier, and I don't know how to grieve while I hear nonsense on all sides from my nearest and dearest. My strategy so far has just been to lie and say \"I'm ok\", when I am barely holding it together.\n\nThanks for letting me rant if you were able to get this far. I appreciate any advice you can offer.",
        "created_utc": 1409799358,
        "upvote_ratio": ""
    },
    {
        "title": "Constantine and the spread of Christianity",
        "author": "laonious",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fes2s/constantine_and_the_spread_of_christianity/",
        "text": "Does anyone know a good source for learning about how Constantine converting affected the spread of Christianity? My impression is that it was a small offshoot of Judaism before, but I'm interested in getting my facts straight. ",
        "created_utc": 1409791694,
        "upvote_ratio": ""
    },
    {
        "title": "Question regarding the bible.",
        "author": "CVL080779",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fe1e9/question_regarding_the_bible/",
        "text": "Hello,\n\nFirst, I would like to say  that the question that I am about to ask does not belong here. I am banned from /r/christianity and I have no idea where else to post this question. Most, if not all, of you guys were former christians here, so you guys might be able to answer my question.\n\nMy question is did Jesus abolished the laws in the old testament?\n\n\nWe all know the leviticus verse where it says \"if a man lies with a man, it is an abomination.\" A gay christian would say that Jesus said nothing about being gay and leviticus is only for jews. Basically, the old testament doesn't apply anymore.\n\nAn anti-gay christian would quote me mark that says \" I came here not to abolish the laws, but to fulfill it.\"\n\nSo in context, did the book of mark really meant that the old testament doesn't matter anymore?\n\nthanks\n\n",
        "created_utc": 1409776439,
        "upvote_ratio": ""
    },
    {
        "title": "Any other atheists at Christian colleges?",
        "author": "Kate2point718",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fdnu2/any_other_atheists_at_christian_colleges/",
        "text": "Background: I never wanted to go to a Christian college even when I was a Christian, and originally I was at a secular university, but in my senior year in college I had some issues and was not able to complete that year (btw, if you ever survive a suicide attempt, do everything possible to keep the school administers from knowing about it).\n\nAnyway, I'm doing really well now and am ready to complete my degree, but of course I no longer have the full ride scholarship I had at my first university and while I was never officially kicked out, I doubt they would want me back anyway. My father is now a professor at a Christian liberal arts college, however, and that means I can get free tution (it's quite expensive, too). I don't want student loans if I can avoid them and I really can't afford to go anywhere else on my own, so as much as I don't want to go there, this seems like the best way to finish my degree.\n\nAnyway,  no matter how it happened I am now an atheist at a Christian college. I don't want to tell anyone if possible, not because I think they would treat me badly, but because I don't want to be anyone's salvation project. \n\nAt the same time, I do want to be honest with myself and others, so I don't want to fake being a Christian. I'm not trying to be sneaky or anything, I just would prefer to avoid the subject. I think for the most part I'll be able to slip under the radar, but in three classes I will have to write a big paper that will involve me personal belief. For my Bible class I have to write about my perception of the Bible, for my Bio class I have to write about what I thought about that Francis Collins book, and in philosophy pretty much every subject is about my belief.\n\nI'm just wondering if there is anyone else who is or has been in a similar situation, and if so how you handled it. I do want to be respectful, especially since after all it's not like they're pushing this on me; they're very upfront about what they base their teachings on. But like I said, I want to be honest, too.\n\nThe Bible class professor actually acknowledged that there might be unbelievers in the class and he made a point of being respectful to all viewpoints. I was surprised and impressed by this, but still he also said that he hopes any unbelievers change their mind in this course.\n\nPhilosophy is going to be interesting. The professor is an ex-atheist and used to come to philosophy from an atheistic view, but he says now that one can logically show that a god exists, and that Christianity is true. He also seems respectful of unbelievers and acknowledges that there are good arguments against the existence of God, but again, he still hopes to convince people of the validity of his belief. I'm willing to listen, and don't want be the opposite of the Christian who hears something challenging their faith and runs for something faith promoting so they don't have to seriously consider an opposing viewpoint (I'm speaking from personal experience here), but it does seem a bit daunting to be the only nonbeliever in that class.\n\nIf you actually read all that, thanks for reading! Like I said, I would really love to hear any other experiences in this kind of situation.",
        "created_utc": 1409769201,
        "upvote_ratio": ""
    },
    {
        "title": "Examining the tragic decline of an aging god",
        "author": "SerialAntagonist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fdjx7/examining_the_tragic_decline_of_an_aging_god/",
        "text": "In conversation with Christians I've often pointed out the progressive change in the Christian God's presence and action through the course of the Biblical narrative.\n\nGod initially walks daily with Adam in the Garden of Eden, then appears as a man to various patriarchs, then in a burning bush to Moses when he was alone, and then on a mountaintop to Moses when the Israelites were nearby. Then His presence is sequestered in the Holy of Holies in the Tabernacle and first and second Temples, and finally He's packed off to Heaven.\n\n(Of course Heaven was later moved from \"behind the clouds\" to \"outside the Solar System\" to \"above the stars\" and then to \"beyond space and time,\" and though that happened outside any biblical context, it fits the previous trend nicely.)\n\nAs for His acts, they begin with creating the Universe, then flooding the Earth, then destroying Sodom &amp; Gomorrah, then leading Israel out of Egypt, and then to lesser and lesser wonders until by Jesus's time  He's down to personal healings, visions and exorcisms.\n\nHis supposed presence descended from frequent, obvious and personal to rare, subtle and proxied. His supposed power dwindled from \"all things are possible\" to \"some things are slightly (but not measurably) more probable.\"\n\nIn other words, the Christian God demonstrates the same trend shown by [every other creator god in history.](https://en.wikipedia.org/wiki/Category:Creator_gods) Well, the imaginary ones anyway.\n\nIs there a term for this steady progression from \"present and powerful\" to \"absent and anemic?\" Has anyone advanced it from this mildly interesting observation to a compelling argument?\n&gt;",
        "created_utc": 1409767072,
        "upvote_ratio": ""
    },
    {
        "title": "If you live in a country where Slavery and human trafficking was the norm and even encouraged...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fde9l/if_you_live_in_a_country_where_slavery_and_human/",
        "text": "",
        "created_utc": 1409764039,
        "upvote_ratio": ""
    },
    {
        "title": "Book recommendation: The Way Of All Flesh",
        "author": "lokir6",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fd8py/book_recommendation_the_way_of_all_flesh/",
        "text": "This book is really interesting from an atheist's perspective, because it rejects both Christianity (the dominant philosophy in the setting of the book) and atheism (the protest philosophy) in the form in which it appears most frequently (i.e. \"theists are wackos, only idiots would believe this bs\").\n\nThe main character goes through a transformation from a theist to virulent atheist, and finally settles with the view that whilst Christianity is false, the abstract message it sends across should be valued. I (sort of) underwent a similar metamorphosis so the book really spoke to me, and hammered home my break with militant atheism. \n\nThe \"theist-&gt;atheist-&gt;somewhere on the fence\" journey is rather common these days, so I bet some of you would also find this book enjoyable. It's well written, surprisingly modern for the time and place in which it was written, and deserves your attention.",
        "created_utc": 1409760957,
        "upvote_ratio": ""
    },
    {
        "title": "I need help coming up with some spiffy philosophical anecdotes!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fbrpr/i_need_help_coming_up_with_some_spiffy/",
        "text": "",
        "created_utc": 1409716831,
        "upvote_ratio": ""
    },
    {
        "title": "Debate tip for newcomers: Stop relying on this kind of argument.",
        "author": "new_atheist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2fag9i/debate_tip_for_newcomers_stop_relying_on_this/",
        "text": "For many who are new to atheism, it's popular to see [arguments like this](http://www.reddit.com/r/TrueAtheism/comments/2f9vya/what_are_you_top_5_arguments/).  As you can see, the young chap presents several arguments, presumably in favor of atheism, yet most of them focus solely on one religion - Christianity.\n\nIt seems silly that we have to point this out.  But, heregoes.  Christianity does not represent the whole of theism.  It is one subset among many.\n\nIf your argument begins with \"The reason I'm an atheist is because the Bible says...\", just stop.  You haven't done enough leg work yet.",
        "created_utc": 1409688730,
        "upvote_ratio": ""
    }
]