[
    {
        "title": "\"Non fui, fui, non sum, non curo\"",
        "author": "mcapello",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5fuqqv/non_fui_fui_non_sum_non_curo/",
        "text": "While reading some history today, I read something I hadn't considered, which is that most Romans (prior to Christianity) didn't believe in an afterlife, and that in fact they would often put an abbreviation as their epitaph:\n\n**\"nf f ns nc\"**\n\nWhich stands for *non fui, fui, non sum, non curo*, or, **\"I didn't exist, I did exist, I don't exist, I have no cares.\"**\n\nAnd I immediately thought of this sub, where something very similar to this is the response to the many questions we atheists get about the afterlife, particularly when we must remind our theist friends that non-existence was their state before birth, just as it will be after death.\n\nAs someone who loves history and connection to the past, it's somewhat reassuring to think that our pragmatism would not have been entirely out of place in ancient Rome.",
        "created_utc": 1480568373,
        "upvote_ratio": ""
    },
    {
        "title": "What the hell is a literary miracle?",
        "author": "MrPeligro",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5frg4z/what_the_hell_is_a_literary_miracle/",
        "text": " This might be more suitable for r/exmuslims but I figured I share it here. Before this year, I never knew what a literary and linguistic miracle was. I couldn't even begin to grasp what is a literary and linguistic miracle.\n\nSo a Muslim told me that the Quran is *objectively* a literary and linguistic miracle because it's style of writing is unlike any other in Arabic and we haven't seen anything like it since. It doesn't fit any style of Arabic writing.\n\nHe lists off things like the use of metaphor, flexibility,rhetorical devices, etc.\n\nAnd tells me about the Quran challenge, if it's not from God to bring another chapter like it. So I asked him to bring another hebrew writing like the Hebrew bible or the king James version to the comparative to anything in English.\n\n\nHow does precedence make something a miracle?",
        "created_utc": 1480532716,
        "upvote_ratio": ""
    },
    {
        "title": "I have a hunch Obama is really an just an optimistic humanist, rather than explicitly Christian.",
        "author": "Pop-X-",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5fnn1v/i_have_a_hunch_obama_is_really_an_just_an/",
        "text": "This [quote of his](http://i.imgur.com/uB92i5R.jpg) from the recent [post-Trump one-on-one he did with *The New Yorker*](http://www.newyorker.com/magazine/2016/11/28/obama-reckons-with-a-trump-presidency) kind of furthered my suspicions. \n\nIt's how he refers to humanity there in such bluntly scientific terms, yet with such an ethical and ideological grounding, that seemed to indicate to me his displays of faith have been primarily political. \n\nMaybe he could be a deist; I suppose that's also possible. Either way his lucidity is fascinating to me. \n\nI don't think we've ever heard a U.S. president talk about life in such an empirical way before, throughout Obama's presidency, and I think that's been a benefit to rational people (though a source of resentment for others) these past eight years.",
        "created_utc": 1480480184,
        "upvote_ratio": ""
    },
    {
        "title": "How many Atheists wish they were religious?",
        "author": "NimrodOfNumph",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5fkig3/how_many_atheists_wish_they_were_religious/",
        "text": "I consider myself an Agnostic Atheist. I generally have a scientific mindset (I'm an engineer) and take things as they come. I truly think Religion is absurd, but also understand that the Universe is a big place and that it is ignorant to state something as a 100% true fact.\n\nTry as I might in my youth; Religion just made no sense. I read the various holy texts. I talked with several Churchs, Temples and Mosques. I even spoke with religious individuals in the more side-lined religions (like wiccan). It always just seemed silly and an obvious reaction to old ignorance and a barbaric explanation to events humans couldn't explain.\n\nYet I see the benefits of large supportive groups of the like-minded. The confidence of the belief in an afterlife. The comfort of having a creator looking after you.\n\nI know I could never be Religious. The thought of it is almost humorously inane to me. But sometimes I read articles like the one about how religion can trigger the same pleasure centers as sex, or see groups of people circled around a loved-one's deathbed in comforting prayer. And, it just makes me wish I could be like that... sometimes...\n\nI know in general i'm pretty happy with how I view the world. I have so many less restrictions on my world-views and in many ways can be a lot more loving and tolerant of others by being an Atheist. But just once in awhile. It'd be nice to flip on a switch that just let me feel their same level of comfort and safety.\n\nDo many other Atheist's have these same thoughts?\n\n*Edit:* Thank you for the answers so far. Some of them have been helpful and about 80% of them don't actually answer the question at all and roughly translate to, \"That's a stupid thought\". Lol I love Reddit. For those that actually just straight up answered my question. Thanks you're awesome.",
        "created_utc": 1480446119,
        "upvote_ratio": ""
    },
    {
        "title": "How did you become an atheist (survey)?",
        "author": "learnaboutatheism",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5fggrd/how_did_you_become_an_atheist_survey/",
        "text": "[removed]",
        "created_utc": 1480391658,
        "upvote_ratio": ""
    },
    {
        "title": "Why was religion created?",
        "author": "Jeng130",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ffy2i/why_was_religion_created/",
        "text": "I read something once that briefly discussed the idea that if religion is fake then it had to be a human made creation. I don't know if this topic has been discussed here before though I'm sure it has at least once or twice. \n\nSo my question would then be if it was human made then who created it and why. The who aspect of the question may be a bit harder to discuss so I was more curious about the why. \n\nSome of the theories I've read about for why religion was created are:\n1. Humans didn't understand how the world worked so to simplify and rationalize how and why life worked they created religion as an easy explanation. \n-There's the science side of it being that there was a lack of science, so for example how life is created and how the planet works.\n-Then there is also the psychological side about the meaning of life, human purpose, the unpredictability of life, and what happens after death.\n\n2. In the past humans had to survive and didn't have too much to do with what spare time they had so for fun and entertainment they told stories. This means the bible was just a well written work of fiction that either gained traction intentionally or accidentally. \n\n3. As human society advanced the people in power either created or used the story to maintain power, control, and wealth over the masses. \n\nThere are and were many religions in all different parts of the world and they claim their religion is the real one even though it may not have been the first one created.\nAnother point that was made based on there being many religions out there, if believer of religion-A happened to be born in a different part of the world that same person would have been taught religion-B. So someones religious view are potentially dependent on where in the world they grew up. \n\nThere are some other points I'm forgetting at the moment but I was curious about your guys thoughts on these theories and if there are other interesting theories you've heard of?\n",
        "created_utc": 1480385211,
        "upvote_ratio": ""
    },
    {
        "title": "Change Is Difficult",
        "author": "xenothealien",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5fc9ew/change_is_difficult/",
        "text": "I was watching one of my favorite YouTubers do a sub Q&amp;A when he said something that really stuck in my craw. \"I stopped believing in Jesus when I stopped believing in Santa.\" As irrational as it may be I felt I was being insulted for not becoming an atheist earlier in life. As a former fundamentalist Christian I feel like I can offer some insight into why we don't become atheists sooner if at all.  \n\n**Secularist Christians vs Fundamentalist Christians** \n\n[My old church](http://themessage.com/en/home) \n\n[A organization for churches that are accepting of homosexuals](http://www.gaychurch.org/find_a_church/)\n\nI won't get into the whole \"homosexuality is a sin\" debate. I'm just using it as an example. The point is that fundamentalists differ wildly in their beliefs and behaviors than most \"normal\" Christians. \n\n **Fear and Intimidation** \nIf you have 30 mins to spare try listening to some of the recordings on that  fundamentalist website especially the parts on Revelations and \"the end times\".  Now imagine being a five year old kid listening to this stuff everyday. Imagine vivid descriptions of hell and other punishments that await unbelievers and imagine everyone around you saying that all this stuff is true and will really happen to you. \n\n**Belonging** \nHumans are social animals and a sense of belonging is very important thing to many of us. When I became an atheist I was sharply cut off from the only social group I'd ever known. The emotional trauma of this event and the fear of this trauma undoubtedly affects ones decision to leave the faith.     \n\n**Finances** \nIf you have a spouse tied to the church or you work for a member of the church this will obviously make leaving more difficult. \n\n**Constant Exposure** \nYour entire life revolves around the church. You're constantly around people whose belief is ironclad. Their faith affects yours, especially if you're young.  \n\nThe point here isn't to debate the validity of religion. If you're wondering why I or others like me didn't stop believing much earlier than you did the answer may simply be that we were much deeper down the rabbit hole. ",
        "created_utc": 1480347348,
        "upvote_ratio": ""
    },
    {
        "title": "Secularized Christianity vs Fundamental Christianity",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5fc6tn/secularized_christianity_vs_fundamental/",
        "text": "[deleted]",
        "created_utc": 1480346537,
        "upvote_ratio": ""
    },
    {
        "title": "Church isn't that bad",
        "author": "Sheepy_Scronky",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5fbztj/church_isnt_that_bad/",
        "text": "This is coming from someone who has been an atheist for 3 years. A couple of my closest friends are religious and attempted to do that religion thing where they ask you to go and what not. We've all discussed our beliefs with each other and are all aware of what each one thinks. Turns out the church was having a competition to see who could bring in the most people. The point is that church despite being boring for me wasn't that bad. I ended up learning some valuable life lessons in there. Some not even having anything to do with God. I just see some posts about people hating going to church with parents and I think why not? You guys might learn a thing or two? Try it!!",
        "created_utc": 1480344266,
        "upvote_ratio": ""
    },
    {
        "title": "How was Church?",
        "author": "Firecrackers",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5f70vg/how_was_church/",
        "text": "[removed]",
        "created_utc": 1480275207,
        "upvote_ratio": ""
    },
    {
        "title": "Want to make an anonymous gift of cash to a friend but avoid motivating her to praise God for it.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ezpk2/want_to_make_an_anonymous_gift_of_cash_to_a/",
        "text": "[removed]",
        "created_utc": 1480171038,
        "upvote_ratio": ""
    },
    {
        "title": "how do you find meaning in life as an atheist?",
        "author": "imazit",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ex4bt/how_do_you_find_meaning_in_life_as_an_atheist/",
        "text": "I'm sure this discussion has come up before here but new to this subreddit and wouldn't mind the discussion.  I've been an atheist since I was ten and I've been severely depressed ever since.\nI am always thinking about death and admitted this to a friend.  He said you are too young to think about death that is a long way off.  \nTo this I replied.  It doesn't matter how far off death is.  Whether I die tomorrow 10 years from now or 100 years from now it is all the same.  An eternity of nothing.  Every memory I have amassed, every meaningful relationship I have crafted, every beautiful thing that has ever happened to me will vanish into thin air.  It will be gone forever and I will have no recollection of my time on this earth.  Everytime I feel any sense of joy in this world all I can think is this moment means nothing because it will be gone forever as will I.  Don't tell me death is a long way off because I am already dead.\nI hate feeling this way and sometimes I wish I was never born so I wouldn't feel this way but then I just once again think never being born is the same as dying.  Sorry if this is better suited in depression or another subreddit but I just needed to vent.  ",
        "created_utc": 1480125051,
        "upvote_ratio": ""
    },
    {
        "title": "numerologist.live - weird website but really works. Let me know what do you think after watching personality video.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5euos8/numerologistlive_weird_website_but_really_works/",
        "text": "[removed]",
        "created_utc": 1480095085,
        "upvote_ratio": ""
    },
    {
        "title": "Prayer vs Reality - does prayer hold up",
        "author": "ClarityDynamic",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5eu4vz/prayer_vs_reality_does_prayer_hold_up/",
        "text": "No it does not hold up. Unfortunately prayer is just about as effective as dancing naked in the woods. It's unfortunate people still believe they are helping someone by engaging in this fruitless exercise.  The article link is included below as well as a journal article on the STEP project. \n\nPerhaps prayer is more of a comfort for the person praying rather than the recipient.  \n\nWhat is going on. When are people going to realize instead of praying they should be doing research and analysis into finding solid solutions to the problems and maybe changing the world in the process. \n\nWe need more people off their knees and sitting at their desks pouring over scientific journals on medicine and research. Helping the scientists find answers that will help many people. \n\nQuit with the praying and use your \"God\" created brain to help find solutions to the worlds most pressing problems. Those solutions are found AT YOUR DESK pouring over research papers not on your knees speaking nonsense. \n\n[prayer vs reality article ](https://valerietarico.com/2016/11/20/what-the-bible-says-about-prayer-versus-reality/)\n\n[STEP Project results ](https://www.ncbi.nlm.nih.gov/m/pubmed/16569567/)",
        "created_utc": 1480088552,
        "upvote_ratio": ""
    },
    {
        "title": "My transition. (continued)",
        "author": "Posthumodernist",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ekqk3/my_transition_continued/",
        "text": "4. Liberal democracy: Since I knew myself, I have always heard that America and American principles were the enemy of Islam. While it is true the concept of freedom, liberty and liberal democracy are a genuine threat to Islam, it was never the enemy of humanity. I realize that when I read the declaration of American independence, Thomas paine’s work and some biography of the founding fathers. I admired Thomas Jefferson so much and I considered him as not only the father of America but the father of any one who admires and uphold the concept of modern liberty. This led my transition from being a muslim to being a Human first before anything. The concept of humanity is far much more important to me than any ideology and it will remain the foundation on which I build “who I am” now. \n\n5. Reconciliation: How was I able to escape the overprotective clutches of Islam? To be fair my life as a muslim was okay the way it was. Even when I was a muslim I did many of the things frowned by Islamic principles. I listen to music, mingle with women, had non-muslim friends, and admired scientific theories such as the big bang and evolution. What needed to change in me? Only one thing, I yearned for the reconciliation of the different ideas in me. Some sort of harmonization into a poetic rhythm; some sort of consistency in my thoughts and actions. Then I read a statement somewhere that said, “Truth cannot contradict truth, but only bears testimony to it.” This reconciliation of the contradictions I held in the diversity of my opinions lead me to the type of thinking I have now. The most important thing I learned was to avoid the giant leap to conclusion that is distinct to so many religious thoughts. \n\n6. Processor: The development of the mental process to process information so vague to me contributed significantly to my transition. It was initially develop to help me in studying during my time at college. This mental process consist of a continued iteration of a topic or subject matter under the course I was studying till I create a continuity of insight. This is not understanding per say but to make sure that complex vague statements and terms can be explained in terms of simpler vague terms. Let me illustrate, what is an acidic substance? Ans: Any substance that has a pH less than 7.0. What is pH? Ans: Is the negative logarithm of hydrogen ion concentration. Even though at that time I didn’t understand clearly what these definition were, I was able to explain anything regarding acidicity and basicity using them. This requires more of memorization than logical thinking. But yet this tedious and repetitive process was the important tool I used to regurgitate almost all the information I am proud of today. \n\nThese are some of the points in brief that contributed to my transition from a devout muslim to the atheistic free thinker I am now. In conclusion, even though everybody has a choice to choose a world view they like subjectively, there are only limited options that are practical and useful to humanity. Thus, it shall remain my passionate endeavor to find such. \n\n",
        "created_utc": 1479946388,
        "upvote_ratio": ""
    },
    {
        "title": "Anti-theists, if religion were to disappear tomorrow, what would fill the vacuum?",
        "author": "praetorblue",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ejw76/antitheists_if_religion_were_to_disappear/",
        "text": "I'm an atheist, and maybe even a borderline anti-theist myself.\n\nThat said, I recognize that religion gives convenient answers to many people, and is a framework they structure their lives around (with varying fidelity). Although I don't think religion is the only thing keeping people from acting as savages, clearly SOME people are dissuaded from acts of crime or malice because they fear judgment by a creator.\n\nIf religion were to be completely extinguished tomorrow, what would fill that vacuum? Would you expect to see a massive uptick in crime, suicide, and other undesirable social problems?\n\nTo be clear, I absolutely do not think religion is a good solution to these problems. But I have a very hard time imagining the world's poor, uneducated, and otherwise marginalized people suddenly becoming rational and loving each other. Some percentage of them were holding back because they saw damnation as the alternative, and I would worry that removing religion would unleash incredible problems on society.\n\nI'm curious to hear what other (perhaps stauncher than I) anti-theists imagine in a world without religion.\n\nTo be clear, I'm not talking about a gradual transition away from religion over time, where society has time to adapt. If everyone just stopped believing today, what is the fallout?",
        "created_utc": 1479936635,
        "upvote_ratio": ""
    },
    {
        "title": "How to decide between \"coming out\" versus avoiding religious topics with family (especially around the holidays)?",
        "author": "Wave-ParticleDuality",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5edmls/how_to_decide_between_coming_out_versus_avoiding/",
        "text": "To preface this: I am a 27 year old adult and completely independent from my parents (and have been for about 5 years now). My mom is especially devout in her religious beliefs. I \"deprogrammed\" from my strict southern baptist upbringing about 4-5 years ago, but I haven't fully \"come out\" to my mom. She occasionally still invites me to church or asks if the person I'm dating is a christian and reminds me how important that is (He's not. Dating a free-thinking and like minded individual was a priority for me). I tend to give her very vague answers to her questions and try to avoid the topic and change the subject. \n\nIs it worth ripping off the bandaid and just coming out? I don't really see her or talk to her unless it's around the holidays, and I always dread having to spend time with family because of the anxiety I get knowing she'll try to pry about my spiritual life. \n\nI know opening up to her will completely shatter her and she'll either a) go into deep depression or b) make it her life's mission to try to \"win me back\", so to say. Neither of those outcomes seems particularly favorable to me over just refusing to bring it up. But that still doesn't cure the isolation/anxiety/loneliness/sadness I sometimes feel around the holidays. \n\nDoes anyone else have any experiences with \"coming out\" about being atheist versus avoiding the topic altogether? Do you regret your decision? Why or why not?",
        "created_utc": 1479853235,
        "upvote_ratio": ""
    },
    {
        "title": "Dualism Vs. Materialism",
        "author": "Doom_Carrot",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ed76d/dualism_vs_materialism/",
        "text": "I am curious what agnostics/atheists think about this.\n\nDo you believe that there is a spiritual component specific to humans, or do you think that all human consciousness is a result of explainable physics and chemistry in the brain?\n\nI personally have shifted from dualist beliefs to a more neutral stance, but I think I am becoming more materialistic every day. there are just a lot of things, like cojoined twins, that really mess up dualism.\n\nWhat do you think about this? Could you make an evidence based argument to support either idea? If so, what argument would you make for dualism or materialism?",
        "created_utc": 1479848728,
        "upvote_ratio": ""
    },
    {
        "title": "My Transition",
        "author": "Posthumodernist",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ea8fv/my_transition/",
        "text": "For me these are the reasons why i dump faith all together.\n\n1. Revealed text: Revealed text such as holy scriptures are rigid text that are not subject to metamorphosis. Their mere incantation or recitation in some religion is meant to have an immense power but yet times without number this simple assertion can't be substantiated in reality. They are considered to contain all explanations and wisdom but the fable and allegories contain therein have plot twist and insight that are no more sophisticated than common folk tales or wise sayings. To me they are just best seller novels of over dramatic artists who wanted to rein for all eternity. \n\n2. Perfect men as role models: Religious apostles and founders are considered to have lived a perfect life worthy of emulation by anyone who wants to live on more than bread alone. Love in Jesus christ, Happiness and tranquility in Buddha, Honor and leadership in Muhammad, and Revolution and emancipation in Moses. These are human achievements that can be credited to them fully and is well within the capabilities of humanity. They are great men and they are nothing more than that. \n\n3. Heaven and Hell: These are the most powerful concept of religion ever produce. For so long it has substituted personal responsibility as the motivation and inhibition of all human action. Personal responsibility is the hardest and most stringiest ethical principle to use. What will one do or not do to get a ticket there. Garden of eden folks!!!! Everyone is naked for one, what more do you need. Blazing fire!!!! No, no no, no, no, and no. \nWho can get there and how? Only those who believe in the one true God and follow his principles. So how do does one finds the true God? He just has to believe in \"The God\" no matter what. But there are other Gods. And other people believe in him and is a sin to question your belief in all monotheistic religion. They are all based on faith which is to accept without any question. To me i came to two conclusion. A. All people that have faith in what they believe regardless of the religion deserve to be in heaven. OR B. If the existence of true God need to be inferred from more than faith i.e through reason or logic then faith is not enough. Search for the reasonable and logical existence of God is what lead me to atheism. Atheism as Richard dawkins define it in a nice statement as follows, \"Whe are all atheist in regard to the other Gods in history (Thor, Ra, Zeus, e.t.c.), some of us just go one God further.\" Not an exact quote but it convey my point. \n\nTo be continued.... \n\nIf there are any contradictions or better assertions than the one above i will be happy to reconcile my points.",
        "created_utc": 1479814068,
        "upvote_ratio": ""
    },
    {
        "title": "Clarification on my previous post",
        "author": "Posthumodernist",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5e6s7k/clarification_on_my_previous_post/",
        "text": "[removed]",
        "created_utc": 1479764875,
        "upvote_ratio": ""
    },
    {
        "title": "can't do this much longer(stuck in atheist closet)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5e2mf5/cant_do_this_much_longerstuck_in_atheist_closet/",
        "text": "[deleted]",
        "created_utc": 1479708958,
        "upvote_ratio": ""
    },
    {
        "title": "LOGIC OF RELIGION",
        "author": "Posthumodernist",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5dy3rt/logic_of_religion/",
        "text": "[removed]",
        "created_utc": 1479650120,
        "upvote_ratio": ""
    },
    {
        "title": "What is agnosticism?",
        "author": "McKlowskey",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5dr592/what_is_agnosticism/",
        "text": "The most common explanation I have heard for what agnosticism is is that its the claim that there is not enough available information to conclude whether a god or gods exist. Now if that is true, then it is sort of a rejection of the scientific mind set. Atheism (In my opinion, of course) is only the assessment that \"There is no evidence for a god or gods, therefore I do not believe in one.\" Saying one is agnostic (assuming that it has the aforementioned definition) is basically claiming \"There is no evidence for a god or gods, yet I will still assume that the claim has some credibility to it, despite not committing to a faith system.\" In the world of science, if something has no evidence to exist, then the idea is never seriously considered. It just seems that the claim to agnosticism is still seriously considering the validity of the existence of a god or gods, despite there being absolutely no logical reason to. Please explain the flaw in my reasoning, or explain the logical reason one might claim to be agnostic.",
        "created_utc": 1479534622,
        "upvote_ratio": ""
    },
    {
        "title": "I'm drifting from religion.",
        "author": "Trewdub",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5dl3ez/im_drifting_from_religion/",
        "text": "At this point on my journey, I am most certainly a believer in the spiritual world, not only because of others' stories, but because of my own, truly unexplainable instances throughout my life. I'd dare to say that all my religious ties have been severed, and I suppose I'd identify as agnostic, though sometimes I fancy myself an atheist, as the definition of Theos has so much baggage, *and* the nature of \"God\" must be vastly different than any sort of conception we mere humans are capable. \n\nLike most of us on here, I was raised in a fairly religious home (though my father was quite interested in Eastern practices, philosophy, etc.), went to church every *Saturday*, and was a YEC for the vast majority of my adolescent life. I now am in an odd position, as most people in my social circles *are* still religious. \n\nThoughts? Empathy? \n\nEdit: Thanks everyone for the encouragement and the advice. This is the first time I've been the \"hottest\" result on a fairly large subreddit and it's taught me that not all atheists are distasteful. Subscribed :)",
        "created_utc": 1479451887,
        "upvote_ratio": ""
    },
    {
        "title": "My rebuttal to a pastor saying he never sees atheists at disaster zones.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5dk4lm/my_rebuttal_to_a_pastor_saying_he_never_sees/",
        "text": "[deleted]",
        "created_utc": 1479437490,
        "upvote_ratio": ""
    },
    {
        "title": "I wrote a response to a Pastor I work with who said that he never sees atheists at disaster zones...(First real post, be gentle)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5dk29p/i_wrote_a_response_to_a_pastor_i_work_with_who/",
        "text": "[deleted]",
        "created_utc": 1479436631,
        "upvote_ratio": ""
    },
    {
        "title": "Is Atheism really the most rational/logical mode of thought?",
        "author": "kyle2143",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5djjij/is_atheism_really_the_most_rationallogical_mode/",
        "text": "I've thought about this for a long while. And I'm really confused. I feel like most people who are Atheist tout that Atheism is the most logical way to view the universe. Which doesn't make any sense to me; it certainly seems more logical than most religions that involve gods and whatnot, but not perfectly logical. \n\nI feel like the most logical \"religion\" or way of thought (I don't know what you'd call it here) would be Agnosticism. Not certain if there is a \"God\" or \"Higher power\". I don't know how people can be so adamant that there is no god when there really is no proof one way or another. I'm not talking about any particular religion like Christianity or Hinduism having no proof, but everything in general; it sounds to me that Atheists take \"no proof God exists\" to be equivalent to \"God doesn't exist\". I don't mean to Descartes it up, but nobody can ever really be sure of anything (except themselves I suppose), so I don't understand how a group that often proclaims that their \"religion\" is the most logical is certain that they are correct. \n\nI don't mean to antagonize, but I'd really like an answer to this question because it seems to me that \"belief in nothing\" is the same as \"belief in something\". I think that admitting that (at this point) we can't say for certain one way or another is the most logical thing to do.",
        "created_utc": 1479430026,
        "upvote_ratio": ""
    },
    {
        "title": "At this point, I believe I will be a closet atheist for the remainder of my life.",
        "author": "iCryKarma",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5dekf9/at_this_point_i_believe_i_will_be_a_closet/",
        "text": "Like most of us, I grew up in a religious household. The fear of Hell was poured down my throat and I was dragged into a Southern sermon every Sunday. Skip ahead a few years and I grow out of that fear but gain a new one. I'm absolutely terrified of my family knowing my religious beliefs. This is due to a mixture of my family being absolute nut jobs, and their complete lack of acceptance of anything that strays from their beliefs.   \n  \nFast forward to today, now that I've gained a lot more confidence in my beliefs, I decided I was going to go downstairs and bring up the conversation about my beliefs while my extended family is in town. Only to walk in on a conversation about how Hillary Clinton is a Wiccan for wearing purple and that the \"lamestream\" media is ridiculous for convincing these sheeple that purple is a symbol of unity between bipartisans. I just wish I wasn't alone in my family.  \n  \n Sometimes I wish I could just believe in their god(s) but I feel like I'm playing pretend when I make the attempt. Everyone in my family already thinks I'm an egotistical liberal millennial who thinks he's a genius simply because I don't believe in all of the pyramid schemes they fall for every day. ",
        "created_utc": 1479367321,
        "upvote_ratio": ""
    },
    {
        "title": "Searching for clarification of the term atheism",
        "author": "TheLactose",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ddaly/searching_for_clarification_of_the_term_atheism/",
        "text": "So, before I get to my issue I want to say that I've been an atheist for a long time, and I realize atheism and agnosticism are not mutually exclusive. Agnostic Atheist is the label I have applied to myself for quite some time. I think there is probably some obvious error in my thinking, but I can't quite put my finger on it. Thus, I was hoping the people of this subreddit could set me straight. \n\n\nI understand the difference between atheism and theism as the response to a simple question: Do you believe in a god or gods? To which it seems there are two responses. \n\n1. Yes, I believe in a god or gods. \n\n2. No, I don't believe in a god or gods. \n\n\nRecently, I watched some apologist say that the second statement requires a burden of proof just the same as the first statement. This seems to make sense to me. If one says they don't believe in something, are they not required to provide evidence for why they believe it? It seems that the best position to take would be to simply withhold belief, but atheism is defined in many places as the disbelief in a god or gods. What am I missing here? Is it the agnostic part of the label that removes the burden of proof? Is it only knowledge claims that require a burden of proof? Like I said, I know it must be something glaringly obvious, so please don't think I'm a complete idiot.  \n",
        "created_utc": 1479348408,
        "upvote_ratio": ""
    },
    {
        "title": "Having some trouble trying to understand these events",
        "author": "Asskicker12",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5dd1ny/having_some_trouble_trying_to_understand_these/",
        "text": "[removed]",
        "created_utc": 1479345300,
        "upvote_ratio": ""
    },
    {
        "title": "How to cope with anxiety without a religion to lean on",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5d4afj/how_to_cope_with_anxiety_without_a_religion_to/",
        "text": "[deleted]",
        "created_utc": 1479236143,
        "upvote_ratio": ""
    },
    {
        "title": "What are analogies that might be helpful to get someone to understand how freewill and predetermination conflict?",
        "author": "Armando_Munoz",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5cx2wf/what_are_analogies_that_might_be_helpful_to_get/",
        "text": "I'm trying to explain this to a friend who is a christian that I don't see how the two can coexist or work together. i'm having trouble explaining it. It seems to me that if a being knows what i'm going to do before anyone else and cannot be wrong then i don't actually choose anything i'm just doing what that being wants whether i want to or not. She's not getting it.",
        "created_utc": 1479143899,
        "upvote_ratio": ""
    },
    {
        "title": "Absolute certainty, knowledge, and the willingness/ability to change one's mind.",
        "author": "ZapMePlease",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ct1xg/absolute_certainty_knowledge_and_the/",
        "text": "First things first - I'm not positive that I need the apostrophe in *one's*.\n\nSo I've been wading through a bunch of old threads and I was hoping to get some input as to some definitions.  \n\nFirst off - *knowledge*.  To my mind knowledge is 'justified true belief' - something you believe and have good evidence for.  I'm fairly sure this position will get consensus (even on Reddit) but i'm interested to see.   \n\nNext would be *absolute certainty*.  How, exactly, would *absolute certainty* relate to *knowledge*.  If you have *knowledge* and you get new information then can you adjust your *knowledge* to incorporate the new information?  How about *absolute certainty*.  Can that change given new information?  \n\nFor example - I'm absolutely certain that there are no pennies in my pocket - even though I haven't put my hand in there for hours. If, however, I were to find out that my children had been playing with pennies and they had been trying to learn how to pickpocket like in a Dickens novel then I would no longer hold that position - I wouldn't be as sure.  Does that mean I wasn't absolutely certain in the first place?   Was I merely 'confident' in the first place and not 'certain'.\n\nWith definitions for these terms established I would then ask the logical follow up - do you have to have *absolute certainty* to be *gnostic*?  Or do you require a certain level of *confidence*.  ie is *absolute certainty* limited to things like mathematical proofs?  If so then why are the terms *agnostic* and *gnostic* even brought to bear on a subject not amenable to them?\n\nI'd love to get a grip on how these terms are used vs how they *should* be used.  To my mind if gnosticism requires absolute certainty and absolute certainty can't change regardless of new information then there is nothing I can *know* to which the term gnostic would apply.  If, however, *gnostic* means that you know to a particular *level of certainty* then being a *gnostic* atheist really isn't any different than being an *agnostic atheist* as both positions would be willing to change their views when confronted with new evidence.\n\nHope this wasn't too confusing.",
        "created_utc": 1479082903,
        "upvote_ratio": ""
    },
    {
        "title": "Using \"Dr. Strange\" to argue against scientism. Yes, really.",
        "author": "tmfaber",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5clw8u/using_dr_strange_to_argue_against_scientism_yes/",
        "text": "My catholic in-laws love emailing me articles to prod at my atheism. Today's was titled \"“Doctor Strange,” Scientism and the Gnostic Way Station\". I was hoping you guys could take a look at this short and eye gouging article and guide me in ways I could respond or refute. \n\nHere is the link: https://zenit.org/articles/doctor-strange-scientism-and-the-gnostic-way-station/\n\nThe author bashes \"new\" atheists, \"comically arrogant scientism\", and longs for the days of religious scientists who didn't discount the supernatural. \n\nHere is a choice quote for you: \"I’m sure it’s asking too much to expect escapist popcorn movies to get Biblical spirituality right. And if Doctor Strange can beguile young people out of a deadening and self-contradictory scientism, opening them to a world beyond ordinary experience, I say 'two cheers for it.'\"\n\nWhat are your thoughts? Is scientism self contradictory? Has this guy heard of methodological naturalism? Any advice would be greatly appreciated. \n\n\n\n\n\n",
        "created_utc": 1478977827,
        "upvote_ratio": ""
    },
    {
        "title": "Does atheism inherently breed nihilism (or is it just me)?",
        "author": "0xD153A53",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5cl87i/does_atheism_inherently_breed_nihilism_or_is_it/",
        "text": "As an atheist and a nihilist, I've wondered for a while whether one inevitably led to the other.  Rejecting a belief in an all-powerful, eternal god, the only overarching universal aspect humanity has created is no longer a concern.  With that, the suggestion that there could possibly be a universal sense of meaning of life disappears with it.  \n\nThat said, I'm open to the idea that there *could* be a universal meaning to all of this. However, given our intellectual limitations, if such a universal meaning does exist, we're far too primitive to be able to comprehend it.  As such, does that imperception equate to its lack of existence, for all intents and purposes?",
        "created_utc": 1478969576,
        "upvote_ratio": ""
    },
    {
        "title": "Is reigion really mental illness?",
        "author": "TheSithMaster17",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5cjy4j/is_reigion_really_mental_illness/",
        "text": "Some people say yes but I have seen others (even atheists) claim it isn't. There is an apparent connection though according to sone and st one point all forms of religion were considered mental illness. A few spurces even claim its just like Schizophrenia. I always thought the sort of voices in such people were rude or suicidal. So where do these voices people identify as jesus come from. Those sorts of experiences arn't evil. There are alot of people who are religous and claim to hear gods voice all the time but its not rude or evil. So what is your opinion on this idea of religion being mental illness?",
        "created_utc": 1478948198,
        "upvote_ratio": ""
    },
    {
        "title": "If Women Were Black Men...(Parody)",
        "author": "Finder10",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ceu94/if_women_were_black_menparody/",
        "text": "[removed]",
        "created_utc": 1478875921,
        "upvote_ratio": ""
    },
    {
        "title": "What is your opinion about ''conspiracy'' ''theories''?",
        "author": "Aquele_Carinha",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5c9cxj/what_is_your_opinion_about_conspiracy_theories/",
        "text": "[removed]",
        "created_utc": 1478801766,
        "upvote_ratio": ""
    },
    {
        "title": "Who do you think wrote each religious book and when?",
        "author": "bigfriendyo",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5c8nuk/who_do_you_think_wrote_each_religious_book_and/",
        "text": "[removed]",
        "created_utc": 1478794608,
        "upvote_ratio": ""
    },
    {
        "title": "Question About the Resurrection Accounts",
        "author": "iapst",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5c5zz4/question_about_the_resurrection_accounts/",
        "text": "So, the account of the Resurrection of Jesus we find in the Bible contains some things that qualify for the criteria of embarrassment.  The women are the first to see the empty tomb and run and tell the others; women were considered untrustworthy, and this would be foolish to include unless it were true.  The Messiah wasn't even expected to be crucified; why include that?  The Messiah wasn't expected to be resurrected; why include that?  There are these things that make it seem like the statements there are true and not a fabrication or later addition or hallucination (because they weren't expecting it, and mass hallucination hasn't been recorded ever).\n\nWhat does one make of this?  Why would they include these things if the accounts aren't true?",
        "created_utc": 1478752609,
        "upvote_ratio": ""
    },
    {
        "title": "5 Horrifying Evil Spirits Possession Caught On Tape",
        "author": "Mikigr",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5c0qmi/5_horrifying_evil_spirits_possession_caught_on/",
        "text": "[removed]",
        "created_utc": 1478693646,
        "upvote_ratio": ""
    },
    {
        "title": "Morality is the best argument for Gods existence",
        "author": "Conigman",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5bt7om/morality_is_the_best_argument_for_gods_existence/",
        "text": "[removed]",
        "created_utc": 1478612155,
        "upvote_ratio": ""
    },
    {
        "title": "Does Atheism exclude Pantheism",
        "author": "Brandon138",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5bs3vk/does_atheism_exclude_pantheism/",
        "text": "Title. Atheists can't seem to talk about atheism without bringing up human made religions. IF there were a god, obviously it isn't a skydaddy and it wouldn't be concerned with human affairs. A 'god' doesn't necessarily have to be a thinking judging god.  However this is never acknowledged that I see. ",
        "created_utc": 1478593474,
        "upvote_ratio": ""
    },
    {
        "title": "The more people fight about religion or try to assert it on others, the more I feel like the constitution of religion is fake",
        "author": "bigfriendyo",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5bp1u8/the_more_people_fight_about_religion_or_try_to/",
        "text": "After growing up in a religious family, and in a deeply religious country I feel like religion is just something that is forced down your throat. I've been watching a few historical shows right about the same time as the worldly religions started. The very idea that 2 people sitting together and exchanging what their gods tell them to do or how to act, makes me believe that this is all a hoax to get people to conform and not fear death. In the end, every religion is about what happens after death, heaven, valhalla, the great blue sky, etc. They are all just different variations of each other and were created to get the people to follow their leader and his religion. I feel like there was once that fucker that couldn't get his people to truly believe in him so he/she created the idea of god and religion. Why do people nowadays still force religion onto others? does anyone think that once the world achieves peace, everyone can denounce their own religion and practice on worldly religion based on humanity ?",
        "created_utc": 1478554765,
        "upvote_ratio": ""
    },
    {
        "title": "Gnostic atheist is the most logical viewpoint.",
        "author": "gnad",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5bkl46/gnostic_atheist_is_the_most_logical_viewpoint/",
        "text": "While I saw most atheists online self-identify as agnostic atheists, IMO, it is more of political correctness reason. Lack of evidence should qualify as enough evidence, and gnostic atheist is the more logical viewpoint. Let me elaborate:  \n\nDo you think invisible flying cows exist, and somehow do not interfere with our lives? Well, I think if I were to ask you this question, you would think I'm crazy of some sort. Because there's no evidence invisible flying cows exist. Do you think the existence of cows, and the existence of flying species, is an evidence in favor of invisible flying cows? Do you think there must be evidence that deny the existence of invisible flying cows, for you to believe they don't exist?  \n\nNo evidence of existence = Evidence of non-existence.  \n\nIn the future, if there happens to surface any evidence that invisible flying cows exist, I would be happy to change my belief. For the time being, I will deny their existence, for the simple reason of no-evidence.  \n\nThe same principle should be apply, not only to religions, but pretty much all aspects of our life. I'm very open to change my mind when there is evidence, but I will deny everything without evidence, and any theory that goes against science.",
        "created_utc": 1478497842,
        "upvote_ratio": ""
    },
    {
        "title": "I can't grasp nothingness",
        "author": "FishMahBoi",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5bilrs/i_cant_grasp_nothingness/",
        "text": "I know I have posted in the past but things seem to be getting out of hand with me mentally. \n\nI am an atheist and have been scared of death for quite a while due to my fear of the future. Though the concept of nothing does calm me down I can't shake off the fear and I don't know why. \n\nIts just every time I think of non experience i think of being deaf, blind and dumb. Eyes are closed and so there is just blackness, though this is nor inherently scary due to a lack of mind to complain about it. \n\nAs a result my fears cripple me, I procrastinate or half ass some work I need to do while looking miserable. I want to act like a normal human being again and thus I would like to understand nothingness better rather than letting anticipation kill me",
        "created_utc": 1478472279,
        "upvote_ratio": ""
    },
    {
        "title": "Do religious experiences come about due to the environment and actions?",
        "author": "TheSithMaster17",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5bfkqv/do_religious_experiences_come_about_due_to_the/",
        "text": "Is it possible that people who claim to hear the voice of God or have dreams and visions are just overlooking their actions. Is it true that if you deprive yourself of food or water or even sleep that you will have these experiences? Let's say you put yourself in a room alone with no distractions and and just pray non stop without food or sleep, does this give way to an experience happening to you? It's interesting because I have heard these kinds of things before but is it actually proven?",
        "created_utc": 1478436803,
        "upvote_ratio": ""
    },
    {
        "title": "Confirmation bias and the Internet - is the digital age really making ot easier for people to leave their religions?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5bct2d/confirmation_bias_and_the_internet_is_the_digital/",
        "text": "[deleted]",
        "created_utc": 1478387928,
        "upvote_ratio": ""
    },
    {
        "title": "Isn't agnostic atheism an argument from ignorance?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5b70rf/isnt_agnostic_atheism_an_argument_from_ignorance/",
        "text": "I mean basically it's saying I don't believe because there's no convincing evidence. But it doesn't mean there isn't no God, just that we haven't got evidence right now.",
        "created_utc": 1478302528,
        "upvote_ratio": ""
    },
    {
        "title": "God destroyed in thirty seconds",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5b5yhn/god_destroyed_in_thirty_seconds/",
        "text": "[removed]",
        "created_utc": 1478290766,
        "upvote_ratio": ""
    },
    {
        "title": "What age were you when you 'converted'?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5b55nj/what_age_were_you_when_you_converted/",
        "text": "[removed]",
        "created_utc": 1478282847,
        "upvote_ratio": ""
    },
    {
        "title": "\"Pissed Catholic Mother\", some thoughts on an old video that I wanted off my chest.",
        "author": "keepeetron",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5b280s/pissed_catholic_mother_some_thoughts_on_an_old/",
        "text": "A long time ago I saw this video from 2007: https://www.youtube.com/watch?v=P8Aq00yJSxo \n\nA young boy confesses to his mother that he doesn't believe in god. She goes nuts. 'No more christmas' etc. He takes it, and the video ends.\n\nMy reaction to it way back then was something among the lines of *\"fuck yeah, you go kid, stick it to that bitch\"*, but now my reaction is completely different, it's just plain sad. From the mothers perspective, her son is essentially saying that (among other things) he won't be joining her in heaven. \n\n*my son won't be with me in heaven, and he may suffer in hell*\n\nMulling that thought over, it is tragic. She lashes out with anger because could not control her emotions. It's easy to forget her perspective when she acts irrationally. She is crushed emotionally and I'm guessing probably cried after this video ends. \n\nJust in case anybody gets me wrong, yes I'm an atheist, I agree her perspective is wrong, but the sadness is real.\n\nI guess my point is simply that we should not be too quick to mistake angry and wrong people, for bad people. ",
        "created_utc": 1478243337,
        "upvote_ratio": ""
    },
    {
        "title": "My moms a bible-thumping cunt",
        "author": "mikester714",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5b1ovi/my_moms_a_biblethumping_cunt/",
        "text": "[removed]",
        "created_utc": 1478234032,
        "upvote_ratio": ""
    },
    {
        "title": "Usage of BC &amp; AD vs. BCE &amp; CE in Society",
        "author": "KloudAlpha",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5avjjd/usage_of_bc_ad_vs_bce_ce_in_society/",
        "text": "Wanted to ask this here because I feel like r/atheism would have a very stereotypical opinion, and I want the opinion of some more relaxed and less aggressive atheists such as myself.\n\nDo you guys use AD or CE for dating your years?\n\nPersonally, I'm undecided on this. CE seems more modern and religion-neutral, and it's what the school textbooks use so it's what i'm used to. \n\nYet at the same time it feels somewhat 'disrespectful' to use CE outside of an educational context (at least in the US with a large percentage Christian) because it seems like I'm avoiding \"before **Christ**\" and \"In the year of the/our **Lord**\"\n\nI guess most of my reasoning is because 2016 *Common Era* is the same exact time point as 2016 *Anno Domini*. This makes it feel like a passive aggressive way of disposing of someone's religion.\n\nWhile I do think CE is more scholarly than AD because it leaves out mention of a specific religion, it's still the same thing.\n\nWould my US History teacher think i'm trying to be rebelliously religious if an AD or BC makes it way into my essay, when the standard is CE? Would my Bible History teacher (yes, i take bible history. come at me r/atheism.) think i'm trying to be rebelliously atheist if a BCE or CE makes its way into an essay? \n\nDo I have to filter my usage of calendar systems based on people's religious beliefs?\n\nIf so, where is the line drawn for per-religion filtering? Am I supposed to celebrate Commoneramas instead of Christmas too? (I know that's an extreme example, but you get the gist.)\n\n\n\n**TL;DR - I know I wrote a wall of text, but I want to spark discussion and give quite the variety of points to discuss. Pick a random line to discuss or just discuss based off the title. I'm hungry for opinions.**\n\nIf my opinion sucks then tell me that my opinion sucks and why it sucks so I can unsuck it. These are my pre-discussion thoughts and are usually changed, if not always effected with others' input. ",
        "created_utc": 1478160025,
        "upvote_ratio": ""
    },
    {
        "title": "I think I've figured out why Christianity, Islam, etc exists.",
        "author": "CleverestPony70",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5aqaae/i_think_ive_figured_out_why_christianity_islam/",
        "text": "[removed]",
        "created_utc": 1478098087,
        "upvote_ratio": ""
    },
    {
        "title": "Who will you be voting for in the election?",
        "author": "CleverestPony70",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5apg2s/who_will_you_be_voting_for_in_the_election/",
        "text": "[removed]",
        "created_utc": 1478087892,
        "upvote_ratio": ""
    },
    {
        "title": "I think I've figured out why Christianity, Muslim, etc exists.",
        "author": "CleverestPony70",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ap982/i_think_ive_figured_out_why_christianity_muslim/",
        "text": "[removed]",
        "created_utc": 1478084737,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a muslim. Ask me anything.",
        "author": "emaadk22",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5amj0u/im_a_muslim_ask_me_anything/",
        "text": "If you have any questions regarding my religion or anything really, feel free to ask. Thanks.",
        "created_utc": 1478042783,
        "upvote_ratio": ""
    },
    {
        "title": "Muslim AMA",
        "author": "emaadk22",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5am7xn/muslim_ama/",
        "text": "[removed]",
        "created_utc": 1478039469,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for a book recommendation.",
        "author": "Hophazard",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ak060/im_looking_for_a_book_recommendation/",
        "text": "[removed]",
        "created_utc": 1478017238,
        "upvote_ratio": ""
    },
    {
        "title": "University Professors",
        "author": "Positron311",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5ajr4e/university_professors/",
        "text": "Hi everyone,\n\nI decided to put this here since r/atheism doesn't really seem like the type of place to ask this question. I've been at university for about 2 months now, and I was quite shocked when a few of my professors said this (I'm paraphrasing here):\n\n\"How do we know that this formula works? We've tested and proved it, God didn't send it down from the heavens above unquestioned.\"\n\n\"If we could not question the world around us, then that would be religion.\"\n\nI get that that's what they believe in, and that's fine. But shouldn't they be a little less preachy with their atheism?\n\nEdit: I believe in questioning stuff. My beef with them  is that they stereotype religion and turn it into something that cannot be questioned. I've been able to ask any question to my clergymen and they've given me satisfactory answer.\n\nI should have clarified this.",
        "created_utc": 1478014736,
        "upvote_ratio": ""
    },
    {
        "title": "Some thoughts on the purpose of religion",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5aetwe/some_thoughts_on_the_purpose_of_religion/",
        "text": "[removed]",
        "created_utc": 1477946420,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with the argument from personal experience?",
        "author": "TheSithMaster17",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5abm4y/how_do_you_deal_with_the_argument_from_personal/",
        "text": "The argument from personal experience as always been a bother for me. I understand that near death experiences and visions don't prove anything but how would you refute the claims if they came to you? For example I heard a testimony by this guy who was big on drugs but then he prayed non stop for 3 days. Eventually he heard the voice of jesus and the devil. Now he is a changed man who only lives for god and has left the world behind, no tv or video games (becasue jesus told him they are of the world) or drugs. One interesting thing is he is always claiming jesus speaks to him everyday giving him advice. Why is that? As a side note he is part of a pretty big collection of christians who are against he church system. Always claiming church goers are not real followers of god because they are not sinless. Its an unusual testimony and its weird these sorts of christians are very consistant even though they don't influence eachother. (They all claim jesus is the only person they listen to). Alot of them make videos regarding the messeges jesus has spoken to them sometimes even prophecies. Anyway how do you deal with personal experience and these sorts of people and their claims?\n ",
        "created_utc": 1477911886,
        "upvote_ratio": ""
    },
    {
        "title": "Biblical Slavery and Bad Apologetics",
        "author": "way2odd",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5a4cbj/biblical_slavery_and_bad_apologetics/",
        "text": "Recently, I've encountered few particularly frustrating apologetics in the wild that have to do with slavery in the Bible. I figured I'd list &amp; refute them here, venting my frustrations and maybe giving you guys something to use as a reference should you encounter something similar. Here goes:\n\n**1) \"Biblical slavery was not chattel slavery. People went into slavery to get out of debt, and were treated well while working.\"** \n\nTo refute this, it's helpful to start with a definition of chattel slavery. From Wikipedia: \n\n&gt; Chattel slavery, also called traditional slavery, is so named because people are treated as the chattel (**personal property**) of the owner and are **bought and sold** as if they were commodities.\n\nEmphasis mine. Getting straight to the point, let's check out Leviticus 25:39-46:\n\n&gt; 39 “‘If any of your fellow Israelites become poor and sell themselves to you, do not make them work as slaves. 40 They are to be treated as hired workers or temporary residents among you; they are to work for you until the Year of Jubilee. 41 Then they and their children are to be released, and they will go back to their own clans and to the property of their ancestors. 42 Because the Israelites are my servants, whom I brought out of Egypt, they must not be sold as slaves. 43 Do not rule over them ruthlessly, but fear your God.\n\n&gt; 44 “‘Your male and female slaves are to come from the nations around you; from them you may **buy** slaves. 45 You may also buy some of the temporary residents living among you and members of their clans born in your country, and they will **become your property**. 46 You can bequeath them to your children as **inherited property** and can make them **slaves for life**, but you must not rule over your fellow Israelites ruthlessly.\n\nEmphasis mine again. From this passage, it's clear that:\n\n* Debt slavery did exist, but was reserved for fellow Israelites. \n\n* Chattel slavery also existed, and any non-Israelite could be made a slave. \n\nBut, as a bonus, let's check out an exception to the first bullet point in Exodus 21:2-11:\n\n&gt; 2 “If you buy a Hebrew servant, he is to serve you for six years. But in the seventh year, he shall go free, without paying anything. 3 If he comes alone, he is to go free alone; but if he has a wife when he comes, she is to go with him. 4 If his master gives him a wife and she bears him sons or daughters, the woman and her children shall belong to her master, and only the man shall go free.\n\n&gt; 5 “But if the servant declares, ‘I love my master and my wife and children and do not want to go free,’ 6 then his master must take him before the judges.[a] He shall take him to the door or the doorpost and pierce his ear with an awl. Then he will be his servant for life.\n\n&gt; 7 “If a man sells his daughter as a servant, she is not to go free as male servants do. 8 If she does not please the master who has selected her for himself,[b] he must let her be redeemed. He has no right to sell her to foreigners, because he has broken faith with her. 9 If he selects her for his son, he must grant her the rights of a daughter. 10 If he marries another woman, he must not deprive the first one of her food, clothing and marital rights. 11 If he does not provide her with these three things, she is to go free, without any payment of money. \n\nSo we also have two exceptions to the \"do not rule over them ruthlessly\" rule:\n\n* Female Israelites could be sold into slavery by their fathers.\n\n* Male Israelites who were given families as slaves could choose to remain slaves to be with those families. \n\n**2) \"The Bible only let people buy slaves, not capture them from. Slavery was still the fault of the nations around Israel.\"**\n\nFirst of all, this is terrible logic. Owning slaves isn't any less immoral because you bought them from someone else, and one could probably make a case for buying slaves, y'know, *enabling the people who sell slaves for profit.* \n\nSecond, it's false. Deuteronomy 20:10-15: \n\n&gt; 10 When you march up to attack a city, make its people an offer of peace. 11 If they accept and open their gates, all the people in it shall be subject to forced labor and shall work for you. 12 If they refuse to make peace and they engage you in battle, lay siege to that city. 13 When the Lord your God delivers it into your hand, put to the sword all the men in it. 14 As for the women, the children, the livestock and everything else in the city, you may take these as plunder for yourselves. And you may use the plunder the Lord your God gives you from your enemies. 15 This is how you are to treat all the cities that are at a distance from you and do not belong to the nations nearby.\n\nSubjecting people to \"forced labor\" and treating women and children as \"plunder\" seems an awful lot like slavery to me. \n\n**3) \"The Bible regulated slavery, forcing people who already owned slaves to treat them well.\"**\n\nLet's see. Exodus 21:20:\n\n&gt; 20 “Anyone who beats their male or female slave with a rod must be punished if the slave dies as a direct result, 21 but they are not to be punished if the slave recovers after a day or two, since the slave is their property.\n\nTechnically a regulation, but not a great one. One would hope that a regulation on slavery passed down from an omnibenevolent god would prohibit beatings, but I guess a punishment for murder is a step in the right direction. One could hypothetically argue that verses in the New Testament contradict this, but that runs into its own problems for obvious reasons. There's actually more later in the chapter that's relevant, too. Exodus 21:29-32:\n\n&gt; 29 If, however, the bull has had the habit of goring and the owner has been warned but has not kept it penned up and it kills a man or woman, the bull is to be stoned and its owner also is to be put to death. 30 However, if payment is demanded, the owner may redeem his life by the payment of whatever is demanded. 31 This law also applies if the bull gores a son or daughter. 32 If the bull gores a male or female slave, the owner must pay thirty shekels[f] of silver to the master of the slave, and the bull is to be stoned to death.\n\nNot great. Pretty hard to get around the implication that a slave's life is worth less than a free person's. Again, this is technically a regulation, but it's not one that really does the Bible any favors, and definitely doesn't constitute a slave being treated \"well\".\n\n**Closing Thoughts:** \n\nThe above apologetics are all ones I've encountered in the wild. They frustrate me not just because they're wrong, but because they show that the apologist almost certainly hasn't critically engaged with the evidence, and is just repeating something they've heard somewhere else. The verses I've provided directly contradict the given apologetics, and it'd take Olympic-tier mental gymnastics to get around that. I could at least respect someone who acknowledged that these passages say what they do and believed in spite of that, but a frustratingly large number of people seem to want to just deny that these verses exist. \n\n**TL;DR:** The God of the Bible explicitly condones chattel slavery, capturing people to work as slaves, and mistreating slaves that work for you.\n",
        "created_utc": 1477798918,
        "upvote_ratio": ""
    },
    {
        "title": "Exmuslim agnostic atheist here, how do i deal with my parents who wont accept my disbelief?",
        "author": "dzimar",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5a1mb7/exmuslim_agnostic_atheist_here_how_do_i_deal_with/",
        "text": "just short background: im a 17yo indonesian.  \n\nive been caught skipping fajr salah(prayer) last monday and now ive no choice but to confess since they went through my phone, They are guilt tripping me into thinking that im a bad child for thinking in such a way (atheistic thinking), and that im arrogant for thinking islam is false because i havent read the whole quran. they took me to talk to an ustadz who was an atheist for 15 years after he found islam, hes from new zealand and i think that he found islam as something exotic and he wasnt a real atheist to begin with(not that i have the authority to judge his life experience).\n\nAfter having a long talk with him for 10 hours i still am not convinced about islam. When i asked him about certain discrepancies and immoral values in the quran and the hadith he said i was too \"technical\" and that i have to \"believe\" and \"have an open mind and heart\" in order for me to believe in allah, well i think if i sincerely believe that santa will hear my prayers then i will believe that he does indeed hear my prayers.\n\nHe said that the slavery and aisha marriage in hadith is just a minor thing that dont bother him, well i find that bizarre because i think slavery is the no.1 tragedy in human history.\n\nI made a promise that i will do salah sincerely and pray afterwards each time to Allah to show me his signs and to soften my heart and remove my arrogance, its been two days and i still feel nothing.\n\nPeople who went through the same thing as i am now, can you share your story and give me some advice in dealing with religious parents? thank you for your attention and sorry for my english.",
        "created_utc": 1477763205,
        "upvote_ratio": ""
    },
    {
        "title": "Very interesting rebuttal of an article by Stefan Molyenux",
        "author": "Verinio",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/59z0az/very_interesting_rebuttal_of_an_article_by_stefan/",
        "text": "[removed]",
        "created_utc": 1477717214,
        "upvote_ratio": ""
    },
    {
        "title": "How are you spiritual as an atheist?",
        "author": "Sealslut503",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/59smb5/how_are_you_spiritual_as_an_atheist/",
        "text": "I recently decided to return to school to get my Master's Degree in Speech-Language Pathology! Unfortunately, getting into a master's program is extremely competitive, so my best chance is to apply to private schools or out of state. The only private schools in my area are Christian schools, so answering the essay questions about faith and spirituality have been difficult for me, especially since I grew up Christian and became atheist as an adult. My guess is their ideal applicant isn't someone who decided the foundation of their school is something that man created. \n\nSo I'm curious, how are you as an atheist spiritual? \n\n",
        "created_utc": 1477628583,
        "upvote_ratio": ""
    },
    {
        "title": "Does being atheist make you more prosperous / well off or does being prosperous / well off make you atheist?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/59qpy0/does_being_atheist_make_you_more_prosperous_well/",
        "text": "[removed]",
        "created_utc": 1477604566,
        "upvote_ratio": ""
    },
    {
        "title": "Pre-marital counseling with our minister for our wedding.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/59iets/premarital_counseling_with_our_minister_for_our/",
        "text": "[deleted]",
        "created_utc": 1477498538,
        "upvote_ratio": ""
    },
    {
        "title": "How do we get to a presumption of atheism?",
        "author": "Leeroybijenkins",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/59ht30/how_do_we_get_to_a_presumption_of_atheism/",
        "text": "What are the positive cases *for* atheism? I'm well aware of the burden of proof, but of course that only gets one to agnosticism. (I'm well aware of the position of agnostic atheism, but I don't regard it as legitimate, as it's not really justified by knowledge, but merely feeling.) So what are some good arguments against God's existence? I personally like the problem of evil and free will/ omniscience dilemma.",
        "created_utc": 1477492163,
        "upvote_ratio": ""
    },
    {
        "title": "How to Counter the Modal Ontological Argument, the N+1 Objection",
        "author": "cory-balory",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/59gcf8/how_to_counter_the_modal_ontological_argument_the/",
        "text": "Hi guys, I have a Bachelor's Degree in Philosophy from a Christian University (where I originally went to become a pastor, lol) and at one point I was in a class on Contemporary Philosophy.  We were assigned a writing project in which we could write about anything that had to do with contemporary philosophy, but for simplicity's sake he recommended some authors.  I (as a Christian at that time) chose Alvin Plantiga's Modal Ontological Argument.  I will try to briefly explain the argument, and tell you where reason led me while I thought over this argument.\n\nThe Modal Ontological Argument is in it's simplest form:  A Greatest Possible Being is a being that has all greatness making properties to the maximal degree.  There are some possible worlds where a Greatest Possible Being (GPB from now on) exists.  This GPB would be greater if it existed in all possible worlds than if it existed in only some.  Thus if the GPB exists in some possible worlds, it exists in all possible worlds.\n\nNote: You cannot simply turn this on it's head by saying, \"there are some possible worlds where the GPB does not exist, given the context of this argument, because if it was the Greatest it would exist in all.  You can say that at the conclusion of my argument, but let me get to that.\n\nOkay, so I call my argument the N+1 objection. (I am not a professional philosopher, so if this is wrong just tell me and I'll only cry a little bit)\n\nImagine the greatest possible being.  Now I will imagine a being with all the same greatest making properties, except with one property that is N+1, where N is the amount of that property the original being has.  Okay so now you're thinking, \"Okay but that original being wasn't the Greatest Possible Being, the new one is. Duhhhh.\"  But the problem is that this goes on *ad infinidum*.  This being cannot mathematically exist, because you can always imagine a being that is N+1 of the original being.  And if this being cannot mathematically exist, then it cannot logically exist since math is basically logic with numbers.\n\nAt this point the theist, or the interested atheist, could say that there would be limits to the properties that make such a being great.  Like love, for example.  A maximally loving being would love all entities that are capable of being loved to the maximal degree that they can be loved.  Essentially, you could put a \"cap\" on greatness (even if it was so vast it could never be identified, it would still exist).\n\nMy response here would be that in some possible worlds, there would be greatness making properties that are infinite.  If there are some possible worlds where there are infinite greatness making properties, there are some possible worlds where the GPB cannot logically exist.  However this is contradictory to logic, since it is a being that would always exist in all possible worlds.  This, you see, is the problem.  The logic of the argument takes us to an illogical conclusion, essentially forcing it to admit \"A and ~A\"\n\nYou can also \"go wide\" with this argument, rather than \"going deep\" as I have been doing.  Going wide would mean that you could say, \"I can imagine a being with all the greatness making properties that your being has, +1.\"  Basically you keep adding greatness making properties to your being *ad infinidum* even if we as humans cannot understand what they are or don't have words for them, because there would be a possible world where greatness making properties would include the one you just added.\n\nSo, as I hope you can see, Plantiga's Modal Ontological Argument gets itself into a self-contradicting tailspin if critically thought about for too long.  Plantiga himself dismisses this sort of objection as being silly (he was one of the ones who said that's simply the new being), but never elaborated on the objection like I have.\n\nIf you think that I'm wrong or have something to add or ask, please don't hesitate to ask!  It may take me a day or two to get back to you on it, but I'd love to hear what you guys think of my argument. :)\n\nEdit: A whole lot of failed proof reading because it's real late and I'm real tired.  Also added some clarification from a helpful comment.",
        "created_utc": 1477468080,
        "upvote_ratio": ""
    },
    {
        "title": "On the fear of death",
        "author": "DefinitelyNotJohnCen",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/59fglq/on_the_fear_of_death/",
        "text": "First of all, I'm sorry. I know this is a topic that gets brought up here a lot, and there are dozens of threads on the subject here that I could read through. But I'm surrounded by people who are pretty staunchly religious, and I have no one I can talk to about these things. I just have something I need to get off my chest.\n\nPeople post threads fairly frequently asking questions along the lines of \"How do I deal with the existential fear of death?\" They usually get a lot of good responses, but I've never seen a really satisfying answer. I don't think there is a satisfying answer. Death sucks. Dying sucks. Knowing that you'll die someday sucks. Fearing it sucks.\n\nIn those threads, people bring up the very good point that actually being dead is probably all right. They ask, \"Do you remember what it was like before you were born? That wasn't so bad, right?\"\n\nMost of the time I'm okay with it. I've been put under for surgery before, and I imagine being dead will be a lot like that. Just a total lack of everything. No sense of passage of time. Just nothing. That's not scary at all. What's terrifying is that it's for an eternity. It's the forever of it. I'm not all that scared of dying, but I'm terrified of being dead forever. Nothing, forever and ever. It sucks. Knowing it's coming sucks.\n\nLike I said, most of the time I'm okay with it. But every now and then I get seized by this irrational fear. It feels like I'm being choked. It's not hopelessness, it's drowning. It last for a moment, or an hour, or a day, and I'm totally disabled. I can't do anything. I can't think of anything else. Then it passes and I move on.\n\nI hate loss. Losing family members sucks. Losing friends sucks. Losing homes and jobs and possessions sucks. It's inevitable, but it's okay, because you can always make new friends, and move somewhere else, and get a new job, and build a new family, and everything you lost stays a part of you. Life is always building on itself. Until you die. Then you lose everything. You don't carry anything forward. It's just nothing. Jeez, it just sucks. Why does it have to suck so much.\n\nSometimes, in my darkest, angsty teenager moments, I feel like life is a kind of practical joke that the universe plays on us. After an eternity, it wakes us up to experience the absolute joy that is breath, but only for a moment. Then we're back to sleep for another eternity, never to wake again.\n\nI know, I know, live now. Be happy and healthy now. Appreciate every moment you have now. Work and make yourself busy and make friends and art and build something now. Why worry about something you can't change? Worrying about it only spoils the time you have. I know all that. It makes sense. It's mildly comforting. But it doesn't help in those moments of choking panic.\n\nI don't know. I don't have point. Dying just sucks. I wish it didn't have to suck so much.",
        "created_utc": 1477452816,
        "upvote_ratio": ""
    },
    {
        "title": "Why Was My Post Removed | Why I'm Not An Atheist",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/59aoo3/why_was_my_post_removed_why_im_not_an_atheist/",
        "text": "[deleted]",
        "created_utc": 1477397740,
        "upvote_ratio": ""
    },
    {
        "title": "Hello guys, I'm a student that's working on a comparison between 2 different sources for a class project",
        "author": "mausalas99",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5983kn/hello_guys_im_a_student_thats_working_on_a/",
        "text": "[removed]",
        "created_utc": 1477354864,
        "upvote_ratio": ""
    },
    {
        "title": "Why I'm Not An Atheist",
        "author": "SacredSkeptics",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5982wg/why_im_not_an_atheist/",
        "text": "[removed]",
        "created_utc": 1477354631,
        "upvote_ratio": ""
    },
    {
        "title": "The Inversion of Christianity",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/58z6at/the_inversion_of_christianity/",
        "text": "[removed]",
        "created_utc": 1477238314,
        "upvote_ratio": ""
    },
    {
        "title": "We will always fall short in our attempts to understand God with our intelligence.",
        "author": "FrogMantra",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/58yf25/we_will_always_fall_short_in_our_attempts_to/",
        "text": "[removed]",
        "created_utc": 1477227192,
        "upvote_ratio": ""
    },
    {
        "title": "The secular world's most anticipated debates between Dr. Robert Price and Dr. Bart D. Ehrman arguing the existence of a historical Jesus Christ.",
        "author": "OnePointSix2",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/58rh3z/the_secular_worlds_most_anticipated_debates/",
        "text": "[removed]",
        "created_utc": 1477109117,
        "upvote_ratio": ""
    },
    {
        "title": "Hi everyone. Some of you have likely seen a call-in TV show/internet stream called \"The Atheist Experience\". The show is experiencing a shortage of theist callers (too many atheists calling is boring). So if you're a theist yourself or know any...",
        "author": "theaxp",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/58qph7/hi_everyone_some_of_you_have_likely_seen_a_callin/",
        "text": "[removed]",
        "created_utc": 1477097311,
        "upvote_ratio": ""
    },
    {
        "title": "new sci-fi thriller with foreword by Lawrence Krauss attempts to do for legitimate biblical historical research what Da Vinci Code did for the Priory of Sion",
        "author": "Lee_Burvine",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/58pzwl/new_scifi_thriller_with_foreword_by_lawrence/",
        "text": "The Kafir Project is a sci-fi/thriller novel with a nod from a noted, atheist astrophysicist and a bibliography. The latter includes articles from biblical history journals and other scholarly papers.\n\nThere is, most importantly, peer-reviewed research there by Christoph Luxenberg and others regarding a theory known as the Syro-Aramaic reading of the Qur'an. Luxenberg argues that portions of the Qur'an were not originally written in Arabic and were in fact lifted from an early Christian lectionary. The novel takes that as fact and as background for its thriller plot.\n\nSimilar scholarly research forms the source material for what else the characters will discover through the book's main sci-fi conceit: time-viewing. Some of that research undermines the only purported physical evidence (evidence other than sightings or visions) connected with the Resurrection, i.e., the empty tomb. The story proceeds, in part, on Dominic Crossan's contention that Jesus's body actually rotted on the cross.\n\nTwo more archaeologically supported and but controversial propositions come into play before the tale is done.\n\nFirst, that Yahweh was originally a minor god from the Ugaritic Pantheon, merely one of the seventy sons of El ( this supported in the real world by a Qumran Deuteronomy fragment different from later, revised versions, and other textual evidence).\n\nSecond, that the Israelites couldn't have returned and conquered Canaan because they in fact never left the region. The Exodus story is presented as borrowed and adapted from the Hyksos people, a Semitic tribe that briefly ruled a portion of the Nile Valley before being driven out (not freed) by Ahmose the First.\n\nIt seems unlikely that any scholarly evidence, no matter how well researched or charged-up with action and bold characters, could change the minds of firm believers. But could such a work change the minds of those who are not yet fully-indoctrinated? Particularly if the novel were to attain serious public notoriety a la Da Vinci Code?\n\nI hope this post also sparks discussion on the book's larger purpose. Could atheist fiction ever engender real social change, as some didactic novels have in other spheres? Or will they never do anything more than preach to the choir?\n\n**For those who would like to read the book itself** an ebook giveaway of sorts at kafirproject.com begins on Halloween 2016 and runs for three days only.  Mobi or epub files of The Kafir Project can be downloaded there without charge, *but only if the reader checks the box agreeing to sign away his or her immortal soul to the book's author*.",
        "created_utc": 1477088187,
        "upvote_ratio": ""
    },
    {
        "title": "Do you observe any differences between cradle atheists and people who left the religion they were raised in to become atheists?",
        "author": "CalibanDrive",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/58otdn/do_you_observe_any_differences_between_cradle/",
        "text": "I don't know really know if there is any difference. But I was raised an atheist by atheist parents. \n\nMy dad had a religious upbringing and he's really uptight about religiosity in any context. He just that sort of person that debates total strangers online about matters of theology etc., you might camp him with the anti-theists. I, on the other hand, am very content to be an atheist, but because I was raised that way I always carry with me an understanding that I did not come to my beliefs by any process within my control and so I tend to hesitate to judge the religiosity of others too strictly: if I didn't have much of a choice over the context that I was born into how can I judge others who have had no more choice than I had and also far fewer opportunities than me to learn and explore on their own? \n\nDo you think this difference is just a difference of personality between my father and me, or do you think cradle atheists and the deconverted have a tendency to approach atheism differently?",
        "created_utc": 1477074849,
        "upvote_ratio": ""
    },
    {
        "title": "Step-dad assuming things about my beliefs",
        "author": "AsinineMoron",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/58juc0/stepdad_assuming_things_about_my_beliefs/",
        "text": "Hi, I'm an agnostic atheist (do I know for sure if there's a god or not? No. Do I actively practice any religion/want to? No, chances are it's all bullshit). Anyway, I live in the southern United States and my step-dad thinks I'm a Christian and I sooo badly want to tell him I'm an agnostic atheist, especially considering my mother already knows I'm an atheist and despite the fact she is pretty religious, she is open-minded enough to realize I'm still a good person with empathetic reciprocity and what not. I guess the main reason I want to tell him other than that is every once in a while he will force me to go to church with him and every time I'll just sit in the back of the service reading a book (not the Bible) and he'll come up to me and say something along the lines of \"You're gonna learn this book *pointing to the Bible*.\" The thing is, me actually doing some research and reading the majority of the Bible is what made me have the beliefs I have now. He also thinks I'm like mentally deficient because I'm a very liberal person for living in the Southern US. Needless to say, he's a Trump supporting, FOX News watching, zombie. Anyway, I realize this is kind of an incoherent rant, just wanted to get this off my chest because it's been weighing on my mind for a while and causing me to be angry at him.",
        "created_utc": 1477002829,
        "upvote_ratio": ""
    },
    {
        "title": "Religion as Neurological Shackles (podcast)",
        "author": "Weirdmindshow",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/58f3qx/religion_as_neurological_shackles_podcast/",
        "text": "[removed]",
        "created_utc": 1476939081,
        "upvote_ratio": ""
    },
    {
        "title": "How to refute these arguments?",
        "author": "Aquele_Carinha",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/58esb9/how_to_refute_these_arguments/",
        "text": "First I want to say sorry for my terrible english :/\n\n1 - Over the past few months I'm becoming more and more depressed about religion ( and science and politics too). I've read the Bible, Atheism books, Apologetics books and seen a lot of debates and documentaries.\nBut now I don't know what to do with so much information :/\n\nI've seen that all these guys (Dawkins, Degrasse, Sagan, Coyne,Hawking) don't know much about religion or phylosophy, they just say it's nonsense. Most atheists don't even understand the bible. I've meet a christian who said that the God of the Old Testament is not evil but the people of the time were, they raped the cananites because they are not following God's orders but because they wanted to rape people, and they thought it was so ''cool'' that they even wrote that in the Bible. That's why they killed Jesus, because THEY were evil, not God. All the OT characters are flawed, but Jesus was not flawed (Because he is God or the Son of God or wathever). That's explains a lot of the Bible! The OT is incomplete without the NT. How to refute this?\n\n2 - Also, I heard a lot of christians say that you can't trust science, because the government controls science. If they wanna say that sugar is good to sell more sugar they will! And they showed me books and articles that argue against evolution, Big Bang, Relativity, Old Earth etc.... How do I know if it is true or not???\n\n3 - They said that many of the ''evils'' atheists claim that religion did, in fact did not happened. The Inquisition killed less people than the ''atheist'' French Revolution. The ''Atheist'' Communism killed more people than the crusades.\nAlso they say that the Church was the first organization to help the poor, to go to countrys were there's war to help the victims, risking they on lives. They also were against slavery.\n\nThey said that science and history classes are full of marxists and atheist and thats why everyone says that Christianity was evil or was like the ISIS. Because people have a agenda.\n\n4 - Also they say that Christianity is the only religion with archeological proof (even if it's is not accurate, it's more than any other religion) and people we know that have existed, the Jews managed to survive so much stuff for so long, because they're God's People (and they are hated because of this).\nIf the disciples of Jesus managed to write fake Gospels just to fullfil the old prophecies, that would be the FIRST time in history that such way of propaganda was made, and a bunch of crazy fisherman would not suceed in doing this so perfectly.\n\nAlso, the Bible use metaphors for a lot of things, like Babel Tower to explain the origin of the languages, the only religion to explain such thing.\n\n\no.O I hope my doubts and my grammar make sense to you... \n\nThat's some things that set christianity apart from other religions, which they say make it more likely to be true...\n\nHelp me refute those christians please...\n\n\n\n\n",
        "created_utc": 1476934468,
        "upvote_ratio": ""
    },
    {
        "title": "How much does knowledge of history play into your decision to be an atheist?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/58cxt9/how_much_does_knowledge_of_history_play_into_your/",
        "text": "[deleted]",
        "created_utc": 1476912501,
        "upvote_ratio": ""
    },
    {
        "title": "Are there Atheists who believe the world may be a better place with religion?",
        "author": "LethalBacon",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/584cw3/are_there_atheists_who_believe_the_world_may_be_a/",
        "text": "I am non-religious, but I almost feel as if the world would be worse off if everyone was non-religious.  I'm talking largely in regards to nihilism. I feel on an individual level nihilism can be great, and in many cases leads to positive things in peoples lives.  But I feel as if massive amounts of nihilism in the worlds cultures could cause concern.\n\nFor many people religion may be what keeps them going at times, gives them purpose and meaning.  Even those who do not actively practice their religion, but still believe in it.  It seems like it just works for some people.  \n\nI'm not advocating for more religion or anything, but I think it might be a good thing that there is a balance.  \n\nI guess the basis of this is - is the world better off with large amounts of religion, rather than majority non-religious?  Anyone have any ideas on this, or any reading that goes into detail that is similar to this idea?",
        "created_utc": 1476804179,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever met a proponent of Calvinist theology that does not believe they are among the elect?",
        "author": "happyisayuppieword",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/581hx7/have_you_ever_met_a_proponent_of_calvinist/",
        "text": "In my online encounters with adherents to various strands of Reformed theology, I consistently observe an obstinate refusal to consider that they may be among those elected to eternal damnation. I stridently argue with Calvinists that unconditional election is not a fair and equitable arrangement, but they seem incapable of countenancing such a claim. To them, why should they be bothered by God's wanton decisions to arbitrarily damn millions? At least he saved them via his *irresistible* grace. They seem incapable of considering the alternative... Namely, though said Calvinist in question deduced the proper interpretation of holy scripture, they happened to be elected for eternal damnation. Would said prospect not be utterly terrifying?  \n\nSpeaking solely for myself, I doubt I could ever find peace with a Reformed view on theology; I would likely be plagued by incessant doubt that I  were not among the elect. Frankly, though I knew nothing of such theological ideas as a child, I *still* frequently doubted my salvation.  \n\nIs it just me, or does it seem like Calvinists struggle to emphasize with the losers in their soteriological roulette?  \n\n**EDIT:** As a further thought, how could you *dare* have children if you believe in unconditional election? Would your reproductive desires truly supersede the implicit risk of fathering/mothering a child elected to damnation?",
        "created_utc": 1476758179,
        "upvote_ratio": ""
    },
    {
        "title": "What is the Trinity? Does it even make sense?",
        "author": "TrottingTortoise",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/57zuo1/what_is_the_trinity_does_it_even_make_sense/",
        "text": "[removed]",
        "created_utc": 1476738432,
        "upvote_ratio": ""
    },
    {
        "title": "Would you consider yourself to be sinful?",
        "author": "ultimaonlinerules",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/57ywqj/would_you_consider_yourself_to_be_sinful/",
        "text": "I have been thinking about whether religious pressure pushes \"sinful\" people (in terms of religious laws) to atheism. Especially due to the relative incompatibility of modern life and many religions. \n\nI certainly know that this is not the sole reason whatsoever but I am wondering whether a person who is not performing well within his/her religion is more prone to shift towards atheism.\n\nPlease reply this this thread by telling us:\n\n(1) If you would consider yourself a seriously sinful person when/if you were a religious person earlier,\n\n(2) If you believe that your current way of life would be deemed sinful by the standards of your previous religion. \n\nThank you in advance. ",
        "created_utc": 1476728518,
        "upvote_ratio": ""
    },
    {
        "title": "A masterclass video on refuting Christian apologetics by Jeff Lowder.",
        "author": "CounterApologist",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/57xjkq/a_masterclass_video_on_refuting_christian/",
        "text": "Recently Jeff Lowder, founder an former President of [infidels.org](http://www.infidels.org), recently debated famous Christian apologist Frank Turek.   Sadly, the debate isn't available yet, but Jeff had prepared so much material for the debate, he put it and his slides into [a massive two and a half hour YouTube video](https://www.youtube.com/watch?v=xXWTc6-toDo). \n\nThe material comes from Jeff's work to refuting Turek's latest book \"Stealing from God: Why Atheists Need God to Make Their Case\", but if you've read one apologetics book, you've largely read most of them.  As such the video contains rigorous answers to over twenty apologetic arguments. \n\nSince the video is quite long and detailed, I went through the effort to list the topics covered and give time-stamps/links for each topic which you can find below:\n\n The first 10 Minutes are a run through Jeff’s \"VICTIM\" arguments showing that **V**alue, **I**nduction, **C**ausality, **T**ime, **I**nformation &amp; **I**ntentionality, **M**orality are assumed by Christian apologetics, not explained by it.\n\nAfter that Jeff switches to answering the arguments put forward in Turek's book. Below is the argument being answered, the time stamp, and a link to that point in the video.\n\nResponses to apologetic arguments\n\n* Causality/Kalam – 10:43 - https://youtu.be/xXWTc6-toDo?t=10m43s\n* Causality/Fine Tuning – 28:55 - https://youtu.be/xXWTc6-toDo?t=28m55s\n* Reason/Laws of Logic – 34:28 - https://youtu.be/xXWTc6-toDo?t=34m28s\n* Reason/Applicability of Math – 45:04 - https://youtu.be/xXWTc6-toDo?t=45m4s\n* Reason/Free Will – 54:37 - https://youtu.be/xXWTc6-toDo?t=54m37s\n* Information/Origin of Life – 1:02:19 - https://youtu.be/xXWTc6-toDo?t=1h2m19s\n* Information/Epigenetic Information (ie. argument against naturalistic evolution) – 1:20:58 - https://youtu.be/xXWTc6-toDo?t=1h20m58s\n* Information/Intentionality – 1:23:15 - https://youtu.be/xXWTc6-toDo?t=1h23m15s\n* Morality – 1:23:45 - https://www.youtube.com/watch?v=xXWTc6-toDo\n* Morality/Implications of Atheist Morality – 1:51:31 - https://youtu.be/xXWTc6-toDo?t=1h51m31s\n* Morality/Laws requiring Law Giver – 2:01:37 - https://youtu.be/xXWTc6-toDo?t=2h1m37s\n* Evil – 2:02:43 - https://youtu.be/xXWTc6-toDo?t=2h2m43s\n* Evil/Examples of Apologetics committing the Fallacy of Understated Evidence – 2:06:43 - https://youtu.be/xXWTc6-toDo?t=2h6m43s\n* Science/Science Presupposing God – 2:16:10 - https://youtu.be/xXWTc6-toDo?t=2h16m10s\n",
        "created_utc": 1476713888,
        "upvote_ratio": ""
    },
    {
        "title": "Christians are probably more scared of hell than any other group of people in the world but there is also cognitive dissonance. What about atheists?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/57ut94/christians_are_probably_more_scared_of_hell_than/",
        "text": "[deleted]",
        "created_utc": 1476667511,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of Pacal's Wager?",
        "author": "Leeroybijenkins",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/57ju8z/what_do_you_think_of_pacals_wager/",
        "text": "Basically, if you put faith in religion which you had some reason to believe is true, the reward if you're right is infinite, but if you disbelieve, the punishment is infinite. So it's better to believe than to not believe.\n\nI don't like the wager because I think God would be able to tell if you were sincerely faithful or faking it when you were judged.",
        "created_utc": 1476494026,
        "upvote_ratio": ""
    },
    {
        "title": "I am openly atheist and living in the Bible Belt. AMA!",
        "author": "Twichy717",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/57gzq9/i_am_openly_atheist_and_living_in_the_bible_belt/",
        "text": "To answer some of the obvious questions, it has caused conflict in my family, specifically with my paternal grandmother. My parents do not know my beliefs, and neither does my brother. He does look at my Reddit post history occasionally, however... Hey Alex!",
        "created_utc": 1476459774,
        "upvote_ratio": ""
    },
    {
        "title": "How to grieve and come to terms with a sudden traumatic death as an atheist?",
        "author": "suddentrauma",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/57ezx8/how_to_grieve_and_come_to_terms_with_a_sudden/",
        "text": "This is still raw for me, but I've just lost a much loved family member. Do you still talk to them as though they're listening, or does that make me an idiot? I think it's just the thought of not being there at the end and not being able to say goodbye.",
        "created_utc": 1476425529,
        "upvote_ratio": ""
    },
    {
        "title": "How to grieve and come to terms with a sudden traumatic death as an atheist?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/57eynr/how_to_grieve_and_come_to_terms_with_a_sudden/",
        "text": "[removed]",
        "created_utc": 1476424864,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a Believing Atheist, Am I Crazy?",
        "author": "DelusionFusion",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/57bwit/im_a_believing_atheist_am_i_crazy/",
        "text": "I know religion and God are man-made products, but I believe because of psychological benefits.\n\nOthers in a similar situation? Is there any definition for this? And is this healthy?\n\nSome background for my thoughts:\n\nAtheism gave me a clear worldview, but it lacked warmth and answers for bigger-than-life-questions.\n\nInstead of seeking escapism from art or entertainment, I deep dive in to religious thinking, making my whole life a meaningful and comforting fantasy.\n\nReligion also gives words and thinking systems to matters which science and atheism aren't even trying to solve (and couldn't solve, if tried).\n\nMoral guidance is a big plus, but it's a double edged sword. Morals shouldn't be based on religion.\n\n\nNote: Originally in /r/atheism, but marked as troll/shitpost :( \nhttps://www.reddit.com/r/atheism/comments/57btqz/im_a_believing_atheist_am_i_crazy/",
        "created_utc": 1476384264,
        "upvote_ratio": ""
    },
    {
        "title": "I am a Muslim AMA! (Sort of)",
        "author": "Hahagam3r",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/578non/i_am_a_muslim_ama_sort_of/",
        "text": "I have to come back every so often to answer so I won't be answering questions sitting on the computer for a whole lot. \n\nSo after a long hard talk with an atheist, he convinced me to do an AMA here. I said no at first because of my AMA on /r/atheism which ended up being a failure because a lot of people wouldn't ask me anything. They would give me statements not questions. And some would give questions and their statements afterwards. I really prefer and like /r/trueatheism better than /r/atheism. I think over here is a great place. \n\nSo ask me *anything* whether it's from, [about my life story](https://docs.google.com/document/d/1Qo-b7DpJ15aA9J_3B_cB6X8S0Wa9XJBRigFmW2X0Zek/edit) to my favorite anime or Islam stuff. \n\n\n\nEdit: Yo guys, wassup. So I enjoyed this AMA here and I'm really happy that I did one here. I'm really glad I got to see your guy's opinions and thank you so much for letting me do this.",
        "created_utc": 1476335284,
        "upvote_ratio": ""
    },
    {
        "title": "Question about one type of atheist",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/576tlo/question_about_one_type_of_atheist/",
        "text": "[removed]",
        "created_utc": 1476309826,
        "upvote_ratio": ""
    },
    {
        "title": "Who's your favorite of the \"Four Horsemen?\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/5761c3/whos_your_favorite_of_the_four_horsemen/",
        "text": "[removed]",
        "created_utc": 1476300957,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people assume that you \"were Christian/muslim/whatever\", when you say that you are agnostic? Why can't you just be agnostic?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/570kgp/why_do_people_assume_that_you_were/",
        "text": "[deleted]",
        "created_utc": 1476221959,
        "upvote_ratio": ""
    }
]