[
    {
        "title": "Is it wrong to believe untruths? Some nihilistic/existentialist thoughts I've been having. (Possibly long-winded and convoluted)",
        "author": "Liquidsolidus9000",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2joxs9/is_it_wrong_to_believe_untruths_some/",
        "text": "Picture a group of biologists on some sort of research safari. They're recording observations of various behaviors they see in elephants. There have been observations of elephant death rituals, and they want to do a further study to see how much ritualistic behavior they have. At some point, something very shocking happens. The elephants stumble upon the bodies of some antelopes, and organize themselves and manage to somehow carry the antelopes back to their resting place. \n\nThe biologists follow the elephants, amazed, and are shocked to find that the elephants have gathered dozens of antelope corpses around their resting area. They also notice the Elephants using their trunks to draw on a large rock. When the elephants leave for a bit, the biologists move in to get a peek at what just happened. They are completely bewildered to see a portrait on the rock of a group of elephants all kneeling to a gigantic antelope. \n\nOver the next few days, the elephants make more drawings, and eventually the biologists are able to confirm beyond a reasonable doubt that the elephants in some capacity view antelopes as something of a godly, divine species and conclude that the elephants seem to have at least some sort of proto-religion. This discovery is a breakthrough, shattering many people's minds and changing the way we think about animal intelligence. However, in this scenario, there are two things that would not happen.\n\n1. No one would actually come to believe that antelopes were divine or godly in any way.\n\n2. More importantly, no one would try to convince or tell the elephants that they were wrong, and that the antelope wasn't godly or divine. Most people would agree that elephants don't exist to understand the complex nature of the universe. In some capacity their veneration of the antelopes brings them together.\n\nMy argument is that this analogy applies to humans. I would consider myself an absurdist/existentialist, believing that there is no god, knowledge is ultimately impossible, there is no inherent right or wrong, and that we are free to choose our paths in life, and dedicate ourselves to whatever we wish, rebelling against the universe in spite of our meaninglessness and the universe's apathy. \n\nI acknowledge however, that this rebellion, while freeing for myself, is ultimately absurd and trivial as all other things. Being as there is no inherent right or wrong, or inherent value tied to any action, aside from value which we ourselves create, like the elephant we are free to create creeds, gods and religions to satisfy, cope, and bind ourselves with no anger felt by the universe.\n\nI've made this thread in response to some thoughts I've been having after seeing a video posted on /r/cringe of a woman who was unsure if the Earth was round, and justified it by saying she spent more time thinking of how she would feed her children and be happy rather than the shape of the Earth. A lot of people were outraged at her ignorance and stupidity, and I understand how you would have some frustrations over an adult not knowing something most people will have learned early in life. However, her comment about valuing happiness over truth (Which I suppose is telltale blissful ignorance) struck with me. \n\n_\n\n**TL;DR** - We're all a bunch of walking apes and no matter how \"correct\" our beliefs are, to the universe, all of our ideals are on the same level of meaning - none. Therefore we are free to believe whatever helps us through life.\n\nI hope I've put my points across clearly and that my Elephant story didn't come off as too stupid. I'm curious what other people's thoughts are on these ideas and whatnot.\n",
        "created_utc": 1413728599,
        "upvote_ratio": ""
    },
    {
        "title": "DAE ever find themselves appreciating religious texts or stories?",
        "author": "vanderkalms",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2johu4/dae_ever_find_themselves_appreciating_religious/",
        "text": "As a complete non-believer i still sometimes find myself appreciating some bits and pieces of wisdom from religious texts or prayer even from several different religions, in the same way as you can find beauty in myths, legends and fictional stories of any kind. I was wondering was I alone on this one.",
        "created_utc": 1413710598,
        "upvote_ratio": ""
    },
    {
        "title": "Alienated from family for my openness about being atheist. I'd love some advice.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jnynu/alienated_from_family_for_my_openness_about_being/",
        "text": "I've been an atheist, and open about it for years. First off, I'll be honest that my openness about being an atheist is often ***perceived*** as me being outwardly chauvinist. This is not to say that I am actually in peoples' faces making snarky comments or even trying to actively \"de-convert\" people. But, like many who are ex-religious, I've grown a small fascination for viewing the religion I was raised in from outside the box, and my willingness to be open about it does mean that on occasion I will make comments that I know others close to me (religious/theists) won't agree with. I mainly take to the debate subreddits if I really want to just debate and such (as one can see in my comment history), but for the most part, I would otherwise consider myself to be \"normal\" yet and still.\n\nThat said, ever since I've been open with my family about my atheism, I can't help but feel alienated. I'm a grown young-adult (mid-20s, independent, yadda yadda), and have been out of the house for a while, but things just aren't the same relationship-wise for me and my family. My mom and I seldom talk (maybe once a month). I can barely maintain lasting conversations with my sister. My dad, I can sometimes get along with, but even still we don't have fair exchanges like we used to. And as I watch patiently as my best friend (basically my brother) digs his life deeper and deeper into his religious convictions, waiting for the Lord to \"bless\" him with things he's not even working for, my relationships with my family have grown irritatingly stale. \n\nIt's uncomfortable. They will be open about their beliefs, they will \"bind spirits\" away when they feel the need to and all that jazz, but when I'm open with my perspectives, its like I'm the asshole who can't just shut his mouth. For example, there's an issue with my father's health, and he needs a bone marrow transplant, and the only one who is capable of helping him with this special operation is my \"pious\" aunt (his sister). But she's not willing to go through with the operation for her own selfish reasons toward him. I'd mentioned this situation to my mother (who has long been separated from my father), and she began asserting \"that's a spirit, I'm going to pray the Lord takes that spirit away! That's crazy! That's a spirit! I'm going to bind that spirit away!\" To which I responded, \"Well, unless we're going to absolve her of her own responsibility for what she's choosing to do, I don't think its a spirit, so much as it's just her showing her true colors. She's being stubborn [I really used the word jackass] because she wants to be. She goes to church every Sunday and if her very presence there alone isn't enough to change her stance toward Dad, what makes you think prayer is going to do anything?\"\n\nWell, she just kind of lost it: \"How rude. Why can't you just let me believe what I want to believe? I'm uncomfortable talking about this. Does it have to be about religion with you? Well, I'm just going to disagree, you're going to believe what you want to believe, and I'm going to believe what I want to believe.\" Anytime I call my mom just to say hello and have a quick conversation, she's typically quick to get off: \"I've gotta go. I'm doing something. I'll call you later [never does].\" I like the fact that I can feel comfort in striving to simply be myself, but it's really impacting my relationship with my family.\n\nShould I really just let them talk out the sides of their asses when they're in my face about it? Should I really decline an offer to perform prayer at thanksgiving dinners, when they ask me to, but I don't want to? Should I just shut my mouth when I 'like' an Awkwards Moments Children's Bible post on facebook? I'm irritated at the fact that I'm not as close with my family as I used to be, but while I'm just trying to be myself (without stepping on anyone's toes) it seems like people are always going to receive me from an offensive angle.\n\nCan someone offer some advice? Share experiences? Thoughts?\n\n**Final Remark**: Thank you all for your contribution. I think what I've walked away with from this thread is to avoid confrontation wherever possible, including those moments where it might itch at me to say something. It's just what has to be done for the sake of peace. Thank you all for being a community I can turn to when I have questions. It really does mean a lot. To those who discovered this thread a bit late, feel free to continue posting opinions and advice, if you'd like. More commentary is always welcome. Cheers.",
        "created_utc": 1413690973,
        "upvote_ratio": ""
    },
    {
        "title": "\"'to know what we know, and that we do not know what we do not know, that is true knowledge. ' when one man has reduced a fact of the imagination to be a fact to his understanding, I forsee that all men at length establish their lives on that basis\" - Henry David Thoreau",
        "author": "AmiriteClyde",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jnabl/to_know_what_we_know_and_that_we_do_not_know_what/",
        "text": "Figured I'd leave this passage from \"Walden\" here for you guys. I've deciphered the meaning for me... What does this mean to you? \n\n**Edit** so I guess the mods like a little more discussion. This quote may mean different things to different people. To me, I think I did a good job summarizing what it means when I told /u/imyournumber1stfan\n\n&gt;\"Anyway, I guess if you feel extremely passionate about something, that becomes your truth. If you believe in something so much, you kind of want to cry, scream, and laugh at the same time, who is to tell you you're wrong? I feel this way about my wife, for example. Can one man look me in the eye and tell me that the level of passion and love is not real, overexaggerated, or disingenuine? Absolutely not.\nMaybe this thought process can help me empathize with Christians better. If they feel the way about their god that I do my wife, I guess maybe I should let them go about their business without my judgement.\"\n\nYou see, as atheist we get caught up in black and white facts. Imperil evidence, peer review, etc... However, Thoreau experienced something supernatural (in the true sense of the word, not the muddied bastardized modern version). I think we all long for that supernatural experience like Thoreau writes about. What Thoreau writes about is not an experience with divinity, a god, or gods creation. It's a human experience. He taps into the primal transcendental philosophy of what man really is and what a virtuous life is.\n\nOne part that really reaches out to me is his extended allegory about the philosopher and the fully content man. \n\n&gt;I believe that all races at some seasons wear something equivalent to the shirt. It is desirable that a man be clad so simply that he can lay his hands on himself in the dark, and that he live in all respects so compactly and preparedly that, if an enemy take the town, he can, like the old philosopher, walk out the gate empty-handed without anxiety. \n\nI feel this way about death and theism. When it's all said and done and I'm on my deathbed, I want to be able to walk through the gate with no anxiety because I lived a simple virtuous life. I think if you can undoubtedly answer yes to the question \"have you lived a good life and have you been true to yourself\", your efforts here on earth haven't been wasted. \n\nWhat is your take on it? \n\n[Here is the entire book if you're interested](http://www.gutenberg.org/files/205/205-h/205-h.htm#linkW1)\n\n[here is the audiobook](https://librivox.org/walden-by-henry-david-thoreau)\n",
        "created_utc": 1413673495,
        "upvote_ratio": ""
    },
    {
        "title": "What are we trying to achieve by criticizing religion?",
        "author": "thersx2",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jl3qf/what_are_we_trying_to_achieve_by_criticizing/",
        "text": "To keep this short, this question stems from watching the Sam Harris and Ben Affleck discourse that occurred on Bill Maher's show. I first wanted to say that I agreed with Harris's point that any criticism of Islam seems to be conflated with individual criticism of its believers, and Affleck even made his point by his response and overall attitude to Sam Harris.\n\nMy main question is why should we criticize other religions? What is our goal is doing that? I have an acquaintance who does not see the point or what some of us are trying to achieve by criticizing certain tenets of all religions. I tried explaining to her that we criticize to bring light to certain issues and to try to change the norm but her rebuttal was that Americans should let Muslims try to \"fix\" their religion and stay out of the conversation. \n\nWhat are your thoughts on this?\n\nEDIT: I should clarify that I do not mean criticizing the certain reasons why people believe in what they believe, but the religion and its tenets. ",
        "created_utc": 1413610016,
        "upvote_ratio": ""
    },
    {
        "title": "I'd like to discuss an article I found. What do you guys think?",
        "author": "IAMA_Ghost_Boo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jkwel/id_like_to_discuss_an_article_i_found_what_do_you/",
        "text": "",
        "created_utc": 1413603922,
        "upvote_ratio": ""
    },
    {
        "title": "On atheism and agnosticism",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jkvw1/on_atheism_and_agnosticism/",
        "text": "I just got into a debate over atheism and agnosticism. I made my case saying that atheism is a claim of belief and agnosticism a claim of knowledge. The debate is here: \n\nhttp://np.reddit.com/r/occult/comments/2jkn7w/lurker_here/clclsil\n\nBut i would prefer if there wasn't any raid there. Just inform me of what you think about the things said in the comments. Specifically around when it comes to what the terms agnostic and atheist means. ",
        "created_utc": 1413603519,
        "upvote_ratio": ""
    },
    {
        "title": "Okay, so I don't really know how to ask for this in a politically correct way, but can we make a list of examples (with links) where \"moderate Muslims\" display ignorance to the detriment of critical thinking and/or give implicit support to extremist views, etc.?",
        "author": "Marthman",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jhqr0/okay_so_i_dont_really_know_how_to_ask_for_this_in/",
        "text": "Well, I expect some people are going to be upset by my asking for this. \"Why don't you do this for other religions?\", you may ask, but most of us already have many examples of what I'm asking for when it comes to Christianity, considering a majority of Reddit is comprised of westerners, where Christianity is dominant.\n\nMy question in the title is not exactly what I wish it were. I'm having a hard time diplomatically articulating what I'm trying to ask for, and even this next part of my sentence is not exactly what I hoped it would be but: I want a post I can refer to with many crowd sourced examples of Muslims displaying ignorance and/or showing what they truly feel, and not the common facade of peace.\n\nMy goal here is not to incite anger or flames. It's just, with all the recent media coverage of Islam, and the Bill Maher clip, and all the debates popping up on /r/debatereligion, I want a resource I can refer to so that I can say: \"see? Is Islam really a religion of peace? Well how about this, and this, and this, and this link?\" Proof that even moderates support the ideas of the extremists! \n\nFor example, there was a video going around on Reddit today, that I can't find, where a Muslim speaker is addressing an audience and has the video on them, so that when he asks questions, you can see them raise their hands in response to his questions. \n\nVideo of above found by thatool: https://www.youtube.com/watch?v=y94VD5wSxA4\n\nMy contribution is this post from Susan Blackmore:\n\nhttps://richarddawkins.net/2014/08/a-hundred-walked-out-of-my-lecture/\n\nI apologize for the possible inflammatory nature of this comment. My goal here is **not** to commit the Texas sharpshooter fallacy. The reason I'm asking for moderate-Islam-related videos/articles specifically is because every time a westerner brings up how the meme of Islam is a detriment to society, somebody throws a shit fit and cries foul, saying that a majority of Muslims don't believe (x). I want to be able to provide evidence to back up my claims, and this topic is how I envision consolidating that evidence. Maybe this will be a wake up call for any religious person -and not just muslims- to see how moderate religiosity fans the flames of fanaticism\n\nSo in conclusion - I don't hate the player, but I do hate the game; and by that, I mean I don't hate Muslims (or any group of people for that matter), but I do \"hate\" Islam (hate is kind of strong, but I am certainly an anti-theist in general).\n\nIf I start getting a good amount of related contributions, I will amalgate them into this one post, so that anyone who needs to reference moderate Islam as a problem has a clear resource to do so. Thank you, all.\n\nEdit: an analogy/example so people can understand that I'm not suffering confirmation bias:\n\nI go to a museum. At the museum, I learn about the femur length of a particular dinosaur. In the gift shop, I peruse a book that is written by a prominent archaeologist that backs up the fossilized femur fact that I learned in the museum. I now know that the femur length of that particular dinosaur is (x) amount of feet. A year later, I say I know this fact, but someone asks me to provide evidence for it. I say I don't have any on me, but I know this is true. Do I really not know, because I don't have the evidence at hand? No. I just don't have the sourced justification for it on hand. So now I'm asking you all to send your dinosaur femurs. ",
        "created_utc": 1413523675,
        "upvote_ratio": ""
    },
    {
        "title": "Near Death Experiences really scare me",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jh56f/near_death_experiences_really_scare_me/",
        "text": "Whenever i here a story of anyone seeing hell when near death i get really scared. Their terrifying descriptions of hell make me think why would i ever want to risk going there, what if it is real. So i guess im asking you guys why these NDEs dont bother you, thanks",
        "created_utc": 1413509304,
        "upvote_ratio": ""
    },
    {
        "title": "My niece just posted on FB about returning from a Kairos retreat. Anybody have any experience or knowledge of these?",
        "author": "1000Airplanes",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jgvzy/my_niece_just_posted_on_fb_about_returning_from_a/",
        "text": "",
        "created_utc": 1413503629,
        "upvote_ratio": ""
    },
    {
        "title": "The Toronto Non-Conference - a conference for atheists, secularists &amp; free-thinkers",
        "author": "Andrew1345",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jgafx/the_toronto_nonconference_a_conference_for/",
        "text": "",
        "created_utc": 1413491804,
        "upvote_ratio": ""
    },
    {
        "title": "HOT BUTTONS TO BE PUSHED AT ATHEIST CONFERENCE",
        "author": "ThePositiveAtheist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jg9p7/hot_buttons_to_be_pushed_at_atheist_conference/",
        "text": "",
        "created_utc": 1413491442,
        "upvote_ratio": ""
    },
    {
        "title": "My first front door Jehovah's Witness experience.",
        "author": "BumpinSnugglies",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jfy63/my_first_front_door_jehovahs_witness_experience/",
        "text": "I was woken up this morning, at about 10:30 (late night), by a knock on my front door. It was a polite older gentleman, in a three-piece suit and straw trilby, that began to inquire about my morning and if I work from home. I explain that I am freelancing right now, so yes, I \"work\" from home. He then got to the meat of the reason he is at my doorstep at this ungodly hour of the morning, and asked me what my stance on the Kingdom of God was. Apparently he was unable to discern any information from the death metal shirt I was wearing. \n\n We had a nice conversation on the state of the world and how it has changed since he was a kid. Even bringing up the changes that have come to the Minneapolis community since he was a boy (said he lived here his whole life).  It was interesting, because our viewpoints seemed to share many similarities if God were to be taken out of the picture. Maybe it was that we both had Catholic backgrounds, then our families went Baptist after. The only difference being, and one of my main Atheistic drives, is that I was also brought up in what's called \"Church Universal and Triumphant.\"  C.U.T., or CULT, was built off the teachings of a self proclaimed prophet, Elizabeth Claire Prophet (yes, she actually made it part of her name). The thing that started to intrigue me was that his outlook on where the world is headed was far more bleak than the general Atheistic feeling that I have witnessed and shared.  As we conversed he handed me his first pamphlet that read, \"Will suffering ever end?\" That is when we started to discuss human morality based on religious background versus altruism. The first thing the inside said was, \"WHAT THE BIBLE SAYS/'God...will wipe all tears from their eyes, and there will be no more death, crying, or pain.'\" Then, \"WHAT THAT CAN MEAN FOR YOU/ *Assurance that God does not cause our problems./ *Comfort from knowing that God feels for us when we suffer./ ...\" (I hadn't read the pamphlet yet when we were talking, but holy hell.  *#1: So, God has a plan but it's not his fault when shit hits the fan? *#2: That is the ultimate Facebook \"lyk dis if u kry evry tim\") I admitted that I think religious text does have some purpose in Jesus' teachings being those of good moral values and ways of treating your fellow man, but then I began to talk about how man has inherent good and how living life in fear of being damned is just silly. I then brought up that many of the stories of The Bible show up in other ancient texts, and that some predate Biblical events. What surprised me was that he began citing secular authors on stuff like the Golden Rule.\n\n As we continued to talk, evolution became a topic. He doesn't believe in it. I understand he was being facetious, but he asked \"Why haven't we become trees?\"  I was like, \"whoa, that's not how it works\", and I encouraged him to look into it more.  We got into hairless bodies and developed brains, so I promised him to look up 3 verses of scripture(pertaining to the kingdom of heaven and how it's more of a governing body than a place)  if he would look up the \"Aquatic Ape Theory\". All this after I gave him a quick rundown of the theory from what I remembered from a TED talk. It seemed to spark a lot of questions, so I was beaming inside.  \n\nAt multiple times during our visit, he would mention how much he is enjoying our conversation because I seemed knowledgeable and that I wasn't afraid to question things. So, as our conversation wore down, he thanked me for a good talk and mentioned that he loves talking to the younger generations because we are more open than his. I thanked him in kind, because I had been waiting for this moment for a while now. I definitely didn't expect the conversation to go so well, and for him to be understanding of my views.  He said he wasn't there to convert anyone, just trying to open one's mind to other possibilities.  A small contradiction that was Ok to overlook in this case, because we had talked earlier about Biblical contradictions and he brought up many good ones. Thus, the topic of altruism came about. All in all, I enjoyed our discussion. I found out we shared many similar values based on parables and moral stories, but also strengthened my view on people that don't believe in evolution.  They simply don't understand it and haven't taken the effort to do a little research. If he would have put as much effort into evolutionary research as he did reading and understanding the Biblie, then our conversation probably wouldn't have been as fun. Or maybe it still could have. \n\nWhat have your experiences been like? Was it pleasant? Did they surprise you in any way during your conversation? What topics were brought up, and how did you answer?",
        "created_utc": 1413485494,
        "upvote_ratio": ""
    },
    {
        "title": "Mormonism, Utah, and the use of public media to maintain control",
        "author": "AnotherClosetAtheist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jfsog/mormonism_utah_and_the_use_of_public_media_to/",
        "text": "There are two major newspapers in Utah. The Deseret News, which is owned by the LDS Church, and the Salt Lake Tribune, which the Church is currently trying to take over.\n\nAll good Mormon folk here are sure to say that they take the DN. All the evil in Utah (Catholics, Buddhists, atheists, Baptists) make sure they take the SLT.\n\nThe LDS Church also has Bonneville Communications, a telecommunications corp, which owns the local NBC Channel 5.\n\nThe Deseret News is just plain ridiculous. Here is an example of what they consider \"news.\"\n\nhttp://www.deseretnews.com/article/865613202/When-the-criticisms-of-the-Book-of-Mormon-cant-be-taken-seriously.html?s_cid=Email-4\n\nIn the article they use the phrase \"that makes the weaknesses in many critics’ proposals hilariously obvious.\" There is more.\n\n&gt;However, no explanation that adequately and consistently accounts for the entirety of Joseph’s testimony and revelations has yet been proposed. The hypothetical explanation offered for X seldom also covers Y. Indeed, sometimes it flatly contradicts proposed explanations for Y. Thus, we get clashing portraits of Joseph Smith as ignorant scholar, sincere deceiver and brilliant fool. For most Latter-day Saints, probably, the best response remains to laugh — and then to get on with living and building the kingdom.\n\nBasically, it says \"people haven't been able to come up with a Geometric Proof of how the Book of Mormon was written, therefore it proves that it comes from God, and we should laugh at anyone who opposes us.\"\n\nGranted, this is in the \"Faith\" section and not the front page, but this section is the POINT of the newspaper. The Faith section is why people buy it. Whether or not they read the section, they buy it because its presence makes them feel comfortable that the rest of the newspaper is LDS-approved, and approves LDS.\n\n-----\n\nThis is a specific example of a religion being the dominant entity in a geographical region. Not only does it have dominance in that region, it also has a newspaper, radio station, TV channel to let everyone remain in a echo chamber, so that not one facet of their lives has to step outside the comforts of the church.\n\nAre there any other examples of something like this outside of Utah? Idaho doesn't count. Idaho is Utah's hat.",
        "created_utc": 1413482775,
        "upvote_ratio": ""
    },
    {
        "title": "Is anyone here good friends with Evangelicals or strong believers?",
        "author": "messier_is_ok",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jfsce/is_anyone_here_good_friends_with_evangelicals_or/",
        "text": "One of my good friends of over twenty years recently moved back into town, and I've been hanging out with him and his wife. He's always been very Christian, and has actually trained to become a pastor in order to follow in his father's footsteps. \n\nMy Girlfriend is extremely uncomfortable about hanging out with my friend. Now, she's Reform Jewish, and actually believes in God, so I thought this reaction was hilarious. \"You have more in common with him than you do with me!\" Turns out that her late mother had converted from Judaism to Evangelical Christianity before her death, and it was kind of an uncomfortable situation. The mother's congregation took over the funeral arrangements, and tried to bring my girlfriend and her dad into the fold during the ceremony. Needless to say, she's done with Evangelicals. \n\nTo me, a friend is a friend. Religion and politics don't matter to me as much as the core person. I wouldn't be dating a believer if it actually mattered to me. I told my girlfriend that my buddy had actually once tried to convert me. He started with an offhanded comment, and it turned into a friendly three hour kitchen table debate that changed nothing. She couldn't understand how I remained friends with someone who believes I'm going to hell, and has attempted to force their beliefs onto me. \n\nMaybe I've got an optimistic streak, and maybe it didn't rattle me because I live in such a secular city, but when he tried to convert me, I didn't get offended. I didn't become indignant and defensive. I didn't once question the validity of our friendship. \n\nWhat I saw then, was a man who had absolutely genuine (if misguided) concern about a good friend's well-being. He was *actually* concerned about my eternal soul burning in hell, and wanted to help me. \n\nI can respect that. In fact, I think it took him a ton of courage to bring it up, and even more to let it rest. I'm happy to call him a good friend, and I have no problem putting aside our beliefs. Good people are what they are, no matter what they happen to believe in. \n\nI'd be interested in hearing your experiences. It seems like many people feel like my girlfriend and want nothing to do with overly religious types - I'd love to hear about the friendships that do work.",
        "created_utc": 1413482609,
        "upvote_ratio": ""
    },
    {
        "title": "What's wrong with Christian purity?",
        "author": "moduspwns",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jewz8/whats_wrong_with_christian_purity/",
        "text": "Let’s share some thoughts and experiences on the Christian notion of “purity.” I wrote a post on the subject, and I'll leave an anecdote from it here and the link to the rest for anyone interested. More importantly, I want your thoughts and stories on the topic, especially if you’re a recovering Christian.\n\n\"The Christian sex scene is a bit of a joke. When the topic arises in Churches and youth groups, disclaimers abound, and the word “sex” is reflexively followed by “between a husband and a wife.” It’s a world of chastity bracelets, accountability buddies, chaperones, wholesome films, and promise rings – all in place to keep young genitals at a safe distance. Reality show family, the Duggars, practice a strict rule: “side-hugs” are allowed once a young couple is granted permission to date; handholding is allowed after engagement; kissing is strictly reserved for marriage. Every evangelical has a similar handful of anecdotes on the topic. Here is one of mine:\n\nOne of my friends was spotted, by a distant acquaintance and Christian Public Servant, holding hands with his then girlfriend of months at the mall. The concerned witness dutifully reported this matter to her father who, after chiding her soundly, instructed her to avoid my friend, who was every bit as harmless (and every bit as Christian) as they come. This may not seem over-the-top, except that both my friend and his love interest were adults at the time. To co-opt an old “drinking age” argument: they were old enough to die for their country, but not old enough to responsibly cope with the intense sensuality of handholding.\"\n\nThe rest is here: http://theplantlet.com/2014/10/15/whats-wrong-with-christian-purity/\n\nEdit: Especially interested in the damage this doctrine has caused, so dig deep. It’s OK to cry when you’re among friends! \n",
        "created_utc": 1413464735,
        "upvote_ratio": ""
    },
    {
        "title": "Parsing out an infuriating non-argument",
        "author": "sprawn",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jel02/parsing_out_an_infuriating_nonargument/",
        "text": "",
        "created_utc": 1413453081,
        "upvote_ratio": ""
    },
    {
        "title": "The sin of free will",
        "author": "twospeedgearbox",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jee04/the_sin_of_free_will/",
        "text": "Hi.\n\nI have free will. I also live in a universe that is causal. If all is cause and effect, i only have the illusion of free will. My choices are determined by past events but I cannot fathom every single event leading to the present, so my free will cannot be a true choice.\n\nSin is real (or so I've been told) and it is up to me, by using my free will, to sin (or not to) as I see fit, so long as I understand the consequences of my actions. If my free will is determined, has my sin also been determined?\n\nWhat is sin and is it deterministic, linked to my free will? How does one not sin if it is not truly my own choice?\n\nIs there an argument here or am I just spinning my wheels? I hope to have an interesting conversation with all of you, however I may not be able to reply immediately. Thank you.",
        "created_utc": 1413445036,
        "upvote_ratio": ""
    },
    {
        "title": "Do people who believe \"god speaks to me\" also think that they are prophets?",
        "author": "sfoglia301",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jc6t0/do_people_who_believe_god_speaks_to_me_also_think/",
        "text": "After reading many of the stories here and interacting with people who claim that god guides their daily decisions and pitches in with information, do they not realize that would make them prophets? Do they really believe they are that special? Looking to hear from other people that grew up in this cultures and can comment on it. ",
        "created_utc": 1413396111,
        "upvote_ratio": ""
    },
    {
        "title": "The dark side of \"Christian Purity.\" Share your stories.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jc50o/the_dark_side_of_christian_purity_share_your/",
        "text": "I wanted to share some of my thoughts and experiences on the doctrine of Purity. I wrote a post on the subject, and rather than burden you with the whole thing, I'll leave the intro here and the link for anyone interested. \n\nI want your thoughts and stories on the topic, recovering Christians! \n\n\"The Christian sex scene is a bit of a joke. When the topic arises in Churches and youth groups, disclaimers abound, and the word “sex” is reflexively followed by “between a husband and a wife.” It’s a world of chastity bracelets, accountability buddies, chaperones, wholesome films, and promise rings – all in place to keep young genitals at a safe distance. Reality show family, the Duggars, practice a strict rule: “side-hugs” are allowed once a young couple is granted permission to date; handholding is allowed after engagement; kissing is strictly reserved for marriage. Every evangelical has a similar handful of anecdotes on the topic. Here is one of mine:\n\nOne of my friends was spotted, by a distant acquaintance and Christian Public Servant, holding hands with his then girlfriend of months at the mall. The concerned witness dutifully reported this matter to her father who, after chiding her soundly, instructed her to avoid my friend, who was every bit as harmless (and every bit as Christian) as they come. This may not seem over-the-top, except that both my friend and his love interest were adults at the time. To co-opt an old “drinking age” argument: they were old enough to die for their country, but not old enough to responsibly cope with the intense sensuality of handholding.\"\n\nThe rest is here, for anyone interested: http://theplantlet.com/2014/10/15/whats-wrong-with-christian-purity/",
        "created_utc": 1413395228,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't you buy the empty tomb arguement?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jbwoj/why_dont_you_buy_the_empty_tomb_arguement/",
        "text": "",
        "created_utc": 1413390902,
        "upvote_ratio": ""
    },
    {
        "title": "A friend of mine appears to be approaching full bore cultist mentality. How might one approach them?",
        "author": "JakalDX",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jbr9d/a_friend_of_mine_appears_to_be_approaching_full/",
        "text": "",
        "created_utc": 1413388133,
        "upvote_ratio": ""
    },
    {
        "title": "Thermodynamics",
        "author": "AskMeAboutMyRapSong",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jbquq/thermodynamics/",
        "text": "I often hear Creationists site the 2nd law of thermodynamics in an effort to disprove evolution and the Big Bang. Instead of explaining why that is wrong, wouldn't be easier to just say that the 1st law (that energy is neither created or destroyed) disproves their idea of a Creator god?\n\nDisclaimer: I'm no expert on the subject, just a college student who just left science lab.",
        "created_utc": 1413387919,
        "upvote_ratio": ""
    },
    {
        "title": "Religion in European countries (non-English)",
        "author": "SecularVirginian",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jbnfh/religion_in_european_countries_nonenglish/",
        "text": "I was reading recently that Eastern Germany is possibly the [least religious area](http://www.theguardian.com/commentisfree/belief/2012/sep/22/atheism-east-germany-godless-place) on Earth.  \n\n&gt; A recent study called Beliefs About God Across Time and Countries found that 52.1% of people asked whether they believed in God identified themselves as atheists. This compared with only 10.3% in western Germany. Indeed, the survey was unable to find a single person under the age of 28 in eastern Germany who believed in God. Obviously there are some – I think I may have even met some once – but the survey was unable to find them.\n\nWhen inspecting the [survey](http://www.norc.org/PDFs/Beliefs_about_God_Report.pdf), it seems that 46% of people in East Germany described themselves as \"Strong Atheists\" and only 2.5% described themselves as \"Strong Believers.\"\n\nAs a country as a whole, France and the Czech Republic appear to be the least religious.\n\nThe statistics in these countries seem amazing to me.\n\nWhen learning these statistics, I was excited to check out the differences between state and religion in some of these places as compared to the US.\n\nI was surprised to learn that in Germany, there are official churches that have a legal relationship with its members.  Apparently the churches can use the government to collect money from its members.  Furthermore, if you want to break your legal association with a church (disaffiliate), you have to [pay money](http://en.wikipedia.org/wiki/Religious_disaffiliation_in_Germany#Exit_fees) to do it.  \n\n&gt; Religious communities that are of considerable size and stability and are loyal to the constitution can be recognised as \"Körperschaften öffentlichen Rechtes\" (statutory corporation). This gives them certain privileges, for example being able to give religious instruction in state schools (as enshrined in the German constitution, though some states are exempt from this) and having membership fees collected (for a fee) by the German revenue department as Church tax.\n\nIt also appears that [religious education](http://en.wikipedia.org/wiki/Freedom_of_religion_in_Germany#The_right_to_provide_religious_education_at_state_schools) is obligatory in many schools\n\nAs an American, these are all things I would expect in the many countries which are extremely religious.  \n\nIn the USA we have organizations that try to promote atheism and prevent religious encroachment in the government.  Are there German/French organizations such as this?\n\nI was wondering if anybody here was more familiar with secularism in non-English speaking European countries.  Are there famous French/German comedians who make jokes on religion?  Are there major figureheads in France/Germany who question religious apologists publicly?  Are there public figures who openly assert that religion is harmful?  Is there any sort of stigma around these types of discussions?\n\nI would like to think that as more people realize religion is a hoax, pluralistic ignorance and confirmation bias would become less prevalent forces for religion, causing it to wane much faster.  Is this something noticeable in these countries?\n\nI notice that Islam seems to be topic of public debate in countries such as France and Germany.  Does this bring about criticism of religion in general in these countries?\n\nI would love if someone more familiar with non-English speaking European countries could expound more on religion in their societies.",
        "created_utc": 1413386046,
        "upvote_ratio": ""
    },
    {
        "title": "A C.S. Lewis quote showed up on my facebook feed today. I could not think of a concise argument to refute it. Thoughts?",
        "author": "wadamday",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jbjy0/a_cs_lewis_quote_showed_up_on_my_facebook_feed/",
        "text": "",
        "created_utc": 1413383965,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to make an effort to understand where Reza Azlan is coming from",
        "author": "seouled-out",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jbhtd/trying_to_make_an_effort_to_understand_where_reza/",
        "text": "Figured this would be the only place to try to wrangle a sane discussion about this given the main sub's tendency toward knee-jerk tribalism.\n\n\nI like Sam Harris and I very much value his willingness to put forth contrarian opinions that tend not to yield to any existing clique. He offers   illuminating insights and stances on meditation, gun ownership and personal protection, human consciousness, geopolitics, and of course religion and belief. I find myself subscribing to his convictions often, and in matters where I do not, I feel a sharp tug in his direction. I also very much like the style and tone in which he communicates, both in written and spoken form: always with erudition and equanimity. I happily find myself forced to consult a dictionary every time I read something he's written. \n\nWhen this public sparring began, I chose my side immediately: Affleck is an ill-informed purveyor of red meat for 'coexist' liberals, an emotional boob from which we learn nothing useful. Harris is a brilliant mind, whose nuanced views are (perhaps willingly) misunderstood by those who trade in bumper-sticker politics. \n\nWhen Reza Azlan joined in, I was immediately offended and annoyed by his public attack on Harris. His speaking style is self-aggrandizing and patronizing, and he constantly appeals to authority (ie comparing  academic credentials) to try to win arguments. Having seen him on short video clips and television appearances over the past week or so, he's quickly become public annoyance number one. \n\nYet I realized that my assessment of him was based more on his personality and his style of polemics than on the content of his actual arguments. And I must acknowledge that I feel extremely unresolved in my consideration of Islam, and interested to consider various points of view. \n\nJust earlier I watched the [extended 45min interview he did with Cenk Uyger on The Young Turks](https://www.youtube.com/watch?v=7F-SiZt0amg). I highly recommend it. In my experience, I found it really useful at least in terms of understanding Azlan's point of view. He is still very annoying in the way that he speaks, and he is certainly always willing to paint atheists in a bad light. But getting past that...  \n\nCenk does a very measured interview and asks useful questions that force Azlan to go deeper than he usually does when he's sparring and lobbing labels at anyone who disagrees with him. His consideration and definition of \"religion\" as a nebulous, fluid language of shared emotions and ideas, distinct from the scripture that inspires it, is interesting, even if it is not entirely satisfying. I would very much like to hear from anyone else who is willing to consider his points and evaluate them in a way that is not copypasta from Sam Harris. \n\nFor example I thought this [in particular was an interesting idea, from 31:22](http://youtu.be/7F-SiZt0amg?t=31m21s):\n&gt; You have to recognize that religion, whether it's textually based or not, is an ideology like any other. And you can't judge an ideology by the way in which it can be transferred into its extremist terms.\n\nWhat's interesting about this is that this line of thinking seems to point toward doing exactly what the Azlans and the Afflecks seem to accuse Harris and Maher of doing: judging the religious, rather than the scripture. \n\nAnyway, as much as I have a knee-jerk distaste for Azlan's style of communication, his academic snobbery, I think he is a source of interesting ideas worth considering. Curious to hear whether anyone else is approaching his ideas with an open mind, and specifically whether anything he's said has made you think differently about any of this. \n",
        "created_utc": 1413382633,
        "upvote_ratio": ""
    },
    {
        "title": "Judge Posner quotes Leviticus on homosexuality, saying “So? Just because it's old doesn't make it right.”",
        "author": "cypherpunks",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2japnd/judge_posner_quotes_leviticus_on_homosexuality/",
        "text": "Page 28 *et seq.* of http://pdfserver.amlaw.com/nlj/usca7_ssm_20140904.pdf , the 7th Circuit Court of Appeals decision on same-sex marriage.  (Indiana and Wisconsin).  Just thought it was interesting.\n\n&gt; Tradition per se therefore cannot be a lawful ground for discrimination—regardless of the age of the tradition. Holmes thought it  “revolting to have no better reason for a rule of law than that so it was laid down in the time of Henry IV.” Oliver Wendell Holmes, Jr., “The Path of the Law,” 10 *Harv. L. Rev.* 457, 469 (1897). Henry IV (the English Henry IV, not the French one—Holmes presumably was referring to the former) died in 1413. Criticism of homosexuality is far older. In Leviticus 18:22 we read that “thou shalt not lie with mankind, as with womankind: it is abomination.”\n\n([Richard Posner](https://en.wikipedia.org/wiki/Richard_Posner) writes a *lot*, and much of it is quite readable.)\n\n*Edit* The point for discussion, just to make it explicit, is that it's nice to see the mythical \"biblical foundation of American law\", which so many historical revisionists try to assert as fact, *explicitly* rejected in a federal Court of Appeals decision.  And by [the most cited legal scholar of the 20th century](http://patentlyo.com/patent/2004/08/lessig_guest_bl.html), at that.",
        "created_utc": 1413356113,
        "upvote_ratio": ""
    },
    {
        "title": "Next week I'm going to be interviewing a self-professed former atheist who recently converted to Mormonism. I'd appreciate your insight.",
        "author": "BenGeezy",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2jacjq/next_week_im_going_to_be_interviewing_a/",
        "text": "A little back story. This past weekend I attended a Mormon church service, partly for a class I'm taking, and partly for a project I'm working on. I met a woman who has just recently converted, and she told me that she was raised an atheist , never believed in God, and \"rolled her eyes at those who did\". I asked if she'd be willing to be interviewed and she accepted.\n\nI'm really interested not only in Mormons and what they believe, but how a self-professed ex-atheist became a Mormon. I've put together a rough list of questions for her, and I'm wondering if anyone has any other questions you feel should be asked, or if there are any obvious questions that I am missing (or if any of these questions are terrible). \n\nBelow is my list of questions. Things in parentheses are there for my benefit, and not necessarily part of the questions I'll be asking.\n\n\n----------------------------------------------------------------------\n\n1.You stated previously that you were raised an atheist. Can you tell me more about your childhood in regards to what your parents taught you about religion, God, and gods? \n\n2.How would you say you defined atheist prior to your conversion to the LDS church? \n\n3.How would you say you define atheist now that you have converted? Any differently? If so, why the change?\n\n4.How were you introduced to the LDS church? \n\n5.What was your perception of them prior to your introduction? Why? \n\n6.I heard many affirmations from attendees the other day starting that they believe that the church is true, God (Yahweh) is real, and Jesus did all that is said of him. Do you share these beliefs? Why?\n\n7.I'm curious as to how it is someone with no faith tradition, (out of all of the world's deities and faith traditions,) came to find a home in the LDS church. Can you tell me more about how you came to be convinced of the validity of the church, the existence of not just a god, but Yahweh God, and the validity of the Bible and Book of Mormon. \n\n8.Where do you place yourself on the belief scale 1-10? \n\n9.How do you define faith? Do you see faith as a reliable method of navigating daily life. Are there better ways? Worse ways? \n\n10.Would you say that prior to your conversion you relied on faith to make decisions? Why our why not? Describe to me a situation in which you would use faith to make a decision. \n\n11.How do you personally define god? \n\n12.In what way is God...? ( For example, In what ways is the existence of a god obvious?)\n\n13.Is there any part of LDS doctrine that you disagree with, or have a hard time rectifying with your past opinions our feelings? \n\n14.The LDS church has been adamantly opposed to gay marriage and has successfully campaigned against it in California and spends millions elsewhere in opposition to it. How does this align with your opinion on the subject? Does it differ from prior to your conversion? \n\n15.If the prophet (or any leader) said something that you disagreed with how comfortable would you be voicing your disagreement? \n\n16.How does your family feel about your conversion? \n\n17.What would you say to atheists who are skeptical about the existence of your God? \n\n18.What would you say to other sects of Christianity who are skeptical about the validity of the Book of Mormon? \n\n19.What would you say to believers of different gods/faith traditions? (Not Christian. Islam, Hindu, for example)\n\n------------------------------------------------------------------------\n\nPlease ignore my grammar/misspellings/etc. I wrote this up on my Kindle, and haven't had a chance to fix them. \n\nThanks!\n\nEdit* Also, if any of these questions seem to be out of order, please let me know.\n",
        "created_utc": 1413345563,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for some help dealing with my boyfriend's religious parents",
        "author": "religiouswoes",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j9ti8/looking_for_some_help_dealing_with_my_boyfriends/",
        "text": "",
        "created_utc": 1413334216,
        "upvote_ratio": ""
    },
    {
        "title": "A couple of questions regarding John Calvin and Alvin Plantinga. (First principles, basic propositions, and derived propositions etc.) X-Post to /r/Philosophy",
        "author": "federleicht",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j9sqq/a_couple_of_questions_regarding_john_calvin_and/",
        "text": "Hey everyone! I'm taking a Philosophy of Religion class this semester, and we've recently been discussing the works of John Calvin, specifically his text \"Testimony of the Spirit\" and Alvin Plantinga, specifically his text \"Is a Belief in God Properly Basic?\"\nHere are some links to (most) of the text, it was the best I could find. Both texts can be found in \"Faith &amp; Reason,\" edited by Paul Helm.\n\n[Calvin; not the exact same text, but the same message](http://books.google.com/books?id=MHOm__oeEdIC&amp;pg=PA362&amp;dq=testimony+of+the+spirit+john+calvin&amp;hl=en&amp;sa=X&amp;ei=ecQ9VMnXE9PIggSQ_ILABg&amp;ved=0CB8Q6AEwAA#v=onepage&amp;q=testimony%20of%20the%20spirit%20john%20calvin&amp;f=false)\n\n[Plantinga](http://books.google.com/books?id=pj16s_fnr08C&amp;pg=PA351&amp;dq=is+belief+in+god+properly+basic+alvin+plantinga&amp;hl=en&amp;sa=X&amp;ei=EcQ9VKqZJIuQgwSRpILIDA&amp;ved=0CB8Q6AEwAA#v=onepage&amp;q=is%20belief%20in%20god%20properly%20basic%20alvin%20plantinga&amp;f=false)\n\nJohn Calvin is obviously very aggressive with his views towards Christianity, and what makes it difficult(?) to refute him is that his first principle is scripture, which is based off of revelation. To him revelation is far more powerful that reason (while reason should not be discarded, it cannot stand alone). With this being his first principle, he can basically argue against whatever viewpoint any person has that they have come to through reason. I find it odd and disconcerting that someone's first principle in a philosophical debate can be scripture, but I can't find the words to explain why this fails. *Why is John Calvin permitted to use scripture, specifically the Bible, as his set of first principles?*\n\n\nThen we move on to Alvin Plantinga. While I agree with his basic argument against evidentialism- in which if the evidentialist uses his own argument of basic beliefs versus derived propositions, the evidentialist argument becomes self defeating- I do not fully understand what he means by the rest of his text. Plantinga seems to state that the evidentialist view of basic belief is too narrow, and therefore should be expanded. He also goes on to talk about an agent sensitive epistemology. **In condition C, some person (S) is justified in holding P as properly basic.** With this viewpoint, the theist is justified in believing in God based on their own conditions and experiences. This method can also be applied to the non-theist, if the conditions to him lead him to believe that god is not real. Some people have the justification to believe in god, and some don't. Great, problem solved, right? Plantinga disagrees, saying that this equation cannot be applied to everything. In his example his stated that it is unjustified to believe in the Great Pumpkin according to this set of standards. Understanding the philosophical definition of a God is enough to know that any god cannot be physical and within time. Plantinga also goes to say that *\"The Reformed epistemologist may concur with Calvin in holding that God has implanted in us a natural tendency to see his hand in the world around us,\"*  I was wondering what the non-theist argument towards this equation would be? If the conditions are right for a person to not believe in god, Plantinga would find this person to be justified in that believe, but that they were also ignorant and needed to be enlightened. How does one approach this? How can Plantinga make such a bold statement, and how would one refute this?\n\n\nPersonally I would call myself an Atheist, but it's very difficult being the only non-Catholic in the class taught by a Catholic professor at a Catholic college. As this is only my second Philosophy class, I have many questions that remain unanswered because of the obvious bias towards religion. Any help would be appreciated.\n\nEdit: formatting",
        "created_utc": 1413333778,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for some help dealing with my boyfriend's religious parents",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j9sch/looking_for_some_help_dealing_with_my_boyfriends/",
        "text": "Hey everyone, I would really appreciate some insight into this situation. I've tried searching through this subreddit (and some others) but so far I haven't really had much luck!\n\n\nMy boyfriend [24M] and I [23F] have been dating for almost 3 1/2 years. He's a fairly liberal Christian while I consider myself agnostic. Last week we got into a bit of a disagreement over religion and kids when we were texting. Ultimately, we decided to give ourselves the weekend to think things over and then talk about in person on Monday. When we did talk we both agreed that things had gotten out of hand and talked things through. However, our happy moment quickly came to an end when his parents texted him and asked him how our conversation went. As far as his parents know, I’m Roman Catholic. They just so happen to be super conservative Dutch Christian Reform (aka: the type who believe the bible is inerrant and that evolution isn't real). So, when my boyfriend told his parents that we decided to stay together they completely flew off the handle. He ended up sending them this in hopes that they would understand:\n\n\n&gt;   “I'm happy with this and if you don't see it, it's because your disapproval and constant comments make me feel awkward about it. Her too. You're putting way too much pressure on both of us. I'm young and don't want to get married for a long time so I'm just taking things slow. I know you guys don't like her and that's fine but this is my life and if this ends up being a mistake then it's better than I learn that on my own anyways. I love you guys but please, I need some space\"\n\n\nTo me that seemed pretty reasonable, but his parents completely ignored it when the messaged him back. Apparently us staying together caused his mom to start crying. They have \"never been more disappointed in their lives\" and were outraged. According to them, because my boyfriend didn't break up with me he is sending a message to the whole family that he doesn't care about any of them. They have (apparently) given us space for three years and he has selfishly chose me and accepted my advice over the family who has loved and cared for him his whole life. Oh, and they also told him that he ruined their whole vacation. After all of that they said that they want to meet up with the two of us to \"let chocogingersnap know where she stands\".\n\n\nThis isn't the first time his parents have done this sort of thing either. Whenever he’s tried to defend our relationship and say that we’re happy together, they counter with how we don't seem to be happy when we go visit them. Well of course we’re gonna have a hard time relaxing and being happy around them! Almost the whole time we've been dating they have told my boyfriend negative things about our relationship and have generally hated on me. Plus, given how much they gossip about the people who go to the same church as them, they've probably also said worse behind our backs. In a way, I find this whole thing kinda funny because whenever we do actually go visit they're so nice to my face. Talk about two faced. \n\n\nPersonally I'm not too keen to talk to my boyfriend's parents after all of this. I really don't think our relationship is any of their business. Their son is an adult who can make his own decisions. He moved away from home over two years ago when he graduated college and got a job, so it's not even like they still live under the same roof. This whole situation is incredibly frustrating for me, but because my boyfriend still wants to talk to me I'm willing to proceed with the conversation. However, I'm sort of at a loss on how to prepare myself for this. \n\n\nThanks in advance!\n\n\n**tl;dr My boyfriend's parents are super religious and are mad at him because we didn't break up. They now want to talk and I'm not sure what to do.** ",
        "created_utc": 1413333583,
        "upvote_ratio": ""
    },
    {
        "title": "Question about the constitution and how to respond to an argument regarding it.",
        "author": "YourBurrito",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j9k2b/question_about_the_constitution_and_how_to/",
        "text": "",
        "created_utc": 1413328886,
        "upvote_ratio": ""
    },
    {
        "title": "Went to a Catholic Church today after so many years for a funeral - and here's what happened",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j9gcc/went_to_a_catholic_church_today_after_so_many/",
        "text": "I was raised Catholic and was very devout until my teens. I haven't been to a church in years - can't even remember the last time that happened. So someone died and I had to attend a funeral and found myself today at a mass and it all felt so awkward - I kind of remembered how to do the things during the mass, the ritual came just naturally to me and I felt almost compelled to eat the wafer with the crowd, although none of it had any meaning to me these days.\n\nIt was just some stored procedure lost in some space in my mind, and when someone requested that, it came back to use. From my perspective, people who attend to church regularly just repeat the same rituals because they get used to it (like I was raised to and it got hard-wired in my memory) and don't pay any attention to what it means or what they're repeating. \n\nBut that incense smells nice. I'd like to have some when I take a relax in my bathtub after a long day at work. ",
        "created_utc": 1413326801,
        "upvote_ratio": ""
    },
    {
        "title": "SO's sister raising their kids Christian, despite not believing it themselves, \"to teach them morals\". How common is this and how can my SO and I help to better the situation?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j8wwd/sos_sister_raising_their_kids_christian_despite/",
        "text": "",
        "created_utc": 1413316682,
        "upvote_ratio": ""
    },
    {
        "title": "Just for fun: An interactive questionnaire that tells you which Mormon Prophet you would have been",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j88em/just_for_fun_an_interactive_questionnaire_that/",
        "text": "",
        "created_utc": 1413304049,
        "upvote_ratio": ""
    },
    {
        "title": "Just for fun: An interactive questionnaire that tells you which Mormon Prophet you would have been",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j886c/just_for_fun_an_interactive_questionnaire_that/",
        "text": "",
        "created_utc": 1413303933,
        "upvote_ratio": ""
    },
    {
        "title": "How is religion different to language, or culture?",
        "author": "symmetrygear",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j7fvm/how_is_religion_different_to_language_or_culture/",
        "text": "When a child is raised, they are given/indoctrinated with religion, and everyone is against that, myself included, but they are also given culture, patriotism, language and many other involuntary things. \nGenuinely curious to hear your perspectives. ",
        "created_utc": 1413284818,
        "upvote_ratio": ""
    },
    {
        "title": "Does the self-identifier 'spiritual but not religious' bother you?",
        "author": "ZapMePlease",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j5es3/does_the_selfidentifier_spiritual_but_not/",
        "text": "When I hear someone tell me that they're 'spiritual, not religious' I'm never really sure what to think of that.\n\n\nMany of the SNR people seem to mean that in a 'crystal healing, colon cleansing, CAM kind of way'.  Others seem to mean it in almost a 'Buddhist meditative' kind of way.  I could probably list dozens of different stereotypical SNR types that I've met.  \n\nThe only really consistent trend between these people seems to be a tendency to embrace the 'fringe' aspects of culture - pseudoscience particularly.\n\n\nWhat does it mean to you when someone is 'spiritual, not religious' and do you, like me, tend to have to try hard to keep from rolling your eyes when you meet these people?\n\n[edit]\nI wish I would have phrased my post a little better but as an addendum ...\n\na) Do you think that the SBNR crowd tends to be more into the pseudosciece (antivaxxer, climate change denier, CAM etc&gt;(\n\nb) if you do then why do you think that is so?\n\nSometimes it seems like they've opened up their minds so wide that their brains have fallen out.\n",
        "created_utc": 1413232822,
        "upvote_ratio": ""
    },
    {
        "title": "I still feel nervous saying \"if there is a god, then him strike me down\". I'm not sure why, though, and am curious how you guys feel about it.",
        "author": "812many",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j54xr/i_still_feel_nervous_saying_if_there_is_a_god/",
        "text": "This is a weird one for me. I've come to Atheism from a perspective of \"it just doesn't make any sense\", and has been reaffirmed by places like this subreddit and in the beginning /r/atheism, too. I've spent a lot of time talking about the various reasons why I don't believe, and have even come to the conclusion that I'm a strong Atheist, I seriously don't believe and am of the opinion that there is most probably not a god, not of the \"we really can't know so I won't answer that question\" group.\n\nHowever, saying the sentence \"if there is a god, let him strike me down\" out loud still makes me feel nervous. Almost like I'm tempting a non-existent fate.  It gives me that same feeling in the pit of my stomach that I get when jumping off a really high diving board - I know I can do it, I will be fine, but am still really nervous and almost feel a rush when I complete it.\n\nMy only explanation is that there's still something going on in me, maybe it's human nature, I really don't know. It doesn't feel like doubt, it more feels like my body going through a natural defense mechanism. I find it really fascinating. It might mean that I harbor some unconscious doubts that I'm not willing to acknowledge. Or maybe it's something that I learned as a kid and is still sticking around in some cool way, like some people have a fear of social situations even though they know that they should be fine.\n\nAnyway, these are my thoughts, I'm curious to hear what other people think about this odd phenomena and if I'm not the only one.\n\n*edit: yup, screwed up the title. \"the LET him strike me down now\" \"or may he strike me down\" or any other variant. \n",
        "created_utc": 1413227917,
        "upvote_ratio": ""
    },
    {
        "title": "Criticizing Religious Beliefs Doesn't Make You a Bigot",
        "author": "DoKtor__K",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j4wbi/criticizing_religious_beliefs_doesnt_make_you_a/",
        "text": "",
        "created_utc": 1413223485,
        "upvote_ratio": ""
    },
    {
        "title": "How do you explain that morality can change when society develops?",
        "author": "vesuvianabyss",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j4ujj/how_do_you_explain_that_morality_can_change_when/",
        "text": "",
        "created_utc": 1413222548,
        "upvote_ratio": ""
    },
    {
        "title": "Advice before Mormon Church?",
        "author": "SsiRuu",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j44ui/advice_before_mormon_church/",
        "text": "",
        "created_utc": 1413207835,
        "upvote_ratio": ""
    },
    {
        "title": "Claims of Religious Experiences That I Heard",
        "author": "DoctorMetropolis",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j2dw3/claims_of_religious_experiences_that_i_heard/",
        "text": "So, a couple weeks back, I had an interesting conversation with a couple of Christians, and they told me some of their religious experiences. Some of their experiences could be easily explainable, but there a couple of stories that weren't as easy to explain.\n\nFor example, in one story a guy told me that while he was at a check-out line at a grocery store, a woman came up to him and asked him something along the lines of, \"keep looking, you'll find what you're looking for\". He said he asked her how she knew, but I don't remember the response that was given.\n\nAnother one was from another guy who said that he needed money to pay for college classes. Of course, he prayed, and out of nowhere, he got a grant to pay for the classes. He said he never told anyone about his financial issues, and as he pointed out, people don't usually get college grants for no reason. Admittedly, I found much more interesting. Although, I'm a little skeptical of this guy, considering the he said that he once had a headache that was the result of demon attempting to crush his head (his sister saw the demon, according to his story).\n\nI feel like there is something fishy about these stories. I don't think they're lying, although there might be a huge amount of confirmation bias clouding their stories. I'm curious to see what you guys think about these two stories.",
        "created_utc": 1413154838,
        "upvote_ratio": ""
    },
    {
        "title": "Mocking Christian and Creationist Movies, begins Online Filmclub begins \"Christsploitation\" Marathon. Watch movies like \"God's not dead\" and chat!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j2cnx/mocking_christian_and_creationist_movies_begins/",
        "text": "",
        "created_utc": 1413154093,
        "upvote_ratio": ""
    },
    {
        "title": "Any atheists that aren't \"out\" yet, do you get depressed? How do you deal with it?",
        "author": "nero4983",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j25ym/any_atheists_that_arent_out_yet_do_you_get/",
        "text": "**TL;DR:** Living with very religious family in the south, can't \"come out\" as an atheist, have about two years before I graduate and can move out, very freaking depressed.\n\nSo I'm still living with my parents as I go to college and I've been getting severely depressed about religion.  I've been an atheist for a few years now and it's been very weird growing up in the south and having a very religious family (no alcohol, cussing, always tithe, go to church at minimum once a week, etc) and transitioning to an atheistic point-of-view.  My family's views seem so foreign and hate filled now and it's seriously depressing.  I haven't been to church in a year or two now (minus a couple of times for christmas or whatnot) and my family was questioning \"the strength of [my] relationship with god\".  I was talking with my dad about muslims yesterday and he was acting like all muslims are extremist (like ISIS/Al Qaeda).  He was saying that it's the religion (not the people who uses the religion to excuse their actions) that's violent and any violent christians (ex: Hitler, the crusades, etc) weren't \"true christians\".  When I stood against labeling all muslims as extremist my father went into a rant about \"Do you believe in the quran?!\" over and over.  I still have about two years before I graduate and move out but I don't know how long I can take this anymore, it's seriously freaking depressing.  Also, I can't \"come out\" as an atheist as my family seriously 100% believes in the bible and it would tear them up to think that I was going to hell--there's so much going on in my family right now on top of what that would cause so I just can't do that.  If it simply takes me being depressed to spare them that agony then I guess that's what it takes.",
        "created_utc": 1413149883,
        "upvote_ratio": ""
    },
    {
        "title": "Need Answers",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j19y3/need_answers/",
        "text": "",
        "created_utc": 1413130332,
        "upvote_ratio": ""
    },
    {
        "title": "The Christian religion has as its core the cross. In other words, it appeals to two forms of extreme cruelty: one is the death provoked by torture and the other the process of dying",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2j05av/the_christian_religion_has_as_its_core_the_cross/",
        "text": "http://waltherpragerandphilosophy1.blogspot.ro/2013/12/cross.html",
        "created_utc": 1413088552,
        "upvote_ratio": ""
    },
    {
        "title": "What is your opinion on Atheist Experience?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2izzvn/what_is_your_opinion_on_atheist_experience/",
        "text": "So I've begun watching this show anew and I am in awe at how well they can argue any position, it's like no matter how ridiculous the claim is they will find holes in the argument and expose them. Sometimes when I hear a caller blabber my mind just goes into an emergency shutdown mode out of such sheer stupidity that I cannot comprehend what it means even, and then the second they stop talking the AE staff immediately answer the question or statement with no problem whatsoever! What do you think of this show though reddit?",
        "created_utc": 1413084154,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Brian Greene's TED talk \"Why is our universe fine-tuned for life?\"",
        "author": "eggn00dles",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iybtf/thoughts_on_brian_greenes_ted_talk_why_is_our/",
        "text": "http://www.ted.com/talks/brian_greene_why_is_our_universe_fine_tuned_for_life/transcript?language=en\n\n&gt; 17:45\nI'll conclude with a striking implication of all these ideas for the very far future. You see, we learned that our universe is not static, that space is expanding, that that expansion is speeding up and that there might be other universes all by carefully examining faint pinpoints of starlight coming to us from distant galaxies. But because the expansion is speeding up, in the very far future, those galaxies will rush away so far and so fast that we won't be able to see them -- not because of technological limitations, but because of the laws of physics. The light those galaxies emit, even traveling at the fastest speed, the speed of light, will not be able to overcome the ever-widening gulf between us. So astronomers in the far future looking out into deep space will see nothing but an endless stretch of static, inky, black stillness. And they will conclude that the universe is static and unchanging and populated by a single central oasis of matter that they inhabit -- a picture of the cosmos that we definitively know to be wrong.\n19:01\nNow maybe those future astronomers will have records handed down from an earlier era, like ours, attesting to an expanding cosmos teeming with galaxies. But would those future astronomers believe such ancient knowledge? Or would they believe in the black, static empty universe that their own state-of-the-art observations reveal? I suspect the latter. Which means that we are living through a remarkably privileged era when certain deep truths about the cosmos are still within reach of the human spirit of exploration. It appears that it may not always be that way. Because today's astronomers, by turning powerful telescopes to the sky, have captured a handful of starkly informative photons -- a kind of cosmic telegram billions of years in transit. and the message echoing across the ages is clear. **Sometimes nature guards her secrets with the unbreakable grip of physical law. Sometimes the true nature of reality beckons from just beyond the horizon.**\n\nDoes this lend any credibility to the idea that there could be forces or entities we are simply incapable of ever detecting or comprehending? This is a situation where the strictest interpretation of the world based solely on what those future scientists would see is known to be wrong. How can we assume that doesn't hold true for our current civilization with respect to unexplained phenomena like consciousness and the origin of the big bang itself?",
        "created_utc": 1413043953,
        "upvote_ratio": ""
    },
    {
        "title": "You can be the better/stronger person without atheism",
        "author": "DrakeX7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iy6f3/you_can_be_the_betterstronger_person_without/",
        "text": "",
        "created_utc": 1413040185,
        "upvote_ratio": ""
    },
    {
        "title": "\"The world would be better off without religion\" - I'm doing a public debate soon, does anyone have any good points to offer?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ixw4q/the_world_would_be_better_off_without_religion_im/",
        "text": "So I'm taking part in a public debate soon and the motion is \"This house believes the world would be better off without religion.\" I'm speaking for the Proposition alongside some fairly renowned speakers on the subject.\n\nI'm in the process of writing my speech and I've got most of it already, but does anyone have anything to offer? For context, this is in the UK and my two main opponents are a CofE member and a CofE reverend.\n\nAny good one-liners I can throw in? If you were in an argument/debate/discussion on this topic, what would you say?",
        "created_utc": 1413031266,
        "upvote_ratio": ""
    },
    {
        "title": "Any mathematicians or logicians here willing to shed some light on Godel's ontological argument?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iweg3/any_mathematicians_or_logicians_here_willing_to/",
        "text": "http://en.wikipedia.org/wiki/Gödel's_ontological_proof\n\nFrom my quick scan of the article, it seems that this proof is not about God that most people think about, but an abstract idea. It uses modal logic, which I am totally unfamiliar with (I don't really know anything from model theory or really too much about the very foundations of math, e.g. set theory beyond ZFC, recursion theory, forcing).\n\nI'm a 3rd year mathematics student and have a beginner grasp of mathematics (well all math undergraduates are only beginners, except geniuses). So I have some experience with mathematical language - but I've only got a bit of formal teaching on logic, and it's very, very introductory-level (only the parts of logic needed for basically most of math, like I know ZFC, proof methods, contraposition, etc.). Could someone ELI5 this argument (to something suitable for a math undergraduate or lower) if possible? Thanks.\n\nEdit:Thanks for the comments. I am going to ask relevant forums like the math stackexchange and /r/logic after I try to understand the system as much as I can (since they are stricter about questions I think). Leaving this here for people interested in logic, but the discussion is mostly closed here unless someone here can ~~ELI5~~ walk me through each statement in the symbolic system http://upload.wikimedia.org/math/a/b/4/ab47f643c7918fda58089c7f5129a183.png and comment on the properties of the system (how you would prove or disprove soundness and completeness).",
        "created_utc": 1412981497,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism gives you the right to do anything in life",
        "author": "DrakeX7",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iw6p9/atheism_gives_you_the_right_to_do_anything_in_life/",
        "text": "",
        "created_utc": 1412976818,
        "upvote_ratio": ""
    },
    {
        "title": "A wild Skepticon 7 Approaches, what would make it's Live Stream super effective?",
        "author": "Wolfshui",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ivnkq/a_wild_skepticon_7_approaches_what_would_make_its/",
        "text": "",
        "created_utc": 1412966331,
        "upvote_ratio": ""
    },
    {
        "title": "(For discussion) A muslim blogger on YouTube makes the claim that an atheist would find no moral issue if he were to drink his own fathers sperm.",
        "author": "NotQuiteEinstein",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iv9ud/for_discussion_a_muslim_blogger_on_youtube_makes/",
        "text": "Here is the link. https://www.youtube.com/watch?v=5Jx_7kkuJfI\n\nThis isn't satire, the guy is genuinely convinced there would be no reason not to. \nAre there any arguments he makes that you would consider valid, or at least thought provoking,  and how would you refute them?\n\nSide note; His dad has an impressive load.\n\n\nEdit: Somewhat trying to play devils advocate in some cases, I'm not actually so naive.\n\n I've seen arguments coming from the concept of social morals, but depending on what society you come from these social laws can somewhat have derived from religious doctrine.\nIt essentially comes down to being an act that fill most with disgust, but with permission is not an immoral act.\n\nEdit 2: Thanks for all the input, it was my first post so all responses were appreciated.\nI'm off to get putang. Or at least put some ground work in. Have a good night guys. \n\nCheers,\n(NotQuite)Einstein. \n",
        "created_utc": 1412958977,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a certain Hitchens video...",
        "author": "Heysoos_Christo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iuc55/looking_for_a_certain_hitchens_video/",
        "text": "",
        "created_utc": 1412933775,
        "upvote_ratio": ""
    },
    {
        "title": "What does it mean to be an 'Atheist?'",
        "author": "Heysoos_Christo",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iu0wu/what_does_it_mean_to_be_an_atheist/",
        "text": "I'm wondering what you guys think the generally accepted definition of 'atheist' is?  I've come across many people who claim to be 'atheist' but then give me different answers as one another.  What's the general consensus here?\n\nI identify myself as 'anti-theist' because in my eyes if a person claims to be an atheist they not only lack belief that deities exist, but take the position that there is absolutely no possibility for a deity to exist.  It seems to me like an all or nothing kind of thing.  Is there a middle ground?\n\nI'd also like to preface your responses by saying I have a degree in physics so I am pretty well-educated.",
        "created_utc": 1412921142,
        "upvote_ratio": ""
    },
    {
        "title": "Bringing up the fact that I am atheist to relatives. What is a good approach?",
        "author": "Lilkounchry",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2it5kz/bringing_up_the_fact_that_i_am_atheist_to/",
        "text": "Recently my grandmother turned 96 and I called her to wish her a happy birthday (she lives across state). Of course the topic of religion came up during conversation (she is Christian). This probably went on for a half an hour. She thinks I am also Christian. I barely talked during this conversation because I really didn't know what to say. I feel bad for misleading her and not owning up to who I actually am. But at the same time I don't want to tell her and I also have no idea how I would bring it up if I did. \n\nHas anyone had any similar experiences? ",
        "created_utc": 1412899617,
        "upvote_ratio": ""
    },
    {
        "title": "What arguments are there for Christianity?",
        "author": "CMaldoror",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2isxvl/what_arguments_are_there_for_christianity/",
        "text": "I feel like most debates about religion turn either towards utility of religion, or towards the rebuttal of anti-religious arguments.\n\nBut what arguments in favor of the truth of religion have you ever heard?\n\n(PS: I'm not saying they don't exist, but I'm saying you rarely encounter them, so it would be nice to discuss some of them)",
        "created_utc": 1412895052,
        "upvote_ratio": ""
    },
    {
        "title": "I need your help finding secular kitsch.",
        "author": "TenebrousTartaros",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2isp9l/i_need_your_help_finding_secular_kitsch/",
        "text": "",
        "created_utc": 1412890061,
        "upvote_ratio": ""
    },
    {
        "title": "What I like about /r/TrueAtheism",
        "author": "ZapMePlease",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2isp3j/what_i_like_about_rtrueatheism/",
        "text": "",
        "created_utc": 1412889966,
        "upvote_ratio": ""
    },
    {
        "title": "This is /r/FalseAtheism",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2is87g/this_is_rfalseatheism/",
        "text": "",
        "created_utc": 1412881011,
        "upvote_ratio": ""
    },
    {
        "title": "Question about justification of prayer",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2is3im/question_about_justification_of_prayer/",
        "text": "",
        "created_utc": 1412878524,
        "upvote_ratio": ""
    },
    {
        "title": "Id like to talk about miracles",
        "author": "Pidis",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2irfzs/id_like_to_talk_about_miracles/",
        "text": "Hey everyone, I want to talk about miracles for a second.I dont know if its common in other countries but in my country of Greece there are very often things like saint sightings, bleeding icons etc.People here literally believe in demons and possesion and what not so its not hard for them to believe when someone they know tells them they felt a strange breeze and they immediatly attribute that to being divine. I dont know what im getting at here, just kinda hoping for a general conversation",
        "created_utc": 1412865524,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations on historical John the Baptist (or other religious figures)?",
        "author": "ZhouLe",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2irfwf/recommendations_on_historical_john_the_baptist_or/",
        "text": "I'm interested in finding a scholarly, yet accessible analysis for the historical Yohanan \"John\" the Baptist and/or his cult of worship. Has anyone read any interesting books or articles they would recommend? What are your impressions of him?\n\n\nJosephus has quite a bit to say about him (relatively, at least), and implies that his execution was widely unpopular. Likewise, books I have read on the historical Jesus and early Christianity have mentioned a cult of worship around John that was contemporaneous and in conflict with the early church. It would be interesting to know what narrative John's followers ascribed to him. If you are a Jesus mythycist, does this also extend to John? If so, how do you explain his inclusion in the biblical narrative despite the theological problems he creates? If not, why do you feel the case for John is credible?\n\n\nSkeptical treatments of other religious figures besides Isho Natzrat \"Jesus of Nazareth\" would also be welcome (e.g. the prophet of Islam \"Muhammad\", Siddhartha Gautama \"The Buddha\"). Do you feel that studies of historical religious figures, opposed to how a religion chooses to present its history, is a worthwhile interest as an atheist? If you subscribe to the idea of a mythical Jesus, do you feel any claims of other religious figures have any shred of validity?\n\nEdit: Questions more explicit.",
        "created_utc": 1412865464,
        "upvote_ratio": ""
    },
    {
        "title": "Once people hear I'm an atheist, they instantly know everything about me",
        "author": "moduspwns",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ir848/once_people_hear_im_an_atheist_they_instantly/",
        "text": "My friend wrote what I think is a painfully accurate depiction of my interactions as an atheist and skeptic. Everyone here understands that atheism is not an ideology - just the rejection of a single proposition. \"John is an atheist\" tells me almost nothing about John, and yet to the rest of the world, it says John is untrustworthy, arrogant, caustic, \"mad at God,\" and on and on. \n\nI recommend his post, which I'll link below for those interested, and I'd love to hear how your experiences have varied and (hopefully!) differed from his. From the post:\n\n\"Most people elect [...] to use tried and true clairvoyant quips: “you’ve changed before, you’ll change again,” as though admitting I was wrong and adjusting accordingly were a bad thing. This, however, successfully classifies me as capricious above all else, mainly as a way to be ignored (who listens to someone who constantly changes?). Other sentences begin, “You never used to…” – an orthodox assessment of my present savagery.\"\n\nhttp://theplantlet.com/2014/10/08/like-a-book/",
        "created_utc": 1412860417,
        "upvote_ratio": ""
    },
    {
        "title": "I'd like to invite you guys to take a look at Pantheism.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iqvcp/id_like_to_invite_you_guys_to_take_a_look_at/",
        "text": "**Firstly I have to say that in no way am I trying to recruit anyone into anything.** I'm simply putting a spotlight on a philosophy that I think many of you might enjoy. I personally grew up as a Catholic, converted to atheism/agnosticism in my teens, and then comfortably settled on Pantheism in my 20's. Some of you may already be Pantheists without even realizing it.\n\n*What is Pantheism?* That's a bit of a complicated question. Richard Dawkins simply calls it \"sexed-up atheism\". But I tend to sympathize more with a counter argument that I once read that said \"pantheism isn't sexed up atheism, atheism is just pantheism for prudes!\". Joking aside, although Pantheism is certainly an umbrella term and views can vary wildly, I think there are a few recurring themes that most people who calls themselves pantheists subscribe to:\n\n1. We live in a monist universe. I.e. there is either only physical matter **OR** minds and ideas floating in ether **but not both** (dualism is false)\n\n2. The human ego is pretty much an illusion formed through evolution. I.e. we are not a separate object confronting an alien universe. We are part of the universe and therefore *we are the universe*.\n\n3. This universe that we are a part of is **really fucking awesome**. We look at it through our human lens with awe and reverence. In fact, *the universe evokes similar emotions in us as God would evoke in tradition theists.* This is why you may sometime hear a Pantheist say that the universe *is* God. Don't be fooled though, they are never talking about an anthropomorphic God.\n\n4. Science is pretty much the best tool we have to stake a claim to knowledge and we use this for the basis for our spirituality. This also means that as science reveals new information, Pantheism may change/evolve.\n\n5. Nature on earth is also pretty fucking great and is essentially our own paradise. So you know, we shouldn't like destroy it and shit.\n\nIs Pantheism a religion? That's debatable. If by religion you mean includes an anthropomorphic God in it's doctrine then hell no. But if you instead mean a metaphysical and ethical philosophy that gives you a sense of **belonging** in the universe, will sometimes makes you laugh out loud when you think about death, and gives you great comfort in feeling that no matter how shitty things may seem on earth everything is going to be okay... then, yes, consider me a religious fanatic.\n\nI often find that people don't realize many famous intellectuals have held strong pantheistic ideals and make for good reads on the idea including Einstein, Bruno, Spinoza, Hegel, Beethoven, Whitman, RW Emerson, Jung, and Watts. And on that topic, if anyone is interested, I think that so far my favourite reading on Pantheism is Watts' book called *The Book: On The Taboo Against Knowing Who You Are*. It's a short, clever, and entertaining read. He also has some pretty good audio lectures. Sam Harris also has a new book out called Waking Up: A Guide to Spirituality Without Religion.\n\nAnyway I hope I'll have helped at least one person discover what I feel is a very logical, existential, and fulfilling philosophy.\n\nEdit: People seem to be focusing on the word God. Fuck that word. I couldn't care less about labelling the universe as God or not. The point is that we view the universe with reverence, awe, and possibly even a sense of sacredness. It's about defining the emotions that are evoked from the science describing the universe and aligning yourself with the ethics that follow from this, and then being part of a community that feels the same way. This could be contrasted with feelings of loneliness, emptiness, and sorrow that the exact same science may evoke in someone else. ",
        "created_utc": 1412848204,
        "upvote_ratio": ""
    },
    {
        "title": "An Anecdotal Religious Claim I Heard",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iqmki/an_anecdotal_religious_claim_i_heard/",
        "text": "So, a couple weeks back, I had an interesting conversation with a couple of Christians, and they told me some of their religious experiences. Some of their experiences could be easily explainable, but there a couple of stories that weren't as easy to explain.\n\nFor example, in one story a guy told me that while he was at a check-out line at a grocery store, a woman came up to him and asked him something along the lines of, \"keep looking, you'll find what you're looking for\". He said he asked her how she knew, but I don't remember the response that was given.\n\nAnother one was from another guy who said that he needed money to pay for college classes. Of course, he prayed, and out of nowhere, he got a grant to pay for the classes. He said he never told anyone about his financial issues, and as he pointed out, people don't usually get college grants for no reason. Admittedly, I found much more interesting. Although, I'm a little skeptical of this guy, considering the he said that he once had a headache that was the result of demon attempting to crush his head (his sister saw the demon, according to his story).\n\nI feel like there is something fishy about these stories. I don't think they're lying, although there might be a huge amount of confirmation bias clouding their stories. I'm curious to see what you guys think about these two stories. ",
        "created_utc": 1412837803,
        "upvote_ratio": ""
    },
    {
        "title": "When critiquing Islam, focus on secularism",
        "author": "Smallpaul",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iq12z/when_critiquing_islam_focus_on_secularism/",
        "text": "Given all of the brouhaha about Bill Maher, Sam Harris, Reza Aslan and Ben Affleck, I thought that [this essay](http://www.steveahlquist.com/2014/10/when-critiquing-islam-focus-on.html) by Steve Ahlquist deserved consideration.\n\nIt explains how to avoid generalizations and focus on the real goal of protecting human rights.\n\nThis actually raises a question: do atheists here agree that protecting human rights is a more important goal rather than just disparaging religions?",
        "created_utc": 1412821196,
        "upvote_ratio": ""
    },
    {
        "title": "For my school this weekend, there's this thing called 'Decorate Downtown,' where we go downtown and do things like chalking and window painting, I was wondering if I could get some help coming up with ideas for chalking!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ipavl/for_my_school_this_weekend_theres_this_thing/",
        "text": "",
        "created_utc": 1412805627,
        "upvote_ratio": ""
    },
    {
        "title": "Do you believe in objective morality?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ip50h/do_you_believe_in_objective_morality/",
        "text": "Is morality subjective or is it set in stone?",
        "created_utc": 1412802455,
        "upvote_ratio": ""
    },
    {
        "title": "Despicable the way some Christians brainwash their children.",
        "author": "anthonynlee",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ip3vl/despicable_the_way_some_christians_brainwash/",
        "text": "I ran across this blog because I am writing for a church website at work and it really bugged me. In the post, she seems to speak of patience and tolerance because she cannot shield her child from doubt...but admits to penning scriptures and taping them to the bathroom wall, along with performing many prayers and other indoctrinating teachings. I am completely tolerant of religious beliefs but have a difficult time accepting when it is forced onto very impressionable young minds.\nhttp://www.aholyexperience.com/2014/10/what-to-do-when-your-kids-dont-believe/",
        "created_utc": 1412801864,
        "upvote_ratio": ""
    },
    {
        "title": "How do you explain how something came from nothing? &amp; What is your biggest objection to Christianity? Why?",
        "author": "Robins9",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iohg7/how_do_you_explain_how_something_came_from/",
        "text": "My Christian apologetics class at school has been discussing some of these topics and I have been asked to seek input. Here are the more specific questions:\n\nIf you do not believe in God, how do you explain how something came from nothing? In other words, how did the universe come into being if it was not created?\n\nIf you are not a Christian, what is your biggest objection to Christianity? Why?\n\nI look forward to everyone's responses and feel free to answer either or both questions. Thankyou for your input!\n\nEDIT: Hello everyone, I will definitely look at the other forum, I had another question that I wanted some clarification on:\n\nHow do you explain the connection between mind/conscience/spirit and matter (how did conscience come to be if matter was all there was/is at the beginning)? - I myself may not have a very good explanation either but was wondering if anyone had any input as to what they think\n\nEDIT: Also, there's no way that I'll be able to answer everyone. This is the first time I have ever posted something in a forum and I have enjoyed discussing these topics. Thank you all for your replies; they're all quite good and informative but I just don't have the time to answer everything.",
        "created_utc": 1412790395,
        "upvote_ratio": ""
    },
    {
        "title": "Something different: The Egg story",
        "author": "SsurebreC",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2inof4/something_different_the_egg_story/",
        "text": "Has anyone ever read [\"The Egg\"](http://www.galactanet.com/oneoff/theegg_mod.html)? A friend of mine just posted a link to it and it's an awesome story. It puts a different slant on reality - what does everyone think?\n\nThe Egg is a short story about a person dying and having a chat with their father, God. Turns out, the father is trying to raise you right and he does this by reincarnating you as every human being who ever lived, so you experience being good, bad, and everywhere in between so you can truly know what it's like to experience everything.\n\n\n**Edit**\n\nMod asked me to clarify. The interesting part of this story is that there is a popular view in the atheist community that \"we are star stuff\". The more spiritual (not religious) component is that we are the universe trying to figure itself out.\n\nWithout going into anything supernatural about us actually reincarnating, this is an interesting view of humanity. Perhaps we are, as a collective conscience, trying to figure out reality. Not that we all are literally one but that we, as a species, have only one purpose - to learn about reality and ourselves and to, hopefully, become better as we mature.",
        "created_utc": 1412774220,
        "upvote_ratio": ""
    },
    {
        "title": "Had a mental breakdown because of my dad. Needed to get this out.(a little long)",
        "author": "throwawwayy0147",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2imybp/had_a_mental_breakdown_because_of_my_dad_needed/",
        "text": "",
        "created_utc": 1412748443,
        "upvote_ratio": ""
    },
    {
        "title": "Bill Maher, Ben Afflect, and the failure of liberals to criticize violations of human rights in other cultures.",
        "author": "Kosmozoan",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2imvrq/bill_maher_ben_afflect_and_the_failure_of/",
        "text": "",
        "created_utc": 1412746218,
        "upvote_ratio": ""
    },
    {
        "title": "Bill Maher, Ben Afflect, and the failure of liberals to criticize violations of human rights in other cultures. http://www.thedailybeast.com/articles/2014/10/05/bill-maher-1-ben-affleck-0.html",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2imvp9/bill_maher_ben_afflect_and_the_failure_of/",
        "text": "",
        "created_utc": 1412746151,
        "upvote_ratio": ""
    },
    {
        "title": "Banging my head against the wall. Cenk from TYT siding with Ben Affleck?",
        "author": "MrRykler",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2il671/banging_my_head_against_the_wall_cenk_from_tyt/",
        "text": "[Link](https://www.youtube.com/watch?v=EN52CP2_F0U)\n\nI am so confused by this. How did he fall for this? He even shows a clip of Sam saying \"any criticism of islam is treated as bigotry\" and Cenk then goes on to side with Affleck? Am I missing something? Are there tons of atheists out there like this, that are Islam apologists? What are some of the views in this sub?",
        "created_utc": 1412710207,
        "upvote_ratio": ""
    },
    {
        "title": "Moment Magazine's Rabbis on Science and Religion: A Refutation",
        "author": "Mainstay17",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ik2td/moment_magazines_rabbis_on_science_and_religion_a/",
        "text": "Last night I posted [this](http://redd.it/2iimjq) to the subreddit. Long story short, I sent my biology teacher an article about the implications of science conflicting with religion, and he sent me this back about why it doesn't actually conflict (with Judaism, at least).\n\nSince some people thought I should post my findings, I will do so.\n\n---\n\n**Rabbi Gershon Winkler - Independent**\n\n&gt;Nowhere, for instance, does the Torah indicate that the Universe was created in six 24-hour days\n\nHere we've got the [Day-Age Theory,](http://rationalwiki.org/wiki/Day-age_creationism) though calling it a theory is dubious. Basically that the six days of creation were not conventional 24-hour days, but possibly years or millennia. Of course, the Old Testament uses the same word to mean day in most other places here - יום - and there's absolutely no literary or linguistic evidence to suggest that this reading is valid. But even if one assumed it was valid, the creation story still doesn't make sense. The heavenly bodies are created *after* the earth, land animals are created *after* birds, etcetera. There'll be some more of this later on.\n\n&gt;The 13th-century Rabbi Yitzchak of Acco theorized the age of the universe to be around 14 billion years\n\nThis is really just a form of the common attempts to say things like \"The Greeks had the cure for AIDS\" or that \"The Library of Alexandria had papers about special relativity,\" basically claiming scientific anachronisms.\n\nWhile 14 billion years is remarkably close, I can't find a document of the source he gives (*Shoshan Yesod Olam*), so I can't substantiate this. But we do know that in the 13th century it would have been impossible to have the same equipment we do today, so Rabbi Yitzchak probably derived this (if at all) through some dubious method of study or reasoning.\n\n&gt;The ancient rabbis also describe the universe as originating with god's light, which condensed to form matter. Or, as Einstein would put it millennia later, e=mc^2\n\nAgain, more of the scientific anachronism claims we just saw. E=mc^2 discusses the relationship between mass and energy, i.e. *not the origin of matter.* That would be closer to quantum mechanics, which I don't understand and I'm fairly certain this writer doesn't understand either. As for \"god's light condensing to form matter,\" if this was given after Aristotelean ideas were in vogue, this is a relatively reasonable line of thought to reconcile then-modern science with the Torah. However, like Aristotle, this will and mostly has already become obsolete.\n\n&gt;It is not science but scientism that is in conflict with religion\n\nThe strawman is real. He's not even attempting to hide the fact that he's making one. No reputable scientist, I'd argue, has faith in what they do as to call it *scientism.* One doesn't have faith in evolution, or carbon dating. They *understand why it works or why it is proven.* The writer quotes Prof. Robert Jastrow, former director of NASA's Goddard Institute. I've looked at some of Jastrow's writings. I haven't been able to date most of them, but he seems to believe that the Big Bang is a dead-end for science and scientific explanations. Which seems like a pretty bad view to hold considering the presumed \"dead-ends\" which modern science has since surpassed. The indivisibility of the atom comes to mind.\n\n&gt; (Last paragraph, Jastrow quote)\n\nPretty much just a jab at thinking scientists disguised as one against scientism.\n\n---\n\nWow, that ended up being a lot larger than I thought. There are eight more sections, some longer than this one. I'm going to break this up into installments.\n\n---\n\nSo, thoughts on this? Corrections and supports are equally welcome.",
        "created_utc": 1412688510,
        "upvote_ratio": ""
    },
    {
        "title": "I am interested in the ratio of religious fundamentalists to moderates, and the distribution of radicalism within a religious population. Does anyone have any a statistics / poll results on this subject?",
        "author": "LordMonichromicorn",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ijxpi/i_am_interested_in_the_ratio_of_religious/",
        "text": "Here is an example of the type of thing I am looking for:\nhttp://www.pewglobal.org/2014/07/01/concerns-about-islamic-extremism-on-the-rise-in-middle-east/#utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=increasing-concerns-about-extremism-in-the-middle-east",
        "created_utc": 1412685155,
        "upvote_ratio": ""
    },
    {
        "title": "My interview with Matt Dillahunty",
        "author": "tpbeasley",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ij7gs/my_interview_with_matt_dillahunty/",
        "text": "I interviewed Matt Dillahunty recently and talked about deconversion and atheism in general.  Take a look if you are interested.  Also, what do you guys think about deconversion?  (1) is it a goal we should have, especially in light of general public opinion and (2) what is your preferred method to try to deconvert people?  Personally I think one of the best things to do is just be a good person and let people know your opinions.  This way people realize atheists aren't bad and may start wondering about the topic.  Of course, I think that lots of different methods work.\n\nhttp://anamericanatheist.org/2014/10/06/matt-dillahunty/",
        "created_utc": 1412662091,
        "upvote_ratio": ""
    },
    {
        "title": "If you believe that \"God works in mysterious ways\", then you've given up everything",
        "author": "regypt",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ij758/if_you_believe_that_god_works_in_mysterious_ways/",
        "text": "This is something I can't stop thinking about. It absolutely destroys the biblical god for me, and I need to write it down somewhere to discuss it.\n\nSo there's the classic joke about God's PR guy being the best. If something good happens it's because \"God is good\", if something bad happens then \"God works in mysterious ways\".\n\nThis is alluded to in the Bible quite a bit. Isaiah 55:9 sums up God's thoughts nicely\n&gt;For as the heavens are higher than the earth, so are my ways higher than your ways and my thoughts than your thoughts\n\nI posit that **if you believe this, then you've given up any claim to any knowledge about anything.**\n\nIf God's ways are truly higher than ours and us trying to understand him is like an ant trying to understand a human (\"yeah? well if humans so great whycome they don't communicate with pheromones like we do?\"), then how can we know anything? God doesn't get to only be mysterious and unknowable when bad stuff happens, he's mysterious and unknowable all the time. If God is unknowable for the bad stuff, he also must be unknowable for the good stuff. It's like a logical OR problem. If God is unknowable for one kind of thing, that makes him unknowable for all things.\n\nYou might think that God curing your cancer was a great blessing, but what if he only did that so that you could get killed by a car a few years later? Or maybe you don't get killed by cancer or a car, but he saved you only so you could see your child grow up and get hit by a car. Maybe even a car that you drove. Why? Who knows! God works in mysterious ways!\n\nYou might think you know the Bible and it's divine inspiration, but how do you know? Higher-thinking God might have made it all up. He might have made the wrong bible and distributed it globally as a test. Maybe the truest bits of the Bible were cut out in the Council of Nicea, and God made sure that it would happen that way. Maybe God never inspired a bible at all and is just letting us think he did. Why? Who knows! God works in mysterious ways!\n\nWas Jesus the savior? Says who? God? Dude works in mysterious ways, remember? Jesus might was well be Satan, or Stan, or a golem, or a breadbox. The first and second coming could all be part of an elaborate trick on humanity. Or there might be no trick and Jesus was a weird ascetic just because. Why? Who knows! God works in mysterious ways!\n\nIs God love? Benevolent? Just? Perfect? Not an ass? Says who? God could be a trickster god. He might just love pranks. Existence could be his greatest one yet. God could be one of many deities, spinning up pet universes for fun when he's bored. Why? Who knows! God works in mysterious ways!\n\nTrying to suss out a rhyme or reason to the why of anything relating to God is absolutely futile if his ways are so much higher than our ways that we couldn't possibly comprehend them. This make knowing anything about anything impossible.\n\nWhat say you?\n\nedit: i shouldn't say it destroys theism for me, it just destroys the notion that you can know the biblical god who has described in his own words that his ways are higher than our ways.",
        "created_utc": 1412661856,
        "upvote_ratio": ""
    },
    {
        "title": "The basis of morality. It's not a tough question at all, imho, and I wonder why theists are mired in it",
        "author": "ZapMePlease",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iit0z/the_basis_of_morality_its_not_a_tough_question_at/",
        "text": "A couple of years ago I watched a discussion between Shelley Kagan - a philospher, and William Lane Craig.  It's a few years old now.  In retrospect I think it helped to give me a foundation upon which I could rest the morality that I knew I already had.\n\nI've watched a lot of theism debates.  This one, though, spoke to me more than most.  Kagan had a description of morality which I've heard variations of before but he described it so simply and honestly that I'm surprised I've not heard it used much more.\n\nHis assertion is that morality is a social contract.  It's a contract that would be made by all rational parties all acting rationally.  The contract, of course, is made behind the veil of ignorance and -  importantly - it applies to you, as a member of that society, whether you subscribe to it or not.  \n\nI consider it the way I would consider any contract between parties. Kagan doesn't add this - this is my extrapolation - I feel that this contract has stipulations - costs, as it were, for breach of any of the terms.   The cost could be financial - for example being fined for libel - or loss of freedom - incarceration - for more serious crimes.  It could even range all the way up to the loss of your own life for serious breaches of your duties under the social contract.\n\nI thought that this view of morality was rather poignant.  It withstands the theistic attacks claiming that atheists suffer from moral relativism.  It explains much of our social behavior in that the contract, much like the legal system, has been refined and improved as humanity has evolved and learned. \n\nJust thought I'd toss this out there.  I'm sure there's some reason why this model isn't used more often.  There's lots of people a whole lot smarter than me that would have made this their *go to* model if it was as good as I feel it is.  If you get a chance, watch the video on Youtube.  Watching Kagan dismantle Craig while wearing running shoes is great and Kagan has some, imho, brilliant points - particularly in response to Craig's 'if the world is going to end in the heat death of the universe then why does it matter if you torture someone to death' nonsense.",
        "created_utc": 1412652553,
        "upvote_ratio": ""
    },
    {
        "title": "Sent my biology teacher an article about the implications of evolution conflicting with religion, this is what he sent back.",
        "author": "Mainstay17",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iimjq/sent_my_biology_teacher_an_article_about_the/",
        "text": "*Background information: I go to a Jewish but non-denominational high school. The student body is generally not very religious, though the faculty is more so.*\n\nSo my dad showed me this article in the New York Times **([link](http://www.nytimes.com/2014/09/28/opinion/sunday/god-darwin-and-my-college-biology-class.html?_r=0)),** which discusses how not only does evolution conflict with religion, but examines the reasons why this is marginalized. Basically, it opens up lots more issues such as determinism - we were shaped by an evolutionary process with no 'sentient' input - and randomness - for the same reason. The article's not too long; I'd advise you to read it.\n\nI showed this to my biology teacher the next day, and soon enough he replied with something of his own. He told me that he disagreed with the article's viewpoint, primarily claiming that there were no conflicts between science and Judaism. To support his point, he sent me this article from Moment Magazine: **[link.](http://imgur.com/a/C3bAC)**\n\nThe article presents viewpoints from Jewish rabbis of several denominations, including independent and humanistic. The vast majority, predictably, fall prey to fallacies or falsehoods common in this line of conflict. There is one voice of reason - Rabbi Yitz Greenberg, who is listed as Modern Orthodox. He mentions biblical criticism (modern views of the bible, mainly centered around looking at it as a patchwork of sources from various Judaic mythologies), which he has been involved in promoting for some time. I have met him on a few occasions in connection to this, and he is actually a very levelheaded and reasonable person.\n\nI have already spent some time on my own identifying problems with the statements of the others in the article, and I will not list all of them here for I do not have the time. But I thought this might be of interest to /r/trueatheism. At the very least, it provides a window into Jewish thought on reconciling - or not reconciling - science and religion.",
        "created_utc": 1412648891,
        "upvote_ratio": ""
    },
    {
        "title": "Questions for Atheists from a Christian.",
        "author": "jansenmurphy",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iiexs/questions_for_atheists_from_a_christian/",
        "text": "I go to a classical Christian school and I am taking a class on apologetics.  My teacher and I want to hear from you guys across the web on these questions.\n1. What's your biggest objection to Christianity?\n2. Is there more to life than we can see or observe directly?\n3. Where does a non-Christian get their moral foundation/base from?\n4. What is the origin of the universe/ What is the origin of the big bang?  \nSorry if this post breaks any rules. I'm new.\n\nEdit: This is probably too late to help but, Question 2 was supposed to deal primarily with the soul and supernatural.\nSeveral responses to question 3 lead me to ask \"\nCan Atheists with a culturally determined morality say that people are definitively good or bad? Aren't people bad or good relative to the culture's standards?  How can you make judgements against people of other cultures with different moralities.\nQuestion 4 seems to be leading nowhere.",
        "created_utc": 1412645066,
        "upvote_ratio": ""
    },
    {
        "title": "TIFU by not lying to my elderly mother-in-law.",
        "author": "follier",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2igkw3/tifu_by_not_lying_to_my_elderly_motherinlaw/",
        "text": "There are times when a lie is, if not a 'good' thing, a necessary thing.  But when you're blind-sided by a direct question .. well... I was caught off guard.  I accidentally told the truth.  \n\nWe were driving home from a long day and all were tired.  My mind was focused on driving in shitty Sunday Chicago traffic.  My mind was not on the heated conversation between my wife and her mother, as it was in Portuguese.  I heard the word for bible, and satan, and the usual.  \n\nMy MIL is not educated.  She is a very sweet person, but she is from a very poor background.  She only started to learn to read a few months ago - for the purposes of reading the bible, of course.  \n\nShe has, all her life, understood very little about the world.  But the only thing that makes any sense to her is that Jesus died for her, and Satan is the cause of all misery, and the Bible is the source of all truth in the universe.  God created everything, in his glory, Amen.  Etc.  \n\nShe is not my mother, she is my house guest.  I treat her with kindness and respect at all times.  My wife is her daughter though, and she lambastes her mother and sisters all the time - \"Everything good is God.  Everything bad is Demons.  NO ONE TAKES RESPONSIBILITY FOR FUCKING NOTHING.\"  Diplomacy is not her strong suit.  She just wants her nieces and nephews to have an education and to rise out of poverty and ignorance like she did.  She's frustrated, I get it.  \n\nBack to me.  I'm the kind one, the gentle one, the patient one.  No matter how much they fight, her mom can come to me and complain in my ear (I only understand 40% of it or so anyway) and we have a nice cup of cevada together.  \n\nBut then, whatever was the conversation, I gather it ended something like this -- \"Oh you like my husband?  He's so godly and kind? You know he's not a Christian, right?\"  I have no idea, but she asked me pointe blank, if I believe that the bible is true and Jesus is God.   \n\nMy Portuguese was not good enough to nuance or sugar-coat my answer, and I was so taken aback by the directness that I had no time to answer around the question.  So I just said 'No, I have no belief in that.'  \n\nNo, this poor woman who lives in my home is desperate to leave.  She has plane tickets back home for December but we're trying to move them up.  She's living a nightmare - like a horror movie, surrounded by the demons she's worked her whole life to escape from.  And the most devious of them is the gentle man who tricked her into trusting him, and then revealed himself as an agent of Satan.\n\nI feel like shit.  The poor woman.  I should have just bald-faced lied \"of course I believe! What has my wife been telling you??\"  \n\n----\n\n\\-edit:  Thanks everyone for helping me sort this out in my head before I sort it out at home.  Everyone is calmer now.  MIL has realized, I think, that we will not impede her in practicing her faith (obviously).  She has things on the tip of her tongue  - the usual \"So _that's_ why you don't go to church! and \"What happened to you that you hate God?\"  She hints around, but doesn't ask outright, yet.   I welcome her questions now I guess. Cat's out of the bag.  \n\nShe is still planning on going home early, but that's OK in any case - an elderly Brazilian in a Chicago winter?  Probably not a good idea.  ",
        "created_utc": 1412613114,
        "upvote_ratio": ""
    },
    {
        "title": "My friend uses atheism as a way to troll.",
        "author": "hell_idk",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ig8ou/my_friend_uses_atheism_as_a_way_to_troll/",
        "text": "Yeah, thats pretty much it. I think he is just a bitter human being and secretly hates me or some shit like that. Anytime he gets into an argument  about ANYTHING and starts to lose(which is alot, this is the kind of guy who thinks he knows everything but in reality doesnt know shit) He uses the the old ad hominem and start attacking peoples looks,characteristics and religion. This shit bugs the hell out of me. I know actual Atheists most likely don't do this to people. As well as most Atheists are normally deep thinkers and like to know what the fuck they are talking about. I feel like this guy is making atheists look like asshole trolls everywhere he goes. Is there anything i can like tell him that will make him stop being such a fucking tool? ",
        "created_utc": 1412606446,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking Advice on Being President of a College Atheism Club",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ifbdz/seeking_advice_on_being_president_of_a_college/",
        "text": "",
        "created_utc": 1412575391,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best English translation of the Qur'an? Is there a \"family bible\" type of Qur'an with explanations and additional information?",
        "author": "canyonbailer",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ielya/what_is_the_best_english_translation_of_the_quran/",
        "text": "",
        "created_utc": 1412557757,
        "upvote_ratio": ""
    },
    {
        "title": "Since today is the closing day of LDS General Conference (where top Mormon leadership talks to the entire world congregation), does anyone wanna talk about Mormon stuff in general? Former Mormon believer, still on church records. Lazy half-assed AMA.",
        "author": "AnotherClosetAtheist",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ie0ex/since_today_is_the_closing_day_of_lds_general/",
        "text": "Born to Mormon parents in the mainstream version. 34 years old. Was a missionary. Married in the temple, got the t-shirt to prove it. Kids. Stopped believing 7-8 years ago. Wife about the same timeframe. Still faking belief because of crazy social/family pressure. \n\nAsk anything about Mormonism, or of my own personal experience. Or make your own comment chain of your own knowledge. Whatever floats your boat.",
        "created_utc": 1412544402,
        "upvote_ratio": ""
    },
    {
        "title": "What is a religious moderate?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2idtrt/what_is_a_religious_moderate/",
        "text": "I don't get it anymore.\n\nIs it someone who just admits to not taking their own religion seriously while overlooking the dissonance of having to face the fact they truly don't believe in their religion? ",
        "created_utc": 1412540493,
        "upvote_ratio": ""
    },
    {
        "title": "Debate between Reza Aslan vs. Sam Harris - May 27, 2012 [1:29:59]",
        "author": "DoKtor__K",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2idmz6/debate_between_reza_aslan_vs_sam_harris_may_27/",
        "text": "",
        "created_utc": 1412536393,
        "upvote_ratio": ""
    },
    {
        "title": "Why are people so drawn to Reza Aslan? All I hear is a double-speaking charlatan who takes advantage of speaking calmly and smiling a lot...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2icwqq/why_are_people_so_drawn_to_reza_aslan_all_i_hear/",
        "text": "I mean seriously.\n\nHe's a muslim...who wrote a recent book about christianity (clearly with a innately different view) saying that jesus is really to be interpreted differently...WELL YEAH! You're a muslim Reza. \n\nHe's like a parody intellectual parading around academic circles pretending to have nuanced and informative views about ludicrous concepts that always end up justifying whatever thesis he wants to assert.\n\nI understand that the Levant/Mid East has tons of problems that aren't all sourced back to religion and religion is often used as a cover...however, when ISIS/L comes forward and claims to be a religious group and movement, why can't we take them at their word? He loves pointing out how people generalize islam while ignoring that fundamentalists/extremists are the best representations of religious adherence to the faith. \n\nHe's an apologist and a deeply subversive one IMO. \n\nI don't think its possible to truly ignore how contradictory he is and keep proclaiming Aslan as some enlightened individual. He's not. He selectively picks which view of the faith he wants to defend and calls any criticism of himself out as bigotry. Its insane. ",
        "created_utc": 1412519235,
        "upvote_ratio": ""
    },
    {
        "title": "Telling my family the truth versus keeping them in the dark.",
        "author": "Rolandcoldthron",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ica22/telling_my_family_the_truth_versus_keeping_them/",
        "text": "",
        "created_utc": 1412491592,
        "upvote_ratio": ""
    },
    {
        "title": "A-new-city-A-new-view",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ic88k/anewcityanewview/",
        "text": "",
        "created_utc": 1412489562,
        "upvote_ratio": ""
    },
    {
        "title": "As an atheist Genesis is pretty kick ass",
        "author": "KittyMulcher",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ibzw9/as_an_atheist_genesis_is_pretty_kick_ass/",
        "text": "",
        "created_utc": 1412482053,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone ever used statistics to study whether prayer works?",
        "author": "Roshakim",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2ibz44/has_anyone_ever_used_statistics_to_study_whether/",
        "text": "I was having this discussion with my wife tonight. We are both engineers. She is religious and I am not. She prays and believes that she has benefited from it positively. IE God took some sort of direct action that had a positive benefit on her due to her faithful prayers. I am agnostic, and have seen zero evidence that prayer works and thus my conclusion is that if there is a God, God generally doesn't answer prayers.\n\nAfter discussing the idea with her, she agreed that the results of the study would be really interesting.\n\nSo has anyone ever done a study like this? I suspect it would be difficult to try to control the variables of the study to exclude outside factors that could affect the results.\n\nMy simple analysis from tonight's discussion is:\n\n- First do a study among those who pray, and find out which of their requests they feel God has answered. I suspect it is something along the lines of \"keep us safe\". So lets go with that.\n\n- Next find two groups of people. Group A is your devout, faithful people who pray. Group B is your non-religious, non-prayers. Control for education, income levels, drinking, smoking, and possibly some other factors - so that both groups are equal in these regards so that the only thing that should matter is praying vs not praying.\n\nYou need maybe 1000 - 5000 people in each group. Then track their \"safety\" over the course of some time period. A year should be sufficient, though 6 months might even be good enough. Then compare the data to see if praying for God to keep you safe from harm has any actual effect.\n\nHas this been done? If so, I'd love to see the results.\n",
        "created_utc": 1412481463,
        "upvote_ratio": ""
    },
    {
        "title": "South Africa's first open mosque damaged due to suspected arson attack.",
        "author": "burnza_",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iamxp/south_africas_first_open_mosque_damaged_due_to/",
        "text": "http://mg.co.za/article/2014-10-04-police-suspect-arson-at-gay-friendly-mosque\n\nAs an atheist, I personally think that an open mosque, where people of all race, gender, and sexual orientation are allowed in, is a great idea. According to the founder of this particular mosque, even woman are allowed to lead prayer sessions, and they will be able to pray side-by-side with males.\n\nIt is true that the article does not specify other muslims damaged the mosque, but there are plenty of mosques around Cape Town and I haven't heard any of those \"traditional\" mosques coming under attack. (I live very close to one)\n\nFor once, there's some \"reform\" within Islam. Unfortunately this is too radical for certain groups of muslims in Cape Town.\n\nEdit:\nDiscussion points: Progressive Religion. Formation of \"happy-clappy\" mosques?",
        "created_utc": 1412448034,
        "upvote_ratio": ""
    },
    {
        "title": "Accidentally admitted to not believing in god :|",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iaijr/accidentally_admitted_to_not_believing_in_god/",
        "text": "",
        "created_utc": 1412445397,
        "upvote_ratio": ""
    },
    {
        "title": "Analytic Philosophy and Atheism",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TrueAtheism/comments/2iagbt/analytic_philosophy_and_atheism/",
        "text": "",
        "created_utc": 1412444023,
        "upvote_ratio": ""
    }
]