[
    {
        "title": "Question about Ivan's Childhood",
        "author": "Seandouglasmcardle",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8edoir/question_about_ivans_childhood/",
        "text": "I watched Ivan's Childhood last night and enjoyed it for the most part. I thought that the movie to be beautifully crafted, with fantastic cinematography from Vadim Yusov and exquisite editing by Lyudmila Feiginova. \n\nBut I am confused as to the purpose of the subplot of female nurse Masha and Captain Kholin. There is very little setup, backstory, or payoff. \n\nAnd as for the classic kiss over the trench scene, yes, it was beautifully shot, but what is it's purpose? Its not the epic romantic scene we've been sold. She is actively rebuking his advances, and he assaults her, and forces her to kiss him or be dropped into the trench. And then he subsequently sends her away.\n\n The movie doesn't comment on it any further, and the pan down into the trench, while being a really cool shot, really doesn't seem to have any meaning [beyond looking cool.](https://www.youtube.com/watch?v=1plWZqqVbr0&amp;t=2s)\n\nPerhaps it can be written off as Tarkovsky's first film, and he was more concerned with showing off rather than telling a story with images and camera moves that served a purpose. Or perhaps I'm missing something. ",
        "created_utc": 1524507823,
        "upvote_ratio": ""
    },
    {
        "title": "If you could take a character from one film and put them in another, which would you choose?",
        "author": "Radu47",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ed9bf/if_you_could_take_a_character_from_one_film_and/",
        "text": "[removed]",
        "created_utc": 1524504659,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (April 23, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ebr7p/casual_discussion_thread_april_23_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/)\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1524492829,
        "upvote_ratio": ""
    },
    {
        "title": "Why are some David Lynch films are selectively affect me? [A strange personal case]",
        "author": "sensual_onlooker",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ebf5s/why_are_some_david_lynch_films_are_selectively/",
        "text": "David lynch is one of the greatest surrealist directors of our time. I found a strange personal phenomenon about his oeuvre which I would like to share with this great community. Some films of him deeply affects my emotions- like Mulholland Drive, TP:Return, Eraserhead, Lost highway. While, some of his films didn't affect me at all: like Blue velvet, TPFWM, Inland Empire. \n\nThe same applies to his other form of visual arts he produced like his shorts and paintings. Some of its affects me, some of its moves me nothing. \n\nThe one possible conclusion I can deduce from the list of his films failed to connect with me is: They are deeply American . Since I am a non-american, to understand those films I need to learn the culture of Americanism. \n\nSo, I studied about American media and their culture. I researched about their shifting political idealogy and panaromic artistic trends etc.. After such extensive study, I prepared to watch blue velvet movie. Hell yeah! It hits me right at the place he wanted to be. But somehow I still struggling to develop taste for his epitome work: Inland Empire.\n\nBut strangely this is not the case for most of the American directors and other directors from different cultures to me. I tend to experience their films without affected by my observer stance.\n\nSo, I'm really baffled now to the question: why does other films of him affected me immediately? Is those films are not true to the American culture or it is conceptually universal?\n\nThis leads to me greater dilemma then I thought before:  Is it better to be a observer while consuming arts or pour your subjectiveness in the canvas along with the artist? Observe the medium or make your self as the medium? I think I'm entering into grey area of phenomenology and aesthetics. Hope this sub helps me to catch what's happening :D",
        "created_utc": 1524489924,
        "upvote_ratio": ""
    },
    {
        "title": "Avant-garde cinema",
        "author": "astuoniketuri",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8eb9dt/avantgarde_cinema/",
        "text": "[removed]",
        "created_utc": 1524488444,
        "upvote_ratio": ""
    },
    {
        "title": "Getting Started",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ea4u2/getting_started/",
        "text": "[removed]",
        "created_utc": 1524475004,
        "upvote_ratio": ""
    },
    {
        "title": "We Are What We Are--Mexican &amp; USA versions",
        "author": "Aharaha",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8e5sgu/we_are_what_we_aremexican_usa_versions/",
        "text": "Just saw the original Mexican for the first time and really appreciate the realist, maybe even kitchen sink, take on an otherwise messed up subject matter (cannibalism).\n\nWanting to check out the US version because it's supposed to be a little different and already with a sequel in the works. Am a little skeptical, but have heard that it's not too Hollywoodized.\n\nIf you've seen it, is it worth seeing? How different is it? I don't really care for adaptations that try to be the same as the original.",
        "created_utc": 1524427409,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any films you'd recommend watching before 'Unforgiven' (1992) to better appreciate its deconstruction of Western tropes?",
        "author": "astreetcarnamedjamie",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8e5by7/are_there_any_films_youd_recommend_watching/",
        "text": "I've recently become interested in the life cycle of certain movie genres, in particular how they eventually reach the point of deconstruction. Westerns seem to be a good example of this cycle, with the especially named 'revisionist Westerns' marking the end-point of its life cycle. From what I've read, 'Unforgiven' is a fantastic deconstruction of not only Western movies, but the hyper-masculine, violent movies of Clint Eastwood's entire career. Are there any specific films from either the Western genre or Clint Eastwood's filmography which you'd recommend I watch to better appreciate what 'Unforgiven' is trying to do?",
        "created_utc": 1524423412,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding a Specific Death in The Departed",
        "author": "ChikaraGuY",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8e4zog/regarding_a_specific_death_in_the_departed/",
        "text": "Hey everyone. I study Martin Scorsese’s stuff a lot because I’m a huge fan of his subject matter and shot decisions, and I was wondering specifically about Frank Costello’s death in The Departed. If you’ll notice, after he’s shot and killed by Sullivan, he is laid out like he is on a cross. Why was the decision made to lay him out like this? Is it because he was a “savior” of sorts to Sullivan and Billy, and after his death they die not long after? I know Scorsese likes to use catholicism a lot as a theme.",
        "created_utc": 1524420414,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of April 22, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8e477v/what_have_you_been_watching_week_of_april_22_2018/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1524413425,
        "upvote_ratio": ""
    },
    {
        "title": "How would you Remake Birth of a Nation (1915)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8e3ehu/how_would_you_remake_birth_of_a_nation_1915/",
        "text": "[removed]",
        "created_utc": 1524405686,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on “Heat” by Michael Mann",
        "author": "klavinsmemes",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8e3d3d/thoughts_on_heat_by_michael_mann/",
        "text": "I recently watched this visceral and heart-pumping action film and I have to say that it surprised me tremendously. This movie caught my eye when I was scrolling through Netflix and came upon a crime thriller starring Al Pacino and Robert De Niro (two of the greatest actors to ever live, no doubt). \n\nIn the beginning, I was a bit judgemental of it, thinking to myself that the story was no more than a reboot of the stereotypical ‘80s action flick with useless romantic drama and I would be better off actually studying for the test I had the next day. But then after the set-up, starting from the scene where Pacino and De Niro’s characters meet for the first time, my interest began to pick up and during the long shootout after the big heist, I was fully engaged. Clinging to the edge of my seat for the remainder of the film, my heart nearly stopped in the final scene, where Neil McCauley meets his demise at the hands of Vincent Hanna. A triumph for the good guys, I was glad the story had a well-crafted ending and that I had not decided to abandon it all together.\n\nAlong with Mann’s stylistic approachs, the writing and acting in this movie was superb, making it my second favorite action film (after “Die Hard”). I hope this prolonged statement doesn’t lose the interest of anyone who wishes to comment their opinions of the film and I look forward to reading other people’s reactions.",
        "created_utc": 1524405275,
        "upvote_ratio": ""
    },
    {
        "title": "Positive vs. Negative reviews by film critics",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8e2gjx/positive_vs_negative_reviews_by_film_critics/",
        "text": "[deleted]",
        "created_utc": 1524392917,
        "upvote_ratio": ""
    },
    {
        "title": "Starting a discussion on You Were Never Really Here",
        "author": "rare_bird",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8e1tzq/starting_a_discussion_on_you_were_never_really/",
        "text": "So, ... I just saw This movie tonight. Wow, super good. There's no significant discussion on it here so I want to kick things off. I've never seen any Lynne Ramsey films (in fact I kept remembering her name as Lynn novick for some reason) and I walked in totally blind (and high!). Read on to find out.\n\nIts a weekend, right, and I need to do something productive with my Saturday, so I'm like I'll see a movie, that'll be fun. I check through the theater's page and I see this poster, its got joaquin, who I love, and I'm like: \"I trust his judgment that this is a good script so I'll see it\". The synopsis mentions the director, and I recognize let's talk about Kevin but I've never seen it. So im like, OK its got Joaquin and it might be arty, tight. Decide on the 10:05 screening. I have two hours to kill so I decide to smoke. Go to the park and sit in some nice grass, cool grass, and smoke some. I go back to my house and eat some toast and hummus and then get transfixed by a movie involving Ben affleck, Jennifer aniston, and Sandra bullock, and a bachelor party. The lighting and directing were so great and I was sad to leave it, but 10:00 is approaching. I head to the theater with some snacks and a beer and stand in line for a ticket. My friend is working the register and we talk a small bit about what we did last night as the ticket is printing. On to the movie (after tons of previews!) ...\n_________________________________________________\n\nI was initially terrified that I'd stumbled into another damn movie or TV show about a serial killer. I was so scared that the protaganist was gonna be terrible and the director was gonna be like, \"ooh its hardcore man!\" But gratefully that was not the case. Joaquin was amazing and sensitive and scary and so was the small girl, props to her and the direction of that actor as well. Something that stands out to me now is how acutely Lynne Ramsey was able to manipulate emotions through the senses. This is pervasive throughout the movie (perhaps list some examples of your own) but one I remember vividly is the burying of his mother and his aborted suicide. When the scene opens, the woods and the lighting represented on screen are so generous and comfy and wholesome. This is a relief from the death and highways earlier in the movie. Then he enters the water so gently and calmly and the lighting and weightlessness (key word) are so angelic and beautiful. As the scene ends, the relief of suicide being snatched away by joaquins commitment to save the girl, the prominent sound is annoying, grating crickets and crunching gravel, along with lighting that is no longer angelic. I'm reminded of dukkha. Anyways, the point of all those observations is to prove that Ramsey communicates the emotion state of the character through sensory 'intrusions' to, for, and against the audience. Pretty neat, and she is beyond skillful with it. \n\nMoving to the theme of the movie, I'd like to look at the same scene and some stuff from the diner at the very end. When burying his mother, Joaquin plans to commit suicide. He is clearly suffering throughout, and in a sense stays alive for his mother. He cares for her tenderly and emotes in ways he never does elsewhere. When she is murdered, his responsibilities to her are ended. He is happy with the dying man on the floor, letting go of his tethers to this life, singing. When he lets her down in the water, she literally falls ways from him and he is immediately freed to commit suicide with the rocks in his pocket. I'm reminded of 'On GP' by death grips. In a twist, his mother morphs into the girl and Joaquin realizes that if he kills himself, then he is killing her too. His burden is replaced. He lives, bravely, and is chucked back into the harsh world with the gravel and the crickets. He seems peeved, but determined. Later, at the mansion retreat, after seeing the dead governor, he breaks down because the girl was strong enough to do what he never could: kill her abuser (https://www.reddit.com/r/TrueFilm/comments/760p3g/you_were_never_really_here_discussion_joaquin/dvhb1sl/). Now, paradoxically, despite depending on Joe, Nina is the one saving him. (Really its his commitment to life and to another person that saves him and that's the theme but ANYWAYS...) She says, 'its OK'. Comforts him. At the diner, he imagines suicide (I'm so glad it didn't go that route, phew) and is literally woken up by the girl. She reminds him its a beautiful day. He's alive again and its the girl he saved that did it for him. Now the sensory fulfilment earlier associated with suicide is paired with life and the girl and their relationship. He saved her, but she saved him too and he wasn't expecting that. What made him happy before wasn't what makes him happy now, he's changed. \n\nShe is him, and he is her? Anyways, I'm joking, haha. This movie was incredible and beautiful. I left changed, and definitely sobered. 420/10. \n\nTell me what you think, I've only scratched the surface. See it now if you haven't.",
        "created_utc": 1524382231,
        "upvote_ratio": ""
    },
    {
        "title": "What do y'all think of the films of Pier Paolo Pasolini?",
        "author": "Radu47",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8e1fu2/what_do_yall_think_of_the_films_of_pier_paolo/",
        "text": "* I loved Accatone.\n\n* Teorema was... =/\n\n* I've got a hold placed for Salo at my local library and am very eager to see it.\n\nHe's a controversial fellow, as most communists tends to be, but even beyond that. A fair amount of the negativity thrown his way is because he challenges this culture and exposes many vital issues. But his style is fundamentally unique, his idiosyncrasies can be abrupt at times and he can to rely too much on his initial ambitious energy without taking measures to fully follow through artistically.\n\nI felt this way about Teorema. It was a great concept. PPP trying to lambaste the Bourgeoisie with minimal dialogue and consistently long takes sounds totally fantastic on paper. I was eager to see it as soon as I heard of it but few films have underwhelmed me more, relative to expectations. I couldn't help feeling that the execution was limited and that it was overly simplistic at times. There didn't seem to be too much passion behind the creative input, an incredibly vital aspect of film excellence. Which is odd given how passionately he resented the bourgeoisie. But sometimes these things happen. A coherent underlying metaphor does not necessarily make a great film.\n\nSo I'm just wondering what people think of him and please no spoilers for Salo (lol) and to say as well RIP Pier Paolo Pasolini... he seemed like a really neat guy. So sad to hear of how it happened. The world needs more people who question the status quo.\n\nCool beans :)\n\nEDIT\n\nWhoa I may have come up with a perfect way to describe *Teorema* it's a \"Primer on the Bourgeoisie\"",
        "created_utc": 1524376167,
        "upvote_ratio": ""
    },
    {
        "title": "What soundtrack do you not only think is good, but also great?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8e15fx/what_soundtrack_do_you_not_only_think_is_good_but/",
        "text": "[removed]",
        "created_utc": 1524372197,
        "upvote_ratio": ""
    },
    {
        "title": "Film Theory - James Bond 007 is a Code Name",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=Q_Ue_nfl-ko",
        "text": "[deleted]",
        "created_utc": 1524368607,
        "upvote_ratio": ""
    },
    {
        "title": "Carpenter loves Sonic, apparently. Who would honestly watch a Sonic movie if Carpenter was directing?",
        "author": "[deleted]",
        "url": "https://www.google.com/amp/s/www.avclub.com/john-carpenter-loves-sonic-the-hedgehog-even-the-crapp-1820329618/amp",
        "text": "[deleted]",
        "created_utc": 1524355534,
        "upvote_ratio": ""
    },
    {
        "title": "Dredd (2012): a good film about an old white male listening to and accepting the perspective of a younger female. Also iz a fine example of low-budget Cyberpunk, and has some of the best scenes of scifi intoxication comitted to screen so far.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dz82j/dredd_2012_a_good_film_about_an_old_white_male/",
        "text": "[deleted]",
        "created_utc": 1524350668,
        "upvote_ratio": ""
    },
    {
        "title": "I go over IMDb user reviews that miss the mark completely, and why those reviews are wrong. Check it out.",
        "author": "[deleted]",
        "url": "https://youtu.be/T1UO6lBdH00",
        "text": "[deleted]",
        "created_utc": 1524349387,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think Brazil is similar to Fight Club?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dy4lr/do_you_think_brazil_is_similar_to_fight_club/",
        "text": "[removed]",
        "created_utc": 1524340221,
        "upvote_ratio": ""
    },
    {
        "title": "Land of the Lost starring Will Ferrell and the films hidden meaning (SPOILERS)",
        "author": "edduno128",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dwx1m/land_of_the_lost_starring_will_ferrell_and_the/",
        "text": "[removed]",
        "created_utc": 1524329125,
        "upvote_ratio": ""
    },
    {
        "title": "The Battle of Algiers (1966)",
        "author": "iNinjaFish",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dwtzu/the_battle_of_algiers_1966/",
        "text": "Hello, I just finished watching The Battle of Algiers (1966) and found myself having trouble understanding it. \n\nReading online I understand that it was very relevant in France and Algeria but people outside those countries still enjoyed it. I just found it hard to support either side. \n\nThe insurgents seem just as authoritarian and violent as the French are claimed to be, with the ban on alcohol and drugs and attacks on innocent civilians. And the French with the torture and violence. Am I supposed to not support either side? Because I must of missed something, as I felt the filmmakers blindly supported the insurgences and the film never condemned the actions against civilians. I really hope I just missed something. \n\nI did however enjoy the guerilla film making and the coordination it must of took to create some scenes. It's the film making that really makes me want to enjoy this film, but I feel that I'm missing something. Send Help.   ",
        "created_utc": 1524328327,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good No Wave films to watch?",
        "author": "theOgMonster",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dwas6/what_are_some_good_no_wave_films_to_watch/",
        "text": "I just recently watched the documentary “Blank City” that covered the no wave movement and cinema of transgression. I was mainly intrigued because the two, especially the former, coincide with the 70’s and 80’s underground punk rock movement, and as a rock nerd and cinephile, I’m heavily intrigued. Several music and art figures that I admire, from Debbie Harry to Basquiat seem to even star in some of these films. \n\nI've already explored some of Jarmusch's films and Amos Poe's, but does anyone else have any other recommendations? Perhaps any necessary no wave films to see? Or some that you've previously seen that you admire greatly? \n\nSo any suggestions?",
        "created_utc": 1524323235,
        "upvote_ratio": ""
    },
    {
        "title": "What is the meaning of this scene? from Yi Yi: A One and a Two",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8duw4b/what_is_the_meaning_of_this_scene_from_yi_yi_a/",
        "text": "[removed]",
        "created_utc": 1524305338,
        "upvote_ratio": ""
    },
    {
        "title": "The Shape of Water and it's problematic romance.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dujc6/the_shape_of_water_and_its_problematic_romance/",
        "text": "[deleted]",
        "created_utc": 1524299391,
        "upvote_ratio": ""
    },
    {
        "title": "Any suggestions for No Wave films?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dtm8i/any_suggestions_for_no_wave_films/",
        "text": "[removed]",
        "created_utc": 1524285557,
        "upvote_ratio": ""
    },
    {
        "title": "*SPOILERS* Spielberg's Existentialism In \"Ready Player One\"",
        "author": "Jefferystar94",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dp8oq/spoilers_spielbergs_existentialism_in_ready/",
        "text": "Hey everyone! Ever since watching \"Ready Player One\" a few weeks ago, I've been struck by how existential a movie it is, especially in regards to Spielberg and his legacy. Below is an abbreviated \"TLDR\" of my ideas, but if you want the full thing with more depth, my [full analysis/food for thought can be found here on my blog](https://kiddingaroundblog.wordpress.com/2018/04/20/spielbergs-existential-crisis-in-ready-player-one/). \n\nChronicling two dystopian worlds (the real world having fallen to shit, and the utter lack of imagination/creativity in the OASIS), the world of \"Ready Player One\" shows a world without a Spielberg type to create new media that becomes iconic, resulting in the sanctification/worship of the old times.\n\nIf you've seen the movie, it's pretty clear that Spielberg takes a liking to Halliday's (the creator of the OASIS) character. He's played by Mark Rylance (Spielberg's current favorite actor), given the most development as a character, and in general his scenes contain the most \"Spielberg\" charm IMO.\n\nBoth the director and the character also realize the legacy they've left behind might not be one they like as well, with Halliday realizing the OASIS contributed to the world falling into ruin and people not valuing time with others in the real world, and in Spielberg's case, he sees the Hollywood blockbuster he helped create becoming increasingly reliant on the same franchises and characters as before, some of which he helped create.\n\nThis all results in a surprisingly bittersweet conclusion where Wade meets with Halliday in a virtual recreation of his childhood bedroom before the later bids goodbye for good. While this scene has a fuckton of layers to it (IMO given some time people will be analyzing this particular moment for years) I see it mostly as a goodbye from Spielberg to the audience. \n\nSure, the guy is still only in his early 70's and has plenty of movies on his plate, but he won't be around for too much longer, and combined with the message Halliday gives Wade about the dangers of living purely in the OASIS, I took it as the director prepping us for a world where he won't be around.\n\nDon't get me wrong, this by no way excuses the movie, which was pretty messy and overlong, but regardless is still an interesting idea in my opinion.\n\nSo what say you all? Am I on to something here, or am I digging too deep into something that isn't there? I'd love to hear your opinions, no matter what you think!",
        "created_utc": 1524244244,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (April 20, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dnvzn/casual_discussion_thread_april_20_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1524233660,
        "upvote_ratio": ""
    },
    {
        "title": "Are movies an unhealthy escape?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dmspl/are_movies_an_unhealthy_escape/",
        "text": "[deleted]",
        "created_utc": 1524223081,
        "upvote_ratio": ""
    },
    {
        "title": "The Killing of a Sacred Deer (2017) Discussion",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dk9df/the_killing_of_a_sacred_deer_2017_discussion/",
        "text": "I just watched this film by Yorgos Lanthimos. He directed The Lobster a couple of year ago.\n\nThis film is based on the Ancient Greek story *Iphigenia in Aulis* by Euripides. \n\nI found the film to be disturbing as well as darkly funny. It definitely made me feel totally uncomfortable at a couple of parts. The dialogue also made me crack up at a couple of parts.\n\nExcellent performances from Collin Farrell, Nicole Kidman, and Barry Keoghan. \n\nI highly recommend this film. I will be watching some of the director's other films in the coming days.......",
        "created_utc": 1524191623,
        "upvote_ratio": ""
    },
    {
        "title": "Martin McDonagh's three feature films (In Bruges, Seven Psychopaths, and Three Billboards) together make an interesting trilogy that reflects on violence.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dhfef/martin_mcdonaghs_three_feature_films_in_bruges/",
        "text": "[deleted]",
        "created_utc": 1524166399,
        "upvote_ratio": ""
    },
    {
        "title": "[REVIEW] Isle of Dogs is Wes Anderson's worst screenplay, and probably his worst film overall as a result.",
        "author": "scratchedrecord_",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dgu5o/review_isle_of_dogs_is_wes_andersons_worst/",
        "text": "Allow me to preface this review with the fact that I love Wes Anderson – I think he’s a brilliant screenwriter and director, and I’ve loved every single one of his movies up until this point (yes, even *Bottle Rocket*). However, after watching this movie, I was left kind of disappointed. It certainly *felt* like a Wes Anderson movie, but there’s a lot of it that’s severely lacking.\n\nLet’s start off with the good – the visuals and directing. This movie just looks *so good*, which I suppose is to be expected given that it’s Wes Anderson. I love how beautiful the animation is, how fluidly everything moves, and how detailed everything is. Trash Island truly feels like a barren wasteland, which I think is absolutely commendable. I do, however, think Megasaki City was itself a bit lacking. Almost all shots in the city are interior shots, leaving it to feel less like an actual place and more like a disconnected set of rooms with no connection to each other. This is a bit forgivable, though, since the majority of the film takes place on Trash Island, which, again, feels suitably and beautifully lifeless (in a good way!). The character design is also great for the most part. A good rule of thumb for character design in animation is that a character should be recognizable by their silhouette alone, and most of the characters fit this rule really well! Notably, Tracy the exchange student and Mayor Kobayashi are both very distinctive – Tracy with her giant head of hair and Kobayashi with his incredibly broad shoulders. I also appreciated the return of pop music to Anderson’s films, which we haven’t seen since *~~The Darjeeling Limited~~* *Fantastic Mr. Fox*. Anderson’s always been brilliant with using pop music – the opening of *Darjeeling* with “This Time Tomorrow” by the Kinks is a particularly exceptional example. The use of the West Coast Pop Art Experimental Band’s “I Won’t Hurt You” is fantastic, and I love the way it returns and plays a second time.\n\t\nHowever, the good mostly ends there. This might just be, in my opinion, the worst screenplay Wes Anderson has ever written. There’s so much about it that just feels shoved in, pointless, shortsighted, or just plain nonsensical. I honestly can’t believe I’m writing this review because this movie should have been incredible – I think a story about dogs set in Japan could work incredibly well with Anderson’s style – yet it falls so short of the mark.\n\nMy first major problem is with the dogs themselves. Only one of them, Chief, feels like an actual character, and even still, he’s a tenuous one at that. He feels like a side character in his own story. Throughout the film, Chief constantly says he’s “against masters” and reminds the audience that “I bite,” yet we never see any consequences of these supposed character traits. Not only does he never act as if he is actually against masters, since he obliges every single time either Atari or the other alphas tell him to do something, but we also never see any consequence of Chief’s supposed aggression on screen, save for once in the beginning when he accidentally rips a rival dog’s ear off. Even still, that feels less like an effect of his violent nature and more of a minor casualty in a larger fight that involves eight(?) dogs total. I’m not saying we need to see him actually *bite* a human in order for this to have consequence, but it’s his one major character flaw, and it would be nice to see him make a decision at some point based on this trait. Every single other one of Anderson’s protagonists has a flaw that they base a decision on, and this helps to make them more convincing characters – in fact, the stories often revolve around these flaws. Steve Zissou in *The Life Aquatic* won’t let go of his idea of revenge on the tiger shark, Sam and Suzy in *Moonrise Kingdom* try to escape their childhood traumas by running away, Mr. Fox in *Fantastic Mr. Fox* can’t let go of his wild side – all of these character flaws drive the story forward. Not one character in *Isle of Dogs* has any sort of apparent flaw that actually affects anything. The closest we get is Atari and his inability to accept Spots’ exile, but this barely counts at best since the film in no way actually treats this as a flaw. Chief also recounts a story where, during his one day of being a pet, he instinctively bit one of his new owners, yet this is of no consequence and only serves as superfluous backstory – again, it bears no effect on anything else that further develops, and it simply serves as more exposition.\n\t\nThe other characters aren’t treated much better – they’re by and large incredibly static and lifeless. I couldn’t tell you the individual personality of any of the other alphas, and they’re the only other dogs we see for the majority of the film until we finally meet the tribe of dogs living in the former encampment. I honestly couldn’t tell you which dog was which. I know their characters all roughly mean around the same thing – “Rex,” “King,” “Boss,” and “Duke” – seemingly implying that that is the point, as their names are all interchangeable. Yet this is negated by the fact that Chief, whose name fits the theme, is his own character and does not fit the trend, leading me to believe that it’s just bad writing.\n\nSpeaking of characters and bad writing, let’s talk about Tracy. She falls far too uncomfortably into the “white savior” trope that it’s embarrassing. I know that there’s a lot of debate over whether or not this film is culturally appropriative, and I definitely think there’s some merit to that argument, but ultimately I think the Japanese setting is relatively harmless. What *isn’t* harmless, though, is the fact that Tracy is the only white person in the movie as far as I can tell and is the only person apart from Atari that actually takes an active role in pro-dog activism. ~~(Side note: I do also want to say that I find the name “Atari” ridiculous for a Japanese story. Ignoring the modern connotation of Atari as the name of an American video game company, the word “atari” derives from the board game Go, which isn’t even Japanese – it’s Chinese. But anyways, back to Tracy.)~~ (EDIT: Ignore that last point - I'm dumb and didn't think this one through, see [this comment](https://www.reddit.com/r/TrueFilm/comments/8dgu5o/review_isle_of_dogs_is_wes_andersons_worst/dxu3ue9/). I understand the practical reason that she exists – all of the human dialogue is left untranslated and unsubtitled, and so Anderson likely wanted a way for English-speaking American audiences to understand the story. But it’s impossible to think of Tracy without also thinking of how this role could have actually gone to a proper Japanese character had Anderson actually bothered to figure out a way to tell the story without the audience understanding the dialogue. (Also, how on earth did she manage to become one of the most influential people in the school newspaper as an exchange student?) There’s even a point where Furthermore, Anderson’s style is incredibly indebted to the works of ‘20s and ‘30s comedians, especially Charlie Chaplin and Buster Keaton, both of whom were geniuses at telling stories without dialogue. The fact that Anderson owes everything to their use of physical comedy and camera angles while simultaneously ignoring how they told their stories in the first place is mind-bogglingly confusing. \n\nAnd then there’s the romance in the film. Oh god, the romance. I don’t want to spend too much time here, but that’s largely because there isn’t much to the romance in the film at all – it’s shoved into the movie with no actual substance whatsoever. Firstly, we have the romance between Nutmeg and Chief, and then we have the romance between Tracy and Atari. (We’ll ignore Peppermint and Spots since that’s not touched on at all and frankly isn’t very interesting to me.) With regards to Nutmeg, I don’t understand why she’s in this film at all. She adds practically nothing – she has one conversation with Chief prompting him to help Atari (and even then, why did he change his mind in the first place? Because she told him to and he has a crush on her? He *barely knows her!*). After that, we *never see her again* until the very end of the film. (Okay, maybe that’s an exaggeration, but she never gets another scene of any consequence until then.) I find the “romance” between Tracy and Atari just as baffling, perhaps even more so, because at least we get a single scene establishing Nutmeg and Chief as being “interested” in each other (using that term loosely). Tracy doesn’t even meet Atari before declaring that she has a crush on him, which is ridiculous to me because it’s not elaborated on further at all. We get *one* line from her about her crush and then we see them together at the end. That’s not character development, that’s just lazy writing. I don’t think I would have minded so much if it had just been the shot of the two of them together at the end, because then that would simply imply the relationship and it wouldn’t have felt so tacked on – it would fit within an epilogue. But to have it mentioned in the main part of the film is incredibly disappointing when it’s not elaborated on at all.\nSpeaking of things that aren’t elaborated on, Kobayashi may be the weakest antagonist that Anderson has ever written. I legitimately cannot pinpoint the reason for his motivation apart from the weak “he hates dogs because his family dynasty hates dogs.” That’s about the extent of his character. Both of Anderson’s other “proper” antagonists – Bean in *Fantastic Mr. Fox* and Dmitri in *The Grand Budapest Hotel* – are similar in that we don’t spend too much time on them, and the films aren’t really about them. What sets Kobayashi apart from them, though, is that I understand where Bean and Dmitri are coming from. They had motivations that felt real, and despite acting outlandishly, they made sense within their stories. Kobayashi feels like a cartoon villain, where his sole motivation appears to be “he’s evil and doesn’t like dogs because reasons.” To add to that, his resolution is incredibly frustrating, since after all the effort he goes through to rid Megasaki of dogs forever, he has a change of heart due to… a single speech and a haiku from Atari? I utterly fail to see how this villain who has been built up as being completely ruthless, even going so far as to *murder his primary opposition*, has his mind changed so quickly.\n\nI didn’t *hate* this movie, and it’s definitely got a lot of things going for it (the aforementioned set and character design is great, plus Bryan Cranston gives a fantastic performance as Chief), but I really, really didn’t like the screenplay here. It’s definitely inspired, but it falls so short of the mark in several places. It honestly pains me to dislike this movie so much, given how I loved *Grand Budapest* and how much I though Anderson was on a hot streak, but I have to admit that this is his first film where I’ve actively disliked it. I hope it’s just a fluke and that this doesn’t start a trend, because I genuinely believe he has the ability to direct more on the level of his previous work. It’s just sad to me to see someone who’s been on fire for his entire career write something this weak.",
        "created_utc": 1524161962,
        "upvote_ratio": ""
    },
    {
        "title": "A Crash-Course in the Golden Age of Hollywood",
        "author": "Nabataean_AD106",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dfmls/a_crashcourse_in_the_golden_age_of_hollywood/",
        "text": "Hello everyone,\n\nFor the past couple weeks I've been working on this little project of creating a [31-day crash-course list for people](https://boxd.it/1D3qa) who are interested in watching Classic Hollywood films, but don't have much of a basis on where to start. In the notes of the list, I wrote down a statement essentially stating why I put a certain film on the list, so nothing on the list feels unwarranted. \n\nAnyway, I hope you enjoy the list I made. I hope this can also be a nice conversation starter on certain Classic Hollywood films you love that you'd love to talk about. That is all I have to say.",
        "created_utc": 1524152745,
        "upvote_ratio": ""
    },
    {
        "title": "Lars von Trier returns to Cannes this year after being banned for years, and publishes a teaser of his new film \"The House That Jack Built\". An occasion to discuss about his career and work as an author : how do you feel about LVT ?",
        "author": "jeyfein",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dfeil/lars_von_trier_returns_to_cannes_this_year_after/",
        "text": "(sorry for grammar, I'm still learning English)\n\nAfter being banned since his last apperance in Cannes (for \"Melancholia\"), Lars von Trier will present his new film, [\"The House That Jack Built\"](https://www.youtube.com/watch?v=BAaLDuEPglI), though out of competition.\n\nAnd it hypes me, as I have the chance to spend days in the festival next month. Lars von Trier is probably my favourite director, although I always felt his movies were far from perfection, he always manages to fascinate me. \nPlus, I find it particulary brilliant that all of his films are so different, exploring many kind of movies (musical, genre,...) along with keeping the same obsessions.\n\n\n\n",
        "created_utc": 1524150998,
        "upvote_ratio": ""
    },
    {
        "title": "Lars von Trier returns to Cannes this year after being banned for years, and publishes a teaser of his new film \"The House That Jack Built\". An occasion to discuss about his career and work as an author : how do you feel about LVT ?",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=BAaLDuEPglI",
        "text": "[deleted]",
        "created_utc": 1524150303,
        "upvote_ratio": ""
    },
    {
        "title": "'Call Me by Your Name' &amp; 'Moonlight' - also a request to share potential double features(due to thematic connections or otherwise)/companion pieces.",
        "author": "TheSarcasticWanderer",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8devdm/call_me_by_your_name_moonlight_also_a_request_to/",
        "text": "After watching 'Call Me by Your Name', I just couldn't help but think about comparing it to 'Moonlight'. Not because of the fact that both films involve a homosexual protagonist(that would be shallow). I wanted to draw a comparison in relation to the way the surroundings that the two respective protagonists found themselves in. While Elio is encouraged and allowed to accept his sexuality and not run away from his emotions by his family members, Chiron on the other hand is forced to hide his real self and has to grow up and put on the mask of the stereotypical 'hard man' to survive in his world. These two films when viewed together show us how the relation that a person has with his/her own self gets greatly affected and shaped by their immediate surroundings and the people around them.  \n\nAlong these lines, I started to think about other unrelated films that can be viewed as potential double features/companion pieces from a thematic standpoint. Two examples are:\n\n1. Satyajit Ray's 'The Music Room'(1958) &amp; Luchino Visconti's 'The Leopard'(1963) - Both films capture the moment of transition in society as the Old Guard gets replaced by the New. While the aristocratic protagonist of the 'The Music Room' detests the new ways and chooses to ignore their intrusions, the aristocratic protagonist of 'The Leopard' is willing to greet the new times and compromise. \n\n2. Michael Winner's 'Death Wish'(1974) &amp; Martin Scorsese's 'Taxi Driver'(1976) - Both films capture the urban decadence and the rising crimes in contemporary New York. However, while 'Death Wish' tackles this issue with a blatantly pro-vigilantism and pro-gun approach, 'Taxi Driver' shows the dark side of vigilantism and the potentially violent and devastating risks of having civilians taking the law into their own hands.\n\nSo I request you all to mention what films you think will work great as a double feature in the comments. The connection could be direct or tangential, thematic or technical, it doesn't really matter. ",
        "created_utc": 1524146676,
        "upvote_ratio": ""
    },
    {
        "title": "Why is \"great film directors are crazy\" a saying?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dblyk/why_is_great_film_directors_are_crazy_a_saying/",
        "text": "I know my question may sound a bit juvenile and naive but I've noticed this saying has gotten kinda popular nowadays. Great film directors (Martin Scorsese\n, David Fincher, Akira Kurosawa, Takeshi Kitano etc) have all been known to have some eccentric personality traits about them, which is also demonstrate to how they make films. Some of them (Werner Hotzerg and Kubrick) are even known to be assholes. So is there any truth to this statement?",
        "created_utc": 1524107447,
        "upvote_ratio": ""
    },
    {
        "title": "Black Panther (2018): Three Common Critiques",
        "author": "gis7thletter",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8db2k2/black_panther_2018_three_common_critiques/",
        "text": "*This write-up is directly taken from my 'review' on letterboxd, of which I have omitted the opening paragraph for the sake of condensation. I have, however, included it in the comments along with the list of sources*. **Feel free to skip the quoted excerpts and jump straight to my own writing.**\n\n**Criticism # 1: Depiction of Africa and African culture**\n\n*\"The Afrofuturism of black America, it seems, has little to offer the people of Africa. It cannot engage with them as human beings but, like the white and Chinese worlds, only as props for its own struggles and self-aggrandizement. And, in all fairness, 'Black Panther' is not meant for Africans. Which is probably why there was no hurry to premiere it on the continent.\"* - Patrick Gathara\n\n*\"But ultimately, Wakanda, at least in the film, is an approximation of African culture, an outsider’s version of what African culture might be like — the rituals, song and dance, the rites of passage.\" | \"As an African, I didn’t feel accurately represented in “Black Panther.\" | \"Even African Americans here do not know that history or those cultural elements. I can see both sides, as someone who has to explain to white people and African Americans about the beauty of African culture and history.\"* - Larry Madowo\n\nRecently, I did a very similar write-up to a very different film in a very similar situation but received with a very different reaction. Wes Anderson's Isle of Dogs, in all its beauty, has been scrutinized for cultural appropriation of Japan, a single state, whilst no one bats an eye for Black Panther of Africa, a collection of countries. Well from the excerpts, two African persons themselves assert that the depiction of Africa and African culture by the film is distorted, to say the least. Truly, the acclaim for the film's depiction of Africa/culture – which claim that the mostly-black cast and crew has given the film a \"fresh perspective\", without \"white bias or guilt\", and does not perpetuate the \"common tale of Africa as mystical and barbaric\" – is unfounded. Slavery was abolished in the United States in the 1860s, and the traces of their original nations, which had already been substantially phased out for many slaves due to forced assimilation, are all but non-existent today. Any African American (shortened to Af-American) person who knew and met a real slave would be very old now; and indeed, Af-American culture today, in clothing, food, language, and arts bears minimal resemblances to their ancestors (if any at all). Therefore, since the praise about the film's 'African' elements – clothing, food, language (dialect via actors' accents), and arts – cannot be attributed to accuracy, it can consequently only be attributed to stylization and, even more reductively, entertainment. Is this – the aestheticization of a country/nation by an 'other' – not cultural appropriation? This is an exact excerpt from my Isle of Dogs review, notice how aptly it applies here: \"Therefore, the film indeed utilizes, or aestheticizes, Japan as a spectacle – as a stylistic outfit akin to suits in video game characters.\"\n\n**Criticism # 2: The Pacification of Killmonger as a Pacification of True Black Liberation, Black Outrage, and Black Revolution**\n\n*\"But at its core, Black Panther contains a fundamentally reactionary understanding of black liberation that blatantly advocates bourgeois respectability over revolution, sterilizes the history of real-life anti-colonial struggles in Africa and elsewhere, and allows white folks such as myself to feel extremely comfortable watching it — which, given Marvel’s sole purpose, is almost certainly the bottom line.\"* - James Wilt\n\n*\"Black Panther is a deeply evil film. It dangles the idea of global black liberation in front of you, paints that as villainous, then ends in an orgy of the freest black people to ever walk the earth slaughtering each other to protect whites. That shit turned my stomach.\"* - Leslie Lee III\n\n*Here is the chance for the movie to undo its racist sins: T’Challa can be the good person he desires to be. He can understand that Killmonger is in part the product of American racism and T’Chaka’s cruelty. T’Challa can realize that Wakanda has been hoarding resources and come to an understanding with Killmonger that justice may require violence, if as a last resort. After all, what else do comic-book heroes do but dispense justice with their armored fists and laser rifles? Black Panther does not flinch. There is no reconciliation. Killmonger yanks the spear out of his chest and dies. The sun sets on his body as it did on Michael Brown’s.\"* - Christopher Lebron\n\n*\" … Colonialism is not a thinking machine, nor a body endowed with reasoning faculties. It is violence in its natural state, and it will only yield when confronted with greater violence.\"* - Frantz Fanon\n\nKillmonger is the allegorical embodiment of Fanon's ideology, like the original Black Panther party in the past and the current Black Lives Matter movement. Contrastingly, T'Challa, whilst indeed being black, is ironically a character that is entrenched in privilege as the metaphorical embodiment of African nobility and the institutional bourgeoisie. From these symbols, the film proclaims a perspicuous message: That Killmonger is a \"radical\" (a character in the film explicitly states this term) and that the right way to go about things is the route of T'Challa. Now, don't get me or any of the other authors wrong (all of which say the same), Killmonger, hate, and violence is not the 'good guy'. T'Challa's method is obviously the preferred, civil, and most productive philosophy. But for there is definitely an in between that the film does not acknowledge, just like how T'Challa does not acknowledge that Killmonger is a product of his environment and opts not to save him despite his super speed (whilst Killmonger was slowed by his mortal injuries, T'Challa could have certainly stopped him). Is this necessarily a bad thing, for cinema and sociopolitics otherwise? Maybe not. This is a Marvel movie after all. But maybe so, when considering the next Criticism. When taking the next point into consideration, this argument – that the film, subliminally or explicitly, diffuses, disperses, and softens or neuters the 'plight' that black, or any oppressed people feel – strengthens and intensifies.\n\n**Criticism # 3: Disney**\n\n*[Writing for \"Moana\" (2016)] \"The Polynesian culture is, on some level, not appreciated for its inherent value but for its ability to generate profit. Profit which goes straight to the bulging wallets of the all-American Disney corporation, and not towards the communities from which this material originates.\"* - Fenton Coulthurst\n\n*\"Which is probably why there was no hurry to premiere it [\"Black Panther\" (2018)] on the [African] continent. In any case, relatively few [Africans] can afford the $10 that I splurged on a ticket and 3-D glasses.\"* - James Wilt\n\nOn Wikipedia, Disney's 'total assets' is listed at $ 95 billion. That also means that the conglomerate employs, while not quite a billion, thousands of workers too. I am not going to reduce millions of employees as one type of individual, which is the cold, calculating, capitalist (in the vein of Ebeneezer Scrooge or Tilda Swinton in Okja). Even if the only ones part of the decision making body are the executives/investors/stockholders, a select few. At the same time, however, I remain extremely skeptical of their role and power in the landscape of media, communications, and art, especially with their recent and well known merger with 20th Century Fox (which Disney is poised to acquire at an estimated price of $ 50 billion). While Disney's recent track record in terms of morals/ethics has seemed to improve since the old days of the Golden Renaissance for animation (compare Moana to Aladdin and Mulan) and of Walt himself, the fact of the matter is they are a business at the end of the day. It can also be assumed that the ultimate goal of any project that is green lighted is always profit, which compounds the previous two aforementioned Criticisms and weakens the film's (disin)genuineness. The question, therein, really is if this truth cancels out the film's intentions and impact. Is a company mutually excluded from 'bringing about good', even if it is an incidental by-product, just because they sought gains first? This is an age old fallacy that I'm not well versed in, but specific to this situation (and recognizing Disney's many actual efforts like donations and such), I say no. I am glad that the film was made and that Disney and the filmmakers have reached out in realized ways.\n\nEdit: Factual correction",
        "created_utc": 1524102169,
        "upvote_ratio": ""
    },
    {
        "title": "Short Essay: \"Overlord\" Villains and How They're Used Well",
        "author": "Scraw",
        "url": "https://www.evolvingsideways.com/single-post/2018/04/18/Cloudy-With-a-Chance-of-Metaphor",
        "text": "",
        "created_utc": 1524097919,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit, is Annillation alot like Intersteller, or is it much different?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8dahgu/reddit_is_annillation_alot_like_intersteller_or/",
        "text": "[removed]",
        "created_utc": 1524096727,
        "upvote_ratio": ""
    },
    {
        "title": "What is your opinion of the 1988 horror movie pulse, with Cliff De Young, and Roxanne Hart?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8da887/what_is_your_opinion_of_the_1988_horror_movie/",
        "text": "[removed]",
        "created_utc": 1524094382,
        "upvote_ratio": ""
    },
    {
        "title": "Question/ Theory about Lynne Ramsay's 'You Were Never Really Here'",
        "author": "Bloom95",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d8b4j/question_theory_about_lynne_ramsays_you_were/",
        "text": "I saw the premiere of this film at a Q&amp;A with Lynne Ramsay and really loved it, but left wanting to re-watch it immediately (which I have now). It's not so much that it's a complicated movie, in contrast, it's really quite stripped down; I just felt it's one of those you kindof have to re-watch. \n\nPeople have described the plot as quite basic (if unorthodox) and focused on the editing, sound design and Joe's internal tortured monologue. But it's a simple question/theory about the plot that I have.\n\nIs State Senator Votto actually Nina's father or one of her jealous Johns? Watching it first time there were numerous red flags to him not being her father... \n\n* Firstly, the guy is straight up creepy af during his meeting with Joe, and he comes across as someone who would use these services (I think the actor must have been directed to play it this way).\n\n* Secondly, Nina doesn't react at all when she's in the hotel room with Joe, and news of Votto's death turns up on the TV. I know she's still a bit drugged out of it at this point, but she's definitely registering the news story and doesn't seem distraught. This wouldn't make sense if Votto was her father, but might do if he was just another 'customer'.\n\n* Thirdly Votto says she runs away a lot after his wife killed herself (I wonder why she did this?) for brief periods but this time she's been gone for a few days and that's why he's got Joe involved. But when Joe rescues her she goes straight to trying to kiss him like it's a reflex now, I just really got the vibe that she had been doing this for longer than a few days. She seems so desensitised. And always so calm as well... If I had just been kidnapped into a sex-ring I wouldn't be so desensitised after a few days. I feel like she's been traded about for a while before Joe rescues her.\n\n* This leads on to the most conclusive (imo) evidence that Votto was a John. As Joe is travelling on a bus he begins to think about Vatto 'falling' from that tower and his train of thought leads him to wonder why he was killed. Then it flashes to a shot of Joe imagining Nina in skimpy clothing with Votto and the Governor. I know Joe's an unreliable narrator but I'm sure he's come to the right conclusion here: Votto and the Governor were both Nina's customers and she was both their 'favourites'. This resulted in a mini-power struggle between the two that Joe got caught up in as he only knew what he was told, and who wouldn't trust a State Senator right?\n\nWhat do you guys who have seen the film think about this theory? \n\nI've heard other theories that Nina was a figment of Joe's imagination, which would make my theory irrelevant haha, but I don't buy into that one.\n",
        "created_utc": 1524078887,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on The Kingdom (Riget)?",
        "author": "CoolHandHazard",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d8aus/thoughts_on_the_kingdom_riget/",
        "text": "I finished watching The Kingdom yesterday and I was absolutely blown away by it. I heard about how it was similar is tone and story to Twin Peaks so I knew I had to check it out. I gotta say that I absolutely loved it. I loved almost every single character, the acting was phenomenal (especially from the actors playing Drusse and Helmer), and the plot was so unique and great. The story genuinely had me captivated for all eight episodes. \n\nI also really loved the constant jump cuts. I've never seen a show or movie that utilizes them to much and so well. The Von Trier outros were pretty cool at first but I think they got a but tiring after eight episodes of it.\n\nOverall this is one of my favorite series ever, and I wouldn't say it's underrated because it is rated so highly, I'm just disappointed with how I never really hear about the series. \n\nThoughts on it?",
        "created_utc": 1524078829,
        "upvote_ratio": ""
    },
    {
        "title": "What is your favorite comedy- need recommendations",
        "author": "pcea17",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d7sdd/what_is_your_favorite_comedy_need_recommendations/",
        "text": "[removed]",
        "created_utc": 1524074965,
        "upvote_ratio": ""
    },
    {
        "title": "HATE STORY 4 (2018): Urvashi Rautela - Karan Wahi - Vivan Bhathena",
        "author": "Jerryphuong",
        "url": "https://youtu.be/d7vaTgs17i0",
        "text": "",
        "created_utc": 1524072930,
        "upvote_ratio": ""
    },
    {
        "title": "Ossessione: is it Neorealism?",
        "author": "cacb3995",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d79rs/ossessione_is_it_neorealism/",
        "text": "I wrote an essay for my blog about Luchino Visconti's \"Ossessione\" with reagards to its categorization as a neorealist film. What do you think? Is it really the very first neorealist film? Or does it fail to qualify according to more modern understandings of the term \"neorealism\"?\n\nHere's the link to the essay if you want to read it: breakingthefourthwallsite.wordpress.com/2018/04/18/ossessione-is-it-neorealism/",
        "created_utc": 1524071156,
        "upvote_ratio": ""
    },
    {
        "title": "The Shining and Eyes Wide Shut are opposites of each other",
        "author": "cattlecall_",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d6b00/the_shining_and_eyes_wide_shut_are_opposites_of/",
        "text": "The Shining is a movie explicitly about violence. If you could summarize the story it would be about a caretaker who tries to kill his family (due to isolation or ghosts or what have you). There are scenes of blood, there are references to a massacre committed by the last caretaker, references to the genocide of native americans, references to physical abuse of a young boy. The violence is at the forefront. But there is also a somewhat hidden sexual undertone to the movie.\n\nThe only time The Shining gets close to being explicitly sexual is two scenes. The infamous blowjob scene which lasts for a split second, and Jack's embrace of the woman in room 237, which starts off sexual and becomes rapidly grotesque. The rest of the sexual content is implicit - Jack is reading a playboy magazine that can barely be seen. There is a movie that Danny watches where a woman insists a young man \"has lunch\" with her. Two women say goodbye to Mr. Ullman in a way that could be seen as mildly flirtatious. A man named Dick has a framed picture of a nude woman. There's speculation that Jack was sexually abusing Danny (only speculation of course). Some people even interpret the layout of certain shots as being phallic or sexual. But it's all implied - not explicit like the violence. \n\nEyes Wide Shut is the opposite. It's a movie explicitly about sex. I'm not going to go over the different sex scenes or the nudity because it's constant. The entirety of the film goes from one sexual situation to the other, whether it's sex dreams, sex fantasies, sex cults, prostitution, infidelity, etc. But there is also an implicit, hidden theme of violence. A woman dies of an \"accidental\" drug overdose - but could it be she was murdered? The masked woman \"sacrifices\" herself for Bill. There's no mention of a violent end to her in the movie, but is it implied? Nick the piano player is missing, and we're told that he's safely back in Seattle - but is he? All these events happen and there's no concrete evidence of violence but I would argue it's implied.\n\nSo to sum up: The Shining is explicitly about violence but implicitly about sex. Eyes Wide Shut is explicitly about sex, but implicitly about violence. What do you think of my theory? Agree, disagree?",
        "created_utc": 1524063890,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (April 18, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d5xvb/casual_discussion_thread_april_18_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1524060992,
        "upvote_ratio": ""
    },
    {
        "title": "[UNOFFICIAL] Voting thread for the /r/TrueFilm Canon",
        "author": "hannomak",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d4uzc/unofficial_voting_thread_for_the_rtruefilm_canon/",
        "text": "**Why a canon?**  \nI believe that a Top 100 would be too predictable and would reveal nothing new. A film canon would consist of 1000 films that covers the taste of this sub, allowing people to discover new films.\n\nI think it’s a good idea to use the same format as the Sight &amp; Sound poll. That means, each user submits an unordered list of films. However, since we want to ideally get a list of 1000 films, the number of submissions will be increased to 50 per user. Each user can submit **up to 50 films**. You can also submit less than that. If you submit more than 50, it will be cut off at the 50 mark.\n\n**Your submission should look like this:**  \nClose-Up (1990)  \nChess Fever (1925)  \nViridiana (1961)  \n…\n\nPlease use the English title of the movie as it is usually shown in large letters on IMDb or Letterboxd and add the year in parentheses after each film. It allows me to parse the thread more easily. You can also add it all in one row like this: Close-Up (1990) Chess Fever (1925) Viridiana (1961). If you have comments about your list, please add them at the end of the list.  \nYou can use the =CONCATENATE() function to attach the year and the double space to each line.\n\nIf you submit a trilogy, I will only consider the first film of the trilogy, so if you want the whole trilogy included, you will need to list each film. I won’t consider TV series, but any feature films, short films or documentaries are allowed.\n\n**This is purely a voting thread!**  \nPlease only list the films and don’t reply to any comments. It makes parsing a lot easier. We can have lots of discussion in the results thread. If you want to comment on the format, please message me.\n\n*Voting has ended.*  \n\nEach submitted film gets 1 point. The cutoff for the final list will be at 1000 films. \n\nThe results will be presented on 1st of May in a reddit thread and in letterboxd format.  \nHave fun compiling your lists!",
        "created_utc": 1524050523,
        "upvote_ratio": ""
    },
    {
        "title": "Identify Old Film From Single Frame?",
        "author": "profexorgeek",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d3bz5/identify_old_film_from_single_frame/",
        "text": "A local coffee shop is in an old movie theater that opened in the 20s and burned down in the 80s. They found a single frame of an old film in an antique projection cabinet and asked if anyone could ID it.\n\nIt appears to have people in traditional Mexican dress, dancing around a giant sombrero with an upside-down horseshoe on it. I suspect some vaudeville take on the Mexican Hat Dance. I don't know enough about film history to date the film by size, style or other characteristics.\n\nThese are the only pics available...\n\nPic 1:\nhttps://i.imgur.com/r1vzzdD.jpg\n\nPic 2:\nhttps://i.imgur.com/ipt6QMr.jpg\n",
        "created_utc": 1524030018,
        "upvote_ratio": ""
    },
    {
        "title": "Mad Max Fury Road: Plot/arc questions",
        "author": "discord_doodle",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d2nhm/mad_max_fury_road_plotarc_questions/",
        "text": "People say this movie has no plot. I have no clue what they're on about. Max gets captured, finds himself teamed up with furiosa to run away from Joe. Then they come to a realisation. THere's nothing out there. So they go back and claim Citadel as their new home while it's conviniently unguarded. Basic right? Yeah but it's there. What do you mean \"no plot?\"\n\nAnother question. I've heard that max has character development and his own character arc. But I do not spot it?",
        "created_utc": 1524022365,
        "upvote_ratio": ""
    },
    {
        "title": "This may be tough, but could anybody identify what Chuck Jones film this film cell is from?",
        "author": "_BooRadley_",
        "url": "https://i.imgur.com/9OvlwtO.jpg?1",
        "text": "",
        "created_utc": 1524010697,
        "upvote_ratio": ""
    },
    {
        "title": "What are your favorite westerns?",
        "author": "itsmemichaelg",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d0n3o/what_are_your_favorite_westerns/",
        "text": "my voice and diction teacher recommended I watch Westerns because I talk a little too fast and he mentioned in Westerns that the characters talk very slow and relaxed. \n\nI totally understood what he meant but I hadn’t really sat down and watched an Old Western before. \n\nThis isn’t a western but i remember watching Mulholland Drive and Justin Thoreax’s character visits this cowboy and the cowboy has this very well spoken monologue about which actress Justin must pick. \n\nAny recommendations where i should start Westerns? ",
        "created_utc": 1524003913,
        "upvote_ratio": ""
    },
    {
        "title": "Name for the style of editing where two scenes are bled together via audio/dialogue?",
        "author": "m2thek",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8d0l97/name_for_the_style_of_editing_where_two_scenes/",
        "text": "Example:\n\n\n1. Scene A is ending with a character talking. The visuals for Scene B cuts in while the dialogue from Scene A continues and finishes.\n\n\n2. Scene A is ending in relative silence. The audio for Scene B cuts in while the visuals for Scene A continue and finish.\n\n\nI watched The Killing of a Sacred Deer last night, and there were several of these transitions, but I didn't know any clean way to refer to this style of editing.",
        "created_utc": 1524003504,
        "upvote_ratio": ""
    },
    {
        "title": "Consumer's Arithmetic, Practical, Lesson #2",
        "author": "LadyCBooks",
        "url": "https://www.youtube.com/attribution_link?a=sTxb-TlJvLM&amp;u=%2Fwatch%3Fv%3DMK85RiV4JFg%26feature%3Dshare",
        "text": "",
        "created_utc": 1524000978,
        "upvote_ratio": ""
    },
    {
        "title": "Let's Talk The 39 Steps - why is it a classic?",
        "author": "MissNevada",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8czbyx/lets_talk_the_39_steps_why_is_it_a_classic/",
        "text": "Starting a goal of watching all the movies I own but have not watch yet, sat down to The 39 Steps (alphabetically) on a rainy holiday morning.\n\nWhat I liked: Acting and cinematography were well-paced, tension was palpable and story was, for the most part, tightly wound.\n\nWhat I didn't like: Because the storyline is essentially \"guy gets caught up in a mystery he really has no business being in\", it was difficult for me to latch on/care about, say, what The 39 Steps itself was.  So the actual thrill of the central plot didn't propel me. \nThe love story was atrocious, and the ending w/ the handcuffs just kind of dragged and dragged.\n\nThere was a lot here - I especially loved the cinematography on the train, and the storytelling/pacing at the Scottish farmers house.  Moreover, I want more discussion on why this film is a classic to help my understanding.  I see some really lovely cinematography and the birth of the Hictchcockian thriller - is there anything I'm missing?\n\nI tried to keep this vague but I'm sure spoilers will abound in this discussion to follow.",
        "created_utc": 1523993580,
        "upvote_ratio": ""
    },
    {
        "title": "What was Haneke's \"Happy End\" about ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cyqhc/what_was_hanekes_happy_end_about/",
        "text": "[removed]",
        "created_utc": 1523989098,
        "upvote_ratio": ""
    },
    {
        "title": "Other roles that Stanley Kubrick allowed to be improvised?",
        "author": "derdody",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cyivo/other_roles_that_stanley_kubrick_allowed_to_be/",
        "text": "[removed]",
        "created_utc": 1523987498,
        "upvote_ratio": ""
    },
    {
        "title": "I absolutely loved Rope from Hitchcock. What should I watch next.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cwwni/i_absolutely_loved_rope_from_hitchcock_what/",
        "text": "[removed]",
        "created_utc": 1523975095,
        "upvote_ratio": ""
    },
    {
        "title": "How do i analyze a film in a technical aspect?",
        "author": "ScrewupPro",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cvffh/how_do_i_analyze_a_film_in_a_technical_aspect/",
        "text": "Have been into movies and the in depth knowledge they convey, uncovering the Easter eggs in every movie I watch. Have written some tough storylines too. But, when people say a movie is technically strong, I don't get to understand what that means. Could be a very amateur question among this subreddit of experts, would be great if I could get a good insight. How do I know the technical side of a film?",
        "created_utc": 1523959824,
        "upvote_ratio": ""
    },
    {
        "title": "Read Player One. Was Spielberg the wrong director for the material?",
        "author": "Pancake_muncher",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cto5b/read_player_one_was_spielberg_the_wrong_director/",
        "text": "Before you get your pitchforks up, I liked RPO and thought Spielberg's direction benefited the action with his unparalleled blocking, camera movement, and restraining from going overboard with sound and overwhelming visuals. It's a fun brisk Spielberg popcorn movie like Tintin or Hook. I wanted to discuss if you took away what Spielberg wanted to say about fan culture, nostalgia, or escaping reality. All I took away was don't play too much video games. \n\nIf a younger director took the reins, we probably would of seen a more aware version of RPO that flirts with ideas like the toxicity, excessive escapism, neglecting reality due to apathy, the dangers of nostalgia, and the ugly side of fan culture (gatekeeping, misogyny, doxxing, etc). \n\nAs RPO stands, it's just a YA dystopian adaption, which depicts knowing random useless trivia is the key to saving the world, being great at videogames makes you unstoppable, a straight white dude is supported by minority characters who have no agenda but to help the main character, no one is creating anything culturally new, everyone's given up on reality, and this nerdy main character with all these shallow facets gets the hot girl as his reward. This is fantasy, but it feels strangely regressive after Gamergate, fan backlash against diversity (ghostbusters, star wars), and the toxicity of social media (doxxing, deaththreats, swatting).\n\nI know Spielberg's only intention was to craft a fun blockbuster for the millennial generation that grew up from the 80s and beyond, but I can't help but think Spielberg had nothing to say about the pop culture obsession he helped define. \n\nWhat do you think about Ready Player One?   \n\n\n",
        "created_utc": 1523936736,
        "upvote_ratio": ""
    },
    {
        "title": "Where to watch \"The Birth of a Nation\" 1915? It is banned on Comcast",
        "author": "rakocziot",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cqhrl/where_to_watch_the_birth_of_a_nation_1915_it_is/",
        "text": "In 2015, TCM played Birth of a Nation and I had it saved (I think they played it for the 150th anniversary of the Civil War), and I was finally going to watch it. But I deleted it not being in the mood for silent movies at the time. \n\nNow I have an interest in silent movies, and have seen most of the renowned ones, and this is the only one I am having trouble finding when on the television.\n\nI have Comcast, Xfinity On Demand, BUT they do not allow you to search for the 1915 Birth of a Nation in ANY method. Further, on their website, you are not allowed to watch or purchase it, only allowed to mark is as a \"Favorite\". If you search for it on the television, it is not listed.\n\nIn effect, viewing the \"The Birth of a Nation\" from 1915 is banned by Comcast. I am just going to guess that some twitter people got them to do that.\n\nAnyway, how do you view a version of this film on a TV today? I don't want to watch it on the computer. Any advice? I don't think it will ever play on television again. ",
        "created_utc": 1523908579,
        "upvote_ratio": ""
    },
    {
        "title": "Any New German Cinema Experts Out There?",
        "author": "ccbax",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cowkw/any_new_german_cinema_experts_out_there/",
        "text": "I really want to understand and dive deeper into the New German Cinema movement. The way I understand it, it was a group of independent filmmakers reacting to the French New Wave, that signed the Oberhausen Manifesto to basically commit to making films that focus on the form and didn't have economic gains in mind.\n\nWhat really interests me, is that the way I understand it, many of these filmmakers came from a Documentary background. I have been really focused on trying to study filmmakers that successfully navigated both the doc and narrative worlds. Herzog is an obvious choice, and an early inspiration to learn more. But that's what really brought me to this movement. \n\nCan anyone recommend me a good entrance to the New German movement, as well as recourses to learn more? I've really only seen the early Herzog stuff, a couple Wim Wenders, and Fear Eats The Soul. And I'm assuming all those guys came way later.  \n\nEDIT: thanks everyone for the help, please keep discussing, but looks like I'm gonna start my dive with Kluge's Abschied von gestern or Yesterday Girl (english trans.) ",
        "created_utc": 1523896737,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (April 16, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cnta7/casual_discussion_thread_april_16_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing. \n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/)\n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1523888072,
        "upvote_ratio": ""
    },
    {
        "title": "Is Greed (1924) good?",
        "author": "HeathenFace",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ckpzp/is_greed_1924_good/",
        "text": "No, as both a business philosophy and a film, I don't think it works quite as well as its advocates think it does. I've spent the last few weeks on a silent era bender, and while I'm by no means an expert on or connoisseur of the period, I've logged enough voice-less hours to get a sense of what genius looks like (e.g. *The Passion of Joan of Arc*, *Sherlock Jr.*, *Battleship Potemkin*, *Strike*, etc). \n\nAgain and again, I read that it would look like Max von Stroheim's 1924 epic magnum opus, *Greed*. Well, I finally got around to watching the four hour reconstruction (the TCM one on filmstruck with the still images), and to say I was disappointed is an understatement. *Greed* plods through its seemingly interminable running time like a dehydrated, half-dazed horse in the endless sun-scorched expanse of Death Valley. The characters are grotesque-looking and thinly-drawn, making it difficult to care for them when we're supposed to do so, and impossible to care for them when we're not. McTeague is particularly awful and seems miscast, unless von Stroheim's goal was to find an actor who looks like, and has the emotive range of, an aging potato with a mop of curly hair. The story can't save them, and neither can the cinematography, which is only occasionally interesting (and when it is interesting, always flecked with gold). The intertitles are a strange mix of dialogue and description from Norris' novel that at times clash tonally with the action on either side of them. \n\nAnyway, other than historical interest, I can't think of a compelling reason to actually watch all four hours of *Greed*, let alone spend time trying to find the world's last copy of a full cut. von Stroheim's ingenuity as a director is only demonstrated in the final act and is only really worth savoring in the final five minutes, which, I'll admit, are pretty good. I'm open to the possibility that I'm missing something, but every hyped-up silent film I've watch thus far has taught me something, or inspired me to make an interesting connection, or entertained me. This one just didn't, and I wanted to share that because it doesn't seem to be a common reaction, as far as I can tell.",
        "created_utc": 1523850074,
        "upvote_ratio": ""
    },
    {
        "title": "Question about analyzing why individual MCU films fail to resonate",
        "author": "redskarlet",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ckcep/question_about_analyzing_why_individual_mcu_films/",
        "text": "I've been thinking a lot the MCU recently (I host a movie podcast, my co-host loves all the MCU films, I find them fairly unmemorable)\n\nI've been thinking about trying to figure out a methodology for analyzing my personal responses to films in the MCU. On the whole, I find them somewhat enjoyable on a pure visceral level, but I tend to forget about them pretty quickly, and I very rarely find them particularly engaging.\n\nWhat I want to figure out is if this is a common response - is it just a case that these are not my genre? Is there any critical narrative theory which analyzes the MCU in detail which I could use as a framework? A lot of the reviews are fairly \"this is good, this sucked\"\n\nTo preface my personal taste. I like to think I have a fairly broad interest in cinema, watching anything from most genres. I've studied cinema and watched most of the \"main titles\" of cinematic history. I really love it when cinematic technique works harmoniously with narrative (ie. Vertigo). I am definitely interested in blockbuster filmmaking, and I love when a film of audacious scale actually connects emotionally (ie. Terminator 2, Jurassic Park, Mad Max Fury Road). I also really enjoy when films seem wildly out of control, but exhilirate and engage (The Crank films for example). I have no pretense that a film has to be serious or dramatic to be good. Recently, I thoroughly enjoyed \"A Quiet Place\" as a great example of crowd pleasing thrills which never felt like it ever played for the cheap seats. \n\nAs far as the MCU actually goes, I enjoyed Iron Man as a fun romp with a good sense of style and briskness (I think the ending also really landed the tone of the film). Since then, they've all become a bit of a blur. I found myself sitting in Iron Man 3 thinking \"why am I here?\". Avengers was really admirable in how it balanced characters in large scale action. I loved Thor Ragnarok's sense of humour against the silliness of it all. I think Black Panther was important in giving us an alternative reality which was inspiring, but I found most of the movie a bit \"same same\" as previous Marvel films. \n\n\n",
        "created_utc": 1523846110,
        "upvote_ratio": ""
    },
    {
        "title": "Forget it Roman, it's Chinatown [CW: Rape]",
        "author": "Naggins",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8ck2ek/forget_it_roman_its_chinatown_cw_rape/",
        "text": "So after years of maintaining my own personal boycott, I finally decided to bite the bullet and watch Polanski's Chinatown. It was as brilliant as I'd heard, so my boycott-breaking has been justified. I imagine I'll be watching plenty more Polanski films over the next while. \n\nBut Chinatown is a film with a very overt message - wealthy, powerful individuals feel entitled to world around them, the earth's land and water theirs to do with what they wish. This entitlement is taken to the extreme in the case of Noah Cross, who raped his own daughter when she was 15, and used her death as an opportunity to take ownership and rape his granddaughter. Ultimately, the world is so corrupted that Cross and those like him are unimpeachable. It's Chinatown. \n\nSo what struck me as interesting is the character of Cross and the philosophy of the film more generally in the context of Roman Polanski's rape of a 13 year old girl in 1977, along with two further allegations from 1970 and 1975. The film as written by Towne very clearly situates itself in strong moral opposition towards corruption, entitlement, and the rape of children, but pessimistically accepts them as inevitabilities of granting individuals such impeachable power. And yet it was directed by a paedophile who owes his freedom to the power and wealth he commands in the film industry. The dissonance is jarring, and yet there's a strange lack of discussion about that dissonance. \n\nAnyway, as the saying (almost) goes, where there's a dissonance, there's a dialectic. In Chinatown, there are two opposing forces: Gittes, who represents morality, naivete, and idealism in the face of Cross, who represents boundless corruption (both political and moral) and the most disgusting, base desires of man. I believe that each of these represents dual aspects to Polanski's character. And I believe that the dialectical battle between those two characters is one told as a retrospective of Polanski's internal battle between those two aspects. Guys. It's time for some ~~game theory~~ dialectics.\n\nGittes is a representation of Polanski's moral sensibilities, his sense of lawfulness and of decency and of romance and of idealism. Cross is a representation of his darkest fetishes and perversions, his lust for power over others, his desire to seize what he wants, and what he deserves. Ultimately, just as Gittes is powerless to stop Cross, Polanski is powerless in the fight against his own perversions and lust for power. Gittes is just one man, while Cross is all-powerful, pervading every institution and apparatus, bending them to his whim. Polanski's moral sensibilities are just one voice, his perversion is all-powerful, pervading every muscle and every neurone, bending them to its whim. Just as it is for Gittes to fight against Cross, for Polanski's moral sensibilities to fight against his perversions is futile. There's an inevitability to Cross' victory as there is an inevitability to Polanski raping children, and there's nothing you can do about it but tired acceptance. \n\nThings get more interesting when you introduce the murder of Polanski's wife by the Manson family in 1969. It's often attributed as a psychological breaking point for Polanski, and the understandable emotional trauma an excuse for his subsequent abuse of children. I think that's a bit on the charitable side - a lot of people have lost their spouses to murder or other unexpected deaths without raping children. But I don't think it's entirely wrong. I see it as a moral rather than a psychological breaking point, and one that runs parallel to Gittes' own in Chinatown - seeing his loved one, Evelyn, killed. For each, these moments were their nihilistic epiphany - there is no justice, there is no accountability, there is only power and those who are willing to use it to seize what they want. \n\nChinatown isn't just about the power structure of LA or even of the world. Chinatown is about a paedophile's battle to be good, moral, and lawful, fought against his very body. ",
        "created_utc": 1523843297,
        "upvote_ratio": ""
    },
    {
        "title": "Eyes Wide Shut: Lynch and Carpenter",
        "author": "citizenpuppet",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cgfos/eyes_wide_shut_lynch_and_carpenter/",
        "text": "Upon viewing this film for the first time, I am glad I have a working knowledge of the craft to better understand this one versus reacting merely to the sexuality and dream like quality it has at times.\n\nHowever, I found two big points of influence in Eyes Wide Shut that I didn't think I would, David Lynch and John Carpenter. Kubrick's use of drawn out almost painfully odd dialogue is very Twin Peaks as is the choice of blue lighting.\n\nThe twinkly piano is very close to Carpenter's Halloween soundtrack but also the tone at times is very Halloween.",
        "created_utc": 1523811400,
        "upvote_ratio": ""
    },
    {
        "title": "What Have You Been Watching? (Week of April 15, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cg4ds/what_have_you_been_watching_week_of_april_15_2018/",
        "text": "Please don't downvote opinions. Only downvote comments that don't contribute anything. Check out the [WHYBW archives](https://www.reddit.com/r/TrueFilm/wiki/index#wiki_what_have_you_been_watching.3F).",
        "created_utc": 1523808665,
        "upvote_ratio": ""
    },
    {
        "title": "Some Like It Hot(1959) - Does it have something to say or am I projecting these ideas?",
        "author": "Lucianv2",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cfdac/some_like_it_hot1959_does_it_have_something_to/",
        "text": "I really liked this movie, and I find “Tony Curtis” to be such a wonderful actor and great screen presence, and I don’t think I have to talk much about Marilyn Monroe’s irresistible charm.\n\nI don’t know what I was expecting but I wasn’t expecting so much comedy and silliness, it felt very much like a cartoon, everything from the plot to a lot of scenes and the overall neglect of realism, but it was pretty funny and very enjoyable overall. \n\nWhat is so surprising to me is how progressive and feminist this movie is. It portrays a lot of the struggle that women had to go through(and go through today to a lesser degree) as well as being completely okay and accepting of homosexual/bisexual as well as transgender allusions even if it’s all in the context of comedy. The ending almost had me in tears, it was very unexpected but it further solidified my belief that some of the themes that are mentioned earlier are indeed there deliberately and aren’t just completely for laughs. The ending might be one of the best endings that I’ve seen in any film. Overall a really well made and funny film that actually has something to say about identity and acceptance. What do you think, are these themes something that the movie is trying to promote or are they just for laughs and I'm just projecting?\n",
        "created_utc": 1523801635,
        "upvote_ratio": ""
    },
    {
        "title": "The Last Jedi is Poor Storytelling (Part 2): elevating the plot through following screenwriting rules",
        "author": "tiMartyn",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cdqjv/the_last_jedi_is_poor_storytelling_part_2/",
        "text": "A little while ago, [I wrote an analysis](https://www.reddit.com/r/TrueFilm/comments/7nratv/the_last_jedi_is_poor_storytelling_how_episode/) that went in depth on the film’s narrative flaws. It got more feedback than anything I've ever written and I've been genuinely humbled by the responses. After sharing my thoughts on r/truefilm, I was asked a few times how I would alter Star Wars: Episode VIII to improve the story and solve the issues I had with the script. Although I haven’t come up with a specific beat-for-beat outline, I have given some consideration for what I would have done differently.\n\nIn this post, I’m going to focus on ways in which character arcs can be improved, pitch new conflicts of interests that elevate the plot, and explain how a purposed plot twist can completely reframe both characters’ perspectives of events as well as our own perspective of the sequel trilogy.\n\n**Character development**\n\nIn The Last Jedi, we follow two separate subplots. One involves Finn and Rose who go to the casino city of Canto Bight to track down a “master codebreaker.” Although their quest ends up being inconsequential to the rest of the film, Finn grows as a character from a selfish runaway into a selfless soldier. The problem is, this is extremely redundant to Finn’s character arc in The Force Awakens in which he goes from a coward trying to escape the Resistance to a hero willing to die for a cause.\n\nThe second b-plot in The Last Jedi involves the Resistance ship losing fuel while being chased by the First Order fleet. As this is going on, Poe has to learn how to deal with taking orders from Vice Admiral Holdo.\n\nDirector and writer Rian Johnson has stated that he didn’t group Finn and Poe together in one single b-plot because he thought they would get along too well, and there would be no conflict between them. I think this is incredibly revealing of Johnson’s abilities as a writer. There is always an opportunity for conflict between characters, even when those two characters seem to get along for the most part.\n\nAlso, we shouldn’t forget that Finn and Poe haven’t had much time to interact since their initial escape from the First Order in The Force Awakens. Since Episode VIII takes place moments after the previous film, Finn has been unconscious and hasn’t had time to catch up with Poe since Starkiller Base was destroyed. Their friendship has been severely underdeveloped and largely assumed. We should be shown more than we are told.\n\nIf I had written The Last Jedi, Poe would go through a similar arc as he did in the film. I think it’s a plausible progression of his character from Episode VII. It makes sense the best pilot in the galaxy would be full of himself and need to learn how to take orders. Except in this version, Poe wouldn’t be challenged by a new authority figure who doesn’t even do well on the job.\n\nInstead, General Leia sees Poe’s arrogance and assigns him to go on a mission with Finn (a mission which would tie into the grander plot of the film). However, Leia puts Finn in charge. Poe’s only there to fly the ship. On their mission, Poe has to learn how to compromise with a guy he’s gotten along with up until this point. He assumes it’ll be fine. As the story continues, Poe attempts to micromanage their mission and frustrates his friend.\n\nMeanwhile, Finn has to learn how to be a leader in the midst of pushback from the one guy in the Resistance he thought he knew. This is a natural progression of Finn’s character arc from The Force Awakens, since we last saw him as a follower choosing which side he should be on. He’s made up his mind and decided to fight for the good guys, not realizing he would eventually have to step up his game and act as a leader.\n\nWhile Poe’s arc in Last Jedi is an understandable extension of VII, and Finn’s arc is repetitive of what he’s already gone through, the film weirdly lacks an arc for its protagonist Rey.\n\nThe Force Awakens introduced us to Rey as a girl who simply wants her family back. After living her whole life alone on the desert planet Jakku, she has to come to terms with the fact that her family is never coming to get her. When Rey confronts this reality, she decides to continue on her adventure and accepts the call to action.\n\nIn Last Jedi, Rey has to come to terms with the fact that her parents don’t matter, because they’re “nobodies.” When she accepts that her parents never cared for her, she faces a choice: join Kylo Ren, who had parents that cared for him who he betrayed, or she can continue fighting for what she believes in, where she’s already accepted in a surrogate family... It’s an easy choice.\n\nIn one sense, this moment feels repetitive as Rey has to break through denial for a second time. In another sense, this progression in the narrative feels completely random and inconsistent with Force Awakens. The audience wasn’t aware that Rey didn’t know who her parents were, or that she was caught up in thinking they were something other than “filthy junk traders.” To her, it shouldn’t matter who they are, she just wants her family back and to know what happened to them.\n\nWhen we see her again moments after her “revelation,” Rey is flying in the Falcon having a blast, shooting down Tie Fighters. It seems as if nothing has an impact on her throughout the entire film.\n\nDespite learning the legendary Luke Skywalker has decided to abandon the Force and the heroic Jedi Order, Rey remains optimistic and naively confident she is destined to be a Jedi, and that Luke will eventually come around to help the Resistance. Rey should be humbled after finding out Luke is just as human as she is, and she should be twice as humbled after failing to redeem Kylo Ren. But, we never see her discouraged. Although she is proven wrong multiple times, she’s never troubled.\n\n**Conflicts of interest**\n\nIf we’re going to see a burdened Luke Skywalker, we also need to see a properly disheartened Rey. Since she is persistently hopeful, she needs to hear something that will flip the way she sees the universe. She needs a new hurdle to overcome. This can be accomplished through a plot twist on par with the reveal that Vader is Luke’s father in The Empire Strikes Back.\n\nIn this rewrite, Kylo Ren realizes he once knew Rey’s parents. During a Force Skype session between her and Kylo Ren, he alludes to Rey that Luke knows something about what happened to her family. Soon, Luke reveals that her parents were among his Jedi students who had been slain. In recurring flashbacks, this story is expanded upon a few times. Instead of just hearing about these events, we see parts of them take place.\n\nRey is sad to learn that her parents died violently that night, and is told that Luke fulfilled their last wishes by dropping her off on Jakku for her own safety as the First Order would be searching for him.\n\nBut Luke isn’t telling Rey the full story. In a final Force communication between her and Kylo Ren, he reveals that **Luke Skywalker killed her parents.** They were among the students who Snoke had turned to the dark side with Ben Solo. After her parents initiated a fight against Luke and the rest of the Academy, he had no choice but to defend himself and the other students by defeating the couple.\n\nWhen Rey finds out, her world is crushed. Luke isn’t just a fallen hero, he’s taken everything from her. He’s the reason she's been on her own her whole life. She had dreamt of her family’s return for years, but because of Luke, she’ll never know them.\n\nThis turn of events has several implications for Rey, Luke, and Kylo Ren. First, it gives some reason and backstory for Rey’s abilities in the Force. Second, it gives Luke additional reason to be hesitant to train her. The weight of Luke’s failure becomes even heavier if his actions led to a child being orphaned. He is responsible for Rey, and abandoned her partly to escape that responsibility.\n\nThird, Rey finally has a major conflict of interest that she must face. She can’t be passive anymore. She has to make a choice. She came to Luke to recruit him and become a proper Jedi — but everything has been turned on its head. Should she deny herself and be a hero, or give into the dark side and avenge her parents?\nSimilar to the “Vader is Luke’s father” reveal, this twist raises the stakes and makes them even more personal than they were previously. Dynamics between characters completely shift. Unlike the film, Rey has good reason to turn on Luke and join Kylo Ren.\n\nThis reveal also has big implications for Kylo Ren’s motivation.\n\nIn the final flashback, we see Ben’s perspective of the massacre. After hearing commotion outside, he walks out of his hut. Ben sees students fighting each other with lightsabers while the Academy in engulfed in flames. This wasn’t part of the plan. Something must’ve gone wrong.\n\nBen is clearly underprepared and overwhelmed, not sure he should join the newly formed Knights of Ren and fight the Jedi students, or just wait for it to be over. After observing the chaos, Ben spots Rey’s parents fighting his uncle Luke. Rey’s father and mother were Ben’s mentors, and were responsible for recruiting him to Snoke’s Knights of Ren. Rey’s mom shouts to Ben in the distance, asking him for a hand against the Jedi Master.\n\nSuddenly, Luke defeats the couple. It is a critical moment for Ben, as well as both Rey and Luke. Ben’s mind is made up, realizing he cares more about his friends than his uncle. He charges toward Luke, who didn’t think his own nephew would be among the students to betray him. This element of surprise is what allows Ben to best the Jedi Master in a fight and escape with the Knights of Ren.\n\n(Side note: younger Luke’s naive attitude parallels Rey’s current naive optimism. The only difference is, he didn’t know how to deal with tragedy other through shame and isolation. Rey eventually confronts her tragedy and becomes stronger for it, paving the way for Luke to return.)\n\nNow, Kylo Ren has personal motivation to lure Rey to the dark side. After their most recent conversation in which he revealed that Luke took her parents from her, Kylo believes there’s a good chance he has a new ally. But if he can’t turn her, he knows what her parents would want him to do.\n\n**Consequence**\n\nAfter Rey confronts Luke, she leaves to face Kylo Ren. We aren’t sure whether she will choose to face him in a fight, or join his side. The offer was left open the last time they spoke. Arriving on the Supremacy, Kylo speaks with Rey on their walk to Snoke’s throne room, suspecting she will soon pledge her allegiance to the First Order.\n\nIf Snoke is going to meet his demise in the moments to come, we should at least learn the reason why the rest of the Knights of Ren chose to join him years ago. When Rey is presented before Snoke, he decides to tell her about her parents, and why they were right to give into the dark side, betraying Luke’s new Jedi Order to join the First (Jedi) Order.\n\nSnoke explains that Luke had whitewashed the Jedi religion to be what he wanted it to be. He erased thousands of years of teachings to make room for the things he wanted to enforce. Luke allowed marriage and encouraged students to follow their feelings. He believed enemies could be redeemed, as he once redeemed his father, and that everyone has some good in them. Luke ignored the roots of the Jedi, and restricted students from reading the ancient texts. But despite Luke’s effort to keep the truth a secret, there were rumors throughout the Academy of the Jedi Order’s scandalous and dark beginnings.\n\nIt was Rey’s parents who first got in contact with Snoke, who claimed to know about the origins of the Jedi. In fact, Snoke claimed to be the Prime Jedi, the creator of the religion and discoverer of the Force. He told the couple that if they spread the word, he would teach a select few of Luke’s students about the Force in a way their master never could.\n\nAfter Snoke recounts this story to Rey, she speaks up and finally gives her answer whether or not she will join them. She tells Snoke she won’t follow in her parents’ footsteps. Kylo Ren is surprised and turns to her.\n\n“Wiser than they were,” says Snoke. “Gullible fools, they trusted anything I would tell them. They even believed that I was the Prime Jedi.”\n\nKylo Ren is taken aback. Despite knowing plenty about the Force, Snoke wasn’t all he said he was. He had lied to Rey’s parents, Ben’s old friends. Thinking of them, Kylo immediately ignites Luke’s lightsaber and kills Snoke. He had regretted being too late before and allowing his friends to die by Luke’s blade. In a turn of events, Kylo Ren is the one who avenges Rey’s parents, not her.\n\nAfter killing Snoke, he Force chokes the guards surrounding the room. All of them collapse to the floor. Meanwhile, Rey doesn’t understand what is happening. She is still processing the truth about her parents. Instead of a team-up between Rey and Kylo, they fight each other in a lightsaber duel. As compelling as the sequence was upon first viewing in a theater, it’s hard to continue to take a hero/villain relationship seriously after they defend one another and take on a common enemy.\n\nUnlike their first duel in The Force Awakens, Kylo now has the upper hand over Rey, empowered by his anger. But also much like their first duel, this one is entirely based on emotion. After Kylo bests Rey, she collapses on her knees. Kylo takes the blue lightsaber from her, holding both sabers to her neck. She is still distraught about her parents, not thinking about her current situation.\n\nSuddenly, the Resistance ship rams through the Supremacy at light speed. Both of them are thrown to opposite ends of the room. The rest of the film plays out as it does, but Rey is no longer in a good mood. She’s forgiven Luke and has come to terms with the truth of her parents, but she’s still not thrilled to shoot Tie Fighters in the Falcon.\n\n**Progression**\n\nThe runtime for Episode VIII is 2 hours and 32 minutes. Yet, when it was over, I didn’t learn much new about any of the characters. By the end of this retelling, each character grows into better versions of themselves. Finn matures and becomes a better leader, facing opposition on the way from Poe, who is humbled as he learns how to compromise. It might even make sense that Poe would eventually sacrifice himself for Finn’s survival. This would be the ultimate way he could lead by example, while redeeming himself from former arrogance.\n\nInstead of remaining passive throughout her shortcomings, Rey goes from naive idealist to confident realist. She learns how to deal with tragedy after realizing the universe doesn’t always work in her favor. Unlike Luke, she maintains a spark of hope and knows she still can’t give up, despite matters being against her. Rey overcomes a personal conflict to be the hero she needs to be to protect her new family.\n\nLuke also realizes he needs to accept things as they are and forgive himself to take up the mantle again and make matters right. The weight of his failings are heavier here than the film, so his return to action is more meaningful.\n\nLastly, Kylo Ren’s motivation is completely changed. He isn’t just trying to “kill the past” and write his own journey, he’s basing decisions on a past allegiance. Unlike the film, Kylo Ren now has something to stand for. After a paradigm shift, he sees Snoke as just another old manipulator disconnected from reality. Kylo also faces a conflict of interest, not wanting to kill Rey, but knowing he might have to.\n\nA film like The Last Jedi should pose new and compelling challenges to its heroes who think they have it all figured out. Dreams should be crushed, motivations should be developed, and the plot should be elevated. Not only should the characters’ perspectives be altered, ours should be altered too.\n\nWe should care what happens after the film ends, but many have voiced their indifference to a followup. We weren’t given legitimate reasons to care about how conflicts might be resolved, because the conflict didn’t feel so pressing to begin with. But if Rey and Kylo Ren share personal ties that develop them as characters and affect their dynamic, there’s an additional layer of suspense. We have something new and interesting to anticipate. We want to see what happens next.\n\n&gt;Thank you for reading! This article can also be found on https://medium.com/@timothymably/reimagining-the-last-jedi-luke-killed-reys-parents-2ec7f32aa729",
        "created_utc": 1523777570,
        "upvote_ratio": ""
    },
    {
        "title": "The Last Jedi is Poor Storytelling: Part 2 - improving the script by following essential screenwriting rules",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cdpy5/the_last_jedi_is_poor_storytelling_part_2/",
        "text": "[deleted]",
        "created_utc": 1523777302,
        "upvote_ratio": ""
    },
    {
        "title": "The Lorax (2012) and the pitall of a commodity-centered mindset",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=AC_8vkD1-H8",
        "text": "[deleted]",
        "created_utc": 1523774752,
        "upvote_ratio": ""
    },
    {
        "title": "[OC] Robert De Niro - The Greatest Actor of All Time VIDEO ESSAY [7:29]",
        "author": "danielbarrero_",
        "url": "https://youtu.be/rUo9hupnWFA",
        "text": "",
        "created_utc": 1523774610,
        "upvote_ratio": ""
    },
    {
        "title": "Non-continuity editing in narrative cinema between Eisenstein and Godard",
        "author": "abrightersummerday",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cbfqi/noncontinuity_editing_in_narrative_cinema_between/",
        "text": "Does anybody have some prime examples of experimental or non-traditional editing techniques used in narrative films before the French New Wave? \n\nI'm intentionally excluding films that would more likely be classified as experimental overall (i.e. Maya Deren or something), and also the Soviet experiments because Eisensein/Kuleshov is already an obvious starting point for innovation in editing. I'm looking for things I might have overlooked in films I *have* seen, or lesser known films that did something interesting. It could be just for one scene or even a single cut, or a technique used throughout.\n\n\nIf you could mention the film and also somewhat locate the usage within the film and explain what about it is different/experimental/innovative, that would be great. I know that some change and innovation in film is a slow accretion of variation over time, but there are also sometimes radical moves hiding inside unexpected films. I feel like the 30's/40'/50's are sometimes presented like \"Talkies. Screwball. Noir. Neo-Realism. Classic Hollywood.\" and some attention is given to cinematography and mostly it's about content. But there's not too much talk during this era about editing.\n\n\nSo, what ya got?",
        "created_utc": 1523749234,
        "upvote_ratio": ""
    },
    {
        "title": "An older person's entitlement to free cinema",
        "author": "TraditionalBisquit",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cb1yc/an_older_persons_entitlement_to_free_cinema/",
        "text": "An older acquaintance of mine is used to free television channel content and has downright bragged for never purchasing  a home video release. I encountered a discount bin in my local store filled  with classical era Hollywood blu-ray films for 2$ a piece and she, based on my interpretation, was annoyed for me spending money on movies \"which have aired on television\". On another occasion when passing TV series shelf her response was close to \"who the fuck buys these when you can watch  for free on TV?\". There certainly are no VHS cassettes, DVDs or blu-rays in her home and she doesn't have a DVD player or a VCR.   \nI haven't yet fought back in any capacity — we'll see how she reacts to my research about commercial channels' rampant [pan and scan](https://en.wikipedia.org/wiki/Pan_and_scan) (cropping aspect ratio) use, low video and audio quality, nearly complete lack of uncensored (if the release version was cut) and \"director's cut\" versions when available, prioritizing titles with large commercial appeal  and ignoring foreign releases, absent extra features, potentially cut end credits and forced subtitles with no option to change language. Note that I haven't yet even mentioned advertisements or my desire to support the creators.\n\nIt is often said that internet has devalued media, but I'm sure that there are many more people past 50 who are unwilling to pay for film, perhaps  aside from occasional (i.e. once a year or less frequently) theater ticket.",
        "created_utc": 1523745418,
        "upvote_ratio": ""
    },
    {
        "title": "What are some horror movies without sound?",
        "author": "Sinnequin",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8cauz5/what_are_some_horror_movies_without_sound/",
        "text": "[removed]",
        "created_utc": 1523743591,
        "upvote_ratio": ""
    },
    {
        "title": "Character Autopsies from The Last Jedi (SPOILERS)",
        "author": "Glip-Glops",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c9plk/character_autopsies_from_the_last_jedi_spoilers/",
        "text": "[removed]",
        "created_utc": 1523732968,
        "upvote_ratio": ""
    },
    {
        "title": "Dazed and Confused: the Quintessential Teen Movie",
        "author": "ifyourheadexplodes",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c8lzb/dazed_and_confused_the_quintessential_teen_movie/",
        "text": "[removed]",
        "created_utc": 1523723227,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for a film podcast on the in-depth/artier side of things, anyone have any recommendations?",
        "author": "howsoonisnow23",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c7zaq/im_looking_for_a_film_podcast_on_the/",
        "text": "[removed]",
        "created_utc": 1523717222,
        "upvote_ratio": ""
    },
    {
        "title": "Cartoons are Serious Business",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c7h33/cartoons_are_serious_business/",
        "text": "[deleted]",
        "created_utc": 1523711789,
        "upvote_ratio": ""
    },
    {
        "title": "CARTOONS ARE SERIOUS BUSINESS",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c7b11/cartoons_are_serious_business/",
        "text": "[removed]",
        "created_utc": 1523709753,
        "upvote_ratio": ""
    },
    {
        "title": "Why Annihilation works [SPOILERS]",
        "author": "ericgggggg",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c6p1e/why_annihilation_works_spoilers/",
        "text": "Annihilation left me sitting there with an excited confusion that every good sci-fi, horror or thriller film must do. But why? For much of the film my freckled nose was turned up at some questionable acting, some questionable storylines, some weak cgi. I continuously criticise the film for dialogue based scenes that were disappointingly dull and generic. These moments litter the film and pushed me from every inch of my desperate immersion. I wanted to love it. Alex Garland is obviously a talented writer and director. Ex Machina is superb in its sleek design yet I struggle to see how the same man can leave Annihilation with such basic flaws. But a month after repeated viewings I still think about it. I still hear that other worldly synthesiser riff, if it may be labelled that. I still fantasise about meeting my own chrome, mirror dance partner. \nThe film works because of its concept. Every inch of the story, the characters the production itself, the web of Alex Garlands creation, the novel that inspired it all rest upon this focal point. \nI came to liken this understanding of the film's success to that of what may be the best horror film of all time, The Shining. Kubrick's final shot reveals to us that the evil of the Overlook is ever lasting, that the horror is beyond our grip of the time we spent watching a family quietly go insane together. The crux of it being that the evil of the story, the antagonist is something beyond our conception, something that is unsolved and forever a mystery to our understanding. And this same stroke of genius is why Annihilation works.\nThe antagonist in Garland's adapted film is beyond our grasp. We see it in multiple forms but it is an idea, an entity beyond our the reach of out comprehension. The mystery of the story is unsolved and we are left haunted by the fact this entity is still out there and still we fail to really grab hold of an understanding of what the shimmer really is. Every moment I think of the film all of it's flaws are choked by my contemplative fascination with the concept and my doubt and criticism is suddenly coloured by praise and wonder. \nI hope people understand my adoration for the film. \nA piece of art not limited to the bounds of conclusion and tied up ends is ever more the fascination of a jaw dropped audience. \n",
        "created_utc": 1523700907,
        "upvote_ratio": ""
    },
    {
        "title": "Apocalypse Now and All That Heaven Allows: Emptiness of American Culture?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c4qbn/apocalypse_now_and_all_that_heaven_allows/",
        "text": "[deleted]",
        "created_utc": 1523673492,
        "upvote_ratio": ""
    },
    {
        "title": "The failure of body horror in Raw (2016)",
        "author": "FrayedHats",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c3lpz/the_failure_of_body_horror_in_raw_2016/",
        "text": "An inflammatory title, I know. There's a lot to like about *Raw,* with it's excellent story, characterization, acting, as well as its political discourse and sexual allegories. Personally, I loved it. But I have some reservations about how effective its cannibalism is as body horror.\n\nFirst off, audiences are divided on how \"gory\" the film is. Some think it's unsettling, some don't. I'm on the side that thinks it was fairly tame, but I don't think it's necessary to make a film gory to make body horror. Laura Dern's \"clown face\" in *Inland Empire*, for example, is done purely through distortion, but I find it extremely unsettling. \n\nMy problem with *Raw* is this: all of the actors (male and female, young and old) were attractive in a way that is frequent in European indie films. They had a realistic beauty (not Hollywood beauty). But even in during the cannabalism scenes, they were still recognizably beautiful through the blood, paint, or wounds.\n\nI think that body horror works best when you have an actor who is both attractive and slightly unusual looking. Jeff Goldblum in *The Fly* and Sissy Spacek in *Carrie* I think are two of the best casting choices in this respect. They're both extremely attractive people, but also know how to make themselves unsettling with subtle changes in behaviour. (Even though in *The Fly* he ultimately has a lot of gory makeup, Goldblum begins with very little makeup and it works.)\n\nIn *Raw,* I contend that the actors were attractive people who acted slightly awkward. Agree or disagree? And what do you think makes effective body horror?",
        "created_utc": 1523662254,
        "upvote_ratio": ""
    },
    {
        "title": "My interpretation of \"Annihilation\"",
        "author": "Saditon",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c2ubd/my_interpretation_of_annihilation/",
        "text": "This post will contain spoilers for *Annihilation*\n\nA couple of weeks ago, I watched *Annihilation*, a film that I've become more and more fond of with the passing of each day. It's one of those films that had me thinking long after the credits had stopped rolling. Now, after having thought about it for some time, I've come up with a theory of what the film meant. (I've made a blog post about it where I go into more detail, so if you're interested you can read it [here](https://wp.me/p8oJrz-KO)).\n\nIt basically boils down to this: The Shimmer represents a period of self-destruction one goes through, a depression if you will. People who go in, don't have a bright future in front of them, and as we learn in the film, not a lot of them come out either. The monsters our characters have to face represent their own personal demons, which they'll have to defeat in order to reach the light at the end of the tunnel (the lighthouse). But, even if they reach the light, they won't come back as the same person they were before entering (like Kane, of whom a copy was sent back). You'll have to fight yourself, to try and stay who you once were and to successfully exit the period of self-destruction as yourself, but even then you'll still carry the scars left by that period (the shimmer left in the eyes of Lena)\n\nThat's in short my interpretation of \"Annihilation\". What did you think of it? And how do you interpret the film?",
        "created_utc": 1523655439,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it that \"Return of the Jedi\" is considered to be the weakest of the Star Wars Original Trilogy?",
        "author": "murmur1983",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c2oa4/why_is_it_that_return_of_the_jedi_is_considered/",
        "text": "Hello, everyone. I like Star Wars a lot; I've been a fan of the franchise for as long as I can remember, and I've always liked the lightsaber battles, Force usage &amp; overall atmosphere of Star Wars. It took me a while to watch the Star Wars Original Trilogy, but I really liked it. I love \"A New Hope\" &amp; \"The Empire Strikes Back\", and I really liked \"Return of the Jedi\", as well. I think that the original Star Wars films are classics, and \"The Empire Strikes Back\" comes close to being a perfect movie. \n\nHowever, one thing that I've noticed, is that \"Return of the Jedi\" is generally considered to be the weakest entry of the original trilogy. For example, on Rate Your Music, \"A New Hope\" &amp; \"The Empire Strikes Back\" have average ratings of a 3.89/5.0 and a 4.08/5.0, respectively. \"A New Hope\" &amp; \"The Empire Strikes Back\" are in Rate Your Music's top 100 movies of all time chart, and both of them appear in Rate Your Music's top 20 films of their respective decades. Also, on IMDb, \"A New Hope\" &amp; \"The Empire Strikes Back\" have average ratings of an 8.6/10 &amp; an 8.8/10, respectively. \n\nHowever, on Rate Your Music, \"Return of the Jedi\" has an average rating of a 3.66/5.0, and it has an 8.3/10 on IMDb. Also, on Rate Your Music, \"Return of the Jedi\" is ranked #471 overall, but it isn't in that website's top 100 movies of all time chart, and there seems to be a HUGE disparity between \"Return of the Jedi\" &amp; \"A New Hope\" &amp; \"The Empire Strikes Back\", in the charts. \n\nAdditionally, \"Return of the Jedi\" has a lower percentage on Rotten Tomatoes than \"A New Hope\" &amp; \"The Empire Strikes Back\". Rotten Tomatoes said that \"Return of the Jedi\" failed to reach the cinematic heights of its predecessors, and \"Return of the Jedi\" has a 58 on Metacritic. \n\nIn general, it seems like \"Return of the Jedi\" is considered to be the worst film in the original trilogy, and that it is a flawed, but enjoyable movie. I think that the original trilogy as a whole is great, but can any of you guys weigh in on this? ",
        "created_utc": 1523653997,
        "upvote_ratio": ""
    },
    {
        "title": "Doubt (2008) and a couple questions",
        "author": "Akushapeshifter",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8c2kkv/doubt_2008_and_a_couple_questions/",
        "text": "Doubt begins with a sermon about doubts the faithful have in the Lord in the face of a society that's often fraught with tragedies and unexplained injustice. Over the course of the movie, however, the rot sets inside the church not in secular society. \n\nIs Meryl Streep confessing her doubt about God to Amy Adams at the end? Or is she concerned that she didn't necessarily do the right thing for Donald ultimately? Also, what's the deal with the fingernails?",
        "created_utc": 1523653135,
        "upvote_ratio": ""
    },
    {
        "title": "Award Winning Guillermo Del Toro-Style Horror Short Film made in just one take?",
        "author": "decarabia19",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8bzn93/award_winning_guillermo_del_torostyle_horror/",
        "text": "I saw this horror short film at Sitges Film Festival last year (https://www.youtube.com/watch?v=0-6OamV7A3o) and I was really amazed at how it all looked as if it was shot in just one take. Now that it's on YouTube, I can see some of the whip pans at the beginning and at the end (when the girl looks at the window and when she goes upstairs), but I can't really spot any other cuts. Can you guys help me with this?",
        "created_utc": 1523630332,
        "upvote_ratio": ""
    },
    {
        "title": "Casual Discussion Thread (April 13, 2018)",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8bzgxy/casual_discussion_thread_april_13_2018/",
        "text": "#[Be Fun and Fancy Free!](https://www.youtube.com/watch?v=fk3q8J5vilU), and remember to sort comments by \"new\" on these threads, too!#\n\nGeneral Discussion threads threads are meant for more casual chat; a place to break most of the frontpage rules. Feel free to ask for recommendations, lists, homework help; plug your site or video essay; discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n***\n\n**Follow us on:**\n\n- [Letterboxd](http://letterboxd.com/truefilmreddit/) \n\n- [Twitter](https://twitter.com/truefilmreddit)\n\n***\n\nThe sidebar has a wealth of information, including links to the subreddit rules, our killer wiki, all of our projects... If you're on a mobile app, click the \"(i)\" button on our frontpage. \n\nSincerely,\n\nDavid\n",
        "created_utc": 1523628878,
        "upvote_ratio": ""
    },
    {
        "title": "Award Winning Guillermo Del Toro-Style Horror Short Film made in one shot! (spanish with english subtitles)",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=0-6OamV7A3o",
        "text": "[deleted]",
        "created_utc": 1523628397,
        "upvote_ratio": ""
    },
    {
        "title": "The opening shot of 'Le Samourai' and request to share some of your own favourite opening shots/scenes/sequences.",
        "author": "TheSarcasticWanderer",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8bzeiw/the_opening_shot_of_le_samourai_and_request_to/",
        "text": "I just rewatched Melville's 'Le Samourai' and even though the whole film itself is spectacular(at least to me), I want to talk about that opening shot/image. We see a darkened room with Costello lying(almost in an indiscernible way) on the bed with the caged bird at the center of the shot. He then lights a cigarette and puffs and the smoke gently floats in the air as the shot starts undulating. This image perfectly underlines the contemplative and existential undertones of the film as a whole and immediately manages to present this central character as a somewhat lost, mysterious and enigmatic figure. \n\nThis got me thinking. What opening shots/scenes/sequences would you consider some of your favourites? It could be very famous and popular ones, it could also be very specific, obscure or maybe even seemingly unremarkable ones. ",
        "created_utc": 1523628326,
        "upvote_ratio": ""
    },
    {
        "title": "The movie \"Trance\" with Vincent Cassel, could someone explain the plot to me ?",
        "author": "AlertTangerine",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8bz27t/the_movie_trance_with_vincent_cassel_could/",
        "text": "There is one film that I really would like to understand.\nThroughout all the twists and turns, the movie really leaves me at the end thereof with the questions as to what goes on.\nWho did steal the painting ?\nWhere did it go ?\nWho is who ?\nAre there \"fictional\" characters amongst the characters of the movie ( which in turn is a fiction - INCEPTIONNN lol ) ?\nI meant to say are there some characters that are only in one person's mind ?\n\nI really am far from understanding both the timeline, the events, how they link into one another and how to make sense of the whole movie.\n\nPlease, could you let me know - and do you know any source with \"official answers\" rather than just some personal opinions ?\nThough, to be fair, I would prefer personal opinions to no other views at all - I am quite lost with the ones I know of that come from how I personally experienced the movie.\n\nThanks in advance.\n\nI really would like to know, for some reason I believe this would be quite a shift in perspective for me to understand in-depth what went on during the length of said movie.",
        "created_utc": 1523625303,
        "upvote_ratio": ""
    },
    {
        "title": "Film Criticism: why it doesn't work",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8bxqzn/film_criticism_why_it_doesnt_work/",
        "text": "[deleted]",
        "created_utc": 1523610026,
        "upvote_ratio": ""
    },
    {
        "title": "The Social Network--",
        "author": "jtsports27",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8bx4v8/the_social_network/",
        "text": "[removed]",
        "created_utc": 1523601248,
        "upvote_ratio": ""
    },
    {
        "title": "The Flash ladies' lovers looking down this desirable Outfit. What are you holding up to get it now and take advantage of your new Cosplay?",
        "author": "[deleted]",
        "url": "https://www.filmsjackets.com/speedster-the-flash-iris-west-jacket",
        "text": "[deleted]",
        "created_utc": 1523600994,
        "upvote_ratio": ""
    },
    {
        "title": "Defending John Hughes from Molly Ringwald’s Woke Attack",
        "author": "[deleted]",
        "url": "http://www.breitbart.com/big-hollywood/2018/04/11/molly-ringwald-puts-john-hughes-breakfast-club-trial-metoo-violations/amp/",
        "text": "[deleted]",
        "created_utc": 1523588661,
        "upvote_ratio": ""
    },
    {
        "title": "A Quiet Place (2018): Balancing enjoyment factor with formal flaws",
        "author": "canuckfanatic",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8buukh/a_quiet_place_2018_balancing_enjoyment_factor/",
        "text": "I thoroughly enjoyed A Quiet Place. One of my favourite films of 2018 so far. I was engrossed from start to end and left the theater completely satisfied. \n\nThat being said, it wasn't difficult to start questioning elements of the film and the internal logic of the world built within it. \n\nPersonally, if I enjoy a film I can forgive most flaws so long as those flaws don't (individually or cumulatively) affect my enjoyment of the film. I felt that none of the flaws of A Quiet Place interrupted or negatively affected my enjoyment during the screening, even though upon reflection there were logical issues with the plot - among other things.\n\nHow do you all balance this? Obviously all films have flaws, nothing is perfect, so how do you find yourself balancing things?\n\nAdditional note: I gave A Quiet Place a 9/10 on the basis that I believe it was original and well executed and thoroughly engrossing. I appreciated how lean it was, with no useless moments. The sound design also blew me away.\n\nIn my own head, a 10/10 is a film that I would not change one bit.",
        "created_utc": 1523577096,
        "upvote_ratio": ""
    },
    {
        "title": "Giving Rey a conflict of interest in The Last Jedi: if Luke killed Rey’s parents",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueFilm/comments/8bufb3/giving_rey_a_conflict_of_interest_in_the_last/",
        "text": "[deleted]",
        "created_utc": 1523573274,
        "upvote_ratio": ""
    }
]