[
    {
        "title": "How can one become more self-cognitive?",
        "author": "Zavarakatranemi",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/42gkud/how_can_one_become_more_selfcognitive/",
        "text": "What questions, if any, can we ask ourselves to become more self-cognitive? Are there \"suggested readings\"? Is self-cognition only available via experiencing the world, or can it be approached theoretically? Are there core topics or ideas that one can do research and think on, that could reveal or form parts of the self?",
        "created_utc": 1453654380,
        "upvote_ratio": ""
    },
    {
        "title": "What can people do to get out of karmic debt?",
        "author": "flimsyfresh",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/42f8bk/what_can_people_do_to_get_out_of_karmic_debt/",
        "text": "We've all screwed others over for our own selfish reasons, to varying severities. We can't apologize to the people we've cut off on the freeway or the midget you called out at that party that one time, but we can try and erase the debt. I'm curious to see what suggestions you guys have. ",
        "created_utc": 1453625113,
        "upvote_ratio": ""
    },
    {
        "title": "How much thought does the average college student give when deciding which major to choose?",
        "author": "Chris_Hansen_AMA",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/42ecsk/how_much_thought_does_the_average_college_student/",
        "text": "[removed]",
        "created_utc": 1453607010,
        "upvote_ratio": ""
    },
    {
        "title": "When exactly is first world complaing considered alright (\"Don't feel bad, there are starving kids in Africa\") or not (\"I know you hate your job, but so many people would kill to have it\").",
        "author": "whatamidoing11",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/42azaw/when_exactly_is_first_world_complaing_considered/",
        "text": "I started really thinking of this idea in a topic about someone quitting their dream job as a video game designer for a huge game to make their own small company and have more involvement in the project.  I made a provocative comment just to honestly see what the response would be:\n\n\"Just imagine telling our great-great grandfathers who probably worked in coal mines and factories and farms under terrible conditions that our job of sitting in an air conditioned office and making near photorealistic objects with state of the art software for this magical entertainment medium isn't really fulfilling us in the right way.\"\n\nAs you might expect, it was very negatively received, and I can see why.  But it really got me thinking.  We all have visceral reactions to spoiled children, and it's pretty well accepted to tell a kid throwing a temper tantrum because their parents wont give them an iPad that there are starving kids in Africa or how there were no iPads when we were younger or whatever.  Basically using the same argument as far as I can see.\n\nIn those uplifting quote pictures you see all over Facebook and even here, a nice picture of a flower with a quote about how you should count your blessings, and you don't have it so bad because other people are less fortunate, is considered socially acceptable and even inspiring.\n\nEven brusque comments that show the same sentiment, like Louis CKs joke about how on the first flight he was ever on that had in-air internet, it broke down and the guy next to him started complaining that it was \"bullshit\", are well received.\n\nSo what is it?  When are you allowed to safely complain about something?  Or is \"others have/had it worse\" always a legitimate response to a complaint?  Is actual \"first world\" complaining ever justified?  For example, what I'm getting at is that we'd all say a 25 year old man child who never had a job and is living with their parents is acting spoiled if he's becoming enraged that the patch to his favorite game was delayed by a week.  But I can't help thinking that to the starving African child, a complaint like \"My objectively awesome job is not quite fulfilling me in the way I'd want\" is almost indistinguishable from the former in terms of ludicrousness.",
        "created_utc": 1453558693,
        "upvote_ratio": ""
    },
    {
        "title": "Trump supporters: what do you think of East Asians (Chinese, Korean, Japanese)?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4284q0/trump_supporters_what_do_you_think_of_east_asians/",
        "text": "[removed]",
        "created_utc": 1453503964,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a website that summarises ted talks?",
        "author": "Mr-internet",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/427tbo/is_there_a_website_that_summarises_ted_talks/",
        "text": "[removed]",
        "created_utc": 1453499704,
        "upvote_ratio": ""
    },
    {
        "title": "What are some questions that aren't so much hard to answer as they are hard to comprehend?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4253xz/what_are_some_questions_that_arent_so_much_hard/",
        "text": "[removed]",
        "created_utc": 1453461594,
        "upvote_ratio": ""
    },
    {
        "title": "What would you do if Trump were actually elected?",
        "author": "sonic_tower",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/422vky/what_would_you_do_if_trump_were_actually_elected/",
        "text": "[removed]",
        "created_utc": 1453421360,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we feel such strong feelings for the past?",
        "author": "xStaabOnMyKnobx",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41yqwt/why_do_we_feel_such_strong_feelings_for_the_past/",
        "text": "I have been thinking a lot recently about the way we, as a people, hold the past in such a high regard. *\"Things were better back in my day!\"*...or along the same lines. For example, I'll hear songs or see images from video games I played a lot in my childhood and be overtaken by nostalgia, on the verge of getting misty eyed.\n\nI'll concede that I may feel more than others in regards to the past, but I believe people tend to hold the past in higher regard than it actually may have been. Do you guys agree? Why might this be the case? Is there a psychological basis? How does one's culture effect the way one perceives the past? \n\nI'd love to hear your guy's thoughts on this and perhaps times you've felt strong nostalgia. Even if you have a dissenting view, feel free to voice your opinion! ",
        "created_utc": 1453358432,
        "upvote_ratio": ""
    },
    {
        "title": "What's your best guess as to what the future will be like 100 years from now?",
        "author": "SubsequentDownfall",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41yql3/whats_your_best_guess_as_to_what_the_future_will/",
        "text": "",
        "created_utc": 1453358278,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we shelter children from nudity?",
        "author": "NotMySeventhAcct",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41ycav/why_do_we_shelter_children_from_nudity/",
        "text": "Many parents keep their kids from seeing nudity as if it'll have a negative affect. Is there any reason besides \"I don't want them seeing that\"?",
        "created_utc": 1453351648,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good leadership skills, and how do you teach that to children? (In a classroom)",
        "author": "Auxotrophic",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41x4ak/what_are_some_good_leadership_skills_and_how_do/",
        "text": "[removed]",
        "created_utc": 1453333897,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone tell me which author(s) inspired French writer \"Albert Camus\" ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41vyi7/can_anyone_tell_me_which_authors_inspired_french/",
        "text": "[removed]",
        "created_utc": 1453318649,
        "upvote_ratio": ""
    },
    {
        "title": "How do older members of the Black community feel when the younger generation insists that they have it just as hard as it was back then?",
        "author": "uoaei",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41vnu0/how_do_older_members_of_the_black_community_feel/",
        "text": "[removed]",
        "created_utc": 1453315046,
        "upvote_ratio": ""
    },
    {
        "title": "Why are a significant amount of reddit users racist?",
        "author": "mooonman",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41tjhg/why_are_a_significant_amount_of_reddit_users/",
        "text": "[removed]",
        "created_utc": 1453279972,
        "upvote_ratio": ""
    },
    {
        "title": "The tech age has brought so much exposure to everything happening in the world, and so many opinions about it as well. How do you stay informed? How can you find unbiased and trustworthy sources?",
        "author": "mechanicalengr",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41ql52/the_tech_age_has_brought_so_much_exposure_to/",
        "text": "[removed]",
        "created_utc": 1453235690,
        "upvote_ratio": ""
    },
    {
        "title": "What has the closest probability to winning a lottery?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41qhg0/what_has_the_closest_probability_to_winning_a/",
        "text": "[removed]",
        "created_utc": 1453234356,
        "upvote_ratio": ""
    },
    {
        "title": "In reference to the Black Lives Matter movement, do you think shutting down roads and freeways and generally being disruptive to the general public is an effective protest tactic?",
        "author": "Chris_Hansen_AMA",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41q7dg/in_reference_to_the_black_lives_matter_movement/",
        "text": "I believe any movement, in order to be heard and discussed, needs a level of disruption. \n\nA lot of people believe they are only creating enemies and losing support for their movement because of these disruptions.\n\nWhat do you think?",
        "created_utc": 1453230676,
        "upvote_ratio": ""
    },
    {
        "title": "What was the world's first piece of non biodegradable human-made trash?",
        "author": "TrickClocks",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41q4ng/what_was_the_worlds_first_piece_of_non/",
        "text": "[removed]",
        "created_utc": 1453229772,
        "upvote_ratio": ""
    },
    {
        "title": "Why does God command we kill all of the faggots?",
        "author": "godrules666",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41m8ok/why_does_god_command_we_kill_all_of_the_faggots/",
        "text": "[removed]",
        "created_utc": 1453167329,
        "upvote_ratio": ""
    },
    {
        "title": "For those who are against testing products on animals--what is your alternative? To test them on humans? Or do you feel that things like chemotherapy, shampoo, and sunscreen should not be further developed?",
        "author": "AndyTheKid258",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41k7ez/for_those_who_are_against_testing_products_on/",
        "text": "I'm a researcher and a hematology/oncology fellow at one of the world's premier pediatric children's research hospitals. My work is split 50/50 between researching novel chemotherapy agents--all with the use of lab mice--and treating sick children with cancer. I feel badly for all of the terrible chemicals to which we expose our animals, and we have groups like PETA who protest from time to time, but I can't help but thinking: What's the alternative? To skip animal testing and just test these new compounds on sick children? Or is the only alternative to just stop developing new drugs and cease progress in this field?\n\nEDIT: Thanks everyone for their comments, and I’m glad that this post received some attention.  Animal testing is a difficult ethical issue with no clear answers, and I appreciate people sharing their opinions.  My eyes were opened to a number of points that I had not yet considered, and I thank you for that.  Feel free to continue commenting. Wishing you all the best~",
        "created_utc": 1453141539,
        "upvote_ratio": ""
    },
    {
        "title": "If I had received all my news from /r/politics and /r/worldnews in, say, the last month, which important news stories would I have missed?",
        "author": "zeptimius",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41hxrw/if_i_had_received_all_my_news_from_rpolitics_and/",
        "text": "[removed]",
        "created_utc": 1453102544,
        "upvote_ratio": ""
    },
    {
        "title": "Does single payer healthcare speed up or slow down the current movement towards mega-corporations from private practice providers?",
        "author": "angryherbalist",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41hbv1/does_single_payer_healthcare_speed_up_or_slow/",
        "text": "This has been the largest year for M&amp;A in healthcare in history.  Private practice is unsustainable; companies must scale and span multiple verticals to compete.  \n\nThe days of the local, private doctor or pharmacy are numbered.  \n\nIf we move to single payer, will this force the pendulum back in the other direction?\n\nOr will reimbursements to providers continue to decrease?",
        "created_utc": 1453091670,
        "upvote_ratio": ""
    },
    {
        "title": "Does the Publisher still serve a role in the modern Gaming industry moving forward?",
        "author": "ertihan",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41gjtt/does_the_publisher_still_serve_a_role_in_the/",
        "text": "In the past, the relationship between Publisher and Developer was: the Developer made the game, and the Publisher did all the marketing and sales.  This was needed because back then, selling your game meant selling physical copies of it.  You needed to make deals with places like EB Games, Gamestop, Walmart, Target, etc.  But because the Publisher was in charge of marketing and sales, they also got to make the decisions on certain business practices.  Thus were born the preorder, preorder bonuses, cut content, shoddy releases, etc.\n\nRecently, the publisher SEGA and their developer Creative Assembly announced for their upcoming video game \"Warhammer: Total War\" that the Chaos Warriors faction, a major antagonist faction, would be sold separately as DLC (though you could get it for \"free\" if you preorder, but there have been excellent analysis on how preorders are far from \"free\").  This was not extra content developed after the game was finished; the fact that you could get it on day one proves the content was developed _with_ the game and then purposefully cut out and sold to us.\n\nCreative Assembly has come out and claimed that the DLC content was developed \"in parallel\".  However, we only have their word on that; they have no means with which to back up such a claim.  If they hadn't repeatedly lied to us with Empire, Rome II, and Atilla, we might have given them the benefit of a doubt.\n\nBut the point I'm trying to make here is I don't think CA did this at all.  Remember, it's the _Publisher_ who is in charge of marketing decisions, and cutting content for a day-one DLC is a marketing decision.  So the blame lays squarely at SEGA's feet.  Notice that SEGA has remained radio silent throughout this fiasco - they're throwing their Developer to the wolves to save themselves.\n\nAnd that brings us back full-circle.  Why does CA even _need_ SEGA?  Why does _any_ Developer need a Publisher anymore?  Gone are the days when games could only be bought at a brick and mortar store.  With XBox Live, the Playstation Network, Steam, Good Old Games, and the internet in general, developers can self-publish more easily than ever.\n\nSo what do you guys think?  Could we ever see a day where the Publisher is a relic of the past?  Or do they still serve some purpose in the industry besides being the financial vampires of the Developers?",
        "created_utc": 1453079965,
        "upvote_ratio": ""
    },
    {
        "title": "What do YOU believe is the the purpose (or meaning) of existence? of life? of the universe?",
        "author": "rudolfs001",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41g39e/what_do_you_believe_is_the_the_purpose_or_meaning/",
        "text": "[removed]",
        "created_utc": 1453073447,
        "upvote_ratio": ""
    },
    {
        "title": "What is the most immoral action that you have done accidentally?",
        "author": "english_major",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41e3we/what_is_the_most_immoral_action_that_you_have/",
        "text": "I think that this is an interesting question, because morality usually involves intent. However, carelessness on someone's part can have huge repercussions. \n\nWhen I was a kid, a boy in my scout troop died when his father backed up over him on his bike. The father was found innocent of wrongdoing likely because he suffered enough. In reality though, he wasn't being careful enough. \n\nDoes anyone here have any stories? What were the repercussions for you?  ",
        "created_utc": 1453046855,
        "upvote_ratio": ""
    },
    {
        "title": "Why is pentagon delaying the transfer of detainees in Guantanamo Bay?",
        "author": "CoMaestro",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41dh5l/why_is_pentagon_delaying_the_transfer_of/",
        "text": "[removed]",
        "created_utc": 1453036965,
        "upvote_ratio": ""
    },
    {
        "title": "Hypothetically (or not), what important classes should a Muslim refugee cultural assimilation program consist of?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41dbfh/hypothetically_or_not_what_important_classes/",
        "text": "[deleted]",
        "created_utc": 1453034127,
        "upvote_ratio": ""
    },
    {
        "title": "Why does the USA not have a gun license in the vein of Driver's Licences?",
        "author": "ertihan",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/41clhz/why_does_the_usa_not_have_a_gun_license_in_the/",
        "text": "So this one has burned in my mind for many a year, so maybe some gun-lovers can explain to me exactly _why_ you all hate this concept so much.  Look, from my understanding, the Driver's License's purpose is to ensure that when you drive that new car off the lot, we have a reasonable expectation you're not going to smash it into the nearest tree, or run over the closest pedestrian.  This is because at least one rational human being has signed off on your driving skills (i.e. the person who gave you the driver exam), so we can have some minimum expectation of knowledge from you in regards to basic vehicle safety.\n\nAnd yet, the same level of care is explicitly _not_ required of gun owners.  Someone with absolutely no training, no _intention_ of getting training, can walk into a gun store and so long as they aren't insane, a convict, or not a citizen of this country, can purchase any gun they want.  I just don't see how people don't see that as absurdly dangerous.\n\nNow full disclosure: I'm pretty vehemently anti-gun myself.  I won't deny that, nor will I deny such a stance could indeed color my opinions on this matter.  If magic existed in the real world, and I got myself a genie and he offered to remove every gun in the USA with a sweep of a magic wand, would I do it?  Absolutely, yes I would.  But obviously, magic does not exist, and I have to live in a reality where there's two guns for every person in this country, many of which can't be accounted for because they were sold to someone out the back of somebody's jeep at night in a McDonald's parking lot.\n\nNow my understanding is that the majority of gun deaths in this country are accidental [EDIT: I've been informed that this is in fact incorrect.  Apologies for the inaccuracy], caused by either stupidity or ignorance.  The old saw that the most common last words in history are \"Hey, watch this!\" and \"Oops!\" come to mind here.  I don't own a gun, never have, and never intend to, yet even I know that you're not supposed to keep your finger on the trigger of the gun (at least, not unless you intend to fire it right that minute), that you're not supposed to sweep people with the barrel (or indeed, ever point your weapon at anything you don't intend to destroy), and to _always_ assume a gun is loaded, _especially_ when it \"isn't\".\n\nSo how is it that people who've supposedly owned guns for years have blown their own heads off by trying to check if the barrel is clear by looking down it (with their fingers on the trigger, no less)?  Or shot themselves or others trying to \"demonstrate\" how a gun isn't loaded?  Or hand their 90 pound girlfriend a 50 caliber Desert Eagle and saying \"here, try this!\"?  I keep wondering, if we had some sort of systematized education system for guns in this country, a lot of these sorts of unnecessary accidental deaths wouldn't happen.  You might say, \"well I don't need any such education, my dad/grandpa/older brother took me out shooting bottles since I was five.\"  Good for you.  Not everyone has that.\n\nIf we're going to give every idiot in this country the right to own these dangerous tools, shouldn't we at the very least ensure via education that they won't kill themselves on accident with them?  And then test whether they've absorbed that information with a simple firearms safety exam?\n\nFrom my perspective, this just seems like common sense, and yet the idea of teaching firearms safety in schools is apparently vehemently opposed, the very concept of a \"shooter's license\" apparently incenses some people to near-violence, and I guess I just want to know what their counter-argument is.",
        "created_utc": 1453016217,
        "upvote_ratio": ""
    },
    {
        "title": "Who are the most prominent political intellectual writers of our time (still alive or recently deceased)?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/419nhr/who_are_the_most_prominent_political_intellectual/",
        "text": "[removed]",
        "created_utc": 1452970174,
        "upvote_ratio": ""
    },
    {
        "title": "If/When AIs substitute humans for work, are there measures in place to ensure income and capital be distributed fairly?",
        "author": "ColloquiallyFormal",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/418hgt/ifwhen_ais_substitute_humans_for_work_are_there/",
        "text": "[removed]",
        "created_utc": 1452952321,
        "upvote_ratio": ""
    },
    {
        "title": "Where dies Bowie stand or rank among contemporary icons?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/418770/where_dies_bowie_stand_or_rank_among_contemporary/",
        "text": "[deleted]",
        "created_utc": 1452947236,
        "upvote_ratio": ""
    },
    {
        "title": "Supporters and voters of Bernie Sanders here on TrueAskReddit, why should an independent like me vote for him?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/417pee/supporters_and_voters_of_bernie_sanders_here_on/",
        "text": "[removed]",
        "created_utc": 1452936701,
        "upvote_ratio": ""
    },
    {
        "title": "Close up photos of stars?",
        "author": "justbflat",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/417mcm/close_up_photos_of_stars/",
        "text": "[removed]",
        "created_utc": 1452934561,
        "upvote_ratio": ""
    },
    {
        "title": "What foreign policy mistakes and hypocritical demands have Western powers foisted upon the rest of the world that other countries are right to criticize and resent?",
        "author": "paralloyd",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4152gi/what_foreign_policy_mistakes_and_hypocritical/",
        "text": "[removed]",
        "created_utc": 1452891463,
        "upvote_ratio": ""
    },
    {
        "title": "In light of the recent sexual assault news in Europe, has your view on racism changed?",
        "author": "AIDSofSPACE",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/413lw9/in_light_of_the_recent_sexual_assault_news_in/",
        "text": "I feel that [this](https://www.reddit.com/r/worldnews/comments/412qld/german_leisure_centre_becomes_the_first_to_ban/) latest development has been thought provoking for me.\n\nPunishing the criminals is one thing, generalizing it to a whole ethnic stereotype is a separate issue. Let's cool our heads a bit and try a thought experiment: What if the location and ethnic groups were switched?\n\n* What if it was a pool in the US who banned all blacks after 3 black boys raped a local white girl. How would you feel? How would the public react?\n\n* What if it was a pool in Japan who banned all Caucasians after 3 white boys raped a local Japanese girl. How would you feel? How would the public react?\n\nWould such ethnic stereotyping be justified in every case regardless of the groups involved? Or is it justified only in this one case in Germany through some kind of cultural differences that only pins the blame on one particular group? Do you feel that racism can ever be justified? Or should we always punish only the individuals and give everyone else a fair chance?\n\nI want to have a discussion on these question. But first I suppose I should offer my own opinions. I think that, as the other local Germans, they would feel that their sense of safety within their own community has been violated. They would probably feel very real fear, anxiety, and disgust toward these migrants. They may choose to avoid them in public places, and even feel vulnerable regardless. On the other hand, as the other migrants who were not even part of the crime, this would be a very alarming experience. The people who are to be their new neighbours now shun them and discriminate against them for crimes committed by someone else who shares their background. While they may feel ashamed of those individuals, the harsh and arguably undeserved punishment would make the culture shock even more sobering. So I think that the pool staff were faced with a dilemma that has no right answer. And I can easily understand that they took the side of their fellow local Germans and took extreme measures to minimize the impact on their lifestyle. Are they racist for dong this? Yes. But it's only natural for people after traumatic events to recoil and protect themselves above all else.",
        "created_utc": 1452872803,
        "upvote_ratio": ""
    },
    {
        "title": "Should I let my friend try drugs?",
        "author": "throwaway64827",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40ye6n/should_i_let_my_friend_try_drugs/",
        "text": "[removed]",
        "created_utc": 1452790142,
        "upvote_ratio": ""
    },
    {
        "title": "Buying travel packages for two",
        "author": "twopatties",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40y8ib/buying_travel_packages_for_two/",
        "text": "[removed]",
        "created_utc": 1452788067,
        "upvote_ratio": ""
    },
    {
        "title": "My unhealthy affection towards a movie character",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40wxbe/my_unhealthy_affection_towards_a_movie_character/",
        "text": "[removed]",
        "created_utc": 1452764135,
        "upvote_ratio": ""
    },
    {
        "title": "What would actually happen if one country attacks/invades another?",
        "author": "KotoBani",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40vtyg/what_would_actually_happen_if_one_country/",
        "text": "Since I have little knowledge on the alliance/united nations protocol, what would happen if let's say USA invades/attacks a country that is/isn't a United Nations member? What will other countries do if it happens? Is it possible that a country with advanced military power to successfully invade other large country(China/Russia/Germany etc) in modern age? Would the country even start it in the first place? TIA!",
        "created_utc": 1452742725,
        "upvote_ratio": ""
    },
    {
        "title": "How did developed countries ever manage to convince their citizens to accept foreign aid and economic/refugee migration?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40vtlt/how_did_developed_countries_ever_manage_to/",
        "text": "Perhaps I am dazed by the echo chamber of Reddit, but I can't for the life of me find a group of people who would agree that international aid is good policy; everyone seems to be concerned about \"poor people here at home\" who are more deserving of that money (a fair point). Also, on issues relating to immigration, people are downright vicious when it comes to refugees and migrants. The biggest complaint is that \"we don't have enough jobs\".\n\nThe anger is so pervasive and so common that I am left to ponder:\n\nHow is it that governments were ever able to allocate funds for international aid and open their borders to migrants in the first place?\n\nDid they not hear the same objections that we hear today? Surely people have always complained that their economy was too weak to absorb migrants and to give charity money to other countries...and surely if none of these policies existed today it would be nigh-on impossible to enact any of them...so what was different about the years during which people were accepting toward multiculturalism and foreign aid? \n\nWere we charitable in the past but are no longer charitable? Or is there more to the story? \n\nThanks!",
        "created_utc": 1452742573,
        "upvote_ratio": ""
    },
    {
        "title": "How much would single payer actually cost each American?",
        "author": "angryherbalist",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40v2mp/how_much_would_single_payer_actually_cost_each/",
        "text": "[removed]",
        "created_utc": 1452731561,
        "upvote_ratio": ""
    },
    {
        "title": "How do you fight corporations?",
        "author": "toshi04",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40slfj/how_do_you_fight_corporations/",
        "text": "",
        "created_utc": 1452700496,
        "upvote_ratio": ""
    },
    {
        "title": "If you were a camera, what would you rant about your own owner who likes to take pictures of themselves?",
        "author": "gainoneloseone",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40sj15/if_you_were_a_camera_what_would_you_rant_about/",
        "text": "[removed]",
        "created_utc": 1452699582,
        "upvote_ratio": ""
    },
    {
        "title": "What is the name of that thing that some people do when you confront them with a personality fault and rather than accept it or denying, they say \"I'm bad, I suck, everything I do is wrong\" etc? It's a power move but what's its name?",
        "author": "simplereligion",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40qab3/what_is_the_name_of_that_thing_that_some_people/",
        "text": "[removed]",
        "created_utc": 1452658243,
        "upvote_ratio": ""
    },
    {
        "title": "Long dark night of the soul",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40ih33/long_dark_night_of_the_soul/",
        "text": "[removed]",
        "created_utc": 1452541456,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if everybody were suddenly rich?",
        "author": "UnityPunity",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40i51k/what_would_happen_if_everybody_were_suddenly_rich/",
        "text": "[removed]",
        "created_utc": 1452537481,
        "upvote_ratio": ""
    },
    {
        "title": "I've noticed people closest to me call me emotionless. But I consider myself overly emotional. Help me figure out my mind! (Psych)",
        "author": "musicman9294",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40friy/ive_noticed_people_closest_to_me_call_me/",
        "text": "[removed]",
        "created_utc": 1452498409,
        "upvote_ratio": ""
    },
    {
        "title": "Is loyalty something we should value?",
        "author": "2-4-decadienal5",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40fjj7/is_loyalty_something_we_should_value/",
        "text": "[removed]",
        "created_utc": 1452494445,
        "upvote_ratio": ""
    },
    {
        "title": "Should High School/Youth Tackle Football be Banned in the United States?",
        "author": "Pearberr",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/40c3j4/should_high_schoolyouth_tackle_football_be_banned/",
        "text": "[removed]",
        "created_utc": 1452445825,
        "upvote_ratio": ""
    },
    {
        "title": "When taking out the trash for pickup, is there any established etiquette in garbage bin placement?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4090mv/when_taking_out_the_trash_for_pickup_is_there_any/",
        "text": "[deleted]",
        "created_utc": 1452386614,
        "upvote_ratio": ""
    },
    {
        "title": "Can you vote for yourself when you are being impeached from an organization?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/408rpb/can_you_vote_for_yourself_when_you_are_being/",
        "text": "[removed]",
        "created_utc": 1452383037,
        "upvote_ratio": ""
    },
    {
        "title": "Let's roleplay. Say I am a US congressman. Convince me to care about something that you care but not many people do.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4087nf/lets_roleplay_say_i_am_a_us_congressman_convince/",
        "text": "[removed]",
        "created_utc": 1452375329,
        "upvote_ratio": ""
    },
    {
        "title": "Would right wing libertarianism and budget austerity still be as popular if the Berlin Wall didn't come down?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/4086n1/would_right_wing_libertarianism_and_budget/",
        "text": "[deleted]",
        "created_utc": 1452374956,
        "upvote_ratio": ""
    },
    {
        "title": "With all the chaos encricling the refugee crisis, is it finally time to bomb Syria?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/407fqf/with_all_the_chaos_encricling_the_refugee_crisis/",
        "text": "[deleted]",
        "created_utc": 1452364638,
        "upvote_ratio": ""
    },
    {
        "title": "Poets, jazz musicians, and even mathematicians often talk about the pure, subliminal and transcendental pleasure that is associated with their respective activities/fields. What is the nature of this form of satisfaction? What is the explanation for its existence?",
        "author": "wortschoepfer",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/406cmm/poets_jazz_musicians_and_even_mathematicians/",
        "text": "",
        "created_utc": 1452347770,
        "upvote_ratio": ""
    },
    {
        "title": "Poets, jazz musicians, and even mathematicians often talk about the pure pleasure, which has a subliminal and transcendental character, that is as associated with their respective activities. What is the nature of this form of satisfaction?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/406agp/poets_jazz_musicians_and_even_mathematicians/",
        "text": "[deleted]",
        "created_utc": 1452346477,
        "upvote_ratio": ""
    },
    {
        "title": "When a participant in an argument begins using personal attacks and insults rather than staying on the topic of the argument, what does that signify?",
        "author": "surelyucantbserious",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/401cth/when_a_participant_in_an_argument_begins_using/",
        "text": "[removed]",
        "created_utc": 1452264406,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone hear ever been suspended from uni for poor grade? Why? What did you do after?",
        "author": "buddy626",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zzxdl/has_anyone_hear_ever_been_suspended_from_uni_for/",
        "text": "[removed]",
        "created_utc": 1452234824,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the victim never responsible?",
        "author": "not-very-creativ3",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3ztubz/why_is_the_victim_never_responsible/",
        "text": "[removed]",
        "created_utc": 1452141225,
        "upvote_ratio": ""
    },
    {
        "title": "Cultural differences in social warmth",
        "author": "CloudSource",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zrrjd/cultural_differences_in_social_warmth/",
        "text": "I grew up in a very \"warm\" culture with a lot of physical contact, then immigrated to the U.S. where most people seem so awkward with anything beyond a handshake. Same thing can be said about many other countries of course, Japan for example. However, I noticed that the trend is mostly \"global north\" = cold and distant and \"global south\" = warm and intimate.\n\nWe're social creature by nature, and intimate contact through touching and grooming can still be seen in primates today. What do you think is the origin of these differences? and what is their effect on one's psychology and well being?\n\nAlso, what's your opinion on my categorization above?\n\n\n",
        "created_utc": 1452113564,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to have Power in Western society without Money?",
        "author": "Zjackrum",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zrjvk/is_it_possible_to_have_power_in_western_society/",
        "text": "[removed]",
        "created_utc": 1452110890,
        "upvote_ratio": ""
    },
    {
        "title": "Possible to reach first page of saved posts?",
        "author": "Wh0r3b1tc4",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zrjh0/possible_to_reach_first_page_of_saved_posts/",
        "text": "[removed]",
        "created_utc": 1452110744,
        "upvote_ratio": ""
    },
    {
        "title": "What is the future of North Korea and it's people?",
        "author": "Chris_Hansen_AMA",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zrejn/what_is_the_future_of_north_korea_and_its_people/",
        "text": "We know the NK people are in almost complete isolation from the outside world, the government throws innocent individuals and their family members into labor camps for petty crimes without a trial, and they're constantly threatening the world with nuclear attacks. Surely there will be a breaking point where an outside force steps in and stops some of this, right? Or maybe it'll be an internal revolt? Or something else?\n\nWhether it be 25, 50, or 100 years, I believe something has got to give. \n\nWhat do you think?",
        "created_utc": 1452108934,
        "upvote_ratio": ""
    },
    {
        "title": "How would increasing the taxes on the wealthy impact the United States economy?",
        "author": "returnthebomb1",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zqz3b/how_would_increasing_the_taxes_on_the_wealthy/",
        "text": "I would like to preface this discussion by saying that I am a person that likes to constantly keep an open mind even when I think I know the truth. I think that politics and economics are vastly complex systems that citizens often try to oversimplify to support their confirmatory biases. When someone says something that conflicts with my beliefs I often try my best to see things from their perspective. I think this is the single most important quality when looking to peruse personal growth. \n\nI am an independent with many liberal values. I believed for most of my life that the wealthy should pay more in taxes because the wealth distribution is unfair, and also unethical. People should not have enough money to sustain their bloodlines for thousands of years.\n\nI recently had a friend that went off the deep end with his neo conservatism on Facebook. He posted that he believes taxing the wealthy more will just cause them to leave our country. I do believe this is a big possibility. Huge corporations are a good model for this in that they often look to operate in countries that have the largest tax benefits. This discussion has taken place a lot in the media about companies like Apple exploiting these loop holes.\n\nThis leaves me with an internal tug of war between thinking taxation is a good solution, and thinking it might actually ruin the domestic economy. \n\nWhat do you guys think about this conundrum? Are there other solutions we have yet to explore? What is the long term solution to the issues of economic oppression and inequality?\n\nOn a side note I wanted to mention a well respected theory which states that at some point we will have the technology that less than half the population will actually be employable. When automation reaches this point we will then need to revisit the idea of socialism. Right now a lot of problems stem from the difficulty in getting a job that pays a livable wage. Once the perception of a job being a necessity changes how can we handle such a large demographic of people who cant work because its not expected of them.",
        "created_utc": 1452103458,
        "upvote_ratio": ""
    },
    {
        "title": "Can you help me identify my political leanings?",
        "author": "2-4-decadienal5",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zqnwm/can_you_help_me_identify_my_political_leanings/",
        "text": "[removed]",
        "created_utc": 1452099734,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn't everyone a humanist?",
        "author": "Stfgb",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zpky2/why_isnt_everyone_a_humanist/",
        "text": "[removed]",
        "created_utc": 1452083329,
        "upvote_ratio": ""
    },
    {
        "title": "Since Twitter will soon allow tweets that are up to 10,000 characters, will it still be the leading network for colored people?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zpb58/since_twitter_will_soon_allow_tweets_that_are_up/",
        "text": "[removed]",
        "created_utc": 1452077201,
        "upvote_ratio": ""
    },
    {
        "title": "How much do you think modern ideas about love and marriage are affecting the divorce rate?",
        "author": "ThatsAllFolks42",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zn1xg/how_much_do_you_think_modern_ideas_about_love_and/",
        "text": "Looking at simply the end result, it would seem to me that marrying young and even to someone you don't know very well, has a higher success rate (defined by the length of the marriage and the overall happiness of the couple throughout), than marrying later in life after a long period of dating.\n\nMy own opinion on this, is that in the past, young people were expected to get married younger so as to have children who could support them later and for mutual benefit for the the couple (financial support for the woman and domestic support of the man). This meant that the first (or close to first) solid choice was who most people ended up. This meant that you had to learn how to respect and get along with the other person quickly. Couples grew to love each other as a natural result of living together and sex.\n\nWhile we have made awesome progress as far as gender roles are concerned, I think we now pay too much attention to our emotional desires, which are temporary and seem to result in self-centric relationships.\n\nThese are of course, just my thoughts and I'm no social scientist. What do think reddit?",
        "created_utc": 1452039004,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] I(25M) seemed to be ostracized by my peers in my school for being a single male. I am completely content with being single since I consider myself to still be relatively young and having fun dating around. How do I respond to my peers?",
        "author": "Andgelyo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zmami/serious_i25m_seemed_to_be_ostracized_by_my_peers/",
        "text": "[removed]",
        "created_utc": 1452029327,
        "upvote_ratio": ""
    },
    {
        "title": "Startup veterans of Reddit, how do you do it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zkpkf/startup_veterans_of_reddit_how_do_you_do_it/",
        "text": "[removed]",
        "created_utc": 1452009212,
        "upvote_ratio": ""
    },
    {
        "title": "Would you eat a human?",
        "author": "garyjohnsonkid",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zk62d/would_you_eat_a_human/",
        "text": "[removed]",
        "created_utc": 1452001078,
        "upvote_ratio": ""
    },
    {
        "title": "Ethical dilema",
        "author": "Shenko-wolf",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zjaqd/ethical_dilema/",
        "text": "[removed]",
        "created_utc": 1451982910,
        "upvote_ratio": ""
    },
    {
        "title": "(Socially) warm and cold cultures",
        "author": "CloudSource",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zg5bq/socially_warm_and_cold_cultures/",
        "text": "[removed]",
        "created_utc": 1451934570,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of front and rear dash cams becoming part of \"standard equipment\" for vehicles in the next ~20 years?",
        "author": "IT_Chef",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zfhb8/what_do_you_think_of_front_and_rear_dash_cams/",
        "text": "[removed]",
        "created_utc": 1451925542,
        "upvote_ratio": ""
    },
    {
        "title": "Top military innovations of 2015",
        "author": "Gallagherions",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3ze9op/top_military_innovations_of_2015/",
        "text": "[removed]",
        "created_utc": 1451903078,
        "upvote_ratio": ""
    },
    {
        "title": "Students of Reddit who pirate textbooks: do you feel entitled to the books you pirate? If yes, why? I am not concerned if you think it is right or wrong. I want to know if you feel entitled to those particular books.",
        "author": "Kauren",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zd7m8/students_of_reddit_who_pirate_textbooks_do_you/",
        "text": "[removed]",
        "created_utc": 1451881220,
        "upvote_ratio": ""
    },
    {
        "title": "Why should we close schools in light of terrorist threats?",
        "author": "Obolover69",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zatpg/why_should_we_close_schools_in_light_of_terrorist/",
        "text": "[removed]",
        "created_utc": 1451845883,
        "upvote_ratio": ""
    },
    {
        "title": "How can a person that grew up super deprived transition into a more middle-class mindset where we have to deny ourselves?",
        "author": "samlir",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3zaq0h/how_can_a_person_that_grew_up_super_deprived/",
        "text": "[removed]",
        "created_utc": 1451844399,
        "upvote_ratio": ""
    },
    {
        "title": "If we were to abolish religion completely, would the world unite or divide?",
        "author": "ridethelightning98",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3z799i/if_we_were_to_abolish_religion_completely_would/",
        "text": "[removed]",
        "created_utc": 1451776913,
        "upvote_ratio": ""
    },
    {
        "title": "How soon are we going to need personal body cameras as much as we currently need dash cameras?",
        "author": "InDaBauhaus",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3z63b5/how_soon_are_we_going_to_need_personal_body/",
        "text": "I figured the trend is obvious, since usually first the police get it and later other people get it too. Are we going to live in a world, where it will be important to record human interaction in order to avoid false accusations/liability?\n\nEdit: Also, are we going to live in a world, where for the sake of the video, we will want to have a personal body camera?",
        "created_utc": 1451759139,
        "upvote_ratio": ""
    },
    {
        "title": "What should a Thirty-something learn or do to be best prepared for the next 10 to 15 years?",
        "author": "matthewsmazes",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3z47oy/what_should_a_thirtysomething_learn_or_do_to_be/",
        "text": "[removed]",
        "created_utc": 1451719502,
        "upvote_ratio": ""
    },
    {
        "title": "What should a Thirty-something learning or doing to be best prepared for the next 10 to 15 years?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3z46kh/what_should_a_thirtysomething_learning_or_doing/",
        "text": "[deleted]",
        "created_utc": 1451718818,
        "upvote_ratio": ""
    },
    {
        "title": "Who won WW2? Russia or USA?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3z43bg/who_won_ww2_russia_or_usa/",
        "text": "[removed]",
        "created_utc": 1451716915,
        "upvote_ratio": ""
    },
    {
        "title": "Why and how in the world is a very difficult university ranked much lower globally than a much easier one? Would this matter to employers?",
        "author": "salamandraiss",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3z1i8v/why_and_how_in_the_world_is_a_very_difficult/",
        "text": "[removed]",
        "created_utc": 1451673227,
        "upvote_ratio": ""
    },
    {
        "title": "When determining a punishment for a crime, are the intentions more important or the consequences of the crime?",
        "author": "Alpy94",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3z09t2/when_determining_a_punishment_for_a_crime_are_the/",
        "text": "",
        "created_utc": 1451643389,
        "upvote_ratio": ""
    },
    {
        "title": "Is the loss of the physicality of media (e.g. netflix, hulu, spotify), and friends (e.g. facebook) ultimately a good thing or a bad thing?",
        "author": "awesomeoctopus98",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yzv61/is_the_loss_of_the_physicality_of_media_eg/",
        "text": "[removed]",
        "created_utc": 1451630255,
        "upvote_ratio": ""
    },
    {
        "title": "Family's house for a first date?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yz2qu/familys_house_for_a_first_date/",
        "text": "[deleted]",
        "created_utc": 1451610987,
        "upvote_ratio": ""
    },
    {
        "title": "Do you believe a child's life is worth more than an adult's life?",
        "author": "no_tolerance",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yystm/do_you_believe_a_childs_life_is_worth_more_than/",
        "text": "[removed]",
        "created_utc": 1451605420,
        "upvote_ratio": ""
    },
    {
        "title": "What Are the Modern Theoretical Visions of Utopian Governments?",
        "author": "disinterestedMarmot",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yyf38/what_are_the_modern_theoretical_visions_of/",
        "text": "Note: I live and have grown up in the US, so that is my reference frame for this discussion. Apologies if my view is too US-centric.\n\nThis is something that's been on my mind for a while now, but I feel like I don't have the proper background in polysci to think about it well, and the whole thing compounds on itself and gets complicated very fast.\n\nI suppose a good starting point is reddit's relatively recent interest in alternatives to the First Past The Post voting system, largely promoted with [this video](https://www.youtube.com/watch?v=s7tWHJfhiyo). Basically, the system of voting we all know and love (except Australia, and a few others) has some pretty obvious flaws - namely, that voters are coerced into voting for popular candidates they don't like much, so that candidates they actively dislike don't win, rather than voting for candidates they really *do* like. We are then informed that there are other proposed systems of voting that seem to solve these problems, and that's nice. But what is striking is how *obvious* it seems after it is explained to you - here's a problem, here are the possible solutions, system improved. So I wonder: where else in government are there terrible inefficiencies and injustices that don't change, just because it is the status quo, just because too few people imagined there might be another way? That is, where are the silver bullets that solve problems without trade-offs?\n\nAnother idea that got me thinking was this: that the efficacy of groups of humans to solve problems has a significant dependency on the way such groups are organized and the way problems are approached. This probably has a lot to do with my background in software development - often when you talk about software, the way you approach a project and the way you organize your programmers warrants just as as much attention as the code itself. \n\nAgile software development is an excellent example of this, but I think an even more striking example is Stack Overflow. For those unfamiliar, Stack Overflow (and its non-programming-specific sister site, Stack Exchange) is a programming question-answer site that is enormously popular. Every day, millions of programmers visit the site to find answers to their programming questions, saving millions of hours of time that would otherwise be spent searching rather than coding. But the thing I find most interesting about SO/SE is that it is *complex*. People can search for and post questions easily, but moderation, editing, voting, sorting questions, etc are all founded the sum of points each user has; and individual users and the system as a whole are constantly up for review by the community. It is complex enough that it takes time using the system to get a good feel for how it works, and you'll often find new tidbits even when you know the system reasonably well; but it is *just* complex enough to solve the biggest issues it sets out to solve - it doesn't take a law degree to figure out how the site works.\n\nOf course, about this point in time, the libertarians will come out of the woodwork talking about how less government is better government, how government is inefficient, (sometimes) how government is literally Hitler. And I'll admit, they have some points. I believe government is inherently less efficient than private enterprise (all things being equal). But at the same time, I recognize the need for government despite its inefficiencies (though I'm sure there are a few that disagree). For example, in this imperfect world we live in, some form of military and police force is necessary, and such a force needs some sort of funding and organized oversight. For another example, our current system shows that the tragedy of the commons is still the law of the land when it comes to our environment, and some sort of oversight of our common resources is needed to ensure that they are not wasted or distributed unfairly. Unless you are an extreme anarchist, we must admit government to be necessary (a necessary evil, if you like), and that the organization of government is therefore an important issue to consider.\n\nI've tried to break my main ideas up logically in the comments below. This wall of text is large enough, and reddit's branching comments system is something I don't think is utilized to its full potential often enough.",
        "created_utc": 1451597851,
        "upvote_ratio": ""
    },
    {
        "title": "Should I go back to sleep",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yxi69/should_i_go_back_to_sleep/",
        "text": "[deleted]",
        "created_utc": 1451582574,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit, how do you go about increasing your empathy towards others and not be so \"negative\" all the time?",
        "author": "Dildomaster399",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yw230/reddit_how_do_you_go_about_increasing_your/",
        "text": "",
        "created_utc": 1451548899,
        "upvote_ratio": ""
    },
    {
        "title": "What habits, ideas or resolutions are you implementing in 2016?",
        "author": "theincorrectresponse",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3ysrq3/what_habits_ideas_or_resolutions_are_you/",
        "text": "[removed]",
        "created_utc": 1451493178,
        "upvote_ratio": ""
    },
    {
        "title": "Am I getting screwed? \"Hit\" a car a few months ago.",
        "author": "STLZACH",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yoxhu/am_i_getting_screwed_hit_a_car_a_few_months_ago/",
        "text": "[removed]",
        "created_utc": 1451419325,
        "upvote_ratio": ""
    },
    {
        "title": "Why is snark, sarcasm, and smugness so common on Reddit?",
        "author": "mechanicalengr",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yopn6/why_is_snark_sarcasm_and_smugness_so_common_on/",
        "text": "[removed]",
        "created_utc": 1451416110,
        "upvote_ratio": ""
    },
    {
        "title": "People who moved from third world countries to first world countries, what was your biggest culture shock?",
        "author": "comradelmao",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yoi9y/people_who_moved_from_third_world_countries_to/",
        "text": "[removed]",
        "created_utc": 1451412995,
        "upvote_ratio": ""
    },
    {
        "title": "In history books in the distant future, will ISIS be mentioned?",
        "author": "Communizte",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3ynnvh/in_history_books_in_the_distant_future_will_isis/",
        "text": "[removed]",
        "created_utc": 1451398769,
        "upvote_ratio": ""
    },
    {
        "title": "Are many of the social/psychological problems unique to the first world, due mainly to lack of other problems?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yke2d/are_many_of_the_socialpsychological_problems/",
        "text": "[removed]",
        "created_utc": 1451335377,
        "upvote_ratio": ""
    },
    {
        "title": "What problems (if any) do you see in the way dating is done in the western world?",
        "author": "itsmassive",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3ykb10/what_problems_if_any_do_you_see_in_the_way_dating/",
        "text": "",
        "created_utc": 1451334142,
        "upvote_ratio": ""
    },
    {
        "title": "Would the world be a better or worse place if we had easily accessible, pretty accurate technology that estimates how long we will live based on genetics and health but doesn't predict future events like car crashes etc?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/3yk8p9/would_the_world_be_a_better_or_worse_place_if_we/",
        "text": "[deleted]",
        "created_utc": 1451333120,
        "upvote_ratio": ""
    }
]