[
    {
        "title": "Just finished MGS3 for the first time. My fucking heart, man.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9gmvcj/just_finished_mgs3_for_the_first_time_my_fucking/",
        "text": "[deleted]",
        "created_utc": 1537208626,
        "upvote_ratio": ""
    },
    {
        "title": "Is gaming your favourite medium ( when compared to tv and film)? Yay? Nay? Why?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9gmase/is_gaming_your_favourite_medium_when_compared_to/",
        "text": "[removed]",
        "created_utc": 1537204898,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't BR games have an option for dynamic resolution scaling?",
        "author": "ExxDeee",
        "url": "https://www.reddit.com/r/truegaming/comments/9gm7zl/why_dont_br_games_have_an_option_for_dynamic/",
        "text": "[removed]",
        "created_utc": 1537204348,
        "upvote_ratio": ""
    },
    {
        "title": "The Final Station... Was it actually good..? (Spoilers within)",
        "author": "Dauss",
        "url": "https://www.reddit.com/r/truegaming/comments/9glx66/the_final_station_was_it_actually_good_spoilers/",
        "text": "I picked up [The Final Station](https://store.steampowered.com/app/435530/The_Final_Station/) during a recent Humble Bundle. I'd seen a few gifs of gameplay but purposely stayed away from any trailers or playthroughs on YouTube in an attempt to remain as in the dark as possible before my first time with it.\n\nI was encouraged by Steam user reviews; It currently sits with a 'Very Positive' rating on the platform, with a 76 Metacritic score as well. Additionally, the Steam page for the game features a number of accolades such as 'Best Storytelling' and 'Indie Gamecup Grand Prize' awards from 2015, among others. To be blunt, I was expecting something really solid.\n\nWell, I just wrapped my playthrough and I'm left with mixed feelings. The gameplay was all well and fine, featuring varied enough enemies for a 'zombie' game, a good enough feel of exploration, and some surprisingly panic inducing moments (nothing quite like opening a door and immediately being swamped by a bunch of those short runner things while you flail about with your melee attacks hopelessly). But I'm also feeling extremely underwhelmed from the narrative elements, and some of the more tedious gameplay facets as well.\n\nFor starters, for a game that appears to be so highly praised for it's storytelling, I really don't have much idea of what I just went through. There's a lot of 'mystery' that seems to be a mile wide and an inch deep, with no real means of exploring it. Who is my character, and what is their history? What's going on with all the other trains and their conductors, who you sometimes speak with on the messaging system, but then disappear and are never heard from again? Why do some people seem to think the 'first visitation' never happened, and there's some sort of conspiracy about it? What exactly happened with the Guardian? All of these things are touched on, but none of them ever seem to develop into anything substantial. I understand from the ending that [SPOILERS](#s \"the 'infection' is supposed to be some kind of treatment to enhance humans, but generally goes wrong with most people instead, and that many of the oddly acting people you encounter along the way are those that survive it\"), but this begs so many questions that just go unanswered.\n\nI suppose I should mention that I haven't got the DLC, which I hear has another ending, and I'm of course playing the game in English with the horrible translations, so maybe there's more to this?\n\nWhat are your thoughts? Did you try the game, and leave feeling the same way? Were you satisfied? I mean, I played through the game all the way to the end, and enjoyed it for the most part, but I guess I feel like I was being strung along with the carrot on the stick being the answers I was hoping to find, and just... didn't. Really a mixed bag for me.\n\nOh well, at least I'm done with it and don't have to babysit overheating crystal faces or hungry train passengers anymore.",
        "created_utc": 1537202342,
        "upvote_ratio": ""
    },
    {
        "title": "Do game critics understand subtext?",
        "author": "modsaregay1337",
        "url": "https://www.reddit.com/r/truegaming/comments/9gkupn/do_game_critics_understand_subtext/",
        "text": "This isn't a hard and fast rule (mainly because the number of games that have significant subtext are absolutely minimal) but I've noticed over time that critics don't seem to understand any part of a game's story unless it's shoved in your face, front and center.\n\nLook at the reviews for the most popular indie game ever, Undertale. You'll find tons of critics praising the game's humor, music, story, and characters, but totally ignore the meta-narrative about how games don't have to be about violence, and the game also has a lot to say about fandoms too but that never gets addressed. Which is very weird because I feel like that gets WAY more obvious in the genocide route, but they still didn't get it.\n\nAnother example is Spec Ops The Line, if you read critic reviews, most people came away with \"war is very bad,\" but there's another part to it that they didn't get, \"modern military shooters are bad too\". You'll find almost no review mentioning the second part despite how obvious they make it, with how just about every mission is set up like an average military shooter mission but they all in catastrophe, nobody seemed to get what the reason for subverting all the modern military shooter tropes were. But I mean, at least they know that the part where you kill civilians was supposed to make you feel bad. Spec Ops has a 76 on Metacritic, by the way.\n\nThe most hilarious example is the number of game critics who praised Nier Automata because they thought the weird anime story was entertaining. Anyone who has played the game and has a functioning brain can see that there's more to it than that, the first boss you fight is literally a factory robot named \"Engels\" and the game directly references, by name, several philosophers. There's a lot of interpretations you can have of Nier Automata, saying that it's a weird anime story is the most boring and basic one. Even an interpretation of \"they reference philosophers but there's no deeper meaning to it\" would at least signal that they thought about it, at all. To be fair there was more than one game critic who actually expounded on the story more than \"it's weird\" but it seems like the majority still didn't do any deeper thinking at all.\n\nI could go on listing several examples like this, DDLC is about weeaboos but critics only picked up on \"it's a cute anime game that turned into a horror game! my expectations were subverted!\" Nier 1 is about how misunderstanding can lead to unnecessary conflict but critics mostly picked up on \"I was so sad when the guy's daughter got kidnapped,\" MGS2 was about the surveillance state and player agency but critics thought it was dumb you had to play as the uncool guy, Bioshock is about unregulated capitalism but critics thought that Atlas' betrayal was the most important thing in that game's narrative, etc, etc.\n\nSo when critics very clearly don't pick up on deeper meaning of any game, and when their favorite game stories are the most immediately obvious and simple ones like God of War 4, GTA, or Skyrim, the question has to be asked, do critics understand subtext at all? The deepest interpretation most mainstream critics seem to be capable of is that GTA is a critique of American culture, which, I'm glad they can at least do that, I realized that on my own when I played GTA4, as a 12 year old. Hell even Skyrim has some deeper elements to it, like how the Stormcloak rebellion is funded by the Thalmor in effort to destabilize the empire, you think that they would have a fucking field day with that with all the Donald Trump news. But no, nothing.\n\nObviously I don't expect IGN, which is paid articles written for literal children, to offer deep analysis of games beyond \"it's okay 9/10\". But it doesn't seem like ANY critic understands this stuff, unless they're critiquing it from a feminist standpoint, or they're not a mainstream critic. So the question has to be asked, do game critics understand subtext?",
        "created_utc": 1537195022,
        "upvote_ratio": ""
    },
    {
        "title": "Hello Guys, please checkout my game (Fate of Nimi - Adventure Platform Game) its out now on Google play.",
        "author": "indie_navneet",
        "url": "https://www.reddit.com/r/truegaming/comments/9gkee3/hello_guys_please_checkout_my_game_fate_of_nimi/",
        "text": "[removed]",
        "created_utc": 1537191642,
        "upvote_ratio": ""
    },
    {
        "title": "Do Nintendo e-Shop games tend to go on sale?",
        "author": "mean_emcee",
        "url": "https://www.reddit.com/r/truegaming/comments/9gk2qf/do_nintendo_eshop_games_tend_to_go_on_sale/",
        "text": "[removed]",
        "created_utc": 1537189009,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta] It took 163 days for a single True Gaming discussion topic of mine to be expounded upon by another redditor",
        "author": "Ninja20p",
        "url": "https://www.reddit.com/r/truegaming/comments/9gk027/meta_it_took_163_days_for_a_single_true_gaming/",
        "text": "Feburary 5th [An essay on possible trajectories of the gaming industry](https://www.reddit.com/r/truegaming/comments/7vbyx2/an_essay_on_possible_trajectories_of_the_gaming/)\n\n&gt;With the advent of the Nintendo Switch and open world releases of Zelda breath of the wild and Super mario odyssey, gamers have been treated to large worlds with grand multitudes of samey goals and challenges.\n\n&gt;Bethesda's Elder scrolls Daggerfall had a similar approach back in 1996 utilizing a procedural generation technique in order to spawn generally fleshed out templates throughout perhaps the largest game world to this day.\n\n&gt;An effort has been underway to bring the freeware release of daggerfall into the unity game engine by a group of talented modders. That had me thinking about the large expanse of potential activities these games share in common, and how the style seems to suit the switches' on the go aspect that players really adore it for.\n\n&gt;Bethesda could stand to really capitalize on a modern portable version of the second elder scrolls game, and perhaps even looking into hiring the talent responsible for this already more enticing version of the game. I'm sure players would really enjoy a seemingly never ending roleplaying adventure game on the go and perhaps with some motion controls that complement the original's swinging the weapon gameplay mechanic.\n\nI presume that it was passed over due to my choice in words being fairly antagonizing to the current community in addition to requring a more analytic approach to replying. I also put it in the Nintendo subreddit and got these four comments\\&gt;\n\n1\n\n&gt;I have no idea what the point you're trying to make is\n\n2\n\n&gt;The ramblings of a madman\n\n3\n\n&gt;Tl;Dr I have no fucking idea what I'm talking about, here's some incoherent rambling about how the switch is a portable console and that's never been done before apparently.\n\n4\n\n&gt;Tl;dr\n\n----------------\n\nJuly 18th [The case for a modern Daggerfall](https://www.reddit.com/r/truegaming/comments/8zvlyf/the_case_for_a_modern_daggerfall/)\n\n&gt;Daggerfall is the second installment in the Elder Scrolls series, and, while most people might be familiar with the series as it was from Morrowind onwards, this game presented a fairly different experience.\n\n&gt;The scope of the game, especially for 1996, is astounding, with an entire region of the game's lore, roughly the size of Great Britain in real world terms, is presented on a 1:1 scale. Numerous cities, villages, and (obligatory) dungeons for the player to explore exist, divided by massive tracts of uninhabited land. Of course, a fast travel feature exists in order to prevent journeys that would take months in real time.\n\n&gt;Such a world demands something to do in it, and there is a main quest the player character is sent at the beginning of the game. However, players are completely free to ignore it and do whatever they feel like doing, should they wish to accept the consequences of such action. And what is there to do? Randomly generated quests from the game's many, many NPC characters, various knightly orders, guilds and other groups of interest, or just plain aimless exploring.\n\n&gt;This is not to say that the game was flawless, though. In finest Bethesda tradition, the game is riddled with bugs to this day, necessitating the use of third-party fixes. Combat is overly simplistic and unsatisfying, and even the extensive spell-making system does little to fix this. The heavy degree of random generation leaves many aspects of the game feel shallow and dull. The interface was not considered good even in its time, and is absolutely horrifying by modern standards.\n\n&gt;Yet, it is absolutely an unique experience. In spite of almost 22 years passing since the game's release, I haven't seen any game with quite the same feel, with only the Adventure mode of Dwarf Fortress coming close, but that game suffers from an even more hostile user interface. Frankly, I find it baffling that no one has yet tried their own take on Daggerfall's formula.\n\n&gt;I want to put to light some of the reasons I think someone should attempt such a thing.\n\nI think the op's meandering and build up to the final part of his post in addition to his choice to hone one topic is what clicked with the community, as the conclusion to his post is\\&gt;\n\n&gt;It can absolutely said that Daggerfall was a game before its time in many aspects, as many of Daggerfall's shortfalls were directly or indirectly caused by the age of the game. Besides the obvious limitations of the hardware of yore, it is a simple fact that RPGs on the PC were still a young genre. Daggerfall came two years before even Baldur's Gate, and really, the only similar series Bethesda had to look at the time were the Ultima series.\n\n&gt;The scope of game development has significantly expanded with the growth of the industry. Step back from the size and the apparent complexity of Daggerfall, and one can see that its basic building blocks are fairly simple, compared to what might be expected from a modern release. Today, I believe a game like this could be developed by a small to mid sized indie dev team, which would, riding off the previous point, have access to a wealth of game design experience and tools the Bethesda of 1996 did not have.\n\n&gt;The core concept I am describing here also allows a lot of room for expansion. More tilesets for dungeon creation, the addition of some sort of a dynamic reputation, more quests, additional regions, randomized weapon crafting, and numerous other things can all be attached to the core, but are not needed for the core gameplay experience. Although some might disagree that this is a good thing, the Daggerfall model lends itself well to early access, continuous post-release patches, and DLC additions. With a competent development team, this could be leveraged into making a truly great game.\n\n&gt;In conclusion, I think a modern take on Daggerfall's formula could make for a good and unique, if niche, gaming experience. I would love to hear your opinions regarding this idea.\n\n-------------\n\nXenotechie 's topic begat 83 comments of discussion whereas mine was simply downvoted and ignored when the gist of which seems to exist within both posts. crticalhit 's recent hypothesis that the subreddit is largely casual; as defined by google as relaxed or unconcerned; seems fairly apt in such a scenario. The majority of redditors who frequent the sub (even Nintendo) seem more enticed to discuss a more specific and guided presentation of the points of interest rather than a variety of topics that which can be focused upon.\n\nI'm not trying to incite a flame war, I would like to revisit my main points and provide further elaboration for those who may be intrigued by what is presented. Other than a remade Daggerfall being a good fit for the switch, I also propose that\\&gt;\n\n* Crossovers of gametypes, and more specifically Nintendo's first party series, would result in new genres of unique experiences fairly immediately without applying much creativity and ingenuity.\n* A revitalization of song rhythm games might pair well with Nintendo Lambo, as players could pride themselves in the construction and personalization of their various instruments.\n* It would be rather poignant if older games that were well received were revisited and their gameplay fleshed out; An example being a racing game with an adventure mode possessing an interconnected world.\n\nTo me personally it would seem there's plenty of ways to capitalize on well rounded and fun games without turning the entire industry and major releases into simple cash grabs and time sinks. There's plenty of untapped potential that seems to be falling away in modern gaming that used to be so enthralling.\n\nIt would even be possible to continually reuse assets and reiterate certain experiences in the form of multiple versions of a single game, more so then the likes of say -Pokemon and its perpetual division of content.\n\nA great way to inject novel new experiences into modern gaming could be to utilize player generated content more effectively, amounting to what is essentially the consumers partially building the games in which they play.\n\n**TL;DR**; No matter how great an idea might seem, if the presentation is disagreeable to the average person there's no discussion to be had. With a finite amount of time and attention something more casual with easier accessibility becomes much more digestible.",
        "created_utc": 1537188339,
        "upvote_ratio": ""
    },
    {
        "title": "GTA 6 COMING SOON",
        "author": "sheh123",
        "url": "https://www.reddit.com/r/truegaming/comments/9gjsho/gta_6_coming_soon/",
        "text": "[removed]",
        "created_utc": 1537186492,
        "upvote_ratio": ""
    },
    {
        "title": "Xbox 1 fortnite save the world",
        "author": "Mydick123A",
        "url": "https://www.reddit.com/r/truegaming/comments/9ghgf8/xbox_1_fortnite_save_the_world/",
        "text": "[removed]",
        "created_utc": 1537160166,
        "upvote_ratio": ""
    },
    {
        "title": "Have too many casual gamers discovered r/truegaming or does true gaming now belong to them?",
        "author": "crticalhit",
        "url": "https://www.reddit.com/r/truegaming/comments/9gfbif/have_too_many_casual_gamers_discovered/",
        "text": "After reading the spider-man post on the front page I couldn't believe how many responses implied that fun or subjectivity were acceptable answers to the game receiving so much praise.\n\nI'm not going to tell this community how it should conduct itself, but the lack of truly critical or analytical responses was simply surprising.\n\nI've been battling with the definition of \"true gamer\" since CoD took over in the 2000s. My shallow conclusion is to no longer cringe at the people who say things like \"Spider-man is my game of the year because is the most fun I've since (blank)\". They are gamers, this is gaming.  \n\n  ",
        "created_utc": 1537141214,
        "upvote_ratio": ""
    },
    {
        "title": "What is a red flag that makes you stop playing a game?",
        "author": "DesiOtaku",
        "url": "https://www.reddit.com/r/truegaming/comments/9gewp5/what_is_a_red_flag_that_makes_you_stop_playing_a/",
        "text": "[removed]",
        "created_utc": 1537137629,
        "upvote_ratio": ""
    },
    {
        "title": "\"Battle Royale\" is, in many cases, just deathmatch with respawns turned off, why did everyone take so long to realize the demand for this?",
        "author": "Gordo778",
        "url": "https://www.reddit.com/r/truegaming/comments/9gdm93/battle_royale_is_in_many_cases_just_deathmatch/",
        "text": "I remember playing CS and COD Demolition mode as a kid thinking that removing the objective and just playing with respawns turned off would be cool, and it's a simple enough concept that I'm sure plenty of people had the same idea. Why did BR only take off as a genre recently?",
        "created_utc": 1537127940,
        "upvote_ratio": ""
    },
    {
        "title": "No pressure but funny",
        "author": "JBALT_YT",
        "url": "https://www.reddit.com/r/truegaming/comments/9gdm5e/no_pressure_but_funny/",
        "text": "[removed]",
        "created_utc": 1537127921,
        "upvote_ratio": ""
    },
    {
        "title": "Ratings",
        "author": "SeizeTheGreens",
        "url": "https://www.reddit.com/r/truegaming/comments/9gd2fc/ratings/",
        "text": "[removed]",
        "created_utc": 1537123920,
        "upvote_ratio": ""
    },
    {
        "title": "The Stanley Parable - How is a 4th wall break successfully implemented?",
        "author": "RaketenRolf_lol",
        "url": "https://www.reddit.com/r/truegaming/comments/9gc3i5/the_stanley_parable_how_is_a_4th_wall_break/",
        "text": "Hey guys,\n\n&amp;#x200B;\n\nthe Stanley Parable was the first game in which I realised a majority of the 4th wall breaks. I think, although this game looks rather old, it was one of the best experiences I have ever had. Are there more games like this one? How do you think a 4th wall break should be executed in games, subtle or straight obvious as in this parable?\n\n&amp;#x200B;\n\nI'm stoked to hear, what you have to say. And btw, in the video below is a 4th wall break implemented into a 4th wall break, thought that was kinda funny. :)\n\n&amp;#x200B;\n\n[https://youtu.be/5D\\_leeUWYtc](https://youtu.be/5D_leeUWYtc)",
        "created_utc": 1537116911,
        "upvote_ratio": ""
    },
    {
        "title": "Will we ever get a AAA historical game ever again?",
        "author": "SeizeTheGreens",
        "url": "https://www.reddit.com/r/truegaming/comments/9gbwt8/will_we_ever_get_a_aaa_historical_game_ever_again/",
        "text": "CoD is returning to futuristic games after WWII, as seen with BO4 (still can’t believe Activision let them make nothing but futuristic games from BO2 (2012) all the way up to IW (2016). \n\nBattlefield V is significantly more alt-history than history. \n\nAssassin’s Creed has been cleansing history in Syndicate and Origins and now its expected to be washed even more and turned into full-fledged fantasy with the odyssey trailers. \n\nThe more accurate historical games aren’t AAA and don’t have the right resources. I was playing post scriptum and the graphics felt bad, even when resolution was maxed out. Y\n\nIs this the end of AAA historical games? Will any of them have the balls to display honest history ever again? Or will they play it safe and cleansed  and fantastical until the industry dies? \n\n",
        "created_utc": 1537115511,
        "upvote_ratio": ""
    },
    {
        "title": "Can we look at Video Game ratings?",
        "author": "F430Scuderia",
        "url": "https://www.reddit.com/r/truegaming/comments/9gbdvk/can_we_look_at_video_game_ratings/",
        "text": "Bit of a lengthy one...\n \nThe recent rise of Fortnite from general obscurity to worldwide hysteria has brought with it a lot of attention from the non-gaming world, especially owing to its popularity amongst youngsters and the more casual gamer. Numerous articles have appeared recently claiming Fortnite to be detrimental to our kids’ health, not due to the dangers of online grooming but rather the ‘violent’ content that it features. Rubbish, I say, I’ve been murdering hookers since I was 12 and I grew up just fine.\n\nAt the innocent age of 8 I was introduced to Resident Evil by a friend on my street who was a few years older than me, he gave me the first two games and sent me on my way. As expected, they scared the shit out of me and gave me a genuine fear of Zombies taking over the world (I was also exposed to Night of the Living Dead at a young age, which only exacerbated this). Sleepless nights were had, yet do I resent him for this? Not at all, Resident Evil remains one of my favourite series of all time. In fact, memories 8 year old me being terrified to round a corner are some of the fondest that I have from growing up. I distinctly remember being off school around age 11 due to sickness and spending the days playing Resident Evil 3 almost continuously.\n\nIt wasn’t just that though, by age 12 I’d mastered the art of the ‘hooker home run’ (murdering them quickly afterwards in order to claim back my hard-earned cash). I’m talking about Grand Theft Auto, of course, but it wasn’t just the ladies of the night that felt my wrath, no, homicidal rampages usually didn’t discriminate. Likewise, I used to load up Hitman 2 with the sole intention of wiping out an entire level of NPC’s without prejudice, good or bad. I’m certain that most people of a similar age did very similar things, and the vast majority probably didn’t turn out to be psychopaths, murderers or prostitute punishers. Why? Because like me, they were able to separate real life from fiction. From art. I don’t even think I fully understood what a prostitute was at that age.\n\nSo we attempt to shelter our kids from this perceived threat by making it illegal for them to purchase certain entertainment until they are eighteen. Why? This one I cannot answer. Real life rarely shelters us from ‘adult themes’ until we are adults, and imposing such restrictions only heightens the allure and indeed the desire for exposure to these themes. So why not let the younger generations expose themselves gradually at will, in a controlled environment, rather than attempt to pull the blinders of ignorance over their eyes?\n\nIt’s not a massive problem, as I imagine the vast majority get their parents to skirt the buying requirements as I did. But I’d be interested to hear other opinions?  \n\nThanks!",
        "created_utc": 1537111666,
        "upvote_ratio": ""
    },
    {
        "title": "How much longer will it take for games to reach the same prestige as novels or movies?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9gaviq/how_much_longer_will_it_take_for_games_to_reach/",
        "text": "I dont think its a matter of IF, but a matter of WHEN.\n\nVideo games cannot always be seen as useless waste of time activities. If you spend some time researching how video games actually can improve ones mental abilities your gonna be spending a decent amount of time reading articles (there is a lot of info out there proving these things).\n\nI was always confused as how kids reading novels were deemed as doing something to help them be smart when reading in and off itself is a pretty effortless thing to do. So when you read a fictional story how does that make you smarter than watching a fictional movie? Maybe you learn a couple new vocab words... Movies can do that too though.\n\nBut video games require active thinking, problem solving, etc. Especially if you play against a human opponent.\n\nIf your really into reading novels (fictional stories) or cinema, people dont look at you as childish. They just think its your hobbie. Even though reading stories and watching stories are just as much if not more a waste of time than playing a video game (solving stories).\n\nI just cannot wait for video games to get on the same level as novels and books.\n\nHow much longer do you think it will take?\n\nEDIT;\n\nOkay i found a playlist of videos proving the guys in the comments wrong.\n\nhttps://m.youtube.com/playlist?list=PLDqMPnDyl61boJL-SerxZHtOI0ppBNVKi\n\nThere is 17 videos of different studies all showing video games literally making the mind work better. Comparible to playing an instrument in some cases.\nShow me how watching a movie can do anything near that.\n\n\n\n\n",
        "created_utc": 1537107485,
        "upvote_ratio": ""
    },
    {
        "title": "To: Player - a podcast about video games and why play matters",
        "author": "toplayerpodcast",
        "url": "https://www.reddit.com/r/truegaming/comments/9gasob/to_player_a_podcast_about_video_games_and_why/",
        "text": "[removed]",
        "created_utc": 1537106897,
        "upvote_ratio": ""
    },
    {
        "title": "Spider-man: Am I playing the same game as everyone else?",
        "author": "OmarGharb",
        "url": "https://www.reddit.com/r/truegaming/comments/9g9q56/spiderman_am_i_playing_the_same_game_as_everyone/",
        "text": "I should probably preface this by saying that I really enjoyed the game: combat, story, soundtrack, and world design were all phenomenal. It's also probably my favourite Spider-man game to date. It's a very, very good game, and the criticisms I'm making here don't take away from that. \n\nBut after reading reviews I feel like I'm playing a different game from everyone else. I honestly think people are WAY overrating it. Frankly, in my opinion ALL of the side content in this game was low-effort, generic, and boring. It suffers from basically all of the flaws that people relentless mocked the AC series and other similar open-world games for (like Far Cry), but for some unknown reason everyone has decided to give these same overdone and thoughtless mechanics a pass when Spider-Man does it. The idea is basically to just make 3 or 4 repetitive activities and then plaster them ALL over the map so you can pretend that your game has a lot of content.\n\nOnce you do three or four puzzles, you've basically done them all. The only slightly redeemable activities on the map are the research stations, because those have some variety in what they ask you to do, and some can be fun. Even then, though, there's only so much variety (i.e., not really much), and even they quickly become a chore after a short while. Accessing cell towers, taking pictures, and collecting useless items across the map? (the vast, VAST majority of what they ask you to do) Come fucking on - that is the definition of padding an empty game out with meaningless content. So the map activities suck, and as for the Side Missions, the only interesting ones in the whole game were the ones with Tombstone and Internet Famous - everything else was painfully cookie-cutter.\n\nTo release an open-world game in 2018 with such a dearth of content other than the main story, and have it be so critically acclaimed, is just bizarre to me. I thought we had gotten to a point where we had higher standards for the genre than \"make a compelling main story and put collectibles around the map.\" The map is about the as fully developed as early Assassins Creed games - the analogy is great because both games have FANTASTIC world design (like, the map is gorgeous) but with very little to actually do. Games like GoW and TW3 showed you can make an open, explorable world AND keep it fun and interesting. Why did Spider-man default to the same tried and terribly boring formula, when even Ubisoft has moved on? And why are we praising it instead of rightly criticizing it as a step-backwards? \n\nAm I the only one who was really disappointed with Spider-man's open world, and who's a bit disillusioned by how warmly everyone's reacting to it? I was hoping for really interesting and engaging side content - different minor villains, compelling short stories, etc. Instead we just got cookie-cutter Ubisoft-esque activities. Arkham Knight, even though it's a worse game overall and to some extent suffered from the same flaws, had side content that blows Spider-man out of the water imo. ",
        "created_utc": 1537095378,
        "upvote_ratio": ""
    },
    {
        "title": "Overwatch crazy Tracer pulse bombs!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9g957g/overwatch_crazy_tracer_pulse_bombs/",
        "text": "[removed]",
        "created_utc": 1537087147,
        "upvote_ratio": ""
    },
    {
        "title": "Awesome Video on Nier Automata's deep themes",
        "author": "bowsori",
        "url": "https://www.reddit.com/r/truegaming/comments/9g8luz/awesome_video_on_nier_automatas_deep_themes/",
        "text": "[removed]",
        "created_utc": 1537079896,
        "upvote_ratio": ""
    },
    {
        "title": "What is a game you always wanted to finish but never did",
        "author": "e3pojedi",
        "url": "https://www.reddit.com/r/gaming/comments/9g83kw/whats_a_game_you_have_always_wanted_to_finish_but/",
        "text": "",
        "created_utc": 1537079538,
        "upvote_ratio": ""
    },
    {
        "title": "Spider-man's terrible puzzles",
        "author": "Sniperion00",
        "url": "https://www.reddit.com/r/truegaming/comments/9g6ut5/spidermans_terrible_puzzles/",
        "text": "Love the game. Platinumed it (which I almost never do) after less than a week, but if it has one black mark, it's the puzzles. I like puzzles in games, but these were downright terrible. I didn't skip any of them, but I can see why they added the option to do so.\n\nThe line matching puzzle was just plain unfun. There wasn't any sort of pattern to it. You never felt good about finishing one. On top of that, the cursor moved across the screen painfully slow, adding insult to the injury of having to do another one of these boring puzzles. It would have been better if the controls at least moved from item to item like the way you navigate every other menu in the game.\n\nThe circuit board puzzle was not challenging enough. It started to take things up a notch when it introduced boards that had multiple exits, but only used that in like 3 or 4 puzzles. Maybe it needed some sort of pressure to finish quickly like in Pipedream or Bioshock, the games it was clearly inspired by. You never had to use the pieces in a new or interesting way. It always provided you with plenty to finish a board.\n\nThe puzzles did feel like they had a place in the game, representing Peter Parker's brilliant scientific mind. The placement of puzzles felt right, but I wish more thought was put into their development. \n\nWhat do you think?",
        "created_utc": 1537061773,
        "upvote_ratio": ""
    },
    {
        "title": "Unpopular opinion: I'm not hyped for RDR2",
        "author": "AmerpLeDerp",
        "url": "https://www.reddit.com/r/truegaming/comments/9g6d8e/unpopular_opinion_im_not_hyped_for_rdr2/",
        "text": "My main reason for this is what they've done with GTA V. The open world is great and I don't think anybody can top the amount of detail they've put into making Los Santos feel like a real place, but that's the extent of it. Nothing else in the game is redeemable. \n\n*Main Game:* \n\nThe story and characters are weak. The acting and motion capture don't make up for it. Even though it might be better than other triple A games it is by far the weakest link regarding previous iterations.\n\nMissions are boring, repetitive and one dimensional. This goes hand in hand with the story because if I maybe had some attachment to the characters I would care but there's none of that. It's usually drive here, start this cutscene, drive there and shoot something. Even the heist are boiled down to the same thing. The \"choices\" in planning is a choice between doing one menial task or the other while you set up. There's no replay value.\n\nNo incentive to explore. Sometimes I'll drive and wonder to myself why I don't just take in the open world around me and appreciate the hard work that gone into creating it. Then I realize I'm 2 miles away from some mission I'm going to spend my time mindlessly shooting at things. Once you do explore there's nothing under the surface. Maybe you find some sort of cult, but since this is GTA it usually ends with shoot everything and that's it. Nothing to deepen the lore or your hunger for exploration. \n\nNPC interactions are over the top. Again it just ends in shoot shoot shoot. If it's civilians, getting too close to them causes them to run away or try to fight you, if it's cops they'll just shoot you. The dialogue isn't nearly endearing enough to keep you interested.\n\nMechanics. Since San Andreas there are far fewer game mechanics, and they have become simpler than the last. There's no element like eating too much and getting fat, going to the gym to work out and increase muscle mass, swimming because it's a requirement of a mission and things like that. It's just a bunch of stats that really don't have much of an effect on your gameplay. You know, because it's just a click the head simulator.\n\n*Online:* \nShark cards. Everything worth your time is locked behind a giant money wall which is in no way worth the grind. You need shark cards to enjoy the online content.\nFree roam is a shit show full of griefers and hackers and the lobbies rarely get populated. \n\nOnline missions are worse than the main games. They're not even trying to hide the boring grindiness. It's literally drive for 20 minutes from this side of the map to the other, kill these dudes or pick this thing up and drive it back.\n\nThe heists do not reward you the slightest amount needed to buy that new car or facility, but require 4 coordinated players to play through repetitive setups and ultimately a mediocre heist, which is more shooting simulator.\n\nEven when you get the reward of buying that new yacht, or underground bunker or that new flying car, there's nothing more to it. Just 5 minutes of enchantment and that's it. 10 mil blown on something you'll spend likely 10 minutes happy with and 2 hours wondering why you spent that amount of money on this one thing when you could have gotten this other thing that looks like it's definitely worth your time (it's not).\n\nA few nitpicks:\n\nMovement is really annoying. For the sake of \"realistic\" movement they've made your character a tank, and the worst is when your in \"fight mode\" and every slight adjustment you want to make to your characters movement sends them flying a few hundred steps. \n\nCover shooting. Just that, there's nothing you can say to change my mind on that shit mechanic. Cover shooting is just unremarkable and boring. While playing Michael and Trevor it's not necessary, but in extended shootouts it's required.\n\nEnemies are bullet sponges. At least in IV they would recoil after shot in the body, but in this game they either flinch or just fall and they need like a full clip to die from being shot in the torso.\n\nFalling in this game is ridiculous. You fall down a 5 feet drop and your character goes limp and face plants instead of trying to tuck and roll or do something. Walking down a hill is the bane of my existence because of the shit movement system. Take two step and your character just let's go the will to live and slides down taking damage. Funny enough crashing your car at 100 mph doesn't send you flying out the window like IV tho. \n\nMy second reason is what I'm saltiest about, and have been for nearly 5 years. They fucked up Max Payne 3.\n\nSometime ago there had been a surge of people that claimed Max Payne 3 was underrated, and when I first played through it I said the same. After that I went and played the first and second games. I tried to round out the series by playing the 3rd one again.\n\nI played for 10 minutes and uninstalled it. Rockstar had absolutely ruined everything in the core gameplay in the name of \"story\" and \"realism\" and \"challenging\".\n\n*Story*\n\nThe game is 80% cutscene 20% gameplay. Every 5 minutes you run into a cutscene, and in the most trivial of places. Going up a ladder? Cutscene. Walking across a stadium? Cutscene. Moving through a hallway? Cutscene. And then when it ends? BAM right in the middle of a fire fight. \nThe story is too convoluted for its own sake and the characters just do things against their core motivation and values.\n\n*Realism*\n\nThe gameplay is what bugs me. Everything is nerfed and they added a cover system. I don't know why people enjoy this, and why Rockstar included it in Max Payne, a game where its core gameplay epitomizes the opposite of a cover based shooter. In Max Payne 1 &amp; 2 you run circles around your enemies with bullet time and shoot dodge. It's meant to make you feel empowered and badass, like you're two steps ahead of your enemies. I'd like to compare it to the new DOOM. You run and you gun, you rip and tear and you move on. That's the point of its gameplay. With slow motion, Max Payne is basically the same. However, they nerfed bullet time and especially shootdodge to the point where you have to use cover and it's really annoying.\n\n It makes sense that when you shootdodge into a wall, instead of clipping you hit it and fall. It makes sense Max is old and therefore slow, but it's frustrating when you take 7 minutes to get up and get shot in the meantime. It makes sense you get shot once in the head and you die, but there are like 30 enemies shooting you at once and my bullet time is already drained so what do you want me to do? Peak out and get shot in the face and restart so many times you decide to give me an extra painkiller instead of realizing your core gameplay is dogshit?\n\n\"Challenging\"\n\nIt's not, it's frustrating. Bullet time in Max Payne 1 was challenging. In 2 it was too easy. In the first one you would drain bullet time normally and in shootdodge you'd use a set amount. However, I'f you got a kill during it you'd get a refund. Higher difficulty meant smarter and more accurate NPCs with more damage. In 3 you it would drain during either shootdodge or bullet time and it would not be refunded for killing someone during it. Higher difficulty means you drain more bullet time to the point where a single shootdodge meant half your reserve was gone. This meant that in 3 you'd have to use bullet time if only necessary and instead use cover system all the time. That was not the point of the first game. They ruined it because they didn't understand it. \n\nRDR2 looks like it's going in the same direction. Rockstar's storytelling recently has been subpar, and their gameplay focuses much more on stupid realism rather than what's practical in a video game. They're going to have a wild open world no doubt, but I don't expect anything deep or meaningful within it anymore. People were excited that you had so many interactions with your horse and to me that just seems like uneccessary ways to keep your player busy with flashy enchanting animations, then annoy you when the horse acts up becuase it's too close to a rock.\nThis is what I really think RDR2 is going to consist more of:\n\nGo here, take this, shoot that. \n\nDumb NPCs \n\nBullet sponges\n\nHorse riding taking up 90% gameplay.\n\nCover shooting.\n\nGreat acting, terrible story.\n\nTL;DR: Rockstar recently hasn't had a great track record with GTA V or Max Payne 3 in terms of everything but the open world. RDR2 looks to be the same.",
        "created_utc": 1537057328,
        "upvote_ratio": ""
    },
    {
        "title": "The Spider-Man DLC Packs",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9g65dn/the_spiderman_dlc_packs/",
        "text": "[removed]",
        "created_utc": 1537055472,
        "upvote_ratio": ""
    },
    {
        "title": "I need designers for my game",
        "author": "AlieZero",
        "url": "https://www.reddit.com/r/truegaming/comments/9g5sge/i_need_designers_for_my_game/",
        "text": "[removed]",
        "created_utc": 1537052292,
        "upvote_ratio": ""
    },
    {
        "title": "RASMUS DAHLIN",
        "author": "MarkHamsik123",
        "url": "https://www.reddit.com/r/truegaming/comments/9g2x21/rasmus_dahlin/",
        "text": "[removed]",
        "created_utc": 1537029842,
        "upvote_ratio": ""
    },
    {
        "title": "Need Help Finding A Game",
        "author": "Silencebark",
        "url": "https://www.reddit.com/r/truegaming/comments/9g1sgj/need_help_finding_a_game/",
        "text": "[removed]",
        "created_utc": 1537021053,
        "upvote_ratio": ""
    },
    {
        "title": "Wolfenstein 2 identity crisis",
        "author": "BastillianFig",
        "url": "https://www.reddit.com/r/truegaming/comments/9g0mqt/wolfenstein_2_identity_crisis/",
        "text": "Wolfenstein 2 is the strangest game that I've played. I've never played a game that is so unsure of what is meant to be. Both narratively and mechanically, it feels like every aspect is working against the other to create a clash. \n\nTonally the story feels like an absurd fusion of Iron Sky and Schindler's list. One minute we get a long monologue of Emo BJ, the next minute his head is cut off then stitched back on. The melodrama of the sad bits saps all the fun out of the wacky setting, and the wacky setting makes the melodramatic moments feel out of place and ineffective. \n\nI think the game takes itself too seriously, every pantomime villain and ridiculous set piece is played with a straight face and it's like the game refuses to acknowledge how silly it is, and pass it off as something serious.\n\nEvery character is just irritating and again the fun is sapped out of any interaction or dialogue.\n\nWhich brings me to gameplay, we have another identity crisis here. Once again every mechanic works against another mechanic.\n\nWe have VERY FAST movement. But we can't use it. Levels are small and cramped so we sprint and just instantly run straight into a wall or get stuck on small bits of terrain. Vaulting is also  inconsistent. When I played i unbound the sprint button as it just hindered my progress. It's also incredibly fiddly to pick up items because we run like sonic on crack but need to precisely land on a 1cm² area and press X to pick it up. this slows you down immensely and picking up items is just a chore.\n\nEnemies have hitscan weapons, so running and gunning is out of the question except in very low difficulties. We are forced to play the game more like COD but then peeking corners and aiming doesn't work properly with super fast movement. Your health is capped super low as well and doesn't regenerate \n\nTo me Wolfenstein feels like each mechanic was developed by a different team that never spoke to the others... and then assembled at the end. \n\nI've played other games were I feel mechanics work AGAINST each other but never to this extent.",
        "created_utc": 1537009049,
        "upvote_ratio": ""
    },
    {
        "title": "Should Competitive Games still have Official Forums for Balancing/Feedback?",
        "author": "The--Nameless--One",
        "url": "https://www.reddit.com/r/truegaming/comments/9fyljn/should_competitive_games_still_have_official/",
        "text": "&amp;nbsp;&amp;nbsp;&amp;nbsp; Lately I've been seeing that more a more people are getting frustrated on official forums for competitive games like Overwatch, CS:GO, Paladins, League of Legends and others because of this idea that \"devs are ignoring my feedback\".  \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp; And in a way they are, in a way they arent. It has been clear that multiplayer games now have a very deep analytics system behind it. From simple things like what characters have highest winrates, to which paths in a map players usually go thru more often. Chokepoints, Death Funnels and the list goes on.  \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp; So, more often than not, devs are listening to your feedback, but not the one you're typing. And it has became more and more apparent that these kinds of threads and discussions went from being considered desirable by developers, to becoming something that more often than not gets shoved under the rug. \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;  And from this comes my questioning, shouldn't we just stop having these kinds of \"official forums/threads/posts\" where people mash their keyboards offering feedback that more often than not, is not even read and seem to only make people even madder?  \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp; As games become bigger and bigger, with more champions, weapons, maps and of course, players, combing thru all posts and taking into consideration every single individual opinion becomes impossible. Specially if you consider that most of the decisions in these games are based on statistics like winrate, bans, picks, etc...   \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp; Shouldn't then we just abolish these forums? With developers being clear about the fact that they can't keep up with those suggestions and the data speaks by itself?  ",
        "created_utc": 1536983807,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] Is sims 4 fun yet?",
        "author": "Silver-Monk_Shu",
        "url": "https://www.reddit.com/r/truegaming/comments/9fy6kd/serious_is_sims_4_fun_yet/",
        "text": "Coming from someone who played other sims games like 2 &amp; 3, is this game fun *yet*?  \nI don't care about graphics *at all* and the social mechanic was something I didn't really like or have interest in.  \n\nBut now that so many years passed with expansions.  I am assuming the game is fun now, right?",
        "created_utc": 1536979752,
        "upvote_ratio": ""
    },
    {
        "title": "What are some \"classic\" games that you played years after their release, and were still impressed with despite having no nostalgia?",
        "author": "Scdsco",
        "url": "https://www.reddit.com/r/truegaming/comments/9fwga0/what_are_some_classic_games_that_you_played_years/",
        "text": "[removed]",
        "created_utc": 1536964011,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever tried a classic game years later, and found it's \"legacy\" missed the point?",
        "author": "TyrannosaurusFresh",
        "url": "https://www.reddit.com/r/truegaming/comments/9fv89q/have_you_ever_tried_a_classic_game_years_later/",
        "text": "Maybe a weird question, but it's something I've been thinking about since I finally played FF 7 this past year.   \n\n\nIn the years after FF7 came out I saw all these Cloud cameos and spin offs that painted the game as a very serious grim and edgy fantasy. But when I finally got around to it I was surprised: the game is goofy as hell, and knows it! There are mini games about cross dressing, marching in line, raising animals and snowboarding.   \n\n\nBut the way the game is remembered now, I had no idea it would be so fun, and I think that maybe part of the reason people didn't like the spin offs (Dirge) or spiritual successors (FF 13 comes to mind as a game that explicitly was supposed to succeed 7 and failed) is because Square Enix forgot that all the weird fun took the edge off of the Grimdark main plot and made the game really special.\n\n&amp;#x200B;\n\nCan you think of any other games like this, where a game's legacy misses a huge part of what made the game so special?",
        "created_utc": 1536954805,
        "upvote_ratio": ""
    },
    {
        "title": "Are games past the era of poor tie-ins? Also, how should games go about tie-ins?",
        "author": "hcipap",
        "url": "https://www.reddit.com/r/truegaming/comments/9fu813/are_games_past_the_era_of_poor_tieins_also_how/",
        "text": "In the 360 era and everything before, games were seeing tons of tie-ins to other properties. Books, movies, etc. and as I'm sure we all know, most of them ranged from incredibly bad, to slightly-less than mediocre. \n\nOf course, there were exceptions. Spiderman 2, the Riddick games, X-Men Origins Wolverine, Bladerunner, etc. \n\nAs of the current era, there hasn't been a game release tying into every other huge-blockbuster movie. We recently got the new Spider Man that went with quality over trying to make a quick buck off of any movie, and that's what provoked this question. \n\nAs for the second part of the question, what's the best way to go about an adaptation? X-Men Origins and the latest Mad Max game both essentially copied God of War and Just Cause (I know it's the same devs) respectively, but were still two decent games that anyone who loves the properties are gonna be able to get behind. \n\nSomething like the Riddick games kind of went their own way, and in my opinion, were far more interesting, even if they were a tad more flawed. Side-note, I really want another Riddick game. The multiplayer modes offered in Dark Athena were really fucking cool. \n\nSo what do you guys think is the best way to go about adapting a tie-in to a video game? And, are we past the era of companies just shitting out a barely working product for a quick buck?",
        "created_utc": 1536947787,
        "upvote_ratio": ""
    },
    {
        "title": "Its harder to \"complete\" games now. How does this affect the experience?",
        "author": "alwayshungry88",
        "url": "https://www.reddit.com/r/truegaming/comments/9ftjq5/its_harder_to_complete_games_now_how_does_this/",
        "text": "Just got back into gaming this past year - the last system I really played was the N64. \n\nOne big difference I've noticed from my earlier days and now is that games seem to really push their replayability - either through \"post-game\" content or achievements or online multiplayer campaigns or whatever. While this is all well and good, I feel like this year I've never gotten that satisfaction that comes with beating or finishing a game. It used to be that you finish the main story and that was it.... you beat it. You want to keep playing? Play the game over again. Now, it seems that unless you are some insane 100%er, you never get that satisfaction of \"I've experienced all of this game\" - at least not from the game itself. \n\n\nSure, \"experiencing a game\" is a subjective thing - after all its the user who decides when they have experienced enough. However, there at least used to be an attainable, quantifiable way to know you've FINISHED the game - by beating the campaign. Kind of like finishing a book and closing the back cover, I would get a certain satisfaction of being able to turn off the console and walk away, knowing \"I beat it\". Now, some games literally put a percentage bar on the title screen showing how little of the game you have beat. \n\n\nSo, while I love designing games for replayability to increase their longevity, it certainly feels like the \"experience\" of the game is muddied a bit. Did I ever finish that game? What is finishing? \n\n\nFeels like games have shifted from the focus on the \"game\" aspect - wherein there's a discrete beginning, middle, and end - and emphasized \"play\" which is much more open ended. Not saying its necessarily a bad thing, but I do wish I could recapture that feeling of knowing I \"finished\" a game. \n\n\nHow do you experience games? How do you know when you're done? My guess is that the most popular answer is \"When I don't want to play it anymore\". That's fine, but do you feel the same when you do that as compared to when you beat a game that's more limited in terms of content (say, limited to the main campaign only?). ",
        "created_utc": 1536943019,
        "upvote_ratio": ""
    },
    {
        "title": "Does Battlefield: Bad Company 2 truly have unparalleled destruction?",
        "author": "TraditionalBisquit",
        "url": "https://www.reddit.com/r/truegaming/comments/9fsjq1/does_battlefield_bad_company_2_truly_have/",
        "text": "It is often said that the destruction has been scaled down in subsequent Battlefield entries (Bad Company 2 introduced collapsing buildings), but I consider the statement as only half-true. It's certainly correct that in Bad Company 2 entire multiplayer maps can be leveled down, but the game mainly features average-sized, standard buildings which perish in BF3, 4 and 1 as well. Using Battlefield 4's [Siege of Shanghai level](https://guides.gamepressure.com/battlefield4/guide.asp?ID=24811) — which has static skyscrapers, presumably with thousands upon thousands of rooms and square miles of interior area — as a reference Bad Company 2's scale is significantly more limited. [BF4's executive producer Patrick Bach states that non-destructible environment is a game-design-decision](https://www.theverge.com/2013/6/12/4423504/battlefield-4-no-you-cant-blow-everything-up):\n\n&gt; Having complete destructibility everywhere is not a technical limitation, it's a design decision. If you could go into every room of every building in this game, you'd completely ruin the experience... You'd need 1,000 players in order to fill them with something.  \n\n**UPDATE**: I wasn't aware that the buildings can't be fully destroyed (and don't collapse) in Battlefield 1. Even [small single-storey huts](https://i.redd.it/uto7blhcdem11.png) leave structure behind for cover and [larger buildings](https://i.redd.it/4qosnwy5eem11.png) maintain their basic layout (floors, stairs, parts of the wall)",
        "created_utc": 1536935973,
        "upvote_ratio": ""
    },
    {
        "title": "How should nostalgia and franchise connection affect a game's rating ?",
        "author": "qwedsa789654",
        "url": "https://www.reddit.com/r/truegaming/comments/9fpltj/how_should_nostalgia_and_franchise_connection/",
        "text": "(sorry for poor english)\n\nFor games using franchise characters with new system and story, how should we view the score of this game( from media or personally ) if there is nostalgia and the element of franchise affecting it?\n\nShould/Can we strip Mario,Peach,Browser out of odyssey and rate it as a great platform game?\n\nEg \nBOTW have a simple story as some of its predecessors\nBOTW ‘s music is dynamic with lots of references which new fans’d not know\nGOW , a new ARPG game in the franchise , should it be compared to other GOW or other ARPG more?\n",
        "created_utc": 1536905443,
        "upvote_ratio": ""
    },
    {
        "title": "Build defining your choices vs. choices defining your build",
        "author": "zeddyzed",
        "url": "https://www.reddit.com/r/truegaming/comments/9folop/build_defining_your_choices_vs_choices_defining/",
        "text": "Whilst many games combine the two in various ways, there's two extremes when it comes to morality / personality / choice driven games.  I guess when I'm talking about \"choices\" I mean specifically your conversation choices and the approach to solving quests etc.  As opposed to the choices in where to spend your skill points.\n\n* Build defines your choices\n\nEg.  Vampire the Masquerade Bloodlines, where your starting class and your build will turn on/off various conversation options and ways to solve quests.  These choices rarely feed back into altering your build, instead you have full control over where to spend skill points.\n\n\n* Choices define your build\n\nEg. Games which have some sort of good / evil meter, where your choices will push the meter one way or the other.  When you get \"good\" or \"evil\" enough, then you will unlock additional abilities depending on which way you go.  Or games which improve skills based on which ones you use.\n\n\n* Mix of the two\n\nEg. Pillars of Eternity, where your stats will turn on / off various conversation options (or influence success/failure), but there's also an additional reputation/personality layer, where your past choices can influence your success in later choices. (eg. if you make truthful replies most of the time, you will gain the honest trait and people will be more likely to take your word for things.)\n\n---------------\n\nWhat are your thoughts of these two opposite approaches?  Do you have a preference for one over the other?\n\n\nOne the one hand, it's nice to be able to organically grow your character's build based on the choices you make during gameplay.\n\n\nBut on the other hand, it's also cool to design a character with a particular theme in mind, and then to see how that character interacts with the world.\n\n\n\nOne interesting idea might be to be able to craft a moral system when designing your character, eg. \"Might makes right\", \"Personal responsibility\", \"Family before all others\" vs. \"Compassion for the unfortunate\", \"Altruism is good\", \"Maximize happiness for maximum people\".   Then you send your character off into the world, but you still have the full freedom to make any choice.  But your character will feel guilty, conflicted, or pleased with themselves based on the choices that you make as a player, which might have some gameplay consequences.",
        "created_utc": 1536894967,
        "upvote_ratio": ""
    },
    {
        "title": "\"Play a different game, then.\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9fnvi1/play_a_different_game_then/",
        "text": "[deleted]",
        "created_utc": 1536888750,
        "upvote_ratio": ""
    },
    {
        "title": "Steam is going to have to add a monthly service to survive",
        "author": "mtarascio",
        "url": "https://www.reddit.com/r/truegaming/comments/9fnp4f/steam_is_going_to_have_to_add_a_monthly_service/",
        "text": "I realize the title is hyperbolic but I think it stands true if you look at the industry in a decade or two from now.\n\nWe've already seen it with music, magazines, newspapers, movies and TV.\n\nBuying the actual product is becoming rare. The way we are starting to access products is with licensing or streaming services.\n\nYou have seen the market slowly turning that way. Playstation Plus was one of the first showings of this (happy to be corrected). You saw MS quickly have to match it with Games with Gold.\n\nThen EA came out with Origin Access on both Xbox and PC, offering a pretty damn decent deal for monthly access to a list of increasingly more recent games. They also have premium access that gives gamers access to the brand new releases too!\n\nMS also matched this with game pass now, offering other publishers older games along with the MS studios brand new titles (which are all PC / Xbox crossplay).\n\nYou have Bethedsa opening their own launcher software, Activision has consolidated with Blizzard, Uplay and Origin are decent pieces of software now and have a large install base.\n\nYou even have Humble Bundle coming in with their monthly offerings (I realize they are to own) which comes with the Trove.\n\nMy prediction is that CD Projekt will release something similar along with Cyberpunk for their portal GoG.\n\nMy conjecture is that Steam is going to be overran unless it gets a cheap monthly access service off the ground. Their market for selling games is eventually going to dry up.\n\nYou've seen them already react by relaying that they are serious about games again. They know they have to produce their own stuff to keep people on the platform.\n\nWhat are your thoughts on this future?\n\nEdit: BTW I don't think Valve or Steam will go away, they will respond. They probably have the easiest time of anyone for launching a service too. They'll wait for the longest moment possible to add a monthly service because they have most to lose to customers stopping purchases. Then they'll simply issue a press release - \n\n&gt;Oh hey, for $10 a month, you can access the entire Valve catalog, get some premium bonuses on DOTA 2, Artefact and Team Fortress 2, access to a few third party titles....\n\n&gt;...oh and this thing called Half Life 3 @ launch",
        "created_utc": 1536887287,
        "upvote_ratio": ""
    },
    {
        "title": "Not only are memes affected, mods are too..",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/gaming/comments/9flrkc/welp_its_been_a_good_run_modders/",
        "text": "[deleted]",
        "created_utc": 1536879599,
        "upvote_ratio": ""
    },
    {
        "title": "Who else doesn't like the concept of Battle Royales?",
        "author": "rodrigocar98",
        "url": "https://www.reddit.com/r/truegaming/comments/9fmin7/who_else_doesnt_like_the_concept_of_battle_royales/",
        "text": "[removed]",
        "created_utc": 1536877692,
        "upvote_ratio": ""
    },
    {
        "title": "About half way through Gran Turismo 2, you can buy a car that makes the game boringly easy. What other games unwittingly kill their own compelling gameplay by bypassing their difficulty, mid-playthrough?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9fmf0j/about_half_way_through_gran_turismo_2_you_can_buy/",
        "text": "[removed]",
        "created_utc": 1536876883,
        "upvote_ratio": ""
    },
    {
        "title": "Taking risks in game development - when should game developers learn to take risks or to be risk-averse?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/truegaming/comments/9fm7m2/taking_risks_in_game_development_when_should_game/",
        "text": "EDIT - Damn you, Reddit, always switching between formats!!\n\n\n\nAfter reading [this post](https://www.reddit.com/r/truegaming/comments/9ferht/the_game_designer_is_dead_long_live_the_game/\"&gt;this)  where the OP was passionately saying how the gaming industry is not taking risks to develop new games and keep releasing the same stuff over and over again, I actually wanted to ask this considering that I thought about this for a while.\n\nMany people rightfully criticised how most of the most popular gaming franchises from some of the most popular gaming companies are mostly popular titles with the same game and with little or not really that recognizable changes which pisses off a lot of people.\n\n\nKnowing that this formula works and doing well, regardless of whether it is a popular trope like the Battle Royale are the hype now, or whether it is the same format with a different skin like COD or Battlefield, it is understandable that these businessmen want to avoid making changes because they want to make money.   \n\n\nThe consumer's first response is that the businessmen in the gaming industry with their fancy suits and big offices are nothing more but greedy, rick bastards and I certainly feel that as well in some cases, especially when things are added for nothing more but financial gain like microtrasactions, loots boxes (or should I say \"legal gambling\"), pre-orders, overpriced DLC and so on (and of course, some of the most unapologetically greedy moves like EA;s progression structure in Battlefront 2)    \n\n\nHowever, I think that they want to do this not just to make money but because they do not want to take risk the unnecessary risk that will jeopardize their reputation. Simply put ... they are scared.\n\nI mean, I often think about this when a game flops or flops hard and its image becomes so well-known that nobody wants to buy another game made from that company anymore considering that most gaming flops were pretty known and notorious about it like ET, Duke Nukem Forever, Evolve and so on)   \n\n\nOf course, this does not necessarily mean that taking risks will definetely lead to failure and I am not saying that businesses interfering with the developers is not new either (actually this is pretty well-known in the movie industry and really notorious about it too).  \n\n\nI mean, I can understand that taking risks is better than no risks at all. \n  \n\nThe first Witcher game was not that good compared to its sequels but it was a small risk for CD Projekt to give it a good image and love from the fans. So did Rocksteady when they released the first Arkham game considering that superhero games were often flops and the second Arkham game was even better. Heck, even Ubisoft had lots of doubts about the latest Rainbow Six game and with a few patches, DLC and lots of time, it became one of the most popular games today.  \n\n\nBut what if that taking risks to make changes or make something brand new will lead to a complete backlash considering that:\n\n\n- the gaming industry has become increasingly demanding and the budgets are high and they are time-consuming and requires lots of manpower\n\n- because of the power of the internet and how messages spread like wildfire (just watch how the EA marketing team got a lot of notoriety for its promotion of Battlefront 2 on reddit, or the continuous habit of Ubisoft downgrading its games when released as the gameplay releases are often more highly detailed than the final versions), you cannot be sure who you are going to piss off, regardless of the fanbase that the game is asssociated with:  \n\n\n -- whether it is a geniunely passionate fan who made a good criticism    \n\n\n -- or an overly passionate fan who takes the slightest criticism way out proportion    \n\n\n -- or just another guy who wants to cause some drama on the internet, considering that different fans and players have all their own tastes and desires, not to mention how hypocritical humans can be (like hating COD games for being the same game over and over again or tired of the mega-franchises never going away while the Mario games still exist even though we often see some changes on a few releases or what people often too readily say that some games copied other games when in reality, all games copy each other or are inspired by each other some way)\n\n   \n\n\nThere are some good examples where risks are done well like for example the game [Battlefield 1](https://www.gamespot.com/articles/battlefield-1-ea-was-concerned-kids-didnt-know-ww1/1100-6440385/) , while there is not that many changes in the gameplay format when it is compared to other Battlefield games recently, EA was concerned whether making a game about World War 1, a setting that you do not see many games based off of it, was a good choice because they thought that younger players did not know that WW1 even existed (yeah, I know, .. hilarious, right?) or that trench warfare was not fun.\n\n\nOn the other hand, there are examples of developers taking risks that were met with criticism like in the game [XCOM 2](https://www.youtube.com/watch?v=QAVf7rb0IwM), Firaxis added a timer so that the players would take more risks instead of playing too cautiously in order to make the gameplay more interesting but this decision was met with criticism.  \n\n\nWhat about when a developer changes something from an already established franchise?\n\n  \n- Was Square Enix's choice to make Hitman Absolution's gameplay focused on smaller maps instead bigger ones like the previous games did and with the use of the environment instead of highly-technological gadgets was a good choice or not?  \n\n- Did Ubisoft make a good choice to keep the Assassin's Creed series alive even though Desmond is confirmed dead?\n  \n- Was Black Ops 4 being only a multiplayer focused game was a good choice even though singleplayer was never really the main focus of the series at all?  \n\n\n\nHeck, the COD games actually get a lot of notoriety about this - apart that its multiplayer gameplay mechanics have not changed much since COD 4, many players complained that they desired change but when change happened like adding jump packs in the game (even though the whole idea around the use of jump packs were poorly designed) or exo suits, they still complained and so when back to the WW2 setting which was the roots of the series and had a class system in its new war gamemode but that was also changed because of criticism from the community (if it was justified, I am not sure because I did not play the game so please correct me if I am wrong)  \n\n\nObviously I am not saying here that developers should either take risks or not. Gaming development is pretty lengthy process and there are lots of cover before the development even occurs - will the game sell? Does the team have the time, resources and training to develop such a game? Will the fans love it? Will it be evident and important in the gaming community for years to come? What elements will be used or ommitted?  .... yada, yada, yada. \n\n\nBut seriously, considering that many people (including me) have criticised that we often get the same games over and over again as if the developers do not want to take risks, I somehow believe that even taking risks have their own consequences    \n \n",
        "created_utc": 1536875324,
        "upvote_ratio": ""
    },
    {
        "title": "\"At the time of its release one could very strongly argue it was the most expansive and in depth exploration adventure game to date.\" Someone told me this re: Zelda: Breath of the Wild. Are there not 30 year old games far more complex, open, expansive, and deep than Breath of the Wild?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9flvv7/at_the_time_of_its_release_one_could_very/",
        "text": "[deleted]",
        "created_utc": 1536872941,
        "upvote_ratio": ""
    },
    {
        "title": "Have we seen every kind of gameplay the single player FPS genre could offer?",
        "author": "thomanou",
        "url": "https://www.reddit.com/r/truegaming/comments/9flugb/have_we_seen_every_kind_of_gameplay_the_single/",
        "text": "In almost three decades of playing single player FPS games, the genre seems to limit the player to two kinds of roles: either you are a one man army (Doom, Quake, Far Cry, Crysis, Half-Life, Wolfenstein, Halo...) or a squad leader (Rainbow Six, Swat, Star Wars Republic Commando, Brother in Arms...). Campaigns of games like Medal of Honor, Call of Duty or Battlefield try to hide the fact that you are a one man army, because there are countless allied bots, but ultimately, you are the single most important and powerful fighter on your side, and have nothing to think about outside of how to shoot at your enemy while staying alive.\n\nSometimes, FPS games are mixed with other genres, for example when you can drive cars (RAGE), have to deal with survival mechanics (The Forest), horror (Alien) or by being more or less RPGs like in S.T.A.L.K.E.R, Fallout 3 and 4 or in Deus Ex. But it's not an innovation within the genre per se, merely something brought over from another genre.\n\nIt's obvious that multiplayer FPS still have room for innovation. By playing a game like Squad, I had tremendous fun while playing a medic. Sure, you still have a gun, but risking your life by throwing a smoke on a wounded buddy, and trying to heal him despite enemy's suppressive fire was very enjoyable and refreshing. Battle Royale games are fairly new too.\n\nFrom a game design perspective, could we imagine anything more from a single player FPS? Or has the genre already been perfected since the end of the 1990s, forced to repeat itself over and over, with slightly tweaked guns, enemies, and setting? If so, why don't we get tired of the genre?\n",
        "created_utc": 1536872663,
        "upvote_ratio": ""
    },
    {
        "title": "Best console for casual gaming and media?",
        "author": "painfulvictories",
        "url": "https://www.reddit.com/r/truegaming/comments/9fl8nj/best_console_for_casual_gaming_and_media/",
        "text": "[removed]",
        "created_utc": 1536868307,
        "upvote_ratio": ""
    },
    {
        "title": "How far off is environmental destruction in games like Fallout",
        "author": "Freds_Premium",
        "url": "https://www.reddit.com/r/truegaming/comments/9fky6h/how_far_off_is_environmental_destruction_in_games/",
        "text": "I remember seeing this for the first time in Red Faction long ago. Why haven't new games been using this or at least using this to an extent? I suppose it would really exploit Fallout 4's poor level design because you could blast a hole right to the boss room for instance.  \n  \nSo is it more CPU intense or is game design?",
        "created_utc": 1536866255,
        "upvote_ratio": ""
    },
    {
        "title": "If an indie studio is \"just\" a studio without a publisher/one that self publishes, then what does that make one who is a publisher and developer studio?",
        "author": "meeheecaan",
        "url": "https://www.reddit.com/r/truegaming/comments/9fkwik/if_an_indie_studio_is_just_a_studio_without_a/",
        "text": "[removed]",
        "created_utc": 1536865930,
        "upvote_ratio": ""
    },
    {
        "title": "How has the Mass Effect series aged?",
        "author": "69Milfs",
        "url": "https://www.reddit.com/r/truegaming/comments/9fkfci/how_has_the_mass_effect_series_aged/",
        "text": "Besides Andromeda, do you guys feel as if the series holds up? A few things I noticed: \n\n* Shooting seems a tad \"janky\", in the sense that transitioning to cover isn't as smooth as it should be and player movement isn't as good as modern titles. Still very serviceable.\n* Mass Effect 1's removed elements were sorely missed. I definitely enjoyed the grenades, having different ammo varieties, etc. Mako wasn't as bad as people said. \n* The voice acting is still superb. \n* Was still a bit disappointed by how ME3 trivialized player choices, but I definitely think that the backlash was too much.\n* Renegade/Paragon dichotomy seems extremely cartoonish compared to modern titles like The Witcher, which have more subtelty. ",
        "created_utc": 1536862604,
        "upvote_ratio": ""
    },
    {
        "title": "If an indie studio is \"just\" a studio without a publisher/one that self publishes, then what does that make one who is a publisher and developer studio?",
        "author": "meeheecaan",
        "url": "https://www.reddit.com/r/truegaming/comments/9fjtv7/if_an_indie_studio_is_just_a_studio_without_a/",
        "text": "[removed]",
        "created_utc": 1536858514,
        "upvote_ratio": ""
    },
    {
        "title": "The full story behind Zelda: Ocarina of Time's cancelled sequel",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9fiqoe/the_full_story_behind_zelda_ocarina_of_times/",
        "text": "[removed]",
        "created_utc": 1536850919,
        "upvote_ratio": ""
    },
    {
        "title": "The Story behind Zelda: Ocarina of Time's cancelled sequel",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9fingh/the_story_behind_zelda_ocarina_of_times_cancelled/",
        "text": "[removed]",
        "created_utc": 1536850292,
        "upvote_ratio": ""
    },
    {
        "title": "What are the best Heavy Rain like games for Xbox One?",
        "author": "Georg_Reshetov",
        "url": "https://www.reddit.com/r/truegaming/comments/9fgpj1/what_are_the_best_heavy_rain_like_games_for_xbox/",
        "text": "[removed]",
        "created_utc": 1536833213,
        "upvote_ratio": ""
    },
    {
        "title": "ezClipit Gaming video sharing",
        "author": "ezClipit",
        "url": "https://www.reddit.com/r/truegaming/comments/9fft8o/ezclipit_gaming_video_sharing/",
        "text": "[removed]",
        "created_utc": 1536822188,
        "upvote_ratio": ""
    },
    {
        "title": "Games with the best visualizations of space?",
        "author": "MikhailTheFail",
        "url": "https://www.reddit.com/r/truegaming/comments/9fexc2/games_with_the_best_visualizations_of_space/",
        "text": "[removed]",
        "created_utc": 1536812469,
        "upvote_ratio": ""
    },
    {
        "title": "The Game Designer is Dead. Long Live the Game Designer.",
        "author": "tabbouleh_rasa",
        "url": "https://www.reddit.com/r/truegaming/comments/9ferht/the_game_designer_is_dead_long_live_the_game/",
        "text": "I've tried to make this argument multiple times when I was a struggling Game Designer, but it was always too emotional. Now that I've made the smart move and switched to becoming a Developer, and now  that I can clearly and concretely see how fucked the game industry is, I'm going to give this one more crack. And I'm going to summarize my argument right off the bat.\n\n**TL;DR: If you want to design games, design board games, because the modern video game industry has** ***little to almost no need*** **for game designers.**\n\nThese days, game studios do not invest in training or hiring good game designers, or even if they did they won't be able to find any, because:\n\n1. The video game industry has become incredibly capital intensive and therefore taking creative risks is no longer worth it. Aesthetics based monetization and the paradigm of Sofware-as-a-Service means that once you get ONE game, ANY game, to work, you only need to stick with it to print money forever, and you can usually just ripoff someone else's game design at that.\n2. The smartphone/indie game boom and bust came and went, indie designers continue to struggle to survive, while \"get rich quick\" cash in mobile game companies are increasingly falling back on tried-and-true design patterns, while at the same time getting swallowed by, well, Tencent.\n3. Our hypercapitalistic culture is pushing people away from celebrating artistic mediums, or the study of them as rigorous disciplines. These days, leading a triple-A game production is more akin to being a businessman than a creative.\n4. Crowdfunding disasters, like Star Citizen, has seriously put the whole damn industry in doubt. It's now possible to run a game like a ponzi scheme. Think about that for a second. That's not even mentioning the glut of subpar competition created by app platforms like App Store, Steam Greenlight, and Google Play, which makes exceptional games almost impossible to stand out.\n\nLet me elaborate on these points, but rest assured, you don't have to read these bits if you don't want to, just reread the TL;DR, that's all I'm really trying to say.\n\n**Point the first:**\n\nTeam Fortress, Counterstrike, PUBG, Fortnite, League of Legends, DOTA. All of these games were initially inspired by *free to play mods*. But now they're non-stop money printing machines, and there seems to be no end in sight.\n\nThere is a reason why Steam Corporation is never going to make Half-Life 3. Why should they? They have an effective monopoly over all computer game digital sales. Why take a risk on *any* video game, that might bomb, as the costs just keep going up? Even a bet as safe as HALF LIFE FUCKING THREE.\n\nAs the years march on, video games are becoming more and more capital intensive. Not only are the increased expectations of tech constantly pushing the costs to the limit, thereby making investors risk-averse, but the fact that the *safest bets ended up succeeding the most*: take an established, already popular mod (DayZ King of the Kill), freshen it up so that the mechanics are just a little tighter (-&gt; Playerunknown's Battlegrounds), then just tweak it even more so that the production values shine and the aesthetic appeals to as much of a mass market as possible (-&gt; Fortnite).\n\nAs case in point, take Star Wars 1313. Headed by Amy Hennig, of Uncharted fame. You've got one of the world's biggest IP (Star Wars), backed by the world's most powerful entertainment corporation bar none (Disney), a projected headed by a leader who has proven herself with *multiple* franchises (Uncharted, Legacy of Kain) by *any* metric of game production in the last few decades, this is a surefire win, right? Well, not in 2018, because as we all know, DAT SHIT DED: [https://www.svg.com/117164/disney-wont-release-star-wars-1313/](https://www.svg.com/117164/disney-wont-release-star-wars-1313/)\n\nInnovation is arguably BAD for this business model. Look at Fortnite. They tried to blaze a trail by combining minecraft style building mechanics with shooter mechanics. *No one cared.* For the longest time, Fortnite: Save the World looked like it was going to be an abject failure. It wasn't until they *ripped off the all too popular Battle Royale format* that they started seeing success. People only cared about Fortnite's gameplay innovations *after* they wholesale ripped off PUBG's successful foundation, to the point where PUBG *tried to sue them*.\n\nAs a further point, just look at Riot Games' approach to League of Legends. In a bid to keep the game \"fresh\", they tried hiring all these hotshot designers, tried reworking all the systems, essentially made it an entirely different game every year. Unfortunately, it seems that it didn't work: League is hemorrhaging players who can't keep up with all the gameplay changes, and the next generation of gamers aren't drawn to MOBAs, which was so early 2000s, but rather... Battle Royale games. Riot is more than likely working on a secret project now, even though in the last few years the purported goal was to make League of Legends a \"multi-generational game\", because for sure ALL MOBA games are bleeding players now... except maybe Dota 2, *because it's changed the least so that the players who stuck with it don't feel like they have to start over. You get rewarded more for doing less work!!*\n\nAnd just think. Does the BR genre feel \"fresh\"? Does it feel like there's innovation happening in it? Even a simple change, like when Fortnite removed the ability to reactivate your glider, was met with so much backlash (even though objectively leaving it in makes a lot of the game's early positioning tactics kind of meaningless) that they had to reintroduce it as \"Soaring 50's vs. 50's\".\n\nLet's just look at the AAA games of this generation that we all love. Witcher 3, Bloodborne, God of War. All games that built heavily on the tried-and-true (\\*cough\\* Dark Souls \\*cough\\*) and even the current darling, Spiderman, we can all say is just an HD-remaster-on-steroids of the original Spider-man 2 for PS 2 (fitting that the best movie of the Raimi trilogy would coincide with the best iteration of the game), and even the combat is inspired from Arkham Asylum.\n\nAs Uncle Ben would say... \"With Great Production Values, comes Great Risk Aversion.\"\n\n**Point the second:**\n\nIndie mobile designers usually thrive these days by going for extremely niche minimalist \"microgames\" (like 2047, Flappy Bird, Temple Run, etc.) which almost always get hit with tons of copycats (due to the insanely low barrier of entry), while Indie PC designers are forced to scrape by with microcommunities.\n\nThere were a few successes initially, when it seemed like it was going to be an indie videogame renaissance. But we now know that isn't true. The market consolidated a few winners (Supercell's Clash of Clans and Clash Royale, GungHo online's Puzzles and Dragons, Niantic's Pokemon: Go, that last one can hardly even be considered a winner anymore) while almost everything else falls by the wayside, buried in the deluge of productivity apps, photo filter apps and geolocation tracker running apps.\n\nAnd even worse, the winners have seen even further consolidation. Tencent now *completely* owns Riot Games and Supercell, and has majority stakes in Epic Games and Bluehole Games (South Korean creator of PUBG). Just take a second and think about that. League of Legends, Fortnite, PUBG, Clash Royale and Clash of Clans... probably five of the most overwhelmingly popular games in the world. Wanna know what happened after Tencent acquired all these hot properties? They post their first losses ever because China won't let them sell PUBG in China: [https://www.bloomberg.com/news/articles/2018-08-15/tencent-posts-a-surprise-profit-drop-as-regulators-hobble-games](https://www.bloomberg.com/news/articles/2018-08-15/tencent-posts-a-surprise-profit-drop-as-regulators-hobble-games)\n\n**Point the Third:**\n\nWhile Indie PC games like NEO Scavenger, Undertale, Darkest Dungeon and Underrail are *fantastic* games with an immense amount of depth, the sales can barely keep one or two people employed considering that even lo-fi indie games takes YEARS to make, often one dude slaving away for 10+ hour days on end. The initial surge of Indie success has come and gone: just watch the doc \"Indie Game: The Movie\". Perhaps the biggest winner in this entire sector was *Stardew Valley* by Eric Barone... that's ONE GUY, making ONE GAME, entirely on his own, and guess what? It might as well have been a Harvest Moon port.\n\nTo be a \"game designer\" with any sense of creative control over your product (instead of the corporate style \"design by committee\" formula) you must also: run your own business, be your own PR manager, be your own marketing expert, be your own artist, be your own coder (Dan Fedor was a technical artist and made lots of the pixel art and coded almost all of the game by himself, Dejan Radisic practically built the entire Underrail alpha with his own two hands, Eric Barone made all the art and did all the code for Stardew Valley). Game Designer is now a secondary title, either everyone on the team has some semblance of Game Design understanding, or no one does (replaced by UX designers, monetisation experts, project managers), because any self-styled \"game designer\" will have to build the game he designs by himself, ain't no company giving you a job just to crank out a GDD (game design document) if you can't contribute to the project in some other way as well. It is no longer considered a serious job title. You are Developer/Game Designer, or Artist/Game Designer, or Project Manager/Game Designer. There is no \"Game Designer\". Most of the time, you might as well just leave out the \"/Game Designer\" bit. I suppose exceptions to the rule exist, but they are more than likely older designers, brought up in the much more creatively inspired industry of the 90s, and maybe had to work brutal hours under a AAA studio as a QA for a decade before they were properly brought up into the \"design team\".\n\nNot only is corporate culture *loathe* to celebrate the auteur (which is logical since out sized individual influence for any employee other than the CEO, who is beholden to a faceless group of shareholders anyway, is the antithesis of how corporations work) but even successful game designers are expected to take on roles than have nothing to do with game design: project manager, team leader, public relations expert, tech evangelist.\n\nConcrete examples: Hideo Kojima's treatment by Konami, or say, Cliff Blezinski's career trajectory, which has clearly gone from \"rockstar game designer\" to \"elite businessman who sells Unreal Engine\".\n\nThese days, people want to be Elon Musk instead of Steven Spielberg. And at least, with film, you're talking about a much more easily made product with a LOT of rigorous academic discipline behind it. Who gets more respect... Steven Spielberg, or Sid Meier? Is Sid Meier even a game designer anymore, or just a brand name and a businessman who owns Firaxis Games?\n\nOne good metaphor, I think, is that of the rap mogul. Are Jay-Z, Dr. Dre, and 50 Cent known more for their music these days? ...or their businesses? (Tidal, Beats, Vitamin Water) These are the three biggest fortunes in the rap game, and all three of them stem from business decisions. Just like how it is in the rap game, business acumen has become more critical to making video games than creativity, at this point.\n\n**Point the fourth:**\n\n...even *unscrupulous* \"business\" acumen, and nowhere can this be seen more clearly that Scam... I mean *Star* Citizen.\n\nI'm not even going to get into Star Citizen, because the facts speak for themselves. Any project that is going well shouldn't need to ask its massive *crowdfunding* (not even customer, because the product hasn't even been fucking finished!) community to shell out $27,000 (only after you've shelled out the roughly $1,000 to even get access to this \"deal\" in the first place) for \"every ship in the game\", most of which exist only in the minds of artists and designers.\n\nRight along with the \"Indie game boom\" was the \"Crowdfunding boom\". You look at, say, Double Fine Entertainment, and it becomes clear that my last point, that you need business acumen more than you need creativity these days when making games, is best exemplified by Tim Schafer. Taking an underdog studio that made critically acclaimed but underperforming hits into the darling of the Indie/Crowdfunding nexus... and then using that same blessing to bring his company *back* into the graces of the publishers... is probably the most brilliant yet circumlocutory path to video game studio success ever seen. Not only were some of the crowdfunded games panned (like the long awaited \"Broken Age\") but many of the games that Double Fine went ahead and made with their newfound capital were small, experimental games that essentially helped the company paddle leisurely along, making games that were fun for them to make, as their fans continued to give them money before an actual product, until they scored a publishing deal for Psychonauts 2, which, let's be real, was what we all wanted all along. And how innovative do we expect Psychonauts to be, really? Do we really expect weird ass mechanics like in Stacking? ( [https://en.wikipedia.org/wiki/Stacking\\_(video\\_game)](https://en.wikipedia.org/wiki/Stacking_(video_game)) ) Of course not, because that would be sacrilege.\n\nSo let me ask you. If you really think you do care about innovation in videogames. Did you give a shit about Stacking? Did you play it? Or did it feel like a gimmick?\n\nDo we *really* want innovation in our video games, or are we just looking for the Man to make a better Skinner Box?\n\nBecause if we just keep playing Battle Royale games so we can accrue enough soft currency to buy that next sweet hat *instead of* diversifying our video game tastes (and thereby putting money in the hands of creative innovators) it really seems like the latter option - the Skinner Box - is what we really want.\n\nThese days, if you want a specific type of game that isn't popular, it's going to have to be crowdfunded. I'll take one example that's near and dear to me: Pillars of Eternity. I loved tactical isometric RPGs. When I heard PoE was going to be crowdfunded, I was so excited. But, when the product finally came out, it sucked. Why?\n\nReturning to point the first: games are just becoming so capital intensive that crowdfunding *isn't* a guarantor of quality. Moreover, crowdfunding leaves the producer beholden to the fans, leading to shit decisions, like all the lame Mary-Sues, oh I'm sorry \"backer characters\", strewn about in PoE, with a litany of Fifty Shades of Grey cringe-level fanfiction writing to show you should you be stupid enough to try a talk interaction with them. More often than not, crowdfunding has absurd *stretch goals* that perpetually leave the team spread out to thin, no matter how much money is raised, even for features that do not serve the game at all as a whole but just *sound cool* on their own, like the stupid, stupid, stupid fucking levels of Od Nua. And even worse, crowdfunding fundamentally sustains itself on hype. When the hype dies down, what happens?\n\nGuess what? Banner Saga 2 bombed hard af. No one bought it. Guess what? Pillars of Eternity: The White March DLCs, although it is commonly agreed by the PoE community to be the expansion that \"fixed\" the game's combat (after years, with the 3.0 revamp)... did not even break even on sales. Obsidian Entertainment *lost money* on The White March. Guess what? X-Com 2 underperformed just as badly as these two, and Firaxis barely recovered by releasing the expansion, which made it a very, very different game. There are probably a lot more examples, but I don't want to hunt them down because... that's depressing. Because we all know what happened. The first crowdfunding surge probably brought in a lot of people who were into it because of nostalgia, only for the limitations of crowdfunding to reveal itself, leaving everyone disinterested... and before you know it, everyone has moved on to a Battle Royale game of choice.\n\n**Conclusion:**\n\nThe truth is, game design is just about hijacking human consciousness. It's about getting people to be addicted to the a behavioral loop. There's nothing glorious, or creative, about it when you scale that up to the corporate level, because all you *really* need to design is that one lever, that core game loop, that you can pull again, and again, and again, and oftentimes it's just way easier to *lift that design from someone else* than build it yourself from scratch.\n\nTen thousand games of Fortnite would never have the meaning that a single viewing of The Godfather part II could hold. Fifty million games of Fortnite could not compare to Moby Dick. And even the most emotionally devastating and meaningfully masterful games of the 21st century, like The Last of Us, owes more to narrative design, storytelling, film design, character design than it does to game design. Viewed from the lens of pure game design: Last of Us is just another survival/stealth action shooter, except with an escort objective that cannot actually be killed.\n\nIf you want truly mindbending, creative, and innovative game mechanics, look to board games. And in fact, it can't be a coincidence that these days we're seeing a resurgence of analog board games. People are sick of the \"design-by-committee\" philosophy that has completely eaten the videogame industry alive.\n\n**TL;DR: If you want to design games, design board games, because the modern video game industry has** ***little to almost no need*** **for game designers.**\n\nThe Game Designer is dead. Long live the Game Designer.  \n\n\nEDIT: P.S, one last data point. Guess what the biggest growing segment in mobile gaming is? It's online gambling/casino games. Like I said, it is easier to lift game design from somewhere else now than to invent it wholesale. ",
        "created_utc": 1536810979,
        "upvote_ratio": ""
    },
    {
        "title": "Between an Xbox One and PS4, what do you guys think is the better long-term investments?",
        "author": "selectbrandcoffee",
        "url": "https://www.reddit.com/r/truegaming/comments/9fdvwz/between_an_xbox_one_and_ps4_what_do_you_guys/",
        "text": "[removed]",
        "created_utc": 1536803499,
        "upvote_ratio": ""
    },
    {
        "title": "More fun due to a mentality change.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9fdkhk/more_fun_due_to_a_mentality_change/",
        "text": "[deleted]",
        "created_utc": 1536800855,
        "upvote_ratio": ""
    },
    {
        "title": "For someone trying to figure out which console would be the better investement, which would you say is the better service in 2018: Xbox Live or PS+?",
        "author": "selectbrandcoffee",
        "url": "https://www.reddit.com/r/truegaming/comments/9fcngw/for_someone_trying_to_figure_out_which_console/",
        "text": "[removed]",
        "created_utc": 1536793183,
        "upvote_ratio": ""
    },
    {
        "title": "Will online gaming ever swing back to having more player freedom at the expense of others?",
        "author": "Emeraldoin",
        "url": "https://www.reddit.com/r/truegaming/comments/9fb4u0/will_online_gaming_ever_swing_back_to_having_more/",
        "text": "I used to play a game called Ultima Online. You could get away with a lot of stuff in that game. You could kill a player and literally take their stuff, teleport them to a PvP zone where they'd get insta-gibbed, I believe you could also flat out steal things from people? I'm pretty sure scamming people for money was also accepted since you could always get killed back. To earn money by scamming you really had to plan stuff ahead so you could literally run away with their money.\n\nLets take WoW as an example. While you can kill other people on PvP realms or in instanced examples (battlegrounds, arena, Ashran) you don't really suffer from it. Not even financially since dying from PvP doesn't damage your armor. All you really waste is time spent at the death screen. Scamming people outright gets you banned I believe?\n\nEdit: I actually had a better articulated portion but it didn't save. Sorry.",
        "created_utc": 1536782283,
        "upvote_ratio": ""
    },
    {
        "title": "Has your \"moral compass\" in games changed over the years?",
        "author": "poison-fang-blade",
        "url": "https://www.reddit.com/r/truegaming/comments/9fb1nl/has_your_moral_compass_in_games_changed_over_the/",
        "text": "By moral compass I mean your general attitude when you play a game where you face moral choices; moral choices being something that has impact in the story or in a sidequest but also smaller things like killing an innocent peasant just for the hell of it and no particular motive.\n\nI think the main traits I noticed in myself were those:\n\n- I'm 28 now, but until my late teens, in every game that had some freedom of choice I ended up being some murderous psycopath just because. No reason, motive, nothing. It felt fun and I rolled with it. Every time I could kill someone, I'd do it. Nowadays, while I feel no particular moral restraint about killing an innocent character, I need motive. Killing for the sake of killing feels like too much work now. Give me a reason, though, and I won't hesitate. The reason could range from something major like accepting a contract to kill an important figure to something petty like some nobody being needlessly rude or generally a prick to me - like Nazeem from Skyrim, for example. But the reason has to be there.\n\n- If I'm playing a game where money/resources are scarce, I won't hesitate to do something morally questionable or outright evil to get more. But if I become rich and/or resources aren't an issue to me anymore, I end up being generally \"good\", \"do the right thing\", help people, etc.",
        "created_utc": 1536781690,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people want more game modes in multiplayer games ?",
        "author": "SylvineKiwi",
        "url": "https://www.reddit.com/r/truegaming/comments/9fa1ac/why_do_people_want_more_game_modes_in_multiplayer/",
        "text": "This thing is killing me (and his killing a lot of multiplayer games).\n\nWhy do people always ask for more game modes in MP games, especially when most will only play the least interesting ones ?\n\nThe best multiplayers game (this is not an opinion, I'm just looking at the most enduring ones) out there have basically one game mode (R6 Siege, Overwatch, Rocket League, CS, LOL, DOTA, PUBG...) because that's the way you do it.\n\nPlayer seems to treat game modes as a distraction, like Mutators in Unreal (you know, things like low gravity), when it's actually one of the most important part of a game. It dictates how a game is played, and having a totally different game mode equals playing a totally different game, which should require to redo all the balancing, the mechanics, the level design...\n\nJust look at something like Battlefield, where you have widely different game modes with the same maps, what happen is that some maps simply don't work on some game modes.\n\nFor me it totally killed BF3 (and following games), because joining a rush only server with good settings was virtually impossible, and even if you find one, you would either play on a very small map pool, or have to endure maps that are not designed for this game mode. \n\nEven inside the same game mode, you have maps with no vehicles, making the engineer class useless, or maps with too many vehicles, making any class but the engineer useless. To an extend, server customisation is the same problem, and I really bless console gaming for inventing the match making system, which standardized the way you play a game.\n\nIf I play R6 Siege, I just click Play, and I know I will always have the same game experience, that I like, else I would play another game.\n\nBecause that's the thing, with so many games available (a lot of them for free), why do you need diversity inside the same game ? If you want to play something else, well go play something else. Especially when the said variety is just copying what other games are doing.",
        "created_utc": 1536774909,
        "upvote_ratio": ""
    },
    {
        "title": "Should fighting games rely purely on competitive to sustain themselves and be successful?",
        "author": "RainbowLoli",
        "url": "https://www.reddit.com/r/truegaming/comments/9fa08u/should_fighting_games_rely_purely_on_competitive/",
        "text": "Personally, I'm of the opinion that the best fighting games are those that you can enjoy even when you are fighting someone else because there are times when you want to play the game, but not compete against other people. So I think that having a decent amount of single player arcade modes, options, campaigns, etc. is a good way of drawing in people that aren't focused purely on competing / your casual players.\n\nEspecially given that to truly be successful and sustain yourself based off of competitive, the game has to be designed around that and make a large amount of money from esports tournaments and their professional players. I think a common flaw in many fighting games is that there is no interest to be held in them unless you are going to be doing competitive, which results in some games falling off the radar or doing poorly in sales if they couldn't rake in enough money from esports. I think a good fighting game has good single player content and good competitive content rather than just being purely competitive content. \n\nThoughts?",
        "created_utc": 1536774704,
        "upvote_ratio": ""
    },
    {
        "title": "Does anybody else sometimes struggle to get into new games because they are so used to the previous game?",
        "author": "albanshqiptar",
        "url": "https://www.reddit.com/r/truegaming/comments/9f8meh/does_anybody_else_sometimes_struggle_to_get_into/",
        "text": "[removed]",
        "created_utc": 1536765219,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the chaos system found in Dishonored considered a punishment by many ?",
        "author": "BastillianFig",
        "url": "https://www.reddit.com/r/truegaming/comments/9f8icc/why_is_the_chaos_system_found_in_dishonored/",
        "text": "I've seen many people talk about a thing called ludonarrative dissonance. You know how drake from uncharted kills about 1000 guys but doesn't seem to care, and still is a jolly guy afterwards and everyone is his friend and loves him despite the fact he's a mass murderer. That is LD.\n\nI have seen a lot of people complain about that, saying its silly. However when Dishonored gives you a chaos system- if you kill too many people you are actually treated like a mass murderer for committing mass murder- people complain the game is punishing you...\n\nI never understood this because it seems like a good way to remedy the LD phenomenon. \n\nI don't think the high chaos ending is a BAD ending it's just darker. You still achieve your task, D2 spoiler : &gt;!you can even become emporer yourself in the second one.!&lt; Doesn't sound like a BAD ending from your characters perspective at all. \n\n Surely you should embrace the darkness if you are happy to mow down countless guards just doing their job. \n\nI always thought it was a great system, but I'm a bit surprised to see people's reaction  \n\n\nThey also do mention the fact non lethal is slower and harder than lethal but why shouldn't it be. I don't think the 2 playstyles should be the same where NONLETHAL weapons work the exact same way as regular weapons like Mgsv. \n\nWhat are your thoughts",
        "created_utc": 1536764435,
        "upvote_ratio": ""
    },
    {
        "title": "Indie Gaming Revenue Question: More Royalties from Physical or Digital Sales? And What’s the better Indie Handheld Console?",
        "author": "mean_emcee",
        "url": "https://www.reddit.com/r/truegaming/comments/9f7ibw/indie_gaming_revenue_question_more_royalties_from/",
        "text": "Hey All. So after hearing about the new release date for Hollow Knight coming to consoled, I got to thinking if it’d be better to get the digital version of the game for my consoles or if I should wait for the physical release to come out next year. One factor that I’d want to consider honesty is whether Team Cherry would get more benefits and royalties from a physical game release or if it’d be better to just get the digital version of their game.\n\nI love the game, even though I first purchased it on Steam in its DRM riddled cage, and would love to support its console release, and yet I’m a bit on the fence on which format is right for me. If the game would be Future proofed with other consoles in s digital release I’d be all for that, but at the same time I enjoy the feeling that I actually physically own the game with a disc/ cartridge that can be returned and/or resold. But now I wonder, even though discs and cartridges do cost slightly more to make, would Team Cherry receive a higher royalty from their sales, or does it even out with the digital sale royalties? I’m curious what insights you guys have on this.\n\nOn a side note, at this time I’m very much leaning towards getting indies for my PS4, but I’m between stocking up my Vita as an Indie Handheld, or if I should stick with exclusives for Vita and invest towards a Switch as an Indie Handheld. I’m personally waiting until the news of the Virtual Console is released at the end of the month to decide if I’d want to try the Switch for an affordable price, Primarily for N64 and GameCube titles. But on the other hand, are there enough pros for the Switch as it stands to let it succeed my Vita, or am I better off sticking with my little Sony companion for just a bit longer?\n\nI know that these thoughts may seem a bit scattered, but I would genuinely appreciate any feedback you all have on the matter. Thanks :)",
        "created_utc": 1536757040,
        "upvote_ratio": ""
    },
    {
        "title": "I'm Confused, Can Someone Explain To Me IP Rights vs Publishing Rights?",
        "author": "SDgundam",
        "url": "https://www.reddit.com/r/truegaming/comments/9f6bws/im_confused_can_someone_explain_to_me_ip_rights/",
        "text": "So I just got excited and heard some company just bought up Kingdom of Amalur Reckoning. Which is a amazing action rpg that had a mmo feel. Which some mmo's and action rpgs should take note. Anyways, the company said something like they can't guarantee a release of this even though they own the IP Rights because EA still has the Publishing Rights. So what is the point of having the IP Rights if you can't do anything? Can someone just explain this to me because I am confused.\n\n&amp;#x200B;\n\n[https://www.destructoid.com/kingdoms-of-amalur-won-t-be-getting-a-remaster-unless-ea-approves-522265.phtml](https://www.destructoid.com/kingdoms-of-amalur-won-t-be-getting-a-remaster-unless-ea-approves-522265.phtml)",
        "created_utc": 1536746086,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good solo/non-teambased multiplayer games that you can play for 100+ hours and still feel like you're improving? And what can developers do to help achieve this?",
        "author": "SecretAznMan123",
        "url": "https://www.reddit.com/r/truegaming/comments/9f5cw3/what_are_some_good_solononteambased_multiplayer/",
        "text": "[removed]",
        "created_utc": 1536734397,
        "upvote_ratio": ""
    },
    {
        "title": "Some of my favorite parts about Breath of the Wild",
        "author": "Kljunar",
        "url": "https://www.reddit.com/r/truegaming/comments/9f4mj3/some_of_my_favorite_parts_about_breath_of_the_wild/",
        "text": "I just played the game for the first time not too long ago, I know I'm a bit late to the party. \n\nI have to say my very favorite thing about the game is probably that it forces you to interact with the environment, the people in the game, way more than any other game I've seen. Even a game like the Witcher (which is still a great game in my opinion) has you follow a quest-line when it comes to speaking to different NPCs. \n\n\"Speak to this person,\" and \"go here and talk to this person.\" \n\nBreath of the wild has some of that, of course, but it had what I wasn't thinking I needed in a game until I experienced it. It has open ended quests, quests where you're put in an area and aren't specifically told who to talk to or what you're completely looking for. It forces you to interact, it forces you to feel more like the hero of the game trying to figure out how he's gonna save the world. \n\nI have yet to see many other games do this, and I'd like to see it more often. \n\nWhat do you all think? Am I just missing something in other games?",
        "created_utc": 1536726429,
        "upvote_ratio": ""
    },
    {
        "title": "$350 premium orb opening plus bonus mega orb opening Marvel Strike Force",
        "author": "e_gunshy",
        "url": "https://www.reddit.com/r/truegaming/comments/9f0wkl/350_premium_orb_opening_plus_bonus_mega_orb/",
        "text": "[removed]",
        "created_utc": 1536696473,
        "upvote_ratio": ""
    },
    {
        "title": "Is the gaming community more prone to apologisms than others?",
        "author": "The--Nameless--One",
        "url": "https://www.reddit.com/r/truegaming/comments/9f0blv/is_the_gaming_community_more_prone_to_apologisms/",
        "text": "&amp;nbsp;&amp;nbsp;&amp;nbsp; Apologisms being a somewhat cheeky way of saying: defending something that is usually against your own interest as a consumer.  \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp; This is an open-ended discussion and I hope we can keep it civil, but I understand there are some implications.  \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp; 4 years after the release of the Master Chief Collection, the game was finally \"patched\" last month with game-breaking bug fixed, quality of life improvements and whatnot. The Launch State of MCC was so plagued with negative backlash that the developers not only acknowledge all the problems, but even offered a \"gift\" to make peace.\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp; These fixes were only possible because the communit joined together and helped the developers iron out bugs, eventually acting as beta-testers for a product they already paid.  \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp; Square-Enix announced the Final Fantasy VII Remake in 2015, from then to now there has been news that most of the work on the remake was being done by a third-party contractor, with Square-Enix supervising it while the game director's 'hot-seated' between the two projects. As it's stands now Square-Enix is not working with said studio anymore and there has been all sorts of reports on how much of the previous work was scrapped. Some said that the reason for the announce was to help Square keep their investors engaged, since Final Fantasy XV was only going to be released more than a year later (after a long period of delays) .  \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp; Reset was announced in 2012, showcasing absurdly advanced graphics for a game being developed by exactly two people. It's been almost 6 years and a 70k+ Euros Kickstarter campaign later, nothing was released other than a very short demo that not only showcases visual downgrade, but an almost unplayable performance. The developers update the site yearly with short announces like \"we're still here ^-^\".  \n&amp;nbsp;&amp;nbsp;&amp;nbsp; What all these things have in common is the amount of people who, year after year, defend these companies and stand by them, as unpaid public relations. I've tried my best to choose from a different array of examples that encapsulate different kinds of 'problematic' situations when games are announced, financed and/or released. But even so I still feel that in a thread like this, made to discuss a player behavior with examples, somebody will feel an urge to explain that either one of these companies/people 'did nothing wrong'.  \n\n&amp;nbsp;&amp;nbsp;&amp;nbsp; These are big cases but of course we can find other others, like graphical downgrades and 'did they really expect this feature?'.  \n\nBut what are your opinions on this? Are games more prone to apologisms? is it a biased view? Are they right to defend companies who pay them nothing for it, are they wrong? Let's see if we can have this conversation.",
        "created_utc": 1536692336,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many games use a pixel art style, yet so few actually represent 80s / early 90s games?",
        "author": "Thatyahoo",
        "url": "https://www.reddit.com/r/truegaming/comments/9eyxn8/why_do_so_many_games_use_a_pixel_art_style_yet_so/",
        "text": "[removed]",
        "created_utc": 1536682397,
        "upvote_ratio": ""
    },
    {
        "title": "One game or multiple games as a hobby",
        "author": "LevinKostya",
        "url": "https://www.reddit.com/r/truegaming/comments/9eygnq/one_game_or_multiple_games_as_a_hobby/",
        "text": "Hi guys, I would like to propose a topic for discussion.\n\n&amp;#x200B;\n\nI have the impression that most of the gamers who follow this subreddit, or /r/Games , or /r/shouldibuythisgame and others, are buying and playing a number of different videogames.\n\nThose players are looking for the best games of the genre(s) that they enjoy, sometimes keeping themselves updated with news and information about new releases and more, and finally buying and trying a multitude of different videogames.\n\n&amp;#x200B;\n\nOn the other hand, many other players, probably underrepresented in the general gaming communities, are mostly concentrating on one single title during their gaming time.\n\nI think about the advanced Starcraft 2 or LOL players, or to some MMORPG players. But the phenomen is not limited only to hardcore multiplayer games: there are in fact people who spend thousands of hours exploring every bit of  map in the different fallout games, or perfecting their strategies in one specific Grand Strategy game and playing nothing else.\n\n&amp;#x200B;\n\nTo simplify I would say that the hobby is \"gaming\" for some people and \"one specific game\" for others.\n\n&amp;#x200B;\n\nConsidering this, I would like to ask you a few questions:\n\n&amp;#x200B;\n\n1. Who in your opinion is probably enjoying his hobby the most?\n\nAre those who play only one game missing out the experience of playing all the other games? Or is the continuos change of game of the others, constantly moving their attention the the next new shiny thing, preventing them from enjoying what they are playing right now?\n\n&amp;#x200B;\n\nHas it ever happened to you to be concentrated for a long time (months) on a single game, and did you enjoy this time more or less that the periods in which you were switching games constantly?\n\n&amp;#x200B;\n\n2)  How should a game be, for you to consider it good enough to take 90-100% of your gaming time for months or for years?\n\n&amp;#x200B;\n\n3)  What games are more easily attracting one type of player or the other?\n\nPersonally I have the impression that for example, many of the extremely long and large open world RPGs, are made to attract the \"single game\" players. Multiple times in this subreddit people have posted complaints on how some games are just \"too large and long\", but probably only because this subreddit is mostly frequented by players who like to change game often.\n\nWhat are your thoughts?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nEDIT: Formatting",
        "created_utc": 1536679138,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Switch the best designed console of all time?",
        "author": "NA__Scrubbed",
        "url": "https://www.reddit.com/r/truegaming/comments/9exhix/is_the_switch_the_best_designed_console_of_all/",
        "text": "As per thread title. This is **not** a question of whether or not the Switch has the best game lineups. Personally, for this generation (including games released on the PC), I think the PS4 has that crown. \n\nWhat I mean to comment on is that the Switch is, to my mind, *the* best at what it specializes in regardless of hardware limitations. There's nothing like the joycon on any console for physically facilitating local multiplayer. If I want to take it with me to a friend's, not only is it by far the smallest console, but it can just as easily function without a screen as with it. To that end, the screen and audio are both great. Additionally, it is wondrously easy to attach joycons temporarily to new Switch consoles. There are no wires, and you can use up to 8(!) local input devices at the same time.\n\nIn summation, to me, the Switch feels like more than just another platform to play games on. By its very nature, the Switch seems like an easy way to have a good time with friends. I can't remember the last time (and I've been gaming since the SNES) another gaming platform has brought that much to the table.",
        "created_utc": 1536672024,
        "upvote_ratio": ""
    },
    {
        "title": "Why are so many roguelites scared to let you become ludicrously overpowered in the way The Binding of Isaac does?",
        "author": "daralann",
        "url": "https://www.reddit.com/r/truegaming/comments/9ew0so/why_are_so_many_roguelites_scared_to_let_you/",
        "text": "This is something that I notice in the vast majority of roguelites out there ever since I played BoI back in the day. \n\nOne of my favorite things about it is that it lays down the rules: these are the items, and this is what they do. Manage to get 10 damage upgrades? You get all that damage, there's no cap. Get a stupidly overpowered combination that destroys any room the millisecond you enter with a single button press? Have fun! It works as advertised! The game never stops you from having these things and it has all the ingredients there to have them happen and *let* them happen. \n\nIn many other games of the same vein this is almost never the case. Sure, you can get some pretty great combos in runs of FTL, Rogue Legacy, Enter the Gungeon, Risk of Rain, etc. but you never get that just *dumb* level of overpowered that only Isaac lets you have. Why have few to no games tried to copy this in the 7 years since the original Isaac release?",
        "created_utc": 1536658330,
        "upvote_ratio": ""
    },
    {
        "title": "Are the most people playing on PC or Console?",
        "author": "ILikePUBG",
        "url": "https://www.reddit.com/r/truegaming/comments/9eum8x/are_the_most_people_playing_on_pc_or_console/",
        "text": "[removed]",
        "created_utc": 1536642095,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else love competitive games / games with ranked queues?",
        "author": "Pawcore",
        "url": "https://www.reddit.com/r/truegaming/comments/9eu5cg/does_anyone_else_love_competitive_games_games/",
        "text": "[removed]",
        "created_utc": 1536638123,
        "upvote_ratio": ""
    },
    {
        "title": "Fast travel as a mechanic",
        "author": "MajesticAssDuck",
        "url": "https://www.reddit.com/r/truegaming/comments/9esyus/fast_travel_as_a_mechanic/",
        "text": "So I replayed Darksiders 1 and am playing 2 for the first time in anticipation of 3, and the difference in fast travel between the two is enormous. In Darksiders 1, fast travel was going through the different serpent holes to get to different parts of the map. It was fun, and most importantly it was fast travel built in as a game mechanic. It made sense in context with the games lore and maintained the immersiveness.\n\nIn contrast, Darksiders 2 is just plain old fast travel. Click a spot on the map, sit through a loading screen, and you're there. No lore explanations, just click and go. In addition, they implemented this in the most immersion breaking way possible, in that at certain parts of the game, you have to fast travel. I've found a few dungeons so far that lock doors behind you, or prevent backtracking in some way, so once you get to the end and defeat the dungeon boss, the only way to leave is by fast traveling. Which is entirely immersion breaking because all I'm thinking is \"okay, how did he get out when I couldn't, though.\"\n\nIn general I'm a huge user of fast travel. In most RPGs, the map is just too big and I don't have time to walk back and forth hundreds of times. And mostly it doesn't bother me because it's usually at least casually explained, typically with in game time passing roughly the equivalent as if you had walked back yourself.\n\nSo what games do it right? What games got it wrong or annoying?",
        "created_utc": 1536628150,
        "upvote_ratio": ""
    },
    {
        "title": "Could you help me find games with multiple official English translations?",
        "author": "Simonshinra",
        "url": "https://www.reddit.com/r/truegaming/comments/9es9u2/could_you_help_me_find_games_with_multiple/",
        "text": "[removed]",
        "created_utc": 1536622387,
        "upvote_ratio": ""
    },
    {
        "title": "When did console gaming stop being about convenience?",
        "author": "someguywhocanfly",
        "url": "https://www.reddit.com/r/truegaming/comments/9erpd2/when_did_console_gaming_stop_being_about/",
        "text": "A little background: I've not owned a home console since the Xbox 360, and a Wii U briefly about 3 years ago. Mostly been PC gaming since then.\n\nSo, I just bought a PS4 for the new Spider-man. I excitedly put the disc in after setting everything up, and get hit with a 43gb download that I'm told will take nearly 2 hours.\n\nWhat's the point of buying a console, and buying physical copies of games, if you can't even play them right out of the box? Why has this become the norm, and why do people seem to just accept it? \n\nI had a quick search and couldn't find any posts about it, although I suppose it might be quite an old topic by now.",
        "created_utc": 1536617953,
        "upvote_ratio": ""
    },
    {
        "title": "Spider-man gleefully beating up drug dealers feels wrong",
        "author": "Sniperion00",
        "url": "https://www.reddit.com/r/truegaming/comments/9eqki2/spiderman_gleefully_beating_up_drug_dealers_feels/",
        "text": "In 2018 with drug decriminalization become more and more common, it feels wrong for Spider-man to savagely beat drug dealers. He even cracks jokes while he's doing it. Spider-man and other super heroes aren't so much about stopping all crimes, but more about saving people. \n\nStopping kidnappings, getaway drivers recklessly speeding and shooting their way through the city, ten guys about to break into an apartment, and jewelry store robberies are Spider-man actively saving people or their property. But busting up a group of guys in a alley with an open trunk? Who are they hurting?\n\nWe are never told what kind of drugs they are dealing, and drugs do have a societal consequence, and these dealers are typically well-armed, but this really just doesn't feel like Spider-man's job. ",
        "created_utc": 1536609872,
        "upvote_ratio": ""
    },
    {
        "title": "I would have really liked to hear totalbiscuits take on Graveyard Keeper.",
        "author": "obievil",
        "url": "https://www.reddit.com/r/truegaming/comments/9epz3r/i_would_have_really_liked_to_hear_totalbiscuits/",
        "text": "[removed]",
        "created_utc": 1536605794,
        "upvote_ratio": ""
    },
    {
        "title": "S&amp;M Floaty Gaming: What's the appeal?",
        "author": "PanserKunst",
        "url": "https://www.reddit.com/r/truegaming/comments/9ep7zd/sm_floaty_gaming_whats_the_appeal/",
        "text": "Dark Souls, Lords of the fallen... Bloodborne. Aside from themes why do players of this kind of genre like to suffer?  Yes I hear, \"Git Gud\", and I can see the value in it. However, I have tried all 3 of the above listed, and summarily removed them from my PS4 within days of acquisition. To me the reason isn't because it's too hard. It's more because I find the controls and response way too floaty and ambiguous to be anywhere near enjoyable. Helldivers is a very unrelenting and sadistic game, but I love the game because it has a WYSIWYG  direct mechanical process. when I press a button I see a clear and direct instant response. Is there a mindset out there somewhere that enjoys \"Time Response Gambling\"? Perhaps I just enjoy unmistakable instant feedback and arcady action. Could someone please point out why drawn out action / response time is attractive?\n\n&amp;#x200B;\n\nEDIT: Thank you for the comments, Apologies for the \"suffering\" statement. (My own personal involvement (Projection) with mentioned experiences above.) ",
        "created_utc": 1536600653,
        "upvote_ratio": ""
    },
    {
        "title": "Limited Time Events / Modes in Games",
        "author": "mark6IKX",
        "url": "https://www.reddit.com/r/truegaming/comments/9enotl/limited_time_events_modes_in_games/",
        "text": "[removed]",
        "created_utc": 1536590158,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any way to pressure developers to release or rerelease classic games?",
        "author": "Phoequinox",
        "url": "https://www.reddit.com/r/truegaming/comments/9ejlcf/is_there_any_way_to_pressure_developers_to/",
        "text": "I've been emulating for years, because I missed a lot of games growing up and didn't have money to buy 10+ year-old consoles and all the games that made them great. But now as a working adult, I have a lot more money to throw at games, and with the current fascination with rereleasing classic games on virtual stores, I'd love to have the option to buy classic games again. I recently decided to play through old franchises that I never got a chance to really play. Starting with Dragon Quest/Warrior. I scoured everything I could to find a legal copy to download of any of them. Turned up nothing. Best I could find was that there have been remakes, again, 10+ years ago, and nothing new beyond new entries in the franchise (which I will actually buy). Furthermore, a few of the best installments of the series were never released stateside. And now I'm discovering that most of my favorite emulation sites are being aggressively taken down. And I understand why. I'm not a kid anymore who thinks game companies are wrong for inhibiting illegal sharing of their games. I understand the impact it has. \n\nHowever, these companies need to give back. Piracy for me existed not because I didn't want to spend the money but because I had no money to spend. Now I am willing to buy everything legally, and I'm being limited in what I can buy. I get that Nintendo and Square Enix and Namco and Capcom want me to buy their new, expensive games and give them money to make new, expensive games. But I grew up with these companies. Many of us did. SNES is my favorite console for games, followed by PlayStation. The fact that we don't have Dragon Quest, Fire Emblem, Mother, Tales of, Suikoden and Breath Of Fire, etc. collections hitting stores is just absurd. These series started in a very early period, where the games were only a few MBs each. It would take nothing to put them all into a compilation and sell them for new game price. But in letting these classics stagnate, they are effectively giving piracy a justified cause. Maybe they only worry about their newer games being downloaded, and don't care about their old games. But the gamers who rely on those sites to play these games in the only legitimate way possible do care.\n\nSo are there any effective ways to put the pressure on companies who are sitting on these titles, and forbidding anyone from doing anything with them? Is there any campaigning or petitioning that could make this happen? Because I would happily pay for a collection of quality games if I had the option and I'm certain many others feel the same.",
        "created_utc": 1536553154,
        "upvote_ratio": ""
    },
    {
        "title": "Lets chat about skill trees: What's your ideal?",
        "author": "seeyouarearewhy",
        "url": "https://www.reddit.com/r/truegaming/comments/9eitip/lets_chat_about_skill_trees_whats_your_ideal/",
        "text": "Hi /r/truegaming! \n\nI'm a person relatively new to gaming in general. I've found that the games I've enjoyed the most employed a skill-tree \"choose the way you want to play\" approach to things. I've gone through a couple of hallmarks, including [Borderlands](https://www.youtube.com/watch?v=rvi-4qSEyRs), [Borderlands 2](https://static.giantbomb.com/uploads/original/0/7293/2313650-borderlands_2.png), [Divinity Original Sin EE](https://www.withoutthesarcasm.com/wp-content/uploads/divinity-original-sin-abilities.jpg), and [TES: Skyrim](http://en.uesp.net/wiki/File:SR-menu-Skills_Menu.jpg), among others. I've enjoyed trying to squeeze out every last bit of damage from my SMG siren build in borderlands, trying to oneshot enemies with my DOS1: EE rogue, and so on. \n\n\nBecause I've only played incredibly popular games (I'm pretty sure all of these games I listed are critically acclaimed) I don't think I've ever seen an example of a bad skill tree, so I wanted to talk about it and get insights of the gaming community, and maybe just get a couple of recommendations along the way. I recognize what I'm asking is gaming progression in general, which is a huge ask in of itself, so feel free to interpret the questions in whichever way you want. \n\nQuestions: What makes a skill tree good? Bad? What are some of the most memorable? Is allowing a player to spec into every specialty bad game design? What about only one \"route\"? Should games allow players to reset skill trees mid-game? \n\nThanks for reading! \n\nEdit: Thanks for all the responses! I'm learning so much, namely that the examples I gave haven't been examples of \"good\" skill trees. Here's an additional question then: Should skill trees be complex simply for the sake of complexity? I feel like games that do that are compensating by trying to have another level of \"depth\". ",
        "created_utc": 1536546325,
        "upvote_ratio": ""
    },
    {
        "title": "Hard mode on games",
        "author": "Subject_Null",
        "url": "https://www.reddit.com/r/truegaming/comments/9eibi6/hard_mode_on_games/",
        "text": "I feel like beating a game on hard or any difficulty harder is not rewarding. You get an achievement/trophy and the feeling of accomplishment, but It would be cool I'f we got extra content for beating a game on hard. Not dlc worthy but something?",
        "created_utc": 1536542116,
        "upvote_ratio": ""
    },
    {
        "title": "Does Shadow of War's combat system get better?",
        "author": "Silver-Monk_Shu",
        "url": "https://www.reddit.com/r/truegaming/comments/9ei0pt/does_shadow_of_wars_combat_system_get_better/",
        "text": "[removed]",
        "created_utc": 1536539481,
        "upvote_ratio": ""
    },
    {
        "title": "Where should the line be drawn for chat moderation in games and their social spaces?",
        "author": "Wunkerful",
        "url": "https://www.reddit.com/r/truegaming/comments/9ehk9s/where_should_the_line_be_drawn_for_chat/",
        "text": "This has hit a point of prominence in my mind due to my involvement in the Halo and Battlefield communities. I like watching streams, going to relevant Discord servers, and playing them solo using in game chat. The internet and games up until these last few years have always been treated like publicly accessible private spaces. This means that people were allowed to use coarse language and speak of inappropriate topics when in these places and not get kicked out or silenced. Much of it comes down to stuff like on Reddit with user moderation where people who cross the fuzzy lines too far get downvoted, or in games they get vote kicked. Side options include muting and blocking.\n\nSomething happening specifically in regards to the two games I mentioned is that the companies running them have decided to be proactive and no longer allow self moderation/reporting (many games have reporting features that I don't have too much problems with, they have more leniency than automod). Rather than letting their players call the shots on what they want the community to be they have laid down their laws on words or topics that are 100% off limits. So that when you type one of those no go words the message is instantly deleted and if you do this too many times, even though no one ever sees the messages, you can get timed out or banned. The time outs and banning are done by bots on many of the forum and stream spaces I have gone to for both games (even the official Xbox twitch stream I think). Battlefield V has even introduced asterisk censorship non optionally into in game chat.\n\nThe reasoning behind this I imagine is that the companies consider these spaces public and thereby people should be expected to be prim and proper as they would be in a room full of strangers. And the effect is likely to be a further reduction in the communal spirit of these games that has already been on the downturn for years now. The obvious solution many would suggest is make your own private space where you and your friends are free to say whatever trash you like. The main counterpoint being not everyone has friends and it can be just as fun to get chummy with random people. The most entertaining part of in game chats is always the banter that gets thrown out, and its also the core target of companies in terms of reducing toxicity.\n\nHaving been hit by these hammers out of the blue I can say without a doubt it feels like a gag being placed in my mouth. My reaction has never been, \"Oh no I really did cross a line, I shouldn't have tried to type Nazi in a WW2 game.\" Their goal with zero tolerance is to force a rapid behavioral change within their communities. But the thing is this doesn't make me want to stop being memey or edgy or sometimes mad. It's like shoving a cork into a protesters mouth. It's going to create resentment between the player base and the company.\n\nMy biggest point here is that I'm very ok with the usual self moderation tools that we have all had for years now. Mute, block, report, downvote. I'm against blanket automod instant censoring, timeouts, and bans because it does not allow for the nuances of the often nonPC internet chatter (I guess this opens the floor for arguments over if unclassy poor taste memes are worthy of protection or not (I'd say yes because people can opt out with optional filters, mute and block)).\n\nOr here is a thought, like League of Legends make the filters opt out. Just add options to enable Adult^TM chat. I have a brain, I don't need a company to do all the work for me. I kinda enjoy the wild west.\n\nA minor conspiracy theory of sorts or just plain business think is that this \"toxic environment\" (I need to put this in quotes because my argument is that self mod tools are enough as is.) prevents growth of sales into less invested demographics. So the companies are forcibly burning room in the weeds/forest for the newbies to move in.",
        "created_utc": 1536535615,
        "upvote_ratio": ""
    },
    {
        "title": "Why is there no Coop/Pvp focused Justice League or Avengers game?",
        "author": "sgtlobster06",
        "url": "https://www.reddit.com/r/truegaming/comments/9eh39e/why_is_there_no_cooppvp_focused_justice_league_or/",
        "text": "It seems like a really missed opportunity for us to not have an open world Justice League or Avengers game. It could play similar to the Arkham Games or the new Spider-Man game but include most of the characters for the Marvel/DC universe. Let players play as whatever hero they want and include most of the major locations in the game. \n\nIt just seems like an instant win if done right and a goldmine of DLC for the developers, if they just keep adding new stories to the game it would be easy to justify DLC sales.\n\nDoes anyone else have any thoughts on this?",
        "created_utc": 1536531694,
        "upvote_ratio": ""
    },
    {
        "title": "Why is grinding in games so popular?",
        "author": "Retro21",
        "url": "https://www.reddit.com/r/truegaming/comments/9egvdp/why_is_grinding_in_games_so_popular/",
        "text": "I'm thinking of GTA: Online, WoW, but even in FPS games where you can prestige or chase points for in game rewards etc.? \n\nWhat about when there is no real huge reward at the end - you're not unlocking a gun, or a new character, or something that will vastly change the way you experience the game, but it's an attritional grind for an increase in a commodity like the games version of money. \n\nI got to a point maybe five years ago where I saw someone say they were spending hours a day working to be the best X miner and seller in a game (I think it was the old Star Wars online game). And one day he thought, I could actually be honing a skill that is useful/can make me money in real life, what am I doing? \n\nAfter that story something kind of clicked on my head and I try to experience new games, rather than play one over and over to grind. Part of me enjoys just unengaging with life and grinding, much like my parents' generation would have done with soaps or other nonsense on TV, but part of me actively gets annoyed at myself when I find myself grinding now. \n\nWhat games do you grind in? Do you enjoy it? Or are you someone who turns off when they find themselves grinding? ",
        "created_utc": 1536529960,
        "upvote_ratio": ""
    },
    {
        "title": "Mixed Messages: A Team Ico Retrospective",
        "author": "TrippEvans",
        "url": "https://www.reddit.com/r/truegaming/comments/9egg03/mixed_messages_a_team_ico_retrospective/",
        "text": "[A short video I've just uploaded discussing the minimalistic gameplay of Ico and Shadow of the Colossus, and how that gameplay is bolstered by incredible use of camera, music, and downtime. ](https://youtu.be/xc8jU5PT_ks)\n\nI've included a timestamp in the description if you'd like to skip straight to Shadow of the Colossus.\n\nAs far as starting a discussion goes, there are a few basic points of this video worth speaking on. \n\nThe use of Yorda, the companion in Ico, to supplement player vulnerability with a protective role, seeing as the player can't be killed by shadow children.\n\nHow Shadow of the Colossus manipulates the thoughts going through your head in two main ways. During exploration, sweeping camera angles and epic vistas put heroic images on display, however, during that exploration is when you'll have your only chances to consider the immorality of your quest. Hence the name, Mixed Messages. And during combat by use of camera angles and music to stir up a flurry of messages that contradict the message of the gameplay, in order to put the confliction Wander must feel into the players head as well.\n\nWhat are some other games that make interesting and unique use of AI companions, or mixed messages about the morality of your quest?\n\nIf this counts as self promotion, feel free to remove it",
        "created_utc": 1536526733,
        "upvote_ratio": ""
    },
    {
        "title": "How Detroit: Become Human creates a \"branching\" narrative (x-post to r/DetroitBecomeHuman)",
        "author": "throwawaydeviant9",
        "url": "https://www.reddit.com/r/truegaming/comments/9efupm/how_detroit_become_human_creates_a_branching/",
        "text": "*In this post, my goal is to discuss the different methods that Detroit: Become Human uses to create a \"branching\" narrative, talk about the pros and cons of these methods, and occasionally compare them to other games in the genre. I have personally played Indigo Prophecy, Heavy Rain, Life is Strange, Until Dawn, and Batman: The Telltale Series, but am not as familiar with these as D:BH. I've achieved 100% completion in the flowcharts for D:BH, so I feel very knowledgeable about the mechanics of individual scenes and the outcomes of most of this game's choices compared to the others. Basically, I'm hoping to create a discussion on how well games in this genre take player choice into account, comparing different studios' design philosophies, what you like about certain games in this respect, what you wish could be altered, and what you hope to see in the future. Be warned that I'm going to significantly spoil Detroit: Become Human here, though I'll try to tag spoilers for other games. A few weeks ago, I posted all the completed flowcharts on the D:BH subreddit [here](https://www.reddit.com/r/DetroitBecomeHuman/comments/99b65j/all_100_flowcharts_with_global_stats_included/), so if you haven't played the game and don't care about spoilers, you can refer to every scene I talk about.*\n\nIt seems to be a general consensus that among the different games in the interactive movie genre (AKA cinematic \"choose-your-own-adventure\" games), Detroit: Become Human represents the \"gold standard\" so far in taking player choice into account and creating meaningfully different narratives in different playthroughs (as well as Heavy Rain and Until Dawn, to a lesser extent). Meanwhile, Telltale Games has been gaining increasing criticism for \"railroaded\" and \"meaningless\" choices, though this perception might change after the company's restructuring and new engine. While Telltale games may not offer a branching experience (again, I've only played Batman Season 1, so feel free to argue this point in the comments), it's interesting to note that there aren't that many branching scenarios in D:BH either, though at this point, we'll have to define what exactly \"branching\" means in this context.\n\nWhen most people think of a \"branching\" narrative, they'll imagine making decisions that lead to distinct scenarios, which may lead to further branches, and so on until reaching an ending (ideally, one of many), exactly like the shape of a tree. While this is true for D:BH's final chapters, to the extent that each character has two different flowcharts by the end, the first 90% of the game doesn't take this approach. The player is taken through each chapter one at a time, with little opportunities to significantly change the narrative of later chapters. The chapters can't be played in a different order, and the only way to skip chapters entirely are by killing off the main characters and ending their stories (and also failing to find Carlos's android, which skips The Interrogation). This means that on subsequent playthroughs, players will immediately know the \"premise\" of each scene and generally what to expect. One exception is Fugitives -&gt; On the Run, which has 3 branches depending on where Kara chooses to spend the night, but even these quickly converge to the same paths. On the surface, it may seem that as long as you keep the main characters alive, nothing you do matters until you reach Crossroads. Despite this, most players feel that the game is still engaging enough for two, three, or even more playthroughs (though some chapters are certainly more replayable than others). Having endlessly played through the game forwards and backwards myself, I've found that D:BH uses a variety of ways to present choices to the player, and a variety of ways to demonstrate the effects of those same choices. It should be noted that many chapters use a mix of these methods.\n\n#One Explicit Choice    \n*Examples: Shooting or sparing Chloe in Meet Kamski, pushing Leo or enduring in Broken, leading a revolution or demonstration in the final chapter*    \nThis is the most straightforward example of presenting a branch to the player. It is very flexible, easy for the developer to implement, and the easiest for players to understand. When it's not timed, this can work well for moral decisions, as it allows the player to weigh the situation. These scenarios can vary in how much the choice affects the narrative. The three examples I gave are consequential in different ways, which I'll touch upon later on. This can be badly used, however - it can make playthroughs seem too binary or make the player feel that all of their previous choices were thrown away in favor of having to make this one decision. For example, you can be peaceful throughout the game as Markus, and then suddenly decide to lead an armed revolution in the final chapter. I think this works best when it's combined with other methods on this list.\n\n#Action/Timed/Reflex Events    \n*Examples: chasing Rupert in The Nest, Zlatko, On the Run, finding the Tracis in Eden Club, every single fight scene*    \nIn Telltale games, failing QTEs causes a game over and a restart. In Life is Strange, reaching a failure state forces you to rewind time until you make a \"correct\" choice. However, Until Dawn and David \"Game overs are a failure of the designer\" Cage's games take a different approach. In many situations, failing QTEs will cause the story to move forward with serious repercussions, up to and including the main characters' deaths. This can cause the tension to ramp up to levels you'd never experience in other games in this genre. This has several drawbacks, however. It works well for D:BH, Heavy Rain, and Until Dawn because you play as multiple characters in those games, and thus the game can \"afford\" to lose characters. For games with single protagonists, as in Beyond: Two Souls, the player will get wise to the fact that they're not *really* in danger, because no one's going to make a game that can prematurely end 20% of the way in (this could be an interesting experiment, though... discuss!). Having protagonists die can also cause players to feel cheated out of content or closure to a story, especially if a sequence was unintentionally hard or confusing. These are less of a problem if the consequence is less severe (for example, failing to find the Tracis in time will just end the chapter early, or maybe if failing a set of QTEs causes someone *else* to die instead). These kinds of sequences will also make a game less accessible to certain players (I trust that my grandmother can press buttons to make decisions, but there's no way she'd succeed in any fight scene).\n\n#One Problem, Many Solutions, Few Outcomes    \n*Examples: Stormy Night, stealing the key in Spare Parts, the evidence room in Last Chance, Connor, fleeing from the soldiers as Kara in the last part of Crossroads*    \nThe idea here is that instead of branching a scene by presenting an explicit choice, you create high amounts of branching *within* a particular scene, which will then converge to a set amount of outcomes. [Stormy Night](https://imgur.com/a/vd1Qlrt) is the perfect example. The player's goal is to protect Alice from Todd, and while there are only three meaningfully different outcomes (Kara and Alice escaped while Todd lived, they escaped but Todd died, or Kara and Alice died), the player is offered many different solutions, some of which may converge (usually into a fight scene) or lead to others (for example, getting kicked out of Alice's room by Todd gives you another chance to take the gun). I feel something like this is a great way to add replayability to a scene even if the outcomes are limited, though in this particular example, I don't like the fact that taking the gun instantly locks you into either \"Kara shoots Todd\" or \"Alice shoots Todd\". Another example is when Connor uses evidence obtained throughout the game and has several options to find Jericho, which leads to my [favorite-looking flowchart in the entire game](https://imgur.com/a/fqCTsea).\n\n#One Path with Many Fail States    \n*Examples: Eden Club, Zlatko, Midnight Train, Last Chance Connor, most of Crossroads, Kara at the recycling center in the final chapter*    \nRather self-explanatory. It's somewhat of an expanded version of the action/timed events mentioned earlier, in that the game tries to create tension by forcing the player to roll with bad consequences. In the recycling center, for example, there are two ways to get a good ending for Kara and a million ways to get a bad ending. This method suffers from the same drawbacks concerning too severe consequences and potentially difficult and confusing scenarios, but this is still a good way to raise the stakes of a scene. In some cases, it can limit replayability; if the player knows the correct path forward, why would they choose otherwise if it leads to a bad outcome (besides curiosity)?\n\n#The Mini-Open World    \n*Examples: Fugitives, Capitol Park, every investigation scene*    \nThis is one of the more intriguing concepts that I would certainly love to see explored in future games in this genre. Here, the player is put into a confined space, and must explore and interact with their environment in order to solve the problem at hand. This essentially feels like a point-and-click adventure in concept. Fugitives is the most obvious example - you have 3 choices of where to stay, and must explore the environment to find a way to access these options (you have to find money and clothes to stay in the motel or obtain a pair of wire cutters to get inside the squat). Meanwhile, in Capitol Park, Markus has only one solution to accomplish his mission (steal a truck and ram it into the store), but is penalized for not exploring the environment carefully enough (he can get spotted by a drone or cause the police to arrive, which may force him to abandon the mission). I think this is a good option for presenting a problem and potential solution in a more dynamic way compared to others, and I would have certainly loved it if there were more chapters like Fugitives in the game. Outside of the genre, this is one of the main ways that immersive sims like Deus Ex, Dishonored, and Prey allow for player choice.\n\n#The Set-Up and Punchline    \n*Examples: Todd surviving, Carl's fate, meeting Ralph, Cole's photo, John from Spare Parts, saving the wounded cop in The Hostage*    \nHere, the outcomes of the choices you make aren't immediately apparent. This is basically the equivalent of \"X will remember that\" from Telltale games. For example, pushing Leo or letting him fight you in Broken only affects the plot until the second-to-last chapter, where Markus either sees Carl at his house or visits his grave. It doesn't have to affect the main plot - the wounded cop living to see Public Enemy doesn't change the gameplay or story at all. However, it creates a small, narrative arc that can set individual playthroughs apart from each other. Meanwhile, Until Dawn used this method to create a sense of paranoia in the player - due to the butterfly effect, you have often no idea if the actions you take will backfire later on. This can be done badly, though - there's no indication that not seeing the photo in Hank's house locks you out of getting the best ending for Connor, and players who reach that point and get shot by Hank will have no idea what they did wrong.\n\n#The Second Chance    \n*Examples: Kara fleeing in On the Run, Kara being reset by Zlatko, Markus sacrificing himself at the Freedom March, Connor sparing the Chloe in Meet Kamski*    \nIn these situations, a \"bad\" choice or event won't immediately lead to a negative consequence - instead, the game gives the player an opportunity to correct their mistake. For example, being reset by Zlatko's machine won't end Kara's story, but the player is then given a (very generous) time limit to explore the mansion and restore her memories. In another example, Markus can choose to sacrifice himself at the Freedom March. As it turns out, his death here has *very* negative consequences, so if the player chooses this option, the game will have John or Simon sacrifice themselves in his place. If both of those characters are unavailable due to previous choices, then Markus will die (and at this point, it was pretty much your fault anyway). In my opinion, this is a neat way to create alternative narratives between different players; good players feel properly rewarded for making good choices, while other players won't necessarily have to suffer through severe consequences (and are rewarded with extra gameplay in some cases). Done badly, it can make players feel like the game is cheating in their favor. My favorite example of this method isn't actually in D:BH, but in Heavy Rain - [spoilers](#s \"Ethan doesn't need to finish all trials to succeed; he can still fail one or two, but is then given a chance to try to work out the correct address (you can still fail at this point). Instead of the player thinking 'I'll do all of the trials no matter what because that's the only way to find Shaun,' the player is motivated to do the best they can under the circumstances. Choosing whether or not to kill the drug dealer now has an element of 'I could kill him, but it might be possible to find Shaun without having to do so.' At least in theory - I wish the game made it more clear from the beginning that failing Ethan's trials is an option.\")\n\n#The Culmination of Previous Choices    \n*Examples: The evidence room, software instability and the relationship system*    \nThis is one of the main ways that D:BH makes your choices matter throughout the game, even if just a little bit. Many of your actions, from rescuing Hank on the rooftop to saving the fish in the first chapter, will affect your relationship with other characters and affect Connor's software instability. Depending on how you act as Connor, Hank can be good friends with him, refuse to help him with the investigation, or quit the force and later commit suicide. This method is a great way to essentially \"track\" the player's minor choices throughout the game, and have each small decision make an impact without having to create separate branches. I'm sure that out of the millions of people who've played D:BH, saving the fish meant the difference between a deviant and machine Connor to at least one person. The drawback is that it can turn interactions into pure numbers, and cause players to not act as they normally would with other characters, but to do what they can to keep their relationships at arbitrary values (\"friendly\", \"hostile\"). Another way D:BH uses this method is, once again, shown through the evidence room in Last Chance, Connor (I really just love this scene in terms of gameplay). Throughout the game, Connor has multiple chances to gather evidence to locate Jericho, though the player isn't even aware that they're doing so. Depending on the playthrough, the player will have gathered different sets of evidence that can be used to find the location in different ways. If the player doesn't locate Jericho, either by running out of time or through a lack of evidence, then Connor's story will permanently end at this point. As one last bonus, this scene can be skipped entirely if Connor shoots Chloe and asks Kamski the location, which is another example of the Second Chance method above. Overall, Connor's entire story up to this point is made up of more or less separated plotlines that culminate in this one chapter. David Cage really seems to love this particular trope - you can find similar scenes in both Indigo Prophecy and Heavy Rain. \n\n&amp;nbsp;\n\nAs you can see, Detroit: Become Human uses a variety of ways to make your choices matter, even if they don't lead to entire separate branches. Of course, I have no idea the process that David Cage and/or the rest of Quantic Dream uses to write and design these types of narratives, but it seems you can categorize some of these methods as above. I would love to hear what you guys think about these methods and how they compare to other games in the genre. Are you satisfied with how player choice is taken into account? What do you think these games do well and what do you wish they'd do differently? And in general, what do you hope to see from this genre in the future?\n",
        "created_utc": 1536522348,
        "upvote_ratio": ""
    },
    {
        "title": "ITT: let's make fun of things that urk you in Pokemon games or fanbase",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9ee7dk/itt_lets_make_fun_of_things_that_urk_you_in/",
        "text": "[deleted]",
        "created_utc": 1536510040,
        "upvote_ratio": ""
    },
    {
        "title": "[Discussion] Is it time to say goodbye to the dual analog stick controller configuration?",
        "author": "suspendedload",
        "url": "https://www.reddit.com/r/truegaming/comments/9ec4s7/discussion_is_it_time_to_say_goodbye_to_the_dual/",
        "text": "TL;DR: this thread tries to get the conversation going on stepping away from the classical dual analog stick configuration, seen in nearly all popular controllers, by taking a closer look at the analog stick and possible alternatives. Would you? And if so, how?\n\nEDIT: to clarify, all I'm trying to do here explore  alternatives and/or improvements to the classic analog stick by pointing out some flaws. Would a dual stick configuration for the next gen controllers be the end of the world? Heck no, it is familiar, versatile and still feels great.\n\nEDIT2: the most commonly mentioned/ popular arguments with regard to the discussion topic are:\n\n* On the gamepad/ controller in general: **a gamepad has to be general purpose, i.e. good (enough) for** ***all*** **game genres**\n* On people's opinion on analog sticks: **The duo-stick configuration is comfortable, easy to use, intuitive and familiar. Having at least one analog stick is preferable for many game genres.**\n* On motion (assisted) aiming: **those who tried it (recently) are generally very positive about it. Some have had bad experiences with it and are therefore hesitant towards it. The initial learning curve seems daunting to some. Some quotes:**\n   * \" Same with motion aiming, it's been done on the Wii already and was gimmicky at best and sub-optimal at worst.\"\n   * \"We tried motion controls and frankly they were more gimmick than useful.\"\n   * \"I absolutely hate using the motion controls in Splatoon.\"\n   * VERSUS\n   * \"That \\[Splatoon on Wii U\\] uses the traditional dual analog stick controls for a shooter with the adition of motion controls for aiming micro adjustments. Best  console shooter controls I've ever used.\"\n   * \"Playing Splatoon 2 on the Switch now, this hybrid stick/motion control is still the best compromise for being able to aim in an FPS on a console for me.\"\n   * \"I know people who turned off motion because they didn't want to get used to it but I definitely enjoyed it being on better. Sometimes you gotta  try new stuff.\"\n* On trackpads: **people either love it or hate it, it seems. Less intuitive, but more versatile than sticks.**\n* On Steam controllers: **especially this controller was commonly discussed. This also shows polarizing views. To quote some people:**\n   * \"The steam controller is unequivocally superior in both functionality and ergonomics.\",\n   * \"Even though most who try it \\[Steam controller\\] agree that it's the best controller\"\n   * \"I got myself a steam controller because I hated traditional controllers.  As I expected, it ended up being vastly superior to them in most genres of games.\"\n   * \"I've used a Ps3 controller(3 years) and now steam controller(2+ years)  and I can even play flight sims, and any game with inverted aim perfectly fine.\"\n   * VERSUS\n   * \"Yeah, I have a Steam controller and used it about 2 times.  I hate it.\"\n   * \"I have a Steam Controller and it is pretty much a pain to use for any  game with normal controller support. It requires far more time to set it  up and even then it is often a pain to control\"\n   * \"As for the trackpad suggestion, I've tried the Steam controller and that sucks balls.\"\n   * \" I've gotta say, it \\[Steam controller\\] feels like a lot more work on your thumb after a while. \\[...\\]  To me, dual stick simply feels a lot more comfortable.\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Preface\n\nToday, I'd like to talk about the controller, also referred to as a gamepad. In particular, the analog thumbstick. Each part has a sort of summary in bold text. For full disclosure... I've been playing shooters with a controller for well over a decade, always in a 'pure' dual analog stick configuration. Moreover, this post might contain some mistakes, as I'm not an expert on the subject. First, let me answer the question proposed in the title \"Is it time to say goodbye to the dual analog stick controller configuration?\". I'd argue: *yes.*\n\n&amp;#x200B;\n\n# Background\n\nThe most common configuration of the controller uses dual analog sticks, which actually is the default controller configuration for all major console platforms. An analog stick uses two potentiometers to determine the offset w.r.t. the center/ resting position of the stick (i.e. the position of the stick). It is the successor of the D(irectional)-pad and was first introduced by Nintendo in 1988 (NES MAX controller). The D-pad only offers 4-directional digital input (on/off), or 8-directional by combining inputs. The rise of the analog stick is likely related to games transitioning to 3D, where 4- or 8-directional movement can limit player control. It is superior to the D-pad and WASD input for *movement* in 3D games because it allows for more freedom in direction and enables a range of input values (i.e. analog); hence why controllers are preferred for racing games for example. However, *aiming* with an analog stick is a different story. The best example is shooting games. These games require precise aiming and are therefore best played with an input device that enables a wide range of motion (i.e. a mouse), for a good balance between micro adjustments and quickly turning around. Preferably, this input device relates input and ouput linearly, without any additional non-uniform acceleration.\n\nThe important observation is that: **an analog stick is great for** ***movement*** **in 3D games, but not so great for** ***aiming.***\n\n&amp;#x200B;\n\n# Aiming with an analog stick\n\nThe range of motion of an analog stick is determined by the maximum deflection/ tilt angle (\\~45^(o)) and the stick length, as can be seen in [Figure 1](https://imgur.com/uXoaj5K). This is precisely the reason why many console shooter enthousiasts use stick extenders. Moreover, game developers often deliberately limit the effective input range of sticks by ignoring the inner and outer-most input values with so-called dead zones ([Figure 2](https://imgur.com/H4tgMie)). This is done to counter in-game movement even when the stick is in resting position caused by wear ('drift') and to filter out unreliable measurements at the outer edge. To partly overcome these limitations, developers use clever signal processing techniques and often provide some sort of aim assist in the game. Terms often used in the context of signal processing are: aiming response curves ([Figure 3](https://imgur.com/iC4SYen)), aim smoothing ([Figure 4](https://imgur.com/y8Ow7O6)) \\[sometimes called aim acceleration (wrongly in my opinion)\\] and dead zones. For the aim assist model often used terms are: aim assist window size, aim assist strength, magnetism, centering, friction, etc. I won't discuss aim assist here.\n\nDead zones were already mentioned, but are vital in the story on aiming curves. The aim curve governs the relation between the stick input and the in-game output. In most games some (hand-drawn) positive exponential curve is used. These have a shallow slope at small input values (i.e. micro adjustments) and a steep slope at much larger input values (i.e. turn fast). Other notable curves are the linear curve and the dual-linear curves ('dual zone'). Ideally, the aiming curve should completely reside in the effective stick motion range between the applied dead zones; 'rescaled' if you will. However, sometimes a simple 'cut-off' seems to be used instead. All in all, a lot of clever tricks are needed to make stick aiming somewhat reliable. Furthermore, no two games seem to take the same approach to the aforementioned, which only adds to the problem in my opinion (e.g. axial vs radial dead zones, different aim response curves, etc.). Allowing for customization of aiming curves, dead zones and so forth is still far from an industry standard as well.\n\nThe take-away message of this section is: **even with all the aim enhancing and assisting techniques, a mouse still vastly outperforms an analog stick for aiming in games. Analog sticks are simply not capable of offering reliable micro- and macro adjustments at the same time. It's one or the other. Inconsitencies in aim enhancing and assisting techniques across games doesn't help either.**\n\n# \n\n# Implemented and possible improvements\n\nFirst, let's summarize what is 'bad' about pure analog stick aiming:\n\n* Linear relation between input and output not feasible\n* Very limited range of motion and requires significant signal smoothing\n* Dead zones are required to counter drift and unreliable measurements\n* Aim enhancing and assisting techniques not consistent across games\n\nSecondly, let's look at the most noticable developements for controllers in recent memory. Here, the scope is limited to officially licensed controllers introduced after late 2013, i.e. the DualShock 4 and the Xbox One (wireless) controller and up:\n\n* hair triggers,\n* back paddles/ buttons,\n* trigger stops,\n* interchangeable sticks (concave/ convex and length) and (individual/ tilting) D-pad (e.g. Xbox Elite controller),\n* mechanical face buttons (Razer Raiju),\n* motion tracking controls with a three-axis gyroscope and three-axis accelerometer (e.g. DS4, Switch Pro controller),\n   * gyroscope: measures angular velocity, i.e. rotation around an axis\n   * accelerometer: measures acceleration, i.e. movement along an axis\n* additional motion tracking sensors, such as magnetometers (e.g. PS Move), and\n   * magnetometers: orientation w.r.t. (Earth's) magnetic field, i.e. basically a compass\n* a trackpad (DS4) with haptic feedback (Steam controller).\n\nThe last three bullet points about motion tracking controls and trackpad aiming, are the only ones that actually changed the way aiming works/ can work with a controller. Note that gyroscopic motion *assisted* aiming has recently seen a rise in popularity, mainly due to Switch games such as Splatoon and Breath of the Wild, and that the Steam controller uses an entirely different input method for aiming by using a trackpad with haptic feedback (+ can be gyro assisted).\n\nLastly, how can the aiming experience with a controller be improved (in no particular order)? Both software and hardware solutions are considered:\n\n1. A different (physical) input method, e.g. trackpad\n2. Motion aiming or motion assisted aiming\n3. Controller settings managed outside of games, i.e. same across games\n4. A dedicated (digital) 'DPI switch', i.e. low or high sensitivity\n5. An analog input method for aiming curve multiplier, i.e. higher multiplier == steeper aim response curve\n6. Step away from the classical controller design, e.g. with a two-part controller similar to VR controllers or M+KB?\n\n​The take-away message of this section is: **improving aiming with a controller has seen limited (industry standard) advancements over the years, with the most noticeable attempts being** **gyro assisted analog stick aiming and using a trackpad rather than an analog stick. The former strives to improve the precision in micro adjustments, often fairly unreliable with stick aiming, whereas the latter takes a different approach to the problem all together.**\n\n*Note: there is a couple of ways for you to test out motion (assisted) aiming for free, if you own a controller equipped with the proper sensors. I'll list two: 1) Play a free game (e.g. Aimtastic) on Steam with a Steam controller or DualShock 4; 2) On a Playstation, open the virtual keyboard and hit R3 to enable motion aiming.*\n\n&amp;#x200B;\n\n# Conclusion\n\nThe traditional analog stick is good enough to handle movement in 3D games, but severely lacks in the precision needed for aim intensive games, such as shooters. Despite many clever aim enhancing and assisting techniques, aiming with an analog stick is still far less precise than aiming with a mouse. Moreover, these techniques are often implemented differently between various games, which makes building muscle memory across multiple games very difficult (i.e. adding to the problem!).\n\n1. **Firstly**, I'd argue that it is key that the new generation of controllers enables proper use of motion controls, much like the Steam controller seems to do. To showcase the possibilities with motion aiming, see e.g. the VR game Farpoint with the Aim controller ([see here](https://www.youtube.com/watch?v=OGCF0m3bRMo)) and with the DualShock 4 ([see here](https://www.youtube.com/watch?v=fWiV_NIjh4Q); not as accurate/ worse sensors).\n2. **Secondly**, I would like to see at least the right analog stick being replaced with a trackpad (preferably both). A trackpad is much more versatile, and arguably more accurate and less susceptible to wear, than an analog stick. Just remember how many swiping and multi-touch 'gestures' the trackpad (or touchscreen) on your laptop (or smartphone) recognizes.\n3. **Thirdly**, whatever the nex-gen controller will look like and what kind of sensors it will include, controller settings have to be adjustable independent of games. For example, dead zones for an analog stick.\n\n^(\\[All figures:) [^(here)](https://imgur.com/a/MeEmitp)^(\\])",
        "created_utc": 1536490282,
        "upvote_ratio": ""
    },
    {
        "title": "Why bother justifying average story because it belongs to a trope?",
        "author": "thisismystuff1",
        "url": "https://www.reddit.com/r/truegaming/comments/9ebfe7/why_bother_justifying_average_story_because_it/",
        "text": "Why bother excusing one dimensional story writing because it's 'cyberpunk', 'high fantasy' or whatever stereotypical archetype that already exists?\n\nIs it for comfort for people who've dedicated themselves for the genre?\n\nI've seen this come up time and time again, regarding people using formulaic level, art and writing design in their media. There are websites based on these niches that have fans ready to praise games that reuse these trends, stifling creative thought and expression.\n\nWhen growing up having played games like Bioshock, or F.E.A.R. or Haze or such, I feel like I can accurately summarise our games as 'geeks' v 'nerds' - where geeks would reuse the same formulaic content style eg this years lead high fantasy RPG, and nerds would invent something more original, like Bioshock.\n\nI'm going to spoiler my example, which ticked people off\n\n&gt;!I base this off how people describe the story writing in Cyberpunk 2077. I'm positive there are people out there that are impassive about how it's written. I honestly liked it for the creativity on show, but I can see how it uses genre tropes not unlike a lot of fantasy games recently.!&lt;",
        "created_utc": 1536479871,
        "upvote_ratio": ""
    },
    {
        "title": "Why I don't like the Souls series and what that says about me as gamer",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/truegaming/comments/9ebacm/why_i_dont_like_the_souls_series_and_what_that/",
        "text": "[deleted]",
        "created_utc": 1536477814,
        "upvote_ratio": ""
    }
]