[
    {
        "title": "Is Karen Armstrong's \"A History of God\" a good book regarding the history of the Abrahamic religions?",
        "author": "apistos_kafir",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4rshj1/is_karen_armstrongs_a_history_of_god_a_good_book/",
        "text": "I've heard both sides:  that it is really good and really well sourced and accurately depicts the history of the Abrahamic religions as well as it not being good at all and that it is almost entirely composed of fabricated history and nonsense.\n\nShould I trust the book as being valid in what it says?  Why or why not?\n\nI don't care that it supports atheism.  I want to know if it is accurate, true.  If not, I'll avoid using it as a basis for some arguments because of its inaccuracy.",
        "created_utc": 1467946089,
        "upvote_ratio": ""
    },
    {
        "title": "How do you justify the position of materialism?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4rsf04/how_do_you_justify_the_position_of_materialism/",
        "text": "[removed]",
        "created_utc": 1467945140,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist, do you hate or look down on religion?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4rsast/atheist_do_you_hate_or_look_down_on_religion/",
        "text": "I have seen that there are a lot of atheist who seem to hate or look down on religion or something like that. I was just wondering, as an atheist do you personally hate religion or think it is bad or harmful or anything or do you just see it as any other belief system and are neutral towards it. For example, I don't believe in other religions, but I don't hate down on them or anything like that and see there is good and bad in anything that exist. What is your stance?",
        "created_utc": 1467943593,
        "upvote_ratio": ""
    },
    {
        "title": "Atheist, do you hate/look down on religion or any sort?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4rs8wx/atheist_do_you_hatelook_down_on_religion_or_any/",
        "text": "[removed]",
        "created_utc": 1467942840,
        "upvote_ratio": ""
    },
    {
        "title": "People here, do you hate religion?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4rs78b/people_here_do_you_hate_religion/",
        "text": "[removed]",
        "created_utc": 1467942216,
        "upvote_ratio": ""
    },
    {
        "title": "Hey lets sterilise all religious people so they can't breed. Who's with me?",
        "author": "horchard1999",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4rpsbc/hey_lets_sterilise_all_religious_people_so_they/",
        "text": "[removed]",
        "created_utc": 1467912455,
        "upvote_ratio": ""
    },
    {
        "title": "Believing in god = mind hack ?",
        "author": "honor_thy_symbionts",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4rhy3c/believing_in_god_mind_hack/",
        "text": "God is a father figure : he has authority, he loves, he gives order, rules. I could go on. Could beleiving in God fill a void to those whose dad wasn't filling those roles during their childhoood ? \n\nIs religion as a whole a sum of mind hacks ? a tool that man invented and developped to adapt to his  changing environment ?\n\nWhat do you think ?",
        "created_utc": 1467802611,
        "upvote_ratio": ""
    },
    {
        "title": "Was Jesus unique in claiming to be the author of life? Has there been other religious leaders who have claimed to be God in the flesh?",
        "author": "Detective-Truth",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4rei7w/was_jesus_unique_in_claiming_to_be_the_author_of/",
        "text": "[removed]",
        "created_utc": 1467747966,
        "upvote_ratio": ""
    },
    {
        "title": "My co-workers all know that I'm an atheist, and I'm not sure how to handle it.",
        "author": "FckinNonsense",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4rbbjo/my_coworkers_all_know_that_im_an_atheist_and_im/",
        "text": "Any advice is definitely appreciated.\n\nNow, I'm fully aware of the fact that I'm a bit OVER-cautious about keeping my secularism hidden in the workplace. I've had many atheists tell me that I shouldn't hide it, and shouldn't be ashamed. Well, I am not ashamed. I'm very happy with my lack of religion, and it's a huge part of the person I am. But my workplace is primarily older, very religious people. I had a similar problem at another job, and it didn't go very well when people found out. Seeing as I value my income, and don't want to walk into a place every day where people treat me poorly, I keep it on the hush hush. And up until last week, this was going fine.\n\nSee, the truth is, I've been very angry lately. Very antsy. I'm usually very *overly* respectful of religion (even in situations where I probably shouldn't be) because I put far too much value in having everyone like me. But starting with the Pulse shooting, which hit close to home, and perpetuated by several other major news stories, I've been very *angry* at religion recently. As a result, I've found it to be much harder to keep my mouth shut; something that I'm usually *very* good at.\n\nI was having a conversation with the gossip-queen of my office last Wednesday, and referenced that I had started listening to an audio book while walking around... The subject having been ways to keep your mind busy during a boring job. She, however, asked me what I was reading. For a split second, I considered lying. But my desire to not hide my view slipped out for a second, and I admitted that I was reading God Is Not Great by Christopher Hitchens. Her reaction bordered on aghast when I explained to her what the book was. I was already desperate to backpedal, but I had inevitably opened Pandora's box. By the end of the night, everyone who was working knew.\n\nThis leads up to one of the funniest, and equally frustrating situations I've ever been in. She walks into my office later that evening with an older male coworker, maybe 65 give or take. He proceeds to have her ask me if I worship the devil. I have to resist the urge to legitimately facepalm, but instead politely explain that since I don't believe in a god, that I therefore also don't believe in Satan. Then they proceed to... I don't know, \"logic\" me into admitting god exists? Probably one of the most bizarre conversations of my life. She asks me \"So where does life come from?\". I respond that we don't have an answer to that question at the present time, but that doesn't automatically mean that we never will. She then turns to the older male co-worker (I'll call him OMC). She says \"OMC, where does life come from?\" And he responds, \"It was created by the lord, of course.\" She then turns to me and does a little half shrug to me that basically says \"See, OMC has an answer... and you don't.\" I then have to try to explain to them that just because there isn't a full scientific explanation *yet*, does not automatically mean God. OMC then proceeds to begin to half-berate me with attempted gotcha-questions, and trying to explain to me that I just *didn't understand*.\n\nThis is where I screwed up big time. I was running on three hours of sleep, it was midnight, and I was severely hormonal as a result of PMS. So I ended up basically half-yelling at him (just raising my voice and taking a very stern tone) that since we clearly have different voews, I would appricate it if he would drop the subject. When he then tried to continue, I had to reiterate my point, word for word, a decibel louder. Certainly not helping my cause, I know, but I was so tired and angry.\n\nHe has behaved differently around me since. Cautious, but in a way almost talking to me as though I'm simultaneously stupid, and a daughter of satan. Not a huge change, just a slight shift in tone and body language.\n\nI'm probably over-thinking this, but I'm genuinely worried for what this is going to do to my work environment. I know I didn't handle it well, it just all caught me so off guard. Does anyone have any advice or suggestions on how to go forward here on in?\n\nAlso, I apologize if this isn't the appropriate sub for this. If it isn't, please direct me to where I can better place it. Thank you :)",
        "created_utc": 1467699198,
        "upvote_ratio": ""
    },
    {
        "title": "The National Experiment",
        "author": "throwiaway3434",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4r9p9p/the_national_experiment/",
        "text": "[removed]",
        "created_utc": 1467672484,
        "upvote_ratio": ""
    },
    {
        "title": "Did Understanding Evolution cause you to leave religion?",
        "author": "MrPeligro",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4r8sr8/did_understanding_evolution_cause_you_to_leave/",
        "text": "When debating or talking religion, I never bring up evolution. I feel it's a pointless discussion. Instead, I talk about the logic behind scriptures and doctrines.\n\nYet for some reason, whenever I mention I'm an atheist, Creationists always want to talk about evolution. As if evolution is the lynch pin to  why I don't stopped believing. Understanding evolution is not what caused me to deconvert. I mean, it's significant, but it's not the reason why. I personally never heard a person leave because of evolution, although I'm sure those type of people exist.\n\n\nSo that brings me here. Did any of you leave religion because you understood evolution?\n\nWhy do so many creationists think if you attack evolution, the only logical solution is that you will come back to god?",
        "created_utc": 1467660131,
        "upvote_ratio": ""
    },
    {
        "title": "How would you respond to this argument",
        "author": "TheSithMaster17",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4r8hqm/how_would_you_respond_to_this_argument/",
        "text": "An argument I hear from some people is the following. \"Your an atheist therefore you are spiritually dead, you cannot understand god with your natural mind and must be born again to understand him and receive his knowledge\". It really goes something like that. It's one of those only christians can undrstand god sort of arguments.",
        "created_utc": 1467656337,
        "upvote_ratio": ""
    },
    {
        "title": "I see no purpose in life",
        "author": "manannigans1432",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4r6xm5/i_see_no_purpose_in_life/",
        "text": "[removed]",
        "created_utc": 1467634029,
        "upvote_ratio": ""
    },
    {
        "title": "Miraculous Cryptography: a proof-of-work function for infinite beings",
        "author": "p1mrx",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4qzwk9/miraculous_cryptography_a_proofofwork_function/",
        "text": "Let's suppose that God exists, with infinite knowledge and power.  This makes him the best cryptographer, who could do the following:\n\nDesign a cryptographic hash function where every output is reachable, yet any chosen output can only be solved by brute force.  Everyday functions like SHA-512 may already satisfy this property, but God would know for sure.\n\nDescribe this hash function by revelation, along with a suitable text encoding.  Subsequently, construct every message to humanity such that it has a hash value of *all zeroes*.\n\nThese messages could be written in books, and passed down through the generations.  Anyone could audit the function for weaknesses, and independently conclude that the messages were written by an entity with access to more computing power than is available in the universe.\n\nBased on the fact that we *don't* have messages with such a signature, we can conclude that either God has never spoken to us, or doesn't care enough to make his messages believable.",
        "created_utc": 1467507315,
        "upvote_ratio": ""
    },
    {
        "title": "Had a talk regarding moses with a co-worker and need some clarification..",
        "author": "CVL080779",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4qt2md/had_a_talk_regarding_moses_with_a_coworker_and/",
        "text": "So, as the title says, I had a conversation about Moses, and I told him that the consensus is that moses didn't exist.\n\nHe said that Egyptians had a tendency to erase historical records that would make them look bad.\n\nI can't find anything online that supports what he says, and I asked him about that, and he said he will get back with me.\n\nHave  you guys encountered this argument before? If so, how did you respond?\n\nThanks",
        "created_utc": 1467395719,
        "upvote_ratio": ""
    },
    {
        "title": "Atheistic Satanism",
        "author": "heavygenesis",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4qs807/atheistic_satanism/",
        "text": "I recently made a [youtube](https://www.youtube.com/watch?v=ZyXKAZUF3ZM) video on satanism and throughout the research I found that most people who subscribe to a satanic sect don't even believe in Satan at all and rather are very rationally minded atheist. The [tenets](http://thesatanictemple.com/about-us/tenets/) of the Satanic Temple are actually pretty inspiring. What are some of your opinions on satanism and it's profile in atheistic and religious spheres?",
        "created_utc": 1467385811,
        "upvote_ratio": ""
    },
    {
        "title": "My religious affiliation is Buttermilkism. No, really.",
        "author": "3ngin33r33",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4qr3jm/my_religious_affiliation_is_buttermilkism_no/",
        "text": "Ever since I stopped believing in god I had no way to explain my views. I'm not religious, obviously but I'm also not an atheist; Not in the more mainstream sense anyways. I'm not agnostic either because I'm not waiting for more evidence, I know that no amount of evidence can, or at least should change my view, because while unlike logic, evidence is more convenient and abundant, it's never 100% indisputably conclusive. \n\nNaturally, I did my research but found nothing quite like what I was looking for. The one that came closest was theological noncognitivism, but I don't believe that it's pointless to argue. Hence Buttermilkism. Buttermilk is the by-product of making butter, butter is in this case is settling the religion debate. I couldn't care less about who's right, I do think however, that the by-products of the argument are beneficial. \n\nI'm a buttermilkist because I wan't to be as gray, as neutral as possible; The reason for which I can best explain by my experience debating religion. The common thing I notice when I see a debate between a reasonable theist and a reasonable atheist is that as time passes and the argument progresses they both tend to gravitate towards the \"I'm right, but it doesn't matter\" stance. \n\nSo my question is: Does it really matter whether there is a God or not? If yes, why?",
        "created_utc": 1467369634,
        "upvote_ratio": ""
    },
    {
        "title": "Do You Wish It Were True?",
        "author": "IrrationalShark",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4qq433/do_you_wish_it_were_true/",
        "text": "Lately, I've been thinking about this. Now, I don't know much about Christianity outside of the Mormon lens that I was raised with so my understanding of God and the afterlife are based on that. \n\nI was raised to believe that I would get to marry someone who I could spend eternity with. After the Second Coming, I would be resurrected and my body and everyone else's would become literally perfect. Not a single hair missing, as the saying went (I think there's an entire discussion to be had on what perfection even is in the first place, but whatever). Everyone would get a chance to accept Christ, even those who had never heard the \"true gospel\" or those who rejected it. Atheists, like myself, would even have a chance. Almost everyone would make it to some degree of heaven. It may not be the highest degree, known as the Celestial Kingdom, but according to Brigham Young even the lowest kingdom would be better than life on Earth. \n\nPretty much all of the problems I worry about could be taken care of. Global warming and other environmental problems? God'll come back and fix them. Death? There is life after death. Feeling lonely? You'll always have the spirit with you. \n\nIt all sounds so nice. I only have a vague concept of what mainstream Christian theology is, but I'm sure it's nice too. I just find myself totally unconvinced. Do any of you feel the same way? Do you wish it were true or are you glad that it's not? Sorry for the meandering post, but I wanted to get it off my chest.  ",
        "created_utc": 1467350693,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Miracles",
        "author": "TheOtherCollin",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4q7ski/question_about_miracles/",
        "text": "I saw a post on /r/debateanatheist a couple days ago, and it got me thinking a little bit.\n\nWhy are miracles often considered impossible or at least highly improbable?  Because we never see them now?  What if the god that does them doesn't do them anymore for good reason?  Because we don't have scientific evidence of a legitimate miracle?  What if they all happened in the past and we simply have to rely on history?  Because, if they do happen, they don't happen often?  The Big Bang doesn't seem to happen often; why, then, should we believe it?  We can only really rely on evidence left over from whatever event was there, just as we might with a miracle.\n\nAlso, the arguments against miracles I have seen so far seem pretty circular.  Miracles are improbable/impossible because our experience shows them to be improbable/impossible, therefore all miracle accounts are improbable/impossible because miracles are improbable/impossible because our experience...\n\nI just don't see why we discount miracles thinking them to be illegitimate possibilities for explaining things such as the accounts of Jesus' Resurrection or other things like that miracle.  Anyone have a really darn good reason why?\n\n**EDIT:**  *By the way, that post on /r/debateanatheist is no longer there.  The OP deleted it.*\n\n**EDIT 2:**  *I hope you guys realize that I am, for the most part, playing theism's advocate in the comments.  I am doing so for the sake of getting counter-arguments out.*",
        "created_utc": 1467091079,
        "upvote_ratio": ""
    },
    {
        "title": "Why, exactly, are miracles considered impossible or improbable?",
        "author": "TheOtherCollin",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4q7ovf/why_exactly_are_miracles_considered_impossible_or/",
        "text": "[removed]",
        "created_utc": 1467089354,
        "upvote_ratio": ""
    },
    {
        "title": "On objective reality, existence of a god (or lack thereof) and quantum physics",
        "author": "FuckinMELVIN",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4q2m76/on_objective_reality_existence_of_a_god_or_lack/",
        "text": "Anyone here who's read the Grand Design by Stephen Hawkins or knows a little about basic Quantum Physics? I'm sorry for the long read but it feels pretty good to get it out of my system. Skip to the last paragraph if you don't want to read the whole thing.\n\nAfter reading up on the book, I see we're not significant in the large scale of universe; now of course we can very well argue about finding meaning amongst ourselves and that it is all that should matter -- the universe still doesn't exactly care about you.\n\nWe also come to a realization that our brains aren't fully equipped to understanding some pretty far out events/phenomenon/actions. Unobservable actions lead me to question what the objective reality is and how an uninformed atheist is quick to deny the possibility of a greater force and mystery (definitely not talking about a god/spirit/flying spaghetti monster or jesus so you can drop the pitchforks).\n\nA fish living inside a concave lensed bowl has a distorted view of reality. Who is one to say what the fish sees isn't exactly real for the fish as it can very well apply it's own laws of nature given the concave view of the external world and make complete sense of it -- within the fish bowl of course. Likewise, if we were to turn upside down and given enough time our brains would rewire itself to perceive the object as downside up. Given that all the animals have a different view on reality as the structure of our brain comes in all crazy shapes and sizes, how do you seek answers to what the objective reality is. Of what goes beyond our minds and basic understanding of science. \n\nThe laws of nature bend when we observe particles and waves on the quantum level -- meaning they sway from Einstein's theory of General Relativity and classical mechanics. The double slit experiment (look it up on google if you haven't) talks about light behaving as a particle and a wave. The entanglement phenomenon shows how certain atoms are entangled meaning if one entangled spinning atom is altered, this affects the other atom regardless of the distance in space. What goes within the fragment of space and emptiness that we haven't exactly comprehended yet? (http://www.scientificamerican.com/article/quantum-entanglement-creates-new-state-of-matter1/) \n\nThe Multiverse and The String Theory is all but a familiar kick in the nut sack. Odds are we can also very well be a part of the Matrix. I can't help but laugh at an image of a fat neckbeard controlling the fates of our universe as we're just another characters in their version of The Sims game. We replace one mystery for another. Who controls the neckbeard? If it's God, who controls God -- it's never ending and I don't think we can really find out the truth. The concept of soul and free will was destroyed by the plethora of scientists who electronically stimulate certain parts of the human brain to control the movement of their bodies leading them to believe that we're really just biological machines working within the framework of our human brains.\n\nEinstein claims that Quantum Mechanics is an incomplete understanding of the universe (but then what isn't?) but a progressive one nonetheless. Hawkins on the other hand claims it's quite possibly the best route to understanding the strange laws that govern the universe.\n\nMy point being, there's a lot of crazy happening out there in the world and it saddens me that we won't be able to solve the mysteries surrounding the universe at least in our generation or the next few hundreds. More importantly while I reject the notions of an all loving, just and benevolent god and highly critical of the literature within the holy books -- we can't exactly disprove the idea of god altogether in the same vein that we can't disprove a flying spaghetti monster. Some beliefs talk of mysterious energies surrounding the universe and while I only agree with them at that point (but not at all to say that these wistful breaths of fresh air from the goddess Luna or flowery farts from the great lord off Zeus' tooshie himself)-- it goes off as a little too self-centred when they say that these energies are responsible for their moods, their days and their lives in general which is an ultimate slap in the face of logic. We can only claim evidence for what we perceive within the ranks of our brains. What goes beyond our minds can not be proven and will be left to test at a blinding leap of fate (or an intelligent assumption) which is completely absurd. While I draw to no conclusions about god and I still try to read, discuss and enhance my knowledge on the subject, I don't dispel the idea altogether -- only to twist it to serve my personal criterion of what god really is.\n\nA humble bearded man up in the sky taking notes of who goes to heaven and hell or an untimely jealous god who'd test one of his followers to prove his love for him by sacrificing his kid and then replacing that said kid with a sheep only leads me to believe he's the biggest troll in the universe and is clearly not the kind of god i'm talking about.",
        "created_utc": 1467021949,
        "upvote_ratio": ""
    },
    {
        "title": "A point of logic.",
        "author": "ughaibu",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4q26gu/a_point_of_logic/",
        "text": "One way in which *existence* is characterised is to say that if some object instantiates some property, then that object exists. So, if it is the case that some object shits, then by instantiating the property of shitting, that object exists. \n\nOn another thread several members are claiming that by asserting that an object lacks a property, I am assuming that object's existence. Let's call this inference *TA*. \n\nNow, consider this argument: \n\n*1)* tautology: either it is the case that god shits or it is not the case that god shits \n\n*2)* by definition of \"existence\": if it is the case that god shits, then god exists \n\n*3)* by *TA*: if it is not the case that god shits, then god exists \n\n*4)* by contraposition of *2*: if god does not exist, then it is not the case that god shits \n\n*5)* from *3* and *4*: if god does not exist, then god exists. \n\nWe have derived a contradiction and the only dubious inference is *TA*. So, *TA* is an invalid inference and asserting that some object fails to instantiate some property does not entail the assumption that the specified object exists.",
        "created_utc": 1467012864,
        "upvote_ratio": ""
    },
    {
        "title": "Can't find the answer on the internet, need your all's help.",
        "author": "xKratos",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4q1atl/cant_find_the_answer_on_the_internet_need_your/",
        "text": "[removed]",
        "created_utc": 1466997800,
        "upvote_ratio": ""
    },
    {
        "title": "Should we discriminate against Muslims in America's immigration policy?",
        "author": "veeladdy",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4pztbb/should_we_discriminate_against_muslims_in/",
        "text": "[removed]",
        "created_utc": 1466976494,
        "upvote_ratio": ""
    },
    {
        "title": "My company has recently begun a \"reflection\" period at the start of our weekly meetings. I'd like to contribute something.",
        "author": "whiskey_nick",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4pz6xh/my_company_has_recently_begun_a_reflection_period/",
        "text": "I'm not a big fan of it, because most of my coworkers are religious, but we have begun starting our weekly staff meetings with a reflection piece.  Usually someone reads some uplifting piece of scripture, or something riddled with religious meaning etc...  I don't really care, because I'd rather just shut up about it than cause a big fuss, especially when I'm literally the only non-believer of the group (about 12).  I'd actually like to participate, but I don't know any material that I could bring to the table.  I'm not looking for anything specific, other than I don't want it to be anything anti-religious, or anything that points to being obviously atheistic.  I was hoping someone here has some ideas of a nice quote, or short literary piece that I could read at one of my staff meetings?  Thanks for any feedback!\n\nEdit:  A lot of good stuff here, so thank you everyone who actually read and understood the point of my post.  Some of you don't and need to grow up and learn how to participate in a world where others' beliefs may differ from your own.",
        "created_utc": 1466968272,
        "upvote_ratio": ""
    },
    {
        "title": "Which is better to lean on? Religion or Zoloft ?",
        "author": "j3434",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4pxzrh/which_is_better_to_lean_on_religion_or_zoloft/",
        "text": "I like to ask that question. This is a hypothetical question. Suppose you had a son who was raised non-denominational secular Christian. Or no real religion that demanded anything beyond holiday celebrations that are mostly cultural. This son goes off to college for for years and comes back a \"Born again\" Christian saying \"praise Jebuz\" and warning the whole family about hell and Satan and telling you about the Glory of heaven. So you tell him to back off ... and after some conversation it seems that he jumped into religion during college because he was depressed , lonely , under stress and such and such and his Christian fellowship on campus seemed to help with all that so he could actually get on with his studies and has inwardly happy. But once back in his home he starts to think all the prayers and rejoice songs are nice and make him happy but is based on a myth. Based on ancient superstition so his rational mind ( and you the father ) seem to agree that it is best that he just lives life as he did before without the opiate of Christianity. So after a few months he falls back into depression. He is anxious, depressed and such and such. He really is of no danger to himself or others and he does hold down a \"life\" and a job BUT has a nagging depression. He knows if he goes back into the \"mantra mode\" of prayers and songs and fellowship it may make him happy again but he decides to try Zoloft instead. And the results and similar although distinctly different. The point is lets say he can function with one or the other and his mind is \"content.\" So now your dear, dear son wants to make a choice between religion and the pill. How would you advise him if you were a hardcore atheist or moderate agnostic?",
        "created_utc": 1466951650,
        "upvote_ratio": ""
    },
    {
        "title": "Resurrection arguments (&amp; NT Wright specifically)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4pxjnu/resurrection_arguments_nt_wright_specifically/",
        "text": "[deleted]",
        "created_utc": 1466943973,
        "upvote_ratio": ""
    },
    {
        "title": "This guy's response to the praying to a milk jug.",
        "author": "Kakamaboy",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ps8n3/this_guys_response_to_the_praying_to_a_milk_jug/",
        "text": "Apparently, the reason people's prayers get answered if they pray to something other than God is because Satan is the one answering their prayers. Even if they are praying to something other than God, since there are only God and Satan, it must be Satan they are praying to. Just, wow, such an airtight delusion.",
        "created_utc": 1466856256,
        "upvote_ratio": ""
    },
    {
        "title": "An argument for the existence of god.",
        "author": "ughaibu",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4pqsgl/an_argument_for_the_existence_of_god/",
        "text": "A user of this sub has conjectured that knee-jerk responses arise because the readership are over familiar with the available arguments for the existence of a god. So, here's an argument that you might be unfamiliar with.\n\n*1)* premise established by reading: the Bible states that \"man is made in the image of god\"\n\n*2)* premise established by interview and examination: men have anal hair\n\n*3)* premise established by googling: there is no accepted evolutionary explanation for the anal hair of men (call the collection of candidate evolutionary explanations *ev-ex*)\n\n*4)* premise established by medical practitioners: because men shit, anal hair is inconvenient, unattractive and unhygienic \n\n*5)* assumption: god does not shit\n\n*6)* from *4*: as anal hair is inconvenient, unattractive and unhygienic, anal hair is an evolutionary minus\n\n*7)* from *4* and *5*: as god does not shit, god's anal hair is not inconvenient, unattractive or unhygienic \n\n*8)* from *1* and *2*: that man is built in the image of god is a candidate explanation for the anal hair of men (call this candidate explanation *go-ex*)\n\n*9)* from *3*, *6*, *7* and *8*: *go-ex* is a better explanation for the presence of anal hair in men, than *ev-ex* \n\n*10)* assumption: *ev-ex* and *go-ex* are the only competing explanations\n\n*11)* from *9* and *10*: as *ev-ex* and *go-ex* are the only competing explanations, the better explanation, *go-ex*, is the best explanation\n\n*12)* from *1* and *11*: as the authority for the best explanation is the Bible, the Bible is the best authority on this matter\n\n*13)* from *1* and *12*: the best authority states that man is made in the image of god, so we have it on the best authority that there is a god\n\n*14)* premise established by convention: we should accept that which we have on the best authority\n\n*15)* from *13* and *14*: we should accept that there is a god.\n\nComments: the argument could be taken as a *reductio* against the assumptions *5* or *10*, but it's difficult to see how it could be proved that god both shits and fails to exist. Accordingly, a *reductio* seems to require an alternative explanation for the anal hair of men, that is neither evolutionary nor theological. \n\nI realised after writing it out that I have a suppressed premise required for *6*, but as that premise is obvious and I can't be bothered adding it and correcting all the numbers, employ a charitable reading. No doubt there are other omissions that should similarly be charitably added. \n\nHave fun!",
        "created_utc": 1466825297,
        "upvote_ratio": ""
    },
    {
        "title": "I want to know how other atheist/agnostics find a reason or purpose in life.",
        "author": "rwm5242",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ppstu/i_want_to_know_how_other_atheistagnostics_find_a/",
        "text": "I'm 26 years old and have hit kind of a quarter life crisis.  I am married, have a house, and have a child on the way.  The one problem I have is I no longer really want the life I have after giving up on Christianity.  Marriage to me was always a spiritual and religious connection with someone and without a connection to God I no longer get anything positive out of marriage.  I feel like my life has lost purpose without God and I'm more selfish than ever.  I feel like I have wasted the best years of my life by devoting myself to a cause that never rally existed.  I simply want to be selfish and have sex all the time, but with women who aren't my wife.  I see no sense in monogamy without the religious connection.   Any insight from others who have lost faith and had to relearn how to live in a world without it would be greatly appreciated, as would any help from people who never fell for the trick that is religion, thanks for your time.",
        "created_utc": 1466810030,
        "upvote_ratio": ""
    },
    {
        "title": "Why science is a terrible vehicle as evidence for God.",
        "author": "avatarrangg",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4pns5m/why_science_is_a_terrible_vehicle_as_evidence_for/",
        "text": "I often hear objectors to the God hypothesis state that their lack of belief stems from a lack of evidence. This post is created to address those who specifically mean scientific evidence as opposed to evidence in its broadest form. \n\nFor example, we have shown that heliocentrism and plate tectonic theory are true with scientific confirmations.\n\nWe have shown that geometry's theorems are true based on logical evidence, and not scientific confirmations.\n\nWe have shown that philosophical frameworks - like deductive syllogism are true based on logical evidence, and not scientific empiricism.\n\nThe point here is that scientific evidence is extremely useful, but it does have its limitations when investigated deeply.\n\nNow for the God hypothesis...for those who are *only* interested in scientific verification for God, I want to argue that Occam's Razor makes this downright impossible to do.\n\nTo elaborate, I have provided a short syllogism.\n\n\n1. God if he exists, by definition, is an infinite being who transcends space-time.\n\n2. Science is a system that measures finite data within the confines of space-time.\n\n3. Therefore, using Occam's Razor, any apparent scientific evidence for a transcendent God must alternatively be best seen as the product of something finite in space-time.\n\n**Premise 1**\n\nThis is the standard definition for God in most popular theistic frameworks\n\n**Premise 2**\n\nThis is a well known aspect about science. All of the data we collect exist finitely and exist within our space-time dimensions.\n\n**Premise 3**\n\nEven if the stars aligned themselves to say \"I God am real,\" then it would be infinitely more probable for an advanced alien species to have either 1. actually moved the stars or 2. create this worldwide delusion.\n\nAn advanced alien species here will be taken as living finite within our universe, and so is ontologicaly simpler to use as an explanation than an infinite/transcendent cause.\n\nAnother more probable reason for God's apparent and scientific evidence would be that a law of nature caused an evidence to come into being naturally. Suppose there is a bright form of a huge human-like being glowing in the sky. This could more easily be the result of some form of natural phenomena, similar to the northern lights, than an actual transcendent deity.\n\n\nWhat do you guys think? My argument is essentially saying scientific evidence wouldn't show that God exists, because any alternative explanation is simpler to explain.\n\nEdit: Grammar\n\n2nd Edit: I meant \"Occam's Razor\" and not \"Pascal's Wager.\"\n\n**3rd Edit: Thanks a lot for the discussion everyone. I think everyone agreed with my general conclusion (even though the syllogism was a little bit sloppy). To elaborate, if you want to study whether God exists or not, it would be absurd to think that science alone can give you the answer. Theology is the philosophical branch that deals with logical truths about God, and whether his existence is actual.**\n\n**In light of a lot of misunderstandings or repetitive inquiry, I believe [existence and logic](https://www.youtube.com/watch?v=dR_RFJernjE) go hand in hand. You cannot have one without the other. I also think [philosophy, religion, and science](https://www.youtube.com/watch?v=VxsrB6pLhVc) are all different branches of the same tree. Namely, knowledge.**\n\n**We touched based on how some very smart people think abstract objects like numbers or mathematical truths exist independent of the physical world/human minds. I don't know if that is true, but if it is, it's a very neutral way of thinking - there is no need for atheism or deism in those philosophies.**\n\n**My \"Agenda\": as u/igottroubledthoughts pointed out, my personal history is an imperfect one. I have personally grown a lot in maturity and understanding, and I hope to help others grow as well. I used to have another account long ago where I would be attacking theism as strong or stronger than what I get, so karma I guess...I have always sided with reason and truth, and that is what I held to when I was an atheist myself, and what I still currently hold to today. My religious faith or lack thereof is simply a consequence of where I see reason and evidence taking me.**\n\n**I meant no threat to anyone, and I am willing to PM anyone if you wanted to discuss any other topic further. Even if you just need a friend to talk to, I offer religiously neutral discourse**",
        "created_utc": 1466785850,
        "upvote_ratio": ""
    },
    {
        "title": "If you were hospitalized and knew you were on your death bed, minutes away from dying, would you reconsider Occam's Razor?",
        "author": "avatarrangg",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4piuxa/if_you_were_hospitalized_and_knew_you_were_on/",
        "text": "This isn't about being rational or logical, this is simply an appeal to being human.\n\nIt seems that religion and spirituality are most prevalent in poorer nations, where death and suffering are significantly more common than in richer nations. As a result, I speculate that these people, being human, simply cling onto hope for something better - namely, an afterlife.\n\nPersonally, I've always believed that it's easier to not believe in God if you live in a nation with a multitude of opportunity, protected freedoms, and wealth.\n\nSo say you were in a critical condition in a hospital, and the doctor told you that there were only minutes left for you to live. Unfortunately, your family and friends were not able to travel to the hospital fast enough to see you - so you had no physical support of loved ones there to help you cope with your demise.\n\nYou're asked if you'd like for the hospital deacon to come and make 1 last prayer - 1 last chance for you to choose potentially infinite gains.\n\nWould you then reconsider believing in God and the afterlife? Why or why not?\n\n**EDIT: Make sure your reply has at least 10 characters or the bots will come to get ya.**",
        "created_utc": 1466713506,
        "upvote_ratio": ""
    },
    {
        "title": "What should I do if my best friend is becoming a little TOO catholic?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4phkiu/what_should_i_do_if_my_best_friend_is_becoming_a/",
        "text": "[deleted]",
        "created_utc": 1466699045,
        "upvote_ratio": ""
    },
    {
        "title": "Help me with my Rebuttal to the Cosmological Argument",
        "author": "TSomaT",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4phfs4/help_me_with_my_rebuttal_to_the_cosmological/",
        "text": "Help with Rebuttal to Cosmological Argument:\n\nSo I just got into an argument with a Christian. Here's basically how it progressed\n\nChristian: If there is no God, then what caused the universe? Surely the universe must have a cause.\n\nMe: Why must the universe have a cause?\n\nChristian: Because it's logical?\n\nMe: But why should logic apply outside the universe?\n\nChristian: What do you mean?\n\nMe: Well, the laws of logic are essentially grounded in reality. Logic helps us understand the world around us not because the world is based off logic, but rather because logic is based off of how the universe works. If the laws of how the universe operated were different, then the laws of logic would be much different as well. So if the way the universe works is the foundation of logic, then without the universe, logic has no foundation. Logic only works in our universe. Therefore, before the universe was created, there would be no logic because there would be no foundation for it. The law of cause and effect need not apply outside the universe.\n\nChristian: But aren't you using logic to make the claim?\n\nI don't think this Christian's argument against my rebuttal for the cosmological argument works, but I don't know how to explain why his last statement doesn't work. Can you guys help me out? How do I refute that last statement?",
        "created_utc": 1466697554,
        "upvote_ratio": ""
    },
    {
        "title": "Ghosts....The Burden of proof (supernatural and religion)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4pgw5t/ghoststhe_burden_of_proof_supernatural_and/",
        "text": "[deleted]",
        "created_utc": 1466690724,
        "upvote_ratio": ""
    },
    {
        "title": "Hey guys, I'm an Ex-Orthodox Jew and am holding an AMA on /r/atheism. Ask whatever you want.",
        "author": "YudaHaKofer",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4pehi0/hey_guys_im_an_exorthodox_jew_and_am_holding_an/",
        "text": "[removed]",
        "created_utc": 1466649002,
        "upvote_ratio": ""
    },
    {
        "title": "Hoping to Attract Atheists to a forum on \"Your Dreams and What They Reveal About Your Subconscious\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4p95og/hoping_to_attract_atheists_to_a_forum_on_your/",
        "text": "[removed]",
        "created_utc": 1466574531,
        "upvote_ratio": ""
    },
    {
        "title": "Question about other religions according to christianity",
        "author": "Vicot17",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4p6qx4/question_about_other_religions_according_to/",
        "text": "Hey. I'm pretty new to these philosophical questionings, but bear with me. I was just wondering. If, christians proclaim that God created all humans, and that he is the Almighty, what is up with other religions? How does the Almighty God explain why there is Almighty Allah and Almighty Shiva? And which God is better? Does any religion take time to explain anything about existence of other religions? Because, I was a thinking dude needing convincing to believe in a religion, I would first ask what are other religions doing here, if there is One and Only God Almighty.\n\nAny thoughts? I don't want to seem like an edgy atheist, it's just that is seems to me like a reasonable question.",
        "created_utc": 1466540704,
        "upvote_ratio": ""
    },
    {
        "title": "Biblical numerology?",
        "author": "stinkers",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4p5tyl/biblical_numerology/",
        "text": "Hello r/trueatheism, i am a new(ish) atheist and i partially have you guys to thank for that. My question, if anyone has any knowledge of this subject, is about the correlation some people have made between biblical numerology, cosmological numerology, and some of the different historic calanders. Has any of this been debunked? Is it coincidence? I will try and find an example if you need one. Genuinely curious and also would like something to counter argue some of the biblical scholars in my peer group. Thanks!\n\nThanks for the replies.",
        "created_utc": 1466530384,
        "upvote_ratio": ""
    },
    {
        "title": "\"You go to church? You must be a good person.\"",
        "author": "Gibsonfan159",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4p1r1z/you_go_to_church_you_must_be_a_good_person/",
        "text": "This is one I hear that always makes me roll my eyes. Morally speaking, being motivated to do good based on reward will always fall below doing it because it makes you feel good. True compassion is based on unconditional desire. If you have to refrain from murdering people because you want into heaven, you might have incredible self-control, but you are in no way a good person. Bad intent still exists within you. Sitting on a church pew thinking about how much you despise certain people doesn't make you a good person. An atheist who does good will always be a more moral person by default. Because it is unconditional. But of course a religious person will claim an atheist only does good because God's controlling them. So much for free will then.\n\nSo next time someone brings up the \"moral compass\", be sure to ask them \"On what conditions are your morals motivated by?\" If they say \"God\", simply say \"Well that's too bad, I do good because I want to.\"\n\nEdit- TLDR; Are you capable of doing good without reward? Yes? Then why is God necessary?",
        "created_utc": 1466466931,
        "upvote_ratio": ""
    },
    {
        "title": "Mom's Christian Literature",
        "author": "sdiller",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ovrnx/moms_christian_literature/",
        "text": "I came across a book my mother has begun to read called *Rediscover Jesus*. The prologue tells a story of a business man who is headed to the airport for an important meeting elsewhere, when the man and his colleagues knock over a produce stand while hailing a taxi. They all continue to the airport except for the man who stays back to help the woman running the produce stand (who is blind) clean up the mess. She tells him that he must be Jesus because she prayed for Jesus when she heard her produce stand falling, and then the book asks the reader, \"how much is the sheer busyness of your life preventing you from living the life that God is calling you to live?\"\n\nDoesn't the idea that your busy life is the reason you are not living the life god is calling you to contradict the idea that god has a plan for you? Why would god give you a plan that leads you away from him? How do Christians reason out of contradictions such as these?\n\nThis story really only makes sense with the idea that everybody who may have stopped to help the woman would be a Christian? Does the author expect every reader to make this assumption?",
        "created_utc": 1466378639,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone answered Christopher Hitchens' challenge?",
        "author": "JSmurfington",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ouki2/has_anyone_answered_christopher_hitchens_challenge/",
        "text": "I've heard him give this challenge a few times.  It goes like this:\n\nhttps://www.youtube.com/watch?v=XqFwree7Kak\n\nBasically:\nName a moral action taken by a believer that could also be taken by an unbeliever (there are many).  Now name a wicked action that could ONLY be undertaken by a believer and not an unbeliever, and you could also come up with many examples.\n\nIt seems like a nice little rhetorical device to use in debates, but I was wondering, if we all try to play devil's advocate, are there any fallacies in this challenge?",
        "created_utc": 1466362031,
        "upvote_ratio": ""
    },
    {
        "title": "Virgin Of Guadalupe",
        "author": "Arth11722",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4osdgl/virgin_of_guadalupe/",
        "text": "[removed]",
        "created_utc": 1466320834,
        "upvote_ratio": ""
    },
    {
        "title": "An Economic Problem with \"Eternal Life\"",
        "author": "portabledavers",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4oqde7/an_economic_problem_with_eternal_life/",
        "text": "Ok, so this issue actually only occurs, I think, among those religious people who are also economic conservatives who believe in the merits of free markets and capitalism. I'm not going to argue one way or another on that. \n\nWhat I want to focus on is the standing theory of value within capitalistic systems: supply and demand. When we place products on the market, how we value that item for purchase is based on two things: how many of these are already available for purchase elsewhere and how much do I want/need. If our demand is constant, then adding more of a product will decrease the value of all alike products. Most people know this, I just wanted to lay it out.\n\nThe problem arises when we accept this theory of value but also want to believe in an afterlife. \"Eternal life\" in the \"Kingdom of God\" Sounds nice at face value, but our valuing an eternal paradise just doesn't make sense given that theory. If that theory of value stands then we ought not value the prospect of eternal life. If demand is constant, then making supply infinite causes the value to drop to zero. \n\nAgain, this is only a problem if you accept both of those ideas at the same time. You can fix it by accepting either a different value theory or a different metaphysical prospect. The problem with the first one is that this theory of value is so deeply ingrained in our economy and lifestyles. My answer is to abandon the whole idea of afterlife and accept that my life is a finite thing. This justifies my feeling that my life has value, at least to me. \n\nSo how do you guys feel about this issue? Do you agree or do you think that there are ways around it? Or do you have a different solution?",
        "created_utc": 1466284946,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone ever used the technique \"agree and amplify\" in a discussion?",
        "author": "HaikuLubber",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ojz9f/has_anyone_ever_used_the_technique_agree_and/",
        "text": "[removed]",
        "created_utc": 1466180135,
        "upvote_ratio": ""
    },
    {
        "title": "How can they believe that a dead person would avenge is death?",
        "author": "Ritagajah",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ojg8y/how_can_they_believe_that_a_dead_person_would/",
        "text": "[removed]",
        "created_utc": 1466173337,
        "upvote_ratio": ""
    },
    {
        "title": "Why would an atheist think it important to insist that birds are dinosaurs?",
        "author": "ughaibu",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4oimdn/why_would_an_atheist_think_it_important_to_insist/",
        "text": "[removed]",
        "created_utc": 1466159703,
        "upvote_ratio": ""
    },
    {
        "title": "If religion, geopolitics, history, and mental health are not able to be separated from one another, how can we find a solution to our issues with religious extremism?",
        "author": "sdfadfadasdsa",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ohsts/if_religion_geopolitics_history_and_mental_health/",
        "text": "I am in a household where my family makes arguments about the U.S.' constant bombings of middle eastern countries as the reason why they are attacking outwards. They then make the argument that this bombing is preventing their society from progressing towards a modernized version of this religion. I hear the arguments that any religion which was constantly being bombed would be lashing outwards, and it isn't fair to criticize islam.\n\n\n\nI see that as all somewhat true; but I still see the stats about opinion polls of muslims, where a majority agree that homosexuality is not acceptable, I see that a majority of them condone violence against infidels, and I see the european stats before and after the refugee/immigration crises.Those large sets of data lead me to the conclusion that it is primarily an Islamic religious movement.\n\n\n\nI then cite passages in the religious books, with interpretations from historians, where it is teaching sharia law type teachings, and I argue how those are influential on someone's minds, and many are taught these from a young age. They will argue that nobody interprets the books in the same way, and it is impossible to determine whether someone truly believes in something they are learning.\n\n\n\n\nI'm looking for something that will stop them from calling me a bigot against muslims, but I am sure there are logical fallacies in their arguments, but I can't poke holes in them.\n\n\n\nAnyone able to point me in some helpful directions would be greatly appreciated, thanks!\n\n",
        "created_utc": 1466142093,
        "upvote_ratio": ""
    },
    {
        "title": "It's an odd feeling to run into a new atheist you're responsible for ...",
        "author": "depcrestwood",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4oep8h/its_an_odd_feeling_to_run_into_a_new_atheist/",
        "text": "tl;dr:  Today I learned that a guy I thought would end up a preacher at some point instead switched to atheism after hearing me discuss it on a few occasions.\n\nI've been an atheist for quite some time, and it's pretty well known among my coworkers.  I never bring it up, but as I live in a fairly religious city, and my coworkers and I work in a close-knit environment where such discussions aren't seen as workplace violations, but more like conversations between family members (we spend 60+ hours a week together in a fairly stressful environment), faith has come up, and I've always been the odd one out when it does.  I'm comfortable with it, and I discuss my non-belief when asked, but one of the main aspects of atheism that drew me to it was the non-recruitment factor.  I'll be me, you be you, and let's just do our thing.  Because we're all so close, though, there's been plenty of debate over the years, and some ribbing directed at me for thinking a way none of them could wrap their heads around, but I'm thick-skinned and stubborn, so I just stick to my guns and make my point and let the matter drop.\n\nApparently during one of these debates, I ended up planting a seed in the mind of one of the more devoutly religious members of my team.  He's always been a cool guy, and never tried the moral superiority angle ... a rare form of open-minded christian, but who I always thought was about one step away from becoming a pastor since he was always verbally passionate about his faith, and he has that type of charisma that makes people want to listen to him.\n\nA few months ago, after he transferred to another division, he gave me a call and said he wanted to pick my brain about a few topics related to atheism, and I said sure, whenever he had time, but I didn't hear anything more about it from him, and I didn't think anything of it.  He sounded like maybe he was having a crisis of faith, and he probably wouldn't have liked my answers, since I would have told him he should probably hold off on giving up his beliefs until things calmed down and he could consider it all with a clearer mind.  Mental and emotional stress create the worst times to try to make a life-changing decision.\n\nFlash forward to this morning, and he popped up in my office and was, for lack of a better term, bubbling with his new-found atheism, and thanking me for helping to open his eyes.  Which was nice, I suppose, though I'm terrible with compliments, and while it was nice to see someone figure out what a load of bunk religion is, I still cringed a bit because he's not the closet type, and I know he comes from a large religious family, and I'd hate to see him ostracized or disowned from something he has always been extremely close to.  As it was, he was trying to preach atheism to me, and he already knew I agreed with him.  But apparently he's respected enough in his family and community that when he's discussed his newfound non-faith, he was able to get people to listen to him rather than shun him ... so more power to him in that regard, I suppose.\n\nHe's still a fledgling in all of this, though, (and I'm by no means an expert debater), and while his spirit is in the right place, some of what he was saying was slightly flawed, logically.   He's still in the transitional period in which he knows the new place where he wants to be, but is still using all of his old maps to get there.  So I made a few points to guide him towards a more logical way of thinking and to add a few facts here and there to help support his arguments (I've never been one to tell someone they are flat out wrong about something when they're trying to learn ... it never worked with me, and a lot of people have an extreme negative reaction to it, especially the older they get).  Eventually, we had to get back to work, but he left just as enthusiastic about his new freedom as when he showed up, so I can at least believe I didn't do any harm.\n\nStill, it's the first time I've run into an atheist and have them point at me as their inspiration to basically change their entire world view.  This time last year he would have told me under no uncertain terms that I was simply wrong about how I viewed religion and the existence of a god.  I don't know what final straw caused him to consider the alternative, and it will be interesting to see if it still sticks after the \"shiny new toy\" status of non-belief wears off, but for now, it appears I inadvertently convinced an unlikely new member to join our numbers.\n\nHas anyone else stumbled into convincing people to drop their deeply held beliefs and switch over to atheism?  I'd be interested in your stories and especially in how you handled it.",
        "created_utc": 1466100066,
        "upvote_ratio": ""
    },
    {
        "title": "I'm reading the Koran and I need some serious help here.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4obyd9/im_reading_the_koran_and_i_need_some_serious_help/",
        "text": "[deleted]",
        "created_utc": 1466057872,
        "upvote_ratio": ""
    },
    {
        "title": "Everyone is focusing on gun control (which isn't bad) but not the other elephant in the room.",
        "author": "Joten",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4o6esy/everyone_is_focusing_on_gun_control_which_isnt/",
        "text": "I typed this into Facebook but couldn't hit send (see below), I am a gun owner that supports much stronger gun control but personally not a full out ban. Most of all I hate that the gun control folks only want to talk about the tool of death but not the cause: \n\n&gt;In response to many friends recent posts: \n\n&gt;I as a gun owner support logical talks about how easy it is to get a fire arm. \n\n&gt;But can we also focus on Tax Free institutions that promote hatred against those unlike themselves, most recently the LGBTQ community.\n\n&gt;While we focus on the madman's tool of violence, lets also focus on his cause. For this one it was Islam, for the previous one (CO Springs) it was Christianity, for all of them they were supported by people hiding behind religion.\n\n&gt;I'm tired of all of it, but before guns were invented there was religion and so many were murdered because of it \n\nOf course I can't post this, I would lose ~60% of my Facebook friends (including family and co-workers I would be required to see tomorrow), they (religious people) see one bad thing said about them and they run. But I wish we could talk about the largest case of mental illness that has ever swept humanity. \n\nThanks for the vent. ",
        "created_utc": 1465981187,
        "upvote_ratio": ""
    },
    {
        "title": "Refute: \"A Muslim kills a bunch of gays, it's a terrorist attack. A white kid goes inside a church and kills every black person in it, it's a mental illness.\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4o4ewp/refute_a_muslim_kills_a_bunch_of_gays_its_a/",
        "text": "[removed]",
        "created_utc": 1465947574,
        "upvote_ratio": ""
    },
    {
        "title": "REPOST from the demonstrably useless r/atheism: Secular Christendom and the Slavery of Text.",
        "author": "tony-chan",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4o41mn/repost_from_the_demonstrably_useless_ratheism/",
        "text": "[removed]",
        "created_utc": 1465942700,
        "upvote_ratio": ""
    },
    {
        "title": "\"Pray the gay away\" seems like a bad idea for everyone.",
        "author": "redmike15",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4o29wv/pray_the_gay_away_seems_like_a_bad_idea_for/",
        "text": "So I guess pray the gay away works as well in Islam as it does in Christianity? In case you werent aware, the shooter was an active member on multiple gay dating apps and a regular at that very bar. He was also part of a very religious family. His father and friends commented on how homophobic he was in public, but obviously he couldnt resolve that with his personal feelings. Not to try and make excuses for that nut job, but if you take someone who is already very disturbed and prone to violence and deny them the most basic of emotions and adult love.. well that turns what should have been the most stabilizing and calming force in your life into an incredibly painful and negative one that you cant get away from and cant lead to anything good. \n\n\nI just dont understand why so many smart and educated people still cant shake the idea that moral guidelines written down in the violent bronze and iron ages are relevant in any way to modern society. Look, if you are going to pick and choose which parts are still true or worth following its no longer the book that is your moral compass its you. And we should all be able to see how wrong (and logically impossible) a strict and fundamental interpretation of religion is, so if everyone is just using their own moral compass to interpret their religion anyway why bother with the charade? Cant we all just be strong enough to admit the truth and stand on our own two feet and say this is right and that is wrong not because of some old book but because of your own moral judgment? Use some empathy, fairness, justice and truth for your moral building blocks and everyone will come out stronger and happier. \n\n\n\nTLDR: I dont think anyone can ever know why or how someone snaps and does something this disgusting, and its never going to be as simple as one or two reasons because people are more complicated than that.           What I do know is if he wasnt an active member of an extremely conservative family and religion he could still have gone on to commit a mass shooting, but I guarantee it wouldnt have been at this gay night club in Orlando. Someone else might have ended up needlessly murdered, but not those people and not that night. \n\n\n\\end rant. First time poster (sorry if formatting is poor) and just wanted to share some of my thoughts and vent some anger",
        "created_utc": 1465922174,
        "upvote_ratio": ""
    },
    {
        "title": "Islamist Spambot who spent Five Years in 'Atheism' bashing Americans and Christians...finally exposes himself by trolling front page with pro-Islamic post after Orlando shooting...shame on r/atheism for not calling this Islamodickwad out",
        "author": "Nezaus",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4o1fw9/islamist_spambot_who_spent_five_years_in_atheism/",
        "text": "[removed]",
        "created_utc": 1465911749,
        "upvote_ratio": ""
    },
    {
        "title": "[META] I'm desperate to locate this post",
        "author": "tapout189",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4nxyab/meta_im_desperate_to_locate_this_post/",
        "text": "[removed]",
        "created_utc": 1465853352,
        "upvote_ratio": ""
    },
    {
        "title": "Can spirituality be practical and reasonable?",
        "author": "1tepa1",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4npq8s/can_spirituality_be_practical_and_reasonable/",
        "text": "[removed]",
        "created_utc": 1465727172,
        "upvote_ratio": ""
    },
    {
        "title": "Salvation from suffering through self investigating is a possibility for everyone, no beliefs needed",
        "author": "1tepa1",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4npafp/salvation_from_suffering_through_self/",
        "text": "[removed]",
        "created_utc": 1465715601,
        "upvote_ratio": ""
    },
    {
        "title": "Source of lasting happiness and peace can be found only by turning in",
        "author": "1tepa1",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4np515/source_of_lasting_happiness_and_peace_can_be/",
        "text": "[removed]",
        "created_utc": 1465712177,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"playing the word game\" persecution",
        "author": "TheSithMaster17",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4nm71e/is_playing_the_word_game_persecution/",
        "text": "[removed]",
        "created_utc": 1465664337,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Burqini ban?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4nj5b5/thoughts_on_burqini_ban/",
        "text": "[removed]",
        "created_utc": 1465602823,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of this article \"What Motivates Extreme Self-Sacrifice?\"",
        "author": "Leon_Art",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ngee0/what_do_you_think_of_this_article_what_motivates/",
        "text": "The article is titled: [**What Motivates Extreme Self-Sacrifice?** *New work in the field of anthropology says violent extremism isnt really motivated by religion  but by fusion with the group*](https://psmag.com/what-motivates-extreme-self-sacrifice-f02f1bad7bbd#.to2i6algn), by Harvey Whitehouse.\n \nIt's obviously about the argument of religion in general, but Islam in specific, making people suicide terrorists.\n \nI'd paraphrase main point as: 'religion' doesn't make people give extreme self-sacrifices (read, e.g.: suicide bombers), but 'fusion' does. And fusion is the thing that happens when an individual identifies very strongly with a group, a few people, etc. E.g.: you'd sacrifice yourself for your family. Fusion is made stronger by painful (physical and/or emotional) experiences that high-light that individual-group identification (while reading it, hazing popped up in my mind).\n \nWhile I find my 'common sense' gut-feeling agreeing with this to a large extent, but I also think the role of specific religious beliefs might be underplayed a bit. At the author seems to allude to it in the last paragraph, I think:\n \n&gt; It is possible, in principle, to modify the perceived authenticity and sharedness of such experiences through subtle interventions, at both an interpersonal and population level. Not only politicians, educators, and other public figures, but crucially also parents, religious groups, and their leaders could play a role in the process. But that will only be possible if we are all better informed about the real causes of violent intergroup conflict. In the end, science-driven approaches are likely to do far more than censorship and anti-Islamist rhetoric to stem the tide of radicalization, and to defuse those already committed to extreme pro-group action.\n \nIf religious groups, leaders, and.. I assume arguments can be used to make the degree of fusion less, surely it can be used to make fusion stronger. What comes to mind first is: if you identify a lot with the people at your local mosque and are told \"all Muslims are your brothers, more than non-Muslim family members\", then I think it would be more likely that this can have a positive effect on the degree with fusion towards Muslims in general.\n \nWhat are your thoughts on this?",
        "created_utc": 1465567035,
        "upvote_ratio": ""
    },
    {
        "title": "Do you have faith in Science and Scientists?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4nc0zp/do_you_have_faith_in_science_and_scientists/",
        "text": "[deleted]",
        "created_utc": 1465495076,
        "upvote_ratio": ""
    },
    {
        "title": "How can atheism be passed down from generation to generation while keeping morality without belief in a religion?",
        "author": "quadrant6",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4nbs6e/how_can_atheism_be_passed_down_from_generation_to/",
        "text": "This question has been bothering me for a few days.  I've been an atheist for a few years, growing up agnostic and religiously skeptical - my parents were both raised Southern baptist but did not enforce religion on me growing up (at least not that much).\n\nIf as a child you have caring moralistic parents, you're raised with the same morals yourself.  But if the morals have no religious basis, what do we base them on?  There would be obvious ones, such as no murdering, no hurting of each other overall - including physical, emotional, etc.   I suppose morals can be based from government laws as well as a basic understanding of cause/effect.  I may have just answered my own question, but regardless, I am planning on being a father relatively soon, and would like more input on how morals work.\n\nEDIT: Thanks for all the feedback.  This question was sparked by a video I recently watched: https://www.youtube.com/watch?v=ynJwvv7wlFc  It made me question where morality originates from, but after re-watching, realized the preacher/speaker didn't make much sense and tiptoed around the question, meanwhile the atheist asking the question didn't have a good straight answer for his basis for morality.",
        "created_utc": 1465492033,
        "upvote_ratio": ""
    },
    {
        "title": "They said There is God and how come the existence of us and also the universe.",
        "author": "Ritagajah",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4n9dud/they_said_there_is_god_and_how_come_the_existence/",
        "text": "[removed]",
        "created_utc": 1465449529,
        "upvote_ratio": ""
    },
    {
        "title": "Cuckolding is the ultimate expression of atheism. Hear me out...",
        "author": "gayveganatheist",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4n31bg/cuckolding_is_the_ultimate_expression_of_atheism/",
        "text": "[removed]",
        "created_utc": 1465356142,
        "upvote_ratio": ""
    },
    {
        "title": "Can a public college in Southern California make christian literature as part of the curriculum for a mandatory English course?",
        "author": "oglopez",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4n1vcm/can_a_public_college_in_southern_california_make/",
        "text": "Hello, I am not sure if this question goes here, but I didn't know where else to turn to. I am currently attending a public community college. I need to take a critical thinking English course to transfer to my 4-year university to study computer engineering. One of the books that is mandatory for me to read and analyze is Wayne Dyer's Wishes Fulfilled. I didn't think it would be so bad, but the amount of assertions and bad logic that I encounter in the book are so infuriating. The material is marinated with Christian/ Mystic babbel. I don't know if I should approach my professor about it. I think our professor actually wants us to learn from this mediocre self-help book. I really don't know what to do. Maybe I'm just being a big baby. Is it constitutional to make us take this book seriously?",
        "created_utc": 1465340165,
        "upvote_ratio": ""
    },
    {
        "title": "A sad attempt at discrediting Christianity, the wrong way to discuss religion, cringeworthy link inside",
        "author": "frostmuncher",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4n0g90/a_sad_attempt_at_discrediting_christianity_the/",
        "text": "[removed]",
        "created_utc": 1465323440,
        "upvote_ratio": ""
    },
    {
        "title": "A sad attempt at discrediting Christianity, the wrong way to discuss religion, cringeworthy link inside",
        "author": "frostmuncher",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4n0dzi/a_sad_attempt_at_discrediting_christianity_the/",
        "text": "[removed]",
        "created_utc": 1465322785,
        "upvote_ratio": ""
    },
    {
        "title": "CMV: David Silverman is a detriment to our causes.",
        "author": "criticalcontext",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4mzbsp/cmv_david_silverman_is_a_detriment_to_our_causes/",
        "text": "David Silverman does a lot of work for the atheist movement, and he ~~appeals to a certain reactionary, attention seeking~~ (EDIT: I apologize for this, by attention seeking I was meaning media attention, but that does not condone the insult) sect of our diverse crowd. I have not read his book Fighting God, but I have seen him live in person twice giving lectures on it's principles. He's also doing the Ark Park protest in my state. I praise him for his willingness to work, and don't critique him for taking action, just on some of what he says, and also his general persona:\n\nPersonally, I think his attitudes on the word atheist are naive, dogmatic, and also don't solve the problems we need to focus on. My group at home have many \"atheist X\" members, such as atheistic satanists, atheistic wiccans, atheistic Christians, atheistic Jews, atheistic agnostics, atheistic humanists, atheistic spiritualists, atheistic buddhists, atheistic skeptics, atheistic hindu's, atheistic pseudo-science nuts, atheistic radicals (of any political persuasion), atheistic pastafarians, atheistic pagans, you get what I mean. Atheism is a great term to say \"I don't believe what my majority local religion believes\" but it does NOTHING to say \"I don't believe in the things that CAUSE the problems that my local majority religion propagates.\" IMO, **the problems of religion comes from dogmatic anti-skepticism, not their belief in skydaddy, skydaddy is a symptom**, and thus David Silverman's proposal is like trying to cure cancer by wearing a shirt supporting lung cancer, and then telling everyone else who wants to cure cancer \"you need to get on board.\" \n\nI am a skeptic. I am an atheistic skeptic. But my skepticism is more important, more pure, more virtuous, and more descriptive of me, than atheism. Atheism is a label Christians give me. Skepticism is my label.\n\nAs for his tone, I find him very impersonal, I think his knowledge of those he's attacking is off-base, and recently he seems to fancy himself a statistician, which IMO is laughable.\n\n**EDIT:** Academic Definitions of Religion: Emile Durkheim\n\"a unified system of beliefs and practices relative to sacred things, that is to say, things set apart and forbidden -- beliefs and practices which unite into one single moral community called a Church all those who adhere to them.\"\n\nWilliam James - \"The very fact that they are so many and so different from one another is enough to prove that the word 'religion' cannot stand for any single principle or essence, but is rather a collective name.\"\n\n**EDIT 2:** A list of links for atheistic religions:\nhttps://en.wikipedia.org/wiki/Christian_atheism http://www.patheos.com/blogs/camelswithhammers/2012/01/atheistic-wicca/ http://semrys.blogspot.com/2012/12/pagan-atheists-yes-we-exist.html https://en.wikipedia.org/wiki/Atheism_in_Hinduism\ndisbelief in God or gods has been a historically propounded viewpoint in many of the orthodox and heterodox streams of Hindu philosophies.[1] In Indian philosophy, three schools of thought are commonly referred to as nastika for rejecting the doctrine of Vedas: Jainism, Buddhism and Crvka.\nI'll add some Jewish sects, religious Epicureanism, Buddhism, religious Pythagoreanism, Marxism, some Egyptian cults, Confucianism, Daoism, Animism, and Deism, is this really necessary? Are people this ignorant of religious history?",
        "created_utc": 1465310162,
        "upvote_ratio": ""
    },
    {
        "title": "Determinism",
        "author": "TSomaT",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4mvy6e/determinism/",
        "text": "[removed]",
        "created_utc": 1465255267,
        "upvote_ratio": ""
    },
    {
        "title": "Proof: There is no God. Therefore the Universe is Perfectly Ordered or Not.",
        "author": "michaelfrancislidman",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4mv81q/proof_there_is_no_god_therefore_the_universe_is/",
        "text": "We sense without the ability to prove all input with 100% knowledge. We forget and so have an impure memory. Therefore we are not Perfectly Ordered. Modern computers suffer the same. We do not know if this will change now.\n\nTherefore the Universe contains objects that are not Perfectly Ordered. Therefore the Universe is Random or the Universe is Perfectly Ordered to contain objects that are not Perfectly Ordered. Therefore the Universe must contain a Perfection that contains Imperfection. Therefore the Universe contains Imperfection. Therefore the Universe is Imperfect and is not Perfectly Ordered. Therefore the Universe is Not Ordered. Therefore the Universe must contain some type of Random.\n\nBut Random has a non-0 chance fitting all Ordered and all Non Ordered objects. Therefore anything in the Universe that is Ordered can be because of Random. Therefore that Random is the Universe and the Universe is that Random. Therefore the Universe is Random.\n\nBut God does not Exist. However God is said to be Always and Everywhere. But the Universe has an Always and has an Everywhere. So if God exists, God would be at every point in Space and Always Everywhere. However the Universe is Random and therefore God is Random. But God does not Exist. Therefore the Random that is the Universe does not Exist. Therefore the Universe does not Exist. Therefore the Universe that is Not Perfect does not Exist.\n\nTherefore the Universe is Perfectly Ordered. Therefore there is no God.\n\n**That was the end of the proof**. If you have read down this far without having a question in your mind that this is a proof that there is no God then you may say to the others the truth that you know that there is no God.\n\nIf you are only able to read down to one of the sentences in the proof without understanding the step by step nature of the proof, the copy and paste that sentence and explain why you are having a hard time understanding that sentence.\n\nThis is a perfect proof. So I will try to help you understand what each truth means. Once you know the step you can move on to the next sentence and repeat the process till the end when you will know there is no God.\n\nI have tried this before in r/atheism but was very dissatisfied with the lack of progress from the simple read, and copy and paste what you misunderstand till you know there is no God. The typical comment I would get reminds me of the quote \"You should do whatever it takes to live the truth, even if it means to tell a lie\".\n\nI will not lie like the members of r/atheism. This is too important. This is not about the belief that there is no God. This is a perfect truth and you will know that there is no God. This is on the same level of thought as you would have from Euclidean Geometry andor any part of Mathematics andor any part of philosophy ignoring the non-Socratic lies and week arguments that the drinking philosophers give.\n\nBe aware there is something about the mods on r/atheism that is childish and pitiful. It's like they only want to shut their ears and scream over and over that \"I DO NOT BELIEVE IN GOD!!!\"\n\nYou're welcome to find the junk of these make believe atheists yourself.  I know there is no God and I hope you are able to say that too, which you should be able to after reading the text if you have not read other proofs against the existence of God which gives you knowledge.\n\nA further sorry I have to say for those who are unwilling to know. The only way something is known is if it is TRUE and you can PROVE it. This proof I assure you, will lead to true knowledge that there is no God. ",
        "created_utc": 1465246506,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Religious Propaganda and censorship?",
        "author": "MrPeligro",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4mmlvy/thoughts_on_religious_propaganda_and_censorship/",
        "text": "[removed]",
        "created_utc": 1465116811,
        "upvote_ratio": ""
    },
    {
        "title": "What could be the origin of this biblical passage's description?",
        "author": "GuruMeditationError",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4mlg88/what_could_be_the_origin_of_this_biblical/",
        "text": "https://www.biblegateway.com/passage/?search=Numbers+12\n\nIn Numbers 12, it says that yahweh appeared in a pillar of cloud, and then most interestingly, it says that yahweh became so angry that the Miriam was left with diseased snow-white skin. That is interesting, because I know that a lot of these ancient descriptions have a basis in reality, so what do you think the physical phenomenon was that caused a 'pillar of cloud' to come over the tent, disease Miriam's skin and turn it snow-white, and then leave the tent?",
        "created_utc": 1465092477,
        "upvote_ratio": ""
    },
    {
        "title": "I encountered an argument the other that I've never heard or read about before. Anyone have experience with this one?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4mkjv2/i_encountered_an_argument_the_other_that_ive/",
        "text": "[deleted]",
        "created_utc": 1465078858,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Advice: 2 Atheists Getting Married in the Catholic Church",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4mfwsn/looking_for_advice_2_atheists_getting_married_in/",
        "text": "I don't have a lot of people I can talk to about this dilemma so I'm literally just making this account so I can write this post. I hope this is the right subreddit for this. I tried finding similar posts online, but the ones I could find were about couples where one person is an atheist and one is Catholic. \n\nSome background: My fiance and I were both raised Catholic, have been baptised and confirmed. I became an atheist when I was in high school and it took many years before my immediate family followed suit. It wasn't until talking to me in his early 20s that my fiance became an atheist. Unlike my family, his family is VERRRY Catholic. Don't get me wrong, his family is super duper nice, and I couldn't ask for better in-laws, but if they knew our religious beliefs or lack thereof they might implode. Oh, and we became members of a church already because of the following dilemma...\n\nThe dilemma: We are engaged to be married and it's awesome because I want to spend the rest of my life with this man. I don't have strong opinions about our ceremony and neither does he, but obviously his family does. It was assumed we'd get married in a Catholic church, and now the ball is rolling. I'm not psyched about having a Catholic ceremony, but his parents are. I don't want to turn our wedding into a family feud, so I'm willing to go along with this. The problem is, there are some things I'm not willing to compromise on and it's hard to find information about the Catholic engagement process online for people in our situation. \n\nWe already went to the all day retreat about natural family planning where it was easy to slip under the radar. However, I've heard we must meet with a priest and a married couple who will ask us questions to make sure we can get married. I've heard things like couples having to sign a purity agreement, having to lie about living together (which we do - that was a fun when his parents found out), having to promise to raise future kids in the church, etc. These are things I'd rather not do. So my question is, on a scale from \"We're atheists, but doing this to please our parents\" to \"We love god and worship daily from our separate apartments\" what do we need to say to the priest to get through these hoops? Will a priest be understanding if we explain how important this is to his family/how honest can we get? I'd really rather not go through this whole process lying all the time.\n\nTl;dr: An atheist couple getting married in the Catholic church to please family looking for advice on how to jump through all these hoops as honestly as possible. ",
        "created_utc": 1464999816,
        "upvote_ratio": ""
    },
    {
        "title": "So I just came out to my wife....sort of. Also, getting over nerves?",
        "author": "sarastic_fool",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4m9uyx/so_i_just_came_out_to_my_wifesort_of_also_getting/",
        "text": "So this happened - due to [long story redacted], my wife asked me if I was an Atheist.  \n\nNow, bear in mind that we have been going to a nondenominational Christian church, which definitively has fundamental leanings - my wife believes that the bible is The Truth, and we've had previous ~~arguments~~ discussions regarding things like evolution and creation vs. big bang, and so on.  \n\nNow - to be honest, I didn't say \"yes\" - I said that I'm having a crisis of faith, which I felt would give her the idea while not burning bridges.\n\nTo my relief, she didn't cry or storm out or anything, and we ended up having a couple of conversations about what I feel and so on.  I waffled and hedged, because I feel guilty enough as it is - we got married and had kids assuming that we'd be on the same page with religion, and now I'm totally undermining that, so I've got a healthy dose of guilt about that.\n\nHere is my question, for anyone who has gone through this - I'm really uncomfortable and nervous having these conversations, and it makes formulating responses to what she's saying difficult at times.  Have you dealt with this, and do you know how to get over it?  Also, any tips on things that worked to mollify or help keep you and your SO together?  I love my wife dearly and don't want this to ruin things between us, but I'm literally at the end of my rope with going along with some of these belief systems.",
        "created_utc": 1464907710,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of my arguments against the fine tuning argument?",
        "author": "jday03",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4m5sfw/what_do_you_think_of_my_arguments_against_the/",
        "text": "Do I make sense and are my points sound?\n\nI responded to this link: https://www.youtube.com/watch?v=UjGPHF5A6Po&amp;feature=share\n\nHello!\n\nI watched the video, and felt like thinking about it for a bit. Ive dealt with other arguments for theism recently, but I havent had the time to think a lot about the fine tuning argument. I wrote a lot about my thoughts on this topic below, and am still formulating my thoughts and arguments on the topic. Let me know what you think. \n\nTheres definitely a lot of ideas expressed in the video, but one of the main ideas is the fine tuning argument that has been discussed by many apologists and has been debated many times. \n\nEssentially, one of his points (if I am understanding this correctly) is that the constants in our world are so precise (meaning that if they are different then the universe wouldn't exist) that the best explanation is through God. \n\n1) The universe simply is, it isnt particularly something we can change, and we cant really correctly reason out how the universe would be if the laws were different. All the scientific laws and discoveries (and constants) come from experiments about the universe we have. Changing the universe from what it is to something else would obviously result in something that is not our universe, which we should not look at it relative to our universe. Yes, if the 4 forces outlined were different the universe would be different or even non existent, but there are sets of laws out there that could warrant a universe with different characteristics that could merit something we would call 'life'.The main ideas of the argument emphasize comparing this universe to another one, which is not a good methodology to take because a different universe will, in fact, be completely different and should be measured on its own, just like we did. We dont know other universes. \n\n2) The argument essentially argues that because the world around us is existing in this way, we it must be that the universe was made for us. The main focus of the argument from Prager University is on the universe being shaped for us, and rejects the notion that we adapted to the universe. By looking at the way things happened to come about, one could assume that it came about by some intelligent order, but at the same time that would be to put the cart before the horse. The universe existed before we did. Evolution is another important idea to my argument, but I am not sure whether you believe in it. Most Christians do believe, however, in some sort of adaptation process that occurs over time across generations referred to as micro evolution. This supports the idea that organisms adapt to their environment. Only recently with humans have we seen humans changing the environment to suit themselves, but they arent actually changing the laws of physics in this endeavor. \n\nAnother concept he shared was the idea that if constants relating to the Earth were changed, we would not have life on Earth. There are some things I would say to that as well:\n\n3) As with point 1, the argument presumes that life only works the way we see it. In reality, there is the possibility in the gigantic expanse of the universe that other types of living creatures exist that rely on things differently than we do. Humans are well adapted for Earth's conditions, and we live according to the way Earth works. On other planets, conditions might be different that would lead to different life forms that have different ways of living. As with point 1, it is not a good idea to judge the possibility for something we might call life by relating it to the conditions that humans live in today. It is possible that if the Earth were under different conditions different life forms would come to be. \n\n4) Our perspective is only ours. We see everything directly around us, but dont know everything in the universe, nor do we know what happened before us. Because we are conscious beings here, and we have not found life on other planets yet, we presume we are somehow special. This obviously relies on whether or not you believe in God but, it seems as if we are trying to focus the interpretation of the cosmos on ourselves. Its as if we are looking at a map wondering why the rivers just happened to flow on map boundaries instead of why map boundaries were put on the rivers. \n\n5) Humans have an inherent desire to create meaning in the universe, and to find patterns that are not actually there. Many people take events that have no correlation and attempt to create meaning from them. Once we have been told to look for something, we will find it in the world. I believe that this is one of the ways in which people attempt to find meaning in the universe. The argument attempts to make us feel as if we are somehow special for things turning out this way, but I think that the events simply happened to come about this way, and didnt happen that way. We ascribe importance to it because it appeals to our sense of what is reasonable and what is not and is also the only thing we can look at. There isnt anything to measure this universe against exactly. Therefore, the finetuning argument is an attempt to create meaning out of things that are not meaningful. \n\nSome links: \n\nWhy people are drawn to find meaning in things that dont have meaning:\nhttps://www.ted.com/.../michael_shermer_the_pattern...\n\nA refutation of the fine tuning argument: \nhttps://www.youtube.com/watch?v=kDj1PzP_D1Q\n\nI think its also important to look at the first comment, as he points out how Prager University used a quote out of context for their advantage. \n\nedit: changed Hello (name)! to Hello!",
        "created_utc": 1464847330,
        "upvote_ratio": ""
    },
    {
        "title": "Is it irrational for an atheist (me) to believe that there was a first human after all?",
        "author": "Aoea",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4m29oe/is_it_irrational_for_an_atheist_me_to_believe/",
        "text": "[removed]",
        "created_utc": 1464800395,
        "upvote_ratio": ""
    },
    {
        "title": "Question. Why are you going or not going to the Reason Rally this weekend?",
        "author": "Tindola",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4m1x1r/question_why_are_you_going_or_not_going_to_the/",
        "text": "I'm just wondering what people's thoughts about this weekends event is and why you you made the decision to go and what you hope to get out of it. Or, on the other hand, why did you decided to not go (NO JUDGING!!!)\n\nhttp://reasonrally.org/about/\n\nEdit: So far, it definitely seems like travel is the main reason for people not being able to make it\n\nEdit 2: are those of you who can't make it going to try to access the live stream?\n\nEdit 3: So far it seems that this Rally isn't generating a ton of interest. What would be some of your recommendations to make this a more worth while event? I know one argument against rallies like this are that \"why fight for a belief in nothing\" I don't think we are rallying for a lack of belief, but we are rallying AGAINST religious privilege. ",
        "created_utc": 1464796230,
        "upvote_ratio": ""
    },
    {
        "title": "Just a little thought provoking concept",
        "author": "RetroRockLive",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4lywcj/just_a_little_thought_provoking_concept/",
        "text": "[removed]",
        "created_utc": 1464746558,
        "upvote_ratio": ""
    },
    {
        "title": "A story of a weird run-in and question",
        "author": "klkelly13",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4lxulc/a_story_of_a_weird_runin_and_question/",
        "text": "Before I start, I have considered myself an atheist for about 6 years now and am not as angered by the religious like I used to be. \nI am a college student, and while on campus today, a lady (probably 40s) walking by stopped me with small talk and asked about the summer school classes, which I answered. Next she asks if I am religious. I tell her I am (and thought maybe she would leave me alone). She then asks if I am Christian and I reply yes again. She then goes on to ask if I will pray for her, and I tell her I absolutely will. Next, she walks over to me and says, in a dead serious tone, that she's being terrorized by three demons and thinks she is going to hell. I paused for a second, concerned and confused by all of this. She tells me God is sending her to hell because of her demons and he has made her ugly for it. She started hugging me and almost crying in my arms. This goes on for a bit. I honestly didn't know what to say. I started thinking I was being punked or there were candid cameras hiding somewhere... This is how bizzare the encounter was. I go on to reassure her that she is beautiful and that Jesus loves her unconditionally. She finally believed me, told her I'd be praying for her, and told her to have a blessed day. It was one of the strangest run-ins I've ever had with a woman. She appeared to be sober and quite visibly shaken up for a women in her 40s. I hope I handled this in the right way. \n\nHas anyone else had a weird encounter like this by someone religious? How did it go? ",
        "created_utc": 1464732627,
        "upvote_ratio": ""
    },
    {
        "title": "Do you believe that religion should be given the same status as race, gender, sexual orientation, etc. in anti-discrimination laws?",
        "author": "Atheist_Intellectual",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ltiu1/do_you_believe_that_religion_should_be_given_the/",
        "text": "On one hand, none of those things can be chosen, but beliefs are chosen by the one who holds them. And disagreeing with someone's beliefs is not discrimination. Also by giving religion this status, it makes people less likely to criticize someone for their beliefs, which goes against freedom of speech. \n\nBut on the other hand, I can see that most people are born into a religion and forced into it by their parents, so does being indoctrinated with a belief make it discriminatory to treat someone differently because they hold those believes?\n\nI feel that an acceptable compromise would be to protect religious beliefs of children under 18, but not for adults who have time to think about what they really believe. I do not believe that indoctrinating someone with a belief should mean that that belief gets a protected status, because if the belief actively brainwashes people into believing it, it deserves less credibility, not more. \n\nWhat do you think?",
        "created_utc": 1464669897,
        "upvote_ratio": ""
    },
    {
        "title": "Do you believe that religion should be given the same status as race, gender, orientation, etc when it comes to anti-discrimination laws?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4lth16/do_you_believe_that_religion_should_be_given_the/",
        "text": "[removed]",
        "created_utc": 1464669063,
        "upvote_ratio": ""
    },
    {
        "title": "A discussion about militancy and the forced spread of belief (or lack thereof)",
        "author": "coombermeister",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ljjjz/a_discussion_about_militancy_and_the_forced/",
        "text": "I'm sure we have all seen, both on and offline, attempts by people to push their beliefs into people- examples include sending your kids to church, handing out leaflets on the streets, and so on. We have all also probably seen militant and hostile reactions from people towards others who do not share their beliefs. Now here's the thing. This works both ways, used by both theists and atheists to push their beliefs and shun those of others. But is this right? If you are convinced of your belief, or lack of belief, then surely you think it would be in the interest of others to also have this belief? I know many people here will agree that we cannot really disprove the existence of a higher power, but there are people who think that we can, and hence spread their belief others, and perhaps even shove it down their throats. What do you people think? Should we preach or not? I'm personally against but i want to see what others think.",
        "created_utc": 1464505708,
        "upvote_ratio": ""
    },
    {
        "title": "Any atheists here who believe in souls? What about free will?",
        "author": "Bowbreaker",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4lhp6v/any_atheists_here_who_believe_in_souls_what_about/",
        "text": "And if so, what makes baseless religious claims about the existence of one or more deities any different from similar claims about souls or free will?",
        "created_utc": 1464471928,
        "upvote_ratio": ""
    },
    {
        "title": "Link to Dawkins' AMA from yesterday.",
        "author": "FirstUser",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4lf3if/link_to_dawkins_ama_from_yesterday/",
        "text": "[removed]",
        "created_utc": 1464425357,
        "upvote_ratio": ""
    },
    {
        "title": "If everything I know is wrong",
        "author": "derelictissimus",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4lep58/if_everything_i_know_is_wrong/",
        "text": "[removed]",
        "created_utc": 1464415307,
        "upvote_ratio": ""
    },
    {
        "title": "Dealing with a minor situation at work, would like advice",
        "author": "ethanajs",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4lcq81/dealing_with_a_minor_situation_at_work_would_like/",
        "text": "I work at a very well established funeral home and cemetery in Washington State and with Memorial Day coming up the festivities are upon us. I myself am a veteran and of course agree with the amount of effort and money that goes into making it a special weekend, but unfortunately there's something I feel strongly against. Normally, at previous locations I've worked within the company, we do the standard American flag on as many graves as we need but the cemetery I'm at now insists on pairing the flag with a cross. It's not a complex systematic flagging or crossing they just make sure that everyone with a VA marker or some kind of military relation gets a flag but with the flag also comes with a cross, regardless of whether there's any religious notation on their marker as well. \n\nThat's what is really grinding my gears. \n\nMy immediate manager is also an atheist so she completly understands my point but the two other managers (one being her boss) are diehard Christians. (They're no strangers to literally singing and strumming religious hymns in their office during the workday). And as most of you can guess more than half of the staff identifies as Christian and wouldn't see anything wrong with every grave having a cross. \n\nAnyways I feel like I'm rambling but we as a location serve A LOT of different faiths very frequently other than your standard Christian and of course plenty of non-religious and I can't believe they're totally fine with putting a cross on every grave that gets a flag. If I had a loved one buried here that was an Atheist or even Muslim or Jewish, I'd be furious!\n\nYou think I should say anything? I'm on really good terms with all of my managers but at the end of the day it feels like the \"good ol' boys\" club with the exception of my closest manager.",
        "created_utc": 1464381828,
        "upvote_ratio": ""
    },
    {
        "title": "Girlfriend is essentially a Wiccan..help?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4lb2ss/girlfriend_is_essentially_a_wiccanhelp/",
        "text": "[deleted]",
        "created_utc": 1464360707,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism as a title?",
        "author": "JustJamesEdwards",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4lacbb/atheism_as_a_title/",
        "text": "Im not sure if this a relatable issue to most but i struggle with the title of 'Atheist' when ever asked of my beliefs.\nIn my eyes its understandable to call someone what they are when it comes to religion, like a christians a christian and so forth.\nBut to be called an atheist i will admit annoys me as i feel this only a word created by the religious to give to those weird non believers, ill agree with someone if it makes them happy and say im atheist but i prefer human being other than a religious non religious label.   ",
        "created_utc": 1464349195,
        "upvote_ratio": ""
    },
    {
        "title": "In the Bible, the Book of Revelation seems to talk about our impending future, however the events described seem to still take place in the bronze age.",
        "author": "yusbarrett",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4l7kkp/in_the_bible_the_book_of_revelation_seems_to_talk/",
        "text": "[removed]",
        "created_utc": 1464297590,
        "upvote_ratio": ""
    },
    {
        "title": "I recently moved back in with my very religious parents for the summer. I just need to get something off my chest.",
        "author": "PinusStrobus2k16",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4l71xu/i_recently_moved_back_in_with_my_very_religious/",
        "text": "My parents are not bad people. They are not malicious. They don't wish harm on others. They don't take pleasure in human suffering. Over my life, they have done their absolute best to raise me. They have provided me with a lot of opportunities, and even if they didn't always understand them, they supported me as I pursued  my life goals. I have no doubt in my mind that they love me. \n\nMy parents believe with all their heart in the Bible. They are extremely committed Southern Baptists. They believe everything in the Bible literally happened. They believe in salvation through Christ alone, the total depravity of mankind without God, eternal life with God after death, and- Who could forget?- Complete, eternal, horrific punishment in Hell for those who do not believe. Forever and ever Amen.\n\nMy parents don't know I'm not at all religious anymore. I haven't told them. They might suspect I've \"backslid-en\" in my faith, but nothing so unimaginable as the malignant specter of Atheism. How could they? It would of course mean that I could never be truly happy here on Earth. Without the Holy Spirit's guidance I'd float through life un-tethered, unfulfilled. Not to mention, how could a person ever make it through the day without the the support of Jesus Christ (our eternal Lord and Savior)? Worst of all, though, hell. Hell. Forever. No hope. Torture. Pain. Suffering. Wailing and Gnashing of teeth and so on.\n\nPeople like to say sometimes that Atheist are just angry at God. I'm not angry at God. I have no reason to believe he exists. I'm angry because I don't believe it is possible to have a healthy, normal relationship with my parents under all of those beliefs.",
        "created_utc": 1464291140,
        "upvote_ratio": ""
    },
    {
        "title": "Ecclesiastes: The best book of the Bible",
        "author": "crediblehulk83",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4l6f3d/ecclesiastes_the_best_book_of_the_bible/",
        "text": "[removed]",
        "created_utc": 1464283399,
        "upvote_ratio": ""
    },
    {
        "title": "Is there anything that could reverse the movement away from religion?",
        "author": "CaptainChopstcks",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4l35cn/is_there_anything_that_could_reverse_the_movement/",
        "text": "Generally speaking, religion has been diminishing in the developed countries for something like a hundred years now.\n\nFor example, this week we see this article -\n\n\\- http://www.theguardian.com/world/2016/may/23/no-religion-outnumber-christians-england-wales-study \n\n&gt;The number of people who say they have no religion is rapidly escalating and significantly outweighs the Christian population in England and Wales, according to new analysis.\n\n&gt;The proportion of the population who identify as having no religion - referred to as \"nones\" - reached 48.5% in 2014, almost double the figure of 25% in the 2011 census. Those who define themselves as Christian - Anglicans, Catholics and other denominations - made up 43.8% of the population. ...\n\n&gt;The new analysis will fuel concern among Christian leaders about growing indifference to organised religion. This year the Church of England said it expected attendance to continue to fall for another 30 years as its congregations age and the millennial generation spurns the institutions of faith. ...\n\nAnd whenever we see an article like this, it usually includes a quote from some representative of religion saying\n\n*\"Guys, we're in real trouble here.* \n\n*\"We need to* ***do something about this.\"***\n\n&gt;**\"Churches need to take this kind of data very seriously,\"** said [researcher] Bullivant. **\"When analysing data you see patterns that you might not necessarily notice otherwise. This can flag up areas for further research or groups that need particular pastoral attention.\"**\n\nBut the problem that religions have is that their ideas are not only almost certainly wrong, but fundamentally unjustifiable - even if religious ideas should really turn out to be true, they've never been able to find any way to *show* that their ideas are really true. \n\nThus we can confidently expect that in developed countries, the percentage of religious believers is going to continue to decline, and there isn't really much that religions can do about that.\n\n. \n\nSo here's my question:\n\n***Is*** **there really anything that religions in developed countries can do about that?**\n\nIf I get in a time machine and hop ahead to 2116, is there any possibility that I'll read about the transformation that happened in the mid-21st century, \n\nresulting in a dramatic increase in the percentage of religious believers?\n\n**What if anything would religions in developed countries realistically be able to do to significantly increase the numbers of their believers over the next few decades?\"**\n\n(I'm asking this here because I'm anti-religion and I want the numbers of religious to decrease, \n\nso if the churches have any \"secret weapon\" [psychological, sociological, apologetic, whatever] that they can use to prevent that from happening, \n\nthen I want to know what that \"secret weapon\" might be so that I can help work against it.)  \n\n.\n\n(I'm trying to get serious responses here if possible, not witticisms or wild guesses about things that \"might\" happen, but almost certainly won't.)\n\n\n\n\n\n",
        "created_utc": 1464228717,
        "upvote_ratio": ""
    },
    {
        "title": "Christian: You need the Holy Spirit and you'll know God is real!",
        "author": "simplism4",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4l1xco/christian_you_need_the_holy_spirit_and_youll_know/",
        "text": "When I land into a debate/discussion with a Christian (Atheist myself), mostly Protestants (Free Reformed, Dutch), they most of the time respond with something along the lines of:\n\n&gt;\"You just don't have the Holy Spirit in you, so you can't see and experience God, he only reveals Himself to people who are open for it and have the Holy Spirit, then you will KNOW he is real, it's the best evidence.\"\n\nIf I respond with that I actually used to pray a lot for the Holy Spirit to be in me and that God would reveal himself to me, they usually will say something along the lines of\n\n&gt;\"You don't really want it, even if you think you do, you're blocking it in some way, you have to drop your ego and fully surrender yourself to the Lord, be open for it!\"\n\nand they will ask me to try it again, maybe I wasn't ready before. They can use it as a loop, that every time you talk about it, they will just say: \n\n&gt;\"Well, see, you're not believing, so you're blocking it, of course you won't experience God! You're already saying you don't believe anymore, you're not even praying for the Holy Spirit anymore and you're not open for it.\"* (this sentence is not exactly what someone said, but something like this)\n\nNow when I ask how they 'see'/experience God, they often say that it's unexplainable, you'll just know. (they'll always stay vague what it exactly is)\n\n**What are your thoughts on this? And how would you respond to something like this? Is this argument an argument you can never rebute (if rebute is the right word for this) or respond to properly because it's vague and impossible to prove/disprove?**\n\nEDIT: thanks for all the responses, didn't expect so many, I'm trying to read them all. Now I got several great ways to respond to this I didnt think of before and that may show a Christian I talk to realize it isnt such a strong argument as he/she thinks it is and it may sow a seed of doubt",
        "created_utc": 1464211023,
        "upvote_ratio": ""
    },
    {
        "title": "Bart Ehrman: There's more to truth than historical Truth.",
        "author": "MrPeligro",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4ky6l3/bart_ehrman_theres_more_to_truth_than_historical/",
        "text": "https://youtu.be/wNIyyoRPbLM?t=1183\n\nWhat are your thoughts? Do you agree? I find bart ehrman's view of Christianity too liberal. He and the host are  correct in saying that exodus was important to the civil rights movement. The parallel is strong. I remember watching speeches about Malcolm x and  MLK, Jr and being moved by the parallel.\n\nOn the other side of the coin, Bart forgets all the bad religion has done. I guess the crosses the KKK happened to be burning were all year round decorations for their new urban neighbors. Agendas, wars, evil waged on people by people that held sincere religious belief.\n\nWe can talk about exodus being this fanciful story for liberation and independence and that's all fine and dandy, but what about the tyrant that wants to dominate the world and references the domination of  the Canaan city states in the book of Joshua? Is that important to historical truth or not? These are people that hold sincere beliefs. I think he's doing too much of a disservice just waxing over it like its not a big concern.\n\nI find myself in the middle. I agree we can take on personal truths from the bible and cultural truths, but we really don't need to value it as much as Ehrman is suggesting We take all the good we can and forget the bad. If he's suggesting that, I think that's nonsense.",
        "created_utc": 1464154768,
        "upvote_ratio": ""
    },
    {
        "title": "This album sticks to me as an atheist. It helps me comprehend and appreciate the idea of mortality. If you like progressive rock I recommend you listen to the concept album \"Still Life\" by \"Van Der Graaf Generator\" (link and lyrics in comments).",
        "author": "bassshred",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4kxlsz/this_album_sticks_to_me_as_an_atheist_it_helps_me/",
        "text": "[removed]",
        "created_utc": 1464144976,
        "upvote_ratio": ""
    },
    {
        "title": "Why do you think Christians are so against \"living life to the fullest\"?",
        "author": "SicSemperTyrannis123",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4kw9me/why_do_you_think_christians_are_so_against_living/",
        "text": "I'm a christian and i'm wanting some input because seriously I posted on facebook that I changed my perspectives, I used debate politics, debate religion, I used to argue with mormons to try to change their beliefs, now I came to a realization that I should stop. Maybe it's even God speaking but honestly after starting to like this one girl and thinking about my life I realized I pushed a lot of potential friends away, I annoyed people, even made like mormons sad because of my actions, yet they're STILL mormon. I realized I should just let people do what they want and I think it's important to just focus on yourself and improve yourself. So, I said something similar to that and my christian friends basically told me that \"this world isn't for our pleasure\" and stuff like that. In my head I'm thinking God, if truly loving and all knowing, he'll understand. But then i'd get a \"jesus came with sword\" etc. \n\nI just don't get it. I understand not doing hard drugs etc like some people I know and living the way I used to with just drinking &amp; smoking every night but living the way most christians want literally makes me want to be done with life. I know Jesus didn't promise happiness but is it REALLY God if your mindset is anger, stress and sadness? Whereas, now I feel much more free and motivated, still depressed about somethings but I even still I get christian friends saying stuff like \"this generation just wants__\" or some bullcrap about leftism being bad or whatever and I'm apparently now the bad guy for realizing this stuff is only temporary, even debating politics i'm done with because none of it makes me happy. \n\nMaybe i'm just rambling but basically why do you think so? I know why christians think so from a biblical perspective but there HAS to be something more. I could NEVER tell someone to NOT try to improve themselves, especially if they're already experiencing troubles. It's like they want me to be content with having a shitty life and yet even when I pray and do what they tell me, I return with my SAME answer but somehow it's still wrong.",
        "created_utc": 1464126290,
        "upvote_ratio": ""
    },
    {
        "title": "Here's proof of Gods existence!!",
        "author": "Ffddar",
        "url": "https://www.reddit.com/r/TrueAtheism/comments/4krw88/heres_proof_of_gods_existence/",
        "text": "[removed]",
        "created_utc": 1464060513,
        "upvote_ratio": ""
    }
]