[
    {
        "title": "Is it bad that I don't like to take huge risks when driving?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7tp7x7/is_it_bad_that_i_dont_like_to_take_huge_risks/",
        "text": "[removed]",
        "created_utc": 1517193609,
        "upvote_ratio": ""
    },
    {
        "title": "What are the upsides to being unattractive?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7tot5j/what_are_the_upsides_to_being_unattractive/",
        "text": "[removed]",
        "created_utc": 1517189411,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever switched doctors in a hospital setting? Did it help or harm you? How'd you come to the decision to switch?",
        "author": "Zygomaticus",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7tmi9y/have_you_ever_switched_doctors_in_a_hospital/",
        "text": "My friend switched doctors in hospital and it saved her life. He wouldn't hear her complaints about her surgery wounds being infected and sent her home. She became septic and had to return as an emergency.\n\nAnyway it got me thinking....how do you know the difference between a shitty doctor and the best of a bad situation? What if switching moved you from a great doctor handling it well (even though it doesn't feel like it) to a shit one who can't and it gets worse?\n\nHow do you request it? What if the doctor gets upet or refuses? What if they say he's all they have (true or not)?\n\nI don't know if I'd know how to identify when to switch so I'd like to hear your stories please :).",
        "created_utc": 1517168368,
        "upvote_ratio": ""
    },
    {
        "title": "It is well known that taking too many oral antibiotics can be a problem. Can overusing topical antibiotics also lead to problems?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7tj2qb/it_is_well_known_that_taking_too_many_oral/",
        "text": "[deleted]",
        "created_utc": 1517126824,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible that ritual abuse did exist and continues to?",
        "author": "sk8ing-mongo-kills",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7tj1w1/is_it_possible_that_ritual_abuse_did_exist_and/",
        "text": "[removed]",
        "created_utc": 1517126418,
        "upvote_ratio": ""
    },
    {
        "title": "What’s the science behind glossolalia?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7thuxf/whats_the_science_behind_glossolalia/",
        "text": "[removed]",
        "created_utc": 1517110451,
        "upvote_ratio": ""
    },
    {
        "title": "How can Western Society improve from a lack of community connection and increase in isolation?",
        "author": "itsmassive",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7ths3e/how_can_western_society_improve_from_a_lack_of/",
        "text": "Everyone knows that compared to other places in the world, Western society is and is moving even more towards less and less connection to those around them. For many reasons like culture, technology, etc.\n\nFirst of all, is this a bad thing? If so, how do we change this and improve the situation?\n\nIt seems like in other cultures, few are very lonely, have no friends or are shy because their whole lives they have lived amongst so many people, always in school, playing sports together, hanging out at town square etc, even at home they are in houses with many siblings and generations.\n\nIn Western society, people often grow up beside others and not with them. Then eventually the only people they talk to are coworkers for the most part or a significant other. Even throughout almost all of human history, we were in tribes and highly connected, never alone, always talking to eachother.\n\nSo is this a problem and how do we improve?",
        "created_utc": 1517109497,
        "upvote_ratio": ""
    },
    {
        "title": "What would it take to have a revival of strong, uncorrupted workers unions in the US?",
        "author": "mostlyemptyspace",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7th30v/what_would_it_take_to_have_a_revival_of_strong/",
        "text": "So this country is fucked for the working class. The last time this happened in the late 1800’s, the unions were the answer. Then they became bloated and corrupted, and Reagan came along and busted them. Then we had globalization take away any shred of decent blue collar work in this country. Now we have a new generation of Robber Barons, and the working class is suffering.\n\nWhat would it take for workers to unionize again, and have strong bargaining power? What are the biggest challenges to overcome? How could it be done without corruption or the mob taking over?",
        "created_utc": 1517101783,
        "upvote_ratio": ""
    },
    {
        "title": "I'm an Iranian atheist. Why in the name of hell am I still considered to be a \"Muslim\" in Western countries?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7tcxbo/im_an_iranian_atheist_why_in_the_name_of_hell_am/",
        "text": "[removed]",
        "created_utc": 1517062678,
        "upvote_ratio": ""
    },
    {
        "title": "What's wrong with unpaid intern doing menial tasks?",
        "author": "BeatriceBernardo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7tc6g9/whats_wrong_with_unpaid_intern_doing_menial_tasks/",
        "text": "[removed]",
        "created_utc": 1517051914,
        "upvote_ratio": ""
    },
    {
        "title": "Need expertise",
        "author": "jamrae11",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7tbk3n/need_expertise/",
        "text": "[removed]",
        "created_utc": 1517041760,
        "upvote_ratio": ""
    },
    {
        "title": "How do people rupture their spleen from falling?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7t8ofc/how_do_people_rupture_their_spleen_from_falling/",
        "text": "[removed]",
        "created_utc": 1517009676,
        "upvote_ratio": ""
    },
    {
        "title": "Is there anything significant that I, a no-name shmuck with a 9-5 to worry about, can do to help the drought in Cape Town? Any international organizations that have solid track records and put donations to good use?",
        "author": "whatsaphoto",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7t56tl/is_there_anything_significant_that_i_a_noname/",
        "text": "[removed]",
        "created_utc": 1516980239,
        "upvote_ratio": ""
    },
    {
        "title": "What does \"being an adult\" entail in your location and culture in 2017?",
        "author": "kitroot",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7t382z/what_does_being_an_adult_entail_in_your_location/",
        "text": "Edit: 2018, I was living in the past",
        "created_utc": 1516954684,
        "upvote_ratio": ""
    },
    {
        "title": "How would you prevent the 9/11 attacks? (following these guidelines)",
        "author": "evil_mind",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7t1rnx/how_would_you_prevent_the_911_attacks_following/",
        "text": "I want to know how you guys would do this? Now while I know this question has been posted before, I want to do things a little different. Every time this question is posted about traveling in time and trying to stop 9/11 the answers have been a bit shallow. I would love to hear more in depth scenarios that you can come up with by following these set of guidelines myself and a few friends of mine came up with. \n\nWe were bouncing a few ideas around and we decided that the preventing 9/11 challenge kinda requires a set of guidelines for the person trying to figure out how to stop it. We tried to come up with ideas that would prevent 9/11 without having to sacrifice your own safety or freedom. As many people have pointed out, if you go to the FBI on 9/10/2001 or even a few days before you could end up in Guantanamo or who knows. Maybe they take you seriously or maybe not. I think the more you try to try to prevent 9/11 by contacting authorities the harder it becomes.\n\nThe challenge Im presenting here is to come up with solutions that would completely prevent the 9/11 attacks, not delay or just save the tower victims by calling a bomb threat. Im asking for solutions to totally prevent the attacks from happening but also hopefully preventing other attacks by showing the press what could have happened thus creating the awareness. \n\nI don’t want to get into conspiracy theories or the Iraq war which followed the attacks. Lets just take everything at face value. The attacks were performed by the 19 terrorist here in America and all financed by Bin laden and al qaeda. Nothing more nothing less, no controlled explosions or missiles to the pentagon please.\n\nRemember try to keep in mind that you want to prevent the attacks yet remain free. Some people say they would travel back and murder Bin Laden or other terrorist when they were younger. I say while yes this is possible you don’t know if that would totally work and you mean to tell me you would travel to the middle east and murder an innocent person (at the time) and get away with it? without risking your own death or lengthy prison sentence? this is what I mean. I would love to hear realistic solutions that hopefully don’t involve you risking major jail time by committing murder of any kind.\n\nLike I mentioned before, the best way to get a set of really good solutions is to present this challenge with a set of guidelines. We came up with a pretty solid plan on how to execute the prevention of 9/11 yet remain free and clear. I would love to hear yours and then I’ll post what we came up with.\n\n**Here are the guidelines:**\n\n**Time Travel:**\nWe are going to follow Terminator movies time travel rules with a few exceptions. It is still a one way trip, you will not be able to return this timeline so it is a sacrificial mission in that sense. Unlike the movies we will allow for you to bring back a few items. No machines or smart phones or newspapers or anything like that just these items:\n\n* -$1000.00 dollars in cash in period correct money\n* -A note book of plain white paper with just your handwriting\n* -Your new ID (more on this shortly)\n* -The clothes you are wearing (no need to beat up a gang member for his clothes when you arrive)\n\nYou will be in the United States when you time travel. You can choose any state if that matters to you. Now you can choose to travel any time up to 10 years before 9/11/01 all the way up to the night before. You choose when you go, a month before? two years before? up to 10 years so 9/11/91 is the earliest you can travel to.\n\n**Identification:**\nAs stated in the first guideline you will have ID when you go back. This ID is of your new profile. You will have a social security number and a history which you will learn about before you go back in time. You will not have any friends or family when you go back. This is a completely solo mission. This ID makes it so you’re a legit person not some clandestine figure. \n\n**Prep time:**\nYou will be given a week to prepare in the present time. You can use your notebook you will take back to write any information you may need. You do your own research of whatever you want that you think will help you prevent the attacks. You also only have access to information that is available to the general public nothing top secret or anything like that.\n\n\nThat is it guys, choose your date of arrival and prevent 9/11. Would love to hear what you come up with and then we can compare realistic plans.\n",
        "created_utc": 1516936297,
        "upvote_ratio": ""
    },
    {
        "title": "Has there been another time in modern history where taxes were cut for corporations and they gave employees bonuses?",
        "author": "thehighepopt",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7t10k8/has_there_been_another_time_in_modern_history/",
        "text": "TL;DR is this a conspiracy?\n\nI don't recall ever an action where corporations gave employees bonuses after the Legislative branch cut taxes.  Especially given current-day absolute need to prop up shareholder value, isn't it more likely corps would throw the loot on the pile in their dragon lair rather than give it to the villagers?  \n\nIt just seems like collusion to put on a show, in support of the current regime, of giving the rubes a pittance so they think the new tax law is wonderful. Because, come on, if the government and corporations all love it, that means the rest of us are getting screwed.",
        "created_utc": 1516928861,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever considered committing a crime? If so, which one?",
        "author": "BlutNacht",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sxva5/have_you_ever_considered_committing_a_crime_if_so/",
        "text": "[removed]",
        "created_utc": 1516902713,
        "upvote_ratio": ""
    },
    {
        "title": "What are some everyday things that can cause this?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7swtnb/what_are_some_everyday_things_that_can_cause_this/",
        "text": "[removed]",
        "created_utc": 1516894247,
        "upvote_ratio": ""
    },
    {
        "title": "Is this comment really an insult ?",
        "author": "flashjabi",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sw35p/is_this_comment_really_an_insult/",
        "text": "[removed]",
        "created_utc": 1516887332,
        "upvote_ratio": ""
    },
    {
        "title": "How did the “two people disguised in one coat” trope originate?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7su1j4/how_did_the_two_people_disguised_in_one_coat/",
        "text": "[removed]",
        "created_utc": 1516859286,
        "upvote_ratio": ""
    },
    {
        "title": "A few questions about AI.",
        "author": "DiggidyDiggidyDog",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7st3ch/a_few_questions_about_ai/",
        "text": "AI is getting smarter and smarter everyday. Remember that AI that beat Lee Sedol at the board game GO? Well... That AI is actually kinda primitive nowadays, and that was an AI made only two years ago! AI is growing at an exponential rate, that is very obvious. This exponential growth makes me think of a few questions.\n\n1. When do you think AI will become smart enough to become disruptive? Now, I'm not asking when you think AI will become as smart as a human, I'm just asking when you think it will be smart enough to cause big disruptions in society, and maybe raise some concern.\n\n2. When do you think AGI, machines that match human intelligence, will become a thing, and what do you think will happen when it becomes a thing? \n\n3. When do you you think AI that's, let's say, 1000 times smarter than a human will become a thing, and what do you think will happen when it becomes a thing?\n\n4. What jobs do you think AI could do by 2030? I'm not asking what jobs you think will be widely automated by machines, I'm just asking what jobs you think an AI would have the ability to do. Two completely different questions.\n\n5. Final question, what jobs do you think AI wouldn't have the ability to do by 2030? \n\n\n",
        "created_utc": 1516849885,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever had anyone say something that completely shook you to your core?",
        "author": "soggyballsack",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sslxs/have_you_ever_had_anyone_say_something_that/",
        "text": "[removed]",
        "created_utc": 1516846150,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think about the implications of Whites becoming a minority in the West due to immigration?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7srns7/what_do_you_think_about_the_implications_of/",
        "text": "[removed]",
        "created_utc": 1516838081,
        "upvote_ratio": ""
    },
    {
        "title": "How liberal were Vikings in terms of women’s social and “spare time” rights?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7srk7i/how_liberal_were_vikings_in_terms_of_womens/",
        "text": "[deleted]",
        "created_utc": 1516837183,
        "upvote_ratio": ""
    },
    {
        "title": "Einstein was one of the greatest scientists, but who did he think was the greatest?",
        "author": "whywalk",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sqioy/einstein_was_one_of_the_greatest_scientists_but/",
        "text": "[removed]",
        "created_utc": 1516828937,
        "upvote_ratio": ""
    },
    {
        "title": "In the far future, should we be able to edit our DNA and choose that of our kids? Is it ethical? What are the advantages/disadvantages?",
        "author": "The_Godlike_Zeus",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7snvwu/in_the_far_future_should_we_be_able_to_edit_our/",
        "text": "",
        "created_utc": 1516808292,
        "upvote_ratio": ""
    },
    {
        "title": "If you could make an instant change to our planet, what would it be and why?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7smb09/if_you_could_make_an_instant_change_to_our_planet/",
        "text": "[removed]",
        "created_utc": 1516791199,
        "upvote_ratio": ""
    },
    {
        "title": "Which subreddits seem to have the least amount of normies?",
        "author": "DieselBustersYes",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7slzgf/which_subreddits_seem_to_have_the_least_amount_of/",
        "text": "[removed]",
        "created_utc": 1516786522,
        "upvote_ratio": ""
    },
    {
        "title": "How did the Islamic revolution in Iran affect the other Islamic countries in the Middle?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7skxan/how_did_the_islamic_revolution_in_iran_affect_the/",
        "text": "[deleted]",
        "created_utc": 1516770874,
        "upvote_ratio": ""
    },
    {
        "title": "Who are the people at festivals that make sure people are ok?",
        "author": "DerkNatMerkats",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7skrdy/who_are_the_people_at_festivals_that_make_sure/",
        "text": "[removed]",
        "created_utc": 1516769086,
        "upvote_ratio": ""
    },
    {
        "title": "How much money do legal prostitutes make in a year?",
        "author": "Gingerfix",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sht5r/how_much_money_do_legal_prostitutes_make_in_a_year/",
        "text": "[removed]",
        "created_utc": 1516742250,
        "upvote_ratio": ""
    },
    {
        "title": "L Kuur n h kolom jjo Loo jyyr",
        "author": "dankfister",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sghkn/l_kuur_n_h_kolom_jjo_loo_jyyr/",
        "text": "[removed]",
        "created_utc": 1516732092,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Tide Pod Challenge a fake meme? I've never seen an actual video of anyone doing it. Where is this \"Challenge\" taking place? Or is it all made up?",
        "author": "Smash_4dams",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sfnio/is_the_tide_pod_challenge_a_fake_meme_ive_never/",
        "text": "[removed]",
        "created_utc": 1516725585,
        "upvote_ratio": ""
    },
    {
        "title": "Whats a song with a good meaning and a unique history?",
        "author": "fathom17",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sf76l/whats_a_song_with_a_good_meaning_and_a_unique/",
        "text": "[removed]",
        "created_utc": 1516721873,
        "upvote_ratio": ""
    },
    {
        "title": "When it comes to who watches at night, why do we only imagine characters that creep us out?",
        "author": "Trisha_Gaurav",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sdwgv/when_it_comes_to_who_watches_at_night_why_do_we/",
        "text": "At night it's hard to see what really is there. This ambiguity often gives the illusion you are being watched by a fictional character. The question is, why do we only get watched by characters that creep us out? Why not someone bright and cheery like Pinkie Pie or SpongeBob?",
        "created_utc": 1516708637,
        "upvote_ratio": ""
    },
    {
        "title": "Why does nobody seem to care about female sexual dysfunction and anorgasmia?",
        "author": "chelle_222",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sdv33/why_does_nobody_seem_to_care_about_female_sexual/",
        "text": "[removed]",
        "created_utc": 1516708113,
        "upvote_ratio": ""
    },
    {
        "title": "When it comes to who watches us at night, why do we only imagine characters that creep us out?",
        "author": "Trisha_Gaurav",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sd8u7/when_it_comes_to_who_watches_us_at_night_why_do/",
        "text": "[removed]",
        "created_utc": 1516699201,
        "upvote_ratio": ""
    },
    {
        "title": "When does mercy become above justice?",
        "author": "dsma_",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7scr6j/when_does_mercy_become_above_justice/",
        "text": "[removed]",
        "created_utc": 1516691814,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people write and edit WIkipedia articles for free?",
        "author": "kampalungi",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7sa773/why_do_people_write_and_edit_wikipedia_articles/",
        "text": "[removed]",
        "created_utc": 1516665118,
        "upvote_ratio": ""
    },
    {
        "title": "How did Larry Nassar get away it for so long?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7s8qj6/how_did_larry_nassar_get_away_it_for_so_long/",
        "text": "[removed]",
        "created_utc": 1516653126,
        "upvote_ratio": ""
    },
    {
        "title": "What are the real life consequences of having bad credit or no credit?",
        "author": "LeahRosie",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7s7wqm/what_are_the_real_life_consequences_of_having_bad/",
        "text": "[removed]",
        "created_utc": 1516646642,
        "upvote_ratio": ""
    },
    {
        "title": "Should immigration policy consider cultural traits as well as current work experience, academic achievements, criminal records etc?",
        "author": "withnoodles",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7s4yuq/should_immigration_policy_consider_cultural/",
        "text": "EDIT:  I seem to have confused people with my question.  I decided to use \"cultural traits\" as a phenomena that presents itself in certain immigrant pools that is responsible for their above average success and achievements (thinking being their culture pushes for success more so than others).  Examples being Chinese Americans and Sikhs in the UK.  The question was, if it was possible to identify these successful immigrant pools (ie looking at data and seeing pools of immigrants that have out performed others) should they be used to influence immigration policy?\n\nJust typing it out I can see that positive / negative external factors affecting the success of immigrant pools would unfairly negatively / positively discriminate other immigrant pools.  How would one balance fairness with potentially better contributions to society.",
        "created_utc": 1516617840,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't companies replace gift vouchers with their own version of crypto currency?",
        "author": "BeatriceBernardo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7s48sc/why_dont_companies_replace_gift_vouchers_with/",
        "text": "It seems to me that making a new coin is very easy, given a thousand copycats out there. And that people are uncomfortable with cryptocurrency because it cannot be used to buy the things that they want to buy yet. It seems that a fast way to make a lot of money, is for google/amazon/microsoft to make their own coin, googleCoin, for example, and make sure that you can purchase google play product with it. ",
        "created_utc": 1516606761,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a \"standard\" North Korean clap?",
        "author": "etrebel16",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7s34sq/is_there_a_standard_north_korean_clap/",
        "text": "[removed]",
        "created_utc": 1516593262,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone help me make a will without being judged?",
        "author": "need2behelpednow",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7s30lx/can_someone_help_me_make_a_will_without_being/",
        "text": "[removed]",
        "created_utc": 1516592051,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think it's harder to become an MD, a lawyer or an investment banker?",
        "author": "Mathmeticsdebater",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7s23bh/do_you_think_its_harder_to_become_an_md_a_lawyer/",
        "text": "[removed]",
        "created_utc": 1516583004,
        "upvote_ratio": ""
    },
    {
        "title": "Why can't content creator sue YouTube over lost of revenue due to take down mistakes?",
        "author": "BeatriceBernardo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rxmgy/why_cant_content_creator_sue_youtube_over_lost_of/",
        "text": "[removed]",
        "created_utc": 1516540582,
        "upvote_ratio": ""
    },
    {
        "title": "Are men expendable?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rx29j/are_men_expendable/",
        "text": "[removed]",
        "created_utc": 1516531220,
        "upvote_ratio": ""
    },
    {
        "title": "Is having a phone / laptop near you that bad in terms of radiation? Is this an ignorance is bliss type of relationship between mankind and technology?",
        "author": "Martisomo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rw9py/is_having_a_phone_laptop_near_you_that_bad_in/",
        "text": "[removed]",
        "created_utc": 1516517251,
        "upvote_ratio": ""
    },
    {
        "title": "Why do I get a Java script error when I try to post a comment?",
        "author": "BlutNacht",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rufdv/why_do_i_get_a_java_script_error_when_i_try_to/",
        "text": "[removed]",
        "created_utc": 1516495251,
        "upvote_ratio": ""
    },
    {
        "title": "Is it naive to feel any sort of enjoyment at all?",
        "author": "Moltenmelt1",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rrtp4/is_it_naive_to_feel_any_sort_of_enjoyment_at_all/",
        "text": "[removed]",
        "created_utc": 1516470293,
        "upvote_ratio": ""
    },
    {
        "title": "Did Maajid Nawaz actually go ahead with his lawsuit against the Southern Poverty Law Center?",
        "author": "yesanything",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rob4i/did_maajid_nawaz_actually_go_ahead_with_his/",
        "text": "[removed]",
        "created_utc": 1516423842,
        "upvote_ratio": ""
    },
    {
        "title": "Does being social with the teachers help make the high school experience better?",
        "author": "coolcelice",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rny9h/does_being_social_with_the_teachers_help_make_the/",
        "text": "",
        "created_utc": 1516419580,
        "upvote_ratio": ""
    },
    {
        "title": "Flu twice in 1 month?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rllt9/flu_twice_in_1_month/",
        "text": "[removed]",
        "created_utc": 1516396741,
        "upvote_ratio": ""
    },
    {
        "title": "Who is interested for posting a #GuestPost on #HBJ_MEDIA",
        "author": "hbj_media",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rje5f/who_is_interested_for_posting_a_guestpost_on_hbj/",
        "text": "[removed]",
        "created_utc": 1516378632,
        "upvote_ratio": ""
    },
    {
        "title": "What if anything should first world western countries adopt from the the cultures of tribal and poor remote communities?",
        "author": "itsmassive",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rglim/what_if_anything_should_first_world_western/",
        "text": "First world western countries have it pretty good and a lot of what we do makes sense and has a purpose. \n\nA lot of poor and tribal communities around the world have very different cultures and attitudes than us. Some thing good, some bad.\n\nI was watching a video on a tribe in South America and they lack a lot of healthcare and comfort and security that we have. Yet they seem way less pressured, more physically fit, happier, family and community oriented, relaxed, and overall satisfied yet poor. \n\nSo in your opinion, what if anything should the developped world learn from poorer, nomadic or tribal cultures of the modern world?\n\nThank you",
        "created_utc": 1516344998,
        "upvote_ratio": ""
    },
    {
        "title": "How could the American and British government manage to overthrow Iran’s leadership 50 years ago?",
        "author": "Xeluc",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rfabw/how_could_the_american_and_british_government/",
        "text": "[removed]",
        "created_utc": 1516330276,
        "upvote_ratio": ""
    },
    {
        "title": "What advantages does a dictatorship have over a democracy (assuming the dictator is not a tyrant and actually cares about the country) ?",
        "author": "The_Godlike_Zeus",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rdxod/what_advantages_does_a_dictatorship_have_over_a/",
        "text": "I can think of: no time is wasted on election campaigns. In my country, the last 6 months before the election almost no new laws are passed because all politicians are busy with the election.  \n\nEdit: and do the benefits of a dictatorship ever outweigh those of a democracy?",
        "created_utc": 1516317665,
        "upvote_ratio": ""
    },
    {
        "title": "Question on Blog Subscriptions",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7rbmh4/question_on_blog_subscriptions/",
        "text": "[removed]",
        "created_utc": 1516298950,
        "upvote_ratio": ""
    },
    {
        "title": "Where does the \"science\" happen with Christian Scientists?",
        "author": "bruce656",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7r4f9d/where_does_the_science_happen_with_christian/",
        "text": "[removed]",
        "created_utc": 1516224260,
        "upvote_ratio": ""
    },
    {
        "title": "Why does it seem like a bunch of people have mental illness?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7r4b5r/why_does_it_seem_like_a_bunch_of_people_have/",
        "text": "[deleted]",
        "created_utc": 1516223353,
        "upvote_ratio": ""
    },
    {
        "title": "If tomorrow, ALL the human beings suddenly disappeared, then which human creations will eventually die in the future and which ones will not die?",
        "author": "ritratt",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7r4942/if_tomorrow_all_the_human_beings_suddenly/",
        "text": "[removed]",
        "created_utc": 1516222907,
        "upvote_ratio": ""
    },
    {
        "title": "What's a funny name for an onion?",
        "author": "3WeeksClean",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7r4914/whats_a_funny_name_for_an_onion/",
        "text": "[removed]",
        "created_utc": 1516222887,
        "upvote_ratio": ""
    },
    {
        "title": "What would a perfect society look like?",
        "author": "Hoodbubble",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7r3rkk/what_would_a_perfect_society_look_like/",
        "text": "What would a perfect or near perfect society look like? What problems exist in society that prevent it from being perfect? Why is a \"perfect\" society possible/impossible?",
        "created_utc": 1516219092,
        "upvote_ratio": ""
    },
    {
        "title": "What are we lacking in terms of leadership in our society?",
        "author": "the_coin_collecter",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7r2qiq/what_are_we_lacking_in_terms_of_leadership_in_our/",
        "text": "What’s wrong with our current leadership structure? What type of leaders do you follow? What do you wish there were more of? ",
        "created_utc": 1516211113,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious]HELP, my families salon is under attack by their receptionist(also a manager in training), she is sending ex-employees customer information and earning reports!!! Is there any legal action we could take?",
        "author": "mutinyafoot",
        "url": "https://www.reddit.com/r/AskReddit/comments/7r2ki9/serioushelp_my_families_salon_is_under_attack_by/",
        "text": "",
        "created_utc": 1516210424,
        "upvote_ratio": ""
    },
    {
        "title": "Why does life exist and reproduce?",
        "author": "madwzdri",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qzdxy/why_does_life_exist_and_reproduce/",
        "text": "I would like to pass this question on to you but here is my guess.\nI have been pondering  this question for sometime and came to the conclusion that the only reason life exists and reproduces is to recycle the sun's energy. Think about the first lifeforms emerged in water which is perfect for trapping heat/ energy and the first bacterial lifeforms to ever exist used photosynthesis to exist and stay alive. And with so much abundance in energy and means of obtaining it naturally started to reproduce. Over time as life became more complicated its means of gathering energy became more complicated and ways of obtaining energy changed  but it still relied on the suns energy. Im kinda tired so i might have mixed up a few details but feel free to critique my theory.",
        "created_utc": 1516173932,
        "upvote_ratio": ""
    },
    {
        "title": "To those that have never smoked marijuana- would you if it were seen in the same light that alcohol is?",
        "author": "Martisomo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7quxc0/to_those_that_have_never_smoked_marijuana_would/",
        "text": "[removed]",
        "created_utc": 1516131813,
        "upvote_ratio": ""
    },
    {
        "title": "Why can't rap songs be fictional?",
        "author": "Astrosaur4",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qu9e0/why_cant_rap_songs_be_fictional/",
        "text": "[removed]",
        "created_utc": 1516126562,
        "upvote_ratio": ""
    },
    {
        "title": "How do I politely tell my (amazing) wife to be healthier?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qt6q6/how_do_i_politely_tell_my_amazing_wife_to_be/",
        "text": "[deleted]",
        "created_utc": 1516117989,
        "upvote_ratio": ""
    },
    {
        "title": "In your opinion, What is the point of life?",
        "author": "cyberspunk00",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qqfml/in_your_opinion_what_is_the_point_of_life/",
        "text": "I've been in an odd point of my life for the past few years. I always assumed I would go to college after high school, but when the time came I wasn't able to. I  haven't been able to work either due to medical complications. I recently moved into a place with my fiancee and a few friends, and now I spend most of my time in the house doing nothing productive besides cleaning. Clearly this is not where I thought I would be at this point in my life, and its hard not to feel like I'm wasting time. It feels like the days just pass by without anything significant happening at all and all I want is to feel like I'm doing something with my life, but I don't know how to get there. I keep arriving at the same idea, 'there has to be more to life than this'. I'm really curious to know how other people keep themselves going. What is the point of life to you? What makes your day feel fulfilled? I'm hoping maybe hearing other people's answers could give me some perspective on my own situation, or at least make me feel more optimistic. \n\nEdit: I really appreciate everyones answers but just to clarify, i meant this more in a personal sense. I'm not asking what is the point for humans in general to live, I'm more looking to find out what peoples personal motivations are. Like for example, maybe you have kids and setting up a good life for them keeps you feeling like you have a purpose. Or maybe you have a passion for cooking and seeing people having a good time enjoying your food makes everything feel worth it.  Cheesy stuff like that. ",
        "created_utc": 1516083946,
        "upvote_ratio": ""
    },
    {
        "title": "Why• does my • browser do this • to all the text I want to copy/paste • so I have to erase all these dumb dots and extra spaces ? ••",
        "author": "Srvclams",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qpsr0/why_does_my_browser_do_this_to_all_the_text_i/",
        "text": "[removed]",
        "created_utc": 1516076396,
        "upvote_ratio": ""
    },
    {
        "title": "How can I have better dental hygiene?",
        "author": "3WeeksClean",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qnz1x/how_can_i_have_better_dental_hygiene/",
        "text": "[removed]",
        "created_utc": 1516058829,
        "upvote_ratio": ""
    },
    {
        "title": "Are some people really „homosexual“?",
        "author": "Secuta",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qnmf3/are_some_people_really_homosexual/",
        "text": "[removed]",
        "created_utc": 1516056010,
        "upvote_ratio": ""
    },
    {
        "title": "Why is $0.99 a thing?",
        "author": "Astrosaur4",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qmxpl/why_is_099_a_thing/",
        "text": "[removed]",
        "created_utc": 1516050919,
        "upvote_ratio": ""
    },
    {
        "title": "Is human intelligance a mistake",
        "author": "madwzdri",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qhxcf/is_human_intelligance_a_mistake/",
        "text": "Im not exactly sure when homosapiens gained self awareness and intelligance but for millions of years before life existed with the most basic of instincts and then suddenly homosapiens arrive and from our ancestors it would seem like we were headed down the same path as every previous life form but then suddenly we acquired a tool that gave us significant advantage of our competitors. \n\nSo do you think this was a lucky break or homosapiens were headed down this route from the beggining.",
        "created_utc": 1515998232,
        "upvote_ratio": ""
    },
    {
        "title": "How can I stop social isolation from saddening me?",
        "author": "ps1lon",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qhsnn/how_can_i_stop_social_isolation_from_saddening_me/",
        "text": "[removed]",
        "created_utc": 1515996569,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there no ties in track events?",
        "author": "sampaoli999",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qh505/why_are_there_no_ties_in_track_events/",
        "text": "[removed]",
        "created_utc": 1515988752,
        "upvote_ratio": ""
    },
    {
        "title": "Will US College Attendance Rates Decline?",
        "author": "ihopeshelovedme",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qh28c/will_us_college_attendance_rates_decline/",
        "text": "Would it be more idealistically following the *American Dream* if a person forgoes - what appears to be becoming overpriced and overvalued - \"traditional\" college pathway and jumps right into *working for a living*?\n\nEdit: I believe I've come to the simple answer to my own question. I believe that at the point when the \"traditional track\" is no longer seen as a beneficial investment towards padding the future dream of the youth, is when attendance will begin to decline.\n\nNow, I just don't know what will cause that to happen... Could id be another nationwide depression, where student loans are no longer viable source of profit for banks (as if the ruthless bastards would stop there)? What do you think?",
        "created_utc": 1515987842,
        "upvote_ratio": ""
    },
    {
        "title": "How do YOU define success?",
        "author": "ihopeshelovedme",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qgqxu/how_do_you_define_success/",
        "text": "Whether that be towards a specific goal or in your broader lifespan..",
        "created_utc": 1515984435,
        "upvote_ratio": ""
    },
    {
        "title": "Are you a bigot or are you a SJW?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qfm1q/are_you_a_bigot_or_are_you_a_sjw/",
        "text": "[removed]",
        "created_utc": 1515972951,
        "upvote_ratio": ""
    },
    {
        "title": "When people criticize the American school system saying it's based on the Prussian factory model and stifles creativity and all that, what are some tangible alternatives?",
        "author": "PM_ME_SUM_SNATCH",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qfatn/when_people_criticize_the_american_school_system/",
        "text": "As a left leaning guy, I've always heard the criticisms of the modern day school system, how it's designed after factory work, with bells designating when you can leave the room, and requires obedience and deference to an authority figure, and so on.  But I did a thought experiment as to what a first world childhood education should include, and my thought process is as below:\n\nClearly, people are more well suited to different areas of the collection of human activities.  Some people play music, some do science, some fix cars.  As best we know, what makes someone more suited towards a certain activity is some mix of nature and nurture, so in the extreme case, it seems like it would be possible for someone with the potential to love music (or athletics or math) and excel at it to not be able to realize that potential due to a lack of exposure to the field.  Therefore it makes sense to roughly categorize the areas of human activity - some purely intellectual, some practical, and some a mix.  If you pay attention to history, this would be something like Communication (writing and reading), Arts (literature, music, dance), Athletics, Math, Science, Life Skills (nutrition, sexual health, finances, business and entrepreneurship, family dynamics and raising children), History, Government, and maybe a few that I forgot.\n\nOnce we have our areas that children should be exposed to, it makes sense to get a person who's an expert in the area and at teaching it lead a portion of time during the day when they teach students.  It doesn't make sense to have a full day of Math, because that would bore anyone.  It doesn't make sense to let kids fully choose their own schedule too early because of the fear of under-exposure to a field they might have loved for short-term reasons (my friend is in that other class!).  If the area of activity is more creative, like literature or music, it may make sense for the classes to be guided by the children's interest.  If the area of activity has an agreed-upon basis and language (Math or Science), it makes sense for the class to be more like the teacher planning a curriculum based on a strong global intellectual consensus.  There are some parts of learning all of this that are best done with a teacher directly guiding you, and some parts that are more suited towards reading or practicing on your own (homework).\n\nBy and large, I think the American school system basically accomplishes this to a rough approximation.  There are criticisms that schools lack enough Life Skills type classes, but to be honest, by average suburban high school had plenty of them.  So if you feel something is fundamentally wrong with school, what exactly is it?  Is there faulty logic in my ground-up exercise in imagining what school should be for?\n\nI just ask because from some speakers like Noam Chomsky, you hear these sweeping arguments about how school is fundamentally flawed and needs to be re-designed from the ground up, but I never really hear any specifics.  One thing I also wonder about is how the \"university lecture\" system is basically the same thing as regular K-12 classes (a teacher teaching to a class of learners who are just listening at a pre-described time during the day), but that system was \"designed\" centuries before the Prussian factory model.  So there seems to be some convergence in the best way to teach intellectual subjects to people.  What do you think?",
        "created_utc": 1515969976,
        "upvote_ratio": ""
    },
    {
        "title": "Need Advice please help",
        "author": "EB84",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qbdxu/need_advice_please_help/",
        "text": "[removed]",
        "created_utc": 1515929300,
        "upvote_ratio": ""
    },
    {
        "title": "Iran has been unseasonably warm this winter, and it didn't snow at all. Why? Has Global Warming finally arrived?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7qacfn/iran_has_been_unseasonably_warm_this_winter_and/",
        "text": "[removed]",
        "created_utc": 1515911457,
        "upvote_ratio": ""
    },
    {
        "title": "What can be done for an adult with auditory processing disorder?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7q8hrg/what_can_be_done_for_an_adult_with_auditory/",
        "text": "[deleted]",
        "created_utc": 1515889714,
        "upvote_ratio": ""
    },
    {
        "title": "Why people still believe that US landed on moon?",
        "author": "someone32123",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7q3da0/why_people_still_believe_that_us_landed_on_moon/",
        "text": "[removed]",
        "created_utc": 1515831845,
        "upvote_ratio": ""
    },
    {
        "title": "How and why did the modern western culture of \"kick out at 18\" begins?",
        "author": "BeatriceBernardo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/7q1yoy/how_and_why_did_the_modern_western_culture_of/",
        "text": "",
        "created_utc": 1515813988,
        "upvote_ratio": ""
    },
    {
        "title": "How true are top comments?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7q1xda/how_true_are_top_comments/",
        "text": "[removed]",
        "created_utc": 1515812520,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a good reason why we should not primarily take in migrants from Europe now after decades of exclusively non-European migration?",
        "author": "aesthetic-as-fuck",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7pv5ey/is_there_a_good_reason_why_we_should_not/",
        "text": "[removed]",
        "created_utc": 1515743676,
        "upvote_ratio": ""
    },
    {
        "title": "Should a gift be a surprise.",
        "author": "TripleAvenge",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7ppdbx/should_a_gift_be_a_surprise/",
        "text": "[removed]",
        "created_utc": 1515689078,
        "upvote_ratio": ""
    },
    {
        "title": "”The initial popularity of Western movies was made by Hollywood to make Americans move to uninhabited areas of the US.” How much truth is there to this?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7polq7/the_initial_popularity_of_western_movies_was_made/",
        "text": "[removed]",
        "created_utc": 1515682546,
        "upvote_ratio": ""
    },
    {
        "title": "How to mirror to cromecast without internet/ wifi/ hotspot?",
        "author": "MJOLNIR11733",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7pln40/how_to_mirror_to_cromecast_without_internet_wifi/",
        "text": "[removed]",
        "created_utc": 1515645174,
        "upvote_ratio": ""
    },
    {
        "title": "Did the average 25-year-old 1850s Englishman have a broader vocabulary and speak more formal than the average modern 25-year-old Englishman?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7pkdfb/did_the_average_25yearold_1850s_englishman_have_a/",
        "text": "[removed]",
        "created_utc": 1515632462,
        "upvote_ratio": ""
    },
    {
        "title": "What would a community of autistics people be like?",
        "author": "BeatriceBernardo",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7pk59l/what_would_a_community_of_autistics_people_be_like/",
        "text": "[removed]",
        "created_utc": 1515630318,
        "upvote_ratio": ""
    },
    {
        "title": "What does the quote \"life is like a fast food chain\" mean?",
        "author": "dsma_",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7pjwqb/what_does_the_quote_life_is_like_a_fast_food/",
        "text": "[removed]",
        "created_utc": 1515628331,
        "upvote_ratio": ""
    },
    {
        "title": "How have you become the artists that you are today?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7pjkvf/how_have_you_become_the_artists_that_you_are_today/",
        "text": "[removed]",
        "created_utc": 1515625414,
        "upvote_ratio": ""
    },
    {
        "title": "Other than being a doctor or biology teacher/professor, what are some careers someone can get with a biology major?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7pi8l1/other_than_being_a_doctor_or_biology/",
        "text": "[removed]",
        "created_utc": 1515614410,
        "upvote_ratio": ""
    },
    {
        "title": "Is Escapism bad?",
        "author": "Prince-Cola",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7phm4i/is_escapism_bad/",
        "text": "Let me start pasting this definition i got when looking up Escapism: \"the tendency to seek distraction and relief from unpleasant realities, especially by seeking entertainment or engaging in fantasy.\"\n\nThoughts? For me personally, i get exhausted and depressed just from looking at the news. Is it wrong to avoid these things because they make me ill?",
        "created_utc": 1515609375,
        "upvote_ratio": ""
    },
    {
        "title": "What is the meaning of \"health is wealth\" for you?",
        "author": "dsma_",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7pdnlv/what_is_the_meaning_of_health_is_wealth_for_you/",
        "text": "[removed]",
        "created_utc": 1515564241,
        "upvote_ratio": ""
    },
    {
        "title": "Is This Illegal?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TrueAskReddit/comments/7pbk1r/is_this_illegal/",
        "text": "[removed]",
        "created_utc": 1515542927,
        "upvote_ratio": ""
    }
]