[
    {
        "title": "Converting empty offices and other non-residential buildings - what is actually unfeasible?",
        "author": "DearLeader420",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11ejrwz/converting_empty_offices_and_other_nonresidential/",
        "text": "In discussion after discussion revolving around the \"new normal\" of remote work and downtowns laden with empty office buildings, someone usually proposes the idea of converting these offices into apartments - and are quickly met with a host of people saying that task is (logistically or financially) unfeasible. Building internals (plumbing, electric, HVAC) are planned differently, rules about windows present hurdles, etc.\n\nBut yet, every city nowadays, small to large, seems to have the chic, \"luxury\" apartment buildings and mixed-use centers in converted warehouses and manufacturing plants. Surely these derelict commercial buildings also present the same challenges as a modern office building, right?\n\nSo my question is - if every city in the country is having a great time converting old Sears buildings and canning plants into apartments and mixed-use centers, then why are people so quick to say converting office buildings is all-but impossible? Is it actually? Is there something about a factory that makes it easier to convert than a 20 story tower full of cubicles?",
        "created_utc": 1677618029,
        "upvote_ratio": 1.0
    },
    {
        "title": "City of Buffalo Offers Guidance for Residents who are Interested in Building Tiny Homes",
        "author": "Eudaimonics",
        "url": "https://www.buffalorising.com/2023/02/city-of-buffalo-offers-guidance-for-residents-who-are-interested-in-building-tiny-homes/",
        "text": "",
        "created_utc": 1677615339,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Chatbot Talks Regeneration and Recovery for Seattle",
        "author": "Planetizen",
        "url": "https://www.planetizen.com/blogs/121921-chatbot-talks-regeneration-and-recovery-seattle",
        "text": "",
        "created_utc": 1677611120,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Build-Nothing Country",
        "author": "SuccessfulOperation",
        "url": "https://noahpinion.substack.com/p/the-build-nothing-country",
        "text": "",
        "created_utc": 1677607857,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts on Cleveland’s RTA.",
        "author": "IliketobeaContrarian",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11eevyk/what_are_your_thoughts_on_clevelands_rta/",
        "text": "[removed]",
        "created_utc": 1677606361,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is holding back the use of flat rooftops?",
        "author": "kobi_eda",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11ebb9d/what_is_holding_back_the_use_of_flat_rooftops/",
        "text": "I know you might have to reinforce them to be able to withstand the weight of whatever aside from humans. Other than that why aren't they being used? \nThey can be used for tiny houses, renewables, farming, wildlife gardening, maybe more.",
        "created_utc": 1677598319,
        "upvote_ratio": 0.99
    },
    {
        "title": "Here's why Arizona says it can keep growing despite historic megadrought",
        "author": "Hrmbee",
        "url": "https://www.npr.org/2023/02/27/1159281768/heres-why-arizona-says-it-can-keep-growing-despite-historic-megadrought",
        "text": "",
        "created_utc": 1677559277,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Opinion) \"Missing middle\" housing can be miserable to live in",
        "author": "Delicious-Sock516",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11dudtr/opinion_missing_middle_housing_can_be_miserable/",
        "text": "[removed]",
        "created_utc": 1677551338,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finance Jobs in Urban Planning",
        "author": "kylemp23",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11dt6kp/finance_jobs_in_urban_planning/",
        "text": "Hi everyone, \n\nI’m currently a 23 year old working in the futures industry and am interested into breaking into urban planning. Are there any opportunities for me within industry that don’t require me to get a masters? I will eventually just not for the foreseeable future.",
        "created_utc": 1677547957,
        "upvote_ratio": 1.0
    },
    {
        "title": "My desire of wanting more walkable and denser communities in the USA is slowly starting to fade",
        "author": "WorldTraveller69",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11drthd/my_desire_of_wanting_more_walkable_and_denser/",
        "text": "As a Native New Yorker who strongly appreciates walkable cities/towns and follows many pages and YouTube channels such as this one - I feel like my opinion is slowly shifting away from walkable cities in favor of suburbs.\n\nI completely understand the pro’s of urban settings. I know that urban footprints are cheaper on local govts, the health benefits of walking places, how beneficial not needing a car is, etc, etc., etc.\n\n1. However, here in the USA, we simply don’t have the social safety nets so that these public spaces won’t be filled with homeless people, the mentally ill, loiterers up to no good and others who may need services but might not be able to attain them.\n\n2. With the cost of living crisis intensifying, we can expect more despair and this new strife will be more visible in walkable densely-populated urban areas than in quiet tucked away suburban areas. \n\n3. Political and racial tensions also seem to be rising at an extraordinary rate. This means that people are way more suspicious and downright hateful of others whom are different from them. Therefore, these public areas will not lead to much more of a community feel. Most people here don’t value nor trust each other like in many other developed countries around the world. \n\n4. Not to mention the increasing threat of mass-shootings. I don’t want to be alarmist but is it really safe to linger around a crowded area for an extended period of time anymore given the current state of affairs?\n\nYour thoughts? I know that this will get mass down-voted but it’s just something that’s been on my mind for the longest. I wish that we had the kind of society that could sustain this.",
        "created_utc": 1677544277,
        "upvote_ratio": 1.0
    },
    {
        "title": "My desire of wanting walkable and denser communities here in the USA is slowly starting to shift",
        "author": "WorldTraveller69",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11drseu/my_desire_of_wanting_walkable_and_denser/",
        "text": "As a Native New Yorker who strongly appreciates walkable cities/towns and follows many pages and YouTube channels such as this one - I feel like my opinion is slowly shifting away from walkable cities in favor of suburbs.\n\nI completely understand the pro’s of urban settings. I know that urban footprints are cheaper on local govts, the health benefits of walking places, how beneficial not needing a car is, etc, etc., etc.\n\n1. However, here in the USA, we simply don’t have the social safety nets so that these public spaces won’t be filled with homeless people, the mentally ill, loiterers up to no good and others who may need services but might not be able to attain them.\n\n2. With the cost of living crisis intensifying, we can expect more despair and this new strife will be more visible in walkable densely-populated urban areas than in quiet tucked away suburban areas. \n\n3. Political and racial tensions also seem to be rising at an extraordinary rate. This means that people are way more suspicious and downright hateful of others whom are different from them. Therefore, these public areas will not lead to much more of a community feel. Most people here don’t value nor trust each other like in many other developed countries around the world. \n\n4. Not to mention the increasing threat of mass-shootings. I don’t want to be alarmist but is it really safe to linger around a crowded area for an extended period of time anymore given the current state of affairs?\n\nYour thoughts? I know that this will get mass down-voted but it’s just something that’s been on my mind for the longest. I wish that we had the kind of society that could sustain this.",
        "created_utc": 1677544204,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do yall think of big neon megacities like the ones seen in east Asia?",
        "author": "publictransitlover",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11dou0b/what_do_yall_think_of_big_neon_megacities_like/",
        "text": "I might be in a small camp of people when I say it sounds pretty cool to be able to be able to go outside and see all these lights and people and things to do, and if there isn't stuff to do in walking distance I can take a train. It'd be a whole world of smells, sounds, lights, and colors at night. Just sounds awesome to me. Then again I've never been.",
        "created_utc": 1677536699,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the day to day activities of a planner?",
        "author": "kittiekatkate1217",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11dmkmf/what_are_the_day_to_day_activities_of_a_planner/",
        "text": "I got my undergrad in political science with a minor in economics. I'm currently looking into a masters of urban planning at UW in Seattle. Urban planning seems like a good fit for me but I can't seem to find any examples of what a planner actually does.",
        "created_utc": 1677531261,
        "upvote_ratio": 1.0
    },
    {
        "title": "O.C. malls, fading from their hip glory days, may get new lives as apartments",
        "author": "BlankVerse",
        "url": "https://www.latimes.com/california/story/2023-02-26/malls-to-housing",
        "text": "",
        "created_utc": 1677529977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apartment Rents Fall as Crush of New Supply Hits Market",
        "author": "SuccessfulOperation",
        "url": "https://www.wsj.com/articles/apartment-rents-fall-as-crush-of-new-supply-hits-market-2403c6ea",
        "text": "",
        "created_utc": 1677520402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters program following a CIP-accredited undergraduate degree?",
        "author": "w-_x",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11dhdif/masters_program_following_a_cipaccredited/",
        "text": "I am an undergraduate student at a CIP accredited university and am looking to get a Masters afterwards. Besides doing a masters in Planning, what are some good options for masters to diversify while also getting valuable experience for a planning career?\n\nI have lightly looked into things like urban design, landscape arch, environmental studies, public policy, or a post-degree GIS cert, and see those are solid options, but I'm curious what else is out there or that people have done.\n\nWould a masters degree in something relatively unrelated (but could still relate to planning; do a thesis), like poli sci, history, philosophy, etc., provide the professional benefits of having a masters degree in the planning profession (increased upward mobility, etc.), while providing a unique skillset?\n\nThanks.",
        "created_utc": 1677518758,
        "upvote_ratio": 1.0
    },
    {
        "title": "What projects or efforts are there to help Ukraine build back better after the war?",
        "author": "GilgameshWulfenbach",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11dh691/what_projects_or_efforts_are_there_to_help/",
        "text": "I am curious what groups are already working on creating plans and guides for how Ukraine's urban planning policy when is able to rebuild.  There have to be politicians or organizations that are aware of this future need and looking at what opportunities that provides.  Do you guys know of anyone?  I'm curious to see where their thoughts have taken them.",
        "created_utc": 1677518268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Land Use Reform Picks Up Momentum in Connecticut Again",
        "author": "Planetizen",
        "url": "https://www.planetizen.com/blogs/121851-land-use-reform-picks-momentum-connecticut-again",
        "text": "",
        "created_utc": 1677517862,
        "upvote_ratio": 1.0
    },
    {
        "title": "A mindmap/causal diagram about the genesis of urban heat island/urban temperature from the perspective of surface energy balance",
        "author": "OkAge2145",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11dgftm/a_mindmapcausal_diagram_about_the_genesis_of/",
        "text": "Hello, I made a mindmap/causal diagram about the genesis of urban heat island from the perspective of surface energy balance at both urban and block scale, which is just a disorder draft (but it include all causal association I could consider) and will be revised into a part of literature review about the progress of urban heat island I recently write. Could anyone give me some suggestion about the diagram, especially the factors or causal assocaiton I ignored from a perspective of urban planning? Thank you!\n\nNote: In the digram, a link from parent node to the child node without arrow means the latter influences the former.\n\n[https://atlas.mindmup.com/shunyihu/seb/index.html](https://atlas.mindmup.com/shunyihu/seb/index.html)",
        "created_utc": 1677516502,
        "upvote_ratio": 0.99
    },
    {
        "title": "Unpopular Opinion: Paint on the road DOES protect bicyclists.",
        "author": "water-flows-downhill",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11dewpu/unpopular_opinion_paint_on_the_road_does_protect/",
        "text": "Context: I'm a professional engineer who works on street projects in small-ish urban areas in the northern US. \n\nI often see people on this sub and similar ones saying that bike lanes aren't good enough, and there needs to be a physical barrier between vehicle lanes and bike lanes/sidewalks/etc. \n\nI think physical barriers are wonderful (especially when I'm pulling my child in a bike trailer) but they aren't always practical. Paint on the other hand, is *almost* ALWAYS practical, and it does offer a great degree of protection. Yes, it can be driven over, but if it's used correctly it rarely is. When driving on a country road, paint is the only thing separating 2 oncoming cars that zip past each other each going 60+ mph (100+ kph). Paint almost entirely dictates what drivers on a road do. Everything a driver does with the steering wheel is subconsciously determined by how pavement markings are applied to the street. \n\nPaint can be as thick or thin as needed - I recently worked on a project with a bike lane stripe that was one foot wide (30cm). And I've designed bike lanes with painted buffers 2+ feet wide to keep the cars as far as possible from bike lanes. \n\nAlso, paint can be scraped up and redone much more easily than physical barriers, especially concrete curb. \n\nTL;DR paint is fuckin awesome and I love it, stop saying it's worthless.",
        "created_utc": 1677512650,
        "upvote_ratio": 1.0
    },
    {
        "title": "Private medical centre",
        "author": "KevLute",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11d9aqu/private_medical_centre/",
        "text": "Does anyone have any ideas from an urban planning point of view in opposing a private medical centre thats planned to be built up my street. There is a period allowed for objections to it and my neighbours and I are compiling a case with lawyers etc?",
        "created_utc": 1677496170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spending time with your child is very important",
        "author": "Longjumping_Net1609",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11d3eln/spending_time_with_your_child_is_very_important/",
        "text": "[removed]",
        "created_utc": 1677474468,
        "upvote_ratio": 1.0
    },
    {
        "title": "The advantages of a BRT, but without the high cost or tough politics",
        "author": "Minute-Cut2938",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11cyiur/the_advantages_of_a_brt_but_without_the_high_cost/",
        "text": "Got an idea for achieving the congestion-avoiding effect of a BRT on normal two-lane streets but for less money and hopefully with fewer fights about parking and car access.\n\nBut first, a review of the disadvantages of a BRT (apart from the fact that it's not LRT): The stations are expensive, construction is long and disruptive, center-lane travel requires complex signaling arrangements, the buses have to be fitted out with doors on both sides, and the politics of dedicated lanes are tough, especially when it pushes out parking or takes away left turn opportunities.\n\nNone of that is insurmountable, of course, but for planners, the easier option is usually to just let buses fend for themselves in normal congested traffic, which as we all know is why riding transit in city centers often sucks.\n\nBut if congestion exists on any given street it is not mostly due to the handful of cars parking curbside (which incidentally is the thing the business community wants because they could be customers). It's mainly because other drivers think of the corridor as a handy and convenient through street and so back right in. So what if we just kept the parking while making it a less handy and convenient through street?\n\nPicture a normal street with one traffic lane in each direction and curbside parking on both sides. But there's a difference: To enter the block from the intersection you have to pass one of those rising arm devices they have at the entrances of parking garages. Cars would be free to enter the street, but they would have to roll down the window and press a button to get it to go up before proceeding to their curbside parking. When they're done, they would pull out of the parking spot and continue down the street as per usual and wait for the light to turn. That light comes with a no-right-turn-on-red sign and takes just a bit longer than usual to turn green, the better to discourage through traffic.\n\nBuses, by contrast, remote activate the rising arm so they breeze right through, having already enjoyed signal priority at the intersection. If there's a stop on the block, it's not much more complicated than a normal shelter with a curb extension so the bus doesn't have to pull over (the stop could be designed for either articulated or normal buses). Then it proceeds on through the next signal-priority intersection. \n\nCar access, in other words, is preserved, but in a way that makes it inconvenient to use the street as anything other than a place to park and get your business taken care of. Meanwhile, the cars are unlikely to get in the way of buses since they wouldn't be in the travel lane very often and then not for long. \n\nSo that's the idea. Buses get what is essentially a dedicated lane, cars get to borrow it to park but wouldn't have much reason to use it for anything else, and the infrastructure involved is basically an off-the-shelf rising arm with a few technical additions, the signal priority gizmos, and a normal curb and bus stop/shelter. None of that should take too long to install or be particularly expensive. Piece it together block by block and buses would hardly have to stop for anything except pickup and dropoff. Any reason that wouldn't be feasible?",
        "created_utc": 1677459865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Articles on sustainable built environment?",
        "author": "ihmsam",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11cyf8l/articles_on_sustainable_built_environment/",
        "text": "Pitching a Sustainable Cities class to the local community college. Looking for articles on progressive visions for sustainability in the built environment — which to me means integrating our built and natural environments. Ideally articles that explain things in everyday terms that could be good gateways/introductions to the topic. Practical examples are awesome, profiles of places implementing new ideas to change a car-centric or nature-depleted status quo, or places that have had the right idea for a long time. Thanks!",
        "created_utc": 1677459616,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it true that you should go to grad school where you want to work?",
        "author": "heatbybrockhampton",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11cxof9/is_it_true_that_you_should_go_to_grad_school/",
        "text": "hello! so i just graduated in december 2022 and i was thinking about going to graduate school. i went to a school with a great grad program for urban planning but i eventually want to leave the state. but i don’t know if it’s smarter for me to go to grad school then move OR move then go to graduate school. do any of you have advice on this ?",
        "created_utc": 1677457532,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best-planned neighborhoods in Texas and Florida?",
        "author": "BornThought4074",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11cw3ip/what_are_the_bestplanned_neighborhoods_in_texas/",
        "text": " My top 5 with explanations is below.\n\n1. South Beach: 3 grocery chains (Trader Joes, Whole Foods, and Publix), 2 big box stores (Target and Best Buy), multiple pharmacies &amp; convenience stores, a large selection of stores and restaurants, multiple bus lines including a free trolley, multiple bike lanes, and many parks.\n\n2. Downtown Austin: 2 grocery chains (Trader Joes and Whole Foods), 1 big box store (target), multiple pharmacies &amp; convenience stores, many restaurants but not a lot of stores, multiple bus lines (including BRT) &amp; a train line, many bike lanes, and a few parks.\n\n3. Downtown Miami/Brickell: 2 grocery chains (Publix and whole foods), no big box stores, multiple pharmacies &amp; convenience stores, a slightly smaller selection of stores and restaurants than Miami Beach, multiple transit options (free people mover, Metrorail and Brightline), a few bike lanes, and a few parks.\n\n4. Downtown St Petersburg: Only Publix for Grocery, no big box stores, multiple pharmacies but only 1 convenience store, a moderate selection of stores and a large selection of restaurants, multiple bus lines (including a BRT line), multiple bike lanes, and many parks.\n\n5. Either Downtown Orlando, Midtown/Wynwood in Miami, or Uptown Dallas.",
        "created_utc": 1677453610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching from public relations to urban planning?",
        "author": "Sea_Visit1168",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11cu4rb/switching_from_public_relations_to_urban_planning/",
        "text": "[removed]",
        "created_utc": 1677448915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice to someone thinking of switching from public relations to urban planning?",
        "author": "Sea_Visit1168",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11cu3jk/advice_to_someone_thinking_of_switching_from/",
        "text": "[removed]",
        "created_utc": 1677448843,
        "upvote_ratio": 1.0
    },
    {
        "title": "How my small hometown in Argentina grew and became more car-dependant",
        "author": "picardia",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11ctzwk/how_my_small_hometown_in_argentina_grew_and/",
        "text": "Hi, I'm not an professional urban planner, just an architecture student that had two semesters of urbanism, I wrote this small article on medium with a few thoughts I've had in my head, I wanted to know what you think\nhttps://medium.com/@ferminc/how-my-small-hometown-in-argentina-grew-and-became-car-dependant-9513ee74f544",
        "created_utc": 1677448613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Studies that show companies in Central Business Districts see less vehicle miles traveled?",
        "author": "Skillagogue",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11coijs/studies_that_show_companies_in_central_business/",
        "text": "[removed]",
        "created_utc": 1677435665,
        "upvote_ratio": 1.0
    },
    {
        "title": "LETTER TO THE EDITOR | Re: Does Zoning Kill Dreams? - The Cornell Review",
        "author": "CornellReview",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11cm0ig/letter_to_the_editor_re_does_zoning_kill_dreams/",
        "text": "[https://www.thecornellreview.org/letter-to-the-editor-re-does-zoning-kill-dreams/](https://www.thecornellreview.org/letter-to-the-editor-re-does-zoning-kill-dreams/)\n\nThis is a letter to the editor from a resident of the town of Caroline. In the letter, the resident explains why many within the town oppose proposals for zoning.",
        "created_utc": 1677430166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roundabouts on high speed roadways?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677429144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roundabouts on high speed roadways?",
        "author": "AllisModesty",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11clivh/roundabouts_on_high_speed_roadways/",
        "text": "[removed]",
        "created_utc": 1677429100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it make sense to elevate a sidewalk in this situation?",
        "author": "240plutonium",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11ccu2n/would_it_make_sense_to_elevate_a_sidewalk_in_this/",
        "text": "The main artery of a city outwards to some direction is a 4-lane boulevard. There is no rapid transit, no parallel parking and the sidewalks are less than a meter wide. Since I'm not sure it would be a great idea to have a 2 lane road as an artery, would it make sense to replace the sidewalks with pillars to support an elevated train, elevate the sidewalks, and allow them to access places from the 2nd floor? And maybe some elevators or ramps for bicycles?",
        "created_utc": 1677408173,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can urban planning help the homeless crisis?",
        "author": "1AngryBrotha",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11c730i/how_can_urban_planning_help_the_homeless_crisis/",
        "text": "[removed]",
        "created_utc": 1677391985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban Planning Tourism: Los Angeles",
        "author": "OverTheUnderAndThru",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11c485j/urban_planning_tourism_los_angeles/",
        "text": "Hi All,\n\nI'll be in Los Angeles in a week, a city renowned for its bad urban planning practices (and slowly getting recognized for its strong attempts to rectify this!). Does anyone have an recommendations for stuff to do in Los Angeles that has a planning bent to it? Could be anything: museums, notable places, events, etc. \n\nThank you!",
        "created_utc": 1677382225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendations for public consultation?",
        "author": "DIYPANDA07",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11bsnou/book_recommendations_for_public_consultation/",
        "text": "As the title suggested, are there books that you would recommend to learn more about public consultation? or perhaps awesome resources that help planners become effective public consultation professionals?",
        "created_utc": 1677351544,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why arcaded sidewalks aren't common?",
        "author": "kobi_eda",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11bqkwq/why_arcaded_sidewalks_arent_common/",
        "text": "At least with buildings arched over the sidewalk aren't more common than I would like, most are in Europe or don't cover the whole adjacent sidewalk. A continuous awning nor balcony over sidewalks is not what I'm talking but its better than nothing I suppose. They behave like awnings but take up space where nothing else would except for tree lined sidewalks. The protect people from the elements &amp; utilize unused spaces which can ease walking &amp; may mildly increase urban density. I usually see them with in an indoor, courtyard, or porch setting which aren't ment for general public use.",
        "created_utc": 1677346364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why arcaded sidewalks aren't common?",
        "author": "kobi_eda",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11bqjqy/why_arcaded_sidewalks_arent_common/",
        "text": "At least with buildings arched over the sidewalk aren't more common than I would like, most are in Europe or don't cover the whole adjacent sidewalk. A continuous awning nor balcony over sidewalks is not what I'm talking but its better than nothing I suppose. They behave like awnings but take up space where nothing else would except for tree lined sidewalks. The protect people from the elements &amp; utilize unused spaces which can ease walking &amp; may mildly increase urban density. I usually see them with in an indoor, courtyard, or porch setting which aren't ment for general public use.",
        "created_utc": 1677346290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why arcaded sidewalks aren't common?",
        "author": "kobi_eda",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11bqewp/why_arcaded_sidewalks_arent_common/",
        "text": "At least with buildings arched over the sidewalk aren't more common than I would like, most are in Europe or don't cover the whole adjacent sidewalk. A continuous awning nor balcony over sidewalks is not what I'm talking but its better than nothing I suppose. They behave like awnings but take up space where nothing else would except for tree lined sidewalks. The protect people from the elements &amp; utilize unused spaces which can ease walking &amp; may mildly increase urban density. I usually see them with in an indoor, courtyard, or porch setting which aren't ment for general public use.",
        "created_utc": 1677345988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why arcaded sidewalks aren't common?",
        "author": "kobi_eda",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11bqakz/why_arcaded_sidewalks_arent_common/",
        "text": "At least with buildings arched over the sidewalk aren't more common than I would like, most are in Europe or don't cover the whole adjacent sidewalk. A continuous awning nor balcony over sidewalks is not what I'm talking but its better than nothing I suppose. They behave like awnings but take up space where nothing else would except for tree lined sidewalks. The protect people from the elements &amp; utilize unused spaces which can ease walking &amp; may mildly increase urban density. I usually see them with in an indoor, courtyard, or porch setting which aren't ment for general public use.",
        "created_utc": 1677345695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Advice",
        "author": "13141314Dankeee",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11behyz/career_advice/",
        "text": "Currently in my second to last year in an undergraduate environmental planning program. I am trying to break into transportation planning. I have received and accepted an internship offer from the USDOT, where I would be dealing with national transportation policies, logistics, and trade on the maritime transportation network in DC. I do plan on going for another public sector internship next summer before I attend grad school (probably will go after another federal or state department). I was just wondering if such experience would allow me to develop the skills necessary for a career in transportation planning or transit oriented development.",
        "created_utc": 1677308031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to get an Urban Planning job in California, coming from Ontario",
        "author": "geepytee",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11bcv0b/looking_to_get_an_urban_planning_job_in/",
        "text": "Hey,\n\nI'm looking to move from Toronto to the Bay Area, most of my experience is as an urban designer in Ontario (3+ years) with some freelancing architecture work but no licenses. Overall I have ~190 projects under my belt.\n\nAny tips for what to look out when applying to jobs in the Bay Area? Are there any specific things employers in California look for? Is it realistic to think I can get them to sponsor a TN visa for me?",
        "created_utc": 1677302312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for information and research related to Australian housing prices, rents, development and vacancy rates with a focus on Melbourne.",
        "author": "ForeBallast",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11bb5uy/looking_for_information_and_research_related_to/",
        "text": "[removed]",
        "created_utc": 1677296904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for Private Sector Internship Interview",
        "author": "lordschmear",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11b8i1t/tips_for_private_sector_internship_interview/",
        "text": "Hi all, \n\nI’m a grad student in the UK (American citizen with a planning-related undergrad degree, if pertinent). I’m interviewing for a planning summer internship at a private sector firm in the States that specializes in architecture, urban design, master planning, etc. and am wondering if anyone has tips for me or info on what I should expect.\n\nThanks so much for the help.",
        "created_utc": 1677289204,
        "upvote_ratio": 1.0
    },
    {
        "title": "GIS question",
        "author": "Alert-News-3546",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11b5p8h/gis_question/",
        "text": "Is Google Maps considered GIS technology?  Why or why not?",
        "created_utc": 1677281823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find a U.S. city presentation about housing/transit that used 'characters' to make the case",
        "author": "velvelrl",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11b5b36/trying_to_find_a_us_city_presentation_about/",
        "text": "[removed]",
        "created_utc": 1677280830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find a U.S. city presentation about housing/transit that used \"characters\" to make the case",
        "author": "velvelrl",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11b58ob/trying_to_find_a_us_city_presentation_about/",
        "text": "[removed]",
        "created_utc": 1677280663,
        "upvote_ratio": 1.0
    },
    {
        "title": "Helping my SO get an Urban Planning related job",
        "author": "Signal_Canary",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11b1x18/helping_my_so_get_an_urban_planning_related_job/",
        "text": "Hey Y'all,\n\nI live in the Seattle Metro area and need some help. My SO has been trying to get an urban planning related job for a few months, but has had not luck. I've been trying to help her out with resume review, prep, etc. But no dice.\n\nWas wondering if there's anything special about the Seattle metro urban planning market that would make it more difficult to find a job here. I'm not in that industry, nor am I from the area, so I don't really know the ins and outs.\n\nMy SO has been looking at anything entry level, mostly permit tech jobs. Sent out like 20 or 30 apps, and only 2 interviews, both rejected. Decent grades (3.5), graduated 1.5 years ago. Mostly restaurant experience. \n\nI'm taking some initiative to learn about the market to try and better help with the search. Any advice would be super helpful. Or any resources to look at. \n\nThanks!",
        "created_utc": 1677272363,
        "upvote_ratio": 1.0
    },
    {
        "title": "Photo thread detailing the conversion of an Art Deco office building into 200+ living units",
        "author": "cthulhuhentai",
        "url": "https://twitter.com/bobbyfijan/status/1628894643487408129",
        "text": "",
        "created_utc": 1677269623,
        "upvote_ratio": 1.0
    },
    {
        "title": "What sorts of laws would prevent absentee ownership?",
        "author": "ElectronGuru",
        "url": "https://www.nbcnews.com/data-graphics/absentee-homeowners-crowding-housing-market-data-rcna69828",
        "text": "",
        "created_utc": 1677265594,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Pruitt-Igoe Experiment: How Modernist Architecture Failed to Meet Social Needs",
        "author": "Sofiane-Sc",
        "url": "https://youtu.be/H4a2zZCwU80",
        "text": "",
        "created_utc": 1677264868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ways to reduce travel demand produced by a company?",
        "author": "Skillagogue",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11awo5d/ways_to_reduce_travel_demand_produced_by_a_company/",
        "text": "[removed]",
        "created_utc": 1677259213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Zoning Officers Get AICP Certification?",
        "author": "tcp310",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11atlwy/can_zoning_officers_get_aicp_certification/",
        "text": "I’m currently working as a planner trainee and have been thinking about pursuing being a zoning officer. Can you get the certification working as one? Also I am in New Jersey so I am also wondering if I would be able get the PP license as well.",
        "created_utc": 1677251382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most Aesthetic City/Municipal Plans",
        "author": "iwearstripedshirts",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11at5tb/most_aesthetic_citymunicipal_plans/",
        "text": "Currently rewriting the equivalent of a number of regional plans for my municipality. Trying to get some inspiration for the plans designs. If your city, town or municipality has a beautiful plan, or if you've seen one in passing, please link below!  \n\n\nThe two best I've seen are the New York City plan and Vancouver's Plan.",
        "created_utc": 1677250201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Appropriate junior planner salary for London, ON?",
        "author": "properthief",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11ahjsa/appropriate_junior_planner_salary_for_london_on/",
        "text": "Hello fellow planners in London and Ontario. I have a job interview with a small firm from this city next week and I'm sure they're gonna ask me what my expected salary range is. Unfortunately, I'm not from London or even Ontario (anymore) so I don't have an idea of what to say. The figures on Glassdoor look high to me for my range of experience...\n\nAbout me: junior urban planner of just 10 months in MB, private sector and mostly just municipal and economic dev work, and I'm currently making about $30/hr. Also, I don't even have a masters in planning, just a degree in an environmental design l.arch track.\n\nWhat should I expect them to offer / what should I be roughly asking for?",
        "created_utc": 1677210094,
        "upvote_ratio": 1.0
    },
    {
        "title": "How has AMANDA helped? Does it suck?",
        "author": "adork",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11ah8a7/how_has_amanda_helped_does_it_suck/",
        "text": "I work for an Ontario municipality as a site plan planner and we're moving to AMANDA. I'm wondering, do planners in other munis with AMANDA find it helpful? or do are you working around it? Is it really going to save me time, or just create another step in the application process?",
        "created_utc": 1677209138,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to move into a city without contributing to displacement and financial strain for the pre-existing residents?",
        "author": "_Fruit_Loops_",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11afy4c/how_to_move_into_a_city_without_contributing_to/",
        "text": "Firstly, I specifically use the term “displacement and financial strain” and not “gentrification” because nobody really seems to agree on what “gentrification” even means.\n\nSecondly, I’m already a big believer in the fact that this is much more of a systemic issue caused by landlords, businesses, and restrictive zoning than many people think. But at the same time, this machine only runs because its wheels are oiled by the inflow of newer and higher-income residents.\n\nWhich brings me back to my question: How do I (as a university grad) move into a city without contributing to displacement and financial strain for the pre-existing residents? What cities, neighborhoods, housing, and jobs should I look for? What sort of consumer habits should I partake in? What annoying behaviors should I avoid? I’m looking into Chicago specifically, if that helps.\n\nThanks very much for any advice.",
        "created_utc": 1677205297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Private parking/uses in public right-of-way: does anybody have experience untangling a similar mess?",
        "author": "merferd314",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11a9c7z/private_parkinguses_in_public_rightofway_does/",
        "text": "I am working for an irate suburban client who is facing heat to improve their main commercial strip. The commercial district has wall-to-wall buildings that are setback about 10' from the right-of-way line and about 25' from the curb. These buildings were built long before the State widened and widened the road they are built along to the point where the sidewalk was removed to accommodate more motor vehicle lanes. Now it's a 4-lane urban section with no sidewalks and perpendicular/angled parking that is served directly from the arterial. The village has done a really poor job of access management, so now they are in a situation where the public right-of-way has devolved into narrow parking lots for these private uses.\n\nHas anybody else helped out a municipality with restoring the public right-of-way for public use and removing the \"grandfathered in\" parking? It's a major safety issue having cars back into high speed arterial traffic and having no pedestrian access to these businesses is making it very hard to activate the commercial district. How much of a fight was it? What legal standing does the village have (outside of \"its our property, not yours\") to remove these dangerous parking areas?",
        "created_utc": 1677187822,
        "upvote_ratio": 1.0
    },
    {
        "title": "We Finally Know Why It Costs So Damn Much to Build New Subways in America",
        "author": "A_Light_Spark",
        "url": "https://slate.com/business/2023/02/subway-costs-us-europe-public-transit-funds.html",
        "text": "",
        "created_utc": 1677185959,
        "upvote_ratio": 1.0
    },
    {
        "title": "How you all feel about freeway caps? Dallas’ Klyde Warren Park has been extremely successful. Other cities are planning their own deck park as a result.",
        "author": "dallaz95",
        "url": "https://youtu.be/K_ZcBSPwkPE",
        "text": "",
        "created_utc": 1677185197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should Brooklyn Build Taller in its major Avenues?",
        "author": "feloniusmonk",
        "url": "https://youtube.com/shorts/LiwdXoaI7bk?feature=share",
        "text": "",
        "created_utc": 1677181479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two way Cycle Track with direction swapped (riding on the left side instead of right)",
        "author": "Miserable-Spirit-345",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11a61uw/two_way_cycle_track_with_direction_swapped_riding/",
        "text": "Has anyone designed a two way cycle track that is riding on the left side instead of right side?  Is it even legal since vehicle code has stated that the vehicle needs to drive on the right side; and bike basically follows the vehicle code?",
        "created_utc": 1677179786,
        "upvote_ratio": 1.0
    },
    {
        "title": "promoted out of need - help fill a knowledge gap in text",
        "author": "Want2makeFMcontent",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11a5v7l/promoted_out_of_need_help_fill_a_knowledge_gap_in/",
        "text": "My boss ended up on permanent vacation. Out of necessity I was bumped into his position PREMATURELY. I have strength in planning concepts, zoning  and real estate development (I was a private developer who went to public sector) I can disseminate info, do plan review, but i dont know how to present or format NEW zoning code ammendments and new sections.  I only did the research and drafted the language. Its a weird gap in knowledge. Now im drafting licensing too (like air bnb, sex offender group housing). That part's fine...\n\nFrankly I dont know how the handoff works after I draft the language. My boss did that without my involvement. Any help or good books i can read?",
        "created_utc": 1677179321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice/Guides for someone looking to become and UP",
        "author": "PaleontologistNo3183",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11a5f5p/adviceguides_for_someone_looking_to_become_and_up/",
        "text": "Hello! I have a BS in GIS and am looking into going to GA State Univ for their MIS in Urban Studies program. I've wanted to become an urban planner or transportation planner for the longest time and am wanting some advice from people starting out and those really tenured in their career! Although GSU isn't AICP accredited, you can take the test with a masters degree/experience, and I'm looking for some tips and tricks with dealing with the certification as well.\n\nMostly, I'm here to indulge myself with everything there is to know about UP and it's associated challenges, benefits, and roles. \n\nThanks in advanced, and here's to hoping I'll be joining you one day!",
        "created_utc": 1677178267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reshaping Cities for Present-Day Populations",
        "author": "Planetizen",
        "url": "https://www.planetizen.com/features/121809-reshaping-cities-present-day-populations",
        "text": "",
        "created_utc": 1677177736,
        "upvote_ratio": 1.0
    },
    {
        "title": "When there’s a will, there’s a way. Some of the world famouse cityscapes with massive transformation to green cover. In the era of high weather uncertainity, nature should be recovered and prefered over grey infrastructures for climate-resilient cities.",
        "author": "Salam95",
        "url": "https://www.reddit.com/gallery/11a4veb",
        "text": "",
        "created_utc": 1677177054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cities with decent urban planning and good access to hiking?",
        "author": "JoeDMTHogan",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11a3jmd/cities_with_decent_urban_planning_and_good_access/",
        "text": "Boulder comes to mind, can’t really think of anything else",
        "created_utc": 1677173767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Successful Rent Control: lets talk about it",
        "author": "DoxiadisOfDetroit",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11a2x15/successful_rent_control_lets_talk_about_it/",
        "text": "So, we all know that the policy of rent control is hated by most urbanists and economists because it supposedly drives perverse incentives in the housing market. But. what if I were to tell you that there is a city out there in the world which has implemented rent control in a successful way? I hope by highlighting this city that we can reconsider attitudes towards the policy and see it as a useful tool rather than some poorly conceived policy\n\nSo, the city that we'll be talking about today is a favorite for left-urbanists and for good reason: it shows an alternative to the prevailing market-oriented mode of thinking when it comes to cities and urbanism. That city is Vienna.\n\nVienna has not only successfully maintained massive amounts of public housing but has also implemented rent control to great success. Let's take a look into how their system of rent control works:\n\nIn Vienna, all apartments built before 1945 is subject to rent control, and rent controls are based on unit characteristics like the value of land, a unit's location, square footage, and fixtures like flooring cabinetry. Also, even though private-for-profit housing makes up 42% of housing stock in the city, 77% of that figure is subjected to rent controls.\n\nThe reason why Vienna's rent control doesn't turn into a situation like San Francisco is because the municipal government actively steps in to build housing when demand increases (so yimbys will be happy about that)\n\nI'm hoping that shedding a little light on this application of rent control will change some minds over to supporting it since it ***can*** work when applied with other policies such as building to meet demand",
        "created_utc": 1677172248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying for Urban Planning Graduate Program with B.S. in Construction Management",
        "author": "otisC34",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11a2imj/applying_for_urban_planning_graduate_program_with/",
        "text": "I am looking to apply to Urban Planning/City Planning/Regional Planning Graduate Programs in various schools around the country, but preferably in an urban university. I am graduating in December with a Bachelor's of Science in Construction Management, but I am really interested in furthering my education in Urban Planning. That's where my heart is.\n\nHow would my luck fare with applying to an Urban Planning Graduate Program with this bachelor's degree? I know it isn't the closest major to Urban Planning, but it's not the farthest thing either.\n\nAnything helps; thanks!",
        "created_utc": 1677171313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources to get into Urban Planning",
        "author": "RoopLoops",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11a1zoy/resources_to_get_into_urban_planning/",
        "text": "I have a mechanical engineering background and just recently graduated college, but I've been really interested in getting into urban planning specifically surrounding transportation design. I wanted to know if there are others with an engineering background that have been able to move into the industry without having to go back to school and how difficult it was to get a job where you felt like you were learning and doing meaningful work, and if there are any resources that you found helpful. \n\n&amp;#x200B;\n\nLove the community, and want to help make our cities more affordable and accessible.",
        "created_utc": 1677170049,
        "upvote_ratio": 1.0
    },
    {
        "title": "San Francisco holds its breath to find out how much it will cost to protect its waterfront from sea level rise",
        "author": "Hrmbee",
        "url": "https://news.yahoo.com/san-francisco-holds-its-breath-to-find-out-how-much-it-will-cost-to-protect-its-waterfront-from-sea-level-rise-100005146.html",
        "text": "",
        "created_utc": 1677144362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on these urban planning books",
        "author": "chucknorrisjunior",
        "url": "https://www.reddit.com/r/urbanplanning/comments/119qcot/advice_on_these_urban_planning_books/",
        "text": "I'm an amateur who just has an interest in urban planning and would like to learn more about what makes cities work well.  On the subject, I've only read The Death and Life of Great American Cities by Jane Jacobs, which I greatly enjoyed.  I've come up with this reading list based on my interest and the good reviews.  I'm wondering if anyone has thoughts on what order to read them in?  Thanks!\n\n&amp;#x200B;\n\nOrder Without Design by Alain Bertaud\n\nTriumph of the City by Ed Glaeser\n\nHappy City by Charles Montgomery\n\nWalkable City by Jeff Speck\n\nArbitrary Lines by M. Nolan Gray\n\nStrong Towns by Charles Marohn",
        "created_utc": 1677132639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would an MPP with course work focusing on planning related topics (I.e GIS) be good enough to break into urban planning?",
        "author": "wetpanncake",
        "url": "https://www.reddit.com/r/urbanplanning/comments/119pgkh/would_an_mpp_with_course_work_focusing_on/",
        "text": "[removed]",
        "created_utc": 1677129757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sales to Urban Planning Masters?",
        "author": "WhatIsGoingOnPlease",
        "url": "https://www.reddit.com/r/urbanplanning/comments/119oyvt/sales_to_urban_planning_masters/",
        "text": "[removed]",
        "created_utc": 1677128244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laneform: A Visual Preference Survey Tool With AI Generated Image Libraries",
        "author": "whatsamiddler",
        "url": "https://laneform.com/",
        "text": "",
        "created_utc": 1677117419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whats the structure of a socialist city",
        "author": "06jozko_vajda06",
        "url": "https://www.reddit.com/r/urbanplanning/comments/119i3c6/whats_the_structure_of_a_socialist_city/",
        "text": "Hi, I have a project for my middle school. I need to tell about the structure of a socialist city but cant find any models that I would understand as Im not studying urban planning. Could someone tell me or direct to some source? Where did they plan to put their industry? I understand that they built so called districts (like housing estates) with blocks of flats with schools, shops and hospitals in good reach but what about any other particular parts like industry, energy and anything else? It would really appreciate any help, thanks guys.",
        "created_utc": 1677109708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Translating immigration documents (urban planning degree)",
        "author": "LukeYear",
        "url": "/r/australia/comments/119gazk/translating_immigration_documents/",
        "text": "",
        "created_utc": 1677105645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for help building a list of smaller-scale railyard redevelopments across the US",
        "author": "123wil812",
        "url": "https://www.reddit.com/r/urbanplanning/comments/119dcqf/looking_for_help_building_a_list_of_smallerscale/",
        "text": "Hey everyone!!!! :D\n\nI'm currently working on a research project focused on railyard redevelopments in the United States, and I've been able to find a lot of information on some of the larger-scale projects that have received a lot of attention in the media, like the Hudson Yards and the Union Station Redevelopment in Denver.\n\nHowever, I'm also interested in smaller-scale projects that may not have received as much attention. I'm hoping to compile a comprehensive list of railyard redevelopments across the country that have transformed former railyards into new mixed-use developments, including residential, commercial, and retail spaces.\n\nSpecifically, I also would like to find some redevelopments that are already finished because a lot of the ones I find are still in progress or are never finished. Additionally, I am interested in learning about the economic and demographic impact of these redevelopments and how they contribute to building more sustainable infrastructure \n\nIf anyone has any information on smaller-scale railyard redevelopments that they think would be worth looking into, I would greatly appreciate any leads you could offer. Additionally, if you have any resources that you would recommend for finding information on these types of projects, I would be grateful for any guidance you can provide.\n\nThank you so much for your help!",
        "created_utc": 1677100303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bike infra on narrow ROWs?",
        "author": "AllisModesty",
        "url": "https://www.reddit.com/r/urbanplanning/comments/1199se5/bike_infra_on_narrow_rows/",
        "text": "So like a lot of people I got into urban planning cause of YouTube channels like NJBs among others. I've recently got a bike and have become somewhat of a fair weather cyclist, but one nonetheless (previously I hadn't so much as mounted a bike since I was maybe 9-10).\n\nThis got me thinking, what infrastructure can exist on narrow roads? Of course it's easy on multi lane roads, especially with wide lanes. Removing one drive lane is enough to add two way cycling infrastructure, enough that it should theoretically improve traffic, assuming a sufficient number of trips are within cycling distance.\n\nBut what about narrow roads? I live in a semi rural area. Lots of narrow farm roads and moderate traffic city streets without enough ROW for bike lanes. I've heard of edge lanes and bicycle boulevards.\n\nWhat are the best treatments on roads without sufficient width?",
        "created_utc": 1677095270,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a Canadian wanting to get my RPP designation",
        "author": "Alert-News-3546",
        "url": "https://www.reddit.com/r/urbanplanning/comments/1199lel/im_a_canadian_wanting_to_get_my_rpp_designation/",
        "text": "Is it better to go spend 2 years getting a Masters in planning \n\nOr\n\nTo get an entry level job, try to work my way up, and take some courses over time? \n\nMy goal is to work in land use planning as a consultant or for the municipality and to get my RPP designation.",
        "created_utc": 1677095006,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think are the most interesting and in demand planning specializations?",
        "author": "Alert-News-3546",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11992lz/what_do_you_think_are_the_most_interesting_and_in/",
        "text": "I’m considering a specialization in water, climate change, or environmental planning issues and I’m also curious about other ideas.",
        "created_utc": 1677094273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-Profit's Role in Urban Planning",
        "author": "NamuziV3rt",
        "url": "https://www.reddit.com/r/urbanplanning/comments/1198qdn/nonprofits_role_in_urban_planning/",
        "text": "I am currently working on a project for a nonprofit funder to create a strategy moving forward of how they should allocate their resources. The fund has primary focus areas of art, justice, and environment which I believe can all be strengthened through building community power and urban design/planning that actively supports the residents inside the city.\n\nThe reason for this post is to see if anyone would be interested to sit down for an hour or so conversation about urban planning generally, nonprofit's role in urban planning, how we can build a sustainable future, and other topics to help with my research! If you are down for a conversation than my DM's are open or comment on this post and we can try to set up a time that works best for everyone!",
        "created_utc": 1677093802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Casselberry, FL's Kelly Brock Claims the 2023 Complete Street Changemaker Title! | Bike/Walk Central Florida",
        "author": "BikeWalkCFL",
        "url": "https://bikewalkcentralflorida.org/casselberry-bike-walk-central-floridas-kelly-brock-claim-the-2023-complete-street-changemaker-title/",
        "text": "",
        "created_utc": 1677089209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinion: Induced Travel Demand Induces Media Attention",
        "author": "Planetizen",
        "url": "https://www.planetizen.com/blogs/121801-opinion-induced-travel-demand-induces-media-attention",
        "text": "",
        "created_utc": 1677088203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban planning in UK",
        "author": "NovelDragonfly821",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118zljk/urban_planning_in_uk/",
        "text": "I’m applying for masters in urban planning in UK and I was wondering how the employment scenario was, especially as an international student with a bachelors in a non architecture/ planning field. I have a BA hons in geography with pretty decent grades.",
        "created_utc": 1677074042,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your genuine opinion on cars?",
        "author": "sketching_utopia",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118yml3/whats_your_genuine_opinion_on_cars/",
        "text": "Honest question here.\n\nI'm an urban planner in a mid-size city in north america. Obviously, I learned years ago the negative impact car centric city planning has had on our built environment. I work every day with planning directives that aim to give back the city to pedestrians and bikers. And I deeply agree with all this, don't get me wrong.\n\nAnd yet I just bought a SUV and I feel quite hypocritical (To add, we already had a very small car, so this is our 2nd). After all the pre-conceptions I had, in the end it was a very personal decision, we wanted the comfort and security of this type of car for our family and the flexibility of a 2nd car.\n\nSo yeah, i'm just curious... what's the opinion of this sub on owning cars?",
        "created_utc": 1677072306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will we say Vancouver is very well planned？",
        "author": "ljublvienna",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118uk4g/will_we_say_vancouver_is_very_well_planned/",
        "text": "Although it seems Vancouver have significant problem on affordability because of zoning, but for public transit, road(traffic), walkability, vitality，is Vancouver one of the best in NA?",
        "created_utc": 1677060844,
        "upvote_ratio": 1.0
    },
    {
        "title": "A poster that explains the 10 principles of designing Healthy Streets, set in the Indian context",
        "author": "myeyebrowsarenice",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118rjzh/a_poster_that_explains_the_10_principles_of/",
        "text": "Hello everyone, we created this poster (in 6 Indian languages) as a giveaway for Indian government officials, decision-makers and urban practitioners, that illustrates the key messages of what makes a Healthy Street. These principles are part of the \"Healthy Streets Policy\" that 11 Indian cities have adopted, and 18 more are in the process of adopting.   \n\n\nI welcome your comments on whether the poster conveys the intended message well. You can also give your suggestions to make it better. Thank you in advance!",
        "created_utc": 1677049391,
        "upvote_ratio": 1.0
    },
    {
        "title": "MUP but different bachelors",
        "author": "Infamous-Situation-3",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118qidr/mup_but_different_bachelors/",
        "text": "Hello,\nI have serious questions to current planners, or hiring department\nI have graduated with Sociology B.A.\nplanning to earn Master in Urban Planning from USC.\n\nDoes it look bad on the resume? because my bachelor is in sociology?\nIs it not okay to find the job as Urban Planner?\n\n\nThank you😥",
        "created_utc": 1677045621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Case studies of reformed car-centric suburbs?",
        "author": "_Fruit_Loops_",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118mhag/case_studies_of_reformed_carcentric_suburbs/",
        "text": "Have there ever been any significant examples of car-centric suburban development being reformed into something more livable and sustainable? Not just bulldozed and replaced, but retrofitted into a updated version of itself.",
        "created_utc": 1677032909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making Transportation Faster, Cheaper and Safer",
        "author": "punkthesystem",
        "url": "https://www.discoursemagazine.com/culture-and-society/2023/02/20/making-transportation-faster-cheaper-and-safer/",
        "text": "",
        "created_utc": 1677030751,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Defense of American Cardboard Houses",
        "author": "ilovepizza1183",
        "url": "https://youtu.be/moxwfqAsvTI",
        "text": "",
        "created_utc": 1677027404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Windows to the city",
        "author": "windowstothecity",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118jd5k/windows_to_the_city/",
        "text": "[removed]",
        "created_utc": 1677024214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Windows to the City research",
        "author": "windowstothecity",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118jc6m/windows_to_the_city_research/",
        "text": "[removed]",
        "created_utc": 1677024147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me get youth excited about urban planning.",
        "author": "whateverandok",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118fqzn/help_me_get_youth_excited_about_urban_planning/",
        "text": "I’ll be hosting youth to talk about urban planning/community programs. \n\nMy idea was to get “real life” Sims or something similar going. I really want them to get excited about the little things and make our booth interactive. \n\nAny ideas or feedback on this?",
        "created_utc": 1677015283,
        "upvote_ratio": 1.0
    },
    {
        "title": "AICP study resources?",
        "author": "Available_Curve5074",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118csmy/aicp_study_resources/",
        "text": "Probably going to take the exam in a year. I’m having trouble finding many study guides, resources, prep books in general for the exam",
        "created_utc": 1677005867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for handling a troublesome developer?",
        "author": "ChittyChats",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118co04/advice_for_handling_a_troublesome_developer/",
        "text": "Hello! I’m new to this sub and would appreciate any insights or advice from those with a bit more experience in economic development and urban planning.\n\nI am on the board for a neighborhood association in the Midwest. We are a non-profit group with limited jurisdiction or say outside of letters of support for variances, expressing neighbors needs for the community, and grant writing for improvement projects. We have a great relationship with our businesses and local developers to help them navigate improving our community.\n\nWe have one developer that has been a regular concern. They own 8-10 (estimating) commercial spaces in our commercial corridor that vary from empty lots to fully renovated spaces being rented to businesses. This developer has regularly scared away and hads haulted a lot of progress in our commercial district. There are now three cases where this developer has attracted a business, the business has invested money in renovating the space, and then something comes to light where the business won’t work in that space and suddenly the business is out a bunch of money and we lose a business on our corridor. Most recently, a bar was in late stages of their renovations and discovered that because the property zoned across the street was residential and only 22 feet from the bar’s door… they were never going to be allowed their liquor license. \n\nIt’s now to the point where our business owners and potential businesses are wary of our neighborhoods commercial space because this developer owns the majority of the spaces available. Knowing that our jurisdiction is limited… is there anything that you think my board or community can do?",
        "created_utc": 1677004939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Planning Trends to Watch in 2023",
        "author": "Planetizen",
        "url": "https://www.planetizen.com/features/121789-planning-trends-watch-2023",
        "text": "",
        "created_utc": 1677002733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best urban planning masters programs in Europe?",
        "author": "Half-Moon-21",
        "url": "https://www.reddit.com/r/urbanplanning/comments/118biep/best_urban_planning_masters_programs_in_europe/",
        "text": "Looking for recommendations for masters degree in Europe (prefer UK, France, Netherlands, Germany or Italy but open to other areas) in Urban Planning or similar. \n\nBachelors degree is in Environmental Engineering from Georgia tech. Thanks.",
        "created_utc": 1677002063,
        "upvote_ratio": 1.0
    }
]