[
    {
        "title": "What metrics measure success",
        "author": "ZipFlow",
        "url": "https://www.reddit.com/r/urbanplanning/comments/100acfr/what_metrics_measure_success/",
        "text": "[removed]",
        "created_utc": 1672541955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intermediate Book Recs",
        "author": "Patient-Device-1135",
        "url": "https://www.reddit.com/r/urbanplanning/comments/100a21h/intermediate_book_recs/",
        "text": "Ive already read Death&amp;Life, Confessions, Walkable City, Color of Law, Invisible City, and other school required books. Im 60% in my MSURP.\n\nWhat books would be a good next step? Looking for more than the basic \"car bad, walk good\" type of happy planner beginner books if that makes sense",
        "created_utc": 1672540911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know how I can get NACTO design guides free or discounted?",
        "author": "glazedpenguin",
        "url": "https://www.reddit.com/r/urbanplanning/comments/1006x17/does_anyone_know_how_i_can_get_nacto_design/",
        "text": "They seem highly recommended and even my city DOT mentions them in job listings. Is there any way to get these for less than $50 a pop?",
        "created_utc": 1672530584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Sprawl isn't Limited by Commute Distances",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/1006tw5/why_sprawl_isnt_limited_by_commute_distances/",
        "text": "One idea I have seen floated around here is the idea that a place reaches \"peak sprawl\" when commute distances become too long to support more urban sprawl. That people will get tired of commuting ever longer distances and therefore cities will stop expanding outwardly. This idea also motivates the \"jobs housing balance\" concept.\n\nThis based on several assumptions that are not actually true. \n\nPeople won't tolerate long commutes - in fact people often do tolerate long commutes. Supercommuting is rare but does happen, in the bay area people often spend 3 hours per day commuting.\n\n[https://abc7news.com/super-commuters-bay-area-traffic-3-hour-commute-three/5195381/](https://abc7news.com/super-commuters-bay-area-traffic-3-hour-commute-three/5195381/)\n\nEmployment is centralized in a monocentric manner - This ignores polycentrism and job sprawl\n\nI. Job sprawl is a thing - Employment is to some degree centralized, however job sprawl is a thing. As people decentralize, jobs will do so as well. Much of the commuting in the United States is suburb to suburb as opposed to being from a suburb to a job center. Suburb to suburb commuting and job sprawl mean that more sprawl doesn't necessarily create longer commutes. If more sprawl happens jobs will move where the sprawl is.\n\nMost employment is job sprawl - From \"Don't call it sprawl\" by William T Bogart \"Employment in Centers Reaches 30–40 Percent (and less than half of this is downtown): The majority of employment is dispersed throughout the metropolitan area.\"\n\nRoughly 40 percent of commutes are suburb to suburb commutes.\n\n[https://energyfuse.org/fuel-implications-of-suburb-to-suburb-commuting/](https://energyfuse.org/fuel-implications-of-suburb-to-suburb-commuting/)\n\nII. Multiple employment Centers exist - Even transit oriented places aren't necessarily monocentric. Tokyo, for example, on top of its massive Central Business district has the Yamanote loop, Shibuya, Shinkjuku, and Yokohama. Paris has central Paris and La Defence.\n\n[http://www.demographia.com/db-intlcbddens.htm](http://www.demographia.com/db-intlcbddens.htm)\n\nSeoul has several additional job centers such as Incheon, Ilsan, Bundang and Gyeonggi\n\n[https://en.wikipedia.org/wiki/Seoul\\_Capital\\_Area#Gyeonggi-do](https://en.wikipedia.org/wiki/Seoul_Capital_Area#Gyeonggi-do)\n\n[https://en.wikipedia.org/wiki/List\\_of\\_edge\\_cities#Seoul](https://en.wikipedia.org/wiki/List_of_edge_cities#Seoul)\n\nIn the United States and other places, secondary job centers called \"edge cities\" have emerged. These are places built on the Urban fringe, but they often have high job concentrations and some degree of high density residential development. For example, Orange County CA started out as an extension of Los Angeles but most of residents don't work in LA, they work in places like Irvine, Anaheim or Santa Ana. As people have moved to Orange county, it hasn't resulted in people commuting longer distances to LA, but rather the strengthening of job centers in Orange County. To the extent that there is commuting to LA, much of it is to areas that border Orange County such as Long Beach.  Orange county was originally settled thanks to Pacific Electric, the expectation back then was people would work in Los Angeles county, but that has changed and many places that were created suburbs have become cities in their own right. The Washington DC area is filled with multiple job centers such as Arlington and Tysons square. \n\n[https://en.wikipedia.org/wiki/Edge\\_city](https://en.wikipedia.org/wiki/Edge_city)\n\nCities expanding outwardly won't necessarily result in longer commutes because jobs can sprawl just like people can and even assuming a centralized employment model, new job centers can emerge if enough people move to an area.\n\n\"The basic idea of polycentricity is that multiple centers or cities, and hence multiple sources of agglomeration economies, are co-located and also interact, given the widening geographical scale of economic and social processes\"\n\n[https://www.lboro.ac.uk/microsites/geography/gawc/rb/rb330.html](https://www.lboro.ac.uk/microsites/geography/gawc/rb/rb330.html)\n\nWilliam T. Boggart in \"Don't call it sprawl\", has pointed that commute times have stayed roughly constant despite urban sprawl.\n\n\"Twenty-Five-Minute Average Commute (and 85 percent commute fewer than forty-five minutes): Despite popular concerns over long commutes, commuting times have stayed almost constant for decades. The distance commuted has increased, but the distribution of time spent commuting hasn’t changed, as the growing use of cars combined with the decentralization of employment has dispersed congestion from the downtown throughout the metropolitan area\".\n\nProblems with the Jobs/Housing Balance Concept\n\nWith regards to the jobs/housing balance concept you could certainly enable more people to live closer to where they work, but decisions regarding housing are complex as are decisions regarding where employers decide to locate. Proximity to work may influence people's housing choices, but it's not the only factor nor the main one. \n\nRobert Cervero points out that even when people have the option of residing closer to work, they won't necessarily choose to do so.\n\n[https://www.tandfonline.com/doi/abs/10.1080/01944369608975714](https://www.tandfonline.com/doi/abs/10.1080/01944369608975714)\n\n\"Several Bay Area cities are nearly perfectly balanced, yet fewer than a third of their workers reside locally, and even smaller shares of residents work locally.\"\n\nHow affordable it is to live closer to work is only one of many factors behind people's housing choices.",
        "created_utc": 1672530299,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you develop the best ordinance for your community? (USA)",
        "author": "jensenses",
        "url": "https://www.reddit.com/r/urbanplanning/comments/1006i3e/how_do_you_develop_the_best_ordinance_for_your/",
        "text": "I recently took a position on my city's Planning Commission and our first initiative is to update the ordinance related to business signs. My background is in Public Health Management and Policy but I currently work in tech and I wanted to apply my education to supporting my community but I don't really know where to start when it comes to revising and developing ordinances.\n\nDo you look to communities that you want to model after? Is there like an encyclopedia with with evidence based ordinances? Is it reasonable to have metrics that we used to measure the success of a policy and then  revise it if its not working? \n\nHoping this community can provide some insight and best practices that I can bring to my town! Thank you in advance!",
        "created_utc": 1672529259,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does urban planning as a career really entail?",
        "author": "streeker22",
        "url": "https://www.reddit.com/r/urbanplanning/comments/1005q64/what_does_urban_planning_as_a_career_really_entail/",
        "text": "I read a post that was made the other day about working as an urban planner, and a lot of the comments seemed to be dissuading the OP from pursuing that career. A lot of their main points came down to the fact that urban planners don't really have any effect on the actual city, which was the main thing that concerned me; I can handle navigating bureaucracy and \"customer service,\" but I don't want to have a job that really has no effect on the world. So, I'm just trying to seek out an exact answer to what urban planners really DO.  \n(P.S. Of course I don't expect to be doing anything substantial within a few years of becoming an urban planner, but if I could be in the field for 10+ years and still doing very little, then I'm concerned.)",
        "created_utc": 1672526852,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to advertise to planners",
        "author": "realatomkirk",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zzxll7/how_to_advertise_to_planners/",
        "text": "We make software for planners. So far demos at APA conferences has been our best channel yet, but Im curious if there are other places planners visit regularly? This sub? Youtube channels? Websites? Other conferences?\n\nThis is a genuine question and not a self promotion, so hopefully I’m not violating policies but apologize if I am.",
        "created_utc": 1672503620,
        "upvote_ratio": 1.0
    },
    {
        "title": "This tiny Dutch vehicle for people with disabilities is taking off",
        "author": "thefinancenerd",
        "url": "https://www.technologyreview.com/2022/12/26/1064764/diversity-linguistics-project-us/",
        "text": "",
        "created_utc": 1672501501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Neighborhoods and Small Businesses Thrive in Tokyo | CityLab",
        "author": "WildestDreams_",
        "url": "https://archive.is/2022.07.22-144647/https://www.bloomberg.com/news/articles/2022-07-21/tokyo-s-urban-planning-secrets-revealed-in-new-book",
        "text": "",
        "created_utc": 1672493950,
        "upvote_ratio": 1.0
    },
    {
        "title": "How competitive? UIC, U Toronto, York University",
        "author": "Accomplished-Net7930",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zznafn/how_competitive_uic_u_toronto_york_university/",
        "text": "Hi all, I am applying to grad schools and I’m pretty dead set on moving to Toronto or Chicago (I am American but trying to become a permanent resident in Canada if possible). For this reason, I was only going to apply to 4 schools: University of Illinois Chicago, university of Toronto, York university, and Toronto metropolitan university. \n\nMy problem is, I’m not sure how competitive the first 3 programs are (TMU is very competitive, only 1-2 international acceptances), can’t decide if it’s worth it to apply to another program or two that I’m more confident I’ll get into. I couldn’t find much data on admissions so I’m totally unsure whether I’m being unrealistic only applying to those 4.  \n\nIf anyone has insight into how selective these programs are, I would love to hear any thoughts! If you got into any of these programs, what prior experience did you have/did you consider yourself a competitive applicant or not necessarily?",
        "created_utc": 1672467397,
        "upvote_ratio": 1.0
    },
    {
        "title": "To what extent will builder's remedy change California? Will we see more affordable housing and more dense, multifamily units in the coming years?",
        "author": "IjikaYagami",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zzn5w1/to_what_extent_will_builders_remedy_change/",
        "text": "From my understanding, under the builder's remedy law, cities that don't submit good housing plans that accommodate for sufficient population and new units get their zoning laws trashed, and developers are allowed to build whatever they want provided at least 20% of units are affordable or 100% of units are middle income, and the new developments comply with health and safety codes.\n\nHowever does this sound too good to be true?  Will this really be a bulletproof silver-bullet solution to make California more affordable?  Will we see denser, more walkable communities in the coming years?",
        "created_utc": 1672466958,
        "upvote_ratio": 1.0
    },
    {
        "title": "To what extent will builder's remedy change California? Will we see more affordable housing and denser developments in the coming years?",
        "author": "prowlprime",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zzn4lo/to_what_extent_will_builders_remedy_change/",
        "text": "From my understanding, under the builder's remedy law, cities that don't submit good housing plans that accommodate for sufficient population and new units get their zoning laws trashed, and developers are allowed to build whatever they want provided at least 20% of units are affordable or 100% of units are middle income, and the new developments comply with health and safety codes.\n\nHowever does this sound too good to be true?  Will this really be a bulletproof silver-bullet solution to make California more affordable?  Will we see denser, more walkable communities in the coming years?",
        "created_utc": 1672466827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Detail of Hong Kong government's new social housing for the youth scheme.",
        "author": "qunow",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zzme9o/detail_of_hong_kong_governments_new_social/",
        "text": "https://skypost.ulifestyle.com.hk/article/3401024/%E9%85%92%E5%BA%97%E8%AE%8A%E9%9D%92%E5%B9%B4%E5%AE%BF%E8%88%8D%20%E5%85%A5%E4%BD%8F%E9%A0%88%E6%AF%8F%E5%91%A8%E6%9C%80%E5%B0%914%E5%B0%8F%E6%99%82%E7%A4%BE%E6%9C%8D\n\nHong Kong government launched this policy with the claimed goal of resolving demand for home among young people in the city.\n\nProposal:\n* Hotel and hostel will be turned into housing operated by NGO for young people and be leased to them at up to 60% market price, with expected monthly rent of about 900 USD after subsidy.\n* 3000 places expected to be available in 5 years and residents can live no more than 5 years in them.\n* Residents are required to contribute to the society to enjoy this benefit. They need to provide at least 400 hours social service each year, with a per week minimum of 4 weeks.\n* NGO operators can allocate 5% units to those who don't fulfill the criteria but they deemed fit.\n* NGO Operators must ensure the residence fit the requirement set out in Hong Kong National Security Law and other relevant laws.\n\nCriteria:\n* Young people age between 18-30 years old working full time work (including self-employed, but excluding students) with monthly salary below 3200 USD, and individual net worth below 50,000 USD, are eligible for the programme\n* No restriction on marriage status or whether they work inside Hong Kong. (Aka people who work in Mainland China and commute across border will be eligible)",
        "created_utc": 1672464353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I pursue a Masters in Urban Planning? I have 6 years of experience in Cybersecurity/IT Project Management. Want to Change Careers",
        "author": "gentnscholar",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zzjqce/should_i_pursue_a_masters_in_urban_planning_i/",
        "text": "I have a B.S. in Information Technology and a Graduate Certificate in Project Management. I have 6 years of experience performing project &amp; change management within the compliance &amp; governance (cybersecurity) department for a large corporation. \n\nI don't find cybersecurity/IT fulfilling at all. I ironically pursued the field because I thought I'd like it but I was also desperate for a living wage job so I could get a car &amp; escape being under house arrest (funny, I was born in NYC, should've considered returning back then). During the pandemic, I discovered Not Just Bikes &amp; basically became militantly orange-pilled. \n\nI'm at a juncture in my life where I'm evaluating my career options &amp; need to really make a decision on this career change already.  I vehemently despise car-dependency &amp; urban/suburban sprawl &amp; wanna do what I can to fight it. I acknowledge urban planning is largely political, however I'm thinking that maybe this could be the career path for me? \n\nI'm currently in Orlando, FL. I know UCF has a Masters in Urban Planning. I'm curious to know if I'd be able to acquire an entry-level role after the degree in NYC or some other walkable city? \n\nJust seeking some insight. My strengths lie more on the verbal-linguistic side, I'm not much of an engineer or programmer at all (big reason why I wanna transition outta IT in the first place). I'm also curious about job-security as well (how recession-proof is the field). \n\nAppreciate any advice.",
        "created_utc": 1672456037,
        "upvote_ratio": 1.0
    },
    {
        "title": "The U.S. Will Need Thousands of Wind Farms. Will Small Towns Go Along? | In the fight against climate change, national goals are facing local resistance. One county scheduled 19 nights of meetings to debate one wind farm",
        "author": "Hrmbee",
        "url": "https://www.nytimes.com/2022/12/30/climate/wind-farm-renewable-energy-fight.html",
        "text": "",
        "created_utc": 1672429354,
        "upvote_ratio": 1.0
    },
    {
        "title": "Different light rail systems?",
        "author": "Outrageous-Metal-967",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zyxrz3/different_light_rail_systems/",
        "text": "For a  project, I want to look at the possibility of a light rail system in a rural/regional setting. I want to know what the cost could be between a light rail system that will connect different towns and that of maintaining the current highways that connect them now and see if there is a feasible business model to be made here.   \nFor that, I'm really curious what different light rail systems are out on the market, and what their estimate costs are.    \n\n\nSo far I have founded the Siemens light rail systems, that looks jazzy.  \n[https://www.mobility.siemens.com/global/en/portfolio/rail/rolling-stock/trams-and-light-rail.html](https://www.mobility.siemens.com/global/en/portfolio/rail/rolling-stock/trams-and-light-rail.html)\n\nBut I'm curious if people know different producers and maybe have experiences in implementing a light rail system in a rural/regional setting.",
        "created_utc": 1672397824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Good Book Recs about Gentrification",
        "author": "Fattom23",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zyicpu/looking_for_good_book_recs_about_gentrification/",
        "text": "I'm mildly skeptical of the negative impacts of gentrification, but want to be informed about the other side. My skepticism stems from the appearance that every attempt to improve my city seems to result in cries that \"gentrification\" will negatively impact current residents. I'm looking for books that ultimately argue that increasing incomes and investment in a neighborhood/city are real problems that deserve to be dealt with, but don't assume that as a given. Basically, I'm looking for fair-minded books about the issue that argue gentrification is a process that should be stopped/prevented/managed. Any good recs?",
        "created_utc": 1672352373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we discuss street cars that run in the left or only lane in Toronto.",
        "author": "Emotional-Sir-8534",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zyi63q/can_we_discuss_street_cars_that_run_in_the_left/",
        "text": "I understand that some people envision a carless city, this is not one of those discussions. I want to talk about where we are today. \n\nThere are many ways cities have gone greener from hybrids, and other electric vehicles. \n\nNonetheless, other forms of transport still exist and need to be able to get from point a to point b efficiency. Inefficiency leads to more emissions from stop and go traffic. \n\nThat brings to mind the Toronto streetcars that block all traffic because they ride on the left lane. Buses, trucks, cabs, and community vehicles. Whenever the street car stops (there are many and they stop often) all traffic must stop and wait for them to unload making travel times across the city averaging over 10 minutes per mile. \n\nCars are allowed to park in the parking lane so you can't pass the streetcars many times. Or there are just single cars that are used by street cars and all other vehicles. \n\nBusiness efficiency drops because trucks deliveries stop when street car unloads on only traffic lane.\n\nQuality of life drops when you spend 45 minutes on transport traveling short distances that involve a single transfer. Car travel is shorter but still well over 20 minutes to go a short distance. \n\nPeople are spending long periods of time in transportation. \n\nFor this system to work Toronto would have to remain a low populated city or street traffic would be pretty bad. \n\nDiscussion on how to fix these issues in the future and ideas on how Toronto should improve it's street car blockages on already narrow or sometimes single lane streetcar/motor vehicle streets.",
        "created_utc": 1672351955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we talk about Toronto Street Cars?",
        "author": "Emotional-Sir-8534",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zyherz/can_we_talk_about_toronto_street_cars/",
        "text": "Are the street cars supposed to be green?.\n\nYou can't pass the street cars on the right when they stop, but they ride in the left traffic lane so they stop all traffic every time people need to get off.\n\nAll the stopping and going of all traffic seems counterproductive and causes more emission.\n\nIt also takes nearly 20 minutes to drive about 1.5-2 miles. But if you take the street car it takes 2x or even longer than driving to get to the same destination.\n\nStreet cars have to ride on the rail so if one is delayed it holds up other street cars because they can't pass each other and the cars can't pass the street cars.\n\nCars are allowed to park in the parking lane so you can't pass the streetcars many times.\n\nBusiness efficiency drops because trucks deliveries stop when street car unloads on only traffic lane.\n\nIt also seems like they did not think ahead. Canada needs more people but if the traffic in the city increases no one will ever get anywhere with the current setup of constant stopping of all traffic.\n\nWhy not just have hybrid or solar busses if they want to be green.\n\nOr at least put the street cars in the right lane so they don't stop all traffic?\n\nThe wires are overhead and appear to need constant maintenance and ruin the skyline.\n\nAlso driving on tracks in the left traffic lane is scary when it's icy and is a real tire killer.\n\nAm I missing a positive reason for doing this?",
        "created_utc": 1672350198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any cozy modern developments",
        "author": "bedobi",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zyha84/are_there_any_cozy_modern_developments/",
        "text": "Apologies for this vague question but\n\nI've seen, visited and lived in plenty of modern (say, 60s and on) and brand new suburbs and inner city areas both, and while some of them are visually appealing and well designed enough with attractive buildings, walkability, green areas etc they all have something in common: they feel sterile and lack in coziness. I happily admit these are subjective qualities but hopefully most people will intuitively understand what I'm getting at.\n\nWhat is it about neighborhoods that make them feel sterile vs cozy? I can think of a few things, eg the distance between buildings, the width of the streets, how much dead concrete (or even dead green lawn) space there is, how hard, unornamented and geometrical the space is, how mixed use and lively the street level is etc etc.\n\nPlease note, I don't mean to beat the dead horse of traditional vs modern architecture. I appreciate both, but there's no denying older neighborhoods tend to feel more cozy. (of course not all old neighborhoods feel cozy, I'm just saying, it's hard to beat the coziness levels of older streets in say Kyoto, Paris etc.\n\nWhy are modern developments designed so sterilely, and not designed to feel cozy? Do you know any modern developments that aren't so sterile and feel more cozy like older neighborhoods tend to?",
        "created_utc": 1672349898,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to help a small town in the middle of a polluted petro-chemical industrial center? long term plans?",
        "author": "insignificantsea",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zyh0np/how_to_help_a_small_town_in_the_middle_of_a/",
        "text": "I want to help a settlement(town? dunno how to describe it) named Villa Inflamable, in a Province-buenos aires- .\n\nthe town in question is reaching levels of pollution and pathogenic-charge that makes children be born with lead in their systems, respiratory diseases are common-place, and many more symptons which really resemble chemical warfare use in WW1.\n\nConsidering a 20-year lapse, and using crowfunding, adresses to local governors and mayors, alliances with construction firms and eco-friendly central planning; What even begin to be done?\n\nIm already in contact with a priest's charity who operates in the petro-chemical epicenter!",
        "created_utc": 1672349292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we discuss inefficiencies of street cars?",
        "author": "AffectionateTry3172",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zygex6/can_we_discuss_inefficiencies_of_street_cars/",
        "text": "[removed]",
        "created_utc": 1672347887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone Please Explain the Toronto Street Car System it doesn't seem to be well planned.",
        "author": "AffectionateTry3172",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zyfcmj/someone_please_explain_the_toronto_street_car/",
        "text": "This is one of the worst plans I have seen.\n\nAre the street cars supposed to be green?\n\nThe wires are an eyesore.\n\nYou can't pass the street cars on the right when they stop, but they ride in the left traffic lane so they stop all traffic every time people need to get off.\n\nAll the stopping and going of all traffic seems counterproductive and causes more emission.\n\nIt also takes nearly 20 minutes to drive about 1.5-2 miles. But if you take the street car it takes 2x or even longer than driving to get to the same destination.\n\nStreet cars have to ride on the rail so if one is delayed it holds up other street cars because they can't pass each other.\n\nIt also seems like they did not think ahead. Canada needs more people but if the traffic in the city increases no one will ever get anywhere with the current setup. It's hard enough with the little traffic they have now.\n\nWhy not just have hybrid or solar busses if they want to be green.\n\nOr at least put the street cars in the right lane so they don't stop all traffic?\n\nAlso driving on tracks in the left traffic lane is scary when it's icy and is a real tire killer.\n\nAm I missing a positive reason for doing this?",
        "created_utc": 1672345314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best example of good single family houses?",
        "author": "Seabass_23",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zyev48/best_example_of_good_single_family_houses/",
        "text": "Obviously the densest cities are achieved by building up, but the fact remains that there will be people with a family who want a bit more space, or simply those who like the idea of a house rather than an apartment. However there is obviously much to be improved over US style suburbia, so I ask this: What are some of the best examples of reasonably dense, walk/bike/train-able single house areas?",
        "created_utc": 1672344153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who had the idea to put Toronto street cars in the left traffic lane",
        "author": "AffectionateTry3172",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zycm6p/who_had_the_idea_to_put_toronto_street_cars_in/",
        "text": "This is one of the worst plans I have seen. \n\nAre the street cars supposed to be green? \n\nThe wires are an eyesore. \n\nYou can't pass the street cars on the right when they stop,  but they ride in the left traffic lane so they stop all traffic every time people need to get off. \n\nAll the stopping and going of all traffic seems counterproductive and causes more emission. \n\nIt also takes nearly 20 minutes to drive about 1.5-2 miles. \n\nIt also seems like they did not think ahead. Canada needs more people but if the traffic in the city increases no one will ever get anywhere with the current setup. It's hard enough with the little traffic they have now. \n\nWhy not just have hybrid or solar busses if they want to be green. \n\nOr at least put the street cars in the right lane so they don't stop all traffic? \n\nAlso driving on tracks in the left traffic lane is scary when it's icy and is  a real tire killer.",
        "created_utc": 1672339005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Congressional Spending Bill Includes First Ever Federal ‘YIMBY’ Grant Program",
        "author": "RogueDisciple",
        "url": "https://www.planetizen.com/news/2022/12/120612-congressional-spending-bill-includes-first-ever-federal-yimby-grant-program",
        "text": "",
        "created_utc": 1672324467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Vienna an example of good urban planning or just good housing?",
        "author": "newmanstartover",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zy4sqd/is_vienna_an_example_of_good_urban_planning_or/",
        "text": "Is Vienna an example of good urban planning or just good housing? Does it have other things that make a city well planned like greenery and parks, a good and diverse transportation infrastructure, being high density and mixed use, polycentric etc",
        "created_utc": 1672318689,
        "upvote_ratio": 1.0
    },
    {
        "title": "my city 10 years ago &amp; now",
        "author": "Imaginary_Local_9652",
        "url": "https://youtu.be/Ed5nUDGSJPk",
        "text": "",
        "created_utc": 1672311958,
        "upvote_ratio": 1.0
    },
    {
        "title": "my city 10 years ago &amp; now",
        "author": "Imaginary_Local_9652",
        "url": "https://youtu.be/Ed5nUDGSJPk",
        "text": "",
        "created_utc": 1672311588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Governor Hochul of NY signs Legislative Bill to Support Pedestrians, Bikers, and Transit Riders",
        "author": "mmmini_me",
        "url": "https://www.wktv.com/news/state/hochul-signs-legislative-package-expanding-complete-streets-across-the-state/article_04ea8dd0-86f6-11ed-ad39-bf2da70266c9.html",
        "text": "Having worked in public transit advocacy in NYC this is amazing news that will empower cities across the state to make people-oriented changes. \n\nMore details in the actual bill:\nhttps://www.governor.ny.gov/news/governor-hochul-signs-legislative-package-support-pedestrians-bikers-and-transit-riders",
        "created_utc": 1672275764,
        "upvote_ratio": 1.0
    },
    {
        "title": "City Nerd: What Makes Parking Garages Bad for Cities",
        "author": "wholewheatie",
        "url": "https://www.youtube.com/watch?v=zjJNhf3Xmc8",
        "text": "",
        "created_utc": 1672275583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Barcelona Superblock Video Software?",
        "author": "le_seven_deadly_sins",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zxmpsk/barcelona_superblock_video_software/",
        "text": "Absolutely in love with this video showcasing the Superblock changes occurring in Barcelona. Does anyone know which software is used to create the renders?\n\nIt does such a good job of showing the future of the project and could be used to showcase other new projects in different cities. \n\n[https://www.youtube.com/watch?v=b7nZ8kG5gvg](https://www.youtube.com/watch?v=b7nZ8kG5gvg)",
        "created_utc": 1672265573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Great video explaining how Vancouver's zoning makes it one of the world's most unaffordable cities",
        "author": "babyinadultcostume",
        "url": "https://www.youtube.com/watch?v=cjWs7dqaWfY&amp;ab_channel=AboutHere",
        "text": "",
        "created_utc": 1672262744,
        "upvote_ratio": 1.0
    },
    {
        "title": "The fall of Seattle",
        "author": "writethefuture3",
        "url": "https://unherd.com/2022/12/the-fall-of-seattle-2/",
        "text": "",
        "created_utc": 1672257306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it harder to get a job if your major is city planning?",
        "author": "Original_Grand_965",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zxd9ew/is_it_harder_to_get_a_job_if_your_major_is_city/",
        "text": "Right now i’m in undergrad and my major is city planning with a minor in GIS. I was told that most urban planners get their undergrad degree in something else like civil engineering or architecture and then go on and get their masters in planning. Will I have a big disadvantage because my undergrad is in planning too? It’s a little too late for me to switch it",
        "created_utc": 1672243397,
        "upvote_ratio": 1.0
    },
    {
        "title": "The 10 Most Improved Cities In the U.S. for Transit, Walking, and Biking (measured by mode share)",
        "author": "wholewheatie",
        "url": "https://www.youtube.com/watch?v=-Mh1UctlSOg",
        "text": "",
        "created_utc": 1672242228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on a combined Historic Preservation and Planning Commission?",
        "author": "rontonsoup__",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zxaw3s/thoughts_on_a_combined_historic_preservation_and/",
        "text": "I’m a Planner in a rural area that’s rapidly suburbanizing. We are having continual trouble with attracting community volunteer candidates to our Historic Preservation Commission. It’s gotten to the point where we have applicants that can’t get a Certificate of Appropriateness from the HPC because of a lack of quorum. \n\nWe are thinking of potentially combining our HPC and Planning Commission and have the members cross trained in an effort to continue issuing COAs and administering incoming applications. Has anyone here seen, heard or have experiences with a combined HPC and Planning Commission? I’ve heard of combined Planning and Zoning boards, but not HPC. The state is Georgia.",
        "created_utc": 1672237655,
        "upvote_ratio": 1.0
    },
    {
        "title": "US Dept of Transportation Announces $9 Billion in funding to upgrade and expand passenger rail services along the Northeast Corridor (NEC)",
        "author": "Spirited-Pause",
        "url": "https://www.transportation.gov/briefing-room/biden-harris-administration-usdot-make-available-nearly-9-billion-modernize-busiest",
        "text": "",
        "created_utc": 1672232219,
        "upvote_ratio": 1.0
    },
    {
        "title": "When people ask you to explain your job what do you tell them?",
        "author": "hiho82919",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zx3l12/when_people_ask_you_to_explain_your_job_what_do/",
        "text": "Curious what others say to those who don’t have an understanding of urban planning already!",
        "created_utc": 1672212866,
        "upvote_ratio": 1.0
    },
    {
        "title": "PA Just Protected 30 Farms From Development, One Is In Chester County",
        "author": "sebileis",
        "url": "https://vista.today/2022/12/pa-protected-farms/",
        "text": "",
        "created_utc": 1672201268,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am an Environmental Science Major with a minor in Data Analytics. What's a good direction toward Urban Planning?",
        "author": "CrabdominalStain",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zwzlnd/i_am_an_environmental_science_major_with_a_minor/",
        "text": "[removed]",
        "created_utc": 1672199804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bachelor of arts or science in architecture?",
        "author": "zzvu",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zwv19t/bachelor_of_arts_or_science_in_architecture/",
        "text": "If I plan on getting an urban planning related masters after getting my bachelor's degree, is it better to get a bachelor of arts or science? I ask because many BS Arch program descriptions say that the degree is good for going into urban planning, or that part of the degree focuses on it, but I don't see this as often in BA Arch programs. I have a clear top choice of colleges in terms of convenience, but it only has a BA, so I'm wondering how much I should take this into account in terms of academics.",
        "created_utc": 1672186994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nothing is more powerful than a rendering for inspiring change in your city. Introducing the world's first AI-powered street rendering service!",
        "author": "ModernSociety",
        "url": "https://twitter.com/betterstreetsai/status/1607566372590194690",
        "text": "",
        "created_utc": 1672166254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Allied Magnet States Report",
        "author": "domestication_never",
        "url": "https://www.allied.com/migration-map",
        "text": "",
        "created_utc": 1672166162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone actually think that the boring company concept of building car-based tunnels would actually work?",
        "author": "Jordaneer",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zwmfgv/did_anyone_actually_think_that_the_boring_company/",
        "text": "This video came up in my YouTube feed\n\nhttps://youtu.be/N1xUWcBnfkg \n\nTo me, the idea of tunnels improving traffic just seemed like a way more expensive way of adding another lane to a freeway which clearly doesn't work long term and this is just that same context but WAY more expensive. And frankly the only reason I think anyone bought into it was because of Elon Musk",
        "created_utc": 1672165866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Songs About Places 2022: Songs of Protest",
        "author": "Planetizen",
        "url": "https://www.planetizen.com/blogs/120473-songs-about-places-2022-songs-protest",
        "text": "",
        "created_utc": 1672154944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric and hydrogen buses, amazing bike lanes network and modern infrastructure - this Polish city did a great job in urban planning",
        "author": "SweatyIndustry2052",
        "url": "https://youtu.be/KpR9ne1bUEw",
        "text": "",
        "created_utc": 1672146921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smart Traffic Lights",
        "author": "the-software-man",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zwcy3h/smart_traffic_lights/",
        "text": "I am not an urban planner, but if I were I'd concentrate on traffic flows. It may be naive of me to ask, but why are there not any AI assisted traffic lights? Often times I will approach an intersection and my light turns red. Patiently waiting for no cross traffic but I can see them on the next block get released by their green light. Of course, right when the pack of cross traffic reaches speed and approaches my intersection , they get the red and must break. Now I get the green and go, reach speed only to get the red on the next intersection. (The opposite of a green wave?)\n\nI just figured that the ROI for smarter lights would be quickly paid by the energy saved from constantly. stopping and getting back to speed?\n\nI know that there are timers, but they seem to all be independent. Some engineers will be smart and synch the timers on a long boulevard (green wave), but I'm talking about an intersection that learns from time of day and traffic sensors.\n\nIf a vehicle that idles and accelerates, uses an excess of 1/20 of a  gallon to get through a typical intersection and there are 10K cars that go through the intersection, that's 500 gallons of $4.50 fuel? $2250/day in extra fuel? ($750K / year)",
        "created_utc": 1672138250,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I break into the urban planning field without directly relevant experience?",
        "author": "Jazzlike_Log_709",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zw23t8/how_can_i_break_into_the_urban_planning_field/",
        "text": "I grew up and live in Los Angeles, which I know is a super competitive area. I earned a BA in Sociology in 2019, and I’m a field technician at a private public health and industrial hygiene consulting firm. I am not a huge fan of my current job and I’ve always had an interest in urban planning and I think I want to pursue a career in it. Is this even feasible in this area without a more relevant degree or exp in GIS, CAD and stuff? \nHow can I make myself a stronger candidate?\nAny job titles I should look out for that could provide a way to get my foot in the door?",
        "created_utc": 1672102350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else prefer Gulf Arab city planning to North American cities?",
        "author": "PosT-BITCH-CRisssis",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zw0h8t/does_anyone_else_prefer_gulf_arab_city_planning/",
        "text": "[removed]",
        "created_utc": 1672098008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freelancing work as an urban planner?",
        "author": "Charming-Ad-5411",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zw047k/freelancing_work_as_an_urban_planner/",
        "text": "Hi there, any urban planners out there have any thoughts on how to turn planning skills into a marketable side gig?\n\nThe range of skills out there is broad for planners. Mine in particular is zoning code writing, land use/site planning review, plat review, basic GIS in Pro, basic graphic design skills with Adobe. Interested too in others' skill sets if it can apply to a side gig as well.",
        "created_utc": 1672097039,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Feudalism impact Japan? - Urban Planning &amp; City Design (History documentaire)",
        "author": "lilgeistprr",
        "url": "https://www.youtube.com/watch?v=xwUVqq8CSq0",
        "text": "",
        "created_utc": 1672096573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it not plausible that the reason why some US cities are poorly planned is because at the turn of the 20th century, massive amounts of immigrants arriving from the Eastern hemisphere made it hard to accommodate so many people in a short timeframe?",
        "author": "bradleymuller87",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zvyzri/is_it_not_plausible_that_the_reason_why_some_us/",
        "text": "Discuss",
        "created_utc": 1672094139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do urbanists hate cars?",
        "author": "Rough-Lawfulness-811",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zvyhml/why_do_urbanists_hate_cars/",
        "text": "[removed]",
        "created_utc": 1672092845,
        "upvote_ratio": 1.0
    },
    {
        "title": "People Hate the Idea of Car-Free Cities—Until They Live in One",
        "author": "writethefuture3",
        "url": "https://www.wired.co.uk/article/car-free-cities-opposition",
        "text": "",
        "created_utc": 1672085918,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some examples of ancient or older cities that had some cool urban planning concepts going on?",
        "author": "newmanstartover",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zvozpr/what_are_some_examples_of_ancient_or_older_cities/",
        "text": "What are some examples of ancient or older cities that had some cool urban planning concepts going on? The ancient world didn't have cars and was so diverse from the Mediterranean, Middle East, India, China etc there must have been cool cool concepts that popped up, any ideas?",
        "created_utc": 1672067145,
        "upvote_ratio": 1.0
    },
    {
        "title": "urban planning books?",
        "author": "segmentos",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zvo1pk/urban_planning_books/",
        "text": "i recently got jeff speck walkable cities, and planning to get henri lefebvre urban revolution. can you recommend me some books (if it involves architecture would be good)? thankss",
        "created_utc": 1672064278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Places where building a city would make sense",
        "author": "dukeofnorthpines",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zvn836/places_where_building_a_city_would_make_sense/",
        "text": "Are there any places you think would be a good spot for a new city to be built? For example, the coastline between San Francisco to Portland is like a 6 hour drive that's almost totally uninhabited. I feel like it would make sense for there to be a mid-sized city somewhere in between.",
        "created_utc": 1672061628,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Supply problem’ is keeping housing unaffordable, expert says",
        "author": "GeauxTheFckAway",
        "url": "https://www.yahoo.com/finance/news/supply-problem-housing-unaffordable-173614731.html",
        "text": "",
        "created_utc": 1672031915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which one of these US cities would you pick?",
        "author": "Every_Intention4366",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zvfawp/which_one_of_these_us_cities_would_you_pick/",
        "text": "I'm becoming a flight attendant and these are the bases. Now I may not get my first and favorite pick, but I will be asked to rank the cities from top to least favorite and they will do their best choosing one for me (it really comes down to operational needs and seniority). I'm curious to see what other people would choose. I know there's a lot of factors that go into picking a base (cost of living is a huge one, public transportation for me, overall safety, etc) but let's just say you are picking based on what YOU would like. I'm so curious to see all the different answers and think this will be fun! \n\nLas Vegas, Atlanta, Baltimore, Los Angeles, Oakland, Dallas, Houston, Phoenix, Denver, Orlando, Chicago \n\nOkay, now pick! :)",
        "created_utc": 1672030072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Atlanta Georgia is 30% made up of parking lots.",
        "author": "Own-Reserve9752",
        "url": "https://www.google.com/maps/d/edit?mid=1iFXX36M9CUjo47axNry4zuX9zJP8Ac8&amp;usp=sharing",
        "text": "",
        "created_utc": 1672027357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any historical examples of cities whose layouts have changed?",
        "author": "GoldenRaysWanderer",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zvcl41/are_there_any_historical_examples_of_cities_whose/",
        "text": "By layout, I mean something like changing street patterns, or buildings changing their physical distance between one-another. Something along those lines.",
        "created_utc": 1672020658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Things are getting better",
        "author": "MyFriendKomradeKoala",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zv6tx1/things_are_getting_better/",
        "text": "This sub has a tendency to be more doom and gloom, but I think this is the time of year to acknowledge some of the positive changes we have been working on. \n\nThe time of the eBikes is here. The last 20 years of action has led to many cities having some form of bike infrastructure that is now being utilized by the rise if eBikes. These bikes are affordable, reliable, and effective means of transportation and Americans are starting to see that. \n\nNew houses often advertise their proximity to bike lanes. More cities are implementing active transportation networks because it is what residents and the market are wanting. I see more kids having independence and the more inexperienced demographic cycling for the first time. I expect more active transportation progress in the next 5 years than in the last 20. \n\nWith this years christmas, the number of eBikes in my neighborhood just about doubled and I can’t wait to see more people out on the roads.",
        "created_utc": 1672002806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a $10 Billion Highway Fix One of New Jersey’s Worst Traffic Jams?",
        "author": "domestication_never",
        "url": "https://www.nytimes.com/2022/12/19/nyregion/holland-tunnel-turnpike-extension.html",
        "text": "",
        "created_utc": 1671995974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I study in Alberta if I would like to work in Ontario? Any Canadian planner?",
        "author": "SoSand",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zutmjj/should_i_study_in_alberta_if_i_would_like_to_work/",
        "text": "I am now studying for an associate degree in British Columbia and plan to become an urban planner in Ontario. However, it is impossible for me to study at Waterloo and TMU (the only two accredited Bachelor's Degrees in Ontario) due to the prolonged study period and school name (problems happen if I back to my home country). What I'm struggling with is which of the following route I should go.\n\n1. University of Alberta (accredited Bachelor), study for around 2-3 years after transferring credits. And then move to Ontario. \n2. University of Toronto (non-accredited Bachelor), probably major in Human Geography focusing in planning and urban geography and minor in gis, study for 2 years. I will take as many research project courses as I can And then try to find some related work and pursue a master's degree in Ontario (immediately if I can't find a good job).\n\nThe benefit of the first route is getting RPP in the fastest way. The benefit of the second route is building networks in Ontario earlier. \n\nWhich route is better? And what other factors should I think about? Thanks, everyone!",
        "created_utc": 1671955211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Birds Eye View of the Broadway Subway in Vancouver",
        "author": "AdapterCable",
        "url": "https://www.youtube.com/watch?v=Am6YeTT9AAo",
        "text": "",
        "created_utc": 1671910578,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working conditions for North American urban planners?",
        "author": "ActuallyImJerome",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zuceqz/working_conditions_for_north_american_urban/",
        "text": "I'm hesitating between a few university majors, Urban Planning being one of them.\n\nI'm based in Quebec, but if I did decide to go into this, I'd likely want to travel across the U.S. and Canada.\n\nWhat are working conditions like for people who have bachelors or masters degrees in urban planning? Is it hard to find work? Do you get paid well for the amount of time you spend in college?\n\nQuite simply: is it worth it?",
        "created_utc": 1671896893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I get a US map of all zoning?",
        "author": "manypeople1account",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zu6npq/where_can_i_get_a_us_map_of_all_zoning/",
        "text": "I am actually not really interested in a map per se. Rather, I want to compare cities, so I can track progress over time, if the US is slowly moving towards mix zoning or not.\n\nLooking online, I see various cities seem to have their own maps available, but they are frequently incomplete, lacking information, limited to only some parts of the city.\n\nIs there somewhere I can download zoning information for all US cities? Or are some towns not even available online at all?",
        "created_utc": 1671875275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paige Saunders - Destroying The NIMBY Monster",
        "author": "tangerineraccoon",
        "url": "https://youtu.be/eBAmW3FpyV8",
        "text": "",
        "created_utc": 1671862668,
        "upvote_ratio": 1.0
    },
    {
        "title": "MassDOT Is Demolishing a Highway to Give Fall River Its Waterfront Back",
        "author": "streetsblogmass",
        "url": "https://mass.streetsblog.org/2022/12/21/massdot-is-demolishing-a-highway-to-give-fall-river-its-waterfront-back/",
        "text": "",
        "created_utc": 1671858913,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Climate Impact of Your Neighborhood, Mapped | New data shared with The New York Times reveals stark disparities in how different U.S. households contribute to climate change. Looking at America’s cities, a pattern emerges",
        "author": "Hrmbee",
        "url": "https://www.nytimes.com/interactive/2022/12/13/climate/climate-footprint-map-neighborhood.html",
        "text": "",
        "created_utc": 1671848474,
        "upvote_ratio": 1.0
    },
    {
        "title": "They Use Jet Engines to Remove the Snow",
        "author": "Aggravating-Chain590",
        "url": "https://youtu.be/8PAYi-wB5cA",
        "text": "",
        "created_utc": 1671820059,
        "upvote_ratio": 1.0
    },
    {
        "title": "ucrop.it Solves Important Issues Within the Entire Agricultural Value Chain",
        "author": "scarlet2speedster",
        "url": "http://www.terrathinker.com/2022/12/ucropit-solves-important-issues-within.html",
        "text": "",
        "created_utc": 1671812598,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your favorite drone videos of cities?",
        "author": "BACsop",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zte3p9/what_are_your_favorite_drone_videos_of_cities/",
        "text": "There are numerous drone videos of nearly every major city on the planet now, showcasing each city's skyline and urban fabric. They can be a really good way to get a sense of how cities are laid out, or what they do well, or their particular architectural or cultural features.\n\nMy personal favorites for cinematography, composition, music, and subjects are:\n\n[Bird's Eye Experience of Calgary](https://www.youtube.com/watch?v=MAj4x5ca1MM)--beautiful footage and great pairing with Brahms' Violin Concerto in D Major.\n\n[The Sound of St. Paul](https://www.youtube.com/watch?v=iSMg_GeHwxo)--gorgeous sweeping vistas of the smaller Twin at the height of the 2020 COVID lockdowns with accompanying audio clips for each of the landmarks covered.\n\nWhat are your favorites?",
        "created_utc": 1671798552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Infrastructure, Regulation Stand Between Micromobility and Success",
        "author": "thinkB4WeSpeak",
        "url": "https://www.govtech.com/fs/infrastructure-regulation-stand-between-micromobility-and-success",
        "text": "",
        "created_utc": 1671783042,
        "upvote_ratio": 1.0
    },
    {
        "title": "My company built a new tool that uses AI to create street renderings for just $75 each. AMA!",
        "author": "ModernSociety",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zt7ftm/my_company_built_a_new_tool_that_uses_ai_to/",
        "text": "Check it out [here](https://s5oaw0yl5nk.typeform.com/to/aEhV0Sj4)!\n\nThese images are **super** powerful for selling your ideas elected officials, other planners, and the general public, yet they're typically extremely expensive and time-consuming to make. We use cutting-edge AI to make it much easier, faster, and cheaper.\n\nOur Twitter account is [https://twitter.com/betterstreetsai](https://twitter.com/betterstreetsai), and our work has been featured in [Bloomberg](https://www.bloomberg.com/news/newsletters/2022-08-02/citylab-daily-ai-is-giving-real-streets-a-virtual-makeover), [Curbed](https://www.curbed.com/2022/07/dall-e-walkable-streets-betterstreetsai.html), [Planning Magazine](https://www.planning.org/planning/2022/fall/transform-car-centric-planning-into-pedestrian-streets-with-ai/), etc.\n\nHappy to answer any questions!",
        "created_utc": 1671773469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proponents of low-density planning",
        "author": "Hot_Comparison_945",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zt3f6p/proponents_of_lowdensity_planning/",
        "text": "Contact me privately.",
        "created_utc": 1671760376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Private to public",
        "author": "botanna_wap",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zt2wa0/private_to_public/",
        "text": "Hi all. I was wondering if any of you have had success in going from private consulting to government, specifically at the county level. Is it a doable shift? Starting to feel like I would like to work in government vs. private, as I’m striving more work life balance. Any advice is appreciated, especially on what govt hiring managers are looking for/how to leverage my experience. Thank you so much. Happy holidays!!",
        "created_utc": 1671758802,
        "upvote_ratio": 1.0
    },
    {
        "title": "11 Projects Dubai Will Fail To Complete",
        "author": "Millionized",
        "url": "https://youtu.be/yl5vNelXo64",
        "text": "",
        "created_utc": 1671751889,
        "upvote_ratio": 1.0
    },
    {
        "title": "What will US cities do when they run out of private/state land?",
        "author": "Hendrix_Lamar",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zsy6te/what_will_us_cities_do_when_they_run_out_of/",
        "text": "I was recently scrolling around the [BLM's map](https://blm-egis.maps.arcgis.com/apps/webappviewer/index.html?id=6f0da4c7931440a8a80bfe20eddd7550) of public and federal land. I was noticing that many cities in the western US are almost completely surrounded by lands controlled by the federal government. And some cities like Las Vegas, Phoenix, and St George Utah have sprawled basically to the boundaries of the available private land. Presumably at some point in the near future, there will be no undeveloped land left around these cities except what is controlled by the federal government. What happens then? Can cities annex federal public land? Will they be forced to start densifying in order to increase housing? These federal boundaries would seem to act as a sort of unintentional urban growth boundary at some point maybe?",
        "created_utc": 1671746568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proponents of low-density planning",
        "author": "Hot_Comparison_945",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zsxxa8/proponents_of_lowdensity_planning/",
        "text": "Contact me privately.",
        "created_utc": 1671745924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turning an office park into a town center",
        "author": "CEOofRaytheon",
        "url": "https://www.cnu.org/publicsquare/2022/12/22/turning-office-park-town-center",
        "text": "",
        "created_utc": 1671744548,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proponents of low-density planning",
        "author": "Hot_Comparison_945",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zsxc14/proponents_of_lowdensity_planning/",
        "text": "Contact me privately.",
        "created_utc": 1671744405,
        "upvote_ratio": 1.0
    },
    {
        "title": "More adult children are living with their parents. Parents are not pleased",
        "author": "Hyperion1144",
        "url": "https://thehill.com/policy/finance/3777185-more-adult-children-are-living-with-their-parents-parents-are-not-pleased/",
        "text": "",
        "created_utc": 1671742163,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Enemy's Gate is Down: the State of NYC Housing Abundance",
        "author": "writethefuture3",
        "url": "https://progressforum.org/posts/bguu6fawmrGJiZjmQ/the-enemy-s-gate-is-down-the-state-of-nyc-housing-abundance",
        "text": "",
        "created_utc": 1671732325,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for front porch house design stan",
        "author": "Coffee_24-7",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zsqkth/looking_for_front_porch_house_design_stan/",
        "text": "Does anyone have recommendations of ordinances or design standards for single family suburban settings that regulate traditional neighborhood design? \n\nI'm looking at doing an overlay district for new neighborhood development that emphasizes shorter setbacks and denser development without garages at the front facad, or at least.",
        "created_utc": 1671727497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any urban planners from Australia? I’m in need of some advice.",
        "author": "WhiskyandShakespeare",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zs9xqb/any_urban_planners_from_australia_im_in_need_of/",
        "text": "I’ve been looking into studying an accredited Master’s in urban planning and have been given an offer although I have yet to accept because I’m unsure as to whether it’s the right fit for me. My background is in sociology/psychology and I had originally intended to go into public health (PH) until I found that the majority of PH jobs were fix-term and temporary positions. This made me worried that if I did my Master’s in PH, there would be a strong chance that I may not get stable work, something that has become important to me. So, my plan B was to transition into urban planning as I did study some crossover subjects in my undergrad and really enjoyed it.  \n\nFor those who work/study urban planning, what is it like in terms of job security and job satisfaction? What things should I be looking out for while studying and moving into the job market? Also, in terms of salary, what should I expect as a new graduate?  \n\nAdditionally, the program that I got accepted into has a unit of practical experience as an internship, while studying are there any other avenues I can explore in order to get some real world experience in urban planning?",
        "created_utc": 1671677296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Networking within the Urban Planning field",
        "author": "ThrowawayInAFewDays1",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zs9p5r/networking_within_the_urban_planning_field/",
        "text": "I recently graduated with a BA in Urban Planning and want to network with more people in the industry to grow my network and also increase my chances of getting a job. What are the best ways to meet professionals in person or online?",
        "created_utc": 1671676640,
        "upvote_ratio": 1.0
    },
    {
        "title": "MURP/MCP Career Questions",
        "author": "rosfhtee",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zs2hsw/murpmcp_career_questions/",
        "text": "Hi everyone. I’m a recent grad in the US looking to get my MURP or MLA. \nI graduated with a from U of Maryland with a BA in Environmental Planning and Policy and my ideal goal is to work in a field where I can make a substantial difference in reducing our environmental impact. During undergrad I loved the policy classes and I found planning classes to be boring until I did a streetscape/urban planning/landscape project. I have a talent for visual art and I love working with plants (I garden) and that led me to an MLA. My interests are in wetlands protection, combatting urban sprawl and environmental justice. \n\nI am wondering if an MLA or a MCP would better prepare me for this field? I love to study nutrient cycling and the technical side of env planning and worry that a MCP won’t give me enough technical environmental education. \n\nHas anyone done an MLA and switched into the planning side? Or done an MCP with a strong environmental/urban design emphasis? I’m looking for recs of grad programs that have good alumni networks and with great research opportunities! I have a good GPA and am looking at schools that won’t put me in deep debt ( looking at you Cornell and Penn) Thanks :)",
        "created_utc": 1671660258,
        "upvote_ratio": 0.99
    },
    {
        "title": "What the hell is Saudi Arabia doing?",
        "author": "AlfonsoRibeiro666",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zrsady/what_the_hell_is_saudi_arabia_doing/",
        "text": "We've all heard about \"The Line\" and apparently they're now planning \"The North Pole\". Futuristic mega city concepts that read like the school project of a 14 year old, completely disengaged from the humbling weight of reality. What is going on here?\n\nI'm impressed and shocked by the sci-fi-levels of wealth they now seem to have reached. I'm shocked by the imbalance of wealth distribution in the Arabic world. I'm also a tiny bit fascinated, I have to admit, by the possibilities that come with this unhinged megalomania. There have been so many futuristic concepts that sound super interesting and promising and it's always like reading sci-fi: They're idealistic and holistic and you really get carried away when gathering info about the brilliant ideas but there's never really an actual hope of these concepts ever being realised. No one wants to take the risk and they're usually more wishful thinking than feasible ideas. But these maniacs are actually doing it! And it's absolutely, unbelievably massive.\n\nWhat really disables my fascination though, is my strong conviction that they will 100% fail miserably and become ghost cities. I don't actually \"buy\" the whole thing at all. They can't possibly believe this is going to work out, do they? What the hell?\n\na) It just seems like a money making scheme to boost the national economy or to lure foreign investors or something. I don't know enough about economy or Saudi Arabias complicated political position, so if the answer lies here I just don't get it because I'm not informed too well.\n\nb) Maybe it's just a propaganda project and really nothing more than this primitive boasting gesture to show their riches? If it's really nothing but this they must be so much richer than I have ever imagined. I really don't get it.\n\nc) Or are they really so detached from reality and lost within the seemingly limitless power of money that they think they can just turn these pipe dream concepts into reality with the brute force power of money, no matter how ludicrous the concept is? \n\nMany dicatorships seem to, at some point, feel the need to realise some epic huge project that then fails miserably. China has a few of those cities, North Korea of course, and I think Kazakhstan? What contributes to this? I suspect corruption to play a major role in this. But Saudi Arabia is on another scale. Please help me understand this.\n\nThank you for your informed opinions!",
        "created_utc": 1671638804,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most innovative districts + neighborhoods in the world?",
        "author": "farwesterner1",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zrh8ib/what_are_the_most_innovative_districts/",
        "text": "What are the most innovative districts in the world in terms of sustainability, planning, and architecture? (Innovative tech and smart planning might be a bonus). Probably recent but could be older too—especially if the district has been reimagined.\n\nI’m thinking of places like Bo09 in Malmo, Borneo Sporenberg in Amsterdam, Akers Brygge in Oslo, though I’d also be interested in critiques of districts &amp; their planning.\n\nWhat works, what doesn’t work? What seems truly new as a planning strategy?",
        "created_utc": 1671620980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sustainable development goals can transform mid-sized cities",
        "author": "Hrmbee",
        "url": "https://www.nationalobserver.com/2022/12/20/opinion/sustainable-development-goals-can-transform-mid-sized-cities",
        "text": "",
        "created_utc": 1671600993,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Homeownership Society Was a Mistake",
        "author": "SuccessfulOperation",
        "url": "https://www.theatlantic.com/newsletters/archive/2022/12/homeownership-real-estate-investment-renting/672511/",
        "text": "",
        "created_utc": 1671594697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why the Victorian Mansion Is a Horror Icon",
        "author": "PressTab123",
        "url": "https://www.youtube.com/watch?v=A9GUvzFGuFU",
        "text": "",
        "created_utc": 1671571500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saudi Arabian Linear City, Explained (The Line)",
        "author": "PressTab123",
        "url": "https://www.youtube.com/watch?v=MFCcrQFDijM",
        "text": "",
        "created_utc": 1671569842,
        "upvote_ratio": 1.0
    },
    {
        "title": "How the Japanese Clear 20 Meters of Snow",
        "author": "PressTab123",
        "url": "https://www.youtube.com/watch?v=Tu6XLEc4OTw",
        "text": "",
        "created_utc": 1671566469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do towns get rewards for transit oriented design?",
        "author": "Euphoric_Drawer_9430",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zqxmjk/do_towns_get_rewards_for_transit_oriented_design/",
        "text": "My community recently up zoned land near the train station and did some other “transit oriented design” stuff that should play a small role in easing housing burdens in the region and reducing global warming and all that. I’ve read that there are federal and state(NY) incentives to do this, but what exactly are those incentives?  How to I ensure we’re getting them?",
        "created_utc": 1671565436,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Road Barriers Stopped Killing Drivers",
        "author": "PressTab123",
        "url": "https://youtu.be/vfS1gAWF_l0",
        "text": "",
        "created_utc": 1671562825,
        "upvote_ratio": 1.0
    },
    {
        "title": "How the Japanese Use Sprinklers for Snow Removal",
        "author": "PressTab123",
        "url": "https://youtu.be/2CyKgFUm6W4",
        "text": "",
        "created_utc": 1671562734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cities giving stormwater credits for tree canopy establishment?",
        "author": "Nachie",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zqux2z/cities_giving_stormwater_credits_for_tree_canopy/",
        "text": "(Also posted to /r/arborists and /r/treelaw)\n\nHello! A while back I posted a question about municipal [tree protection ordinances](https://www.reddit.com/r/urbanplanning/comments/rneb3j/tree_protection_ordinances/) and the replies were so helpful that I am now back with another question.\n\nDoes anyone have good examples of cities that account for establishment of new tree canopy in calculating stormwater fees on private land? I'm sure there are things like this in places like the Chesapeake Bay watershed, but I'm not aware of the specifics.\n\n**Basically, my city has a stormwater grant program that scores applicants on the basis of how much impervious surface area their projects will remove. There is no consideration for establishment of new tree canopy. I am trying to get this changed so that both will be considered in the grant scoring.**\n\nIn order to do this it would be great to have some precedent studies from other (preferably North American) municipalities that have in some way codified, whether through grants or stormwater credits or whatever else, the links between stormwater remediation and the establishment of new urban tree canopy. Really, anything helps!",
        "created_utc": 1671558991,
        "upvote_ratio": 1.0
    }
]