[
    {
        "title": "Will suburban sprawl lead to hyperinflation since it will causes every city/state to become insolvent and eventually lead to federal bailouts of mass money printing?",
        "author": "hyperinflationUSA",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9yac8/will_suburban_sprawl_lead_to_hyperinflation_since/",
        "text": "[removed]",
        "created_utc": 1669925503,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are good books/articles on urbanism that are not anti-car?",
        "author": "Sea-Lab-7035",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9x15g/what_are_good_booksarticles_on_urbanism_that_are/",
        "text": "[removed]",
        "created_utc": 1669922746,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be your ideal city?",
        "author": "weeb458",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9v5s1/what_would_be_your_ideal_city/",
        "text": "So let’s say your tasked with constructing the ‘best city possible’ any where in the world. Your budget while not Infinite is quite large in the billions of dollars range and you can interpret the prompt of building the best city possible however you want. So where would you build it and what would it look like?",
        "created_utc": 1669918742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Think Tank/Policy Roles?",
        "author": "glutton2000",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9v4qx/think_tankpolicy_roles/",
        "text": "Has anyone here made the switch from public sector/local government to a think tank or doing policy research work? I’ve learned a lot from the past five years in local government, but I now want to broaden my experience to beyond my local community. I was thinking about a more policy research type organization that compiles best practices. For example - Transit Center, Urban Land Institute, ITDP, World Resources Institute, NACTO, Bloomberg Philanthropies, Brookings, or Urbanism Next. The only issue is that most of these all seem to be concentrated in only DC/NYC and that’s not anywhere near where I live. \n\nIf anyone has made the switch or has experience working in think tanks, would love to hear how it went and what kind of work you did. Thanks!",
        "created_utc": 1669918683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban planning related photographers?",
        "author": "Saltine5",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9sgpi/urban_planning_related_photographers/",
        "text": "[removed]",
        "created_utc": 1669912725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Virginia Mercury: \"Richmond's Pulse has Been a Surprise Success. Other Cities and States are Taking Notice.\"",
        "author": "NEPortlander",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9rtkk/virginia_mercury_richmonds_pulse_has_been_a/",
        "text": "[https://www.virginiamercury.com/2022/11/23/richmonds-pulse-has-been-a-surprise-success-other-cities-and-states-are-taking-notice/](https://www.virginiamercury.com/2022/11/23/richmonds-pulse-has-been-a-surprise-success-other-cities-and-states-are-taking-notice/)\n\nPeople here don't seem to like BRT but this sounds like it provides an example of BRT performing well. What are your thoughts?",
        "created_utc": 1669911158,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the role of planners in creating sustainable communities in deprived areas?",
        "author": "Utopian_Urbanist",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9rd9o/what_is_the_role_of_planners_in_creating/",
        "text": "[removed]",
        "created_utc": 1669910094,
        "upvote_ratio": 1.0
    },
    {
        "title": "More Positive Developments: Street Redesign in Rockford, IL",
        "author": "water605",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9r3tb/more_positive_developments_street_redesign_in/",
        "text": "Very excited to see these upcoming changes to our streets and city. Keep up the advocacy and work in your communities! \n\nhttps://www.rockrivercurrent.com/2022/12/01/rockfords-construction-season-is-about-to-get-bigger-heres-a-look-at-the-largest-capital-plan-ever/",
        "created_utc": 1669909466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinion | How a ‘Golden Era for Large Cities’ Might Be Turning Into an ‘Urban Doom Loop’",
        "author": "domestication_never",
        "url": "https://web.archive.org/web/20221201080615/https://www.nytimes.com/2022/11/30/opinion/covid-pandemic-cities-future.html",
        "text": "",
        "created_utc": 1669907804,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the role of planners in creating sustainable communities in deprived areas?",
        "author": "Utopian_Urbanist",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9psv1/what_is_the_role_of_planners_in_creating/",
        "text": "[removed]",
        "created_utc": 1669906308,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the role of planners in creating sustainable communities in deprived areas?",
        "author": "Utopian_Urbanist",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9pqgq/what_is_the_role_of_planners_in_creating/",
        "text": "[removed]",
        "created_utc": 1669906138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Certificates or training recommendations?",
        "author": "Woody-__-",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9omc1/certificates_or_training_recommendations/",
        "text": "My current position oversees strategic planning, master planning, development planning, cartography, and public input for a state agency (public). I was awarded $1,500 for a certification/training of my choosing. \n\nCurrently, I have a MS in Biology, GIS graduate certificate, and Six Sigma Green Belt in Government. \n\nAICP? Any other planning related certifications or trainings you'd recommend? \n\nI have to spend the $ by June 30, 2023. \n\nThanks for your input!",
        "created_utc": 1669903276,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think is better when it comes to developing a nation in terms of urban planning?",
        "author": "Sensitive-Band5884",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9gv6l/what_do_you_think_is_better_when_it_comes_to/",
        "text": "There are 3 variables that I´m considering in this case: The size of the city (Big, Medium or Small city), the number and frequency of cities (or the average distance between one city and another), and the intensity of infrastructure use (in this case, I´m only considering cargo and passenger transport).\n\nI want to know what proportion of these variables would be the most optimal for the development of a nation, and why you consider it so.",
        "created_utc": 1669876843,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is it for a masters program to be PAB accredited?",
        "author": "sparkdispose",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9f0de/how_important_is_it_for_a_masters_program_to_be/",
        "text": "Hey everyone! I'd just like to basically have an answer to my question in the title. I ask because my school (Georgetown) offers a Masters in Urban and Regional Planning which is not accredited but seems to have a very strong program and is very well connected to various important planning organizations on the city, national, and international level (this city being Washington DC). The benefits of this program on a personal level for me are that I am already decently well-connected with many of the professors and directors of the MURP program, am currently working for one of its initiatives, and may be able to start the program as an accelerated degree since I am able to finish my undergrad early.\n\nHowever, DC is not the city in which I think I want to build my planning career, and I'm not sure if finishing a non-accredited Masters would disadvantage me later on. I hope to work in NYC (my home city), and so I am mainly contrasting the non-PAB MURP program with PAB-accredited programs in NYC/metro area, such as NYU, Columbia, and Rutgers. So actually this post is two questions: how important is PAB accreditation for a Masters program?; Will pursuing a non-accredited program disadvantage me if I want to work in a different city? Thanks in advance for the help guys!",
        "created_utc": 1669870985,
        "upvote_ratio": 0.86
    },
    {
        "title": "What floor area ratio minimum would likely require a parking structure if the building will primarily be accessed by car?",
        "author": "Hagadin",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9ej8n/what_floor_area_ratio_minimum_would_likely/",
        "text": "Your best guesses please and thanks!",
        "created_utc": 1669869680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which out of its prime, underfunded but iconic US city that still has the solid bones for pedestrian-centric urbanism but is currently car-centric has the best chance to bring that all back and maybe even better (Part 2)?",
        "author": "Findingmypurpose1212",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z9cdul/which_out_of_its_prime_underfunded_but_iconic_us/",
        "text": "Basically, bring back a modernized version of their old urban-centric blueprint to the point of building up its development so that their public transit, walkability, and bike-ability could be in the lite of New York City, San Francisco, Washington DC, Chicago, Boston, and Philadelphia or even like many European cities like London, Paris, Amsterdam, Vienna, Copenhagen, Berlin, Munich, Madrid, Zürich, Barcelona, etc. \n\n\\*Side note for anyone mentioning these cities: I already listed Baltimore, Detroit, Cleveland, Cincinnati, Buffalo, and St. Louis in a part 1 of this series I made a while back\\*\n\n[View Poll](https://www.reddit.com/poll/z9cdul)",
        "created_utc": 1669864044,
        "upvote_ratio": 0.8
    },
    {
        "title": "I’m confused about how urban growth boundaries work.",
        "author": "screechymonkey",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z99mkn/im_confused_about_how_urban_growth_boundaries_work/",
        "text": "Okay so this is a pretty simple question but I can’t figure it out. If an urban growth boundary draws a line around a a city, which encloses the growth of only that city, why wouldn’t a developer just build right outside of the boundary? If the boundary is designating where a city has control over, then wouldn’t the land just outside of the boundary be fair game for developers?",
        "created_utc": 1669857124,
        "upvote_ratio": 0.76
    },
    {
        "title": "What would think of airline companies being allowed to build train networks while operating on existing lines?",
        "author": "GuiGeeKang",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z95ok2/what_would_think_of_airline_companies_being/",
        "text": "For context, I was watching an Alan Fisher video and this idea came up in the comments. Currently, airlines are restricted to not being allowed to run a rail line. But with the advent of carbon targets, and the prevalence of greenwashing I could see this idea become viable. \n\nThis could especially become viable in the high unprofitable short haul flights that plague the industry. There are a couple of them that turned into bus routes, but I think allowing trains would be a much cleaner solution.\n\nDisclaimer: I don’t mean this terms of them operating the rail network. \n\nTL;DR: blah blah is it viable blah blah background blah blah. Please read the disclaimer.",
        "created_utc": 1669847699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are homes allowed to be built in lava zones? Mauna Loa eruption has Hawaii residents wondering",
        "author": "No-Lifeguard-8173",
        "url": "https://www.usatoday.com/story/money/2022/11/30/mauna-loa-eruption-homes-lava-zones/10804623002/",
        "text": "",
        "created_utc": 1669847083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alderman Savidge: “Legislation to allow apartments in residential neighborhoods!”😱😱😱",
        "author": "Other-Efficiency-844",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z94dyo/alderman_savidge_legislation_to_allow_apartments/",
        "text": "***Note: apartments are residences (where someone lives)… by definition, they belong in residential neighborhoods.***\n\n[O-40-22 Workforce Housing Bill Testimony](https://m.facebook.com/story.php?story_fbid=pfbid0hHPaCNmq7umkWsmnH2tM6KiLvB99iGwf9dqtH7SioyvtPoGs1aZFU3Ue3vc6zRGXl&amp;id=50702907&amp;mibextid=PZxLD1)",
        "created_utc": 1669844897,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Olympia is shifting TDM from car-centric to people-centric",
        "author": "popcycler",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z948yo/how_olympia_is_shifting_tdm_from_carcentric_to/",
        "text": "Recently, I talked to someone in Transportation Demand Management (TDM) about how they are shifting their planning to focus on getting more people to adopt active transit and shared transit over driving.\n\nThe TDM is from Washington State and they had some really interesting solutions to encourage adoption of alternative commutes, and thought I would share!\n\n*\"In all transportation projects for all of time so far, we’ve talked about how to get cars through most efficiently, and now what we want to shift the conversation to is how do we get people, just people, through most efficiently.*\n\n*How to make people the most safe, all across the whole system. How are we thinking about all of them and not just cars.*\n\n*We just have a car-centric planning and transportation system that we need to peel back so many layers on how we’ve done things, and how we need to change doing things.\"*\n\n Full article here [https://popcycle.substack.com/p/veronica-and-a-gamechanger-for-tdm](https://popcycle.substack.com/p/veronica-and-a-gamechanger-for-tdm)",
        "created_utc": 1669844596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best undergrad programs/ advice",
        "author": "Fluffy_Hippenerd",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z92c7b/best_undergrad_programs_advice/",
        "text": "[removed]",
        "created_utc": 1669840346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Dutch ‘bike banks’ are a game changer for kids",
        "author": "flobin",
        "url": "https://www.bbc.com/news/business-63754826",
        "text": "",
        "created_utc": 1669837458,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Reversal, Ontario Government Could Open Toronto Greenbelt to Development",
        "author": "domestication_never",
        "url": "https://www.planetizen.com/news/2022/11/119874-reversal-ontario-government-could-open-toronto-greenbelt-development",
        "text": "",
        "created_utc": 1669832410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does NYC like punishing drivers???",
        "author": "pkelliher98",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z8wlgj/why_does_nyc_like_punishing_drivers/",
        "text": "I’m doing some work in Bayonne, NJ for the Utility Company there and the fastest way to get there from my hotel is through Staten Island via the Goethals bridge. But Google Maps is saying the toll is $13 each way?!?!? This makes zero sense. I get it if you’re driving right into Manhattan but I can’t understand this one…",
        "created_utc": 1669827481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on handling projects that don’t meet city standards but your supervisors want you to “get to yes”",
        "author": "FutureBlue4D",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z8vz21/advice_on_handling_projects_that_dont_meet_city/",
        "text": "Can I hear from municipal planners on their experience with this problem that I think is pretty universal? \n\nA project team wants to meet with you but their project is ignoring development standards and the applicant is adamant that they can’t or wont follow them. You meet and help them understand why the standards were put in place and that they’re required. So they contact your boss who asks you to “get to yes” and is frustrated that “we’re not being more flexible”. \n\nIt’s really been the toughest part of being a planner this year. Has anyone experienced this? I’m going to start asking my boss to meet with me each time and point out what standards she’s asking me to ignore. Even though once we get to a public hearing the commission will ask why that was done.",
        "created_utc": 1669825988,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to desuburbanize",
        "author": "AppointmentMedical50",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z8uvtm/how_to_desuburbanize/",
        "text": "How do we meaningfully reduce the percent of the population in car dependent suburbia? Are there policies that can get people into towns and cities? What actions can be taken to change the course of American urban development? I’m not an expert on this aspect but would really like to fight for this",
        "created_utc": 1669823399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Older Office Buildings Functionally Obsolete? How One AT&amp;T Center Lost 98% of its Value",
        "author": "muckfustard",
        "url": "https://www.youtube.com/watch?v=RQfGVUe_tvA",
        "text": "",
        "created_utc": 1669821147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Older Office Buildings Functionally Obsolete? How One AT&amp;T Center Lost 98% of its Value",
        "author": "UrbanAngle",
        "url": "https://www.youtube.com/watch?v=RQfGVUe_tvA",
        "text": "",
        "created_utc": 1669821056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinion | How a ‘Golden Era for Large Cities’ Might Be Turning Into an ‘Urban Doom Loop’",
        "author": "Maxcactus",
        "url": "https://www.nytimes.com/2022/11/30/opinion/covid-pandemic-cities-future.html",
        "text": "",
        "created_utc": 1669805923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Searching for research that proves on street parking fills before parking lots do",
        "author": "ocrain9",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z8jduy/searching_for_research_that_proves_on_street/",
        "text": "Hi all,\n\nI'm currently writing an op-ed against parking minimums. I'm wondering if anyone knows of any research that proves that on-street parking fills before lots or garages do. It's an observable phenomenon, but I can't seem to find any study proving it to be true.\n\nThanks in advance",
        "created_utc": 1669788641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vox: How our housing choices make adult friendships more difficult",
        "author": "Rishloos",
        "url": "https://www.vox.com/2015/10/28/9622920/housing-adult-friendship",
        "text": "",
        "created_utc": 1669776768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elon Musk’s Boring Company Ghosts Cities Across America",
        "author": "SuccessfulOperation",
        "url": "https://www.wsj.com/articles/elon-musk-boring-company-tunnel-traffic-11669658396",
        "text": "",
        "created_utc": 1669766435,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Small town” specific word related to urbanism?",
        "author": "ridleycornseller",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z872en/small_town_specific_word_related_to_urbanism/",
        "text": "Urbanism isn’t just about large cities but referring to cities as “urban” areas, etc often gives the impression that being an “urbanist” means you want to New York-ify small towns or rural areas. \n\nIs there a word for a person who cares about the built world that has the connotation of “wanting to improve specifically small towns”? \n\nA “ruralist” or a “small town-ist” or “microurbanist” or something along those lines?",
        "created_utc": 1669758000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saudi Arabian Linear City, Explained (The Line)",
        "author": "MileJonesJr",
        "url": "https://youtu.be/MFCcrQFDijM",
        "text": "",
        "created_utc": 1669757936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why the Victorian Mansion Is a Horror Icon (Halloween Special)",
        "author": "MileJonesJr",
        "url": "https://youtu.be/A9GUvzFGuFU",
        "text": "",
        "created_utc": 1669754465,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Drop a New Building on Top of an Old One",
        "author": "SuccessfulOperation",
        "url": "https://www.bloomberg.com/news/features/2022-11-26/in-boston-an-old-warehouse-holds-up-a-new-condo",
        "text": "",
        "created_utc": 1669744154,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Canadian) Im about to apply to Waterloo, York, and TMU for their Urban Planning courses. Does anyone have any advice for me before I make this decision?",
        "author": "ItzAddyDaddy",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7uw91/canadian_im_about_to_apply_to_waterloo_york_and/",
        "text": "I’ve finally found what 3 schools I wanted to pick. I have Waterloo as my 1st pick, 2nd pick is TMU, and my 3rd is York. Are these good schools for this industry? Should I still pursue a Masters after graduating? Any information from people who have taken this course or have any knowledge of them giving me some insight would be greatly appreciated. Thank you so much!",
        "created_utc": 1669730462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career advice in India",
        "author": "jav4script",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7pyca/career_advice_in_india/",
        "text": "Urban planner career guidance\n\nHello folks, my wife is an Urban Planner with both bachelor's(SPA, Bhopal) and master's(CEPT, Ahmedabad) degrees in planning with specialization in infrastructure.\nHas 4+ years of experience and is currently working with a globally renowned organization.\nHas 3+ years of experience in solid waste management.\n\nShe's looking for a change, been trying to get a job for a while but for some reason there just aren't many options out there. She's doing very well for her age and she's looking at the next opportunity.\n\nAny opinions would be appreciated, thanks in advance.\nFeel free to DM me for anything valuable.",
        "created_utc": 1669716830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career advice for india",
        "author": "jav4script",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7pu7x/career_advice_for_india/",
        "text": "https://www.reddit.com/r/india/comments/z7leaz/urban_planner_career_guidance/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
        "created_utc": 1669716480,
        "upvote_ratio": 1.0
    },
    {
        "title": "scientific papers about the future of car-dependant suburbs?",
        "author": "dooomye",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7prik/scientific_papers_about_the_future_of/",
        "text": "Hi guys, \nI'm studying spatial planning in Austria and am currently writing a term paper on how strongly car-dependant suburbs are going to develop in the future (facing the climate crisis, co2-taxes and oil-shortage).\nI would like to depict different strategies about how (and if) governments from various parts of the world are preparing for post-car-dependent suburbs and if there are any (successful) measures.\nIf you know any good (scientific) sources, maybe from your country or region I would be more than thankful! :)",
        "created_utc": 1669716252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone read the Mouse Utopia Studies? I’m convinced urban density is incompatible with mammalian social behavior… we’re seeing the effects on fertility right now in dense city’s like Singapore",
        "author": "0oOoO0o0oo",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7m9ln/has_anyone_read_the_mouse_utopia_studies_im/",
        "text": "[removed]",
        "created_utc": 1669705092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assessing the correlation between urban projects and gentrification",
        "author": "Amir_BL",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7lr7c/assessing_the_correlation_between_urban_projects/",
        "text": "[removed]",
        "created_utc": 1669703425,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Stadiums Of Qatar FIFA World Cup 2022",
        "author": "Millionized",
        "url": "https://youtu.be/JfGF8TH7fs8",
        "text": "",
        "created_utc": 1669699150,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get a video of the Surya River Bridge (India) crossing that killed Cyris Mistry and Jahangir Pandole?",
        "author": "atlwellwell",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7kako/how_to_get_a_video_of_the_surya_river_bridge/",
        "text": "This incident happened a couple months ago (Sept 4, 2022).\n\nIn theory, the bridge was ill-designed, but India doesn't have great Google Maps street view coverage yet, so I can't see what it actually looked like -- the street view of that bridge does not seem to be available. There are four or five Surya River Bridges listed on google maps, so not even sure which one it was.\n\nI'm curious to know what it looked like, and then what the fix would be. I could imagine a guardrail would probably help a little - maybe? - but...  \n\n\nAt least one of the takeaways seem to be that rear seatbelts would have helped in this case. I am generally all about good design, but in some cases it seems like you still need other safety mechanisms/protocols. But that's just my take.\n\nI rarely buckle up in the back seat, but I started doing it a bit more as I got older -- i would guess for two reasons: 1) i know how fallible humans are (road design, driving, governance), and 2) i know about the likelihood of exiting the vehicle if you are not strapped in, and the death rates that follow. \n\nI think requiring folks to strap in in the back seat as a law (I'm in the US) would probably be a good idea -- maybe. I do think about what would happen to my head/neck tho, if we were in a serious crash. Having the seatbelt on seems optimized for snapping my neck.",
        "created_utc": 1669698924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Commuter, Regional, and Intercity Rail in Southern California",
        "author": "_snoopbob",
        "url": "https://www.youtube.com/watch?v=q3I8ZDZNREY",
        "text": "",
        "created_utc": 1669697723,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Rise Of Atlanta",
        "author": "SuccessfulOperation",
        "url": "https://www.youtube.com/watch?v=tycWtaejktA",
        "text": "",
        "created_utc": 1669697384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Georgism and the LVT",
        "author": "Developed_hoosier",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7hxi0/georgism_and_the_lvt/",
        "text": "Looking for feedback on the Georgism philosophy: replace property taxes with land value taxes and then increase that to roughly 100% (for instance, if you have an empty lot you could rent for $500/mo, that would be the equivalent tax). This would presumably replace most, if not all, other taxes.\n\nWhy?\n Labor and capital can only function when land is available to use for enterprise, if landowners decide to instead speculate on prices, lots will sit empty and underutilized in prime real estate spots. (In my own community, one of our founding towns speculated the whole town at once while waiting for a canal that eventually was built in another city that had been building itself up). This also helps free up land for more housing while also encouraging condensing said housing, which would then presumably be relatively more affordable per unit.\nMost government services are based on land locations; transportation, utilities, policing, mail, and military defense. This then ties the services and land together by taxes levied.\nRelatively more stable than relying on income or sales taxes and helps encourage development on land rather than taxing someone for building a better house.\n\nPotential downsides?\nGeneral issues associated with gentrification, as an area develops and becomes a hot spot, homeowners would be pushed to downsize their home or move to a less developed area.\n\nWhat am I missing about this? What's the downside of using LVT over current American assessed property taxes?",
        "created_utc": 1669692176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Edmontonians should care about big proposed changes to zoning bylaws",
        "author": "apotheosist123",
        "url": "https://globalnews.ca/news/9303823/edmonton-zoning-bylaw-renewal/",
        "text": "",
        "created_utc": 1669690072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking advice on when to walk away",
        "author": "throwawayfriend09",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7duxj/seeking_advice_on_when_to_walk_away/",
        "text": "For planners, have you ever reached a point where it becomes evident that positive change from within an organization is just not realistic and you should stop supporting said org? For example, state transportation organizations continue to contribute to displacement of low income communities and majority spends its budget in ways that further society's dependence on the personal vehicle. \n\nI thought \"I can be an urban planner who helps change this place from the inside.\" But at 4 is years in, I'm just burnt out and starting to realize that it's near impossible to change this place. And many of the non planning employees are just rude to planners, which makes organizational change really tough at the enterprise level, but also personally day to day for me as an employee. I am also just disgusted by how parts of the organization treat and think about impoverished populations. But, I do have significant influence over massive funding programs (like hundreds of millions $), and that feels important.\n\nShould I move on? Does it look foolish of me to stay? Will I have a stank tied to me for the rest of time because I worked at this place, regardless that I tried to be part of change? Will anyone see my skills as valuable if I was never successful in fully creating change? Seeking advice on this career ethical dilemma. Thank you",
        "created_utc": 1669681488,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your opinion on microtransit?",
        "author": "yusefudattebayo",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7cz5m/what_is_your_opinion_on_microtransit/",
        "text": "So my southern Californian suburban city wants to implement it for the first time and I’m skeptical of it. Are there areas in the US and around the world of it succeeding? How much does it challenge car dependency?",
        "created_utc": 1669679405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any cities in the world being built not around cars?",
        "author": "internetroamer",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z7bdb7/any_cities_in_the_world_being_built_not_around/",
        "text": "I appreciate walkable cities designed for people but in the US that's only an option in cities before the advent of the car (NYC, Boston, Chicago, SF). It seems all modern development caters to cars at least in the US.\n\nSo that had me wondering whether the are any cities with recent development that is design for walkability not cars?",
        "created_utc": 1669675764,
        "upvote_ratio": 1.0
    },
    {
        "title": "What major should I choose?",
        "author": "calicolobster33",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z79pnx/what_major_should_i_choose/",
        "text": "Hello, I am looking for some help from planners already in the field. I am a sophomore in college currently going for a B.A. in Urban Studies, but I am unhappy with the school I am at and I'm looking to possibly transfer to a school near my home. The only issue with this move is that the school near my hometown doesn't have an Urban Studies program or even Urban Planning so I would instead choose a different major such as Political Science. After I get my major regardless of what school I stay at and what field it is in, I am going to proceed to get my Masters in Planning. So I guess what I am asking is Political Science B.A. with an emphasis on Public Administration suitable for going into the Urban Planning field?",
        "created_utc": 1669672133,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much math does it take to be an urban planner?",
        "author": "Martian_row",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z790bw/how_much_math_does_it_take_to_be_an_urban_planner/",
        "text": "Is it a lot? What type of math?",
        "created_utc": 1669670615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robot Landlords Are Buying Up Houses | Companies with deep resources are outsourcing management to apps and algorithms, putting home ownership further out of reach",
        "author": "Hrmbee",
        "url": "https://www.vice.com/en/article/dy7eaw/robot-landlords-are-buying-up-houses",
        "text": "",
        "created_utc": 1669665549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Planetizen's Top Urban Planning Books of 2022",
        "author": "Planetizen",
        "url": "https://www.planetizen.com/features/119960-top-urban-planning-books-2022",
        "text": "",
        "created_utc": 1669665532,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Road Barriers Stopped Killing Drivers",
        "author": "MileJonesJr",
        "url": "https://www.youtube.com/watch?v=vfS1gAWF_l0",
        "text": "",
        "created_utc": 1669663492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does transportation engineering experience count towards the AICP required experience?",
        "author": "TrafficLightGod",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z74jr6/does_transportation_engineering_experience_count/",
        "text": "[removed]",
        "created_utc": 1669660939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does a masters in planning significantly raise your salary in the private sector?",
        "author": "PradleyBitts",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z735sp/does_a_masters_in_planning_significantly_raise/",
        "text": "Is the cost worth it?",
        "created_utc": 1669657942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rent Is Too Damned High: US Tenants Mobilize to Demand Rent Controls",
        "author": "GloomyDiscussions",
        "url": "https://truthout.org/articles/rent-is-too-damned-high-us-tenants-mobilize-to-demand-rent-controls/",
        "text": "",
        "created_utc": 1669654649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ontario Planners; RPP Mentor",
        "author": "VirtualMacaroon4",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z6ymfr/ontario_planners_rpp_mentor/",
        "text": "I am looking for a RPP Mentor and am curious to know if it matters to find someone who is working on issues you find interesting?\n\nIe I'm working in the private development realm atm and would like to do something more environmental or economic development focused. Should my Mentor have that kind of experience or does it matter?\n\nThanks for your input!",
        "created_utc": 1669647365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Affordable housing - 6 storey/floor limit?",
        "author": "StPapaNoel",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z6rkk8/affordable_housing_6_storeyfloor_limit/",
        "text": "So I recently heard that if we were to build more affordable housing (smaller apartment/micro apartment style) that the buildings can only be a max of 6 storeys/floors because electrical or some other energy thing becomes less and less powerful or something as it goes up?\n\nAnd that infrastructure needs to be different for above 6 storeys/floors for the system?\n\nIs any of this true or if not could we just build huge fucking sky scrapers for micro/small apartments to help save on land and bring down the cost of housing?",
        "created_utc": 1669625821,
        "upvote_ratio": 1.0
    },
    {
        "title": "Americas dangerous roads",
        "author": "n10w4",
        "url": "https://www.nytimes.com/2022/11/27/upshot/road-deaths-pedestrians-cyclists.html",
        "text": "",
        "created_utc": 1669613852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Riding the Amtrak Northeast Regional...Boston to New York City (downtown to downtown service)",
        "author": "travelswithtom",
        "url": "https://youtu.be/C35xS8SgzXo",
        "text": "",
        "created_utc": 1669594945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Rails to Trails the new NIMBY method for preventing transportation?",
        "author": "climberskier",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z6heo7/are_rails_to_trails_the_new_nimby_method_for/",
        "text": "Don't get me wrong I like biking, but we have got to start asking ourselves, how many of these Rail to Trail attempts are just ways to prevent future use of the Rail ROW's? For quiet suburbanites to drive their car to the path once in a while to get some exercise.\n\nI much prefer Rails WITH Trails, which movement hasn't seen as much love. It combines transit with biking, allowing you to bike to each station. An example will be the new Somerville Community Path in Somerville, MA, which will go alongside a new Light Rail corridor and a commuter rail corridor. I think part of the reason why this hasn't caught on is that trains are often considered unsafe and not a place that a bike-path should be alongside.\n\nPlanners need to consider the future impacts of Rails to Trails conversion. An argument is usually made by planners that it \"preserves the Right of Way for future transit use\". But what I have seen, especially locally, is that once the bike trail is a success, talks of re-converting it to a rail system or making it a \"rail with trail\" are unsuccessful. An example of this is the extremely successful Minuteman Bike Path in Massachusetts, which was originally supposed to be a subway extension, but political issues prevented that. It is now a great bike path that is often too popular for it's own good (ie: bike crashes due to high bike traffic!). However, the success of this path basically makes expanding the subway extremely more expensive, as now a tunnel would basically be required for the entire length to retain the bike path.\n\nAny thoughts on this? Will this rapid \"Rail to Trails\" conversion be the interstate highway disaster of our generation? Or can we promote \"rails with trails\" and provide high-quality bike paths and trains? Thoughts?",
        "created_utc": 1669594684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Many Cities Suck (and Los Angeles Doesn't Have to)",
        "author": "bryle_m",
        "url": "https://www.youtube.com/watch?v=Hjmbt1jBVmY",
        "text": "",
        "created_utc": 1669593014,
        "upvote_ratio": 1.0
    },
    {
        "title": "How hard is it to get into planning with a Masters in Public Policy?",
        "author": "057292749292",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z6gc36/how_hard_is_it_to_get_into_planning_with_a/",
        "text": "[removed]",
        "created_utc": 1669591950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommended Experience for Masters Program?",
        "author": "Logical-Pea-65",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z6g0lo/recommended_experience_for_masters_program/",
        "text": "I have been consider a career switch for a couple years now and was thinking about applying for a masters program in urban planning next year. Just wanted to ask those with knowledge of the practice what kind of experience would be valued in a university application for urban planning? And if there are any recommended resources, courses, or certifications I should invest in now?\n\nMy background: I currently work as an accounting consulting manager in the US (about to move to NYC), have an accounting designation (CPA) and have around 6 years of working experience. I have a bachelor and masters in accounting from Canada. I believe I could call out some transferable skills I've developed from my professional experience (i.e. communication, teamwork, client service, project management skills etc.). But I really only have my work experience to speak to due to poor work-life balance over my career / poor prioritization on my part.\n\nI am still in the early stages of considering urban planning for a career switch, but it's one of the few prospects that excite me and was just wondering what I should direct my attention to in order to improve my chances for a university application? I have thought that it would make most sense to pursue volunteer opportunities in NYC but was also wondering what specific positions would be best to pursue. Thanks in advance! Any positive contributions are appreciated.",
        "created_utc": 1669591166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brightline trains tested at full speed as private railroad's Florida network grows",
        "author": "Living-Well-S2014",
        "url": "https://www.bizjournals.com/orlando/news/2022/11/25/brightline-trains-testing-florida.html",
        "text": "",
        "created_utc": 1669585477,
        "upvote_ratio": 1.0
    },
    {
        "title": "Southern cities, cars, hurricanes",
        "author": "TheNextChapters",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z6aga0/southern_cities_cars_hurricanes/",
        "text": "I’ve seen recent posts about how to make cities more walkable and less dependent on cars. I think a lot of those ideas are good. But it got me thinking about cities in Hurricane prone areas. It seems like lately people in Florida are being told to evacuate at least once a year.\n\nIf those people lived in walkable cities and didn’t have cars how would they evacuate? Would their be enough trains to accommodate them all and would the trains allow pets under those circumstances?",
        "created_utc": 1669578114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a standard town become a well-planned city without ultra-wealthy citizens in that city?",
        "author": "markpemble",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z67mm8/can_a_standard_town_become_a_wellplanned_city/",
        "text": "Are there example towns out there in North America that have become well-developed -\n\nie:\n\n* Pleasant, safe, heavily used parks\n* Walkable Downtown with sustainable businesses\n* Functioning bicycle pathway system\n* Walkable neighborhoods\n* Decent public transportation system\n\nwithout the presence of wealth that comes from ultra-wealthy citizens?\n\nIs this even possible?",
        "created_utc": 1669571490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Commentary: Fall leaf pickup wastes money and mulch",
        "author": "canudoa",
        "url": "https://www.timesunion.com/opinion/article/Commentary-Fall-leaf-pickup-wastes-money-and-17607084.php",
        "text": "",
        "created_utc": 1669570729,
        "upvote_ratio": 1.0
    },
    {
        "title": "What current urban planning principle/trend do you think will be looked back on with horror 50 years down the line?",
        "author": "zhrmghg",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z664nb/what_current_urban_planning_principletrend_do_you/",
        "text": "Nowadays we look back to things like car-centric planning principles, Le Corbusier garden cities, scrapping of light rail networks, and low-density suburbia sprawl as examples of 'bad' urban planning. What currently popular trends or 'good' principles do you think will be viewed in a similar way years down the line?",
        "created_utc": 1669568045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freeway Capping or Removal Can Go a Long Way Towards Improving Urban Areas",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z5q700/freeway_capping_or_removal_can_go_a_long_way/",
        "text": "More and more cities are starting to cap, lid or burry freeways similar to what Boston did with Big Dig.\n\n[https://lidi5.org/case-studies/](https://lidi5.org/case-studies/)\n\nThis can go a long way towards improving access to open or green space, reducing noise and pollution from cars and better utilizing scarce urban land. \n\nBoston's big dig helped spur investment in Downtown\n\n[https://muninet.harris.uchicago.edu/2006/02/22/big-dig-spurs-economic-development-in-boston/](https://muninet.harris.uchicago.edu/2006/02/22/big-dig-spurs-economic-development-in-boston/)\n\n[https://www.planetizen.com/news/2018/10/101073-big-dig-was-big-catalyst](https://www.planetizen.com/news/2018/10/101073-big-dig-was-big-catalyst)\n\nIt seems to have had a similar effect in Dallas Texas\n\n[https://www.atlantafed.org/blogs/macroblog/2022/11/07/do-freeway-lids-spur-development-in-cities--evidence-from-dallas](https://www.atlantafed.org/blogs/macroblog/2022/11/07/do-freeway-lids-spur-development-in-cities--evidence-from-dallas)\n\nI would prefer removal in many cases, but lidding or capping can be a good compromise that preserves freeways which not only move cars but trucks and buses.",
        "created_utc": 1669519302,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying for master's degree. Does this community volunteering experience count as relevant/professional experience?",
        "author": "vanchicko",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z5pnw9/applying_for_masters_degree_does_this_community/",
        "text": "My friend and I weren't good enough to join an actual orchestra, so we started off playing instruments by ourselves, but we slowly developed the idea to play music for hospitalized patients, children, seniors, and underserved communities because they often can't access an orchestra due to physical or financial constraints. We're slowly building this ensemble up to a community orchestra.\n\nDo you think I can write this experience in my SOP or my resume as a relevant or professional experience for 'social planning for inclusive communities'?",
        "created_utc": 1669517774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying for masters programs. Will my experience in organizing a community orchestra, help?",
        "author": "vanchicko",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z5pm30/applying_for_masters_programs_will_my_experience/",
        "text": "My friend and I weren't good enough to join an actual orchestra, so we started off playing instruments by ourselves, but we slowly developed the idea to play music for hospitalized patients, children, seniors, and underserved communities because they often can't access an orchestra due to physical or financial constraints. We're slowly building this ensemble up to a community orchestra.\n\nDo you think I can write this experience in my SOP or my resume as relevant experience for 'social planning for inclusive communities'?",
        "created_utc": 1669517622,
        "upvote_ratio": 1.0
    },
    {
        "title": "So You Want To Do An Infrastructure Package? (PDF paper)",
        "author": "hereditydrift",
        "url": "https://www.niskanencenter.org/wp-content/uploads/2021/03/levy-infastructure.pdf",
        "text": "",
        "created_utc": 1669514814,
        "upvote_ratio": 1.0
    },
    {
        "title": "The High Price of Urban and Walkable Areas Doesn't Necessarily Indicate Higher Demand",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z5nv8e/the_high_price_of_urban_and_walkable_areas_doesnt/",
        "text": "[removed]",
        "created_utc": 1669512535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can World Cups help us build better transit systems?",
        "author": "colorsnumberswords",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z5ngwx/can_world_cups_help_us_build_better_transit/",
        "text": "[removed]",
        "created_utc": 1669511407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommendations on groups to join for networking with planners in the SF Bay Area?",
        "author": "PradleyBitts",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z5luks/any_recommendations_on_groups_to_join_for/",
        "text": "Are APA fees worth it?",
        "created_utc": 1669506902,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get involved in your city’s planning department as a young college student?",
        "author": "MasterpieceNo2002",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z5fwav/how_to_get_involved_in_your_citys_planning/",
        "text": "[removed]",
        "created_utc": 1669491436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disabled in Europe (historical Centres)",
        "author": "Nunohon",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z5fp1t/disabled_in_europe_historical_centres/",
        "text": "Solutions on Urban planning in European historical Centres, not compromising the Heritage and providing safety and comodity to disabled people?",
        "created_utc": 1669490900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Realistically, how long do we need to wait for housing and rental prices to drop as more high density housing is constructed?",
        "author": "Yakima42",
        "url": "/r/neoliberal/comments/z5d5y2/realistically_how_long_do_we_need_to_wait_for/",
        "text": "",
        "created_utc": 1669484459,
        "upvote_ratio": 1.0
    },
    {
        "title": "California High Speed Rail is Fine; And the Wild Scrutiny of Transit Projects in the US",
        "author": "SuccessfulOperation",
        "url": "https://www.youtube.com/watch?v=PwNthD-LRTQ",
        "text": "",
        "created_utc": 1669478351,
        "upvote_ratio": 1.0
    },
    {
        "title": "this depressing unfinished \"sidewalk\" in my home suburb makes walking anywhere impossible",
        "author": "ZequizFTW",
        "url": "https://www.reddit.com/gallery/z58gh4",
        "text": "",
        "created_utc": 1669473670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urbanizing climate justice. City's annual leture invite. (Virtual or in person, London)",
        "author": "CITYAnalysis",
        "url": "https://www.eventbrite.com/manage/events/472809765737/details",
        "text": "",
        "created_utc": 1669473180,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your favorite city?",
        "author": "Puppetmasterknight",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z528hc/whats_your_favorite_city/",
        "text": "And why is it ur fav",
        "created_utc": 1669450763,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we decrease cars in downtowns without blocking suburbanites from entering the downtown?",
        "author": "_Fruit_Loops_",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z5244z/how_do_we_decrease_cars_in_downtowns_without/",
        "text": "There is, of course, a need for suburbanites to get into the downtown (shitty as the means with which they get in may be), because there sure as shit isn't much in their suburb. Plus the downtown wants those people to bring their money in.\n\nSo say we take away a lot of space for cars downtown and rededicate it to other stuff, like I and everyone else here wants. How do the suburbanites get in? Walk? Bike? Bus? Ditch their SUV for a microcar? \n\nAll of that is *vaguely* feasible, and would be good. But making those things *actually* happen is another big layer of challenge, on top of the original challenge of removing the cars from the downtown in the first place.\n\nI assume planners are smart enough to have accounted for this, of course. So what’s the solution? Or does the situation just sort itself out?",
        "created_utc": 1669450340,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting a job with a bachelors of geography with a certificate in urban planning",
        "author": "Small_Celebration_94",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z4ztst/getting_a_job_with_a_bachelors_of_geography_with/",
        "text": "Currently studying at queens university getting a bachelor’s in Geo with a cert in urban planning. I didn’t initially go to queens for this program but realized I was interested in planning in my second year.. I know that it’s not an accredited planning or but I don’t really want to have to transfer. Is it possible to get a job within planning with this degree? Or will I definitely need a masters?",
        "created_utc": 1669442644,
        "upvote_ratio": 1.0
    },
    {
        "title": "What education do I need to become an urban planner?",
        "author": "WoodlandDruid",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z4x1ld/what_education_do_i_need_to_become_an_urban/",
        "text": "What undergraduate degree do i need to become an urban planner? im intrested in majoring in public policy or political science for my undergrad but im still confused on what education i need and the paths to become one.",
        "created_utc": 1669434105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do urbanists hate cars?",
        "author": "Living-Well-S2014",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z4qqy7/why_do_urbanists_hate_cars/",
        "text": "[removed]",
        "created_utc": 1669416630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does induced demand also apply to housing?",
        "author": "All-things-urbanism",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z4pqp0/does_induced_demand_also_apply_to_housing/",
        "text": "Title",
        "created_utc": 1669414138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Undergrad Programs?",
        "author": "italianmustard",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z4kqdy/undergrad_programs/",
        "text": "Heya folks, I was hoping to do a masters in urban planning in the future, what undergrad programs should I take to get there? Likely going to do my masters somewhere in Scandinavia or Canada.",
        "created_utc": 1669401673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should Cities Get Rid of On-Street Parking?",
        "author": "mattjpm",
        "url": "https://youtu.be/oohnfpBL9uE",
        "text": "",
        "created_utc": 1669390245,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Third Places\" in suburbia?",
        "author": "IvyDivey",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z4dnjh/third_places_in_suburbia/",
        "text": "I am very interested in the possibilities of strengthening \"communities of neighbors\". Has anyone heard of successful \"third places\" created by residents? I'm interested in \"low barrier to entry\" and \"replicable\" ideas in particular, but unusual stories also welcome! The Turquoise Table movement is one such idea. Thank you!",
        "created_utc": 1669383636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Potential Urban Planner Here",
        "author": "Excellent_Bank_1877",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z45jgw/potential_urban_planner_here/",
        "text": "I am not an engineering person, but I’ve always loved solving puzzles. I’m really interested in rural planning or transportation planning, but my major is in Economic Development so I need a masters to get a planning job. \n\nI want to be the person who helps politicians, community members, and designers figure out how to best improve [fill in the black]. Is becoming an urban planner realistic if engineering isn’t my thing? And if it is unrealistic, do you know of any other options out there that I might suit better towards?\n\nThank you!!",
        "created_utc": 1669355882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban Growth Boundaries Fail to Curb Urban Sprawl and Increase Per Capita VMT",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z3s3u4/urban_growth_boundaries_fail_to_curb_urban_sprawl/",
        "text": "If we are judge to anti-sprawl policies such as urban growth boundaries, greenbelts, agriculture and open space zoning, and conservation easements by their own standard, which is curbing urban sprawl, well then they are in fact unabashed failures. \n\nPeople will argue that boundaries are fine as long as we have densification, well almost every place that has implemented boundaries has failed to densify, there are exceptions but generally no. Places that have urban growth boundaries are almost always anti-development in general; they go above and beyond the restrictions of typical zoning codes. Urban growth boundaries are pretty much always bundled with long permitting times, high impact fees, \"affordability\" requirements, and very restrictive zoning. Creating dense infill is almost always easier in place that doesn't have urban growth boundary, but still has some sort zoning, say Atlanta, Las Vegas, or Dallas than in a place that has an urban growth boundary; and it's even in easier in Houston which has neither zoning or urban growth boundaries. Basically urban growth boundaries and anti-development nimby policies are a package deal, you can't really get one without the other. Moreover if cities become unaffordable then densities will decline simply because can't people afford to live there and the higher prices will cause population to shrink. The level of densification necessitated by an urban growth boundary because of extremely high land prices, is high rises, not \"missing middle\" and that's much harder to sell to local governments and nimbys. Urban growth boundaries won't turn your city into a historic European one, they will turn you into Seoul, Mumbai, Manila, or Hong Kong. Development is dictated by cold hard economic realities ***not aesthetics***; policy makers need to understand that when creating land use policies. When homes to tear down are millions of dollars a piece and vacant parcels are millions per acre, then \"legalizing\" \"missing middle\" such duplexes and fourplexes will not even not make a dent in affordability and may not even be built; especially not if the middle isn't actually missing in a place like Toronto or San Francisco\n\nWe can look at Portland, the city's density is basically sunbelt densities. It's denser than Atlanta or Houston, but not substantially so.\n\n[https://www.opendatanetwork.com/entity/1600000US4159000/Portland\\_OR/geographic.population.density?year=2018](https://www.opendatanetwork.com/entity/1600000US4159000/Portland_OR/geographic.population.density?year=2018)\n\nSan Diego City is in San Diego county which has designates much of itself as open space and restricts the development of agricultural land, has a ***lower density*** than Las Vegas. Outside the city proper most development in San Diego county is even lower in population density. Go up the 78 freeway and it is miles and miles of strip malls, subdivisions and big box stores.\n\nFrom: OPENING SAN DIEGO’S DOOR TO LOWER HOUSING COSTS\n\n[https://wordpressstorageaccount.blob.core.windows.net/wp-media/wp-content/uploads/sites/867/2018/12/Opening-San-Diego%E2%80%99s-Door-to-Lower-Housing-Costs.pdf](https://wordpressstorageaccount.blob.core.windows.net/wp-media/wp-content/uploads/sites/867/2018/12/Opening-San-Diego%E2%80%99s-Door-to-Lower-Housing-Costs.pdf)\n\n\"Within this “undevelopable” designation, there is significant acreage that is geographically suitable for development, but which has been designated as open space and/or open space preserve.\"\n\n[https://www.opendatanetwork.com/entity/1600000US0666000/San\\_Diego\\_CA/geographic.population.density?year=2018](https://www.opendatanetwork.com/entity/1600000US0666000/San_Diego_CA/geographic.population.density?year=2018)\n\nBut Las Vegas has basically the same population density of Portland and it has no smart growth policies.\n\n[https://www.opendatanetwork.com/entity/1600000US3240000/Las\\_Vegas\\_NV/geographic.population.density?ref=entity-question&amp;year=2018](https://www.opendatanetwork.com/entity/1600000US3240000/Las_Vegas_NV/geographic.population.density?ref=entity-question&amp;year=2018)\n\nIn the case of San Francisco, its densities aren't much higher today than they were in the 1960s before growth management was implemented. In the case of Los Angeles it was densifying before Ventura county walled in LA with its own urban growth boundaries.\n\n[https://www.jstor.org/stable/10.1525/phr.2008.77.1.87](https://www.jstor.org/stable/10.1525/phr.2008.77.1.87)\n\nVentura county walls in Los Angeles with ugbs, but unsurprisingly they don't want density either.\n\n[https://www.desertsun.com/story/opinion/columnists/2016/08/13/mathews-anti-sprawl-ventura-county/88642744/](https://www.desertsun.com/story/opinion/columnists/2016/08/13/mathews-anti-sprawl-ventura-county/88642744/)\n\nTo the extent that urban growth boundaries caused an increase in density, then those places probably could have achieved that more cost effectively by simply getting rid of development restrictions.\n\nAnother effect of Urban growth boundaries is creating leapfrog development and a resulting increase in per capita vehicle miles. \n\nThanks to Portland's urban growth boundary, people now commute farther distances away from well outside the metro area.\n\n[https://www.forbes.com/sites/scottbeyer/2017/03/29/portlands-urban-growth-boundary-a-driver-of-suburban-sprawl/?sh=489125d86964](https://www.forbes.com/sites/scottbeyer/2017/03/29/portlands-urban-growth-boundary-a-driver-of-suburban-sprawl/?sh=489125d86964)\n\n[https://www.mercatus.org/bridge/commentary/curbing-urban-growth-boundaries-connect-town-and-country](https://www.mercatus.org/bridge/commentary/curbing-urban-growth-boundaries-connect-town-and-country)\n\nThe bay area through it high prices, partially a result of its own urban growth boundaries, has pushed people into the central valley with 3 plus hour commutes. \n\n[https://abc7news.com/super-commuters-bay-area-traffic-3-hour-commute-three/5195381/](https://abc7news.com/super-commuters-bay-area-traffic-3-hour-commute-three/5195381/)\n\nAlon Levy goes as far as to argue that greenbelts make driving more convenient by making development non continuous. \n\n[https://pedestrianobservations.com/2016/07/12/greenbelts-help-cars/](https://pedestrianobservations.com/2016/07/12/greenbelts-help-cars/)\n\nIf urban growth boundaries and other anti-sprawl policies are judged by their own standard of encouraging more compact development, reducing sprawl and through those reducing per capita vmt, then they are an unabashed failure. It's another example of a policy where doing nothing produces better outcomes than doing something.",
        "created_utc": 1669317040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Milan is opening a new metro line (M4) and above the line, and on the ground above the excavation they created cycle paths, sporting facilities, kids' playgrounds and gathering spaces.",
        "author": "a_dude_from_europe",
        "url": "https://www.reddit.com/gallery/z3p66v",
        "text": "",
        "created_utc": 1669310558,
        "upvote_ratio": 1.0
    },
    {
        "title": "[REPOST] Bus shelter design survey",
        "author": "Big-Attention-2935",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z3iy46/repost_bus_shelter_design_survey/",
        "text": " \n\nHello everybody. I'm working on my final degree project, for a bus shelter design ,and i need some help with this survey . It takes only 30 sec.\n\nThank you.\n\n[https://www.survio.com/survey/d/R4E1S8H7B1R0Y1Z5M](https://www.survio.com/survey/d/R4E1S8H7B1R0Y1Z5M)",
        "created_utc": 1669293666,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get a sidewalk built?",
        "author": "loading55",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z33h3t/how_to_get_a_sidewalk_built/",
        "text": "Hey all!\n\nWondering if anybody has any experience getting sidewalks built (especially on stateDOT-owned roads). How would you explain this process to a newcomer? What does a municipality need to do to make this happen? What can citizens requesting sidewalks do to make this process easier for the municipality?\n\nMany large cities have sidewalk request forms, but many places do not. In places without them, what process happens? In places with these forms, what do the municipalities do with this information?\n\nI'm doing a research project on this subject and I'm getting stuck. Thanks!",
        "created_utc": 1669244709,
        "upvote_ratio": 1.0
    }
]