[
    {
        "title": "Retail Affordability",
        "author": "PlinyToTrajan",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zhxh0q/retail_affordability/",
        "text": "Retail affordability has come up as an issue in my city.  Two old malls in the City's downtown are slated for development into hundreds of new luxury apartments, plus other developments which are resulting in the addition of, cumulatively, thousands of new \"highly amenitized\" luxury apartments.  \n\nIn the same neighborhood, there are public and subsidized housing projects, which, although they have undergone some reconstruction and reconfiguration, have housed low-income people for generations. \n\nThis lower-income community is complaining about the loss of affordable retail.  In other words, with the luxury apartments has come the loss of businesses that once offered affordable goods (e.g., an inexpensive, large Asian supermarket; a Wal-Mart; a food court with a Subway and other low-cost takeout; inexpensive and humble independent coffeeshops; a McDonald's), to be replaced with far more upscale shops and restaurants.\n\nIs there any known approach to responding to a complaint of this kind?  Even myself, middle-income not low-income, am bothered by the loss of the more affordable shopping options.  The area was never a food desert; it was always dense enough to support a range of shopping outlets which included fresh food, and the more affordable ones are indeed being eliminated by what has every appearance of a process of gentrification.",
        "created_utc": 1670691712,
        "upvote_ratio": 1.0
    },
    {
        "title": "The battle over single-family zoning is also a fight over what to call it",
        "author": "ItinerantForester",
        "url": "https://www.washingtonpost.com/dc-md-va/2022/12/10/zoning-single-family-detached-neighborhood/",
        "text": "",
        "created_utc": 1670673501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frances Anderton Explores LA’s Rich Multifamily Housing Identity",
        "author": "RemoveInvasiveEucs",
        "url": "https://www.planningreport.com/2022/12/07/frances-anderton-explores-la-s-rich-multifamily-housing-identity",
        "text": "",
        "created_utc": 1670651927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practicing Urban Planning in another country (Canada to UK)",
        "author": "InternationalLine127",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zheh0p/practicing_urban_planning_in_another_country/",
        "text": "Hi everyone. I'm a Canadian who's interested in going to school for planning. However, part of me wants to live abroad for a year or two practicing planning in another commonwealth country (probably London or Dublin but maybe elsewhere in Europe) and I've heard getting a visa for work opportunities there isn't difficult for Canadian youth. The one problem is that I'm not sure how well my education would play out there. Is there any way to gain experience abroad with a Canadian degree for someone who doesn't want to go into transportation planning?",
        "created_utc": 1670634013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transportation Planning: Moving from public sector to consulting",
        "author": "Available_Curve5074",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zh8mky/transportation_planning_moving_from_public_sector/",
        "text": "There is a high possibility I (24F) am going to get a job offer from one of the main infrastructure engineering firms within the next couple weeks and feel conflicted about it. I know planners move from government to consulting roles all the time, so I am wondering what your transition to a consulting position was like, if you have done this yourself. \n\nI love my job, but pay would be significantly higher if I take this new job. I feel really guilty for leaving my current role because my agency has been constantly hiring new people as we've had a huge wave of retirements and a couple other planners moving to private firms as well. \n\nI know its important to not stay stagnant at a job and the best way to increase your income is to take on new roles. I guess at the end of the day I gotta do what's best for me and my career.",
        "created_utc": 1670619712,
        "upvote_ratio": 1.0
    },
    {
        "title": "There’s No Such Thing as a Free Bus",
        "author": "FaultyTerror",
        "url": "https://www.theatlantic.com/ideas/archive/2022/12/washington-dc-free-bus-transit/672407/",
        "text": "",
        "created_utc": 1670603833,
        "upvote_ratio": 1.0
    },
    {
        "title": "63,000 reasons we struggle to build anything",
        "author": "FaultyTerror",
        "url": "https://www.thetimes.co.uk/article/63-000-reasons-we-struggle-to-build-anything-3rmvcxgkc",
        "text": "",
        "created_utc": 1670603238,
        "upvote_ratio": 1.0
    },
    {
        "title": "How strict land use restrictions led to rising housing prices, which reversed the trend of low-wage workers moving to high-wage places, which stopped the trend toward converging per-capita incomes between rich states and poor states",
        "author": "Shanedphillips",
        "url": "https://www.lewis.ucla.edu/2022/11/30/38-the-supply-migration-income-relationship-with-peter-ganong/",
        "text": "",
        "created_utc": 1670599745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parking machine per amount of cars, any guidelines?",
        "author": "p_andsalt",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zgyuah/parking_machine_per_amount_of_cars_any_guidelines/",
        "text": "I do not come from an urban planning background, but I was wondering if maybe someone could help. Are there any guidelines or regulation of how to place parking machines? How you position them, how many per car, how you do wayfinding? How would I look up this information and what search terms should I use? I talking about an open parking, no garage or closed off parking. Any country is okay, it can help with the search terms if I have a document (but case is in Europe).",
        "created_utc": 1670596344,
        "upvote_ratio": 1.0
    },
    {
        "title": "We are short of 4 million homes according to Freddie Mac. But what kind?",
        "author": "TopMicron",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zgyr6c/we_are_short_of_4_million_homes_according_to/",
        "text": "Freddie macs report says we have a shortage of 4 million homes. \n\n\nhttps://www.freddiemac.com/research/insight/20210507-housing-supply\n\n\nBut do they make meaningful distinction?",
        "created_utc": 1670596132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Images/time lapse of city being built?",
        "author": "somanyof",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zgyr3k/imagestime_lapse_of_city_being_built/",
        "text": "Hi there, \n\nI hope this is the right sub for a question like this. For an art project (I'm an artist, not a student, this is not a school related question) I am looking for images, or even better, time lapses, of the various stages of the construction of a city. Yes: of entire cities, so 'cities from scratch' like Brasília or newer cities. I'm not looking for images of cities in games/fictional cities! \n\nI won't be using the images directly in the project btw, I just need to get a 'feel' for what it looks like, piece of land turning into an entire city. \n\nDoes anyone know where to look? Of course I google a lot, also tried youtube, but I have a sense that I'm missing out on an big urban planning part of the internet... \n\n(Again: very sorry if this is not the right sub for this question! I figured there's lots of experts here, but please let me know where I could pose this question elsewhere! Also: English is not my mother tongue so forgive any mistakes I made...)",
        "created_utc": 1670596126,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some alternatives to the suburbs?",
        "author": "Sexy-MrClean",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zgmm25/what_are_some_alternatives_to_the_suburbs/",
        "text": "I studied geography in college and much of what I studied involved urban and transportation planning. One common complaint I’ve always heard is about how bad the suburbs are, how they’re expensive, un-walkable, alienating, racist, etc. Despite the complaints I’ve still never really heard a feasible alternative or replacement for the suburbs. Having suburbanites move back into cities on its own doesn’t seem to work well as it just gentrifies poorer communities and drives up the cost of living which then kicks poor people out. So instead of that, I’m interested to hear if there are any popular proposals or models for alternatives to the suburbs.",
        "created_utc": 1670559558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas of next generation of housing?",
        "author": "Bencze2015",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zgld7m/ideas_of_next_generation_of_housing/",
        "text": "Here for the convo and ideas. \nI'm under the belief that we should be building fully integrated homes in factories.\nObviously Mobil, prefab, modular. Homes exist.\nBut non are scalable to 60% plus of new homes or at least haven't been yet. \nJust like phones, cars, planes, &amp; literally everything else are built in factories at the millions. \nJust want discussion and ideas to flow.",
        "created_utc": 1670556025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources on the intersection of good city planning and health",
        "author": "mistermasterman",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zgfw7f/resources_on_the_intersection_of_good_city/",
        "text": "Hello all! I am looking to start a club at my school about healthy cities, specifically how good urban planning can support and promote good health for its citizens. Are there any good resources I can use to build my own knowledge base on this and promote?",
        "created_utc": 1670542510,
        "upvote_ratio": 1.0
    },
    {
        "title": "NYC unveils “Get Stuff Built” plan to streamline and accelerate building and land use approval",
        "author": "Spirited-Pause",
        "url": "http://nyc.gov/getstuffbuilt",
        "text": "",
        "created_utc": 1670538829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reykjavik BRT",
        "author": "OtterlyFoxy",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zgd08h/reykjavik_brt/",
        "text": "[removed]",
        "created_utc": 1670536472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on pivoting from land use planning to transportation planning?",
        "author": "PradleyBitts",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zgczgt/advice_on_pivoting_from_land_use_planning_to/",
        "text": "Has anyone done this? Trying to understand how I can translate land use planning to transportation planning roles",
        "created_utc": 1670536426,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] What forms of development do Americans support nationally and locally?",
        "author": "1-aviatorCyclohexane",
        "url": "https://www.reddit.com/gallery/zfyqom",
        "text": "",
        "created_utc": 1670530854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Commute Distances Do not Limit Sprawl",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zg9fd4/commute_distances_do_not_limit_sprawl/",
        "text": "One idea I have run across is that idea that cities can't expand outwardly forever, but I believe this to be incorrect. Now cities can't in a very literal expand outwardly forever given that there is a finite amount of land, but they can expand pretty far out. Even if land is finite, the earth surface is massive and it is unlikely that humans will ever use it all up. \n\nThe idea is basically this, commute times will eventually get so long that cities will not be able to sprawl anymore. I define sprawl in the broadest sense of the word, the mere outward expansion of cities, so in this definition both Levittown, NY and Brooklyn would be examples of Sprawl. In other words people will keep commuting longer and longer distances that cities will not able to grow out anymore. However this assumes two things, that longer commutes aren't possible and that jobs stay in the same place forever.\n\n1. People won't accept long commutes - Super-commuting is a thing. People in the Bay Area will spend as much as 1.5 hours each way commuting from the Central valley to Bay Area, [https://abc7news.com/super-commuters-bay-area-traffic-3-hour-commute-three/5195381/](https://abc7news.com/super-commuters-bay-area-traffic-3-hour-commute-three/5195381/) , and the LA area has them too [https://spectrumnews1.com/ca/la-west/news/2019/08/16/la-tops-charts-for-super-commuters-with-90-minute-drives](https://spectrumnews1.com/ca/la-west/news/2019/08/16/la-tops-charts-for-super-commuters-with-90-minute-drives)\n2. Jobs stay in the same place forever - One thing people fail to recognize is not only do people spread out, jobs do as well. This assume that all jobs are concentrated in CBDS and never move, but even places with strong CBDs have multiple job centers. Just as people leave urban areas for the suburbs, jobs do as well. Just as people have left urban areas so too have offices, factories, stores and in auto oriented suburbs, you have functions like car dealerships and car repair places. With auto oriented job sprawl you get office parks, strip malls, big box stores, malls, industrial parks, drive in hotels and so forth replacing downtown shopping, downtown offices, downtown hotels, downtown factories and so forth. Even if we assume that jobs concentrate, you get secondary job centers. Edge cities have tall office towers, tall hotels, and really large malls. Even if jobs existed in a concentrated manner, they can spread beyond the CBD and form secondary centers or edge cities. Tokyo and Paris, despite being transit oriented both have several different job centers just as Atlanta or Los Angeles does. Both cars and transit can work with polycentric cities that have multiple job centers and thus urban expansion isn't limited by distance to jobs. If people move, jobs can move as well, even if jobs are concentrated, they can simply concentrate outside a cbd. Edge Cities [https://en.wikipedia.org/wiki/List\\_of\\_edge\\_cities](https://en.wikipedia.org/wiki/List_of_edge_cities) [https://en.wikipedia.org/wiki/Edge\\_city](https://en.wikipedia.org/wiki/Edge_city) Polycentric cities [https://en.wikipedia.org/wiki/Polycentric](https://en.wikipedia.org/wiki/Polycentric)  \n\nPeople might bring up transportation subsidies, but absent transportation subsidies, roads and transit would still exist, they would just be provided by private companies. It's likely that absent subsidies, both forms of transportation would be cheaper. In a free market you could import materials from anywhere, import labor from anywhere, child labor would be legal, no government unions, there would be no minimum wage or social security taxes and it would be cheaper to build roads or build transit such as heavy rail or monorails and cheaper to operate. Cheap labor would mean trains are cheap to run.",
        "created_utc": 1670529034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roadways for People: The Necessity of Collaboration",
        "author": "Planetizen",
        "url": "https://www.planetizen.com/features/120193-roadways-people-necessity-collaboration",
        "text": "",
        "created_utc": 1670522343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good books on the history of public spaces?",
        "author": "Tristan_Cleveland",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zg3vq6/good_books_on_the_history_of_public_spaces/",
        "text": "I teach a course on the history of cities. I've always wanted to do a lecture on the history of public space — why it exists, what it was used for over time, its role in revolutions, how governments try to control it, etc etc. — and I was surprised I struggled to find anything on this topic. Is there a book or anything on this that for some reason I'm missing?\n\nIf not, would you mind writing this book? It should exist.",
        "created_utc": 1670517071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are trams better than subways?",
        "author": "newmanstartover",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zfzvmo/are_trams_better_than_subways/",
        "text": "Are trams better than subways? Tram networks can be walkable and cyclable, people friendly and cheaper. Subway systems seem very effective for large metropolitan areas moving lots of people to far away stops, but I imagine they are orders of magnitudes more expensive. Does this question really depend on the city in review e.g. size, frequency of use, volume of passages etc",
        "created_utc": 1670508335,
        "upvote_ratio": 1.0
    },
    {
        "title": "That One Time Chicago was Lifted 14 Ft in the Air",
        "author": "vexnorz",
        "url": "https://youtu.be/N7v30dCHkjw",
        "text": "",
        "created_utc": 1670504704,
        "upvote_ratio": 1.0
    },
    {
        "title": "San Jose killed free parking",
        "author": "thr3e_kideuce",
        "url": "https://www.nrdc.org/experts/rabi-abonour/san-jose-says-no-minimum-parking-requirements",
        "text": "",
        "created_utc": 1670489027,
        "upvote_ratio": 1.0
    },
    {
        "title": "New York's Most Hated Highway is Falling Apart - The B1M",
        "author": "taulover",
        "url": "https://www.youtube.com/watch?v=1fYvVt3ckfc",
        "text": "",
        "created_utc": 1670479742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Skyscrapers Are Coming To An End",
        "author": "Millionized",
        "url": "https://youtu.be/GgUFSk1SP-4",
        "text": "",
        "created_utc": 1670478207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did any of y'all ever do an urban planning teach-in?",
        "author": "atlwellwell",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zfpa09/did_any_of_yall_ever_do_an_urban_planning_teachin/",
        "text": "This is an overwrought definition from wiki:  \n\n\n&gt;A **teach-in** is similar to a general educational forum on any complicated issue, usually an issue involving current political affairs. The main difference between a teach-in and a [seminar](https://en.wikipedia.org/wiki/Seminar) is the refusal to limit the discussion to a specific time frame or a strict academic scope. Teach-ins are meant to be practical, [participatory](https://en.wikipedia.org/wiki/Participatory), and oriented toward action.",
        "created_utc": 1670474749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Environmental Planning Reading Recs?",
        "author": "chetpastry",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zfnnpx/environmental_planning_reading_recs/",
        "text": "Hi everyone!\n\nI was wondering if anyone had any books/podcasts/journal articles/journals/etc. (any media really) about environmentally sustainable planning/development. I'm not as interested in urbanist lit as much, I'm more looking for stuff on land use/environmental technology stuff like carbon sequestration/waste management/maybe physical infrastructure solutions (?). \n\nAnything would help!\n\nI'm finishing up an environmental policy class in undergrad right now so I just want to see what the stuff I learned might look like through a more planning-focused lens. \n\nThanks guys : )",
        "created_utc": 1670470391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should more States require underground utility lines when feasible?",
        "author": "56Landon",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zfmzdk/should_more_states_require_underground_utility/",
        "text": "Besides making where you live “look prettier.”\n\nDo the benefits of underground utility wires outweigh the disadvantages. \n\nCost &amp; Maintenance efficiency are the 2 major issues I see.",
        "created_utc": 1670468598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources for high school club",
        "author": "Euphoric_Drawer_9430",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zfkm3g/resources_for_high_school_club/",
        "text": "I am leading a high school club focused on housing issues and our partner fell through. I am hoping to run the club on my own and focus on education and advocacy, but I’m having a hard time finding good teaching resources. Does anyone have a good high school curriculum or lesson or anything that could break down what the problems with America’s housing system are and what potential solutions exist?",
        "created_utc": 1670462541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Studies or Articles About Why American Style Suburbs/ Single Family Housing is Bad?",
        "author": "Comer_Agua",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zfggh2/studies_or_articles_about_why_american_style/",
        "text": "I am asking because I am in debate club at my school and one of the topics is whether we should end single-family housing federally I want better sources than the ones I have at the moment so I could improve on my speeches, Thanks.",
        "created_utc": 1670452613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for interview prep for a job that is in a different jurisdictions (out of province/state)",
        "author": "beewingers",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zff46y/any_tips_for_interview_prep_for_a_job_that_is_in/",
        "text": "Hi all, I'm a fairly new planner and I am up for a couple jobs in different provinces. I am from Ontario and the most pertinent jurisdiction is PEI (interview later this week), though I have applications out in BC and Alberta. What are some good tips to prep for this kind of interview. I am fully qualified and have the requisite experience and I'm sure they don't expect me to be totally versed in their framework but I'd like to show that I have the skills to learn and succeed in the position. Let me know what you think! Thanks!",
        "created_utc": 1670449819,
        "upvote_ratio": 1.0
    },
    {
        "title": "California bill would exempt church-sponsored housing projects from hellish zoning laws",
        "author": "nolandus",
        "url": "https://reason.com/2022/12/07/california-bill-would-exempt-church-sponsored-housing-projects-from-hellish-zoning-laws/",
        "text": "",
        "created_utc": 1670439971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conversations about \"Placemaking\"",
        "author": "andressawant",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zf8b3u/conversations_about_placemaking/",
        "text": "I work in community development in a mostly rural part of Upstate New York. My organization recently some grant funding for rural placemaking, and we're working with a small number of target communities to identify and pursue a few modest projects.\n\nIt's been tricky for me to come up with a concise explanation of \"placemaking\" with this community as the audience. My boss has been defaulting to using language like \"making your community a better place to live, work, and play,\" and then giving some specific examples of placemaking projects.\n\nDoes anyone have thoughts about improving clarity in these kinds of conversations? I'm happy to provide more info about the grant project, just feeling a little annoyed at the vagueness of the term and looking for ways to build rapport with the folks we're trying to help without sounding like an egghead.\n\nThanks!",
        "created_utc": 1670435953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Folk Economics and the Politics of Housing",
        "author": "belmaktor",
        "url": "https://www.city-journal.org/majorities-are-skeptical-of-zoning-reform",
        "text": "Conclusion:\n\"What we can say with confidence is that the mass public does not believe that housing is governed by the normal laws of supply and demand, and that this instinct gets in the way of the affordable future they desire.\"",
        "created_utc": 1670435111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting interchange",
        "author": "Delyo00",
        "url": "https://maps.app.goo.gl/XbixGr9fW1DeWka7A",
        "text": "Would this count as a service interchange or system interchange or both? A feature to look at in particular is that lef and right highways on bottom are only one way and when they meet there's no intersection unless you take the roundabout.",
        "created_utc": 1670424258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is accreditation important for a masters program?",
        "author": "dopvmine",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zf2buy/is_accreditation_important_for_a_masters_program/",
        "text": "Hi everyone! My girlfriend is in the process of applying to various urban planning masters programs. CSUN has a MUP degree, but the program is not accredited. I emailed them and they said they will start the process next year. Is PAB accreditation important? The university itself is accredited, but not the program. Will this affect her job outlook after graduation in any way? Thanks a lot!",
        "created_utc": 1670422982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Amsterdam's housing crisis impossible to fix for geographical reasons?",
        "author": "Yakima42",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zf27m6/is_amsterdams_housing_crisis_impossible_to_fix/",
        "text": "With the United States, Canada, and Australia, we are dealing with countries that have vast expanses of land. Even in more dense states like Massachusetts, Connecticut, etc. there is room to expand the city-limits of major metro areas like Boston, Hartford, etc. \n\nHowever, when we're dealing with The Netherlands, it's one of the smallest (geographically) countries in Europe. As such it's the 5th most densely populated country in all of Europe, and 16th in the world. The country itself is a very attractive destination for many expats because of: \n\n1. 30% ruling for 5 years\n2. Excellent public transportation/livability of major metro areas\n3. Great job market \n\nWith the pressures of both high demand, and exceptionally small land-area, is it The Netherlands (and similarly sized nations), basically doomed when it comes to having a chance to fix housing crisis?",
        "created_utc": 1670422662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to start with practicalities of planning?",
        "author": "ParisDreamer5",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zf0z5b/where_to_start_with_practicalities_of_planning/",
        "text": "Hi all,\n\nI recently got a job related to planning and regeneration, but haven't actually studied the subject itself (I studied Sociology and Psychology). I've read a few books surrounding urban planning, e.g. Happy City, Palaces for the People etc, and these have all been great for getting an underlying understanding of the theoretical and psychological reasons behind good cities. However, I am a bit confused about all of the practicalities of the area: how do stakeholders work? Developers? What are their roles in relation to local governments and how a town gets structured? How do you begin change when communities are against policies that tackle car use? \n\nHopefully this makes sense, would appreciate any resources that are related to these areas/any advice.\n\nThank you!",
        "created_utc": 1670419215,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can the bus be faster than the train?",
        "author": "Severe_Composer_9494",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zf08it/can_the_bus_be_faster_than_the_train/",
        "text": "I don't know about high-speed rails because they don't exist in my country. Based on my experience of intracity LRTs and MRTs and intercity commuter trains with regular speeds, the travel time can be very long simply because there are too many stations. \n\nThe express bus solves this by driving you straight to your desired station with little to no stops in between. At the same time, its also a lot more space-efficient than personal cars, not to mention cheaper and better for the environment. \n\n**This makes me wonder, if we only prioritize express busses instead of everything else, how much better can short-to-medium distance travelling get?** Would it be possible for there to be many stations with a to-and-fro bus service at every short interval? This would be a huge improvement from trains because we'd be avoiding all of the stations that we have to otherwise wait through.",
        "created_utc": 1670417010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"urbanism\" as a type of media, scholarly or pop intellectual brand, or personality kind of a North American thing?",
        "author": "wainscotmasquerade",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zetl56/is_urbanism_as_a_type_of_media_scholarly_or_pop/",
        "text": "Like, is there an equivalent to Richard Florida or outside of North America? Pop/public intellectual authors who write primarily about a topic that urbanists care about -- cities, transit, etc. \n\nAre there Citylab/Nextcity type organizations based in Europe, Asia, Africa, even Central/South America?\n\nDoes this kind of content creation about \"urbanism\" exist outside of the North American blogosphere-Twitter-public intellectual space, in other words?\n\nSomething I've been wondering recently and I haven't been able to figure out yet how to answer this question using Google. ",
        "created_utc": 1670392720,
        "upvote_ratio": 1.0
    },
    {
        "title": "how frequent is it possible to get bus services(ie every 15 mins etc) in a city region with a population of 1.8 million density of 1,400/sq mi (540/km2), and in the core city area density of 3,555/km2 (9,210/sq mi)",
        "author": "TGOL123",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zesxhf/how_frequent_is_it_possible_to_get_bus_servicesie/",
        "text": "the city region i'm thinking about is Glasgow city region, Scotland\n\nIn the best case scenario how frequent is it actually possible to get buses in a city region like glasgow",
        "created_utc": 1670390441,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does private development harm the supply and design of housing?",
        "author": "_Fruit_Loops_",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zeo153/how_does_private_development_harm_the_supply_and/",
        "text": "Obviously we need private development for housing; without it, we’d be taking on the housing crisis with one arm tied behind our back. No sense in doing that. \n\nBut, I’ve got the impression that private, profit-driven development often fails to build what is most needed in the amount that it’s needed and at the quality that is needed. Instead, it builds what’s got the best profit margins. Which is better than nothing, but that still seems like a big issue. \n\nDo I have this right, or am I making an issue where there is none? And if it is in fact an issue, how should we fight it? With a lot more public development?",
        "created_utc": 1670375536,
        "upvote_ratio": 1.0
    },
    {
        "title": "I visited Fairfield, California and experienced their bike path infrastructure.",
        "author": "Aqualung1",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zen1nm/i_visited_fairfield_california_and_experienced/",
        "text": "An attempt was made, but the residents aren’t using any of it. I started at the community college, and rode into downtown. I didn’t see one cyclist, not even at the college. \n\nThe only ppl I saw on the bike path were lots of homeless ppl. The residents are married to their cars and trucks. \n\nThe bike path, which is quite long, appeared abandoned, and in need of maintenance. I describe the experience as apocalyptic. \n\nI realise that in “rural” urban communities like this, cars totally dominate.",
        "created_utc": 1670372680,
        "upvote_ratio": 1.0
    },
    {
        "title": "I visited Fairfield, California and experienced their bike path infrastructure.",
        "author": "Aqualung1",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zen1p2/i_visited_fairfield_california_and_experienced/",
        "text": "An attempt was made, but the residents aren’t using any of it. I started at the community college, and rode into downtown. I didn’t see one cyclist, not even at the college. \n\nThe only ppl I saw on the bike path were lots of homeless ppl. The residents are married to their cars and trucks. \n\nThe bike path, which is quite long, appeared abandoned, and in need of maintenance. I describe the experience as apocalyptic. \n\nI realise that in “rural” urban communities like this, cars totally dominate.",
        "created_utc": 1670372680,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Blow Up a Pipeline Doesn’t Give Easy Answers on Radical Climate Activism",
        "author": "Dolphinetly",
        "url": "https://jacobin.com/2022/12/how-to-blow-up-a-pipeline-film-review-climate-activism-working-class",
        "text": "",
        "created_utc": 1670369635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would the study mentioned actually yield significant saving if adopted by more cities?",
        "author": "GuiGeeKang",
        "url": "https://www.vice.com/en/article/xgym5j/heres-how-the-us-can-stop-wasting-billions-of-dollars-on-each-transit-project?utm_source=reddit.com&amp;utm_source=reddit.com",
        "text": "",
        "created_utc": 1670367535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about flood overflow reservoirs",
        "author": "Thuggineternal",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zeh16d/question_about_flood_overflow_reservoirs/",
        "text": "Is there any reason that trees and other types of vegetation couldn't be planted and grow in an area that was designed to be a potential flooding overflow reservoir? \nThe area is the size of 2 city blocks and other than one lone pecan tree right on the edge of the reservoir all other vegetation was removed,  leaving a big, grassy field. \nI've only seen it full of water on one occasion and that was for less than a day. \nI know that there is plenty of space for a small pecan orchard and some community gardens, which I feel are needed in our community.  I'm not really sure where to start with this but I thought this might be a good place...\nAny advice?",
        "created_utc": 1670358310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Car-Sharing for Suburbia? (USA)",
        "author": "zigzagzang",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zefm4w/carsharing_for_suburbia_usa/",
        "text": "Looking into the future of urban transportation it appears likely that cars will continue to play a  significant role as we move forward, especially in the suburbs. Car-sharing services are continuing to pop up in urban areas but I was wondering what a car-sharing service would look like in a car-dependent suburb where most residents own their own cars to begin with? Would such a service be viable or even worth the investment? Would it need to be extension of the primary urban car-sharing network within that city or could it exist as its own service? Figuring out how to retrofit suburbs to reduce VMTs is not an easy task but I'm interested in hearing if anyone had an opinion on the matter or if you have an example in your own city of a viable service.",
        "created_utc": 1670354999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some Midwestern Positivity",
        "author": "UnluckyFinding2079",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zeevm9/some_midwestern_positivity/",
        "text": "Hey guys, I know a lot of what we do in this sub-reddit is complain about what is going wrong (which is fair, a lot is) in American urban planning. But I wanted to post some positive stuff about where I live.\n\nI'm from Lincoln Nebraska. As Midwestern college towns go, it's not altogether remarkable. It has several colleges, a lot of fairly suburb-y neighborhoods, an all right downtown, and a culture somewhere in the middle of a Venn diagram comparing hipsters, tech bros, hicks and suburbanites.\n\nBut the city is quietly doing a lot of things really well. For one thing, it has an expansive bike network. I'm not talking anything Dutch scale, but a mix of \"rails-to-trails,\" protected bike lanes, and other projects connect to make a surprisingly robust bike network:\n\n[https://www.gptn.org/the\\_trails/overview.html](https://www.gptn.org/the_trails/overview.html) (You can see the network here)\n\nSecond, the city's comprehensive plan has a very flexible zoning code, with an openness to infill development that is honestly quite reassuring.\n\n[https://www.lincoln.ne.gov/City/Departments/Planning-Department/Long-Range-Planning/Comprehensive-Plan](https://www.lincoln.ne.gov/City/Departments/Planning-Department/Long-Range-Planning/Comprehensive-Plan) (City's comprehensive plan)\n\nMost of the city's land is zoned for \"Residential: urban density,\" which permits detached homes, missing middle, multiplex homes, and compatible retail. \n\nThe result? Well, most of Lincoln still feels quite suburb-y. And it's certainly a city where you can't really live without a car, but it's getting better.\n\nThe introduction of e-bikes has ushered in a lot of people, elderly retirees, low income, etc., who cannot afford a car, to instead use e-bikes to get around the city. I can't go for a walk on the trail system without seeing it. \n\nIn addition, the city has two: \"new urbanist\" neighborhoods. One in the Northwest, one in the Southeast. Currently they are quite expensive, but I hope that their success will encourage more developers to build in this fashion, putting in row homes and more retail in residential spaces.\n\nThank you for reading. I just wanted to talk about some of the good things going on in this corner of the Midwest.",
        "created_utc": 1670353233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remote Work Is Gutting Downtowns, Will Cost Cities $453 Billion",
        "author": "domestication_never",
        "url": "https://www.businessinsider.com/remote-work-gutted-city-downtowns-office-real-estate-apocalypse-2022-12",
        "text": "",
        "created_utc": 1670349384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Biggest Urban Planner Employers in the Chicago area?",
        "author": "Patient-Device-1135",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zed5b8/biggest_urban_planner_employers_in_the_chicago/",
        "text": "[removed]",
        "created_utc": 1670349149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top Websites for Urban Planning - 2022",
        "author": "Planetizen",
        "url": "https://www.planetizen.com/features/120158-top-websites-urban-planning-2022",
        "text": "",
        "created_utc": 1670343910,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on Irish cities?",
        "author": "ConnieNeko",
        "url": "https://www.reddit.com/r/urbanplanning/comments/ze9z7x/thoughts_on_irish_cities/",
        "text": "I'm irish and am interested to those who know much about the topic of this subreddit think about Cities of Ireland.   \n\n\nin my experience, the Bus service is always late. the Cities and towns are very walkable, Trains are on time but are slow moving (it takes forever to get from dublin to galway via train). compared to the US, ireland seems like a beautiful place to live with it's superior city design.",
        "created_utc": 1670341543,
        "upvote_ratio": 1.0
    },
    {
        "title": "NYC's Mayor Eric Adams' “City of Yes” initiative: “We are going to turn New York into a ‘City of Yes’ — yes in my backyard, yes on my block, yes in my neighborhood,” said Mayor Adams.",
        "author": "Spirited-Pause",
        "url": "https://www.nyc.gov/office-of-the-mayor/news/353-22/mayor-adams-outlines-vision-city-yes-plan-citywide-zoning-initiatives-support#/0",
        "text": "",
        "created_utc": 1670339960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tax refund to promote infill",
        "author": "Developed_hoosier",
        "url": "https://www.reddit.com/r/urbanplanning/comments/ze7ab3/tax_refund_to_promote_infill/",
        "text": "Underutilized neighborhoods in Urban settings tends to be viewed as a problem. Municipal resources are going towards that area while it slowly stagnates from being made up of only older and aging buildings. Any local businesses also rely on enough people living within close proximity so that if an urban neighborhood is allowed to decline, then many of those businesses do too.\n\nEven if you manage to convince the council or planning board to allow for smaller building lots, it's not a guarantee that the citizens in the area will sell their adjacent lots that they view as their yards. The concern is over new neighbors and construction and various other forms of disruption, and that's a fair concern.\n\nSo then, for targeted areas, you could set up a property tax write off/refund. Any property taxes collected on the land sold will get refunded to the seller for up to 100% of their yearly property tax. This would likely need to have a time limit, maybe 15 or 20 years. The purchaser benefits from being able to build in the area, the seller benefits from reduced taxes, and the city benefits because taxes collected will be greater than or equal to whatever was being collected for that land in the first place.\n\nIs this already a thing? Are there any cities which have done this before? It may need to be implemented jointly between a city and county for the U.S.",
        "created_utc": 1670334589,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Hostile Architecture Tour Around London — Part 2",
        "author": "LcuBeatsWorking",
        "url": "https://medium.com/@wolfhf/a-hostile-architecture-tour-around-london-part-2-50452aba1a49",
        "text": "",
        "created_utc": 1670315931,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we build new good stuff when all of the old bad stuff is in the way?",
        "author": "_Fruit_Loops_",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zdurw2/how_do_we_build_new_good_stuff_when_all_of_the/",
        "text": "Sorry if this is a dumb question, but bear with me.\n\nRedesigning a street is one thing because all the cars can move out. But for example, say we get rid of single family-exclusive zoning…what next? The single family houses already stretch to the horizon, and they aren’t going anywhere. It’s not like you could just demolish a suburb and replace it with missing middle. Not easily, anyhow.\n\nSo what else can be done? Well, off the top of my head, you can find *new* space, but not all cities have that space. And that won’t fundamentally replace the bad stuff and all it's consequences either, only add an alternative. Or you can replace what's already built very gradually as it's naturally replaced. Or add to what's already built. But that has it's own confines, and it's all very slow.\n\nwut do",
        "created_utc": 1670299672,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we prevent popular urban areas from becoming solely occupied by chain retailers and large corporations?",
        "author": "higmy6",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zdosfu/how_do_we_prevent_popular_urban_areas_from/",
        "text": "Hello! I'm an undergrad who will be going to graduate school for Urban Planning. Though I've just started my journey into this field I've been trying to apply what I've learned to problems I see in the real urban environment. One of these that I'm very interested in is the process described by Jane Jacobs in her famous book about how a downtrodden urban area can become popular because lower rents will allow unique, local businesses to prosper and experiment more than they could elsewhere. However, once the neighborhood begins to gain popularity rents will typically increase as to match the demand of big chain retailers that want a piece of the newly popular corridor, pushing out the local and experimental businesses that made the area popular in the first place. This can then cause a death spiral as the neighborhood loses popularity due to the chain infestation. This is a process I've seen in cities I've lived in from Pittsburgh to Chicago. \n\nSome ways that I've personally thought about are setting aside some commercial frontage as affordable space for local businesses to ensure they still have a place in the area and increasing commercial space off main corridors in popular areas. The latter is something that I've seen have some success in real cities. Though the main street may become home to mainly chains if the side streets have some mixed-use/commercial space then local businesses can find refuge here as these storefronts aren't as attractive as the main street.\n\nSo my question is: what are some other resources or strategies that cities can employ in order to combat the encroachment of large companies and continue to support the local, more experimental ones?",
        "created_utc": 1670284695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help finding the best bachelor's program for Green Infrastructure Design",
        "author": "beelzebub473",
        "url": "/r/EnvironmentalEngineer/comments/zdo4fw/need_help_finding_the_best_bachelors_program_for/",
        "text": "",
        "created_utc": 1670283571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Planning Content Request",
        "author": "OverTheUnderAndThru",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zdl3xb/planning_content_request/",
        "text": "Hi All,\n\nWould you all mind linking your favorite resources, blogs, advocacy groups, twitter accounts etc. for planning and transit issues in the following cities: \n\n\\- NYC\n\n\\- Boston\n\n\\- Philadelphia\n\n\\- Chicago \n\n\\- SF/Bay Area\n\nI'm a transportation planner working on moving to one of these cities in about a year and I'm hoping to have some resources organized so that I will be able to get a good lay of the land (both ongoing issues and a historical context) of the place before I move. I realize it is difficult to understand these issues from the internet, especially in such large, complex cities, but I figure it would be good to do some groundwork nonetheless since understanding the context of planning actions is so important. I'm hoping to integrate these resources into my existing feeds so I can skim and learn on my morning bus ride ;) \n\nI'm not looking for job boards, just your favorite sources of information as practicing planners or concerned citizens. Bonus points for resources that highlight specific issues, such as disability advocacy or neighborhood-specific takes. \n\nHere are just a couple examples of what I have in mind: [SLC](https://buildingsaltlake.com/), [NYC](https://pedestrianobservations.com/), [Seattle](https://twitter.com/dongho_chang?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor), [SF](https://sf.streetsblog.org/), \n\nFeel free to post as much links as you want, this is a resource I'll come back to in several months! Thank you all, I always appreciate and enjoy reddit recommendations!",
        "created_utc": 1670277164,
        "upvote_ratio": 1.0
    },
    {
        "title": "North American planners - do you find that having a career in urban planning is exhausting with the negative connotation that urban planning has?",
        "author": "TinyMortgage",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zdk8hr/north_american_planners_do_you_find_that_having_a/",
        "text": "I wanted to ask this seeing how urban planning has been gaining attention online through NotJustBikes, StrongTowns, YouTube videos, and even TikToks bringing about a lot of discussions surrounding urban planning topics. \n\nOften times, however, these videos (rightfully) bring about a lotttt of negativity towards North American urban planning talking about stroads, suburbia, highways, parking lots, lack of walkability, bad road design, cities clearly putting profit and cars over people, etc.\n\nNow I'm not trying to say that it's wrong at all that urban planning and all of these topics have recently been gaining traction. I watch these videos. I ask questions. I try to get involved as much as possible. Smart urban planning matters quite a lot of course and these things being brought forth are great.\n\nHowever, I can't help but wonder what it must feel like being associated with the negativity that has been brought about from discussions surrounding North American urban planning. I can't help but wonder if it's toxic, how you think of it, etc. Thus, I hope to get some feedback on this. Thank you! ",
        "created_utc": 1670275454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning at the Job Recomendations",
        "author": "jumbogerman",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zdi5hz/learning_at_the_job_recomendations/",
        "text": "I studied GIS in college and have done it in the work force for a few years now. Fast forward and I have a new job with a good title and it involves planning now. I studied geology in college and have little to no background in planning. Can anyone suggest textbooks for me to read, online coursework that is free, or the most efficient and cheap way for me to learn skills to further my career in Planning? I work at the State level with a Planning and gis Specialist title for reference.\n\nI need to learn planning skills like how to write at local state and federal law standard operating procedures. Sure, I can and have learned a lot at my job already but I want a recommendation for something more formal like a textbook.",
        "created_utc": 1670271259,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do suburb cities stay afloat financially?",
        "author": "Hendrix_Lamar",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zdeakq/how_do_suburb_cities_stay_afloat_financially/",
        "text": "I've seen a lot of discussion and I think it's well established that sprawling suburbs are not financially viable and are a net negative on city funds. My question is about cities that are entirely made of suburbs. Some cities like Detroit, Saint Louis, Salt Lake City, have very small city limits that only contain the city center. They are then surrounded by many very small cities that are effectively just suburban neighborhoods acting as cities. How do these \"suburb cities\" stay afloat financially without a downtown or city center to offset the drains of their sprawling suburban neighborhoods? How come we haven't seen many of them go bankrupt or get annexed into the larger city?",
        "created_utc": 1670263416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Planning plus Environmental Science?",
        "author": "TheRealDirtyD4n",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zde8ib/planning_plus_environmental_science/",
        "text": "I’m currently getting my BS in ENVS, I really enjoy all the aspects of this major but I feel like I need to narrow my area of expertise. I have always had an interest in urban design/planning and it feels somewhat natural for me to go into this field. \n\nMy current tuition remission won’t cover the cost and extra semesters for me to complete a double major and I don’t think I will have the time to complete a minor (not that I believe it will be worth much). \n\nSo, Im wondering what others experience is with this topic.\n\nGiven most of my education will be in science/math, would it be too much of a switch to go for a masters in urban planning? \n\nDo you have experience with these two disciplines? \n\nDo these two disciplines complement them selves when I start applying for work? \n\nAny input is appreciated!",
        "created_utc": 1670263305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Indian Slum redesigned with Community Input",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zde1gp/indian_slum_redesigned_with_community_input/",
        "text": "A partnership between the community design authority, non profits and the community itself helped transform a slum into a much nicer place to live. The buildings a three story low rise apartments. They are designed with traditional Indian Architecture and courtyards with open spaces.\n\n[https://www.fastcompany.com/90739672/how-residents-of-a-slum-in-india-redesigned-their-neighborhood](https://www.fastcompany.com/90739672/how-residents-of-a-slum-in-india-redesigned-their-neighborhood)",
        "created_utc": 1670262936,
        "upvote_ratio": 1.0
    },
    {
        "title": "How a ‘Golden Era for Large Cities’ Might Be Turning Into an ‘Urban Doom Loop’ - Thoughts?",
        "author": "StovetopGiraffe",
        "url": "https://www.nytimes.com/2022/11/30/opinion/covid-pandemic-cities-future.html",
        "text": "",
        "created_utc": 1670253119,
        "upvote_ratio": 1.0
    },
    {
        "title": "What City's Urban Design is Most Appealing?",
        "author": "Initiual",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zd8ns1/what_citys_urban_design_is_most_appealing/",
        "text": "Which city plan do you like the most?  My favourite is Amsterdam, NL.",
        "created_utc": 1670251509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are towns and villages in Latin America (Mexico, Argentina, Brazil, Chile etc.) car centric with grid streets plan like in USA/Canada, or more like in Europe?",
        "author": "HotSprinkles1266",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zd4pz5/are_towns_and_villages_in_latin_america_mexico/",
        "text": "I was always wondering that... I know that some historic parts of towns are obviously similar to European towns. But when I look it on Google Maps, commercial and residental parts of towns in Mexico (regarding urban planning) look more like US towns than Spanish towns. Also, is transport between smaller towns generally better in Mexico than USA (given that smaller amount of people have cars)?",
        "created_utc": 1670240882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Post graduation certifications.",
        "author": "Aware-Promotion-6551",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zcvb4q/post_graduation_certifications/",
        "text": "Good evening everyone, I’m currently finishing up my bachelors degree in environmental science with a concentration in regional and community environmental planning. I’ve come to really enjoy the “big picture” planning aspect of my curriculum and would like to make it a career. What certifications, trainings, or insight would be beneficial to help get me there? \n\nThanks in advance!",
        "created_utc": 1670210184,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much of America’s urban design issues are due to lack of funds as opposed to restrictive laws or political opposition? (and vice versa)",
        "author": "_Fruit_Loops_",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zcueft/how_much_of_americas_urban_design_issues_are_due/",
        "text": "I suspect it's somewhat of a mix of both factors.\n\nI ask because I worry that removing restrictions wouldn’t actually change much if the budget is too tight to fund new stuff (there's other things which could delay change too, but let's put that aside for now). \n\nIn reverse, I worry also that an increase in the city budget wouldn’t change much if there are so many legal/political roadblocks in the way.\n\nThoughts? Do both issues need to be tackled to really drive change?\n\n(I’m speaking about things which the city itself spends money on, not private organizations)",
        "created_utc": 1670207960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I able to study Masters Urban Planning with a bachelor in Landscape Architecture?",
        "author": "J-Fuji",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zct6xj/am_i_able_to_study_masters_urban_planning_with_a/",
        "text": "I’m currently a freshman wondering if landscape architecture will still leave open a window for urban planning should I really decide it’s the direction I want to go. Any comments at all would be greatly appreciated :)",
        "created_utc": 1670205057,
        "upvote_ratio": 1.0
    },
    {
        "title": "Construction Has Started On The Line City",
        "author": "Millionized",
        "url": "https://youtu.be/Cv2rmqFLUdo",
        "text": "",
        "created_utc": 1670199047,
        "upvote_ratio": 1.0
    },
    {
        "title": "mixed commercial residential vs only commercial",
        "author": "homo_alosapien",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zcmobl/mixed_commercial_residential_vs_only_commercial/",
        "text": "I'm not an expert, I just like learning. I am a California resident and I'm in favor of the ban on single family residential zoning. The way I see it, it should help longterm alleviate housing supply shortages (I'll be pleasantly surprised if there is an informed stance against the policy though).\n\nThat said, what would be the drawback of going further? would it be totally crazy to rezone all commercial zoning as mixed residential/commercial? I could naively argue that beyond still alleviating the housing shortage, this policy would help small businesses, make for more walkable areas, and residents would be less car dependent. Granted, this feels like an extreme policy so I'd think there would be drawbacks for at least some communities. What would these drawbacks be?\n\n&amp;#x200B;\n\nSincerely, an Idiot that likes to learn",
        "created_utc": 1670190124,
        "upvote_ratio": 1.0
    },
    {
        "title": "1950s NAHB (National Association of Homebuilders) Documentary About Urban Sprawl",
        "author": "theoneandonlythomas",
        "url": "https://youtu.be/yyRJc5mfDGs",
        "text": "",
        "created_utc": 1670185471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urbanists and Yimbys Want to Force People to Live at Higher Densities",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zci9kc/urbanists_and_yimbys_want_to_force_people_to_live/",
        "text": "I would preface by saying this criticism applies only to Yimbys and urbanists who favor growth management policies such as greenbelts, urban growth boundaries, rural and estate zoning, conservation easements open space and agricultural zoning. As for myself I favor abolishing both anti-sprawl policies and zoning and subdivision ordinances.\n\nOne trope often brought up in discussions about land use is that yimbys and urbanists simply want to \"allow\" or \"legalize\" higher densities, but this is highly misleading. IF governments have made it impossible or nearly impossible to build greenfield development, then \"allowing\" more density is not meaningfully different than requiring it. If greenfield development isn't allowed, then dense infill is basically the developer's only choice. While there are no literal proposals to ban single family homes, many places have laws that heavily restrict greenfield development. While you may not be literally banning single family homes, you are basically making them unaffordable for all but rich people. If restrictions on density are removed while restrictions on greenfield development aren't then eventually most housing will be dense housing because of simple economics. If you support upzoning while also supporting growth management then you are basically banning single family homes for all but the richest of people. \"Legalizing\" duplexes or missing middle is unlikely to change development patterns that much, but if you allowed much higher densities and still retained growth management eventually single family homes wouldn't exist for the majority of people. Realistically yimbys probably won't get their way and places will remain both low density and unaffordable due to growth management.\n\nLet's not kid ourselves, urbanists and yimbys aren't in favor of more choice or more property rights, rather they are in favor taking away the choice to live at lower densities and using growth management to accomplish this. Urbanists and yimbys want to use state power to take away a lifestyle that many Americans prefer. If you truly believe in choice or believe in property rights then the right to buy and develop land on the outskirts or town should be just as much protected as the right to build taller and large buildings in existing areas.",
        "created_utc": 1670180499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Studies on bike lane effects on throughput?",
        "author": "MrBleak",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zcccqt/studies_on_bike_lane_effects_on_throughput/",
        "text": "I work for a medium size city in the Planning Department and there has been a significant shift to road dieting with either dedicated bike lanes or turn-outs for buses.\n\nThis has been fairly unpopular in general because several main arterials have been reduced to single-lane traffic. Personally, I've seen very few people take advantage of the bike lanes especially in winter. Are there any studies about the overall effect on traffic throughput with these sorts of road diets?\n\nI ask because, as a growing city, I feel like we're shooting ourselves in the foot by reducing traffic lanes while our population rapidly increases. I work mostly in environmental review and one of the biggest \"action items\" is reviewing estimated emissions caused by additional traffic. It seems to me that the environmental benefit of increased bicycle traffic is massively dwarfed by increased automobile travel times via congestion.",
        "created_utc": 1670167215,
        "upvote_ratio": 1.0
    },
    {
        "title": "What countries have the best planned cities, or just good urban planning in general?",
        "author": "newmanstartover",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zcc6zt/what_countries_have_the_best_planned_cities_or/",
        "text": "I often hear that Spanish (Barcelona, Madrid, Bilbao, Vitoria-Gasteiz, San Sebastián), Dutch (Amsterdam, Eindhoven, Dutch cities in General), Swiss (Practically all of the ones that can be considered cities, and the smaller towns and villages too), and Japanese (Tokyo, the worlds biggest city is also one of the best planned one, Osaka and Fukuoka among many others) are incredibly well designed. Are there other countries that fit the bill? I've read that Washington D.C., Montreal, Saint-Étienne, Vienna, Canberra, Curitiba, and Tel Aviv are well designed cities as well, for one reason or another, but these cities do not seem to reflect on their countries overall urban design philosophy. Is Spain, The Netherlands, Switzerland and Japan just on a league of their own when it comes to Urban planning? What other countries could be included?",
        "created_utc": 1670166842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinion on suicide lanes?",
        "author": "yusefudattebayo",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zc6fe5/opinion_on_suicide_lanes/",
        "text": "What’s your general opinion of them?Are they necessary on low to medium capacity roads? When possible, I would like to take that space and make a protected bike lane whenever possible.",
        "created_utc": 1670150062,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you think could poor global south countries improve their built environment?",
        "author": "PhraseDifferent5979",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zc51me/how_do_you_think_could_poor_global_south/",
        "text": "Is there hope for our severely decrepit metropoles?",
        "created_utc": 1670144902,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I increase my chances at a Master's program in Planning?",
        "author": "InternationalLine127",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zbz3jw/how_do_i_increase_my_chances_at_a_masters_program/",
        "text": "Another annoying student post coming your way! I am a college graduate interested in urban planning, in particular, I'd love to work in development/the private sector as a planner. My undergraduate degree is in Public Policy and unfortunately, in my last few years, I was struggling with (undiagnosed) mental health issues and didn't make cutoffs for grad programs. I've considered upgrading credits and in the meanwhile trying to figure out how I can get into a Master's program with that plus my experience. Where I live, you need planning education to work a planning role, and similar GIS or development roles, but **is there any other way you all recommend I take on this task? What are some ways I can get involved with planning without working in planning? What \"looks good\" to graduate programs?** I'm in North America :)",
        "created_utc": 1670124184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moon Base urban design",
        "author": "MyFriendKomradeKoala",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zbxjez/moon_base_urban_design/",
        "text": "Assuming that we don’t blow ourselves up, I am assuming that in 2102 there will a significant, year round human presence on the moon with thousands of people. \n\nThe urban design is going to be forced to be extremely well organized or it will never succeed. The moon is extremely energy and resource poor. Every calorie and watt is hard won and conserved. There wont be any space zillionaires moon buggying their way to work down IP-5 any time soon. \n\nIt will be much more similar to ancient settlements. Everything will be hyperwalkable and condensed. Maximum mixed use development with the minumum shortest distance between places. I see ancient work patterns happening too, every single person is going to have to be very productive to earn their keep, kids will be virtually nonexistant. The moon is always going to be very expensive and very exclusionary. \n\nNew cultures will emerge and the few available resources will be hoarded by the uber wealthy. \n\nAre there any books about this?",
        "created_utc": 1670119659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research paper tying labor economics to food security?",
        "author": "same2me",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zbq678/research_paper_tying_labor_economics_to_food/",
        "text": "- I am in undergrad, currently enrolled in a Urban Policy course and Labor Econ course. \n\n- Primary scope of the Urban Policy course has been local (urban) food insecurity \n\n- I want to use food insecurity research from my Urban Policy course and relate it to labor econ/economic principles for a free-form paper in the Labor Econ course \n\n- I am having trouble brainstorming specific ways to relate food insecurity in my city (or in any urban setting) to labor. Obviously income/poverty is a major determinant of food insecurity. \n\n- For example, evaluating voluntary unemployment to receive federal aid (SNAP).\n\n- Can be free-form idea, local; National; state. \n\n- I am in Eastern Tennessee \n\nAny suggestions or additional subreddits to help generate ideas would be appreciated.",
        "created_utc": 1670100288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't these streets have a curb?",
        "author": "ConversationWeird614",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zbpkhu/why_dont_these_streets_have_a_curb/",
        "text": "Greetings, I have a curiosity that I want to satisfy, why don't the streets in the US have a curb? \n\nI'm new here, back in my country (Dominican Republic) the streets have a curb with a small ditch that drives the water (Rain or flood water) towards the drain system, I just noticed that it was raining, not even a lot, and streets are a little flooded, then noticed there is no ditch to drive the water... Why? Cost reduction? Or is there another reason?",
        "created_utc": 1670098780,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m going on a study abroad to Germany. What’s the best sample of maybe 5 cities to visit across Europe on a weekend to investigate pedestrian infrastructure?",
        "author": "EmpheralCommission",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zbn1np/im_going_on_a_study_abroad_to_germany_whats_the/",
        "text": "I’m going to be in Bahn if that’s relevant.",
        "created_utc": 1670092444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Planned Cities in the U.S.",
        "author": "MrsBeansAppleSnaps",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zbmwi2/question_about_planned_cities_in_the_us/",
        "text": "Did NY, Washington D.C., Savannah, etc. use eminent domain in order to lay out their streets in such an orderly manner? Surely the land was already partially built up by the time they decided on a city plan, so I imagine there was a considerable amount of leveling that needed to occur. \n\nSecondary question: if a municipality today wanted to implement a grid for future growth how would they go about that? Since land in the U.S. is largely privately owned, particularly developable land, it seems hard to enforce. But surely there must be some mechanism to do that right? I saw Bastrop, TX for example adopted a grid some years back ([https://www.cnu.org/publicsquare/2019/11/15/texas-city-adopts-street-grid-and-code](https://www.cnu.org/publicsquare/2019/11/15/texas-city-adopts-street-grid-and-code)), but can they do that because they own the land or how does it work exactly?",
        "created_utc": 1670092078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disabled/ people with lack of mobility in Historical Centres",
        "author": "Nunohon",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zbjsyw/disabled_people_with_lack_of_mobility_in/",
        "text": "Hey friends, hope everyone is doing alright!\n\nIm doing my master thesis in mobility of people with lack of mobility in their mobility through historical centres.\n\nCan someone help me with Authors that talk about this problem and recommend me worldwide cities to study that are pogressive in this thematic! Really need those kind of examples to formulate my ideas on  solutions not compromising the Heritage and providing safety and comodity to disabled people.\n\nThank you so much!",
        "created_utc": 1670083945,
        "upvote_ratio": 1.0
    },
    {
        "title": "State, local governments increasingly turn to zoning reforms | State and local governments are rethinking land use policy to cut emissions and improve social outcomes",
        "author": "Hrmbee",
        "url": "https://yaleclimateconnections.org/2022/11/state-local-governments-increasingly-turn-to-zoning-reforms/",
        "text": "",
        "created_utc": 1670047721,
        "upvote_ratio": 1.0
    },
    {
        "title": "How the Japanese Use Sprinklers for Snow Removal",
        "author": "MileJonesJr",
        "url": "https://youtu.be/2CyKgFUm6W4",
        "text": "",
        "created_utc": 1670024670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gift ideas for a young teenager",
        "author": "ding_dong_yo",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zaxy8u/gift_ideas_for_a_young_teenager/",
        "text": "Hello!  \n\n\nDoes anyone have any good gift ideas for a young teenager who has a growing interest in urban planning and design? My niece is turning 15 and is showing a lot of interest in this area and wants to explore it more.\n\n&amp;#x200B;\n\nThanks.",
        "created_utc": 1670015835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those who got an urban planning masters but ended up not becoming an urban planner. What do you do? Are you still doing planning work?",
        "author": "pmholes",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zauac4/those_who_got_an_urban_planning_masters_but_ended/",
        "text": "I’m wondering if there might be other avenues I could take with a planning degree. I think I’d be happy with being a planner but the degree is so broad I feel like there could be other opportunities as well. Let me know!",
        "created_utc": 1670007496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Governor Hochul is promising to unveil a “bold and audacious” housing agenda next month, claiming that New Jersey and Connecticut are outpacing Long Island, Westchester and other New York suburbs in housing production.",
        "author": "Spirited-Pause",
        "url": "/r/longisland/comments/zaopo2/governor_hochul_is_promising_to_unveil_a_bold_and/",
        "text": "",
        "created_utc": 1670005807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban Heat Islands - An Overview",
        "author": "maxmlyn",
        "url": "https://www.reddit.com/r/urbanplanning/comments/zatds5/urban_heat_islands_an_overview/",
        "text": "Here's a quick primer on Urban Heat Islands and their effects, as well as how Vancouver used urban planning to combat the issue\n\n[https://docs.google.com/presentation/d/1YEsluTQL-mP4N4S4jZq5RNTlsB7y-Qw8aQ78M7swe8U/edit?usp=sharing](https://docs.google.com/presentation/d/1YEsluTQL-mP4N4S4jZq5RNTlsB7y-Qw8aQ78M7swe8U/edit?usp=sharing)\n\n&amp;#x200B;",
        "created_utc": 1670005409,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Cincinnati ordinance requires new road projects and repavements to include bike lanes, traffic calming, sidewalks, and more — or explain why they were left out",
        "author": "pointless_NPC",
        "url": "https://www.wcpo.com/news/government/local-politics/cincinnati-city-council-passes-complete-streets-ordinance",
        "text": "",
        "created_utc": 1669999275,
        "upvote_ratio": 1.0
    },
    {
        "title": "City Nerd calls DuSable LSD the worst waterfront highway in North America",
        "author": "RamboNation",
        "url": "https://chi.streetsblog.org/2022/11/30/city-nerd-calls-dusable-lsd-the-worst-waterfront-highway-in-north-america/",
        "text": "",
        "created_utc": 1669948066,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Would You Do With a 500,000 ft^2 Building on the Shores of the Great Lakes?",
        "author": "Eudaimonics",
        "url": "https://www.buffalorising.com/2022/12/out-to-bid-terminal-a-reuse/",
        "text": "",
        "created_utc": 1669934955,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Florida Got So Weird",
        "author": "SuccessfulOperation",
        "url": "https://www.youtube.com/watch?v=AIqxfBhlwx0",
        "text": "",
        "created_utc": 1669930922,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the Urban Planning think tanks of your country/city?",
        "author": "BorisIsGoneSon1",
        "url": "https://www.reddit.com/r/urbanplanning/comments/za0jes/what_are_the_urban_planning_think_tanks_of_your/",
        "text": "[removed]",
        "created_utc": 1669930381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why America's Airports Are Terribly Designed",
        "author": "SuccessfulOperation",
        "url": "https://www.youtube.com/watch?v=TnzC7DdxIIk",
        "text": "",
        "created_utc": 1669929034,
        "upvote_ratio": 1.0
    }
]