[
    {
        "title": "Housing Breaks People’s Brains",
        "author": "SuccessfulOperation",
        "url": "https://www.theatlantic.com/ideas/archive/2022/11/us-housing-supply-shortage-crisis-2022/672240/",
        "text": "",
        "created_utc": 1669238516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Office Conversions More Popular Than Ever",
        "author": "RogueDisciple",
        "url": "https://www.planetizen.com/news/2022/11/119836-office-conversions-more-popular-ever",
        "text": "",
        "created_utc": 1669235345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confused About New Gas Stations",
        "author": "bettaboy123",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z2yq8m/confused_about_new_gas_stations/",
        "text": "I’ve been seeing some new gas stations being built in my community, and I have to wonder what the rationale is for planners approving them. I know the giant tanks below them leak and gas stations continue to be less and less profitable. I know it isn’t the job of planners to evaluate businesses for viability, but I know as the EV market continues to grow, we will need less gas stations, and some of them will fail in the coming decade or two. I know my city has gotten stuck with the site remediation costs for other businesses that went under, leaving a lot of destruction on the site, so I’m nervous to see new fueling stations that I know won’t be viable in the future and I’m nervous about the cost to my community for making these sites developable again. Is there anything I can do to help stop new ones from being built so that there’s less sites to clean up in the future? Is there anything planners can do to help stop the construction of more of these or any way they can add a funding mechanism to help reduce the costs for the community as a whole?",
        "created_utc": 1669233197,
        "upvote_ratio": 1.0
    },
    {
        "title": "If You Want More Urban Infill and Less Greenfield, then Infill Needs to Be a Lot less Regulated",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z2n0p2/if_you_want_more_urban_infill_and_less_greenfield/",
        "text": "One of the biggest disadvantages infill has, at least in older cities is regulatory. By far it is easier to get a Greenfield project approved then it is to get an infill project approved. In states like California where Greenfield has been shutdown, getting either approved is basically impossible.\n\nIn suburbs or Greenfields as long as your project complies with the relevant zoning and general plan it will most likely be approved in a timely manner, for urban Infill even a compliant project might not be approved. In general big cities often take years to approve projects, this time adds substantial cost and you may run out of money as a developer before even getting approval. You also have high impact fees imposed developers and affordability requirements. There is also the disadvantage of Historic preservation ordinances which limit developable land. Height and floor area limits restrict how efficiently you can use high priced land; the main method of offsetting higher urban land prices is by adding floors. In Sunbelt cities like Houston, Dallas or Atlanta, despite their sprawl, it is far easier to create infill there.\n\nThe regulatory problems with cities here:\n\nhttps://hbr.org/1995/05/the-competitive-advantage-of-the-inner-city",
        "created_utc": 1669203933,
        "upvote_ratio": 1.0
    },
    {
        "title": "[REPOST] Bus shelter design survey",
        "author": "Big-Attention-2935",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z2iw7j/repost_bus_shelter_design_survey/",
        "text": "Hello everybody. I'm working on my final degree project, for a bus shelter design ,and i need some help with this survey . It takes only 30 sec. \n\nThank you.\n\n [https://www.survio.com/survey/d/R4E1S8H7B1R0Y1Z5M](https://www.survio.com/survey/d/R4E1S8H7B1R0Y1Z5M)",
        "created_utc": 1669189281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Value of a degree/certificate that's in progress?",
        "author": "patriot1994",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z2e7y1/value_of_a_degreecertificate_thats_in_progress/",
        "text": "I've been a software developer for 6 years and I got tired of it a long time ago. I've always liked learning about transportation projects and plans and I want to become a transportation planner instead. \n\nMy undergrad degree is in computer science. I'm working on an Urban Planning masters degree right now and I'll be done with 19 credits (out of 48 required) at the end of this semester. My expected graduation is Spring 2024. At the end of Spring 2023 I'll have a graduate certificate in Transportation Planning and I've already completed the two of the transportation specific classes. \n\nOriginally I was gonna wait until I graduate to switch jobs, but I really don't think I can handle being a software developer anymore. I want to try to apply for a transportation planning job after this semester, but I'm concerned I won't be qualified enough with both the degree and certificate still in progress. I'm in the D.C area btw. Do you think this will be enough to help me find a transportation planning job?",
        "created_utc": 1669174571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a smart idea to pick up civil engineering with a degree in urban planning?",
        "author": "Nathanssss",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z2dnx7/is_it_a_smart_idea_to_pick_up_civil_engineering/",
        "text": "Hi guys, i’m looking at potentially picking up a degree in civil engineering after I complete my bachelors of planning (Australia). \n\nI want to know if it’s worth doing CE (four years studying) with a planning degree in terms of future salary and career prospects? Is there a major or minimal difference? What’s putting me off is the difficulty of the CE subjects and more time spent studying/doing uni…the idea of becoming an planner-engineer, the salary and the wider variety of career opportunities pulls me in tho.\n\nIs there anyone who has done both that can provide an insight?",
        "created_utc": 1669172960,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I justify higher pay? (New England)",
        "author": "costoflivingcrisis10",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z2d4i8/how_can_i_justify_higher_pay_new_england/",
        "text": "[removed]",
        "created_utc": 1669171424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are cities not taking advantage of the housing crisis.",
        "author": "SkateFastEatAsssssss",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z2aqqb/why_are_cities_not_taking_advantage_of_the/",
        "text": "Hey everyone it’s my first post here so sorry if I come off as ignorant. I’m a very big fan of dense, mixed used, urban, transit oriented development, like many of you all. \n\nA question I’ve been thinking of is with the current state of affairs with the housing market exploding and demand being at an all time high, why are cities not making use of what I’m seeing as an effective blank check for development, and rushing to capitalize on this demand as fast as possible.\n\nAny city that wanted to become a world class city could essentially do that right now, with an almost guaranteed return on their investment. Through massive amounts of new development, of which the demand would instantly eat up all units made, any city would gain a sustainable new tax base that could fund many insane expansions for their public transportation systems, and other quality of life improvements. While also making cities more affordable.\n\nWhile cities are developing, the rate at which they are given the current climate is confusing. I would remove pretty much all barriers to building mixed use developments as quickly as possible and capitalize on that demand before the market would return to normal.\n\nThe question is, why aren’t cities doing this?",
        "created_utc": 1669164847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career/Education Advice",
        "author": "Dense_Survey",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z2apuu/careereducation_advice/",
        "text": "Hello everyone. Got a question which I hope you guys can help me with.\n\nI currently work as a project manager/community development technician doing rehabs for low-income houses for a municipality after graduating last may with a bachelors in planning. I also am getting my masters in planning part time from a pretty reputable program but I would like to transition to full time to get it done faster.\n\nI’m really interested in affordable housing development preferably working as a project manager. I see a lot of jobs that look for planning degrees but I look through posts on here and many say other degrees may work better. So with that said should I stick it out with my masters degree? Or should I look towards an MBA or something along those lines? Thanks for any advice.",
        "created_utc": 1669164780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is building a parking lot visualization tool a good idea?",
        "author": "DamReddi",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z2agvz/is_building_a_parking_lot_visualization_tool_a/",
        "text": "Hello, I am not an urban planner. I'm a developer by trade, but right now I'm having trouble with the lack of parking at my mom's small business. We would like to get the parking lot repaved, but before we do, I suggested that we generate multiple visualizations of what the lot could look like.   \n\n\nWith my background in tech, I thought there would be a simple, one-click, customizable parking lot visualizing generator on the market. To my surprise, I couldn't find such a solution. Which made me think: how are stakeholders planning their parking lots and holding their pavers accountable? **Should I develop a tool that empowers stakeholders by exposing them to all of the different ways their parking lot could look, rather than relying solely on their paver?**   \n\n\nI'd love to hear the community's thoughts; thank you!",
        "created_utc": 1669164101,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can the competitive bidding process be improved?",
        "author": "ModernSociety",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z29qos/how_can_the_competitive_bidding_process_be/",
        "text": "Hi r/urbanplanning,\n\nI'm the founder of [Transform Your City](https://transformyour.city/), a new platform that uses AI to generate attractive images of street transformations and rally support around them. \n\nWe're thinking about ways we can improve upon the competitive bidding process, if we were to redesign it from the ground up. How might you improve it? What frustrates you about the way it currently works?\n\nWould greatly appreciate any insight! And feel free to reach out if you're interested in learning more + getting involved.",
        "created_utc": 1669162175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Car downsizing as a supplement to walkability and public transit?",
        "author": "_Fruit_Loops_",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z29lcn/car_downsizing_as_a_supplement_to_walkability_and/",
        "text": "For instance, [large pickup trucks ](https://www.motortrend.com/uploads/2021/10/2022-GMC-Sierra-1500-Denali-front-7.jpg)would only be allowed if you’re part of the 1% that actually needs something that large for hauling. But not for the people who just get off on how big they are. If you need a pickup as a simple utility vehicle, you get a [medium](https://cdn1.mecum.com/auctions/ha0416/ha0416-241383/images/ha0416-241383_1@2x.jpg?1456852016000) or [small](https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Subaru_Sambar_Truck_TC_AWD_%28Stylish_Pack%29_S510J_0505.JPG/1200px-Subaru_Sambar_Truck_TC_AWD_%28Stylish_Pack%29_S510J_0505.JPG) truck. Instead of [a huge SUV](https://pictures.dealer.com/a/autonationdrive/0125/84bb2e6f6d300a4ed7a8a136d7bb6377x.jpg?impolicy=downsize&amp;w=568), you get a [compact](https://cdn.jdpower.com/JDPA_2020%20Chevrolet%20Sonic%20Hatchback%20Small%20Car.jpg) or [subcompact](https://hips.hearstapps.com/hmg-prod/images/2023-mini-cooper-s-convertible-resolute-special-edition-101-1644270635.jpg?crop=1.00xw:0.501xh;0,0.213xh&amp;resize=640:*). For a one or two-person vehicle, you get [a microcar](https://www.readersdigest.ca/wp-content/uploads/2016/05/smart_car_myths_0.jpg).\n\nThis could then be combined with systems of car-sharing and car-pooling, as well as methods to decrease the size of taxi / uber vehicles, and methods to prevent the buying of new cars without fully using up your current one. Maybe even some electric car initiatives too (but IIRC, the batteries in those electric cars pose problems of their own, so probably not at this stage).\n\nOne big issue is that these cars would still pose many problems relative to public transit, walking, cycling, etc. But, I think that it could still be a good way of watering down the last bits of car-excess, *if* implemented alongside public transit and such. Admittedly, if such a plan was implemented alone and without public transit expansion, then that would be insufficient. And of course, there’s also the practical concern of whether or not this is even possible to implement in the first place.\n\nWhat do you guys think?",
        "created_utc": 1669161793,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good right-leaning groups out there supporting urbanism?",
        "author": "marty_mcclarkey_1791",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z27qsh/what_are_some_good_rightleaning_groups_out_there/",
        "text": "I’m a conservative-ish guy who’s grown increasingly interested in the urban planning community and the proposals.\n\nI can sympathize strongly with the libertarian arguments for relaxing zoning regulations to provide more high-density housing, as well as the moral appeal to combating climate change and making home ownership more affordable for younger generations.\n\nThat said, I can’t help but feel like the urban planning movement has a very large, visible left-leaning presence. I’m not saying that’s in itself a bad thing, there are legitimate reasons left-wingers have taken up the call for urbanism. That said, nothing is going to change in the parts of the country that need public transport, more housing, less parking lots, etc unless we can contextualize urbanism in ways conservatives can understand and accept, at least in my opinion.\n\nStill, I’m happy to hear out people in the comments section and keep an open mind.",
        "created_utc": 1669157309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spanish language aid for Local Gov Planner (small town) ISO",
        "author": "hannieboo1",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z23uzw/spanish_language_aid_for_local_gov_planner_small/",
        "text": "I am a planner in a small southern US town. We have walk-ins for zoning permits from many Latine people. I am an advanced Spanish speaker (&amp; read/write) but have lost my fluency over the years. Does anyone have a resource recommendation where I can learn zoning and development- specific Spanish vocabulary? \nFor example- it’s hard to translate words that are concept specific, like zoning district, lot lines, setbacks, floodplain, or land surveyor? \nI can piece together contextual translations from sites like Word Reference, but am hoping something Spanish &amp; planning-related exists.",
        "created_utc": 1669148482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on if Neom (Saudi megaproject) can be sustainable / if it will be complete? I found a lot of wording for the Neom project on their website pretty vague, so it was difficult to get an estimate of what infrastructure will be put in place.",
        "author": "Green-Future_",
        "url": "https://www.youtube.com/watch?v=bsLGC5cdtqg",
        "text": "",
        "created_utc": 1669145852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do freeways create sprawl?",
        "author": "GestapoTakeMeAway",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z1zb1m/why_do_freeways_create_sprawl/",
        "text": "There are some studies which suggest that freeway expansion leads to sprawl.\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S0264837721005792\n\nOne of the points which opponents of freeway expansion bring up is that one of the ways in which the expansion induces demand and increases vehicle miles traveled is by creating new low dense communities. \n\nWhat I’m wondering is why it leads to this. What incentivizes a developer to build this way after a freeway expansion?",
        "created_utc": 1669137842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Certified Floodplain Manager (CFM) test?",
        "author": "the_napsterr",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z1xgzj/certified_floodplain_manager_cfm_test/",
        "text": "Has anyone taken this test recently. My employer is wanting me to take the test and I have gotten mixed info on what to study and that the exam material has recently changed?\n\nI have reviewed most of the 480 and done some courses. Just trying to gauge how much more I would need to review.\n\nThanks in advance!",
        "created_utc": 1669133403,
        "upvote_ratio": 1.0
    },
    {
        "title": "The U.S. Needs More Housing Than Almost Anyone Can Imagine",
        "author": "GloomyDiscussions",
        "url": "https://www.theatlantic.com/ideas/archive/2022/11/us-housing-gap-cost-affordability-big-cities/672184/",
        "text": "",
        "created_utc": 1669124631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Undergraduate Programs",
        "author": "liamplantt",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z1olgs/undergraduate_programs/",
        "text": "For context, I am a high school senior in Southern California looking into becoming a planner (Or at least have the option to pursue it at my school of choice. I am 17 lol.).\n\nMy issue is that school options are a bit confusing. Most planning programs seem to be at the Masters level, some are accredited, and they go by so many different names. Are these things important/significant in choosing a school/program? What are my options after undergrad? There also seems to be quite a bit of overlap between planning, urban studies, architecture, environmental studies, sociology, and geography—can any of these degrees lead up to a career in urban planning? Does it just depend? Is it more about the courses? What do I actually need to be successful in this field?\n\nI’m also wondering about the importance of location. Is it preferable to live/study in a place with good planning to learn from (sort of functioning like a “laboratory”) and with internship options outside of the school? I’m not sure where I want to work afterwards.\n\nStudying urban planning seems to be very niche and uncommon for some reason, not many people have been able to help me out with this. Any input or advice is helpful.\n\nSchool suggestions are also much appreciated, some schools I am looking at are UC Davis, San Francisco State, University of Washington, MIT, and Cal Poly Pomona. I would love to have courses especially focus on equity/accessibility, human-scale design, and transportation.\n\nThank you!",
        "created_utc": 1669106565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transit-Oriented Development - Making Indian Cities Liveable Again - Newsblare",
        "author": "newsblare",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z1nb7w/transitoriented_development_making_indian_cities/",
        "text": "India’s population is expected to exceed 550 million people by the end of 2030, and the burden on urban space in the country’s bigger cities will be mind-boggling. One of the biggest concerns urban planners and real estate developers face today is ensuring that people can still travel by public and private transport. See report;\n\n**Link:** [https://newsblare.com/opinion/economic-finance/transit-oriented-development-making-indian-cities-liveable-again/](https://newsblare.com/opinion/economic-finance/transit-oriented-development-making-indian-cities-liveable-again/)",
        "created_utc": 1669101586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you make 6 figures with a masters in urban planning?",
        "author": "ms13reasonswhy",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z1n3o0/can_you_make_6_figures_with_a_masters_in_urban/",
        "text": "Let's say ~150k in an expensive city like New York or San Francisco. Which areas or specialities should I get into?",
        "created_utc": 1669100827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those who got a masters in planning, how much did it cost? Did any of your employers pay for it?",
        "author": "PradleyBitts",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z1jc1u/those_who_got_a_masters_in_planning_how_much_did/",
        "text": "Are there certain companies that pay for them?",
        "created_utc": 1669088330,
        "upvote_ratio": 1.0
    },
    {
        "title": "PhD programs that don’t require masters",
        "author": "8rrrrh",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z1j5qd/phd_programs_that_dont_require_masters/",
        "text": "I recently received my BA in Environmental Studies and Sociology. I am potentially interested in going straight into a PhD program, though I know many don’t admit people without masters. I am certainly open to, and will apply to, masters programs. However, for several reasons it seems wise to consider the PhD route. I come from a low income background so funding is a consideration, and I am interested in research as a career. Which PhD programs that will consider those without masters do you recommend that I look at? I know faculty interest alignment is an important factor. I’m interested in transportation systems in terms of their relationship with social equity, community, and environmental sustainability. Thanks in advance for any direction you can provide!",
        "created_utc": 1669087810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recently graduated college (tech degree) in rural America. Moved to a city and fell in love with community planning. Networked my way into an interview, so I’m ISO of advice on how to prepare.",
        "author": "ApprehensiveAd3427",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z1iwce/recently_graduated_college_tech_degree_in_rural/",
        "text": "I studied psychology, geology, and geospatial sciences at a small state college. Nothing fit right for me and I found out how much I hate the nitty gritty of data management. I moved to a bigger city that prioritizes mobility, sustainability, and progressive zoning. It changed the way I see life itself, and things are clicking in ways they never have. I am so excited by geography, specifically how people and their environments impact and influence each other. I started emailing government employees bugging them to meet with me about their day to day. After about 5 meetings, one of them pointed me to a new job posting.\n\nI have some experience in local government, which I think is my biggest pull. I did a data collection internship in the field for county govt. I also did a data management internship for a city govt. Both of which were in water utilities. I also took a civic engagement class in college that allowed one on one with county commissioners. \n\nI have of course logged dozens of hours watching YouTube (strong towns, not just bikes, etc) but need books to round myself out. How can I balance my starry eyed optimism with real world planning? I want to be taken seriously, despite my lack of experience. It’s an entry level position, so I don’t even know what the applicant pool might look like. Send anything my way. Book recommendations, articles, videos, etc. \n\nTL;DR noob in search of city planning learning materials before an entry level planning interview.",
        "created_utc": 1669087042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it easy to relocate as a planner? Are skills transferable from city to city?",
        "author": "Emotional_Confusion2",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z1i8v6/is_it_easy_to_relocate_as_a_planner_are_skills/",
        "text": "So I'm currently getting my Masters in city planning in a mid-size Southern city. I couldn't afford to move elsewhere for my degree. For many reasons, I'm hoping to leave the South after graduating, but I'm learning that a lot of planning is based in familiarity with regional codes/ issues affecting your respective city/ etc. \n\nDoes anyone have experience with this? Is it easy to break into the field in areas of the country you aren't so familiar with?",
        "created_utc": 1669085156,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Landlord and The Tenant",
        "author": "an_untaken__username",
        "url": "https://www.propublica.org/article/milwaukee-fire-brunner-belen-landlord-tenant",
        "text": "[removed]",
        "created_utc": 1669085106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suburbs are destroying the planet",
        "author": "AffableAgnostic",
        "url": "https://youtu.be/rAji45kHBPU",
        "text": "",
        "created_utc": 1669076452,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Great Places Erased by Suburbia (the Third Place)",
        "author": "FaultyTerror",
        "url": "https://www.youtube.com/watch?v=VvdQ381K5xg&amp;ab_channel=NotJustBikes",
        "text": "",
        "created_utc": 1669055130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cleveland A National Leader In Office To Residential Conversions",
        "author": "TopMicron",
        "url": "https://www.crainscleveland.com/real-estate/cleveland-emerges-national-leader-office-building-conversions?utm_source=weekly-newsletter&amp;utm_medium=email&amp;utm_campaign=20221118&amp;utm_content=article1-readmore",
        "text": "",
        "created_utc": 1669043870,
        "upvote_ratio": 1.0
    },
    {
        "title": "From 'car-dependent hellscapes' to green cities, Canadians find new ways to fight climate change",
        "author": "throw0101c",
        "url": "https://www.cbc.ca/news/business/evs-cities-climate-column-don-pittis-1.6654675",
        "text": "",
        "created_utc": 1669042774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban Design Jobs",
        "author": "MRCOWBOY760",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z0o415/urban_design_jobs/",
        "text": "What kind of jobs are there in urban design?  From the research I have been doing, cool city beautification projects are more common in Latin American countries?",
        "created_utc": 1669001139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a B.S degree in urban and regional studies worth it?",
        "author": "RazzmatazzRough8168",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z0mktr/is_a_bs_degree_in_urban_and_regional_studies/",
        "text": "Is this a degree where I will struggle to get a job in a related field? I am more than interested in the subject but I don't want to go into it if it will be darn near impossible to get a job in it. Now I can understand if it won't get me a job straight out of school. I just need to know that if you work hard enough it will land you a job in a related field.",
        "created_utc": 1668996841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just appointed to be transportation commissioner. Any advice?",
        "author": "yusefudattebayo",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z0mgvj/just_appointed_to_be_transportation_commissioner/",
        "text": "I’ve been an advocate for sustainable transportation for some time now (especially pushing for protected bike lanes and protected intersections) and one recently elected city councilmember (in favor of walkable cities) is actually appointing me on the transportation commission. I do want to push city staff especially since the commissions today don’t hold the city accountable necessarily and are meaty political favors. I want to be an active commissioner. Do you have any advice, especially if you’ve served on a commission before?",
        "created_utc": 1668996532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking input on potential job offers - torn between two",
        "author": "raginhomer",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z0fgw2/seeking_input_on_potential_job_offers_torn/",
        "text": "Hey everyone. So I'm almost finished with my master's program--decided to drop down to part time for the last semester or two and look for full-time jobs. I'm a career changer so eager to jump back in and get more experience under my belt. I've had a fellowship/internship with my local planning commission for the last year and a half or so. \n\nI have tentative offers from two places: one is a high-growth but largely suburban county and the other is a smaller city. I am curious if anyone has any thoughts, as I'm a bit torn. Here are the basics (both seem like amazing and supportive teams, so no difference there really):\n\n**County job:** pays a bit better, hybrid remote work, but this area is basically a bedroom community with tons and tons of subdivisions popping up everywhere. I would specifically be doing current planning, site plan review, that kind of stuff for the most part, which I'm not necessarily against. \n\n**City job:** pay isn't quite as good (though can potentially leverage the other offer to see if they'll match), and seems like I'd be in the office basically every day. But also seems like a really good learning opportunity, as I'd be dealing with EVERYTHING--some long-range and comprehensive planning, development review, meeting with community redevelopment agencies, and the city even has a form-based code, which is very interesting to me, and I could be a part of updating it, which will happen in the near future. \n\nI basically feel like the concrete benefits of the county job are attractive--salary, some remote work, etc.--but the city job would probably expose me to more things and be more interesting overall. The commute would be a bear after years of remote work, but might be worth it. If anyone has ever dealt with a choice like this or has any thoughts, please let me know! I'm in Florida if that matters at all. \n\nThanks in advance!",
        "created_utc": 1668978817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canadian urban groups",
        "author": "adork",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z0f7tg/canadian_urban_groups/",
        "text": "Question for my fellow Canadian planners: What's the difference between the [Canadian Urban Institute](https://canurb.org/) and [Council for Canadian Urbanism](https://www.canu.ca/)?\n\nI'm looking to get a bit more involved and contribute more to the profession, but I'm not sure which of these would be better. Is one older than the other? Did some people disagree with one and create the other? \n\nThanks!",
        "created_utc": 1668978214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Los Angeles Is Actually Pretty Good",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z0e2nz/los_angeles_is_actually_pretty_good/",
        "text": "The term \"Los Angelization\" has been used to describe bad urban design, either by opponents of Urban Sprawl or by people who oppose densification. Los Angeles has long had the reputation for being the capital of car culture and for being car crazy, though other cities have taken this banner from Los Angeles. That reputation still remains though. I believe this picture of Los Angeles is inaccurate and Los Angeles is actually quite unique.\n\nFirst we can look at the residential densities of Los Angeles. It's residential densities are much higher than most places in the US. \n\nThe City of Los Angeles proper has a residential density of 8,300 people per SQ mile. Not an ultra high residential density, but much higher than most places in the United States. Some people have pointed out to me, that it's residential densities are lowered by the presence of undevelopable mountains inside the boundaries of LA. Both the city and county of LA have a fair amount of strip malls, but they don't define LA and there is plenty of older denser development and newer dense and mixed use development. \n\n [https://www.census.gov/quickfacts/fact/table/losangelescitycalifornia/POP010220](https://www.census.gov/quickfacts/fact/table/losangelescitycalifornia/POP010220)\n\nThe cities that surround Los Angeles such as Santa Ana, Long Beach, and Santa Monica and function as extensions of LA have even greater residential densities.\n\nThe City of Long Beach has a residential density of 9,200 people per square mile\n\n[https://worldpopulationreview.com/us-cities/long-beach-ca-population](https://worldpopulationreview.com/us-cities/long-beach-ca-population)\n\nSanta Ana has a population density of 11,000 people per square mile\n\n[https://worldpopulationreview.com/us-cities/santa-ana-ca-population](https://worldpopulationreview.com/us-cities/santa-ana-ca-population)\n\nSanta Monica has a population density of 11,000 people per square mile\n\n[https://worldpopulationreview.com/us-cities/santa-monica-ca-population](https://worldpopulationreview.com/us-cities/santa-monica-ca-population)\n\nFor most of the History of Los Angeles, it and its surrounding cities have been rapidly densifying, while other cities de-densified.\n\n[https://www.jstor.org/stable/10.1525/phr.2008.77.1.87](https://www.jstor.org/stable/10.1525/phr.2008.77.1.87)\n\nAccording to the US Census, the Los Angeles Urbanized Area is the densest urbanized area in the United States at 7000 people per square mile\n\n[https://la.curbed.com/2012/3/26/10385086/los-angeles-is-the-most-densely-populated-urban-area-in-the-us](https://la.curbed.com/2012/3/26/10385086/los-angeles-is-the-most-densely-populated-urban-area-in-the-us)\n\nBy comparison the average urbanized area in the United States is roughly 2,500 people per square mile.\n\n[https://www.census.gov/programs-surveys/geography/guidance/geo-areas/urban-rural/ua-facts.html](https://www.census.gov/programs-surveys/geography/guidance/geo-areas/urban-rural/ua-facts.html)\n\nMany Los Angeles neighborhoods are quite dense such as Koreatown having over 40,000 people per square mile\n\n[http://www.doctorhousingbubble.com/parts-of-los-angeles-have-higher-population-densities-than-new-york-over-200000-people-live-in-informal-housing-pushing-population-densities-to-levels-that-surpass-queens-the-bronx-and-brooklyn/](http://www.doctorhousingbubble.com/parts-of-los-angeles-have-higher-population-densities-than-new-york-over-200000-people-live-in-informal-housing-pushing-population-densities-to-levels-that-surpass-queens-the-bronx-and-brooklyn/)\n\nThe densest neighborhood in Houston, Gulfton, has 14,000 people per square mile\n\n[https://en.wikipedia.org/wiki/Gulfton,\\_Houston](https://en.wikipedia.org/wiki/Gulfton,_Houston)\n\nThe densest neighborhood in Dallas, Victory Meadow has 8,000 people per square mile\n\n[https://www.city-data.com/neighborhood/Vickery-Meadows-Dallas-TX.html](https://www.city-data.com/neighborhood/Vickery-Meadows-Dallas-TX.html)\n\nAlon Levy makes the case that Los Angeles is car centric because of a lack of employment centralization and low Transit ridership,\n\n[https://pedestrianobservations.com/2018/11/11/meme-weeding-los-angeles-density/](https://pedestrianobservations.com/2018/11/11/meme-weeding-los-angeles-density/)\n\nWhile downtown Los Angeles might be weak, the west side of LA County is quite strong, Wilshire boulevard and Santa Monica Boulevard both have substantial Job Concentrations. The portion of land stretching from Central Los Angeles to the coast is quite densely packed in terms of job densities. There is also strong job concentrations in South Los Angeles county. These job concentrations are why I believe the purple Line extension is a crucial investment and should have been done ages ago, and possibly a subway along Santa Monica BLVD. Alweg offered to build a monorail along wilshire and other parts of the city with private money and honestly the city should have taken the offer. \n\n[https://spatial.usc.edu/wp-content/uploads/2014/04/KreugerSamuelThesis.pdf](https://spatial.usc.edu/wp-content/uploads/2014/04/KreugerSamuelThesis.pdf)\n\n[https://www.bloomberg.com/news/articles/2012-12-10/the-strong-core-theory-of-los-angeles](https://www.bloomberg.com/news/articles/2012-12-10/the-strong-core-theory-of-los-angeles)\n\n[https://calstatela.patbrowninstitute.org/wp-content/uploads/2018/05/Giuliano\\_ForWeb.pdf](https://calstatela.patbrowninstitute.org/wp-content/uploads/2018/05/Giuliano_ForWeb.pdf)\n\nAs times goes on job concentrations should increase in LA \n\n[https://la.urbanize.city/post/caa-moving-its-hq-new-century-city-office-tower](https://la.urbanize.city/post/caa-moving-its-hq-new-century-city-office-tower)\n\nAlon Levy bemoans Los Angeles having \"no transit\", not rigidly literally of course, but having a very weak transit system. \n\nThe Transit System in Los Angeles used to have a 9 percent modal share. So while this modal share has declined, it shows that there is potential for more transit ridership in LA. LA's built environment isn't the main obstacle. The main obstacle is the quality and amount of service LA Metro is able to provide.\n\n[https://www.itdp.org/2020/04/28/los-angeles-1985-and-today/](https://www.itdp.org/2020/04/28/los-angeles-1985-and-today/)\n\nLA Metro and its predecessors SOCAL RTD, used to carry some 500 million riders.\n\n[https://la.streetsblog.org/wp-content/uploads/sites/2/2016/01/la-me-g-ridership-slump-20160126-1.png](https://la.streetsblog.org/wp-content/uploads/sites/2/2016/01/la-me-g-ridership-slump-20160126-1.png)\n\nWhile 9 percent would be lower than Chicago modal share, Los Angeles numeric ridership was at one time similar to Chicago\n\n[https://www.statista.com/statistics/1294093/chicago-cta-network-total-annual-ridership/](https://www.statista.com/statistics/1294093/chicago-cta-network-total-annual-ridership/)\n\nAlon Levy claims that ridership is only increased in LA by lower fares, but this is incorrect. The Metro Expo line, despite its flaws, was able to generate a net increase in ridership. Contrary to what people like Randal O'toole would say, they didn't merely redistribute riders from buses to trains. 70 percent of the riders were new riders. They didn't redistribute riders or lower fares to attract riders to the Expo Line.\n\n[https://www.masstransitmag.com/rail/press-release/12257690/los-angeles-county-metropolitan-transportation-authority-metro-seventy-percent-of-passengers-on-the-metro-expo-line-are-new-riders](https://www.masstransitmag.com/rail/press-release/12257690/los-angeles-county-metropolitan-transportation-authority-metro-seventy-percent-of-passengers-on-the-metro-expo-line-are-new-riders)\n\nThe the Rail system alone covers quite a large area and is growing all the time\n\n[https://upload.wikimedia.org/wikipedia/commons/d/dc/Los\\_Angeles\\_Metro\\_System\\_Map.png](https://upload.wikimedia.org/wikipedia/commons/d/dc/Los_Angeles_Metro_System_Map.png)\n\nThe bus, rail and bus rapid transit together even more extensive\n\n[https://www.dropbox.com/s/j9sfdm9yiyv8hx9/23-1621\\_blt\\_system\\_map\\_47x47.5\\_DCR.pdf?dl=0](https://www.dropbox.com/s/j9sfdm9yiyv8hx9/23-1621_blt_system_map_47x47.5_DCR.pdf?dl=0)\n\nPlus there are municipal agencies like big blue bus in the mix. LA Metro rail, BRT and buses plus local buses adds up to a very comprehensive transit system.\n\nIs LA's Transit system flawed, yes, but it would be wrong to say that is has \"no transit\", obviously not literally, but not in the sense Alon Levy says it does.\n\nLos Angeles freeways have become part of the city's image, but surprisingly the city has a small amount of freeways per capita. If Los Angeles was truly \"car crazy\" then it would have a lot more freeways then it does. It's freeways per capita are actually lower ghan Philadelphia, Chicago, and Boston. Boston has roughly twice the freeways per capita of Los Angeles.\n\n[https://www.fhwa.dot.gov/policyinformation/statistics/2019/hm72.cfm](https://www.fhwa.dot.gov/policyinformation/statistics/2019/hm72.cfm)\n\nThat said I would like to see either freeway removal or freeway capping in LA.\n\n[https://la.curbed.com/2018/5/30/17406234/cap-park-downtown-los-angeles-101-freeway-photos](https://la.curbed.com/2018/5/30/17406234/cap-park-downtown-los-angeles-101-freeway-photos)\n\n[https://hollywoodcentralpark.org/news/whats-new/single/402](https://hollywoodcentralpark.org/news/whats-new/single/402)\n\nLos Angeles also has lower per capita vehicle miles than other socal cities\n\n[https://la.streetsblog.org/2019/08/20/fun-facts-on-how-much-people-drive-in-different-parts-of-southern-california-and-l-a/](https://la.streetsblog.org/2019/08/20/fun-facts-on-how-much-people-drive-in-different-parts-of-southern-california-and-l-a/)\n\nLos Angeles urbanized area has lower per capita vmt than the Atlanta urbanized area and many other urbanized areas\n\n[https://www.fhwa.dot.gov/policyinformation/statistics/2019/hm72.cfm](https://www.fhwa.dot.gov/policyinformation/statistics/2019/hm72.cfm)\n\nThe LA Metro area has slightly higher per capita VMT than the Chicago Metro area and suprisingly a lower VMT than the Bay Area\n\n[https://www.vitalsigns.mtc.ca.gov/daily-miles-traveled](https://www.vitalsigns.mtc.ca.gov/daily-miles-traveled)\n\nIn terms of residential densities, job concentrations, transit coverage, modal share, and ridership, freeways per capita and per capita VMT, Los Angeles really isn't auto oriented or auto centric. By all those metrics it is actually much less car centric and much less car crazy than most American cities.  Things exist in degrees, so while LA is more car centric than New York or Chicago or European and Asian cities, it is much less car centric than other American cities. Beyond things like per capita vmt or transit ridership the city is quite vibrant with lots of things to do, amenities and culture.",
        "created_utc": 1668975466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Europe’s Cities Are Getting More Crowded—That’s a Good Thing",
        "author": "MIIAIIRIIK",
        "url": "https://www.wired.com/story/europe-cities-populations/",
        "text": "",
        "created_utc": 1668966736,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Are We Still Obsessed With Robert Moses?",
        "author": "mealsharedotorg",
        "url": "https://www.nytimes.com/2022/11/19/nyregion/robert-moses-straight-line-crazy.html",
        "text": "",
        "created_utc": 1668962959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stop Telling People to Avoid Grad School",
        "author": "Wide_Royal1517",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z03wyq/stop_telling_people_to_avoid_grad_school/",
        "text": "At this point, it just feels like gatekeeping. You all know that the window of opportunity to get a planning job (well paying might I add) is closed without a Master’s nowadays. That is unless you have an undergraduate degree in planning, architecture or engineering specifically. Job descriptions will say they desire all social science degrees, but that is not true by far. It’s not even about who you know anymore in some places, because hiring has gotten so bad. Most of you are not coming into planning in this present market, this is not 2006, things are quite different. Even then so, never get too comfortable thinking that you can’t learn more. So if you’re reading this and were thinking about that Master’s…get it. Oh and don’t forget about your AICP!!",
        "created_utc": 1668950295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Planning-Related Sights to See in Detroit?",
        "author": "a22x2",
        "url": "https://www.reddit.com/r/urbanplanning/comments/z03777/planningrelated_sights_to_see_in_detroit/",
        "text": "Passing through Detroit for one night and visiting for the first time. Are there any interesting/important planning-related sights to see? I’m super interested in the “idea” of Detroit, but know absolutely nothing about her. \n\nI’m particularly interested in the usual (true mixed-use, mixed income housing, repurposing of un- or underused buildings, public transit, and public services). I’ve got a recommendation to check out the central library, and would love a couple more recommendations to round out my tour. \n\nPlanning on visiting for a longer time in the future, just rushing through for right now but will have some downtime. Thanks!",
        "created_utc": 1668948186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Houston Actually Does in Fact Lack Zoning",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yzmbnp/houston_actually_does_in_fact_lack_zoning/",
        "text": "When discussion of Houston is brought up urbanists will say that while Houston lacks a formal zoning code, that its land use regulations are \"zoning by another name\". But I believe this analysis is simplistic. This equates all land use regulation with zoning and it misunderstands what zoning in fact is. Cities have always regulated land use to some extent, even before we had zoning. \n\nNew York City adopted citywide zoning around 1916\n\n[https://en.wikipedia.org/wiki/1916\\_Zoning\\_Resolution](https://en.wikipedia.org/wiki/1916_Zoning_Resolution)\n\nBut it had laws to regulate tenements before adopting a citywide zoning code\n\n[https://en.wikipedia.org/wiki/Old\\_Law\\_Tenement](https://en.wikipedia.org/wiki/Old_Law_Tenement)\n\n  \nZoning isn't simply the mere regulation of land use, zoning divides sections of cities into zones and decides what type of buildings can be put there or what kinds of activities can take place. It will only allow certain kinds of buildings, say apartments of single family homes in one kind of zone or it only allows commercial, residential, industrial or mixed use in other kinds of zones. Because Houston doesn't have zoning, you can put high rise apartment buildings or townhomes in areas that have single family homes. Zoning is exists precisely to prevent the kind of development that takes place in Houston. If Houston ***actually*** had zoning, developers wouldn't be able to buy single family homes, bulldoze them and replace them with high rises and townhomes, and yet this happens all the time in Houston. In a city with Zoning like Austin, redevelopment of single family neighborhoods rarely if ever happens, or at the very least is much harder. High rise apartment buildings are created all over Houston and not just in certain areas zoned for that purpose. Houston's lack of zoning is why you can take industrial property, clean it up and reuse it for residential uses, because the lack of zoning means that the property can be used for something else.\n\nTory Gattis, who is biased towards Houston, points out the major difference between Houston's land use regulation and other cities.\n\n[http://houstonstrategies.blogspot.com/2015/09/houston-is-different-from-zoned-cities.html](http://houstonstrategies.blogspot.com/2015/09/houston-is-different-from-zoned-cities.html)\n\nHouston's lack of zoning is also helping to grow mixed use development\n\n[https://cxre.co/houston/mixed](https://cxre.co/houston/mixed)\n\nHouston's other regulations such as setbacks, parking minimums, and lot size aren't really zoning, these are design requirements. Nothing about these regulations determines how you could use land, only what features a building must include. The ***merits*** or ***usefulness*** of these rules is another discussion altogether, but it's wrong to equate them with zoning. These rules are more akin to building codes or form based codes rather than zoning.\n\nParking minimums, for example, doesn't stop mixed use development from happening or apartments from being built in a single family neighborhood, it only requires that the mixed use development or apartments have a certain amount of parking. I am in favor of removing parking minimums, I have my doubts that they produce much more parking than what builders would include on their own. I also have doubts that parking minimums reduce residential densities that much or at all, since many dense cities either have parking minimums or had them until recently. Though I am willing to be proven wrong on both points.\n\nInterestingly Houston has removed parking minimums from sections of the city. \n\n[https://usa.streetsblog.org/2019/07/19/houston-rolling-back-parking-requirements/](https://usa.streetsblog.org/2019/07/19/houston-rolling-back-parking-requirements/)\n\nHouston's climate action plan means that parking minimums will abolished altogether by 2030, though before 2030 transit oriented developments will have reduced or eliminated parking requirements.\n\n[https://www.bloomberg.com/news/articles/2020-05-21/houston-s-climate-plan-could-make-it-a-green-model](https://www.bloomberg.com/news/articles/2020-05-21/houston-s-climate-plan-could-make-it-a-green-model)\n\nHouston's lot size requirements are quite permissive, allowing lots as small as 1,400 square feet. I would prefer lot size requirements to be only applied to neighborhoods with septic tanks, say half an acre for places with wells and septic tanks but none for regular developments, but Houston's requirements are very permissive compared to other cities. Most cities have lot size requirements ranging from 5000 - 10000 square feet and some even large such as multiple acre lot size requirements, these requirements I believe present a real hinderance to affordability. I believe these smaller lots will help preserve affordability in Houston.\n\n[https://www.planetizen.com/blogs/109955-how-houston-achieved-lot-size-reform](https://www.planetizen.com/blogs/109955-how-houston-achieved-lot-size-reform)\n\n[http://houstonstrategies.blogspot.com/2020/08/houston-held-up-as-model-of-land-use.html](http://houstonstrategies.blogspot.com/2020/08/houston-held-up-as-model-of-land-use.html)\n\nHouston setback requirements are kind of weird, but some sources put them at 3 - 5 feet where as others put them at 15 - 25 feet. These regulations seem to be not consistently applied and often the city will permit development with very small or no setback at all. While they are part of the city's development code, they seem to function in practice as a suggestion.\n\n[https://www.ghba.org/ghba-fights-for-consistency-in-city-of-houston-regulation/](https://www.ghba.org/ghba-fights-for-consistency-in-city-of-houston-regulation/)\n\n[https://marketurbanism.com/2016/09/19/how-houston-regulates-land-use/](https://marketurbanism.com/2016/09/19/how-houston-regulates-land-use/)\n\nWith regards to deed restrictions, these are not at all equivalent to zoning. In fact equivocating deed restrictions with zoning is often used an argument ***for zoning***. The argument is essentially that people would create deed restrictions anyways, so government should create zoning, but Houston demonstrates that not everyone wants a deed restrictions and zoning takes away this flexibility. Deed restrictions are ***enforced*** by the city of Houston, and perhaps they shouldn't be, but they are not ***created*** by the city of Houston contrary to popular belief. Deed restrictions are created either by neighborhoods or by private developers who want to appeal to market segments that desire the deed restrictions. Deed restrictions predate zoning by decades. Deed restrictions only cover 25% of Houston's land area. Deed restrictions are also more flexible than zoning; they can be removed with enough percent of votes. If a deed restriction requires say 51% of votes to be removed, a developer can simply buy 51% of properties subject to the deed restriction, remove the restriction and redevelop the neighborhood.  Getting zoning changed can often be much harder than removing Houston's deed restrictions. \n\n[https://marketurbanism.com/2018/04/11/houstons-deed-restrictions-basically-zoning/](https://marketurbanism.com/2018/04/11/houstons-deed-restrictions-basically-zoning/)\n\nIs Houston completely unregulated? No, not at all. However Houston's regulations aren't equivalent to zoning and many of those regulations are on their way out or are very modest. Nor are Houston's deed restrictions a form of zoning, but such restrictions offer more choice and flexibility than zoning does. Houston isn't completely free or unregulated, but it is substantially ***freer*** than most American cities and substantially ***less*** regulated than most cities and over time it will become even freer than it is today. Houston is unique and it shouldn't simply be dismissed as having zoning by another name or being no different than a city that actually does have zoning. I would love to see other cities such as Los Angeles, San Diego, Austin, Miami, Seattle or New York City abolish their zoning codes.",
        "created_utc": 1668892531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban growth of Doha, Qatar",
        "author": "TheCityTopic",
        "url": "https://youtu.be/e5IOCosvnqA",
        "text": "",
        "created_utc": 1668876936,
        "upvote_ratio": 1.0
    },
    {
        "title": "The last wall of Paris: the story of the boulevard périphérique",
        "author": "wimborneminster",
        "url": "https://fabricofparis.com/2022/11/18/the-last-wall-of-paris-the-story-of-the-boulevard-peripherique.html",
        "text": "",
        "created_utc": 1668875021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shifting Gears: Why Communities Are Eliminating Off-Street Parking Requirements—and What Comes Next",
        "author": "BACsop",
        "url": "https://www.lincolninst.edu/publications/articles/2022-10-shifting-gears-eliminating-off-street-parking-requirements",
        "text": "",
        "created_utc": 1668863438,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does lobbying/corporate influence affect American urban planning?",
        "author": "_Fruit_Loops_",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yz2j7h/how_does_lobbyingcorporate_influence_affect/",
        "text": "To me, the state of America’s city design has the fingerprints of big oil and automotive giants all over it. Is that assessment accurate? Do you guys have any info or data on this? Thanks.\n\nAlso, I know these decisions come from planners and even the public, but the planners and public have to get their ideas from somewhere. I speculate it's the auto and oil industries which originally spawned a lot of this junk.",
        "created_utc": 1668828846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spokane Washington Highways",
        "author": "Patient_Magician4142",
        "url": "https://www.krem.com/article/money/economy/boomtown-inland-northwest/when-north-south-freeway-ready-what-spokane-drivers-expect/293-35383637-617b-4504-bf51-eb4d10f0d099",
        "text": "",
        "created_utc": 1668821706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any of you have ADHD? Is there a focus within planning you find easier/harder to do with ADHD?",
        "author": "PradleyBitts",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yyw2qd/do_any_of_you_have_adhd_is_there_a_focus_within/",
        "text": "Struggling to find something I can be good at",
        "created_utc": 1668809441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Several transit expansions opening at the end of 2022.",
        "author": "Victor_Korchnoi",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yyu7zb/several_transit_expansions_opening_at_the_end_of/",
        "text": "Last month the K (Crenshaw) Line opened in LA.\n\nThis week the Silver Line extension to Dulles in DC opened.\n\nThis weekend the Central Subway is opening in San Francisco.\n\nDecember 12th, the Green Line Extension in Boston is opening.\n\nWhich is your favorite?",
        "created_utc": 1668804525,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think about suburbs in Germany?",
        "author": "Wild_Agency_6426",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yyto1h/what_do_you_think_about_suburbs_in_germany/",
        "text": "They usually have single and missing middle housing and accomodations and are somewhat walkeble to semi walkeble.",
        "created_utc": 1668803060,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do you think about having flexible zoning?",
        "author": "PhraseDifferent5979",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yykn13/what_do_you_think_about_having_flexible_zoning/",
        "text": "Can adaptive planning through flexible zoning help us with a more uncertain environment?",
        "created_utc": 1668779666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a better way than Environmental Impact Assessment? (EIA)",
        "author": "Robots-arent-real",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yycie2/is_there_a_better_way_than_environmental_impact/",
        "text": "I've just finish a paper on (NZ) EIA and was left with a bad taste in my mouth. \n\nIt seems it's just a regulatory tick box; In front of a project that was gonna happen anyway, regardless of results.\n\nPeople breach conditions all the time and skim around the principle via loopholes. \n\nWhat are your thoughts, is there a better method than EIA?",
        "created_utc": 1668750737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software Advice for Road Design?",
        "author": "mbarnestech",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yya1me/software_advice_for_road_design/",
        "text": "Hi!\n\nI'm not an urban planner, nor do I plan on returning to school and becoming one. That being said, I'm quite interested in transportation infrastructure, particularly in designing roads for safe &amp; connected forms of non-car transit. \n\nI've been considering a hobby project where I get road data via satellite imagery or public information act requests and mock up possibilities for adding things like dedicated bus lanes, bike lanes, wider sidewalks, etc. I don't need it to be visually stunning, but I'd like to put together a spatially accurate birds-eye view of street possibilities in my area (I'm imagining this would likely be in the form of color coded overlays).\n\nIs there any free / cheap software that would be good for this? I was considering a combo of QGIS &amp; Python or perhaps teaching myself R, but I'm not quite sure what all the possibilities are and I was hoping someone here might have a more informed idea. \n\nAny thoughts?",
        "created_utc": 1668742554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loosening zoning laws will reduce housing/rent prices.",
        "author": "bradleymuller87",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yy7q2r/loosening_zoning_laws_will_reduce_housingrent/",
        "text": "Cost of living is rising in the US. This occurrence is de-incentivizing young people to not have kids. The US needs kids to maintain its growth and prosperity. Loosening zoning laws will help the future of the US and it’s citizens.",
        "created_utc": 1668735598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there big US cities which aren't beholden to NIMBYs and are developing density or transit oriented developments?",
        "author": "thccdd",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yy1zjx/are_there_big_us_cities_which_arent_beholden_to/",
        "text": "Question as above, excluding perhaps cities like New York and Chicago which don't have this opportunity. But maybe they do outside of their dense cores.",
        "created_utc": 1668720097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does some zoning write out and also include the number? Seems like some kind of holdover. i.e. \"shall be twenty-five feet (25’) above grade\"",
        "author": "nQf3c3jJqz",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yxyzfz/why_does_some_zoning_write_out_and_also_include/",
        "text": "And would it be responsible to just remove the repetition in a rewrite?",
        "created_utc": 1668713023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do American Fire Trucks Need To Be So Massive? - Cheddar Explains",
        "author": "GuiGeeKang",
        "url": "https://youtu.be/E_vEFakF03A",
        "text": "",
        "created_utc": 1668710395,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are other alternative career paths besides “Planner” that interact with the field?",
        "author": "penguinbiscuits21",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yxxtlh/what_are_other_alternative_career_paths_besides/",
        "text": "Just like my title states, it’s hard for me to think of positions outside of the “Planner” position. I’m aware there’s other similar titles such as Plans Examiner, but I’m thinking more outside the local government sector and maybe something federal or private companies have.\n\nIt’s discouraging being well-versed in the field and not being able to truly make a difference. Do you all know of career paths that may branch off or have adopted an urban planning related approach in its job tasks?",
        "created_utc": 1668710287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suburban mom handcuffed, jailed for making 8-year-old son walk half a mile home. A batshit insane story.",
        "author": "Avagantamos101",
        "url": "https://reason.com/2022/11/16/suburban-mom-jailed-handcuffed-cps-son-walk-home/",
        "text": "",
        "created_utc": 1668704067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Office Buildings Are Still in Trouble",
        "author": "domestication_never",
        "url": "https://www.nytimes.com/2022/11/17/business/office-buildings-real-estate-vacancy.html",
        "text": "",
        "created_utc": 1668703506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I subscribe to National Geographic",
        "author": "ItsLostLychee",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yxut0h/should_i_subscribe_to_national_geographic/",
        "text": "I am a first year Urban Planning student and was wondering if I should pay for National Geographic. It's not so much for projects but more just so I can stay in touch with what's happening in my field of study. Was wondering if National Geographic was to best to get or if there are other better website for Urban Planning?",
        "created_utc": 1668703016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Walkability &amp; Small Business",
        "author": "ChickenMcNothing",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yxc2ln/walkability_small_business/",
        "text": "I’m a student studying Urban Planning, and an observation I’ve made is that small business can succeed almost exclusively in walkable areas. The inverse is also true; small business that tries to set up shop in car centric areas, like stroads and strip malls, are almost destined to die. \nI think there are a few reasons for that:\n1. By design, downtown shops are small and old and thus have rents accessible to local entrepreneurs.\n2. For people living in walkable areas, it’s a much better deal to be able to walk to a corner store to get what you need rather than driving to a big box store, even if it’ll be more expensive. The lack of a car trip is enough of a competitive deal.\n3. The “shop local” culture is stronger in walkable areas since there’s a greater sense of community\n(Obviously there’s a lot more to all that but I don’t want this post to be overly long.)\nFor me, local business is very important in how I look at the future of growing areas, and as much as state/national politicians harp on how much they love mom and pop stores, I’ve found a surprisingly small amount of information regarding how local businesses/economies actually function.\nIf anyone has suggestions for books or other insights, I would greatly appreciate it.",
        "created_utc": 1668647122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nashville converts parking minimums to maximums in central city",
        "author": "thomas_hace",
        "url": "https://www.tennessean.com/story/news/local/davidson/2022/11/16/nashville-eliminates-minimum-urban-area-parking-space-requirements/69651050007/",
        "text": "",
        "created_utc": 1668627476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why \"Fake\" Downtowns Are The New Malls - Cheddar Explains",
        "author": "GuiGeeKang",
        "url": "https://youtu.be/DOAjdc_pXn8",
        "text": "",
        "created_utc": 1668619912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Metro Service to DC’s Dulles Airport Finally Arrives, 60 Years in the Making",
        "author": "SuccessfulOperation",
        "url": "https://www.bloomberg.com/news/articles/2022-11-15/dc-s-silver-line-to-dulles-is-a-boon-for-train-to-plane-travelers",
        "text": "",
        "created_utc": 1668613355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inclusionary Zoning Makes Housing Less Affordable Not More",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/ywvdhf/inclusionary_zoning_makes_housing_less_affordable/",
        "text": "[https://www.strongtowns.org/journal/2018/4/10/is-inclusionary-zoning-creating-less-affordable-housing](https://www.strongtowns.org/journal/2018/4/10/is-inclusionary-zoning-creating-less-affordable-housing)\n\nThere are several ways in which inclusionary zoning makes housing less affordable.\n\n1. It reduces the overall number of units built by making development less profitable.\n2. The cost of the below market units are passed onto the market rate units in order to compensate for reduced profits.\n3. Not necessarily caused by the inclusionary zoning itself, but once adopted there is incentive to block projects because activists want ever greater percentages of \"affordable\" units. \n\nIn California affordable units have additional regulatory requirements that market rate units do have.\n\nIn Carlsbad, CA affordability requirements added roughly 8% to the cost of housing. \n\nFrom: OPENING SAN DIEGO’S DOOR TO LOWER HOUSING COSTS\n\n[http://silvergatedevelopment.com/wp-content/uploads/2019/01/PtNazareneStudyFindings.pdf](http://silvergatedevelopment.com/wp-content/uploads/2019/01/PtNazareneStudyFindings.pdf)\n\n\"Carlsbad’s second largest element in its regulatory cost total involves the various fees that are imposed and collected when the building permit is issued. These fees add about 9% to the cost of housing. Another 8% of housing prices comes from the city’s requirements to provide affordable housing.\"\n\nAny below market rate housing should be subsidized and provided by the governments rather than trying to force developers to provide it. Affordability requirements also divert attention from artificial scarcity and costs imposed by governments, which is the actual problem, not developers being \"greedy\".",
        "created_utc": 1668609969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Countries where urban planners get paid the most",
        "author": "KingDing94",
        "url": "https://www.reddit.com/r/urbanplanning/comments/ywqod3/countries_where_urban_planners_get_paid_the_most/",
        "text": "I know in America, urban planners get paid more than in a lot of countries but where else do urban planners get paid the most money ?",
        "created_utc": 1668597183,
        "upvote_ratio": 1.0
    },
    {
        "title": "UK planning job market",
        "author": "rav4786",
        "url": "https://www.reddit.com/r/urbanplanning/comments/ywkayd/uk_planning_job_market/",
        "text": "I'm a Canadian considering future practice in the UK. Was wondering if anyone might be able to share some insight/info into what the town planning job market there is like? What are if any difficulties in finding employment exist?",
        "created_utc": 1668574784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unpopular Opinion - AICP",
        "author": "CosmicCinderella",
        "url": "https://www.reddit.com/r/urbanplanning/comments/ywjkbh/unpopular_opinion_aicp/",
        "text": "I feel that 1) the immense amount of flexibility surrounding the APA’s eligibility for AICP, in addition to 2) the AICP-candidate program, and of course there’s 3) the actual joke of an exam that the AICP is for “accreditation” which is only recognized in ONE of FIFTY states covered by the APA, makes the whole thing stink of pseudo-professional pyramid scheme. \n\nSorry. I have a masters in planning from a highly reputable program and feel that this organization does not represent my interests nor that of any of my colleagues in land use consulting. In fact, I’ve been seeing a sudden uptick in landscape architects seeking AICP just “add some letters”. It’s almost like the APA is widening the pyramid base no matter the cost. \n\nI love what I do and I’m just tired of the APA handing out AICPs like it’s a hot commodity. We have so many god-awful AICP planners in our community that it’s starting to get heart-wrenching to see their negative impacts throughout our neighborhoods. AICP just credits awful planners.",
        "created_utc": 1668572554,
        "upvote_ratio": 1.0
    },
    {
        "title": "California Has Plenty of Land for Greenfield Development",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/ywilpc/california_has_plenty_of_land_for_greenfield/",
        "text": "One argument used against Greenfield Development in California is that California is somehow running out of land. This argument is wrong on its face. The total population density of the state is 257 people per square mile and only 5 percent of the state has been developed. California's land area is also huge at roughly 164,000 square miles or roughly 105 million acres. [https://californiapolicycenter.org/fixing-california-part-five-affordable-market-housing/](https://californiapolicycenter.org/fixing-california-part-five-affordable-market-housing/) \n\n[https://en.m.wikipedia.org/wiki/California](https://en.m.wikipedia.org/wiki/California) \n\n[https://worldpopulationreview.com/state-rankings/states-by-area](https://worldpopulationreview.com/state-rankings/states-by-area) \n\nNew Jersey by comparison has 33 percent of its land developed and has over 1000 people per square mile\n\n[https://www.njfuture.org/2019/11/11/where-does-impervious-cover-have-the-biggest-impact/](https://www.njfuture.org/2019/11/11/where-does-impervious-cover-have-the-biggest-impact/) [https://worldpopulationreview.com/states/new-jersey-population](https://worldpopulationreview.com/states/new-jersey-population) \n\nOne study shows that California has 25 million acres of developable land as of 2000, though some of this land is probably developed by now. Mind you this doesn't even cover the entirety of the state. From: Raising the Roof: California Housing Development Projections and Constraints, 1997-2020 [https://escholarship.org/uc/item/1391n947](https://escholarship.org/uc/item/1391n947) \n\n\"California is a huge state, and except in a few critical locations, has ample land to grow. As of 1996, the 35 metropolitan counties for which land supply data are available included 25 million acres of potentially developable raw land.\" \n\nSome people might retort that all of that land is the desert or in undesirable places, but that is not true. The two lowest hanging fruits, the Bay Area and Los Angeles Metro area both have land that could be developed to meet housing needs. Some may point out that Los Angeles is surrounded by mountains, not too far away from Los Angeles, there is Ventura county which, thanks to urban growth boundaries, is walling in Los Angeles. According to exhibit 13, which is no longer included with the Raising the Roof study, but I provided a link, Ventura county has 303,800 acres of developable land, which is roughly 475 square miles. 475 is enough land area to create another Los Angeles. If you developed those 475 square miles at a density of roughly 8,000 people per square mile, a modest density, That could hold roughly 3.8 million people. The amount of people that could be housed in Ventura county using both infill and greenfield is substantial. That same study shows 376,000 undeveloped acres in Los Angeles county, though how much is near the LA Basin is hard to say. \n\nExhibit 13 here: [https://drive.google.com/file/d/1z9fPYr4I9c4-KPMKCYpw8IjyhYa0Ysw9/view?usp=share\\_link](https://drive.google.com/file/d/1z9fPYr4I9c4-KPMKCYpw8IjyhYa0Ysw9/view?usp=share_link) \n\nVentura County's own zoning map shows large quantities of land designated as open space and agriculture. [https://vcrma.org/en/ventura-county-general-plan](https://vcrma.org/en/ventura-county-general-plan) \n\nLos Angeles county's zoning map shows land designated as open space and agriculture near Santa Monica and near Santa Clarita. You can even view when riding the Metrolink trains. [https://www.propertyshark.com/Real-Estate-Reports/2015/07/07/zoom-in-l-a-county-zoning-map-shows-what-you-can-build-and-where-in-los-angeles/](https://www.propertyshark.com/Real-Estate-Reports/2015/07/07/zoom-in-l-a-county-zoning-map-shows-what-you-can-build-and-where-in-los-angeles/) \n\nThere is even some land in the San Gabriel valley that is undeveloped. Monrovia has several areas designated as open space or requiring multiple acre lots. Much of this undeveloped land can be seen when riding the LA Metro gold line. [https://www.cityofmonrovia.org/home/showpublisheddocument/1378/636960188069700000](https://www.cityofmonrovia.org/home/showpublisheddocument/1378/636960188069700000)\n\nEven Orange County has land that is developable. The same raising the roof study gives Orange County, CA 132,000 acres of developable land.\n\nSan Juan Capistrano's Zoning map shows land near LA Novia that is zoned for planned communities, but has yet to be developed. This land is also within the boundaries of San Clemente, but is also undeveloped.\n\n[**https://www.sanjuancapistrano.org/DocumentCenter/View/465/Zoning-Map-PDF?bidId=**](https://www.sanjuancapistrano.org/DocumentCenter/View/465/Zoning-Map-PDF?bidId=)\n\nLA Novia has been planned for development, but only limited amounts have been allowed and the project in question has been delayed for years. \n\n[https://www.latimes.com/socal/daily-pilot/entertainment/story/2021-05-06/homes-coming-to-san-juan-capistrano-hillside-as-equestrian-center-stalls](https://www.latimes.com/socal/daily-pilot/entertainment/story/2021-05-06/homes-coming-to-san-juan-capistrano-hillside-as-equestrian-center-stalls)\n\n[https://www.ocregister.com/2010/12/09/chronology-of-the-distrito-la-noviasan-juan-meadows/](https://www.ocregister.com/2010/12/09/chronology-of-the-distrito-la-noviasan-juan-meadows/)\n\nA google streetview shows that LA Novia/Avenida LA Plata is mostly undeveloped and hilly grassland\n\n[https://www.google.com/maps/@33.4863735,-117.6114679,3a,75y,354.52h,77.55t/data=!3m7!1e1!3m5!1sZ9A91Q6LY2NjWXxZIresLA!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3DZ9A91Q6LY2NjWXxZIresLA%26cb\\_client%3Dmaps\\_sv.tactile.gps%26w%3D203%26h%3D100%26yaw%3D245.08289%26pitch%3D0%26thumbfov%3D100!7i16384!8i8192?hl=en&amp;authuser=0](https://www.google.com/maps/@33.4863735,-117.6114679,3a,75y,354.52h,77.55t/data=!3m7!1e1!3m5!1sZ9A91Q6LY2NjWXxZIresLA!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3DZ9A91Q6LY2NjWXxZIresLA%26cb_client%3Dmaps_sv.tactile.gps%26w%3D203%26h%3D100%26yaw%3D245.08289%26pitch%3D0%26thumbfov%3D100!7i16384!8i8192?hl=en&amp;authuser=0)\n\nUnincorporated Silvarado, CA has undeveloped land as well.\n\nThis map shows several land designated as open space in Orange county on Page 18\n\n[https://www.ocsheriff.gov/sites/ocsd/files/2021-05/May%202021%20County%20of%20Orange%20Hazard%20Mitigation%20Plan%20PUBLIC%20REVIEW%20DRAFT.pdf](https://www.ocsheriff.gov/sites/ocsd/files/2021-05/May%202021%20County%20of%20Orange%20Hazard%20Mitigation%20Plan%20PUBLIC%20REVIEW%20DRAFT.pdf)\n\nThe Orange county Zoning map shows several areas designated as open space\n\n[https://ocds.ocpublicworks.com/sites/ocpwocds/files/import/data/files/58442.pdf](https://ocds.ocpublicworks.com/sites/ocpwocds/files/import/data/files/58442.pdf)\n\nThe study itself points out that much land is undeveloped due to political reasons.\n\n\"The majority of California cities and counties have adopted one or more growth control and/or growth management measures. Growth controls, which include population, housing, and commercial space caps directly restrict the quantity and pace of new development, usually far below private market levels.\"\n\n[https://web.archive.org/web/20080612175545/http://www.hcd.ca.gov/hpd/hrc/rtr/chp4r.htm](https://web.archive.org/web/20080612175545/http://www.hcd.ca.gov/hpd/hrc/rtr/chp4r.htm)\n\nExhibit 13 of The Raising the Roof study also identifies 524,000 acres of developable land in San Diego county.\n\nAccording to a stud, \"OPENING SAN DIEGO’S DOOR TO LOWER HOUSING COSTS\" by the Fermian Business and Economic Institute, San Diego has substantial amounts of land that is suitable for development, but where development cannot take place\n\n[http://silvergatedevelopment.com/wp-content/uploads/2019/01/PtNazareneStudyFindings.pdf](http://silvergatedevelopment.com/wp-content/uploads/2019/01/PtNazareneStudyFindings.pdf)\n\n\"Within this “undevelopable” designation, there is significant acreage that is geographically suitable for development, but which has been designated as open space and/or open space preserve. San Diego County, as a whole enjoys, one of the most robust open space preserve systems in the country. Through the City’s and the County’s “MSCP” multiply species conservation plans (MSCPs) and Habitat management plans (HMPs), tens of thousands of acres have been set aside to preserve open space and wildlife. Much of this acreage is adjacent to developed land and would be suitable for development without this preserve designation.\"\n\nTo the extent that Greenfield development still happens in Southern California like San Bernadino county, it is often highly regulated subject to lawsuits, open space requirement, solar panel requirements and other ownerous requirements.\n\nThe Sierra Club sued the developer of the Tapestry project in Hesparia, CA and reduced the amount of homes included.\n\n[https://iebusinessdaily.com/hesperia-braces-for-major-housing-development/](https://iebusinessdaily.com/hesperia-braces-for-major-housing-development/)\n\nEven if we accept the premise that Socal is all built out, a premise which isn't true, the Central coast has plenty of land available for development\n\nHere is a google streetview of San Luis Obispo County. Most of the central coast basically looks like this.\n\n[https://www.google.com/maps/@35.1967971,-120.6028221,3a,75y,16.65h,73.92t/data=!3m7!1e1!3m5!1sNNApYG9jNbba7cYCvc5Obg!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3DNNApYG9jNbba7cYCvc5Obg%26cb\\_client%3Dmaps\\_sv.tactile.gps%26w%3D203%26h%3D100%26yaw%3D167.24072%26pitch%3D0%26thumbfov%3D100!7i13312!8i6656?hl=en&amp;authuser=0](https://www.google.com/maps/@35.1967971,-120.6028221,3a,75y,16.65h,73.92t/data=!3m7!1e1!3m5!1sNNApYG9jNbba7cYCvc5Obg!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3DNNApYG9jNbba7cYCvc5Obg%26cb_client%3Dmaps_sv.tactile.gps%26w%3D203%26h%3D100%26yaw%3D167.24072%26pitch%3D0%26thumbfov%3D100!7i13312!8i6656?hl=en&amp;authuser=0)\n\nThe Zoning Map of San Luis Obispo county shows that the majority of it has been zoned exclusively for agriculture use or rural designation.\n\n[http://gis.calpoly.edu/gis/data/slo\\_county%2Flanduseelement%2Fcountywide\\_luc%2Fcountywide\\_luc.jpg](http://gis.calpoly.edu/gis/data/slo_county%2Flanduseelement%2Fcountywide_luc%2Fcountywide_luc.jpg)\n\nThe Bay area, which people often assert doesn't have much land for development, actually has quite a lot of land for development. San Francisco is only some 47 square miles, but the entire bay area is roughly 7000 square miles.\n\n[https://en.wikipedia.org/wiki/San\\_Francisco\\_Bay\\_Area](https://en.wikipedia.org/wiki/San_Francisco_Bay_Area)\n\n San Francisco may be a peninsula surrounded by ocean, but to the North There is Marin County which has a land area of over 828 square miles.  \n\n[https://en.wikipedia.org/wiki/Marin\\_County,\\_California](https://en.wikipedia.org/wiki/Marin_County,_California)\n\nTo the extent development has taken place in Marin, it took 50 years to approve a subdivision\n\n[https://reason.com/2022/05/31/county-where-it-took-50-years-to-approve-new-subdivision-bans-new-airbnbs/](https://reason.com/2022/05/31/county-where-it-took-50-years-to-approve-new-subdivision-bans-new-airbnbs/)\n\nMarin County recently taxed itself to buy private land to stop development\n\n[https://sfist.com/2022/11/10/power-nimby-move-marin-residents-give-selves-hefty-tax-hike-to-block-housing-development/](https://sfist.com/2022/11/10/power-nimby-move-marin-residents-give-selves-hefty-tax-hike-to-block-housing-development/)\n\nIn fact development was planned in Marin County called Marincello, it would have included high rises, townhomes and single family homes\n\n[https://blog.bayareametro.gov/posts/throwback-thursday-housing-almost-was-built-bay-area](https://blog.bayareametro.gov/posts/throwback-thursday-housing-almost-was-built-bay-area)\n\nFurther North there is Sonoma County with a land area of over 1500 square miles.\n\n[https://en.wikipedia.org/wiki/Sonoma\\_County,\\_California](https://en.wikipedia.org/wiki/Sonoma_County,_California)\n\nAccording to the Greenbelt alliance 75 percent of land in the Bay area is off limits to development\n\n[https://www.greenbelt.org/blog/bay-area-open-space-75-percent-is-being-protected-but-300000-acres-are-still-at-risk/](https://www.greenbelt.org/blog/bay-area-open-space-75-percent-is-being-protected-but-300000-acres-are-still-at-risk/)\n\nHere is a map of lands off limits to development\n\n[https://www.greenbelt.org/uncategorized/bay-area-lands-at-risk-map/](https://www.greenbelt.org/uncategorized/bay-area-lands-at-risk-map/)\n\nSanta Clara county, and shown in the greenbelt alliance map, home to San Jose, despite its reputation for sprawl, has had an urban growth boundary since the 1970s\n\n[https://plandev.sccgov.org/ordinances-codes/planning-studies/morgan-hill-urban-growth-boundary](https://plandev.sccgov.org/ordinances-codes/planning-studies/morgan-hill-urban-growth-boundary)\n\nGetting rid of urban growth boundaries is hard to do, but the solution I think is to have the state override local governments; if the state can override single family zoning, it can also override urban growth boundaries. I would abolish the David Williamson act, which creates tax incentives for conservation easements, I would outlaw agriculture and open space zoning, reform or abolish CEQA and I would abolish Local Agency Formation Commissions, which restrict development to incorporated or annexed areas and restrict development on unicorporated lands and take away from counties the power to zone and regulate land use. If counties can't zone or regulate land then developers can simply step outside of city limits if a local government is being unreasonable, like they do in Texas. I would also require governments to privatize land set aside as open space.",
        "created_utc": 1668569798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban Planners in Las Vegas or LA?",
        "author": "taro1020",
        "url": "https://www.reddit.com/r/urbanplanning/comments/ywdm8s/urban_planners_in_las_vegas_or_la/",
        "text": "I'm a soon-to-be planner from Canada and I'll be visiting Las Vegas and LA in January - wondering if there are any planners in either of these areas that would be down to meet up and be geeky planners together? \n\nAs a side note, I'm coming from a pretty transit-oriented city so seeing the auto-centricity of both cities will be a fascinating experience I think. If you have any recommendations of urban planning related things to do, please let me know!",
        "created_utc": 1668556219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any of you/your employers use Salesforce? Have you found a way to get experience with it in this field?",
        "author": "PradleyBitts",
        "url": "https://www.reddit.com/r/urbanplanning/comments/ywcpik/do_any_of_youyour_employers_use_salesforce_have/",
        "text": "I know many companies and gov agencies use Salesforce, but do they in planning specifically?",
        "created_utc": 1668553952,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why rents increased in the U.S. and will this trend continue?",
        "author": "UrbanAngle",
        "url": "https://www.youtube.com/watch?v=m2ZLkATKinE",
        "text": "",
        "created_utc": 1668541356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can designers make good urban planners?",
        "author": "meredithgn",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yw7ctd/can_designers_make_good_urban_planners/",
        "text": "[removed]",
        "created_utc": 1668541195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career switch from Enivornmental",
        "author": "liliroro",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yw5u30/career_switch_from_enivornmental/",
        "text": "I am a geologist (PG, BSc, MSc) with 7 years of experience working in environmental consulting. I don’t like the field aspect and I don’t see myself being happy working in environmental consulting anymore. I’m trying to find areas where I can transition where field work would be minimal if not at all. I use ArcGIS and AutoCAD consistently for my work and would like to bring these skills over to a new career. I am also learning other programming languages for other career choices (Python, html, css, Java script; completely unrelated but I thought I’d throw that in). Would I be able to move to a land planner position with my current credentials, and if not what steps should I take?",
        "created_utc": 1668537653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I go into urban planning?",
        "author": "owlboy1906",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yw5qsk/should_i_go_into_urban_planning/",
        "text": "[removed]",
        "created_utc": 1668537440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some advice",
        "author": "Oba-Koin",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yw0ro7/need_some_advice/",
        "text": "Hi guys! \nI'm 18 yo, finishing high school this year and I'm thinking about studying urban design/urban planning next year.\nCould you recommend me some sources (books/websites) to start learning about the topic from in English? I live in Poland so I'm more interested in European style rather than U.S.\nThanks!",
        "created_utc": 1668527005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Value of Very Light Rail (VLR)",
        "author": "CovertAg3nt",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yw05za/value_of_very_light_rail_vlr/",
        "text": "Today, I came across the concept of [Very Light Rail](https://en.wikipedia.org/wiki/Coventry_Very_Light_Rail), which appears to be a more sophisticated form of a tram. It's still just a concept and only appears to be in development in the English town of Coventry. However, the idea is interesting, and I was wondering what others thought of the potential of such a system in recreating streetcar and tram lines in many American cities, seeing as (as [Coventry](https://www.coventry.gov.uk/regeneration-1/light-rail)'s website puts it) it can run on battery power and be laid in track only 30cm deep? This [article](https://www.newcivilengineer.com/latest/coventry-very-light-rail-system-could-spark-transport-revolution-09-11-2022/?tkn=1) cites that it would cost 1/3 of what a tramway costs to install per km, while still keeping light rail's effectiveness at getting the public to switch off of cars.\n\nOther Links:\n\n[https://warwick.ac.uk/fac/sci/wmg/research/hvmcatapult/research/rail/vlr/](https://warwick.ac.uk/fac/sci/wmg/research/hvmcatapult/research/rail/vlr/)\n\n[https://www.railengineer.co.uk/very-light-rail-a-revolution/](https://www.railengineer.co.uk/very-light-rail-a-revolution/)",
        "created_utc": 1668525732,
        "upvote_ratio": 1.0
    },
    {
        "title": "job offer from Arup (London) for Economics &amp; Finance",
        "author": "NoAppearance1310",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yvracq/job_offer_from_arup_london_for_economics_finance/",
        "text": " \n\nHi all,\n\nI'm graduating university this year with a Bachelor of Economics and received an entry-level job offer from Arup (London, U.K) for Economic &amp; Financial Advisory. Was hoping that someone in this sub could give me a general overview of what it's like working at an engineering/city-design firm as an Economist, including anything that I should definitely know about but probably don't at the moment. I wasn't really expecting to work in this area after university so I don't know much.\n\nMy interviewers &amp; job description said that I'd be doing cost-benefit analyses, feasibility studies, social impact assessments, input-output modelling and so on, which I don't really have any experience in (bar social impact assessments), but I've got a strong mathematical-economics degree so they probably thought I could handle it.\n\nThanks!",
        "created_utc": 1668501989,
        "upvote_ratio": 1.0
    },
    {
        "title": "job offer from Arup (London) for Economics &amp; Finance",
        "author": "NoAppearance1310",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yvr5wf/job_offer_from_arup_london_for_economics_finance/",
        "text": "Hi all,\n\nI'm graduating university this year with a Bachelor of Economics and received an entry-level job offer from Arup (London, U.K) for Economic &amp; Financial Advisory. Was hoping that someone in this sub could give me a general overview of what it's like working at an engineering/city-design firm as an Economist, including anything that I should definitely know about but probably don't at the moment. I wasn't really expecting to work in this area after university so I don't know much.\n\nMy interviewers &amp; job description said that I'd be doing cost-benefit analyses, feasibility studies, social impact assessments, input-output modelling and so on, which I don't really have any experience in (bar social impact assessments), but I've got a strong mathematical-economics degree so they probably thought I could handle it.  \n\n\nThanks!",
        "created_utc": 1668501515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the idea of the City of Telosa a mixture of both hype and practical foresight?",
        "author": "kmarinas86",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yvq8el/is_the_idea_of_the_city_of_telosa_a_mixture_of/",
        "text": "***\"Telosa Webinar 2 - Sustainability &amp; Our Environment: A New City Design\"*** *(October 27, 2022)*\n\n[*https://www.youtube.com/watch?v=tR2LIcoCGlQ*](https://www.youtube.com/watch?v=tR2LIcoCGlQ) *(58m 41s)*\n\nIt is easy to criticize an idea for depicting \"flying cars\" as a means of travel within a city. Any picture with one will easily attract derision if spread to a wide audience. But what if the image being painted depicted more than that. On the ground, people travel mainly as pedestrians, and the sides of roads aren't lined with parked cars. Instead there are pedestrian paths and public transport. Imagine a city with a population density between that of San Francisco and Central Paris - without a history of single occupancy vehicles having already polluted the environment over many past decades.\n\nIt is easy to criticize an idea for depicting a \"city in the desert\". Yet once upon a time, a city was built on an island in a middle of a giant lake called Lago de Texcoco. That city grew into a water-scarce region that we now know as Mexico City. Sustainability is not just about having enough resources to start with. Sustainability is also about effectively preserving resources no matter how little is left. It is easy to say \"we're sustainable\" if we insist on living only places where nature has it made easy for us. Yet, what better place could there be to develop the competency of resource preservation than one where it is nature, and not pre-built human settlements, which poses the primary obstacle to sustainable development? Of course, I am not talking about colonizing Mars or Antarctica. There is such a thing as having too much of a challenge. A reasonable, yet difficult challenge would be building sustainably in deserts or arid plains in temperate latitudes. If you think that even deserts and arid plains are unreasonable places to build cities in, what would you have told the Dutch in the Netherlands, where the land is below sea level? Not everyone can live in the modern equivalent of Lago de Texcoco (or other \"lands of plenty\") until such places can be created in abundance. Sometimes we must learn to thrive in far-from-ideal conditions. It is thriving that goes beyond sustainability. Going beyond sustainability is needed if we are to sprout the next \"Lagos de Texcoco\" over all the world.\n\nThought must be taken to maintain existing ecosystems, and even better, to develop dense ecosystems from sparse ones. These ecosystems help retain water in places where it might otherwise be lost. Another key to developing ecosystems is wind. Wind can be harnessed to facilitate passive cooling of structures that create habitable environments inclusive to other species. The orientation of water flows, wind flows, and of the sun itself in relation to the elements within a city can have a profound impact on whether that city could be considered \"livable\".\n\nThe connectivity provided by a multitude of intersecting green belts would enable a dense biocenosis throughout the scope of development - enmeshed across the urban fabric of the city. Such biocenosis allows each citizen to access nature without leaving the city, and without isolating nature within the city from nature outside the city. Developing shade is one of the keys to developing such ecosystems in the desert. Imagine if the architecture incorporated shading elements through the entire infrastructure of the city. Such shade is easy to come by if the city is adequately dense, such that the space between buildings is not a \"liminal space\" but a livable space.\n\nSuch simple considerations are not new ideas, and yet a supposedly \"futurist\" proposal may incorporate such strategies, quietly, while others may scoff at the proposal simply because it also so happens to loudly depict \"flying cars\" which are in-fact nothing more than helicopters with extra features, rather than some distant fantasy of science fiction.\n\nThe bits of information you may have gathered of \"Telosa\" were likely from a few months ago - prior the more recent presentation titled \"Sustainability &amp; Our Environment: A New City Design\". If you watch the new presentation, you will see that there is a lot more to the idea that what has been passed around. Some of the material will seem familiar and will certainly not be unique to \"Telosa\". However, the fact is that there exists a billionaire \"with\" a better idea of how to make a city than the ones conceived by the world's richest man, or by the world's richest family, though of course much of that credit belongs to a [community](https://cityoftelosa.com/about/)\\* that has already developed around \"Telosa\". The touted \"inculsivity\" of the project may actually be key for the idea to be greater than the man who happens to stand behind it, lest he stand in the way of it.\n\n*\\* Disclaimer: I'm not actually in that community. I'm simply a distant onlooker that tends to give \"new ideas\" more than a passing glance.*",
        "created_utc": 1668498061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thank You For Your Feedback | The community feedback process is an inconvenient annoyance that brings out the worst in people. It is also at the heart of why U.S. cities can't build new housing or transportation",
        "author": "Hrmbee",
        "url": "https://www.vice.com/en/article/n7z5jm/thank-you-for-your-feedback",
        "text": "",
        "created_utc": 1668486230,
        "upvote_ratio": 1.0
    },
    {
        "title": "I rode my OneWheel on Stanford University Campus today",
        "author": "Aqualung1",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yvm7xt/i_rode_my_onewheel_on_stanford_university_campus/",
        "text": "School was in session. It’s a very flowy, bike/pedestrian centric and motor vehicles are very limited. Once class lets out, students flood the campus, and cyclists flow around campus. It was like swimming in a school of fish. \n\nFreshman must learn to ride in this environment and by the time they are Seniors, they must be totally dialed in. I’ve never experienced a high density environment without cars before that’s like this. Cars basically suck balls as far as I’m concerned, and this campus allowed me to see a possible future where we heavily penalize the use of cars. \n\nI noticed most of the faster riders are young, and most of the slower riders are older and/or female. Speed didn’t matter, as pedestrians, and slower cyclists all flowed effortlessly. \n\nAnyone here a student or faculty member on campus?, and could you talk about what it’s like to move around campus on a bike?  I found it totally exhilarating being in the slipstream behind someone on a bike, going through roundabouts, like one of those videos of traffic in India, where nobody pays attention to stop signs, things just flow. \nAre there collisions, or are those pretty rare?  I’ve never seen anything like this before.",
        "created_utc": 1668484869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future Smart Cities Planned To Be Built",
        "author": "Millionized",
        "url": "https://youtu.be/iyUImV5ba6w",
        "text": "",
        "created_utc": 1668479848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can housing be designed around pre-existing trees, instead of planting new ones?",
        "author": "_Fruit_Loops_",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yviujl/can_housing_be_designed_around_preexisting_trees/",
        "text": "Trees are great in cities and suburbs. But they usually have to be big and lush to do really well, or at least to look good. And the problem with that, of course, is that newly-planted trees take decades or centuries to get really big. So to speed up that process, is it possible to design *around* trees that are *already* fully-grown? Like, instead of leveling a whole woodland, one would just take the extra care to select some trees to keep alive, and then build around them? Or is that just too unworkable?\n\n(Side note: I think golf courses would work well for this, because they already have flat vacant land with patches of trees that could be used to build mixed use neighborhoods, but that’s a different topic)",
        "created_utc": 1668475484,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the maximum population density that can support \"bike-dominant\" transportation?",
        "author": "Nuclear_rabbit",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yvgiez/what_is_the_maximum_population_density_that_can/",
        "text": "Car-dependent infrastructure has a population density limit before the grid enters gridlock and you *have* to transition a city to another form of primary transportation.\n\nHere where I am in Jakarta, the dominant form of transport is the motorbike. We have over 28,000 ppl/sqkm throughout the city, half of a metro line, and notoriously bad traffic.\n\nI suppose bicycles can operate at higher densities than motorbikes, and more hostility to cars would increase potential bike density even more. But I get the sense that an ideal transit model for my city's density would recognize that it is past bike-dominance and would need to have denser traffic as the primary mode, like buses, trams, or even trains.\n\nHas the planning profession studied this question to any degree?",
        "created_utc": 1668469246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crude emails reveal nasty side of a California beach city’s crusade to halt growth",
        "author": "bigvenusaurguy",
        "url": "https://www.latimes.com/homeless-housing/story/2022-11-14/crude-emails-reveal-nasty-side-of-a-california-beach-city-crusade-to-halt-growth",
        "text": "",
        "created_utc": 1668461515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban Sprawl is Not a Threat to Farmland and Open Space",
        "author": "theoneandonlythomas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yv6o18/urban_sprawl_is_not_a_threat_to_farmland_and_open/",
        "text": "\nThis a follow up to my previous Post\nSee here:\nhttps://www.reddit.com/r/urbanplanning/comments/yqp9vm/urban_sprawl_is_not_financially_unsustainable_nor/\n\nOne idea used to bolster support for urban growth boundaries, greenbelts, conservation easements and agriculture/rural/open space zoning is the idea that these measures are needed to preserve farmland and open space. But a reality check shows us that the United States has an abundance of both farmland and open space.\n\nAccording to the US Department of Agriculture, as of 2012, Urban land made up roughly 3 percent of land use in the United States. All other uses made up the rest of land usage. To swallow up every acre of land at current residential densities would require a roughly 33 fold increase in population; which is very unlikely to happen.\n\nhttps://www.ers.usda.gov/amber-waves/2017/december/a-primer-on-land-use-in-the-united-states/\n\nOne has to consider that farmland prices are much lower than land for urban development. If farmland was truly something scarce then this would be reflected in farmland prices and farmers would be less willing to sell.\n\nhttps://www.bloomberg.com/news/articles/2015-04-10/the-real-role-of-land-values-in-the-united-states\n\nAs of 2015 Farmland is only worth 2000 dollars vs urban land being worth 20,000 dollars an acre.\n\nFarming itself has become so efficient that thanks to modern farming land is used 2.7 times more efficiently than before.\n\nhttps://ourworldindata.org/grapher/land-sparing-by-crop?country=Cereals~Fruit~Pulses~Sugar+Crops~Roots+and+Tubers~Vegetables~All+crops\n\nFarming has become much more efficient and it could be even more efficient.\nHydroponics could enable as much as a 90% reduction in agricultural land use, depending on the crop.\n\nhttps://psci.princeton.edu/tips/2020/11/9/the-future-of-farming-hydroponics\n\nPlus hydroponics can enable a 25% improvement in yields\n\nhttps://www.advancednutrients.com/articles/easy-hydroponics-beginners-guide/\n\nHydroponic fodder can substantially reduce the amount of land needed for livestock feed. It takes substantially less land to grow feed in a greenhouse than it does to grow crops for feed. \n\nhttps://www.agriculture-afrique.com/la-serre-a-trump-in-permaculture/\n\nPlus substantial amounts of crops are used for biofuel production.\n\nThe fact that farmers haven't completely optimized production for land use efficiency and that we can get away biofuel production, shows that land needed for farming is more than sufficient to meet needs.\n\nForests are actually expanding in developed countries such as in the United States\n\nhttps://www.earth.com/news/forests-expanding-prosperous-nations/\n\nAccording to this article it puts urban land at 2% of US land area and agriculture at 17%, the rest would be things like Forests, grasslands, wetlands, shrub lands and designated open space. Not sure what the \"other\" category is. \n\nhttps://www.weforum.org/agenda/2020/02/land-use-america-agriculture-nature-urban\n\nFarmland and Open space are in abundance not scarcity and urban areas are unlikely to ever make those things scarce.",
        "created_utc": 1668447596,
        "upvote_ratio": 1.0
    },
    {
        "title": "PUD for an existing structure? (factory)",
        "author": "Librarian-Voter",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yv5e6j/pud_for_an_existing_structure_factory/",
        "text": "Hello! A developer wants to turn an old factory building (\\~180k sqft) that is currently zoned light industrial into apartments, and is applying for an SUP. Not a new concepts. However, some folks say the town should wait for a PUD. Would a PUD be used on a remodeling job like this, where the apts would be rentals? I thought PUDs are strictly for new development, with unit ownership?",
        "created_utc": 1668445092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Education- Urban Planning Degree",
        "author": "WallCautious7901",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yv4ero/education_urban_planning_degree/",
        "text": "Hey there! I'm still in high school (about to give my GCSEs) and I've been doing a bit of research as to what I'm gonna do after. I'm currently interested in geography, business and economics. I've come across urban planning and seen a few decent universities globally. Is urban planning a good career to dive into and should I do a bachelors in urban planning or would that be too specialized? Also wondering what subjects I should pick for my A and AS levels. I",
        "created_utc": 1668443157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban Design Masters via Online ??",
        "author": "Emergency-Frosting23",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yv3395/urban_design_masters_via_online/",
        "text": "Hey folks, \nI’ve been researching masters programs but haven’t been able to find any that are provided online. Preferably in Urban Design or Urban Planning. \nAny advice or direction is appreciated.",
        "created_utc": 1668440481,
        "upvote_ratio": 1.0
    },
    {
        "title": "What level of density is really needed for walkability and good transit?",
        "author": "Vancouver_transit",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yv29aq/what_level_of_density_is_really_needed_for/",
        "text": "Basically title. I've heard everything between 5000-7000 people per square km as the bare minimum to 10,000 plus people per square km. \n\nAssuming a '15 minute city', where parks, schools, most healthcare, groceries, restaurants etc are all within a 15 minute walk (or alternatively about a 1 km radius), how much density is really needed?\n\n6000-7000 is easily achievable with townhomes and single family. Upwards of 10,000 is getting into low rise apartment territory. Above that probably requires significant mid rise housing.",
        "created_utc": 1668438771,
        "upvote_ratio": 1.0
    },
    {
        "title": "What area of Youtube do you struggle with the most?",
        "author": "mariowalker25",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yv1mrq/what_area_of_youtube_do_you_struggle_with_the_most/",
        "text": "What area of Youtube do you find the most challenging as an Urban Planner? \n\n[View Poll](https://www.reddit.com/poll/yv1mrq)",
        "created_utc": 1668437466,
        "upvote_ratio": 1.0
    },
    {
        "title": "The U.S. city of the future",
        "author": "Maxcactus",
        "url": "https://noahpinion.substack.com/p/the-us-city-of-the-future",
        "text": "",
        "created_utc": 1668437071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think Youtube is a great platform for Urban Planners",
        "author": "mariowalker25",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yv0qjl/do_you_think_youtube_is_a_great_platform_for/",
        "text": "A lot of Urban Planners are on youtube such as CityNerd, Just For Bikes, and Chedder. Do you think Youtube is great for Urban Planning?\n\n[View Poll](https://www.reddit.com/poll/yv0qjl)",
        "created_utc": 1668435529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduate Program Inquiry",
        "author": "jazzgumbo",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yuzn6r/graduate_program_inquiry/",
        "text": "Hello!\n\n&amp;#x200B;\n\nI am a Political Science student at Baldwin Wallace in Cleveland, OH looking for a career in planning focused on community development or GIS. I am an Indiana Resident and am looking at potential graduate programs for a master's degree. I am having difficulty deciding which would be best for me. I aim to get a degree from a respected university with as little debt as possible and become employed. I was wondering if anyone had strong opinions on these programs:\n\n&amp;#x200B;\n\nBall State University (MURP)\n\nIUPUI (MPA)\n\nIU (MPA)\n\nCincinnati (MCP)\n\nCleveland State (MUPD)\n\n&amp;#x200B;\n\nThank you so much! If there are any other programs to keep my eye out for, please let me know :)",
        "created_utc": 1668433066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gulf Countries?",
        "author": "idk_what_to_put_lmao",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yur6nv/gulf_countries/",
        "text": "Does anyone know why Gulf countries have such bizarre urban planning? It's often very nice to look at and what not but a lot of it seems impractical and they seem to suffer a lot from urban sprawl. I'm not an expert in urban planning by any means so I don't know if there IS any use to the way they plan but I just don't get why  their planning always seems so extravagant but also random? Like they carve out space ahead of time for fancy waterways and then the people have nowhere to live. Could someone also maybe point me in the way of some resources on the topic? Thanks",
        "created_utc": 1668407977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rural / exurban / regional planning",
        "author": "mannadee",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yui2ve/rural_exurban_regional_planning/",
        "text": "Hello, I’m interested in pursuing a master’s in sustainable urban planning from a university in my area (US). My undergrad was in an unrelated field (humanities) but in the years since then I’ve done a lot of personal work and research about ecovillages and community resilience. I’m also on the planning review committee for a small town on the island where I live. I’m very interested in the relationship between people and place, and how affordable housing &amp; food security goals intersect with nature conservation. Also the interdependence / conflict between rural and urban contexts. \n\nI have seen only a few programs focusing on rural planning (one in Ireland, which is very tempting, but I can’t bear to be too far from the projects I’m involved with on my island). \n\nI’m curious if there are any professionals or grad students in this subreddit who have the same interests. If so, where did you complete your studies, and what has your career been like?",
        "created_utc": 1668381387,
        "upvote_ratio": 1.0
    },
    {
        "title": "UCD vs TU Dublin for urban planning education in Ireland",
        "author": "Wifimuffins",
        "url": "https://www.reddit.com/r/urbanplanning/comments/yuh9fe/ucd_vs_tu_dublin_for_urban_planning_education_in/",
        "text": "Can anybody tell me about the qualities and differences between these two programs? UCD seems like the better school but I don't know how they compare for urban planning specifically.",
        "created_utc": 1668379668,
        "upvote_ratio": 1.0
    }
]