[
    {
        "title": "Walkable urban areas can become playgrounds for the rich. Is there any way to prevent that?",
        "author": "LOL-o-LOLI",
        "url": "https://www.vox.com/2017/6/27/15716412/affordable-cities-playgrounds-rich-toderian",
        "text": "",
        "created_utc": 1535490212,
        "upvote_ratio": ""
    },
    {
        "title": "Why people prefer private cars to public transportation, and how to change that",
        "author": "hrsidkpi",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9b2qli/why_people_prefer_private_cars_to_public/",
        "text": "Disclaimer- I am by no means an expert in the subject. I am a 17 years old high school student. But I read a lot, and I have the experience of using both public transportation daily (not having drivers license and all), and cars daily (my parents commute only by car and a lot of friends who already got a license also do).\n\nWe can all agree that public transportation is better for urban areas than cars. It is safer, it takes less space, its better for the environment and its usually cheaper. But the fact is, city governs still plan cities around cars, and not around public transportation. People would rather, in almost all cases and when they can afford it, use a car and not public transport.  I checked the internet, asked friends and family, and thought to myself, what are all the reasons one would prefer a car. I also tried thinking of ways to make public transportation answer those needs of people, but that's where you guys come in.\n\n&amp;#x200B;\n\n* Privacy- there is no debate that you have much more privacy in your private car than in public transportation. People want privacy. In a car you can pick your nose and scratch your balls or whatever socially unacceptable thing you want to. You can talk on the phone about private matters. You can disconnect from the world when you are alone. A lot of people are in a social environment the entire day- at home with their family, at work with their colleagues, at the bar with their friends, and again at home with their family. The car is the only place where they can be alone for a long time without feeling the time is wasted. You can't have that in current mainstream public transportation. So how can we make public transportation more private?\n   * Single person booths inside large vehicles like train and 2-lane buses. The booths would be comfortable in size, and perhaps there could be booths for 2 people or for groups. Of course, this would make public transportation much less crowded which in turn would decrease its efficiency, but it would still be much better than cars because it gets rid of the engine (it would be below the vehicle and not in the front), unused seats, and spaces between vehicles.\n   * Focusing on bikes and walk in central locations. Of course, in larger and less dense places, or in cities that are not flat, this is a problem.\n* Comfort- Again, almost all modern public transportation mediums are much less comfortable than cars for the user. In public transportation you often have to stand up. It is usually crowded. You can't listen to your own music, or set the temperature for yourself. Public transportation is also often dirty and unpleasant. In a car, you can adjust everything to your needs. You can lower and move the seat and the back of the seat, you can listen to music through the speakers, you can leave your personal belongings inside when leaving for a short while, etc'. My father can't stand commuting via buses because of his back for example.\n   * This concern can also be solved by private booths. If the booths are properly sealed, you could listen to music (albeit not as loud as in a car), you can set the temperature, move the seat, and all the functions of a car.\n   * Renting booths- you could rent a booth for extended periods of time, and get a key like in a hotel to it, if you ride the same route every day at the same time. That would allow you to feel like the booth is actually your own.\n   * The easiest way to solve this without too much change in our public transport methods is to simply invest more in making it more comfortable, however simply making buses cleaner and more spaced wouldn't solve it like booths would.\n* Social status- You would say that its not important, but for people it is. A car is the easiest way to show wealth. That is why people invest money in coloring their cars, or on cars that are far too good for their needs. Even if you think this is superficial for the average person, that's not entirely true. Service providers (doctors, lawyers, etc') rely on their status symbols to show how successful they are, and use it to prove the quality of their services. This might not be a good thing but this is the truth (my father and most of his friends are doctors, I know a lot of lawyers, they all agree with this).\n   * That is another thing that would be solved by rent-able private booths. Instead of bragging about their awesome BMW, they would brag about their awesome gold booth in their morning bus route. \n   * Another way to deal with it is making priority seats in mainstream public transportation. People who pay get priority seating. \n* Special occasions- If you don't have a car, any of those things can be a problem for you: A bus drivers strike. An injury that prevents you from reaching the closest station. A trip outside the city. A natural disaster. An emergency situation that requires your to leave ASAP. By owning a private car, you don't rely on anyone or anything to move around. You are completely independent. \n   * There really is no way to solve this with public transportation as we know today that I can think of. Suggestions would be welcome.\n* Safety- Chances of being robbed, pick pocketed, assaulted, etc' on public transportation are much larger. Public transportation is also scary for many people, especially children, at nighttime. \n   * Another thing that can be solved by private booths.\n   * Can also be solved by increased security in public transportation, either with cameras or actual security guards inside buses and subways and trains.\n* Time- in places where traffic is not that bad (like my city), and where finding a parking spot doesn't take more than 5 minutes, driving a car is almost always better than using public transportation. In a car you always take the shortest path, you don't stop anywhere, and you usually drive above the speed limit (don't kill me, its true. I thought it wasn't until I started learning to drive, but driving in the speed limit makes people honk).\n   * This can easily be solved by simply making public transportation better. Make payments faster to reduce stop time, increases connectivity, increase speed, and you make public transport a better option time wise.\n* Money- While public transportation does not require a large one time investment, over time it can get pretty close to the price of a car. Ill run the calculation for myself. My parents have agreed to buy me a car when I get my license, and my choice is probably gonna be a Citroen C3. Taking in count average drive distance per day, fuel consumption of the C3 and current fuel prices, I ended up with about 2 NIS per day for fuel. The initial price is about 80,000 NIS (blame insane automobile taxes in Israel). Warranty is for 5 years and after that we will probably sell because its french car. Used C3s should sell for around 50,000NIS or so in 5 years, so that would make the total 5-year cost of the car 33,650 NIS. On average, I take a bus 4 times a day, and it costs about 6 NIS (changes sometimes). In 5 years, that would become 10,900NIS. So my saving is about 20,000 NIS in 5 years, equivalent to about 5,500$ or 4600 euro, or about 1100$ per year. For me (and my parents), that is totally worth the benefits. Also have in mind that my transport trips are usually home-&gt;school, school-&gt;home, home-&gt;somewhere somewhere-&gt;home. Adults with responsibilites probably have to use buses much more, to buy groceries, do other arrangements, etc'. So for them it could be even more profitable to use a car in the long term.\n   * The only way to solve this is to make cars not worth the additional investment. That can be done by solving the other concerns I have talked about already. Making public transportation cheaper would also probably work, but that would require more taxes so its pretty much the same.\n\n&amp;#x200B;\n\nA lot of the suggestions here would harm the efficiency and equality of public transportation, but I think the benefits they give to people, and the benefits getting rid of cars would give to society are worth it. However, I made this post to get feedback. What do you think? Should we try to act to solve those disadvantages of public transport? And what do you think about my suggestions?\n\n&amp;#x200B;\n\nHome you enjoyed reading.",
        "created_utc": 1535489914,
        "upvote_ratio": ""
    },
    {
        "title": "How the Dutch created a casual biking culture",
        "author": "CyclingIsLove",
        "url": "https://www.vox.com/science-and-health/2018/8/28/17789510/bike-cycling-netherlands-dutch-infrastructure",
        "text": "",
        "created_utc": 1535486025,
        "upvote_ratio": ""
    },
    {
        "title": "ABC News in D.C. Calls Dead Pedestrians “Lazy”",
        "author": "Eurynom0s",
        "url": "https://usa.streetsblog.org/2018/08/28/abc-news-in-washington-calls-7-dead-pedestrians-lazy/",
        "text": "",
        "created_utc": 1535479792,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone point me to the basics of housing financing?",
        "author": "SilverCyclist",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9b11uo/can_someone_point_me_to_the_basics_of_housing/",
        "text": "To be more clear about what I'm asking, here's the question I should know the answer to and what i'm trying to figure out. \n\n&amp;#x200B;\n\n&gt;If I build a 20-unit building, and lets say it takes me about 5 years to pay back the investors. Why, after I've paid back the financiers, can't I take in endless years of rent from those 20 units? \n\n&amp;#x200B;\n\nIn my looking into housing policy, the thing I can't wrap my head around is why developers seem so cost-burdened on every project. At a certain point, wouldn't you have so many projects under your belt, generating substantial revenue over a 20 year period that you'd be able to leapfrog capital raising efforts? If so, why are so many LIH developers hemming and hawing over creating 25% LMI units? If the land is good, and we need housing, take the LIHTC and increase over the long-term. ",
        "created_utc": 1535478309,
        "upvote_ratio": ""
    },
    {
        "title": "Paris leads efforts to puncture Airbnb",
        "author": "Melle_Limule",
        "url": "https://www.politico.eu/article/airbnb-paris-france-leads-efforts-to-puncture/",
        "text": "",
        "created_utc": 1535476379,
        "upvote_ratio": ""
    },
    {
        "title": "I want to become a developer and was wondering if a Master in Planning would help? Any other degree suggestions?",
        "author": "OntarioYD1",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9b0lfa/i_want_to_become_a_developer_and_was_wondering_if/",
        "text": "[removed]",
        "created_utc": 1535475155,
        "upvote_ratio": ""
    },
    {
        "title": "Plans to Restrict New Roof Decks in San Francisco",
        "author": "meglomania",
        "url": "http://www.socketsite.com/archives/2018/08/plans-to-restrict-new-roof-decks-and-amenities-in-san-francisco.html",
        "text": "",
        "created_utc": 1535474750,
        "upvote_ratio": ""
    },
    {
        "title": "Parking requirements keep affordable housing at bay in Bellevue, Washington, near Seattle",
        "author": "CyclingIsLove",
        "url": "http://kuow.org/stories/this-developer-wants-to-build-affordable-housing-in-bellevue-parking-requirements-keep-him-out",
        "text": "",
        "created_utc": 1535473574,
        "upvote_ratio": ""
    },
    {
        "title": "Uber is Shifting Towards Bike Rides For Short City Trips",
        "author": "TheReelStig",
        "url": "https://qz.com/1371145/uber-is-shifting-towards-bike-rides-for-short-city-trips/",
        "text": "",
        "created_utc": 1535471243,
        "upvote_ratio": ""
    },
    {
        "title": "Further Education for Bike/Ped Planner?",
        "author": "Long_Thyme_No_See",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9azfdb/further_education_for_bikeped_planner/",
        "text": "[removed]",
        "created_utc": 1535466854,
        "upvote_ratio": ""
    },
    {
        "title": "If You Want Less Displacement, Build More Housing",
        "author": "chef_dewhite",
        "url": "https://www.citylab.com/equity/2018/08/if-you-want-less-displacement-build-more-housing/568714/?utm_content=edit-promo&amp;utm_source=facebook&amp;utm_medium=social&amp;utm_campaign=city-lab&amp;utm_term=2018-08-28T11%3A00%3A31",
        "text": "",
        "created_utc": 1535466274,
        "upvote_ratio": ""
    },
    {
        "title": "‘Rooting’ for Change",
        "author": "Urbanis",
        "url": "http://theprotocity.com/rooting-for-change/",
        "text": "",
        "created_utc": 1535450066,
        "upvote_ratio": ""
    },
    {
        "title": "Don't let anybody tell you streetcars are not real transit: Budapest edition",
        "author": "UUUUUUUUU030",
        "url": "https://www.theurbanist.org/2018/08/23/dont-let-anybody-tell-you-streetcars-are-not-real-transit-budapest-edition/",
        "text": "",
        "created_utc": 1535448513,
        "upvote_ratio": ""
    },
    {
        "title": "How Turkey’s lira crisis was written in Istanbul's skyline",
        "author": "echtalles",
        "url": "https://www.theguardian.com/cities/2018/aug/23/how-turkeys-lira-crisis-was-written-in-istanbuls-skyline",
        "text": "",
        "created_utc": 1535439684,
        "upvote_ratio": ""
    },
    {
        "title": "'Asmara is a jewel': but can Eritrea's modernising capital retain its charm?",
        "author": "RwordNword",
        "url": "https://www.theguardian.com/cities/2018/aug/28/asmara-is-a-jewel-but-can-eritreas-modernising-capital-retain-its-charm",
        "text": "",
        "created_utc": 1535439555,
        "upvote_ratio": ""
    },
    {
        "title": "Tired of Dirty Dishes and ‘Hacker Houses,’ Millennials Revamp Communal Living",
        "author": "n10w4",
        "url": "https://www.politico.com/magazine/story/2018/08/23/co-living-millennials-san-jose-what-works-219378",
        "text": "",
        "created_utc": 1535432518,
        "upvote_ratio": ""
    },
    {
        "title": "Visualizing/Maping the Spaces of NYC Subway Stations",
        "author": "Augwich",
        "url": "https://www.wired.com/story/3d-schematics-nyc-subway-stations?mbid=nl_082718_daily_list3_p2&amp;CNDID=44647402",
        "text": "",
        "created_utc": 1535416660,
        "upvote_ratio": ""
    },
    {
        "title": "The forgotten history of how automakers invented the crime of \"jaywalking\" - Vox - Pocket",
        "author": "n10w4",
        "url": "https://getpocket.com/explore/item/the-forgotten-history-of-how-automakers-invented-the-crime-of-jaywalking-816728195",
        "text": "",
        "created_utc": 1535405684,
        "upvote_ratio": ""
    },
    {
        "title": "Your city isn't changing as fast as you think",
        "author": "wheeler1432",
        "url": "https://www.strongtowns.org/journal/2018/8/27/your-city-isnt-changing-as-fast-as-you-think?utm_source=citylab-daily&amp;silverid=NDQzNDUwMDc5ODg5S0",
        "text": "",
        "created_utc": 1535400626,
        "upvote_ratio": ""
    },
    {
        "title": "Tall Highway Dividers",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9arxd8/tall_highway_dividers/",
        "text": "[deleted]",
        "created_utc": 1535397727,
        "upvote_ratio": ""
    },
    {
        "title": "Your City Isn't Changing as Fast as You Think",
        "author": "belmaktor",
        "url": "https://www.strongtowns.org/journal/2018/8/27/your-city-isnt-changing-as-fast-as-you-think",
        "text": "",
        "created_utc": 1535394126,
        "upvote_ratio": ""
    },
    {
        "title": "Lyft to permanently move pickups, dropoffs away from busy portion of Valencia Street - by j_rodriguez - August 27, 2018 - The San Francisco Examiner",
        "author": "midflinx",
        "url": "http://www.sfexaminer.com/lyft-permanently-move-pickups-dropoffs-away-busy-portion-valencia-street/",
        "text": "",
        "created_utc": 1535393575,
        "upvote_ratio": ""
    },
    {
        "title": "How Filtering Increases Housing Affordability",
        "author": "SongsAboutPlaces",
        "url": "https://www.planetizen.com/blogs/100293-how-filtering-increases-housing-affordability",
        "text": "",
        "created_utc": 1535389645,
        "upvote_ratio": ""
    },
    {
        "title": "A Chicago photographer put together a map project to teach people about the city's racialized urban form",
        "author": "isaacray",
        "url": "http://www.chicagomag.com/Chicago-Magazine/September-2018/Tonika-Johnson-Bridges-Neighborhoods-to-Break-Down-Walls-of-Segregation/",
        "text": "",
        "created_utc": 1535388284,
        "upvote_ratio": ""
    },
    {
        "title": "Here's a little guide I drew of the Chicago \"L\" series cars",
        "author": "[deleted]",
        "url": "https://i.redd.it/pxcirse1vni11.png",
        "text": "[deleted]",
        "created_utc": 1535386737,
        "upvote_ratio": ""
    },
    {
        "title": "Review: The Divided City",
        "author": "SongsAboutPlaces",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9aq7pz/review_the_divided_city/",
        "text": "[https://www.planetizen.com/blogs/100210-review-divided-city](https://www.planetizen.com/blogs/100210-review-divided-city) ",
        "created_utc": 1535385896,
        "upvote_ratio": ""
    },
    {
        "title": "As Cost of Living Rises and Wages Stagnate, Big City Freelancers Look to Small Cities",
        "author": "crabcakes110",
        "url": "https://slate.com/human-interest/2018/07/big-city-freelancers-look-to-small-cities-to-lower-cost-of-living.html",
        "text": "",
        "created_utc": 1535378188,
        "upvote_ratio": ""
    },
    {
        "title": "What's better, the urbanisation of one nation to one giant city or multiple cities that aren't as developed?",
        "author": "PeachDrinkz",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9aotj6/whats_better_the_urbanisation_of_one_nation_to/",
        "text": "&amp;#x200B;",
        "created_utc": 1535375617,
        "upvote_ratio": ""
    },
    {
        "title": "Urban population growth trends around the globe. Oceania is the place where the growth is reversing",
        "author": "ketodnepr",
        "url": "https://i.redd.it/ydmwhyhalmi11.png",
        "text": "",
        "created_utc": 1535371423,
        "upvote_ratio": ""
    },
    {
        "title": "What would cities look like if they were designed by mothers ?",
        "author": "liotier",
        "url": "https://www.theguardian.com/commentisfree/2018/aug/27/architects-diversity-cities-designed-mothers",
        "text": "",
        "created_utc": 1535367732,
        "upvote_ratio": ""
    },
    {
        "title": "University of Portland: Sky view factor",
        "author": "skyviewfactor",
        "url": "https://twitter.com/skyviewfactor/status/1033987086418886656",
        "text": "",
        "created_utc": 1535358627,
        "upvote_ratio": ""
    },
    {
        "title": "Living close to urban green spaces is associated with a decreased risk of breast cancer",
        "author": "craigslistPI",
        "url": "https://www.wellandgood.com/good-advice/breast-cancer-risk-factors-urban-green-space/",
        "text": "",
        "created_utc": 1535325151,
        "upvote_ratio": ""
    },
    {
        "title": "Applying to a masters right after undergrad",
        "author": "cl0in",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9aimp2/applying_to_a_masters_right_after_undergrad/",
        "text": "I’m planning to go right into a masters program in urban planning after get my undergrad degree (in GIS). A lot of the research I’ve been doing makes it seem that most people don’t get around to their MUP until some years after graduation. Is that common in this field? I’m wondering if my lack in practical experience will hinder my chances during the application process. ",
        "created_utc": 1535314678,
        "upvote_ratio": ""
    },
    {
        "title": "Human City Podcast",
        "author": "S_Tbone",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9aihq6/human_city_podcast/",
        "text": "Hey guys, I started a podcast on designing cities to be more human and thought some of you might be interested!    \n\nIt's called Human City and here is my [website](https://humancity.simplecast.fm/). Also [Stichter](https://www.stitcher.com/podcast/human-city) and [Itunes](https://itunes.apple.com/us/podcast/human-city/id1429389696?mt=2)\n\nDefinitely still a work in progress, I hope you find something interesting! Do you think I should change anything or go a certain direction? Your opinions are seriously seriously valuable.       ",
        "created_utc": 1535313641,
        "upvote_ratio": ""
    },
    {
        "title": "The 10 states with the best infrastructure in America",
        "author": "gh0bs",
        "url": "https://www.cnbc.com/2017/07/11/10-us-states-with-best-infrastructure-cnbc-top-states-for-business.html",
        "text": "",
        "created_utc": 1535303661,
        "upvote_ratio": ""
    },
    {
        "title": "Housing Authority Question (Section 8)",
        "author": "hakeemthememe",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9ah2ou/housing_authority_question_section_8/",
        "text": "I am trying to get a client into Section 8 housing. She is a senior who recently had her granddaughter left with due to neglect by the mother. \n\nI've heard there is a point system that Section 8 goes by. I'd like to learn more about that points system to do some leg work to strengthen my case for this family.  They should be placed high on the wait list due to the fact they are paying more that 50% of current rent and there is a senior and baby involved. \n\n&amp;#x200B;\n\n**Can anyone provide more information about this Section 8 points system or even better, provide a link to the entire assessment?** \n\n&amp;#x200B;\n\nThanks for any assistance. ",
        "created_utc": 1535303017,
        "upvote_ratio": ""
    },
    {
        "title": "'It's a comfortable city and it's a frightening city': West Birminghamians discuss homicide rate",
        "author": "blastr007",
        "url": "https://www.al.com/news/birmingham/index.ssf/2018/01/post_327.html",
        "text": "",
        "created_utc": 1535302972,
        "upvote_ratio": ""
    },
    {
        "title": "Herburbia coming to Charleston, SC!",
        "author": "Herb_Kowalski",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9ag4c7/herburbia_coming_to_charleston_sc/",
        "text": "[removed]",
        "created_utc": 1535295532,
        "upvote_ratio": ""
    },
    {
        "title": "The Other Side of “Broken Windows” - Blight Remediation is one of the most powerful and cheapest methods of crime reduction supported by science.",
        "author": "The_Great_Goblin",
        "url": "https://www.newyorker.com/books/page-turner/the-other-side-of-broken-windows",
        "text": "",
        "created_utc": 1535295315,
        "upvote_ratio": ""
    },
    {
        "title": "Relevant...",
        "author": "colonelforbin97",
        "url": "https://i.redd.it/14e8cffagfi11.jpg",
        "text": "",
        "created_utc": 1535284749,
        "upvote_ratio": ""
    },
    {
        "title": "Violence in Cities Today",
        "author": "n10w4",
        "url": "http://www.smbc-comics.com/comic/this-town",
        "text": "",
        "created_utc": 1535281790,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting research on what brings people happiness in cities",
        "author": "guttpa18ar",
        "url": "https://www.createdigital.org.au/research-build-happiness-cities/",
        "text": "",
        "created_utc": 1535240412,
        "upvote_ratio": ""
    },
    {
        "title": "Making Rent in Silicon Valley",
        "author": "Mynameis__--__",
        "url": "https://www.youtube.com/watch?v=6dLo8ES4Bac",
        "text": "",
        "created_utc": 1535238229,
        "upvote_ratio": ""
    },
    {
        "title": "Should i transfer to urban planning?",
        "author": "Knyumuru",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9aav89/should_i_transfer_to_urban_planning/",
        "text": "Hey everyone, to my surpise i was accepted into architecture school in construction science and I was thrilled to be where i am at but the other major that the school offers is urban planning. Which is better in terms of pay and job opportunities? \n\nPlease, keep the answers on topic and not stray into things like follow your heart or say it depends.",
        "created_utc": 1535237119,
        "upvote_ratio": ""
    },
    {
        "title": "Urban planning in Amsterdam",
        "author": "MichaelPunkowski",
        "url": "https://youtu.be/0tN_orb7SGY",
        "text": "",
        "created_utc": 1535237006,
        "upvote_ratio": ""
    },
    {
        "title": "Million Dollar Shack: Trapped in Silicon Valley's Housing Bubble",
        "author": "Mynameis__--__",
        "url": "https://www.youtube.com/watch?v=SBjXUBMkkE8",
        "text": "",
        "created_utc": 1535235360,
        "upvote_ratio": ""
    },
    {
        "title": "Halle-Neustadt: Showcasing Both The Worst And Best Kind of Urban Planning",
        "author": "-jute-",
        "url": "https://www.youtube.com/watch?v=o5LyiPi2Lfs&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1535225023,
        "upvote_ratio": ""
    },
    {
        "title": "Newark Mayor Ras Baraka to Rip Out City’s First Protected Bike Lane",
        "author": "LOL-o-LOLI",
        "url": "https://usa.streetsblog.org/2014/12/19/newark-mayor-ras-baraka-to-rip-out-citys-first-protected-bike-lane/",
        "text": "",
        "created_utc": 1535221751,
        "upvote_ratio": ""
    },
    {
        "title": "Vote now: August r/urbanplanning contest",
        "author": "autobahnia",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9a788u/vote_now_august_rurbanplanning_contest/",
        "text": "[Original thread](https://www.reddit.com/r/urbanplanning/comments/93iyxx/august_rurbanplanning_contest_longer_better_and/)\n\n​\n\n\\+++ **Location** \\+++\n\nThe [Reseda neighborhood](https://en.wikipedia.org/wiki/Reseda,_Los_Angeles) in Los Angeles, California, USA.\n\nMore specifically all of the [area](https://www.google.com/maps/@34.1903885,-118.5316717,1096m) enclosed by Vanowen Street, Victory Boulevard, Reseda Boulevard and Lindley Avenue. That is one 0.5 x 0.5 mile square. As can be seen on the picture above.\n\n\\+++ **Scenario** \\+++\n\nA billionaire fan of [r/urbanplanning](https://www.reddit.com/r/urbanplanning), who also happens to be imaginary, just bought a quarter square mile of land in Reseda. He is ripping everything down and starting from scratch. He wants you all to present your ideas for this new quarter.\n\nThe new quarter should be sustainable and open to everyone. It should be a present to the world. Think about how you are going to connect it to the rest of the city with public transportation. Money isn't that much of an issue, so make it nice, but don't go overboard. Maybe even suggest some buildings.\n\nThe canal that runs through this block is part of the [LA River](https://en.wikipedia.org/wiki/Los_Angeles_River). You can get rid of the concrete canalization or beautify the banks however much you want. However, changing the general path of the river is not allowed. Please be aware that this stream turns from a small brook to a [raging river during rain storms](https://www.youtube.com/watch?v=9FgRevINLIQ).\n\n\\+++ **Vote** \\+++\n\nJust upvote the submission that you like best in the comments (under VOTE HERE).\n\n\\+++ **Other** \\+++\n\nYou can also have a look at [my idea](https://imgur.com/a/4wKqjCA) for this months contest, but can not vote on it, since I started this contest. Interestingly this idea is already a couple of years old and probably the main inspiration to start this contest.\n\nAfter this contest ran much longer than the [first one](https://www.reddit.com/r/urbanplanning/comments/90i5tc/first_ever_rurbanplanning_contest/), I expected more submissions. Unfortunately only two submissions came in. The idea to create a contest was welcomed, but it does not seem to work yet. Do you have any suggestions?\n\n​",
        "created_utc": 1535207931,
        "upvote_ratio": ""
    },
    {
        "title": "When towns begin to die (aging population)",
        "author": "traveller256",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9a49fg/when_towns_begin_to_die_aging_population/",
        "text": "The fertility-rate where I live is between 1.57 and 1.7. While this is not an issue in larger cities, due to immigration, the smaller towns have literally began to disappear.\n\nIt is likely for the largest cities to maintain their current population and even see a small increase in it, but truth is that the smaller ones will dwindle over the next decades.\n\nThe house of the parents of a friend is located at a small town and devalued 12% over the past 5 years, as less and less people were willing to live there. Concurrently, housing in larger cities valued during tha same interval.\n\nIt leads to serious social and economical issues, with an aged population and severe shortages of workforce. The factory of the uncle of a friend had to hire engineers from Austria and Germany, as no one from the entire country applied for the positions.\n\nNo one wanted to move into a small town in tge countryside, even being paid more than they would make in a large city.\n\nWhile I have several other examples, I'll go straight to the discussions:\n\nHow do you people think that urban planning is related/affected by such issues? \n\nDo you people believe that planning policies might help change this?\n\nAnd how to adapt the small towns and large cities to the consequences of this? (Solutions, policies, etc)\n\nWhile I have my own answers and discussions about this, I'll refrain from writing them now because I'd rather see what others think about this.\n\nAnd while a small city or town might not look as glamorous as a metropolis, I've seem several ideas of urban design and planning being applied to them. The most extreme example being a cousin who owned a construction company and was hired by a billionaire to build an entire town in the middle of nowhere.\n\n\n\n",
        "created_utc": 1535172000,
        "upvote_ratio": ""
    },
    {
        "title": "Great video about density and affordability in Austin, Texas!!",
        "author": "KevinEleven007",
        "url": "https://www.youtube.com/watch?v=hA59Zr1Shbg",
        "text": "",
        "created_utc": 1535156847,
        "upvote_ratio": ""
    },
    {
        "title": "Will This New Investor Tax-Incentive Policy Avoid Mistakes of the Past?",
        "author": "MIIAIIRIIK",
        "url": "https://nextcity.org/features/view/will-this-new-investor-tax-incentive-policy-avoid-mistakes-of-the-past",
        "text": "",
        "created_utc": 1535149199,
        "upvote_ratio": ""
    },
    {
        "title": "Self-Driving Cars Won’t Save Cities - Here’s What Will",
        "author": "Mynameis__--__",
        "url": "https://www.youtube.com/watch?v=NM-odCvJdrI",
        "text": "",
        "created_utc": 1535145965,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good urban planning magazines?",
        "author": "Borkton",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9a0uqi/what_are_some_good_urban_planning_magazines/",
        "text": "I'm a journalist interested in writing about urban planning issues. What are some good magazines that publish articles? I know about CityLab and NextCity, but I'm looking for more. \n\nThanks ",
        "created_utc": 1535142235,
        "upvote_ratio": ""
    },
    {
        "title": "Why the term, \"inner\" city?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9a0r1p/why_the_term_inner_city/",
        "text": "[deleted]",
        "created_utc": 1535141484,
        "upvote_ratio": ""
    },
    {
        "title": "California Senate passes huge BART housing bill",
        "author": "chef_dewhite",
        "url": "https://sf.curbed.com/2018/8/24/17778648/ab-2923-bart-housing-senate-vote",
        "text": "",
        "created_utc": 1535140350,
        "upvote_ratio": ""
    },
    {
        "title": "Your Smartphone’s Storage Could Help Fuel the Future Smart City",
        "author": "holakase",
        "url": "https://globalcoinreport.com/smartphones-storage-fuel-the-future-smart-city/",
        "text": "",
        "created_utc": 1535139500,
        "upvote_ratio": ""
    },
    {
        "title": "Discuss: it's a generational failure that massive U.S. cities -- Houston, Los Angeles, Phoenix, Seattle -- have or are building light rail -- requiring stops at intersections -- when heavy rail would be more appropriate.",
        "author": "comments83820",
        "url": "https://www.reddit.com/r/urbanplanning/comments/99zlfd/discuss_its_a_generational_failure_that_massive/",
        "text": "Light rail is appropriate for crossing Milwaukee or Kansas City or Tucson (or for granular transit inside parts of big cities) -- it's not appropriate for crossing Los Angeles or Atlanta or Phoenix. We're building light rail instead of heavy rail in cities that need heavy rail, simply because of our insane construction costs. ",
        "created_utc": 1535133154,
        "upvote_ratio": ""
    },
    {
        "title": "Beautiful Chicago Architecture Captured At Night... Check This Out",
        "author": "[deleted]",
        "url": "https://youtu.be/NQt8tV8b4ic",
        "text": "[deleted]",
        "created_utc": 1535115410,
        "upvote_ratio": ""
    },
    {
        "title": "The Grid.",
        "author": "Engster510",
        "url": "https://i.imgur.com/o3krETR.jpg",
        "text": "",
        "created_utc": 1535113402,
        "upvote_ratio": ""
    },
    {
        "title": "Will cities un-annex failing suburbs?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/urbanplanning/comments/99wg3j/will_cities_unannex_failing_suburbs/",
        "text": "[deleted]",
        "created_utc": 1535108430,
        "upvote_ratio": ""
    },
    {
        "title": "The social ideology of the motorcar (or: are cars really better transporation means?)",
        "author": "[deleted]",
        "url": "http://unevenearth.org/2018/08/the-social-ideology-of-the-motorcar/",
        "text": "[deleted]",
        "created_utc": 1535102390,
        "upvote_ratio": ""
    },
    {
        "title": "Four Future Scenarios for the San Francisco Bay Area",
        "author": "Open_Thinker",
        "url": "https://www.spur.org/publications/spur-report/2018-08-22/four-future-scenarios-san-francisco-bay-area",
        "text": "",
        "created_utc": 1535089148,
        "upvote_ratio": ""
    },
    {
        "title": "Atlanta or Phoenix. At gunpoint, you have to pick one to live for the rest of your life. Which one and why?",
        "author": "comments83820",
        "url": "https://www.reddit.com/r/urbanplanning/comments/99s0sm/atlanta_or_phoenix_at_gunpoint_you_have_to_pick/",
        "text": "&amp;#x200B;",
        "created_utc": 1535064293,
        "upvote_ratio": ""
    },
    {
        "title": "Do We Need a New Theory and Name for \"Bike Lanes\"?",
        "author": "Eurynom0s",
        "url": "https://humantransit.org/2018/08/do-we-need-a-new-theory-and-name-for-bike-lanes.html",
        "text": "",
        "created_utc": 1535063735,
        "upvote_ratio": ""
    },
    {
        "title": "Resetting The Atlanta BeltLine’s Focus on Equitable Development",
        "author": "MIIAIIRIIK",
        "url": "https://nextcity.org/daily/entry/resetting-the-atlanta-beltlines-focus-on-equitable-development",
        "text": "",
        "created_utc": 1535063131,
        "upvote_ratio": ""
    },
    {
        "title": "Seattle will try modular housing to shelter homeless",
        "author": "MIIAIIRIIK",
        "url": "http://kuow.org/stories/could-modular-housing-help-tackle-homelessness",
        "text": "",
        "created_utc": 1535063097,
        "upvote_ratio": ""
    },
    {
        "title": "How different are urban planning and transit planning?",
        "author": "Bogggotano",
        "url": "https://www.reddit.com/r/urbanplanning/comments/99qplw/how_different_are_urban_planning_and_transit/",
        "text": "I was just wondering what were the differences between urban and transit planning? Are the career paths similar? What are the main differences?",
        "created_utc": 1535054661,
        "upvote_ratio": ""
    },
    {
        "title": "Transit ridership is falling in Charlotte. Could Lyft and Uber give it a boost?",
        "author": "midflinx",
        "url": "https://www.charlotteobserver.com/news/local/article217129035.html",
        "text": "",
        "created_utc": 1535049470,
        "upvote_ratio": ""
    },
    {
        "title": "Watching a real urban planner play Sim City is incredibly satisfying",
        "author": "wheeler1432",
        "url": "https://www.fastcompany.com/90221405/watching-a-real-urban-planner-play-simcity-is-incredibly-satisfying?utm_source=citylab-daily&amp;silverid=NDQzNDUwMDc5ODg5S0",
        "text": "",
        "created_utc": 1535038417,
        "upvote_ratio": ""
    },
    {
        "title": "Don’t Label Them Climate Change Refugees, Says a Louisiana Planner, They’re Pioneers",
        "author": "Common_Edge_Collab",
        "url": "http://commonedge.org/dont-label-them-climate-change-refugees-says-a-louisiana-planner-theyre-pioneers/",
        "text": "",
        "created_utc": 1535032112,
        "upvote_ratio": ""
    },
    {
        "title": "Any examples of present time depictions of a utopia that doesn't involve tall skyscrapers with lots of green space in between and flying cars?",
        "author": "victornielsendane",
        "url": "https://www.reddit.com/r/urbanplanning/comments/99m3xs/any_examples_of_present_time_depictions_of_a/",
        "text": "I have a dream of beginning to visualise our dream future cities without *only* focusing on technology. I think it can help us talk about how we want our cities to determine goals. ",
        "created_utc": 1535018842,
        "upvote_ratio": ""
    },
    {
        "title": "Do Australian cities need major governance reform?",
        "author": "bair-disc",
        "url": "https://www.foreground.com.au/politics/do-australian-cities-need-metropolitan-governments/",
        "text": "",
        "created_utc": 1535005470,
        "upvote_ratio": ""
    },
    {
        "title": "Are baby boomers proud of their legacy : a giant automobile dependent suburban America for millennials ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/urbanplanning/comments/99krrn/are_baby_boomers_proud_of_their_legacy_a_giant/",
        "text": "[removed]",
        "created_utc": 1535003104,
        "upvote_ratio": ""
    },
    {
        "title": "A railway map of Taco Bell restaurants across Austin, TX [X-post /r/austin]",
        "author": "HighwaySixtyOne",
        "url": "https://i.redd.it/7cpqc1egyoh11.jpg",
        "text": "",
        "created_utc": 1534991668,
        "upvote_ratio": ""
    },
    {
        "title": "Learning to Love a Humble Neighborhood",
        "author": "DoreenMichele",
        "url": "https://www.strongtowns.org/journal/2018/8/12/learning-to-love-a-humble-neighborhood",
        "text": "",
        "created_utc": 1534968802,
        "upvote_ratio": ""
    },
    {
        "title": "‘Addicts, crooks, thieves’: the campaign to kill Baltimore's light rail",
        "author": "Eurynom0s",
        "url": "https://www.theguardian.com/cities/2018/aug/22/addicts-crooks-thieves-the-campaign-to-kill-baltimores-light-rail",
        "text": "",
        "created_utc": 1534959061,
        "upvote_ratio": ""
    },
    {
        "title": "Free Biotech &amp; Longevity Livestream Panel",
        "author": "The_Syndicate_VC",
        "url": "https://www.reddit.com/r/urbanplanning/comments/99ezax/free_biotech_longevity_livestream_panel/",
        "text": "[removed]",
        "created_utc": 1534956613,
        "upvote_ratio": ""
    },
    {
        "title": "'Historic laundromat' owner files suit vs. San Francisco for delaying construction of 8-story tower",
        "author": "epic2522",
        "url": "https://missionlocal.org/2018/08/historic-laundromat-owner-files-suit-vs-san-francisco-for-delaying-construction-of-8-story-tower/",
        "text": "",
        "created_utc": 1534956442,
        "upvote_ratio": ""
    },
    {
        "title": "Nassau County, NY launches ride share service that shuttles passengers from their homes to transit stations and other destinations for $4.50 each way",
        "author": "gh0bs",
        "url": "https://www.nicebus.com/Passenger-Information/NiceLink",
        "text": "",
        "created_utc": 1534954191,
        "upvote_ratio": ""
    },
    {
        "title": "Skylines Youtuber covers real urban planning topics. This episode: Gentrification.",
        "author": "butterslice",
        "url": "https://www.youtube.com/watch?v=LdeirDrinWk",
        "text": "",
        "created_utc": 1534953844,
        "upvote_ratio": ""
    },
    {
        "title": "What Does A House Look Like?",
        "author": "belmaktor",
        "url": "https://marketurbanismreport.com/house-look-like/",
        "text": "",
        "created_utc": 1534949230,
        "upvote_ratio": ""
    },
    {
        "title": "Can these pre-fab modular apartments help house the homeless?",
        "author": "chefsinblack",
        "url": "https://www.fastcompany.com/90219330/can-pre-fab-shipping-container-apartments-house-the-homeless",
        "text": "",
        "created_utc": 1534945166,
        "upvote_ratio": ""
    },
    {
        "title": "Weekly /r/UrbanPlanning Open Thread - What are you up to, whats on your mind? August 22, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/urbanplanning/comments/99d7dm/weekly_rurbanplanning_open_thread_what_are_you_up/",
        "text": "Please use this thread to discuss whatever has been occupying your attention lately. It could be about something you read, something you're doing, or anything you're hoping to get some thoughts on.\n",
        "created_utc": 1534943436,
        "upvote_ratio": ""
    },
    {
        "title": "\"The mayor is offering no solutions to Lima's problems, he has no vision for the city and no criteria for how to run it.\"",
        "author": "Lacagada",
        "url": "https://www.usnews.com/news/world/articles/2018-08-20/critics-fault-mayor-for-limas-broken-public-transportation-system",
        "text": "",
        "created_utc": 1534943229,
        "upvote_ratio": ""
    },
    {
        "title": "North American vs Japanese Zoning: Using zoning to encourage efficient cities.",
        "author": "[deleted]",
        "url": "https://devonzuegel.com/post/north-american-vs-japanese-zoning",
        "text": "[deleted]",
        "created_utc": 1534907118,
        "upvote_ratio": ""
    },
    {
        "title": "The Bipartisan Cry of ‘Not in My Backyard’",
        "author": "[deleted]",
        "url": "https://www.nytimes.com/2018/08/21/upshot/home-ownership-nimby-bipartisan.html",
        "text": "[deleted]",
        "created_utc": 1534898910,
        "upvote_ratio": ""
    },
    {
        "title": "The Bipartisan Cry of ‘Not in My Backyard’",
        "author": "Eurynom0s",
        "url": "https://nyti.ms/2nTGJmn",
        "text": "",
        "created_utc": 1534898268,
        "upvote_ratio": ""
    },
    {
        "title": "Is There an Upside to New York City's L Train Shutdown?",
        "author": "nolandus",
        "url": "https://www.citylab.com/transportation/2018/08/new-york-citys-l-train-shutdown-might-not-be-so-terrible/568012/",
        "text": "",
        "created_utc": 1534895604,
        "upvote_ratio": ""
    },
    {
        "title": "South Carolina Park Looks To Uncover And Mend City's Segregated History",
        "author": "JSPD",
        "url": "https://www.forbes.com/sites/juansebastianpinto/2018/08/21/south-carolina-park-looks-to-uncover-and-mend-citys-segregated-history/#2139c367feda",
        "text": "",
        "created_utc": 1534889141,
        "upvote_ratio": ""
    },
    {
        "title": "how can urban planners and city governments fight housing segregation?",
        "author": "abovethesugar",
        "url": "https://www.reddit.com/r/urbanplanning/comments/996ral/how_can_urban_planners_and_city_governments_fight/",
        "text": "&amp;#x200B;",
        "created_utc": 1534883649,
        "upvote_ratio": ""
    },
    {
        "title": "Best American cities to live without a car ?",
        "author": "fuerskin",
        "url": "https://www.reddit.com/r/urbanplanning/comments/99600m/best_american_cities_to_live_without_a_car/",
        "text": "",
        "created_utc": 1534878360,
        "upvote_ratio": ""
    },
    {
        "title": "Planning in action: Staten Island removes three sub-divisions in hurricane bufferzone program; returning marshlands to Lower Bay Hudson River influence area",
        "author": "[deleted]",
        "url": "http://www.dailymail.co.uk/news/article-6083239/New-documentary-shows-demolition-three-Staten-Island-neighborhoods-affected-Superstorm-Sandy.html",
        "text": "",
        "created_utc": 1534873513,
        "upvote_ratio": ""
    },
    {
        "title": "Parking, Bike Lanes, &amp; Too Simple to Work",
        "author": "SilverCyclist",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9959s0/parking_bike_lanes_too_simple_to_work/",
        "text": "I'm wondering if someone can tell me why when you've got a road with two lanes in both directions (do you call that a 4 lane road?) and parking on the side, and they decide to add bike lanes with a road diet, that don't just put the parking in the middle? This seems to me to be the easiest, cheapest, and most logical option. \n\nHere's an image of what I mean in case my description was a bit meandering: [https://www.street-plans.com/wp-content/uploads/2015/10/Winooski\\_After\\_JulieCampolism.jpg](https://www.street-plans.com/wp-content/uploads/2015/10/Winooski_After_JulieCampolism.jpg)",
        "created_utc": 1534873339,
        "upvote_ratio": ""
    },
    {
        "title": "Opinion | What cities tell us about a nation’s health",
        "author": "rco2112",
        "url": "https://www.washingtonpost.com/news/theworldpost/wp/2018/08/21/urban-decay/?utm_term=.14716721ce62",
        "text": "",
        "created_utc": 1534870863,
        "upvote_ratio": ""
    },
    {
        "title": "The Bipartisan Cry of ‘Not in My Backyard’",
        "author": "crabcakes110",
        "url": "https://www.nytimes.com/2018/08/21/upshot/home-ownership-nimby-bipartisan.html?smid=fb-nytupshot&amp;smtyp=cur",
        "text": "",
        "created_utc": 1534863959,
        "upvote_ratio": ""
    },
    {
        "title": "Redesign Monument Avenue - 10K cash prizes",
        "author": "girlongrove",
        "url": "https://www.reddit.com/r/urbanplanning/comments/9933b2/redesign_monument_avenue_10k_cash_prizes/",
        "text": "Hi! I am involved in a indispinlary design studio and we are running a competition to help reimagine monument avenue in Richmond VA (known for confederate statues) . I thought some of you might want to enter, there is a entrance fee, but you can work in groups, with other designers, or other industries, or you can take it all on by yourself. Registration ends Sept 15th and submissions aren't due until DEC 1st. \n\nLink: [http://monumentavenuegdgd.com/national/](http://monumentavenuegdgd.com/national/)",
        "created_utc": 1534857794,
        "upvote_ratio": ""
    },
    {
        "title": "Urban walking isn’t just good for the soul. It could save humanity.",
        "author": "fouronenine",
        "url": "https://www.theguardian.com/commentisfree/2018/aug/21/urban-walking-save-humanity-understand-cities",
        "text": "",
        "created_utc": 1534850865,
        "upvote_ratio": ""
    },
    {
        "title": "Zaryadye Park | Urban Projects (Moscow, Russia)",
        "author": "urbanstories",
        "url": "https://youtu.be/qn5jCQ3Yrtw",
        "text": "",
        "created_utc": 1534838093,
        "upvote_ratio": ""
    }
]