[
    {
        "title": "Has the dissolution of California’s redevelopment agencies been a net positive or net negative to cities across the state?",
        "author": "All-things-urbanism",
        "url": "https://www.reddit.com/r/urbanplanning/comments/1110ogx/has_the_dissolution_of_californias_redevelopment/",
        "text": "I’m curious if there is any literature or anecdotal evidence as to whether Jerry Brown’s 2011 decision to dissolve RDAs across the state has had positive or negative impacts on the state as a whole.",
        "created_utc": 1676266894,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the benefits of Pedestrian only urban districts?",
        "author": "YuYuSayThatWrong",
        "url": "https://www.reddit.com/r/urbanplanning/comments/110vflb/what_are_the_benefits_of_pedestrian_only_urban/",
        "text": "I get the basics of low emissions, but what other benifits in particular does an urban environment gain from having pedestrian only districts?",
        "created_utc": 1676250187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Logic behind rear lot floor area.",
        "author": "civrx",
        "url": "https://www.reddit.com/r/urbanplanning/comments/110rjy6/logic_behind_rear_lot_floor_area/",
        "text": "Hi everyone. In a standard pre-war developed area with a street grid and mid-block alleys, what is the reasoning behind a maximum floor area on the rear half of the lot? I've heard that it is to make sure any accessory buildings are just that, clearly accessories to the primary dwelling, but why does that need to be the case? Why not allow a duplex behind a single family home if it can follow all other land use rules? Thanks.",
        "created_utc": 1676239255,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"The most expensive street in America gets the Eric Adams treatment: Past efforts to redesign Fifth Avenue in Manhattan have pitted high-end retailers against transportation advocacy groups\"",
        "author": "PrinceofMemes",
        "url": "https://www.politico.com/news/2023/02/12/fifth-avenue-eric-adams-new-york-00082380",
        "text": "",
        "created_utc": 1676238568,
        "upvote_ratio": 1.0
    },
    {
        "title": "2012, ATM Tramway \"Carrelli\", \"Siretto\" and Bus IRISBUS CityClass CURSOR",
        "author": "digitalmoviedv",
        "url": "https://youtu.be/FWWvw8iUCXE",
        "text": "",
        "created_utc": 1676233578,
        "upvote_ratio": 1.0
    },
    {
        "title": "2012, ATM Tramway \"Carrelli\", \"Siretto\" and Bus IRISBUS CityClass CURSOR",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1676233531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Public Permitting?",
        "author": "Patient-Device-1135",
        "url": "https://www.reddit.com/r/urbanplanning/comments/110p432/public_permitting/",
        "text": "I just started my internship in the public sector. Im extremely excited to get a grasp of things but I did notice that everything is permitting.\n\nIve had enough jobs in my life to know as the new internship I'll be getting the grunt work for a while (determinations, modifications, other admin stuff.) But I wanna ask, is all public planning, no matter how long you stay, high you get, just boil down to a life of endless permitting??\n\nIm not burnt out in my first internship, Im genuinely excited to continue, but I can see wanting more fufilling work than approving applications later in life? TIA",
        "created_utc": 1676233003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban Planner with a private firm vs public?",
        "author": "FloridaPlanner",
        "url": "https://www.reddit.com/r/urbanplanning/comments/110od1x/urban_planner_with_a_private_firm_vs_public/",
        "text": "Can anyone shed some light or tell me their experience working as a planner for a private consulting firm?\n\nI currently work in the public sector and love it, but wanting to know real world experience of what to expect and which firms are best in the private sector as a planner, and how your day to day, pay, stress level, and overall job satisfaction is.",
        "created_utc": 1676231083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Master Planning Process",
        "author": "theurbanplanning",
        "url": "https://www.reddit.com/r/urbanplanning/comments/110niza/master_planning_process/",
        "text": "[removed]",
        "created_utc": 1676228934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exclusion of Mobile Home Parks",
        "author": "art_osprey",
        "url": "https://www.reddit.com/r/urbanplanning/comments/110j3r0/exclusion_of_mobile_home_parks/",
        "text": "I'm on a planning commission working on UDO for a town in Kentucky. Our commission is open to apartments and low income housing and is in general a liberal, forward-thinking group. For background, our town is growing fast, and we're trying to prevent sprawl. \nThe majority of the commission wants to exclude manufactured home parks from the UDO. But, the town staff and the consultant they hired are pushing us to put manufactured home parks in the plan, particularly in rural areas. They said we're opening the town up for a lawsuit if we don't. Is that true? Nothing in Kentucky law says every town must allow MH parks. Other neighboring towns exclude them. \n\nSidenote: The commission is a group of volunteers. We're not as educated as our staff and consultant. Sometimes it feels like the staff &amp; consultant are just telling us what to do and don't tell us the full truth like wrt Kentucky state law re MH parks. We are confused.",
        "created_utc": 1676217828,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much of a threat is AI to the use of data science in urban planning?",
        "author": "ethan_g22",
        "url": "https://www.reddit.com/r/urbanplanning/comments/11047bd/how_much_of_a_threat_is_ai_to_the_use_of_data/",
        "text": "I wanna double major in urban studies in data science but idk if it's a good idea",
        "created_utc": 1676166994,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you feel about TIF’s for redevelopment?",
        "author": "palepunkbunny",
        "url": "https://www.reddit.com/r/urbanplanning/comments/1103bg9/how_do_you_feel_about_tifs_for_redevelopment/",
        "text": "I see the positive side, where it will help encourage and fund development, but have some doubts about how people living in an underdeveloped area benefit from this- will their rent costs still go up and this gentrification is still taking place? I’m just learning about the concept, so please correct me if any of my ideas are blatantly wrong lol",
        "created_utc": 1676164330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any city with mostly gothic architecture?",
        "author": "Youguess555",
        "url": "https://www.reddit.com/r/urbanplanning/comments/1100tu9/is_there_any_city_with_mostly_gothic_architecture/",
        "text": "Is there any city (anywhere) where most buildings are in gothic architecture? I'd love to visit it one day!",
        "created_utc": 1676157285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fort Wayne Electric Works: Excitement is Building!",
        "author": "MaxamillianStudio",
        "url": "https://youtu.be/pVQf9yp2Nv8",
        "text": "",
        "created_utc": 1676152842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some cities confront it head on: ‘Downtown … is not coming back’",
        "author": "SuccessfulOperation",
        "url": "https://www.seattletimes.com/seattle-news/politics/some-cities-confront-it-head-on-downtown-is-not-coming-back/",
        "text": "",
        "created_utc": 1676146249,
        "upvote_ratio": 1.0
    },
    {
        "title": "The affordable housing crisis will not be solved until the elitism in Urban Planning is addressed.",
        "author": "Retro-Digital-",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10zr32k/the_affordable_housing_crisis_will_not_be_solved/",
        "text": "I am an example of a working class person that left a blue state with density for a red state with suburban sprawl within the last three years. I left because i began to slowly realize a majority of the west coast has become locked out of reach to anyone who was not already grandfathered into a house/wealth, or had a career in tech. There was no future for me. I left for Florida because Florida has lower barrier of entry for me into a career and housing. My life has significantly improved since moving here.\n\nDespite the fact I represent a piece of a significant migration trend in America, my input as well as others like me on discussions often gets dismissed or laughed at because a lot of what we say come with the implication that some blue areas are actually some of the worst planned and least accessible areas in the country and that makes the orthodoxy common in urban planning circles upset. \n\n[almost all the fastest growing cities in the us are located in red states w](https://explodingtopics.com/blog/fastest-growing-cities) with “unwalkable” and “unsustainable” growth.\n\nUsually this is when someone comes with some triaged or dismissive answer that maintains the narrative within urban planning circles that blue states are better, but to those of us that are increasingly locked out of those areas these answers aren’t compelling. \n\nYou could all be very well correct in your assessment that sunbelt cities are soulless unwalkable glorified suburbs but when they are also the places growing the most and the only areas the middle class can afford to exist no one’s going to care about the walkability or urban fabric or transit or whatever of San Francisco or New York when housing in both cost millions of dollars. \n\nNo one is going to want to to vote to make their communities more like well planned mega blue cities when those same places represent the most out of reach for the working and middle clases.",
        "created_utc": 1676131881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dubai could get a 93-kilometer indoor cycling super highway",
        "author": "Stauce52",
        "url": "https://edition.cnn.com/travel/article/the-loop-urb-green-development-dubai-spc-intl/index.html?utm_medium=social&amp;utm_source=twCNN&amp;utm_content=2023-02-11T07%3A00%3A08&amp;utm_term=link",
        "text": "",
        "created_utc": 1676099115,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do we not build Houses/Housing complexes next to workplaces? (Losing sanity)",
        "author": "UtensukkerDeluxe",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10zanyt/why_do_we_not_build_houseshousing_complexes_next/",
        "text": "&amp;#x200B;\n\n(I have been losing my sanity over city and town design)\n\nAfter constantly commuting to work in a car, and Driving coworkers back home after company gatherings, I have started questioning why people put up with long commutes. I personally went with the closest workplace I could get (10 Min drive, and I still find that a pain in the ass) But some of my coworkers commute for 2 hours in one direction (Are they mentally insane ?). \n\nI'm wondering why we don't build Houses/Housing complexes next to or inside Factory/workplace areas and make some or all of these buildings exclusive to people that work there. \n\n(Would it not be better for Business if workplaces and living places were merged together instead of separate?)\n\nWould this not cause small stores, bars, cafes, and kiosks to open up next to these factories due to all the pedestrian traffic, and it becoming more inconvenient for the workers/residents of these places to go to Centralized supermarkets because they are no longer on their commute route but are instead a 30 min commute away (More convenient to go to your downstairs bazaar then drive for 30 min to your closest supermarket).\n\n(Would merging together living places and workplaces not make social life better?)\n\nAll your neighbours would be people you work with and know, and would there not be far more facilities to do things in, compared to suburbs/neighbourhoods where there's nothing, practically nothing?\n\n(would merging together Living places and workplaces not make public transit easier even in smaller cities/towns?)\n\nwould this not decrease the complexity of public transportation, public transit would no longer need to bring people from living places to workplaces, they just need to move people from place to place, creating a better flow(I think).\n\n(would building our Towns and cities more compact not be smarter land use?)\n\nAm I terribly misunderstanding city/Town design because I don't think public transit routes should be the first priority, but rather the placement of our living places and workplaces?",
        "created_utc": 1676085001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Video: Are Parking Lots Ruining Your City?",
        "author": "SaidTheMountain",
        "url": "https://youtu.be/vUhOFUQDLQk",
        "text": "",
        "created_utc": 1676081692,
        "upvote_ratio": 1.0
    },
    {
        "title": "The housing crisis is here to stay. Abandon all hope: help is not coming.",
        "author": "ricardoflanigano",
        "url": "https://rileyflanigan.substack.com/p/the-housing-crisis-is-here-to-stay",
        "text": "",
        "created_utc": 1676077661,
        "upvote_ratio": 1.0
    },
    {
        "title": "American Dream For Rent: Investors elbow out individual home buyers",
        "author": "SuccessfulOperation",
        "url": "https://www.ajc.com/american-dream/investor-owned-houses-atlanta/",
        "text": "",
        "created_utc": 1676070089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice from practitioners on nasty residents.",
        "author": "cihpdha",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10z3tp3/advice_from_practitioners_on_nasty_residents/",
        "text": "Hi, fellow public servants. \n\nIn my nearly 15 year career I have dealt with some real awful people but I've just been working on a plan where one resident is the nastiest person I have ever come across. Like outside of obvious evil people like dictators etc this woman maybe the worst person I have ever seen. How do you deal with some of these kind of people? What are your strategies for emotional resilience? Thanks",
        "created_utc": 1676065082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it Possible to Reject Car-Centricity in a Small Hot Island?",
        "author": "bahamabikerr",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10z25we/is_it_possible_to_reject_carcentricity_in_a_small/",
        "text": "[removed]",
        "created_utc": 1676061004,
        "upvote_ratio": 1.0
    },
    {
        "title": "eli5 speech of the city",
        "author": "livingorganism359451",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10z1cqf/eli5_speech_of_the_city/",
        "text": "Any resources welcome of course",
        "created_utc": 1676059115,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can urban planning help the homeless problem in cities?",
        "author": "1AngryBrotha",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10yzqqm/how_can_urban_planning_help_the_homeless_problem/",
        "text": "[removed]",
        "created_utc": 1676055299,
        "upvote_ratio": 1.0
    },
    {
        "title": "(serious) do I live in a food desert? I live two and a half miles away from the nearest grocery store.",
        "author": "MrLuigiMario",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10yyv3w/serious_do_i_live_in_a_food_desert_i_live_two_and/",
        "text": "I live in an urban area full of wealthy educated folks. Unfortunately, the nearest store with groceries, Target, Walmart, etc is two and a half miles away.\n\nI looked at the definition of a food desert and it was any urban area with grocery stores more than 1 mi away. So... Do I technically live in a urban food desert?",
        "created_utc": 1676053175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laws meant to densify our cities are creating urban sprawl instead (TL;DW below)",
        "author": "Kelcak",
        "url": "https://youtu.be/tntesk1KEj0",
        "text": "",
        "created_utc": 1676037547,
        "upvote_ratio": 1.0
    },
    {
        "title": "3 New magnetic daily/meal planners left. Just put on the fridge or metal wall. could be given away for free. Does anybody want to carry them off? Just PM me.",
        "author": "Famous-Ad-6482",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10ymbe6/3_new_magnetic_dailymeal_planners_left_just_put/",
        "text": " **3 New magnetic daily/meal planners left. Just put on the fridge or metal wall. could be given away for free. Does anybody want to carry them off? Just PM me.**",
        "created_utc": 1676020808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inquiries about GIS",
        "author": "nathanielpoh69",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10ykh2d/inquiries_about_gis/",
        "text": "Hi this is a continuation from a previous post I made on this sub [https://www.reddit.com/r/urbanplanning/comments/10uy0hc/i\\_have\\_some\\_inquiries\\_about\\_geographic/](https://www.reddit.com/r/urbanplanning/comments/10uy0hc/i_have_some_inquiries_about_geographic/)\n\nI have taken some of the advice you guys have kindly gave and I have some questions about how to find the necessary data and if so, how do I know the sources are reliable.\n\nI have tried out both QGIS and ArcGIS Pro and after using both, I find ArcGIS Pro to be much more user-friendly and superior imo, and regarding the question of finding the necessary data and knowing which sources are reliable, I am going in the direction of ArcGIS Pro",
        "created_utc": 1676017253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cobblestones VS asphalt speed bumps.",
        "author": "Projectrage",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10yi1r6/cobblestones_vs_asphalt_speed_bumps/",
        "text": "The city of Portland , OR is putting speed bumps everywhere to slow drivers, why not cobblestone them and remove asphalt streets? It would let water through, easily repairable and durable, look good, and not use oil. Why don’t U.S. cities do this?",
        "created_utc": 1676009723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Road Diets are bad now?",
        "author": "WildWildWestad",
        "url": "https://youtu.be/xol7-GAP7Xg",
        "text": "",
        "created_utc": 1676004737,
        "upvote_ratio": 1.0
    },
    {
        "title": "American Cars Are Getting Too Big For Parking Spaces",
        "author": "GloomyDiscussions",
        "url": "https://www.vice.com/en/article/y3pyzx/american-cars-are-getting-too-big-for-parking-spaces",
        "text": "",
        "created_utc": 1675994857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Highway Caps",
        "author": "guinessmcpenis",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10y903h/highway_caps/",
        "text": "Could someone please help me understand the value of highway cap proposals? Specifically in Atlanta. \n\nHow is the value measured and how is a cap better at increasing connectivity in a city vs other initiatives?\n \nThanks in advance for the help!",
        "created_utc": 1675983373,
        "upvote_ratio": 1.0
    },
    {
        "title": "You Get What You Tax For: How a Land Value Tax Can Help Us Build Prosperous Cities",
        "author": "Not-A-Seagull",
        "url": "https://actionlab.strongtowns.org/hc/en-us/articles/360053137172-You-Get-What-You-Tax-For-How-a-Land-Value-Tax-Can-Help-Us-Build-Prosperous-Places-",
        "text": "",
        "created_utc": 1675978752,
        "upvote_ratio": 1.0
    },
    {
        "title": "We made some planning themed Valentine's Day cards and hope you enjoy.",
        "author": "melodykramer",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10y4wvd/we_made_some_planning_themed_valentines_day_cards/",
        "text": "Hello, I write for a group civics blog in Chapel Hill and Carrboro, NC. We cover lots of planning issues and made a [group of funny planning-themed Valentine's Day cards](https://triangleblogblog.com/2023/02/09/we-made-you-some-valentines-day-cards-because-we-adure-you-chapel-hill-and-carrboro/). We hope you enjoy them.",
        "created_utc": 1675973699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another question about breaking into the job market",
        "author": "Enough_Stock",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10y4htz/another_question_about_breaking_into_the_job/",
        "text": "Hey everyone! I’m a urban planning student about to graduate with my BS in urban planning this spring. I’m currently in PHX, AZ however I’m willing to go most anywhere post grad.  \n\nWhat are some good entry level positions or areas to get work experience?  What’s something you wish you knew going into the job field of planning? If you up and moved for a job,how did you go about it? Once you pick up a job in a certain sector (transportation,housing) do you have to stick to it your whole career? \n\nThanks for giving me some time,I’ve looked over some past posts and taken some notes. \n\nBonus question: I have full sleeve tattoos,is that acceptable in planning culture or still something I need to keep covered at all times?\n\nThanks!",
        "created_utc": 1675972759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interview: The Depression-Era Home Owners Loan Corporation (HOLC) created the infamous \"residential security\" redlining maps. Historians recently discovered that it also refinanced loans for Black homeowners at similar rates to whites. Adding nuance and complexity to the history of redlining...",
        "author": "Shanedphillips",
        "url": "https://www.lewis.ucla.edu/2023/02/08/43-reexamining-redlining-with-todd-michney/",
        "text": "",
        "created_utc": 1675972732,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Florida Beat New York | People are leaving superstar blue cities and moving to red states",
        "author": "Hrmbee",
        "url": "https://www.theatlantic.com/ideas/archive/2023/02/florida-new-york-housing-population-republican-democrat/672994/",
        "text": "",
        "created_utc": 1675969001,
        "upvote_ratio": 1.0
    },
    {
        "title": "America’s Most Equitably Walkable City is … Cleveland?",
        "author": "TopMicron",
        "url": "https://usa.streetsblog.org/2023/02/07/americas-most-equitably-walkable-city-is-cleveland/",
        "text": "",
        "created_utc": 1675961909,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Glarus, WI - Little Switzerland with $46.2 Million in Tourism Revenue",
        "author": "TheCCDAuthority",
        "url": "/r/CreativeCities/comments/10xx2hm/new_glarus_wi_little_switzerland_with_462_million/",
        "text": "",
        "created_utc": 1675956194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could cargo trams be a good way to move goods around in a city?",
        "author": "msinf_738",
        "url": "https://v.redd.it/t3kamfxj42ha1",
        "text": "",
        "created_utc": 1675946149,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm getting a bachelors in Urban Studies. What is the best STEM major to complement this (double major)?",
        "author": "ethan_g22",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10xl9ii/im_getting_a_bachelors_in_urban_studies_what_is/",
        "text": "I've thought about GIS, geography, or data science, but data science is 100% the best option of those because I want versatility if I end up not choosing urban planning down the line. Are there're any other majors that would work? \nAlso, for context, the urban planning I'd be most concerned with would be environmental justice/sustainably, urban design, and transportation",
        "created_utc": 1675916729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wouldn't it make sense to halt new businesses from developing in a city?",
        "author": "sea_of_joy__",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10xkjfw/wouldnt_it_make_sense_to_halt_new_businesses_from/",
        "text": "Suppose that there is a city that's 1 square mile, and it's crowded with 5,000 people there. There are businesses there as well that employees 5,000 people. \n\nThere shouldn't be more businesses there. I realize that more businesses would increase the tax-base. However, if it had more businesses and more jobs, you're risking more congestions, and increased prices for real estate. \n\nInstead, the businesses should be encouraged to go to the surrounding cities if they're less dense, and/or if their jobs/housing ratio is lower (meaning that they have more houses to jobs in that town).",
        "created_utc": 1675914601,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you think Biden's \"Made in America\" policy for materials used in federal infrastructure projects will affect costs?",
        "author": "Endolithic",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10xfjot/how_do_you_think_bidens_made_in_america_policy/",
        "text": "Been reading a lot of discussion on Twitter about this new policy. Some are concerned that it'll further balloon the costs of transit projects, while some claim that most materials are sources from the USA right now anyway.\n\nThoughts? What might the short and long term consequences of this policy be?",
        "created_utc": 1675901375,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get a job in planning",
        "author": "Ok-Efficiency-7110",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10xa6yi/how_to_get_a_job_in_planning/",
        "text": "I’m currently studying my urban planning masters in the UK but I’m looking for a job for when I’ve finished in September (could be a graduate job I’m not fussy) but a lot need experience and with COVID it has been so difficult to find work experience. If anyone has any ideas on how to get work experience I’d love to hear them. The lack of job opportunities for me is making me less interested in a job in planning as the days go on. \n\nThanks",
        "created_utc": 1675889026,
        "upvote_ratio": 0.99
    },
    {
        "title": "Beyond Density and Supply: How to Guarantee the Affordability of New Housing",
        "author": "maximusrusticus",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10x9y7q/beyond_density_and_supply_how_to_guarantee_the/",
        "text": "Hello everyone, \n\nI know density and supply are the most common solution to the housing crisis today. I agree with it. However, consider a very small, scenic town that is surrounded by productive farmland that sustains that town or a federal nature preserve. Say, the town has the land capacity to build 200 new homes in its small-town city limits, but the demand for each lot with a mountain view is so great that even 200 new smaller homes or apartments will be unaffordable to the local teachers or farm workers. \n\nWhat are some policies somewhere in between density bonuses and literally scanning prospective buyers to require that they are local residents or members of the local workforce (this sounds illegal)? \n\nCan you constrain allowed uses (STRs, B&amp;Bs) and tighten residency requirements for these uses to the point you can contain the demand from nearby urban centers? Can you have income requirements to ensure new homes go to local workers? Can you forbid subdivisions of lots unless they are made to be affordable? \n\nI live in a small Oregon community that is undergoing a comprehensive planning process. The community is surrounded by prime farmland and primary forests, so the boundary is not expected to expand. People say they'd like to see new housing, but only if it is guaranteed to go to local residents who need it the most and do not presently have housing (farmworkers, public employees, etc.) They fear that any new housing will go to affluent second and third homeowners looking for a view. \n\nAny insights? Thank you.",
        "created_utc": 1675888446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Federal Agency Rejects Developer’s Report That Massive Grain Elevator Won’t Harm Black Heritage Sites | For the second time, the Army Corps of Engineers has reprimanded a Louisiana developer for its failure to offer an adequate assessment",
        "author": "Hrmbee",
        "url": "https://www.propublica.org/article/historic-preservation-louisiana-grain-elevator-greenfield",
        "text": "",
        "created_utc": 1675877171,
        "upvote_ratio": 1.0
    },
    {
        "title": "why do urbanists love europe?",
        "author": "ActTasty3350",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10wzud1/why_do_urbanists_love_europe/",
        "text": "[removed]",
        "created_utc": 1675869579,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Ball Protects Skyscrapers From Earthquakes",
        "author": "ilovepizza1183",
        "url": "https://www.youtube.com/watch?v=kPEee_lJxlU",
        "text": "",
        "created_utc": 1675861917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anne Hidalgo Hates Paris",
        "author": "Humble_Intention_897",
        "url": "https://pedestrianobservations.com/2023/02/08/anne-hidalgo-hates-paris/",
        "text": "",
        "created_utc": 1675859866,
        "upvote_ratio": 1.0
    },
    {
        "title": "How big is the impact of cars idling at traffic lights on the development of smog?",
        "author": "waitWhoAm1",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10wn66m/how_big_is_the_impact_of_cars_idling_at_traffic/",
        "text": "Most drivers seem to enjoy the constant humming or still believe the myth of engine deprecation or fuel consumption spikes by frequent starting cycles.\n\nBut in cities with severe smog, could encouraging/enforcing switching off the engine at red lights do something to improve the pollution situation?",
        "created_utc": 1675830249,
        "upvote_ratio": 1.0
    },
    {
        "title": "22 year old considering Urban planning",
        "author": "Live_Natural_7515",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10wleth/22_year_old_considering_urban_planning/",
        "text": "Hey. I'm a 22 year old Australian who finished a Bachelor of Commerce, majoring in International Business degree. However, still feeling lost and unsure of my career path, i'm thinking of altering it towards urban planning. I could possibly do a masters in this. Would that be best? Also, would my prior degree be worthless do you think in my career? Do you think it's too late to get into it if I was to wait a year? So many people my age would already be entering the workforce now. Thankyou, just feeling lost and interested to hear of some people in the industry.",
        "created_utc": 1675825199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practicing planners in the public sector, do you live where you work?",
        "author": "butt_muncher5407",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10wgn6u/practicing_planners_in_the_public_sector_do_you/",
        "text": "[removed]",
        "created_utc": 1675812360,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you differentiate between open spaces and green spaces?",
        "author": "ukulelefox25",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10wg8ck/how_would_you_differentiate_between_open_spaces/",
        "text": "Some people like to consider each term as a variation from one another, others consider them to be similar or exact, and others have never ventured into the term. How would you define and differentiate open space and green space?\n\nIf they're not similar what are defining features that separate the two?",
        "created_utc": 1675811340,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get experience/internships without currently studying urban planning?",
        "author": "Calvin805",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10wfkow/how_do_i_get_experienceinternships_without/",
        "text": "I am currently a junior majoring in Econ&amp;Accounting. I am very interested in the planning field since discovering people like NJB and others I feel like it would be a fulfilling career that I would be good at. The issue is my Uni doesn't offer any really any urban planning classes besides adjacent classes like (Transport. Planning/ Modeling, arcGIS courses, some architecture planning classes (emphasis on architecture), and some environmental land use classes). I have been applying to planning internships but I don't see much hope with my current qualifications. Any advice to boost resume or easy internship opportunities to get started? Thanks",
        "created_utc": 1675809740,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello! Does anyone know about panama's urban planning system?",
        "author": "sintinte",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10wekpj/hello_does_anyone_know_about_panamas_urban/",
        "text": "[removed]",
        "created_utc": 1675807362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello! Does anyone know about panama's urban planning system?",
        "author": "sintinte",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10weiyg/hello_does_anyone_know_about_panamas_urban/",
        "text": "[removed]",
        "created_utc": 1675807251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello! Does anyone know abour panama's urban planning system?",
        "author": "sintinte",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10wehel/hello_does_anyone_know_abour_panamas_urban/",
        "text": "[removed]",
        "created_utc": 1675807169,
        "upvote_ratio": 1.0
    },
    {
        "title": "email addresses and phone numbers for AZ State Senators on Senate Commerce Committee who will hold hearing tomorrow on a bill to raise height limits in multifam zones, allow SROs, allow smaller lots. shoutout to tempe yimby",
        "author": "dawszein14",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10wdzky/email_addresses_and_phone_numbers_for_az_state/",
        "text": " Sen. Steve Kaiser (Chair), [skaiser@azleg.gov](mailto:skaiser@azleg.gov) 602-926-3314  \n Sen. Frank Carroll (Vice-Chair), [fcarroll@azleg.gov](mailto:fcarroll@azleg.gov) 602-926-3249  \n Sen. Theresa Hatathlie, [thatathlie@azleg.gov](mailto:thatathlie@azleg.gov) 602-926-5160  \n Sen. Anna Hernandez, [anna.hernandez@azleg.gov](mailto:anna.hernandez@azleg.gov) 602-926-3492   \n Sen. Anthony Kern, [akern@azleg.gov](mailto:akern@azleg.gov) 602-926-3497  \n Sen. J.D. Mesnard, [jmesnard@azleg.gov](mailto:jmesnard@azleg.gov) 602-926-4481  \n Sen. Catherine Miranda, [cmiranda@azleg.gov](mailto:cmiranda@azleg.gov) 602-926-3413",
        "created_utc": 1675805955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Dating Harder in Car Dependent Cities?",
        "author": "Legitimate_Ebb3623",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10wdjm0/is_dating_harder_in_car_dependent_cities/",
        "text": "I'm a 24 year old guy working a remote job in a car-dependent city and as much I'd like to meet someone in person it feels exceptionally challenging. Despite being a pretty active person, I'll run into, maybe, one new girl once a week and usually its a one-off encounter where the girl will rarely text back. It seems dating apps, despite how much they suck with all the ghosting/breadcrumbing/catfishing, are still the best way to get dates.\n\nI'm wondering if urban planning/city culture has anything to do with this. I wonder if all that time I'm stuck in traffic, I could have been \"meeting cute\" on a cobblestone street or a train station.\n\nIs it different in dense/walkable cities like New York, Boston or European cities like Barcelona, Berlin, Amsterdam? Or do dating apps still reign supreme for adults after college? This is hardly a statistically accurate study but I would still love if people around the world could share their individual experiences!",
        "created_utc": 1675804906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suburbs Face Their First Deadline for New Transit-Oriented Zoning Law",
        "author": "platinumstallion",
        "url": "https://mass.streetsblog.org/2023/01/30/suburbs-face-their-first-deadline-for-new-transit-oriented-zoning-law/",
        "text": "",
        "created_utc": 1675793915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doing a High School Spoken Endorsement on NotJustBike's 'Orange Pill'",
        "author": "Nathan_fL4gs",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10w8tus/doing_a_high_school_spoken_endorsement_on/",
        "text": "[removed]",
        "created_utc": 1675793769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think AI will one day be able to write staff reports?",
        "author": "sshheelleeyy",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10w8cxp/do_you_think_ai_will_one_day_be_able_to_write/",
        "text": "I spend a painful amount of time as a planner writing staff reports for design reviews. I was thinking about the possibility of one day AI being able to take over this part of the job. What do you think?",
        "created_utc": 1675792693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creative City Developments - Angles Camp, California - Developed Tourism Around Frog Jump Jubilee and Base Jumping!",
        "author": "TheCCDAuthority",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10w61ps/creative_city_developments_angles_camp_california/",
        "text": "[removed]",
        "created_utc": 1675787247,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some lesser-known/unexpected jobs where a planning degree would be useful?",
        "author": "cupnoodle_enthusiast",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10w5m2o/what_are_some_lesserknownunexpected_jobs_where_a/",
        "text": "Typically, students go into an urban planning program with the goal of becoming a planner for a municipality, real estate firm, or consulting agency. \n\nAre there any unique or interesting career paths that students may not be aware of?\n\nI’ll start. I became an editor and journalist after graduating from my masters in urban planning program in 2020. I worked for a small digital publication that specialized in housing justice and community development issues with an audience of mainly practitioners. The pay was pretty low ($40k/yr starting) compared to what many municipal planners make, but I loved the work and it was completely remote. All my housing and urban planning knowledge really helped me understand terminology when interviewing public officials, activists, and nonprofit leaders.\n\nThen I became a researcher ($61k/yr) at a labor union where the research, data collection and analysis, and land record knowledge I gained through my planning school courses really helped me with the day to day responsibilities.",
        "created_utc": 1675786193,
        "upvote_ratio": 1.0
    },
    {
        "title": "In what instances would it be useful to do a PhD in planning?",
        "author": "Acceptable-Net-947",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10w4xp5/in_what_instances_would_it_be_useful_to_do_a_phd/",
        "text": "Title. What can that get you career wise that a Masters or even Bachelor's can't? Besides being able to teach at a college/university.",
        "created_utc": 1675784542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Preparing for Grad School",
        "author": "gsdboum",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10w446m/preparing_for_grad_school/",
        "text": "Hi everyone!\n\nI just graduated from undergrad in December and recently became interested in going to graduate school for urban planning. I'm interested mainly in housing and transportation. My aim is to attend grad school in fall 2024 and work in the meantime. I didn't take urban planning classes during my undergrad, but did work with R and creating datasets. I also learned about GIS but did not have first hand experience working with it. \n\nI have a year and a half gap to create my own curriculum, basically. I was wondering what y'all would recommend I do to prepare for getting a master's in urban planning? Any books I should read, websites I can find datasets to play with in R, GIS programs, etc. Any advice is welcome! Thanks!",
        "created_utc": 1675782507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solid video highlighting Transit Orientated Development worked best low density area with expected city growth",
        "author": "forgiveangel",
        "url": "https://www.youtube.com/watch?v=HYyWxxdwNJc",
        "text": "",
        "created_utc": 1675774859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Entry Level Planning Technician",
        "author": "bwitdoc",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10vt7m0/entry_level_planning_technician/",
        "text": "I received the opportunity to interview for a local city government as a Planning Technician. I currently work in the Building Department of a different jurisdiction, in a different state. \n\nWhat advice might you offer to really nail the interview? Should I try to study their local ordinance or just try to gain the understanding of planning basics? \n\nThere is also a test before the interview that will be done over zoom asking questions about the position and technical capabilities, both in multiple choice and written answers. What advice do you have to help me study for this? \n\nI understand the planning basics of height, elevation, and location. I understand zoning clearances, minor use permits, etc. \n\nThanks in advance!",
        "created_utc": 1675746060,
        "upvote_ratio": 1.0
    },
    {
        "title": "submit written comment for WA State House's housing committee hearing on TOD bill - login to zoom via link from Dan Bertolet's twitter",
        "author": "dawszein14",
        "url": "https://app.leg.wa.gov/csi/Testifier/Add?chamber=House&amp;mId=30706&amp;aId=150945&amp;caId=21250&amp;tId=4",
        "text": "",
        "created_utc": 1675725173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning from Houston",
        "author": "psychothumbs",
        "url": "https://benjaminschneider.substack.com/p/learning-from-houston",
        "text": "",
        "created_utc": 1675718092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exxon’s Former Houston Headquarters Could Become a Residential High Rise",
        "author": "RogueDisciple",
        "url": "https://www.planetizen.com/news/2023/02/121477-exxons-former-houston-headquarters-could-become-residential-high-rise",
        "text": "",
        "created_utc": 1675712896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online Planning Masters programs???",
        "author": "No-Preparation7031",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10vfynp/online_planning_masters_programs/",
        "text": "In my two months as an intern at a private-sector planning business, I believe I have built valuable connections that will help me advance my career. Originally, I intended to apply to CU Denver's MURP, but I'm curious whether there's a reputable online program. Opinions and recommendations are much appreciated!",
        "created_utc": 1675712543,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Ball Protects Skyscrapers From Earthquakes",
        "author": "ilovepizza1183",
        "url": "https://youtu.be/kPEee_lJxlU",
        "text": "",
        "created_utc": 1675711874,
        "upvote_ratio": 1.0
    },
    {
        "title": "HB1207 Fast Track Permits Act. Arkansas State Legislature is trying to pass a law requiring developments to be approved or denied within 60 days or be automatically approved. How could this possibly go wrong??? /s",
        "author": "StudedRoughrider",
        "url": "https://www.arkleg.state.ar.us/Bills/Detail?id=HB1207&amp;ddBienniumSession=2023%2F2023R&amp;Search=",
        "text": "",
        "created_utc": 1675709238,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you really think of gentrification? My view is that it is unavoidable.",
        "author": "santgun",
        "url": "https://apropos.substack.com/p/on-gentrification",
        "text": "",
        "created_utc": 1675707566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Analysis: Public Overwhelmingly Supports Policy to Reduce Highway Emissions",
        "author": "doctorcaptain",
        "url": "https://www.americaisallin.com/analysis-public-overwhelmingly-supports-policies-reduce-highway-emissions",
        "text": "",
        "created_utc": 1675707557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Funniest Anti-Littering PSA ad. Trash Picking Samurai.",
        "author": "Classic-Apricot1207",
        "url": "https://youtu.be/VT-6S_ffjck",
        "text": "",
        "created_utc": 1675707252,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can one become an urban development consultant?",
        "author": "GodsThisLifeIsLong",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10vc21q/how_can_one_become_an_urban_development_consultant/",
        "text": "I'm going into the 3rd and final year of BA architecture in UK. However, I'm interested in urban planning and development. My real interest is in the research side of city making and it's policies but when it comes to a career I want one that is stable, has growth, and of course good pay. So I'm looking to work as an urban policy analyst or urban development consultant -- i understand law firms hire some if those for their real estate clients or something. \n\nSo my question is how can I enter this field as an BA Architecture undergraduate? And are there any specific skills/softwares you suggest I should learn over the next year that is relevant to this field?",
        "created_utc": 1675703638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yer Cizenler calls you to map earthquake effects in Southern Turkey",
        "author": "ParametricArch",
        "url": "https://parametric-architecture.com/yer-cizenler-calls-you-to-map-earthquake-effects-in-southern-turkey/",
        "text": "",
        "created_utc": 1675699612,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Manhattan high-rise that got chopped in half",
        "author": "LateToTheCuttingEdge",
        "url": "https://thehustle.co/the-manhattan-high-rise-that-shrunk-itself-down/?utm_source=Sunday&amp;utm_medium=email&amp;utm_campaign=NYC%20building&amp;utm_content=https://thehustle.co/the-manhattan-high-rise-that-shrunk-itself-down/&amp;utm_term=4ABCD",
        "text": "",
        "created_utc": 1675689328,
        "upvote_ratio": 1.0
    },
    {
        "title": "AICP May 2023",
        "author": "ketzmeifyoucan",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10v4yxl/aicp_may_2023/",
        "text": "Hey all! I'm currently studying for the AICP May 2023 deadline and am putting out feelers/looking for people doing the same who are interested in discussing topics and studying together for it. I'm currently living/working out of the EST zone (central/bluegrass KY).",
        "created_utc": 1675685130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Studies about paying people not to drive?",
        "author": "redct",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10v1pcq/studies_about_paying_people_not_to_drive/",
        "text": "One classic concept in behavioral economics is [framing](https://en.wikipedia.org/wiki/Framing_effect_(psychology\\)) - for example, people may prefer a gain to a loss, even if the end result is equivalent. Many techniques used to price the externalities of driving (e.g. congestion charging, tolls, a VMT tax) are framed as losses compared to the status quo of not being charged. \n\nAre there any studies out there that look at a potential opposite framing? For example, charging people higher yearly fees on vehicles and then refunding them for not driving? Or providing monetary rewards for using alternate modes of transport?",
        "created_utc": 1675672546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exploring Abandoned theater from the 1990s! With power!?",
        "author": "SOM3HOWiMANAGE",
        "url": "https://youtu.be/mMVaS_anD2A",
        "text": "",
        "created_utc": 1675664075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urban agriculture in walkable neighborhoods bore fruit for health and food system resilience during the COVID-19 pandemic",
        "author": "thinkB4WeSpeak",
        "url": "https://www.nature.com/articles/s42949-023-00083-3",
        "text": "",
        "created_utc": 1675661256,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have some inquiries about Geographic Information Systems(GIS)",
        "author": "nathanielpoh69",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10uy0hc/i_have_some_inquiries_about_geographic/",
        "text": "Hi guys, I am a university student currently pursuing a degree in urban planning and I was wondering which GIS software should I acquire and where can I get it? I trusts your preferences and experiences and am seeking recommendations here, peace out, guys.",
        "created_utc": 1675659210,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Planner’s-Eye View of the New California Housing Element Process—With new state laws and new voices of advocacy, planners are getting the tools to start going in different directions.",
        "author": "RemoveInvasiveEucs",
        "url": "https://medium.com/@sbjinsfo/a-planners-eye-view-of-the-housing-element-9688aa27a764",
        "text": "",
        "created_utc": 1675654861,
        "upvote_ratio": 1.0
    },
    {
        "title": "A skit on town planning I think you guys will appreciate...",
        "author": "Strategerium",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10uvt74/a_skit_on_town_planning_i_think_you_guys_will/",
        "text": "I love suburban living, but I am ok with a few laughs at my expense...\n\n[https://www.youtube.com/watch?v=BsxGeNn\\_jHg](https://www.youtube.com/watch?v=BsxGeNn_jHg)\n\nWhile many of these laugh lines are true, I am still unwilling to give up town planning done by temporary elected officials hiring out to generic contractors with no building specialties for anything higher than 3 floors.  At the very least, that system is responsive locally, cheap, and scales only at the growth of the town.\n\nBut, I think  a point stands, not everything has to be perfectly planned.  Too much planning at times feels like an alternative way for urbanism activists to reach behind closed doors and has a creeping social credit \"flavor\" to it.",
        "created_utc": 1675652466,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think about Honolulus urban core and design?",
        "author": "NylonYT",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10urnmk/what_do_you_think_about_honolulus_urban_core_and/",
        "text": "I never hear people talk about it so I was wondering what people outside hawaii think about honolulus road design, walkability, biking, bus and rail/transportation systems, etc and what people think about all the high rises over here.",
        "created_utc": 1675641328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a good video or podcast that explains the housing crisis in the US?",
        "author": "batsofburden",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10uqy8j/is_there_a_good_video_or_podcast_that_explains/",
        "text": "Just want to learn a bit more about why it's occurring. Articles would be ok too, but would prefer video or audio.",
        "created_utc": 1675639554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do You Guys Think That The United States is Ready For a Ban on Short Haul Flights?",
        "author": "Comer_Agua",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10up7z1/do_you_guys_think_that_the_united_states_is_ready/",
        "text": "I am asking this question because I have to prepare for my debate club at school so sorry if the question is stupid.",
        "created_utc": 1675635291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Washington D.C.'s free bus bill becomes law as zero-fare transit systems take off",
        "author": "Hrmbee",
        "url": "https://www.cnbc.com/2023/01/30/dc-free-bus-bill-becomes-law-zero-fare-transit.html",
        "text": "",
        "created_utc": 1675633081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canadian planners with a public administration degree",
        "author": "DIYPANDA07",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10uk4kn/canadian_planners_with_a_public_administration/",
        "text": "Is it useful to have a public administration degree for a planner who wishes to advance to senior/ managerial planning roles in the public sector? If it is useful, what do you learn in public administration that makes the degree useful?  \n\n\nFor context, I am working towards an undergrad in planning",
        "created_utc": 1675623136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good universitiy / lab in the realm of urban/spatial reasearch in NYC?",
        "author": "meeseeks1991",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10uivi6/good_universitiy_lab_in_the_realm_of_urbanspatial/",
        "text": "i'm trying to find interesting urban/spatial research labs in NYC. In particular id be interested in labs close to spatial data analysis, spatial modelling, network modelling, historical development. Im happy for other suggestions too:)",
        "created_utc": 1675620172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do basketball courts get banned because of racism, because they'll get busy, or both, or neither?",
        "author": "atlwellwell",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10ufoms/do_basketball_courts_get_banned_because_of_racism/",
        "text": "I've noticed in a lot of nice, upperclass neighorhoods, there will be a big, nice park area -- and it will have a playground for little kids, a baseball field, a tennis court, maybe a volleyball court, maybe some other things -- but curiously -- no basketball court.\n\nI don't think it's a hard and fast rule, because i've seen courts or half courts in nice hoods, too. And I tend to see racism in everything and think that is unfortunately the correct view to have in America and much of the world, but I do wonder what the current thinking is on this.\n\nAre basketball courts not installed, or ripped out, from varous neighborhoods because white people (by skin or otherwise) are afraid of black kids gathering, or because they worry about kids of any color gathering -- period, which can lead to noise and rowdiness and i'm sure crime of some type and/or fights or fighting and traffic and littering and whatever else.\n\nAnd, are the concerns about kids causing trouble of any kind warranted? I would guess 'yes', but I'm curious how much of a problem this is. Like, right now I live in a nice apartment complex in a nice hood and there are no basketball courts anywhere and there's a dog that keeps me up all night. I'd trade the dog for a basketball court any day -- sorry, rover.\n\nPoint is -- why aren't there more basketball courts?\n\nAnd, if kids actually gathering and using facility 'x' of any type is bad - b/c kids are kids - then what is the solution?\n\nMaybe make sure there is some small business or something that is open when the courts are open, so an adult can be around? Or make sure courts are not isolated, but instead are only located at community center-type places where adults will be hanging around? Or...\n\nWhat problems do I see being caused by the lack of basketball courts? Well....\n\n1. Lack of fairness to kids - possibly black kids in particular - who want to play basketball\n2. Lack of real options for kids who want to be active in some way. You can go to the court and shoot hoops by yourself for hours if you want - this is huge. It's difficult to impossiible to do this with soccer, tennis, volleyball, etc.\n3. Lack of a place to just hang out and do nothing - talk, flirt, watch others play, mess about, etc. I did a ton of this when I was a kid - we had some community-style courts - i can barely remember it now but i'm pretty sure it was great.\n4. Lack of ability for people of different backgrounds to chill with each other.\n\nCurious to hear from anyone - whether you are pro or against basketball or any other type of facility. \n\nThank you.",
        "created_utc": 1675612373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books on building construction",
        "author": "taro1020",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10uelpy/books_on_building_construction/",
        "text": "I'm looking for comprehensive books on construction that would talk about things like construction materials, methods, principles, vocabulary, etc. \n\nThere seems to be a lot of these books but I'm looking on recommendations on specific ones you found helpful and comprehensive. \n\nThanks!",
        "created_utc": 1675609576,
        "upvote_ratio": 1.0
    },
    {
        "title": "How likely it is to practice city planning in another country?",
        "author": "No-Veterinarian6153",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10udpe6/how_likely_it_is_to_practice_city_planning_in/",
        "text": "Hi everyone, i'm a city planning student in Canada, Montreal (almost done with my bachelor), and i was considering moving to Spain (Madrid or Barcelona). The thing being that i want to work as a city planner. \n\nEven if i'm able to speak in spanish, would it be hard for a Canadian to be recognize and accept to work for a spanish city / private firm?\n\nI'm curious to have a feedback about your experiences/knowledge.\n\nThanks everyone!",
        "created_utc": 1675607222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Construction productivity stagnation",
        "author": "ItinerantForester",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10ucu59/construction_productivity_stagnation/",
        "text": "[https://www.nytimes.com/2023/02/05/opinion/economy-construction-productivity-mystery.html](https://www.nytimes.com/2023/02/05/opinion/economy-construction-productivity-mystery.html)\n\nThis suggests an “all of the above” set of reasons, with particular focus on too many cooks in the kitchen. Anyone know of policy research happening that tries to separate out the ‘good‘ of community input from the drawbacks? I think California’s recent changes have made it so that communities clearly not operating in good faith can find themselves cut out of the role of gatekeeper entirely for a given project, maybe that’s helpful.",
        "created_utc": 1675604814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Examples of cities that have made driving more difficult on purpose?",
        "author": "anushka_ante_portas",
        "url": "https://www.reddit.com/r/urbanplanning/comments/10ub5by/examples_of_cities_that_have_made_driving_more/",
        "text": "Of course for a city to transition to a higher degree of mass transit use, taking mass transit has to be convenient. But I'm wondering about examples of cities that have successfully used a stick as well as a carrot— making driving less convenient, more expensive, etc., in order to make transit more attractive. Paris' upcoming through-traffic ban comes to mind, and I'm guessing parking fees in Copenhagen since every source I can find on driving in Copenhagen just says \"why would you bother?\" but I can't find a source that actually focuses on anti-car measures on their own and their efficacy or lack of it. Can anyone give me some other examples to look into?",
        "created_utc": 1675599456,
        "upvote_ratio": 1.0
    }
]